<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#33258;&#20027;&#31995;&#32479;&#20013;&#21152;&#36895;&#35270;&#39057;&#20998;&#26512;&#30340;&#25345;&#32493;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#36731;&#37327;&#32423;&#8220;&#23398;&#29983;&#8221;&#27169;&#22411;&#36827;&#34892;&#37096;&#32626;&#25512;&#29702;&#65292;&#21033;&#29992;&#26356;&#22823;&#30340;&#8220;&#25945;&#24072;&#8221;&#27169;&#22411;&#36827;&#34892;&#25968;&#25454;&#26631;&#35760;&#65292;&#23454;&#29616;&#23545;&#19981;&#26029;&#21464;&#21270;&#22330;&#26223;&#30340;&#25345;&#32493;&#33258;&#36866;&#24212;&#12290;</title><link>https://arxiv.org/abs/2403.14353</link><description>&lt;p&gt;
DaCapo&#65306;&#21152;&#24555;&#33258;&#20027;&#31995;&#32479;&#22312;&#35270;&#39057;&#20998;&#26512;&#20013;&#30340;&#25345;&#32493;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
DaCapo: Accelerating Continuous Learning in Autonomous Systems for Video Analytics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14353
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#33258;&#20027;&#31995;&#32479;&#20013;&#21152;&#36895;&#35270;&#39057;&#20998;&#26512;&#30340;&#25345;&#32493;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#36731;&#37327;&#32423;&#8220;&#23398;&#29983;&#8221;&#27169;&#22411;&#36827;&#34892;&#37096;&#32626;&#25512;&#29702;&#65292;&#21033;&#29992;&#26356;&#22823;&#30340;&#8220;&#25945;&#24072;&#8221;&#27169;&#22411;&#36827;&#34892;&#25968;&#25454;&#26631;&#35760;&#65292;&#23454;&#29616;&#23545;&#19981;&#26029;&#21464;&#21270;&#22330;&#26223;&#30340;&#25345;&#32493;&#33258;&#36866;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#35270;&#39057;&#20998;&#26512;&#23545;&#20110;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#12289;&#26080;&#20154;&#26426;&#65288;UAV&#65289;&#21644;&#23433;&#38450;&#26426;&#22120;&#20154;&#31561;&#33258;&#20027;&#31995;&#32479;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20854;&#26377;&#38480;&#30340;&#35745;&#31639;&#36164;&#28304;&#21644;&#30005;&#27744;&#21151;&#29575;&#65292;&#23454;&#38469;&#37096;&#32626;&#38754;&#20020;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25345;&#32493;&#23398;&#20064;&#21033;&#29992;&#22312;&#37096;&#32626;&#65288;&#25512;&#29702;&#65289;&#20013;&#30340;&#36731;&#37327;&#32423;&#8220;&#23398;&#29983;&#8221;&#27169;&#22411;&#65292;&#21033;&#29992;&#26356;&#22823;&#30340;&#8220;&#25945;&#24072;&#8221;&#27169;&#22411;&#23545;&#37319;&#26679;&#25968;&#25454;&#36827;&#34892;&#26631;&#35760;&#65288;&#26631;&#35760;&#65289;&#65292;&#24182;&#19981;&#26029;&#37325;&#26032;&#35757;&#32451;&#23398;&#29983;&#27169;&#22411;&#20197;&#36866;&#24212;&#19981;&#26029;&#21464;&#21270;&#30340;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14353v1 Announce Type: cross  Abstract: Deep neural network (DNN) video analytics is crucial for autonomous systems such as self-driving vehicles, unmanned aerial vehicles (UAVs), and security robots. However, real-world deployment faces challenges due to their limited computational resources and battery power. To tackle these challenges, continuous learning exploits a lightweight "student" model at deployment (inference), leverages a larger "teacher" model for labeling sampled data (labeling), and continuously retrains the student model to adapt to changing scenarios (retraining). This paper highlights the limitations in state-of-the-art continuous learning systems: (1) they focus on computations for retraining, while overlooking the compute needs for inference and labeling, (2) they rely on power-hungry GPUs, unsuitable for battery-operated autonomous systems, and (3) they are located on a remote centralized server, intended for multi-tenant scenarios, again unsuitable for
&lt;/p&gt;</description></item></channel></rss>