<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>HyperSense&#26159;&#19968;&#20010;&#21327;&#21516;&#35774;&#35745;&#30340;&#30828;&#20214;&#21644;&#36719;&#20214;&#31995;&#32479;&#65292;&#33021;&#22815;&#26681;&#25454;&#20256;&#24863;&#22120;&#25968;&#25454;&#20013;&#30340;&#29289;&#20307;&#23384;&#22312;&#39044;&#27979;&#26377;&#25928;&#22320;&#25511;&#21046;&#25968;&#25454;&#29983;&#25104;&#36895;&#29575;&#65292;&#36890;&#36807;&#20351;&#29992;&#20302;&#31934;&#24230;ADC&#20943;&#23569;&#20887;&#20313;&#25968;&#25454;&#38477;&#20302;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#25104;&#26412;&#65292;&#21033;&#29992;&#36229;&#32500;&#24230;&#35745;&#31639;&#30340;&#29305;&#28857;&#20998;&#26512;&#23454;&#26102;&#30340;&#20302;&#31934;&#24230;&#20256;&#24863;&#22120;&#25968;&#25454;&#65292;&#22312;&#22788;&#29702;&#22122;&#22768;&#12289;&#20197;&#20869;&#23384;&#20026;&#20013;&#24515;&#21644;&#23454;&#26102;&#23398;&#20064;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;&#35813;&#31995;&#32479;&#32467;&#21512;&#20102;&#39640;&#24615;&#33021;&#30340;&#29289;&#20307;&#26816;&#27979;&#36719;&#20214;&#21644;&#23454;&#26102;&#30340;&#30828;&#20214;&#39044;&#27979;&#65292;&#24341;&#20837;&#20102;&#26234;&#33021;&#20256;&#24863;&#22120;&#25511;&#21046;&#30340;&#26032;&#27010;&#24565;&#12290;&#22312;&#36719;&#20214;&#21644;&#30828;&#20214;&#35780;&#20272;&#20013;&#34920;&#29616;&#20986;&#21331;&#36234;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.10267</link><description>&lt;p&gt;
HyperSense: &#21152;&#36895;&#36229;&#32500;&#24230;&#35745;&#31639;&#20197;&#29992;&#20110;&#26234;&#33021;&#20256;&#24863;&#22120;&#25968;&#25454;&#22788;&#29702;
&lt;/p&gt;
&lt;p&gt;
HyperSense: Accelerating Hyper-Dimensional Computing for Intelligent Sensor Data Processing. (arXiv:2401.10267v1 [cs.AR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10267
&lt;/p&gt;
&lt;p&gt;
HyperSense&#26159;&#19968;&#20010;&#21327;&#21516;&#35774;&#35745;&#30340;&#30828;&#20214;&#21644;&#36719;&#20214;&#31995;&#32479;&#65292;&#33021;&#22815;&#26681;&#25454;&#20256;&#24863;&#22120;&#25968;&#25454;&#20013;&#30340;&#29289;&#20307;&#23384;&#22312;&#39044;&#27979;&#26377;&#25928;&#22320;&#25511;&#21046;&#25968;&#25454;&#29983;&#25104;&#36895;&#29575;&#65292;&#36890;&#36807;&#20351;&#29992;&#20302;&#31934;&#24230;ADC&#20943;&#23569;&#20887;&#20313;&#25968;&#25454;&#38477;&#20302;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#25104;&#26412;&#65292;&#21033;&#29992;&#36229;&#32500;&#24230;&#35745;&#31639;&#30340;&#29305;&#28857;&#20998;&#26512;&#23454;&#26102;&#30340;&#20302;&#31934;&#24230;&#20256;&#24863;&#22120;&#25968;&#25454;&#65292;&#22312;&#22788;&#29702;&#22122;&#22768;&#12289;&#20197;&#20869;&#23384;&#20026;&#20013;&#24515;&#21644;&#23454;&#26102;&#23398;&#20064;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;&#35813;&#31995;&#32479;&#32467;&#21512;&#20102;&#39640;&#24615;&#33021;&#30340;&#29289;&#20307;&#26816;&#27979;&#36719;&#20214;&#21644;&#23454;&#26102;&#30340;&#30828;&#20214;&#39044;&#27979;&#65292;&#24341;&#20837;&#20102;&#26234;&#33021;&#20256;&#24863;&#22120;&#25511;&#21046;&#30340;&#26032;&#27010;&#24565;&#12290;&#22312;&#36719;&#20214;&#21644;&#30828;&#20214;&#35780;&#20272;&#20013;&#34920;&#29616;&#20986;&#21331;&#36234;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;HyperSense&#65292;&#25105;&#20204;&#21327;&#21516;&#35774;&#35745;&#30340;&#30828;&#20214;&#21644;&#36719;&#20214;&#31995;&#32479;&#26681;&#25454;&#20256;&#24863;&#22120;&#25968;&#25454;&#20013;&#30340;&#29289;&#20307;&#23384;&#22312;&#39044;&#27979;&#26377;&#25928;&#22320;&#25511;&#21046;&#27169;&#25311;&#21040;&#25968;&#23383;&#36716;&#25442;&#22120;&#65288;ADC&#65289;&#27169;&#22359;&#30340;&#25968;&#25454;&#29983;&#25104;&#36895;&#29575;&#12290;&#38024;&#23545;&#19981;&#26029;&#22686;&#21152;&#30340;&#20256;&#24863;&#22120;&#25968;&#37327;&#21644;&#25968;&#25454;&#36895;&#29575;&#25152;&#24102;&#26469;&#30340;&#25361;&#25112;&#65292;HyperSense&#20351;&#29992;&#39640;&#25928;&#30340;&#20302;&#31934;&#24230;ADC&#20943;&#23569;&#20887;&#20313;&#30340;&#25968;&#23383;&#25968;&#25454;&#65292;&#38477;&#20302;&#20102;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#25104;&#26412;&#12290;&#21033;&#29992;&#31070;&#32463;&#21551;&#21457;&#30340;&#36229;&#32500;&#24230;&#35745;&#31639;&#65288;HDC&#65289;&#65292;HyperSense&#20998;&#26512;&#23454;&#26102;&#30340;&#21407;&#22987;&#20302;&#31934;&#24230;&#20256;&#24863;&#22120;&#25968;&#25454;&#65292;&#22312;&#22788;&#29702;&#22122;&#22768;&#12289;&#20197;&#20869;&#23384;&#20026;&#20013;&#24515;&#21644;&#23454;&#26102;&#23398;&#20064;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;HyperSense&#27169;&#22411;&#23558;&#39640;&#24615;&#33021;&#30340;&#29289;&#20307;&#26816;&#27979;&#36719;&#20214;&#19982;&#23454;&#26102;&#30340;&#30828;&#20214;&#39044;&#27979;&#32467;&#21512;&#36215;&#26469;&#65292;&#24341;&#20837;&#20102;&#26234;&#33021;&#20256;&#24863;&#22120;&#25511;&#21046;&#30340;&#26032;&#27010;&#24565;&#12290;&#20840;&#38754;&#30340;&#36719;&#20214;&#21644;&#30828;&#20214;&#35780;&#20272;&#23637;&#31034;&#20102;&#25105;&#20204;&#35299;&#20915;&#26041;&#26696;&#30340;&#21331;&#36234;&#24615;&#33021;&#65292;&#36890;&#36807;&#26368;&#39640;&#30340;&#26354;&#32447;&#19979;&#38754;&#31215;&#65288;AUC&#65289;&#21644;&#26368;&#38497;&#30340;&#25509;&#25910;&#22120;&#25805;&#20316;&#29305;&#24615;&#65288;ROC&#65289;&#26354;&#32447;&#35777;&#26126;&#20102;&#36825;&#19968;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Introducing HyperSense, our co-designed hardware and software system efficiently controls Analog-to-Digital Converter (ADC) modules' data generation rate based on object presence predictions in sensor data. Addressing challenges posed by escalating sensor quantities and data rates, HyperSense reduces redundant digital data using energy-efficient low-precision ADC, diminishing machine learning system costs. Leveraging neurally-inspired HyperDimensional Computing (HDC), HyperSense analyzes real-time raw low-precision sensor data, offering advantages in handling noise, memory-centricity, and real-time learning.  Our proposed HyperSense model combines high-performance software for object detection with real-time hardware prediction, introducing the novel concept of Intelligent Sensor Control. Comprehensive software and hardware evaluations demonstrate our solution's superior performance, evidenced by the highest Area Under the Curve (AUC) and sharpest Receiver Operating Characteristic (ROC
&lt;/p&gt;</description></item></channel></rss>