<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;ChatEDA&#65292;&#19968;&#20010;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;AutoMage&#36171;&#33021;&#30340;EDA&#33258;&#20027;&#20195;&#29702;&#65292;&#36890;&#36807;&#26377;&#25928;&#31649;&#29702;&#20219;&#21153;&#35745;&#21010;&#12289;&#33050;&#26412;&#29983;&#25104;&#21644;&#20219;&#21153;&#25191;&#34892;&#65292;&#31616;&#21270;&#20102;&#20174;RTL&#21040;GDSII&#30340;&#35774;&#35745;&#27969;&#31243;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#24615;&#33021;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2308.10204</link><description>&lt;p&gt;
ChatEDA&#65306;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#33258;&#20027;&#20195;&#29702;&#29992;&#20110;EDA
&lt;/p&gt;
&lt;p&gt;
ChatEDA: A Large Language Model Powered Autonomous Agent for EDA
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2308.10204
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;ChatEDA&#65292;&#19968;&#20010;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;AutoMage&#36171;&#33021;&#30340;EDA&#33258;&#20027;&#20195;&#29702;&#65292;&#36890;&#36807;&#26377;&#25928;&#31649;&#29702;&#20219;&#21153;&#35745;&#21010;&#12289;&#33050;&#26412;&#29983;&#25104;&#21644;&#20219;&#21153;&#25191;&#34892;&#65292;&#31616;&#21270;&#20102;&#20174;RTL&#21040;GDSII&#30340;&#35774;&#35745;&#27969;&#31243;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#24615;&#33021;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2308.10204v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;-&#20132;&#21449;&#25688;&#35201;&#65306;&#38598;&#25104;&#19968;&#31995;&#21015;&#22797;&#26434;&#30340;&#30005;&#23376;&#35774;&#35745;&#33258;&#21160;&#21270;&#65288;EDA&#65289;&#24037;&#20855;&#20197;&#22686;&#24378;&#20114;&#25805;&#20316;&#24615;&#26159;&#30005;&#36335;&#35774;&#35745;&#32773;&#20851;&#27880;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#26368;&#26032;&#36827;&#23637;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#29702;&#35299;&#26041;&#38754;&#30340;&#21331;&#36234;&#33021;&#21147;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#19982;EDA&#24037;&#20855;&#25509;&#21475;&#30340;&#26041;&#27861;&#12290;&#26412;&#30740;&#31350;&#35770;&#25991;&#20171;&#32461;&#20102;ChatEDA&#65292;&#19968;&#20010;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;AutoMage&#36171;&#33021;&#30340;EDA&#33258;&#20027;&#20195;&#29702;&#65292;&#32467;&#21512;&#20316;&#20026;&#25191;&#34892;&#22120;&#30340;EDA&#24037;&#20855;&#12290;ChatEDA&#36890;&#36807;&#26377;&#25928;&#31649;&#29702;&#20219;&#21153;&#35745;&#21010;&#12289;&#33050;&#26412;&#29983;&#25104;&#21644;&#20219;&#21153;&#25191;&#34892;&#65292;&#31616;&#21270;&#20102;&#20174;&#23492;&#23384;&#22120;&#20256;&#36755;&#32423;&#65288;RTL&#65289;&#21040;&#22270;&#24418;&#25968;&#25454;&#31995;&#32479;&#31532;&#20108;&#29256;&#65288;GDSII&#65289;&#30340;&#35774;&#35745;&#27969;&#31243;&#12290;&#36890;&#36807;&#20840;&#38754;&#30340;&#23454;&#39564;&#35780;&#20272;&#65292;ChatEDA&#24050;&#32463;&#35777;&#26126;&#20102;&#20854;&#22788;&#29702;&#21508;&#31181;&#38656;&#27714;&#30340;&#33021;&#21147;&#65292;&#25105;&#20204;&#32463;&#36807;&#31934;&#24515;&#35843;&#20248;&#30340;AutoMage&#27169;&#22411;&#22312;&#24615;&#33021;&#19978;&#34920;&#29616;&#20986;&#20248;&#36234;&#24615;&#65292;&#30456;&#36739;&#20110;GPT-4&#21644;&#20854;&#20182;&#31867;&#20284;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2308.10204v2 Announce Type: replace-cross  Abstract: The integration of a complex set of Electronic Design Automation (EDA) tools to enhance interoperability is a critical concern for circuit designers. Recent advancements in large language models (LLMs) have showcased their exceptional capabilities in natural language processing and comprehension, offering a novel approach to interfacing with EDA tools. This research paper introduces ChatEDA, an autonomous agent for EDA empowered by a large language model, AutoMage, complemented by EDA tools serving as executors. ChatEDA streamlines the design flow from the Register-Transfer Level (RTL) to the Graphic Data System Version II (GDSII) by effectively managing task planning, script generation, and task execution. Through comprehensive experimental evaluations, ChatEDA has demonstrated its proficiency in handling diverse requirements, and our fine-tuned AutoMage model has exhibited superior performance compared to GPT-4 and other simi
&lt;/p&gt;</description></item></channel></rss>