<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#36827;&#34892;IR&#24863;&#30693;&#30340;ECO&#26102;&#24207;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#38376;&#23610;&#23544;&#35843;&#25972;&#32416;&#27491;&#30001;IR&#38477;&#20302;&#24341;&#36215;&#30340;&#26102;&#24207;&#36864;&#21270;&#65292;&#24182;&#19988;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#22312;&#24615;&#33021;&#21644;&#36816;&#34892;&#26102;&#38388;&#19978;&#37117;&#20855;&#26377;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2402.07781</link><description>&lt;p&gt;
&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#36827;&#34892;IR&#24863;&#30693;&#30340;ECO&#26102;&#24207;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
IR-Aware ECO Timing Optimization Using Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07781
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#36827;&#34892;IR&#24863;&#30693;&#30340;ECO&#26102;&#24207;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#38376;&#23610;&#23544;&#35843;&#25972;&#32416;&#27491;&#30001;IR&#38477;&#20302;&#24341;&#36215;&#30340;&#26102;&#24207;&#36864;&#21270;&#65292;&#24182;&#19988;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#22312;&#24615;&#33021;&#21644;&#36816;&#34892;&#26102;&#38388;&#19978;&#37117;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26202;&#26399;&#38454;&#27573;&#30340;&#24037;&#31243;&#21464;&#26356;&#35746;&#21333;&#65288;ECOs&#65289;&#36890;&#36807;&#26368;&#23567;&#30340;&#35774;&#35745;&#20462;&#22797;&#26469;&#20174;&#36807;&#22810;&#30340;IR&#38477;&#20302;&#23548;&#33268;&#30340;&#26102;&#24207;&#20559;&#31227;&#20013;&#24674;&#22797;&#12290;&#26412;&#25991;&#23558;IR&#24863;&#30693;&#30340;&#26102;&#24207;&#20998;&#26512;&#21644;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#36827;&#34892;ECO&#26102;&#24207;&#20248;&#21270;&#30456;&#32467;&#21512;&#12290;&#35813;&#26041;&#27861;&#22312;&#29289;&#29702;&#35774;&#35745;&#21644;&#21151;&#32791;&#32593;&#26684;&#32508;&#21512;&#20043;&#21518;&#36816;&#34892;&#65292;&#24182;&#36890;&#36807;&#38376;&#23610;&#23544;&#35843;&#25972;&#32416;&#27491;&#30001;IR&#38477;&#20302;&#24341;&#36215;&#30340;&#26102;&#24207;&#36864;&#21270;&#12290;&#23427;&#23558;&#25289;&#26684;&#26391;&#26085;&#26494;&#24347;&#65288;LR&#65289;&#25216;&#26415;&#34701;&#20837;&#19968;&#31181;&#26032;&#39062;&#30340;RL&#26694;&#26550;&#20013;&#65292;&#35813;&#26694;&#26550;&#35757;&#32451;&#19968;&#20010;&#20851;&#31995;&#22270;&#21367;&#31215;&#32593;&#32476;&#65288;R-GCN&#65289;&#20195;&#29702;&#65292;&#25353;&#39034;&#24207;&#35843;&#25972;&#38376;&#23610;&#23544;&#20197;&#20462;&#22797;&#26102;&#24207;&#36829;&#35268;&#12290;R-GCN&#20195;&#29702;&#20248;&#20110;&#20256;&#32479;&#30340;&#20165;&#20351;&#29992;LR&#30340;&#31639;&#27861;&#65306;&#22312;&#24320;&#25918;&#24335;45nm&#24037;&#33402;&#20013;&#65292;&#23427;&#23558;&#24310;&#36831;-&#38754;&#31215;&#26435;&#34913;&#26354;&#32447;&#30340;&#24085;&#32047;&#25176;&#21069;&#27839;&#21521;&#24038;&#31227;&#21160;&#65292;&#24182;&#36890;&#36807;&#22312;&#31561;&#36136;&#37327;&#26102;&#20351;&#29992;&#35757;&#32451;&#27169;&#22411;&#36827;&#34892;&#24555;&#36895;&#25512;&#29702;&#65292;&#33410;&#30465;&#36816;&#34892;&#26102;&#38388;&#12290;RL&#27169;&#22411;&#21487;&#22312;&#26102;&#24207;&#35268;&#33539;&#38388;&#36716;&#31227;&#65292;&#24182;&#21487;&#36890;&#36807;&#38646;&#26679;&#26412;&#23398;&#20064;&#25110;&#24494;&#35843;&#22312;&#26410;&#35265;&#35774;&#35745;&#19978;&#36716;&#31227;&#12290;
&lt;/p&gt;
&lt;p&gt;
Engineering change orders (ECOs) in late stages make minimal design fixes to recover from timing shifts due to excessive IR drops. This paper integrates IR-drop-aware timing analysis and ECO timing optimization using reinforcement learning (RL). The method operates after physical design and power grid synthesis, and rectifies IR-drop-induced timing degradation through gate sizing. It incorporates the Lagrangian relaxation (LR) technique into a novel RL framework, which trains a relational graph convolutional network (R-GCN) agent to sequentially size gates to fix timing violations. The R-GCN agent outperforms a classical LR-only algorithm: in an open 45nm technology, it (a) moves the Pareto front of the delay-area tradeoff curve to the left and (b) saves runtime over the classical method by running fast inference using trained models at iso-quality. The RL model is transferable across timing specifications, and transferable to unseen designs with zero-shot learning or fine tuning.
&lt;/p&gt;</description></item></channel></rss>