<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;ChipGPT&#65292;&#19968;&#20010;&#33258;&#21160;&#21270;&#35774;&#35745;&#29615;&#22659;&#65292;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20174;&#33258;&#28982;&#35821;&#35328;&#35268;&#33539;&#29983;&#25104;&#30828;&#20214;&#36923;&#36753;&#35774;&#35745;&#65292;&#24182;&#23637;&#31034;&#20102;&#19982;&#20154;&#24037;&#35774;&#35745;&#24615;&#33021;&#30456;&#23218;&#32654;&#30340;&#32467;&#26524;&#65292;&#19988;&#21487;&#33410;&#30465;&#36229;&#36807;75&#65285;&#30340;&#32534;&#30721;&#26102;&#38388;&#12290;</title><link>http://arxiv.org/abs/2305.14019</link><description>&lt;p&gt;
ChipGPT: &#36828;&#31163;&#33258;&#28982;&#35821;&#35328;&#30828;&#20214;&#35774;&#35745;&#36824;&#26377;&#22810;&#36828;
&lt;/p&gt;
&lt;p&gt;
ChipGPT: How far are we from natural language hardware design. (arXiv:2305.14019v2 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14019
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;ChipGPT&#65292;&#19968;&#20010;&#33258;&#21160;&#21270;&#35774;&#35745;&#29615;&#22659;&#65292;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20174;&#33258;&#28982;&#35821;&#35328;&#35268;&#33539;&#29983;&#25104;&#30828;&#20214;&#36923;&#36753;&#35774;&#35745;&#65292;&#24182;&#23637;&#31034;&#20102;&#19982;&#20154;&#24037;&#35774;&#35745;&#24615;&#33021;&#30456;&#23218;&#32654;&#30340;&#32467;&#26524;&#65292;&#19988;&#21487;&#33410;&#30465;&#36229;&#36807;75&#65285;&#30340;&#32534;&#30721;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22914;ChatGPT&#23637;&#31034;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#26426;&#22120;&#26234;&#33021;&#65292;&#23427;&#22312;&#36890;&#36807;&#33258;&#28982;&#35821;&#35328;&#20132;&#20114;&#26469;&#21327;&#21161;&#30828;&#20214;&#24037;&#31243;&#24072;&#23454;&#29616;&#26356;&#39640;&#25928;&#30340;&#36923;&#36753;&#35774;&#35745;&#26041;&#38754;&#20063;&#34920;&#29616;&#20986;&#26497;&#20339;&#30340;&#24615;&#33021;&#12290;&#20026;&#20102;&#35780;&#20272;LLMs&#21327;&#21161;&#30828;&#20214;&#35774;&#35745;&#36807;&#31243;&#30340;&#28508;&#21147;&#65292;&#26412;&#25991;&#23581;&#35797;&#28436;&#31034;&#19968;&#20010;&#33258;&#21160;&#21270;&#35774;&#35745;&#29615;&#22659;&#65292;&#35813;&#29615;&#22659;&#21033;&#29992;LLMs&#20174;&#33258;&#28982;&#35821;&#35328;&#35268;&#33539;&#29983;&#25104;&#30828;&#20214;&#36923;&#36753;&#35774;&#35745;&#12290;&#20026;&#20102;&#23454;&#29616;&#26356;&#26131;&#29992;&#19988;&#26356;&#39640;&#25928;&#30340;&#33455;&#29255;&#24320;&#21457;&#27969;&#31243;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;LLMs&#30340;&#21487;&#25193;&#23637;&#30340;&#22235;&#38454;&#27573;&#38646;&#20195;&#30721;&#36923;&#36753;&#35774;&#35745;&#26694;&#26550;&#65292;&#26080;&#38656;&#37325;&#26032;&#35757;&#32451;&#25110;&#24494;&#35843;&#12290;&#39318;&#20808;&#65292;&#28436;&#31034;&#29256;&#26412;ChipGPT&#36890;&#36807;&#20026;LLM&#29983;&#25104;&#25552;&#31034;&#24320;&#22987;&#65292;&#28982;&#21518;&#20135;&#29983;&#21021;&#22987;Verilog&#31243;&#24207;&#12290; &#20854;&#27425;&#65292;&#36755;&#20986;&#31649;&#29702;&#22120;&#32416;&#27491;&#21644;&#20248;&#21270;&#36825;&#20123;&#31243;&#24207;&#65292;&#28982;&#21518;&#23558;&#23427;&#20204;&#25910;&#38598;&#21040;&#26368;&#32456;&#30340;&#35774;&#35745;&#31354;&#38388;&#20013;&#12290;&#26368;&#21518;&#65292;ChipGPT&#23558;&#22312;&#27492;&#31354;&#38388;&#20013;&#25628;&#32034;&#20197;&#36873;&#25321;&#31526;&#21512;&#30446;&#26631;&#25351;&#26631;&#30340;&#26368;&#20248;&#35774;&#35745;&#12290;&#35780;&#20272;&#34920;&#26126;&#65292;&#30001;ChipGPT&#35774;&#35745;&#30340;&#36923;&#36753;&#30005;&#36335;&#30340;&#24615;&#33021;&#19982;&#20154;&#24037;&#35774;&#35745;&#30340;&#24615;&#33021;&#30456;&#24403;&#65292;&#24182;&#19988;&#25972;&#20010;&#36807;&#31243;&#33410;&#30465;&#20102;&#36229;&#36807;75&#65285;&#30340;&#32534;&#30721;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
As large language models (LLMs) like ChatGPT exhibited unprecedented machine intelligence, it also shows great performance in assisting hardware engineers to realize higher-efficiency logic design via natural language interaction. To estimate the potential of the hardware design process assisted by LLMs, this work attempts to demonstrate an automated design environment that explores LLMs to generate hardware logic designs from natural language specifications. To realize a more accessible and efficient chip development flow, we present a scalable four-stage zero-code logic design framework based on LLMs without retraining or finetuning. At first, the demo, ChipGPT, begins by generating prompts for the LLM, which then produces initial Verilog programs. Second, an output manager corrects and optimizes these programs before collecting them into the final design space. Eventually, ChipGPT will search through this space to select the optimal design under the target metrics. The evaluation sh
&lt;/p&gt;</description></item></channel></rss>