<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>HEANA&#26159;&#19968;&#31181;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#21152;&#36895;&#22120;&#65292;&#36890;&#36807;&#20351;&#29992;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#20056;&#27861;&#22120;(TAOMs)&#25552;&#39640;&#20102;&#23545;&#22810;&#31181;&#25968;&#25454;&#27969;&#30340;&#28789;&#27963;&#24615;&#12290;&#23427;&#35299;&#20915;&#20102;&#29616;&#26377;&#20809;&#23398;&#21152;&#36895;&#22120;&#30340;&#27874;&#38271;&#24182;&#34892;&#24615;&#21463;&#21040;&#20018;&#25200;&#12289;&#19981;&#25903;&#25345;&#22810;&#31181;&#25968;&#25454;&#27969;&#20197;&#21450;&#26410;&#20805;&#20998;&#21033;&#29992;&#20809;&#30005;&#25506;&#27979;&#22120;&#36827;&#34892;&#21407;&#20301;&#32047;&#31215;&#31561;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.03247</link><description>&lt;p&gt;
HEANA: &#19968;&#31181;&#20855;&#26377;&#28789;&#27963;&#25968;&#25454;&#27969;&#30340;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#21152;&#36895;&#22120;&#65292;&#29992;&#20110;&#33021;&#37327;&#39640;&#25928;&#30340;CNN&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
HEANA: A Hybrid Time-Amplitude Analog Optical Accelerator with Flexible Dataflows for Energy-Efficient CNN Inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03247
&lt;/p&gt;
&lt;p&gt;
HEANA&#26159;&#19968;&#31181;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#21152;&#36895;&#22120;&#65292;&#36890;&#36807;&#20351;&#29992;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#20056;&#27861;&#22120;(TAOMs)&#25552;&#39640;&#20102;&#23545;&#22810;&#31181;&#25968;&#25454;&#27969;&#30340;&#28789;&#27963;&#24615;&#12290;&#23427;&#35299;&#20915;&#20102;&#29616;&#26377;&#20809;&#23398;&#21152;&#36895;&#22120;&#30340;&#27874;&#38271;&#24182;&#34892;&#24615;&#21463;&#21040;&#20018;&#25200;&#12289;&#19981;&#25903;&#25345;&#22810;&#31181;&#25968;&#25454;&#27969;&#20197;&#21450;&#26410;&#20805;&#20998;&#21033;&#29992;&#20809;&#30005;&#25506;&#27979;&#22120;&#36827;&#34892;&#21407;&#20301;&#32047;&#31215;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;HEANA&#30340;&#26032;&#22411;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#21152;&#36895;&#22120;&#65292;&#29992;&#20110;&#21152;&#36895;&#25972;&#25968;&#37327;&#21270;CNN&#30340;&#25512;&#29702;&#12290;HEANA&#37319;&#29992;&#28151;&#21512;&#26102;&#24133;&#27169;&#25311;&#20809;&#23398;&#20056;&#27861;&#22120;(TAOMs)&#65292;&#22686;&#24378;&#20102;HEANA&#23545;&#22810;&#31181;&#25968;&#25454;&#27969;&#30340;&#25903;&#25345;&#28789;&#27963;&#24615;&#12290;&#36890;&#36807;&#35889;&#26080;&#25439;&#30340;TAOMs&#25490;&#21015;&#65292;&#26377;&#25928;&#35299;&#20915;&#20102;&#29616;&#26377;&#20809;&#23398;&#21152;&#36895;&#22120;&#23384;&#22312;&#30340;&#27874;&#38271;&#24182;&#34892;&#24615;&#21463;&#21040;&#21508;&#31181;&#20018;&#25200;&#24433;&#21709;&#12289;&#26080;&#27861;&#25903;&#25345;&#22810;&#31181;&#25968;&#25454;&#27969;&#20197;&#21450;&#26410;&#20805;&#20998;&#21033;&#29992;&#20809;&#30005;&#25506;&#27979;&#22120;&#36827;&#34892;&#21407;&#20301;&#32047;&#31215;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Several photonic microring resonators (MRRs) based analog accelerators have been proposed to accelerate the inference of integer-quantized CNNs with remarkably higher throughput and energy efficiency compared to their electronic counterparts. However, the existing analog photonic accelerators suffer from three shortcomings: (i) severe hampering of wavelength parallelism due to various crosstalk effects, (ii) inflexibility of supporting various dataflows other than the weight-stationary dataflow, and (iii) failure in fully leveraging the ability of photodetectors to perform in-situ accumulations. These shortcomings collectively hamper the performance and energy efficiency of prior accelerators. To tackle these shortcomings, we present a novel Hybrid timE Amplitude aNalog optical Accelerator, called HEANA. HEANA employs hybrid time-amplitude analog optical multipliers (TAOMs) that increase the flexibility of HEANA to support multiple dataflows. A spectrally hitless arrangement of TAOMs s
&lt;/p&gt;</description></item></channel></rss>