<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#26412;&#32508;&#36848;&#35843;&#26597;&#20102;&#38754;&#21521;&#24322;&#26500;HPC&#24179;&#21488;&#30340;&#28145;&#24230;&#23398;&#20064;&#30828;&#20214;&#21152;&#36895;&#22120;&#65292;&#21253;&#25324;GPU&#12289;TPU&#12289;FPGA&#12289;ASIC&#12289;&#31070;&#32463;&#22788;&#29702;&#21333;&#20803;&#21644;RISC-V&#31561;&#65292;&#21516;&#26102;&#20063;&#28085;&#30422;&#20102;&#26032;&#20852;&#20869;&#23384;&#25216;&#26415;&#21644;&#35745;&#31639;&#33539;&#24335;&#12290;</title><link>http://arxiv.org/abs/2306.15552</link><description>&lt;p&gt;
&#38754;&#21521;&#24322;&#26500;HPC&#24179;&#21488;&#30340;&#28145;&#24230;&#23398;&#20064;&#30828;&#20214;&#21152;&#36895;&#22120;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
A Survey on Deep Learning Hardware Accelerators for Heterogeneous HPC Platforms. (arXiv:2306.15552v1 [cs.AR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#32508;&#36848;&#35843;&#26597;&#20102;&#38754;&#21521;&#24322;&#26500;HPC&#24179;&#21488;&#30340;&#28145;&#24230;&#23398;&#20064;&#30828;&#20214;&#21152;&#36895;&#22120;&#65292;&#21253;&#25324;GPU&#12289;TPU&#12289;FPGA&#12289;ASIC&#12289;&#31070;&#32463;&#22788;&#29702;&#21333;&#20803;&#21644;RISC-V&#31561;&#65292;&#21516;&#26102;&#20063;&#28085;&#30422;&#20102;&#26032;&#20852;&#20869;&#23384;&#25216;&#26415;&#21644;&#35745;&#31639;&#33539;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#28145;&#24230;&#23398;&#20064;&#22312;&#39640;&#24615;&#33021;&#35745;&#31639;&#65288;HPC&#65289;&#24212;&#29992;&#20013;&#65292;&#22914;&#22270;&#20687;&#20998;&#31867;&#12289;&#35745;&#31639;&#26426;&#35270;&#35273;&#21644;&#35821;&#38899;&#35782;&#21035;&#20013;&#25104;&#20026;&#30828;&#20214;&#21152;&#36895;&#22120;&#26368;&#21487;&#34892;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#32508;&#36848;&#24635;&#32467;&#21644;&#20998;&#31867;&#20102;&#35774;&#35745;&#28145;&#24230;&#23398;&#20064;&#21152;&#36895;&#22120;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#20197;&#28385;&#36275;HPC&#24212;&#29992;&#30340;&#24615;&#33021;&#35201;&#27714;&#12290;&#29305;&#21035;&#22320;&#65292;&#23427;&#24378;&#35843;&#20102;&#25903;&#25345;&#28145;&#24230;&#23398;&#20064;&#21152;&#36895;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#65292;&#21253;&#25324;&#19981;&#20165;&#38480;&#20110;&#22522;&#20110;GPU&#21644;TPU&#30340;&#21152;&#36895;&#22120;&#65292;&#36824;&#21253;&#25324;&#22522;&#20110;FPGA&#21644;ASIC&#30340;&#29305;&#23450;&#35774;&#35745;&#30340;&#30828;&#20214;&#21152;&#36895;&#22120;&#12289;&#31070;&#32463;&#22788;&#29702;&#21333;&#20803;&#12289;&#22522;&#20110;&#24320;&#25918;&#30828;&#20214;RISC-V&#30340;&#21152;&#36895;&#22120;&#21644;&#21327;&#22788;&#29702;&#22120;&#12290;&#26412;&#32508;&#36848;&#36824;&#25551;&#36848;&#20102;&#22522;&#20110;&#26032;&#20852;&#20869;&#23384;&#25216;&#26415;&#21644;&#35745;&#31639;&#33539;&#24335;&#30340;&#21152;&#36895;&#22120;&#65292;&#20363;&#22914;3D&#22534;&#21472;&#22788;&#29702;&#22120;&#20869;&#23384;&#12289;&#38750;&#26131;&#22833;&#24615;&#23384;&#20648;&#22120;&#65288;&#20027;&#35201;&#26159;&#30005;&#38459;&#24335;&#38543;&#26426;&#23384;&#21462;&#23384;&#20648;&#22120;&#21644;&#30456;&#21464;&#23384;&#20648;&#22120;&#65289;&#23454;&#29616;&#20869;&#23384;&#35745;&#31639;&#65292;&#31070;&#32463;&#24418;&#24577;&#23398;&#22788;&#29702;&#21333;&#20803;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent trends in deep learning (DL) imposed hardware accelerators as the most viable solution for several classes of high-performance computing (HPC) applications such as image classification, computer vision, and speech recognition. This survey summarizes and classifies the most recent advances in designing DL accelerators suitable to reach the performance requirements of HPC applications. In particular, it highlights the most advanced approaches to support deep learning accelerations including not only GPU and TPU-based accelerators but also design-specific hardware accelerators such as FPGA-based and ASIC-based accelerators, Neural Processing Units, open hardware RISC-V-based accelerators and co-processors. The survey also describes accelerators based on emerging memory technologies and computing paradigms, such as 3D-stacked Processor-In-Memory, non-volatile memories (mainly, Resistive RAM and Phase Change Memories) to implement in-memory computing, Neuromorphic Processing Units, a
&lt;/p&gt;</description></item></channel></rss>