<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39640;&#32423;&#32508;&#21512;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30828;&#20214;&#35774;&#35745;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#39564;&#35777;&#20102;&#20854;&#21151;&#33021;&#21644;&#36136;&#37327;&#65292;&#24182;&#35760;&#24405;&#20102;&#25152;&#26377;&#30456;&#20851;&#30340;&#24037;&#20855;&#21644;&#32467;&#26524;&#12290;&#25105;&#20204;&#30456;&#20449;&#36825;&#19968;&#26041;&#27861;&#23558;&#22312;&#24212;&#29992;&#29305;&#23450;&#38598;&#25104;&#30005;&#36335;&#35774;&#35745;&#20013;&#20135;&#29983;&#38761;&#21629;&#24615;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2311.03489</link><description>&lt;p&gt;
&#21033;&#29992;&#39640;&#32423;&#32508;&#21512;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#12289;&#27169;&#25311;&#21644;&#37096;&#32626;&#32479;&#19968;&#38543;&#26426;&#25968;&#29983;&#25104;&#22120;&#30828;&#20214;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Leveraging High-Level Synthesis and Large Language Models to Generate, Simulate, and Deploy a Uniform Random Number Generator Hardware Design. (arXiv:2311.03489v4 [cs.AR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.03489
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39640;&#32423;&#32508;&#21512;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30828;&#20214;&#35774;&#35745;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#39564;&#35777;&#20102;&#20854;&#21151;&#33021;&#21644;&#36136;&#37327;&#65292;&#24182;&#35760;&#24405;&#20102;&#25152;&#26377;&#30456;&#20851;&#30340;&#24037;&#20855;&#21644;&#32467;&#26524;&#12290;&#25105;&#20204;&#30456;&#20449;&#36825;&#19968;&#26041;&#27861;&#23558;&#22312;&#24212;&#29992;&#29305;&#23450;&#38598;&#25104;&#30005;&#36335;&#35774;&#35745;&#20013;&#20135;&#29983;&#38761;&#21629;&#24615;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39640;&#32423;&#32508;&#21512;&#26041;&#27861;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#24037;&#20855;&#26469;&#29983;&#25104;&#30828;&#20214;&#35774;&#35745;&#12290;&#35813;&#26041;&#27861;&#20165;&#20351;&#29992;&#24320;&#28304;&#24037;&#20855;&#65292;&#19981;&#21253;&#25324;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12290;&#25105;&#20204;&#20197;&#29983;&#25104;&#20855;&#26377;wishbone&#25509;&#21475;&#30340;&#32622;&#25442;&#21516;&#20313;&#38543;&#26426;&#25968;&#29983;&#25104;&#22120;&#35774;&#35745;&#20026;&#26696;&#20363;&#30740;&#31350;&#12290;&#25105;&#20204;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#20223;&#30495;&#21644;Dieharder&#38543;&#26426;&#24615;&#27979;&#35797;&#22871;&#20214;&#39564;&#35777;&#20102;&#38543;&#26426;&#25968;&#29983;&#25104;&#22120;&#35774;&#35745;&#30340;&#21151;&#33021;&#21644;&#36136;&#37327;&#12290;&#25105;&#20204;&#35760;&#24405;&#20102;&#26696;&#20363;&#30740;&#31350;&#20013;&#20351;&#29992;&#30340;&#25152;&#26377;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#32842;&#22825;&#35760;&#24405;&#12289;Python&#33050;&#26412;&#12289;Verilog&#33050;&#26412;&#21644;&#20223;&#30495;&#32467;&#26524;&#12290;&#25105;&#20204;&#30456;&#20449;&#65292;&#25105;&#20204;&#30340;&#30828;&#20214;&#35774;&#35745;&#29983;&#25104;&#26041;&#27861;&#19982;&#24320;&#28304;&#30789;130&#32435;&#31859;&#35774;&#35745;&#24037;&#20855;&#30456;&#32467;&#21512;&#65292;&#23558;&#25913;&#21464;&#24212;&#29992;&#29305;&#23450;&#38598;&#25104;&#30005;&#36335;&#35774;&#35745;&#30340;&#26041;&#24335;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26500;&#24314;&#29289;&#32852;&#32593;&#30340;&#39046;&#22495;&#19987;&#29992;&#35745;&#31639;&#21152;&#36895;&#22120;&#21644;&#27010;&#24565;&#39564;&#35777;&#21407;&#22411;&#26102;&#26174;&#33879;&#38477;&#20302;&#20102;&#38376;&#27099;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a new high-level synthesis methodology for using large language model tools to generate hardware designs. The methodology uses exclusively open-source tools excluding the large language model. As a case study, we use our methodology to generate a permuted congruential random number generator design with a wishbone interface. We verify the functionality and quality of the random number generator design using large language model-generated simulations and the Dieharder randomness test suite. We document all the large language model chat logs, Python scripts, Verilog scripts, and simulation results used in the case study. We believe that our method of hardware design generation coupled with the open source silicon 130 nm design tools will revolutionize application-specific integrated circuit design. Our methodology significantly lowers the bar to entry when building domain-specific computing accelerators for the Internet of Things and proof of concept prototypes for later fabri
&lt;/p&gt;</description></item></channel></rss>