<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>&#36817;&#20284;&#35745;&#31639;&#26159;&#19968;&#31181;&#33021;&#22815;&#35843;&#25972;&#31995;&#32479;&#35774;&#35745;&#32467;&#26524;&#36136;&#37327;&#20197;&#25552;&#39640;&#33021;&#28304;&#25928;&#29575;&#21644;/&#25110;&#24615;&#33021;&#30340;&#26032;&#20852;&#35299;&#20915;&#26041;&#26696;&#65292;&#24050;&#21560;&#24341;&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#30340;&#24191;&#27867;&#20851;&#27880;&#12290;&#36825;&#31687;&#35770;&#25991;&#26159;&#19968;&#20010;&#20851;&#20110;&#24212;&#29992;&#29305;&#23450;&#21644;&#26550;&#26500;&#36817;&#20284;&#25216;&#26415;&#30340;&#35843;&#26597;&#30340;&#31532;&#20108;&#37096;&#20998;&#12290;</title><link>http://arxiv.org/abs/2307.11128</link><description>&lt;p&gt;
&#36817;&#20284;&#35745;&#31639;&#35843;&#26597;&#65292;&#31532;&#20108;&#37096;&#20998;&#65306;&#24212;&#29992;&#29305;&#23450;&#21644;&#26550;&#26500;&#36817;&#20284;&#25216;&#26415;&#21450;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Approximate Computing Survey, Part II: Application-Specific &amp; Architectural Approximation Techniques and Applications. (arXiv:2307.11128v1 [cs.AR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11128
&lt;/p&gt;
&lt;p&gt;
&#36817;&#20284;&#35745;&#31639;&#26159;&#19968;&#31181;&#33021;&#22815;&#35843;&#25972;&#31995;&#32479;&#35774;&#35745;&#32467;&#26524;&#36136;&#37327;&#20197;&#25552;&#39640;&#33021;&#28304;&#25928;&#29575;&#21644;/&#25110;&#24615;&#33021;&#30340;&#26032;&#20852;&#35299;&#20915;&#26041;&#26696;&#65292;&#24050;&#21560;&#24341;&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#30340;&#24191;&#27867;&#20851;&#27880;&#12290;&#36825;&#31687;&#35770;&#25991;&#26159;&#19968;&#20010;&#20851;&#20110;&#24212;&#29992;&#29305;&#23450;&#21644;&#26550;&#26500;&#36817;&#20284;&#25216;&#26415;&#30340;&#35843;&#26597;&#30340;&#31532;&#20108;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#31639;&#23494;&#38598;&#22411;&#24212;&#29992;&#30340;&#25361;&#25112;&#24615;&#37096;&#32626;&#65292;&#22914;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21644;&#25968;&#23383;&#20449;&#21495;&#22788;&#29702;&#65288;DSP&#65289;&#65292;&#36843;&#20351;&#35745;&#31639;&#31995;&#32479;&#30028;&#25506;&#32034;&#26032;&#30340;&#35774;&#35745;&#26041;&#27861;&#12290;&#36817;&#20284;&#35745;&#31639;&#25104;&#20026;&#19968;&#31181;&#26032;&#20852;&#35299;&#20915;&#26041;&#26696;&#65292;&#20801;&#35768;&#22312;&#31995;&#32479;&#35774;&#35745;&#20013;&#35843;&#25972;&#32467;&#26524;&#30340;&#36136;&#37327;&#65292;&#20197;&#25552;&#39640;&#33021;&#28304;&#25928;&#29575;&#21644;/&#25110;&#24615;&#33021;&#12290;&#36817;&#24180;&#26469;&#65292;&#36825;&#31181;&#26681;&#26412;&#24615;&#30340;&#33539;&#24335;&#36716;&#21464;&#21560;&#24341;&#20102;&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#30340;&#20852;&#36259;&#65292;&#24182;&#22312;&#19981;&#21516;&#35774;&#35745;&#23618;&#38754;&#65288;&#20174;&#31995;&#32479;&#21040;&#38598;&#25104;&#30005;&#36335;&#65289;&#19978;&#36827;&#34892;&#20102;&#37325;&#35201;&#30340;&#36817;&#20284;&#25216;&#26415;&#21644;&#26041;&#27861;&#30340;&#30740;&#31350;&#12290;&#21463;&#36817;&#20284;&#35745;&#31639;&#22312;&#36807;&#21435;10&#24180;&#30340;&#24191;&#27867;&#21560;&#24341;&#21147;&#30340;&#39537;&#20351;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#20004;&#37096;&#20998;&#30340;&#35843;&#26597;&#65292;&#28085;&#30422;&#20102;&#20851;&#38190;&#26041;&#38754;&#65288;&#22914;&#26415;&#35821;&#21644;&#24212;&#29992;&#65289;&#24182;&#22238;&#39038;&#20102;&#20256;&#32479;&#35745;&#31639;&#22534;&#26632;&#30340;&#21508;&#20010;&#23618;&#38754;&#30340;&#26368;&#26032;&#36817;&#20284;&#25216;&#26415;&#12290;&#22312;&#25105;&#20204;&#30340;&#35843;&#26597;&#31532;&#20108;&#37096;&#20998;&#20013;&#65292;&#25105;&#20204;&#23545;&#24212;&#29992;&#29305;&#23450;&#21644;&#26550;&#26500;&#36817;&#20284;&#25216;&#26415;&#30340;&#25216;&#26415;&#32454;&#33410;&#36827;&#34892;&#20998;&#31867;&#21644;&#20171;&#32461;&#12290;
&lt;/p&gt;
&lt;p&gt;
The challenging deployment of compute-intensive applications from domains such Artificial Intelligence (AI) and Digital Signal Processing (DSP), forces the community of computing systems to explore new design approaches. Approximate Computing appears as an emerging solution, allowing to tune the quality of results in the design of a system in order to improve the energy efficiency and/or performance. This radical paradigm shift has attracted interest from both academia and industry, resulting in significant research on approximation techniques and methodologies at different design layers (from system down to integrated circuits). Motivated by the wide appeal of Approximate Computing over the last 10 years, we conduct a two-part survey to cover key aspects (e.g., terminology and applications) and review the state-of-the art approximation techniques from all layers of the traditional computing stack. In Part II of our survey, we classify and present the technical details of application-s
&lt;/p&gt;</description></item></channel></rss>