<rss version="2.0"><channel><title>Chat Arxiv cs.AR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.AR</description><item><title>TinyFormer&#26159;&#19968;&#20010;&#20855;&#26377;SuperNAS&#12289;SparseNAS&#21644;SparseEngine&#32452;&#25104;&#30340;&#26694;&#26550;&#65292;&#19987;&#38376;&#29992;&#20110;&#22312;MCUs&#19978;&#24320;&#21457;&#21644;&#37096;&#32626;&#36164;&#28304;&#39640;&#25928;&#30340;transformer&#27169;&#22411;&#12290;&#20854;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#25552;&#20986;&#20102;SparseEngine&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#21487;&#20197;&#22312;MCUs&#19978;&#25191;&#34892;&#31232;&#30095;&#27169;&#22411;&#30340;transformer&#25512;&#29702;&#30340;&#37096;&#32626;&#26694;&#26550;&#12290;</title><link>http://arxiv.org/abs/2311.01759</link><description>&lt;p&gt;
TinyFormer: &#39640;&#25928;&#30340;Transformer&#35774;&#35745;&#21644;&#22312;&#23567;&#22411;&#35774;&#22791;&#19978;&#30340;&#37096;&#32626;
&lt;/p&gt;
&lt;p&gt;
TinyFormer: Efficient Transformer Design and Deployment on Tiny Devices. (arXiv:2311.01759v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01759
&lt;/p&gt;
&lt;p&gt;
TinyFormer&#26159;&#19968;&#20010;&#20855;&#26377;SuperNAS&#12289;SparseNAS&#21644;SparseEngine&#32452;&#25104;&#30340;&#26694;&#26550;&#65292;&#19987;&#38376;&#29992;&#20110;&#22312;MCUs&#19978;&#24320;&#21457;&#21644;&#37096;&#32626;&#36164;&#28304;&#39640;&#25928;&#30340;transformer&#27169;&#22411;&#12290;&#20854;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#25552;&#20986;&#20102;SparseEngine&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#21487;&#20197;&#22312;MCUs&#19978;&#25191;&#34892;&#31232;&#30095;&#27169;&#22411;&#30340;transformer&#25512;&#29702;&#30340;&#37096;&#32626;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21508;&#31181;&#23884;&#20837;&#24335;&#29289;&#32852;&#32593;&#24212;&#29992;&#20013;&#65292;&#20197;&#24494;&#25511;&#21046;&#22120;&#21333;&#20803;&#65288;MCUs&#65289;&#20026;&#20195;&#34920;&#30340;&#23567;&#22411;&#35774;&#22791;&#19978;&#24320;&#21457;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#24341;&#36215;&#20102;&#24191;&#27867;&#20851;&#27880;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20005;&#37325;&#30340;&#30828;&#20214;&#36164;&#28304;&#38480;&#21046;&#65292;&#22914;&#20309;&#39640;&#25928;&#22320;&#35774;&#35745;&#21644;&#37096;&#32626;&#26368;&#26032;&#30340;&#20808;&#36827;&#27169;&#22411;&#65288;&#22914;transformer&#65289;&#22312;&#23567;&#22411;&#35774;&#22791;&#19978;&#26159;&#19968;&#39033;&#25361;&#25112;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;TinyFormer&#65292;&#36825;&#26159;&#19968;&#20010;&#29305;&#21035;&#35774;&#35745;&#29992;&#20110;&#22312;MCUs&#19978;&#24320;&#21457;&#21644;&#37096;&#32626;&#36164;&#28304;&#39640;&#25928;&#30340;transformer&#30340;&#26694;&#26550;&#12290;TinyFormer&#20027;&#35201;&#30001;SuperNAS&#12289;SparseNAS&#21644;SparseEngine&#32452;&#25104;&#12290;&#20854;&#20013;&#65292;SuperNAS&#26088;&#22312;&#20174;&#24191;&#22823;&#30340;&#25628;&#32034;&#31354;&#38388;&#20013;&#23547;&#25214;&#36866;&#24403;&#30340;&#36229;&#32593;&#32476;&#12290;SparseNAS&#35780;&#20272;&#26368;&#20339;&#30340;&#31232;&#30095;&#21333;&#36335;&#24452;&#27169;&#22411;&#65292;&#21253;&#25324;&#20174;&#24050;&#35782;&#21035;&#30340;&#36229;&#32593;&#32476;&#20013;&#25552;&#21462;&#30340;transformer&#26550;&#26500;&#12290;&#26368;&#21518;&#65292;SparseEngine&#23558;&#25628;&#32034;&#21040;&#30340;&#31232;&#30095;&#27169;&#22411;&#39640;&#25928;&#22320;&#37096;&#32626;&#21040;MCUs&#19978;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;SparseEngine&#26159;&#31532;&#19968;&#20010;&#33021;&#22815;&#22312;MCUs&#19978;&#25191;&#34892;&#31232;&#30095;&#27169;&#22411;&#30340;transformer&#25512;&#29702;&#30340;&#37096;&#32626;&#26694;&#26550;&#12290;&#22312;CIFAR-10&#25968;&#25454;&#38598;&#19978;&#30340;&#35780;&#20272;&#32467;&#26524;&#34920;&#26126;&#65292;TinyFormer&#22312;&#20445;&#25345;&#25512;&#29702;&#31934;&#24230;&#30340;&#21516;&#26102;&#65292;&#30456;&#27604;&#20110;&#20256;&#32479;&#30340;transformer&#27169;&#22411;&#65292;&#20943;&#23569;&#20102;&#22823;&#32422;78&#65285;&#30340;&#25512;&#29702;&#35745;&#31639;&#37327;&#21644;53&#65285;&#30340;&#27169;&#22411;&#22823;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
Developing deep learning models on tiny devices (e.g. Microcontroller units, MCUs) has attracted much attention in various embedded IoT applications. However, it is challenging to efficiently design and deploy recent advanced models (e.g. transformers) on tiny devices due to their severe hardware resource constraints. In this work, we propose TinyFormer, a framework specifically designed to develop and deploy resource-efficient transformers on MCUs. TinyFormer mainly consists of SuperNAS, SparseNAS and SparseEngine. Separately, SuperNAS aims to search for an appropriate supernet from a vast search space. SparseNAS evaluates the best sparse single-path model including transformer architecture from the identified supernet. Finally, SparseEngine efficiently deploys the searched sparse models onto MCUs. To the best of our knowledge, SparseEngine is the first deployment framework capable of performing inference of sparse models with transformer on MCUs. Evaluation results on the CIFAR-10 da
&lt;/p&gt;</description></item></channel></rss>