<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#35813;&#35770;&#25991;&#27604;&#36739;&#20102;&#30333;&#30418;&#12289;&#28784;&#30418;&#21644;&#40657;&#30418;&#27169;&#22411;&#22312;&#21452;&#21521;Raman&#25918;&#22823;&#22120;&#20013;&#23454;&#29616;&#30446;&#26631;&#39057;&#36317;&#25918;&#22823;&#30340;&#33021;&#21147;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#37117;&#21487;&#20197;&#23454;&#29616;C&#27874;&#27573;&#19979;&#36798;&#21040;1dB&#30340;&#39057;&#36317;&#24179;&#22374;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.05954</link><description>&lt;p&gt;
Raman&#25918;&#22823;&#22120;&#30340;&#20248;&#21270;&#65306;&#40657;&#30418;&#12289;&#28784;&#30418;&#21644;&#30333;&#30418;&#27169;&#22411;&#30340;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
Optimization of Raman amplifiers: a comparison between black-, grey- and white-box modeling. (arXiv:2310.05954v1 [physics.app-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05954
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#27604;&#36739;&#20102;&#30333;&#30418;&#12289;&#28784;&#30418;&#21644;&#40657;&#30418;&#27169;&#22411;&#22312;&#21452;&#21521;Raman&#25918;&#22823;&#22120;&#20013;&#23454;&#29616;&#30446;&#26631;&#39057;&#36317;&#25918;&#22823;&#30340;&#33021;&#21147;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#37117;&#21487;&#20197;&#23454;&#29616;C&#27874;&#27573;&#19979;&#36798;&#21040;1dB&#30340;&#39057;&#36317;&#24179;&#22374;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20809;&#36890;&#20449;&#31995;&#32479;&#19981;&#26029;&#21162;&#21147;&#25552;&#39640;&#21534;&#21520;&#37327;&#30340;&#36807;&#31243;&#20013;&#65292;&#35774;&#35745;&#21644;&#20248;&#21270;&#20809;&#25918;&#22823;&#22120;&#20197;&#26368;&#22823;&#21270;&#31995;&#32479;&#24615;&#33021;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#31163;&#32447;&#20248;&#21270;&#20809;&#25918;&#22823;&#22120;&#20381;&#36182;&#20110;&#20174;&#28145;&#20837;&#29289;&#29702;&#23398;&#30340;&#30333;&#30418;&#27169;&#22411;&#21040;&#25968;&#25454;&#39537;&#21160;&#30340;&#19982;&#29289;&#29702;&#26080;&#20851;&#30340;&#40657;&#30418;&#27169;&#22411;&#30340;&#21508;&#31181;&#27169;&#22411;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#30333;&#30418;&#12289;&#28784;&#30418;&#21644;&#40657;&#30418;&#27169;&#22411;&#22312;&#21452;&#21521;Raman&#25918;&#22823;&#22120;&#20013;&#23454;&#29616;&#30446;&#26631;&#39057;&#36317;&#25918;&#22823;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#30740;&#31350;&#30340;&#20219;&#20309;&#19968;&#31181;&#26041;&#27861;&#37117;&#21487;&#20197;&#22312;100&#20844;&#37324;&#33539;&#22260;&#20869;&#23454;&#29616;C&#27874;&#27573;&#19979;&#36798;&#21040;1dB&#30340;&#39057;&#36317;&#24179;&#22374;&#24230;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#26681;&#25454;&#30446;&#26631;&#24212;&#29992;&#22330;&#26223;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#36866;&#29992;&#24615;&#12289;&#20248;&#21183;&#21644;&#32570;&#28857;&#65292;&#29305;&#21035;&#26159;&#22312;&#20248;&#21270;&#36895;&#24230;&#21644;&#35757;&#32451;&#25968;&#25454;&#35775;&#38382;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;
Designing and optimizing optical amplifiers to maximize system performance is becoming increasingly important as optical communication systems strive to increase throughput. Offline optimization of optical amplifiers relies on models ranging from white-box models deeply rooted in physics to black-box data-driven physics-agnostic models. Here, we compare the capabilities of white-, grey- and black-box models to achieve a target frequency-distance amplification in a bidirectional Raman amplifier. We show that any of the studied methods can achieve down to 1 dB of frequency-distance flatness over the C-band in a 100-km span. Then, we discuss the models' applicability, advantages, and drawbacks based on the target application scenario, in particular in terms of optimization speed and access to training data.
&lt;/p&gt;</description></item></channel></rss>