<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;5G&#32593;&#32476;&#20013;&#26816;&#27979;&#24178;&#25200;&#32773;&#30340;&#26032;&#22411;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#65292;&#36890;&#36807;&#24341;&#20837;&#21452;&#38408;&#20540;&#28145;&#24230;&#23398;&#20064;&#24178;&#25200;&#26816;&#27979;&#22120;&#65292;&#19987;&#27880;&#20110;SSB&#30340;RF&#39046;&#22495;&#29305;&#24449;&#65292;&#25552;&#39640;&#20102;&#32593;&#32476;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.02645</link><description>&lt;p&gt;
&#22312;5G RF&#39046;&#22495;&#65292;&#29992;&#20110;&#24178;&#25200;&#26816;&#27979;&#30340;&#31354;&#20013;&#21452;&#38408;&#20540;&#28145;&#24230;&#23398;&#20064;&#22120;
&lt;/p&gt;
&lt;p&gt;
Over-The-Air Double-Threshold Deep Learner for Jamming Detection in 5G RF domain
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02645
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;5G&#32593;&#32476;&#20013;&#26816;&#27979;&#24178;&#25200;&#32773;&#30340;&#26032;&#22411;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#65292;&#36890;&#36807;&#24341;&#20837;&#21452;&#38408;&#20540;&#28145;&#24230;&#23398;&#20064;&#24178;&#25200;&#26816;&#27979;&#22120;&#65292;&#19987;&#27880;&#20110;SSB&#30340;RF&#39046;&#22495;&#29305;&#24449;&#65292;&#25552;&#39640;&#20102;&#32593;&#32476;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;5G&#26080;&#32447;&#36890;&#20449;&#30340;&#21457;&#23637;&#65292;&#21516;&#27493;&#20449;&#21495;&#22359;&#65288;SSB&#65289;&#22312;&#35774;&#22791;&#21516;&#27493;&#21644;&#26381;&#21153;&#21487;&#35775;&#38382;&#24615;&#20013;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;SSB&#20256;&#36755;&#20855;&#26377;&#21487;&#39044;&#27979;&#24615;&#65292;&#21253;&#25324;&#20027;&#35201;&#21516;&#27493;&#20449;&#21495;&#65288;PSS&#65289;&#21644;&#27425;&#35201;&#21516;&#27493;&#20449;&#21495;&#65288;SSS&#65289;&#65292;&#24178;&#25200;&#25915;&#20987;&#26159;&#37325;&#35201;&#23041;&#32961;&#12290;&#26412;&#25991;&#21033;&#29992;RF&#39046;&#22495;&#30693;&#35782;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;5G&#32593;&#32476;&#24178;&#25200;&#26816;&#27979;&#25216;&#26415;&#12290;&#19982;&#29616;&#26377;&#30340;&#22823;&#22810;&#20381;&#36182;&#32593;&#32476;&#21442;&#25968;&#30340;&#24178;&#25200;&#26816;&#27979;&#31639;&#27861;&#19981;&#21516;&#65292;&#25105;&#20204;&#36890;&#36807;&#19987;&#27880;&#20110;SSB&#24341;&#20837;&#20102;&#21452;&#38408;&#20540;&#28145;&#24230;&#23398;&#20064;&#24178;&#25200;&#26816;&#27979;&#22120;&#12290;&#35813;&#26816;&#27979;&#26041;&#27861;&#20391;&#37325;&#20110;RF&#39046;&#22495;&#29305;&#24449;&#65292;&#25552;&#39640;&#20102;&#32593;&#32476;&#30340;&#40065;&#26834;&#24615;&#65292;&#26080;&#38656;&#19982;&#29616;&#26377;&#32593;&#32476;&#22522;&#30784;&#35774;&#26045;&#38598;&#25104;&#12290;&#36890;&#36807;&#38598;&#25104;&#19968;&#20010;&#39044;&#22788;&#29702;&#22359;&#26469;&#25552;&#21462;PSS&#30456;&#20851;&#24615;&#21644;&#27599;&#20010;&#31354;&#38386;&#36164;&#28304;&#20803;&#32032;&#30340;&#33021;&#37327;&#65288;EPNRE&#65289;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02645v1 Announce Type: cross  Abstract: With the evolution of 5G wireless communications, the Synchronization Signal Block (SSB) plays a critical role in the synchronization of devices and accessibility of services. However, due to the predictable nature of SSB transmission, including the Primary and Secondary Synchronization Signals (PSS and SSS), jamming attacks are critical threats. By leveraging RF domain knowledge, this work presents a novel deep learning-based technique for detecting jammers in 5G networks. Unlike the existing jamming detection algorithms that mostly rely on network parameters, we introduce a double threshold deep learning jamming detector by focusing on the SSB. The detection method is focused on RF domain features and improves the robustness of the network without requiring integration with the pre-existing network infrastructure. By integrating a preprocessing block that extracts PSS correlation and energy per null resource elements (EPNRE) characte
&lt;/p&gt;</description></item></channel></rss>