<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;&#22270;&#25193;&#25955;&#31574;&#30053;&#20248;&#21270;&#65288;GDPO&#65289;&#65292;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#20026;&#20219;&#24847;&#30446;&#26631;&#20248;&#21270;&#22270;&#25193;&#25955;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#22312;&#21508;&#31181;&#22270;&#29983;&#25104;&#20219;&#21153;&#20013;&#30340;&#26368;&#20808;&#36827;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.16302</link><description>&lt;p&gt;
&#22270;&#25193;&#25955;&#31574;&#30053;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Graph Diffusion Policy Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16302
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#22270;&#25193;&#25955;&#31574;&#30053;&#20248;&#21270;&#65288;GDPO&#65289;&#65292;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#20026;&#20219;&#24847;&#30446;&#26631;&#20248;&#21270;&#22270;&#25193;&#25955;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#22312;&#21508;&#31181;&#22270;&#29983;&#25104;&#20219;&#21153;&#20013;&#30340;&#26368;&#20808;&#36827;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#30740;&#31350;&#22312;&#20248;&#21270;&#25193;&#25955;&#27169;&#22411;&#20197;&#23454;&#29616;&#29305;&#23450;&#19979;&#28216;&#30446;&#26631;&#26041;&#38754;&#21462;&#24471;&#20102;&#37325;&#35201;&#36827;&#23637;&#65292;&#36825;&#23545;&#20110;&#39046;&#22495;&#22914;&#33647;&#29289;&#35774;&#35745;&#20013;&#30340;&#22270;&#29983;&#25104;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#36861;&#27714;&#12290;&#28982;&#32780;&#65292;&#30452;&#25509;&#23558;&#36825;&#20123;&#27169;&#22411;&#24212;&#29992;&#20110;&#22270;&#25193;&#25955;&#23384;&#22312;&#25361;&#25112;&#65292;&#23548;&#33268;&#24615;&#33021;&#19981;&#20339;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#22270;&#25193;&#25955;&#31574;&#30053;&#20248;&#21270;&#65288;GDPO&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#20026;&#20219;&#24847;&#65288;&#22914;&#38750;&#21487;&#24494;&#20998;&#65289;&#30446;&#26631;&#20248;&#21270;&#22270;&#25193;&#25955;&#27169;&#22411;&#12290;GDPO&#22522;&#20110;&#38024;&#23545;&#22270;&#25193;&#25955;&#27169;&#22411;&#37327;&#36523;&#23450;&#21046;&#30340;&#24613;&#20999;&#31574;&#30053;&#26799;&#24230;&#65292;&#36890;&#36807;&#35748;&#30495;&#20998;&#26512;&#24320;&#21457;&#65292;&#26377;&#26395;&#25552;&#39640;&#24615;&#33021;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;GDPO&#22312;&#20855;&#26377;&#22797;&#26434;&#21644;&#22810;&#26679;&#21270;&#30446;&#26631;&#30340;&#21508;&#31181;&#22270;&#29983;&#25104;&#20219;&#21153;&#20013;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;&#20195;&#30721;&#21487;&#22312;https://github.com/sail-sg/GDPO&#19978;&#25214;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16302v1 Announce Type: cross  Abstract: Recent research has made significant progress in optimizing diffusion models for specific downstream objectives, which is an important pursuit in fields such as graph generation for drug design. However, directly applying these models to graph diffusion presents challenges, resulting in suboptimal performance. This paper introduces graph diffusion policy optimization (GDPO), a novel approach to optimize graph diffusion models for arbitrary (e.g., non-differentiable) objectives using reinforcement learning. GDPO is based on an eager policy gradient tailored for graph diffusion models, developed through meticulous analysis and promising improved performance. Experimental results show that GDPO achieves state-of-the-art performance in various graph generation tasks with complex and diverse objectives. Code is available at https://github.com/sail-sg/GDPO.
&lt;/p&gt;</description></item></channel></rss>