<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;\carb &#30340;&#31471;&#21040;&#31471;&#24314;&#27169;&#24037;&#20855;&#65292;&#29992;&#20110;&#22312;&#29289;&#32852;&#32593;-&#21551;&#29992;&#28145;&#24230;&#23398;&#20064;&#20013;&#31934;&#30830;&#20272;&#31639;&#30899;&#36275;&#36857;&#65292;&#23637;&#31034;&#20102;&#19982;&#23454;&#38469;&#27979;&#37327;&#20540;&#30456;&#27604;&#26368;&#22823;$\pm21\%$&#30340;&#30899;&#36275;&#36857;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2403.10984</link><description>&lt;p&gt;
IoTCO2&#65306;&#35780;&#20272;&#29289;&#32852;&#32593;-&#21551;&#29992;&#28145;&#24230;&#23398;&#20064;&#30340;&#31471;&#21040;&#31471;&#30899;&#36275;&#36857;
&lt;/p&gt;
&lt;p&gt;
IoTCO2: Assessing the End-To-End Carbon Footprint of Internet-of-Things-Enabled Deep Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10984
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;\carb &#30340;&#31471;&#21040;&#31471;&#24314;&#27169;&#24037;&#20855;&#65292;&#29992;&#20110;&#22312;&#29289;&#32852;&#32593;-&#21551;&#29992;&#28145;&#24230;&#23398;&#20064;&#20013;&#31934;&#30830;&#20272;&#31639;&#30899;&#36275;&#36857;&#65292;&#23637;&#31034;&#20102;&#19982;&#23454;&#38469;&#27979;&#37327;&#20540;&#30456;&#27604;&#26368;&#22823;$\pm21\%$&#30340;&#30899;&#36275;&#36857;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#25552;&#39640;&#38544;&#31169;&#24615;&#21644;&#30830;&#20445;&#26381;&#21153;&#36136;&#37327;&#65288;QoS&#65289;&#65292;&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#27169;&#22411;&#36234;&#26469;&#36234;&#22810;&#22320;&#37096;&#32626;&#22312;&#29289;&#32852;&#32593;&#65288;IoT&#65289;&#35774;&#22791;&#19978;&#36827;&#34892;&#25968;&#25454;&#22788;&#29702;&#65292;&#26497;&#22823;&#22320;&#22686;&#21152;&#20102;&#19982;IoT&#19978;DL&#30456;&#20851;&#30340;&#30899;&#36275;&#36857;&#65292;&#28085;&#30422;&#20102;&#25805;&#20316;&#21644;&#23454;&#20307;&#26041;&#38754;&#12290;&#29616;&#26377;&#30340;&#25805;&#20316;&#33021;&#37327;&#39044;&#27979;&#22120;&#32463;&#24120;&#24573;&#30053;&#20102;&#37327;&#21270;&#30340;DL&#27169;&#22411;&#21644;&#26032;&#20852;&#30340;&#31070;&#32463;&#22788;&#29702;&#21333;&#20803;&#65288;NPUs&#65289;&#65292;&#32780;&#23454;&#20307;&#30899;&#36275;&#36857;&#24314;&#27169;&#24037;&#20855;&#24573;&#30053;&#20102;IoT&#35774;&#22791;&#20013;&#24120;&#35265;&#30340;&#38750;&#35745;&#31639;&#30828;&#20214;&#32452;&#20214;&#65292;&#23548;&#33268;&#20102;&#29289;&#32852;&#32593;DL&#20934;&#30830;&#30899;&#36275;&#36857;&#24314;&#27169;&#24037;&#20855;&#30340;&#24046;&#36317;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;\textit{\carb}&#65292;&#19968;&#31181;&#29992;&#20110;&#31934;&#30830;&#20272;&#31639;&#29289;&#32852;&#32593;DL&#20013;&#30899;&#36275;&#36857;&#30340;&#31471;&#21040;&#31471;&#24314;&#27169;&#24037;&#20855;&#65292;&#23637;&#31034;&#20102;&#19982;&#21508;&#31181;DL&#27169;&#22411;&#30340;&#23454;&#38469;&#27979;&#37327;&#20540;&#30456;&#27604;&#26368;&#22823;$\pm21\%$&#30340;&#30899;&#36275;&#36857;&#24046;&#24322;&#12290;&#27492;&#22806;&#65292;\carb&#30340;&#23454;&#38469;&#24212;&#29992;&#36890;&#36807;&#22810;&#20010;&#29992;&#25143;&#26696;&#20363;&#23637;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10984v1 Announce Type: cross  Abstract: To improve privacy and ensure quality-of-service (QoS), deep learning (DL) models are increasingly deployed on Internet of Things (IoT) devices for data processing, significantly increasing the carbon footprint associated with DL on IoT, covering both operational and embodied aspects. Existing operational energy predictors often overlook quantized DL models and emerging neural processing units (NPUs), while embodied carbon footprint modeling tools neglect non-computing hardware components common in IoT devices, creating a gap in accurate carbon footprint modeling tools for IoT-enabled DL. This paper introduces \textit{\carb}, an end-to-end modeling tool for precise carbon footprint estimation in IoT-enabled DL, demonstrating a maximum $\pm21\%$ deviation in carbon footprint values compared to actual measurements across various DL models. Additionally, practical applications of \carb are showcased through multiple user case studies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#20998;&#24067;&#26080;&#20851;&#20844;&#24179;&#23398;&#20064;&#30340;&#21518;&#22788;&#29702;&#31639;&#27861;FedFaiREE&#65292;&#36866;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#20855;&#26377;&#23567;&#26679;&#26412;&#30340;&#29615;&#22659;&#12290;</title><link>https://arxiv.org/abs/2402.16158</link><description>&lt;p&gt;
&#20998;&#24067;&#26080;&#20851;&#20844;&#24179;&#32852;&#37030;&#23398;&#20064;&#19982;&#23567;&#26679;&#26412;
&lt;/p&gt;
&lt;p&gt;
Distribution-Free Fair Federated Learning with Small Samples
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16158
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#20998;&#24067;&#26080;&#20851;&#20844;&#24179;&#23398;&#20064;&#30340;&#21518;&#22788;&#29702;&#31639;&#27861;FedFaiREE&#65292;&#36866;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#20855;&#26377;&#23567;&#26679;&#26412;&#30340;&#29615;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#32852;&#37030;&#23398;&#20064;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#22240;&#20026;&#23427;&#20855;&#26377;&#21435;&#20013;&#24515;&#21270;&#25968;&#25454;&#35757;&#32451;&#30340;&#33021;&#21147;&#65292;&#35299;&#20915;&#36328;&#32676;&#20307;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;&#29992;&#20110;&#30830;&#20445;&#20844;&#24179;&#24615;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26159;&#20026;&#38598;&#20013;&#21270;&#25968;&#25454;&#29615;&#22659;&#35774;&#35745;&#30340;&#65292;&#36890;&#24120;&#38656;&#35201;&#22823;&#26679;&#26412;&#21644;&#20998;&#24067;&#20551;&#35774;&#65292;&#24378;&#35843;&#20102;&#36843;&#20999;&#38656;&#35201;&#38024;&#23545;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#21644;&#20998;&#24067;&#26080;&#20851;&#20445;&#35777;&#30340;&#21435;&#20013;&#24515;&#21270;&#21644;&#24322;&#26500;&#31995;&#32479;&#36827;&#34892;&#20844;&#24179;&#24615;&#25216;&#26415;&#30340;&#35843;&#25972;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;FedFaiREE&#65292;&#36825;&#26159;&#19968;&#31181;&#19987;&#38376;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#29615;&#22659;&#20013;&#23567;&#26679;&#26412;&#30340;&#20998;&#24067;&#26080;&#20851;&#20844;&#24179;&#23398;&#20064;&#30340;&#21518;&#22788;&#29702;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32771;&#34385;&#21040;&#20102;&#21435;&#20013;&#24515;&#21270;&#29615;&#22659;&#20013;&#30340;&#29420;&#29305;&#25361;&#25112;&#65292;&#20363;&#22914;&#23458;&#25143;&#24322;&#36136;&#24615;&#12289;&#36890;&#20449;&#25104;&#26412;&#21644;&#23567;&#26679;&#26412;&#22823;&#23567;&#12290;&#25105;&#20204;&#20026;bot&#25552;&#20379;&#20005;&#26684;&#30340;&#29702;&#35770;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16158v1 Announce Type: cross  Abstract: As federated learning gains increasing importance in real-world applications due to its capacity for decentralized data training, addressing fairness concerns across demographic groups becomes critically important. However, most existing machine learning algorithms for ensuring fairness are designed for centralized data environments and generally require large-sample and distributional assumptions, underscoring the urgent need for fairness techniques adapted for decentralized and heterogeneous systems with finite-sample and distribution-free guarantees. To address this issue, this paper introduces FedFaiREE, a post-processing algorithm developed specifically for distribution-free fair learning in decentralized settings with small samples. Our approach accounts for unique challenges in decentralized environments, such as client heterogeneity, communication costs, and small sample sizes. We provide rigorous theoretical guarantees for bot
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#29983;&#25104;&#24189;&#28789;&#30340;&#28508;&#22312;&#23454;&#26045;&#35774;&#35745;&#31354;&#38388;&#21644;&#20854;&#23545;&#20010;&#20154;&#21644;&#31038;&#20250;&#30340;&#23454;&#38469;&#21644;&#20262;&#29702;&#24433;&#21709;&#65292;&#25552;&#20986;&#20102;&#30740;&#31350;&#35758;&#31243;&#20197;&#20415;&#20351;&#20154;&#20204;&#33021;&#22815;&#23433;&#20840;&#32780;&#26377;&#30410;&#22320;&#21019;&#24314;&#21644;&#19982;&#20154;&#24037;&#26234;&#33021;&#26469;&#19990;&#36827;&#34892;&#20114;&#21160;&#12290;</title><link>https://arxiv.org/abs/2402.01662</link><description>&lt;p&gt;
&#29983;&#25104;&#24189;&#28789;&#65306;&#39044;&#27979;&#20154;&#24037;&#26234;&#33021;&#26469;&#19990;&#30340;&#30410;&#22788;&#21644;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Generative Ghosts: Anticipating Benefits and Risks of AI Afterlives
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01662
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#29983;&#25104;&#24189;&#28789;&#30340;&#28508;&#22312;&#23454;&#26045;&#35774;&#35745;&#31354;&#38388;&#21644;&#20854;&#23545;&#20010;&#20154;&#21644;&#31038;&#20250;&#30340;&#23454;&#38469;&#21644;&#20262;&#29702;&#24433;&#21709;&#65292;&#25552;&#20986;&#20102;&#30740;&#31350;&#35758;&#31243;&#20197;&#20415;&#20351;&#20154;&#20204;&#33021;&#22815;&#23433;&#20840;&#32780;&#26377;&#30410;&#22320;&#21019;&#24314;&#21644;&#19982;&#20154;&#24037;&#26234;&#33021;&#26469;&#19990;&#36827;&#34892;&#20114;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#22312;&#24615;&#33021;&#30340;&#24191;&#24230;&#21644;&#28145;&#24230;&#19978;&#36805;&#36895;&#25552;&#21319;&#65292;&#23427;&#20204;&#36234;&#26469;&#36234;&#36866;&#21512;&#21019;&#24314;&#21151;&#33021;&#24378;&#22823;&#12289;&#36924;&#30495;&#30340;&#20195;&#29702;&#20154;&#65292;&#21253;&#25324;&#22522;&#20110;&#29305;&#23450;&#20154;&#29289;&#24314;&#27169;&#30340;&#20195;&#29702;&#20154;&#30340;&#21487;&#33021;&#24615;&#12290;&#25105;&#20204;&#39044;&#35745;&#65292;&#22312;&#25105;&#20204;&#26377;&#29983;&#20043;&#24180;&#65292;&#20154;&#20204;&#21487;&#33021;&#20250;&#26222;&#36941;&#20351;&#29992;&#23450;&#21046;&#30340;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#20154;&#19982;&#29233;&#30340;&#20154;&#21644;/&#25110;&#26356;&#24191;&#22823;&#30340;&#19990;&#30028;&#36827;&#34892;&#20114;&#21160;&#12290;&#25105;&#20204;&#31216;&#20043;&#20026;&#29983;&#25104;&#24189;&#28789;&#65292;&#22240;&#20026;&#36825;&#20123;&#20195;&#29702;&#20154;&#23558;&#33021;&#22815;&#29983;&#25104;&#26032;&#39062;&#30340;&#20869;&#23481;&#65292;&#32780;&#19981;&#21482;&#26159;&#22797;&#36848;&#20854;&#21019;&#20316;&#32773;&#22312;&#29983;&#21069;&#30340;&#20869;&#23481;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#35752;&#35770;&#20102;&#29983;&#25104;&#24189;&#28789;&#28508;&#22312;&#23454;&#26045;&#30340;&#35774;&#35745;&#31354;&#38388;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#29983;&#25104;&#24189;&#28789;&#30340;&#23454;&#38469;&#21644;&#20262;&#29702;&#24433;&#21709;&#65292;&#21253;&#25324;&#23545;&#20010;&#20154;&#21644;&#31038;&#20250;&#30340;&#28508;&#22312;&#31215;&#26497;&#21644;&#28040;&#26497;&#24433;&#21709;&#12290;&#22522;&#20110;&#36825;&#20123;&#32771;&#34385;&#65292;&#25105;&#20204;&#21046;&#23450;&#20102;&#19968;&#20010;&#30740;&#31350;&#35758;&#31243;&#65292;&#26088;&#22312;&#20351;&#20154;&#20204;&#33021;&#22815;&#23433;&#20840;&#32780;&#26377;&#30410;&#22320;&#21019;&#24314;&#21644;&#19982;&#20154;&#24037;&#26234;&#33021;&#26469;&#19990;&#36827;&#34892;&#20114;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
As AI systems quickly improve in both breadth and depth of performance, they lend themselves to creating increasingly powerful and realistic agents, including the possibility of agents modeled on specific people. We anticipate that within our lifetimes it may become common practice for people to create a custom AI agent to interact with loved ones and/or the broader world after death. We call these generative ghosts, since such agents will be capable of generating novel content rather than merely parroting content produced by their creator while living. In this paper, we first discuss the design space of potential implementations of generative ghosts. We then discuss the practical and ethical implications of generative ghosts, including potential positive and negative impacts on individuals and society. Based on these considerations, we lay out a research agenda for the AI and HCI research communities to empower people to create and interact with AI afterlives in a safe and beneficial 
&lt;/p&gt;</description></item></channel></rss>