<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#22312;&#27979;&#35797;&#26102;&#38388;&#33258;&#36866;&#24212;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;GAP&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#26799;&#24230;&#23545;&#40784;&#21644;&#21407;&#22411;&#29305;&#24449;&#65292;&#20943;&#36731;&#20102;&#26469;&#33258;&#20110;&#38169;&#35823;&#20998;&#31867;&#20266;&#26631;&#31614;&#29109;&#26368;&#23567;&#21270;&#25439;&#22833;&#30340;&#19981;&#36866;&#24403;&#24341;&#23548;&#65292;&#26174;&#33879;&#25913;&#21892;&#20102;TTA&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.09004</link><description>&lt;p&gt;
&#20351;&#29992;&#21407;&#22411;&#29305;&#24449;&#36827;&#34892;&#26799;&#24230;&#23545;&#40784;&#30340;&#23436;&#20840;&#27979;&#35797;&#26102;&#38388;&#33258;&#36866;&#24212;
&lt;/p&gt;
&lt;p&gt;
Gradient Alignment with Prototype Feature for Fully Test-time Adaptation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09004
&lt;/p&gt;
&lt;p&gt;
&#22312;&#27979;&#35797;&#26102;&#38388;&#33258;&#36866;&#24212;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;GAP&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#26799;&#24230;&#23545;&#40784;&#21644;&#21407;&#22411;&#29305;&#24449;&#65292;&#20943;&#36731;&#20102;&#26469;&#33258;&#20110;&#38169;&#35823;&#20998;&#31867;&#20266;&#26631;&#31614;&#29109;&#26368;&#23567;&#21270;&#25439;&#22833;&#30340;&#19981;&#36866;&#24403;&#24341;&#23548;&#65292;&#26174;&#33879;&#25913;&#21892;&#20102;TTA&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27979;&#35797;&#26102;&#38388;&#33258;&#36866;&#24212;&#65288;TTA&#65289;&#30340;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#31216;&#20026;&#26799;&#24230;&#23545;&#40784;&#19982;&#21407;&#22411;&#29305;&#24449;&#65288;GAP&#65289;&#65292;&#23427;&#21487;&#20197;&#20943;&#36731;&#30001;&#20110;&#38169;&#35823;&#20998;&#31867;&#20266;&#26631;&#31614;&#30340;&#29109;&#26368;&#23567;&#21270;&#25439;&#22833;&#32780;&#23548;&#33268;&#30340;&#19981;&#36866;&#24403;&#24341;&#23548;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26799;&#24230;&#23545;&#40784;&#25439;&#22833;&#65292;&#20197;&#31934;&#30830;&#22320;&#31649;&#29702;&#36866;&#24212;&#36807;&#31243;&#65292;&#30830;&#20445;&#23545;&#26576;&#20123;&#25968;&#25454;&#36827;&#34892;&#30340;&#26356;&#25913;&#19981;&#20250;&#23545;&#27169;&#22411;&#22312;&#20854;&#20182;&#25968;&#25454;&#19978;&#30340;&#24615;&#33021;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31867;&#30340;&#21407;&#22411;&#29305;&#24449;&#20316;&#20026;&#36127;&#38754;&#24433;&#21709;&#30340;&#20195;&#29702;&#27979;&#37327;&#12290;&#20026;&#20102;&#20351;&#22312;TTA&#32422;&#26463;&#19979;GAP&#27491;&#21017;&#21270;&#26041;&#27861;&#21487;&#34892;&#65292;&#21363;&#27169;&#22411;&#21482;&#33021;&#35775;&#38382;&#27809;&#26377;&#26631;&#31614;&#30340;&#27979;&#35797;&#25968;&#25454;&#65292;&#25105;&#20204;&#36890;&#36807;&#20004;&#31181;&#26041;&#24335;&#20462;&#25913;&#20102;&#20854;&#20844;&#24335;&#65306;&#29992;&#20998;&#31867;&#22120;&#30340;&#26435;&#37325;&#21521;&#37327;&#36817;&#20284;&#21407;&#22411;&#29305;&#24449;&#65292;&#19981;&#20351;&#29992;&#21453;&#21521;&#20256;&#25773;&#35745;&#31639;&#26799;&#24230;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;GAP&#22312;&#21508;&#31181;&#25968;&#25454;&#38598;&#19978;&#26174;&#33879;&#25913;&#21892;&#20102;TTA&#26041;&#27861;&#65292;&#35777;&#26126;&#20102;&#20854;&#22810;&#21151;&#33021;&#24615;&#21644;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09004v1 Announce Type: cross Abstract: In context of Test-time Adaptation(TTA), we propose a regularizer, dubbed Gradient Alignment with Prototype feature (GAP), which alleviates the inappropriate guidance from entropy minimization loss from misclassified pseudo label. We developed a gradient alignment loss to precisely manage the adaptation process, ensuring that changes made for some data don't negatively impact the model's performance on other data. We introduce a prototype feature of a class as a proxy measure of the negative impact. To make GAP regularizer feasible under the TTA constraints, where model can only access test data without labels, we tailored its formula in two ways: approximating prototype features with weight vectors of the classifier, calculating gradient without back-propagation. We demonstrate GAP significantly improves TTA methods across various datasets, which proves its versatility and effectiveness.
&lt;/p&gt;</description></item></channel></rss>