<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;TREC&#65292;&#39318;&#27425;&#23581;&#35797;&#36890;&#36807;&#23569;&#26679;&#26412;&#36861;&#28335;&#23376;&#22270;&#23398;&#20064;&#23454;&#29616;&#23545;APT&#25915;&#20987;&#27963;&#21160;&#20013;&#25112;&#26415;/&#25216;&#26415;&#30340;&#35782;&#21035;&#65292;&#24357;&#34917;&#20102;&#29616;&#26377;&#22522;&#20110;&#35268;&#21017;&#30340;&#26041;&#27861;&#26080;&#27861;&#35782;&#21035;&#32454;&#31890;&#24230;APT&#25216;&#26415;&#21644;&#21464;&#31181;APT&#25915;&#20987;&#30340;&#19981;&#36275;&#12290;</title><link>https://arxiv.org/abs/2402.15147</link><description>&lt;p&gt;
TREC: &#36890;&#36807;&#23569;&#26679;&#26412;&#36861;&#28335;&#23376;&#22270;&#23398;&#20064;&#23454;&#29616;APT&#25112;&#26415;/&#25216;&#26415;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
TREC: APT Tactic / Technique Recognition via Few-Shot Provenance Subgraph Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15147
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;TREC&#65292;&#39318;&#27425;&#23581;&#35797;&#36890;&#36807;&#23569;&#26679;&#26412;&#36861;&#28335;&#23376;&#22270;&#23398;&#20064;&#23454;&#29616;&#23545;APT&#25915;&#20987;&#27963;&#21160;&#20013;&#25112;&#26415;/&#25216;&#26415;&#30340;&#35782;&#21035;&#65292;&#24357;&#34917;&#20102;&#29616;&#26377;&#22522;&#20110;&#35268;&#21017;&#30340;&#26041;&#27861;&#26080;&#27861;&#35782;&#21035;&#32454;&#31890;&#24230;APT&#25216;&#26415;&#21644;&#21464;&#31181;APT&#25915;&#20987;&#30340;&#19981;&#36275;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
APT&#65288;&#39640;&#32423;&#25345;&#32493;&#24615;&#23041;&#32961;&#65289;&#20855;&#26377;&#25345;&#20037;&#24615;&#12289;&#38544;&#31192;&#24615;&#21644;&#22810;&#26679;&#24615;&#31561;&#29305;&#24449;&#65292;&#26159;&#23545;&#32593;&#32476;&#22522;&#30784;&#35774;&#26045;&#30340;&#26368;&#22823;&#23041;&#32961;&#20043;&#19968;&#12290; &#20026;&#24212;&#23545;&#27492;&#23041;&#32961;&#65292;&#29616;&#26377;&#30740;&#31350;&#21033;&#29992;&#28335;&#28304;&#22270;&#26469;&#25429;&#25417;&#20027;&#26426;&#20013;&#31995;&#32479;&#23454;&#20307;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#23454;&#29616;&#26377;&#25928;&#30340;APT&#26816;&#27979;&#12290; &#19982;&#22823;&#22810;&#25968;&#29616;&#26377;&#24037;&#20316;&#21482;&#26816;&#27979;&#21333;&#20010;&#25915;&#20987;&#20107;&#20214;&#19981;&#21516;&#65292;&#29702;&#35299;&#32452;&#32455;&#21644;&#23436;&#25104;APT&#25915;&#20987;&#27963;&#21160;&#25152;&#24212;&#29992;&#30340;&#25112;&#26415;/&#25216;&#26415;&#65288;&#20363;&#22914;&#65292;Kill-Chain&#12289;ATT&amp;CK&#65289;&#23545;&#23433;&#20840;&#36816;&#33829;&#26356;&#20026;&#37325;&#35201;&#12290; &#29616;&#26377;&#30740;&#31350;&#23581;&#35797;&#25163;&#21160;&#35774;&#35745;&#19968;&#32452;&#35268;&#21017;&#65292;&#23558;&#20302;&#32423;&#31995;&#32479;&#20107;&#20214;&#26144;&#23556;&#21040;&#39640;&#32423;APT&#25112;&#26415;/&#25216;&#26415;&#12290; &#20294;&#22522;&#20110;&#35268;&#21017;&#30340;&#26041;&#27861;&#31895;&#31890;&#24230;&#19988;&#32570;&#20047;&#27867;&#21270;&#33021;&#21147;&#65292;&#22240;&#27492;&#21482;&#33021;&#35782;&#21035;APT&#25112;&#26415;&#65292;&#26080;&#27861;&#36776;&#35782;&#32454;&#31890;&#24230;&#30340;APT&#25216;&#26415;&#21644;&#31361;&#21464;&#30340;APT&#25915;&#20987;&#12290; &#26412;&#25991;&#25552;&#20986;&#20102;TREC&#65292;&#36825;&#26159;&#39318;&#20010;&#23581;&#35797;&#35748;&#30693;AP
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15147v1 Announce Type: cross  Abstract: APT (Advanced Persistent Threat) with the characteristics of persistence, stealth, and diversity is one of the greatest threats against cyber-infrastructure. As a countermeasure, existing studies leverage provenance graphs to capture the complex relations between system entities in a host for effective APT detection. In addition to detecting single attack events as most existing work does, understanding the tactics / techniques (e.g., Kill-Chain, ATT&amp;CK) applied to organize and accomplish the APT attack campaign is more important for security operations. Existing studies try to manually design a set of rules to map low-level system events to high-level APT tactics / techniques. However, the rule based methods are coarse-grained and lack generalization ability, thus they can only recognize APT tactics and cannot identify fine-grained APT techniques and mutant APT attacks. In this paper, we propose TREC, the first attempt to recognize AP
&lt;/p&gt;</description></item></channel></rss>