<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;TopCoW&#25361;&#25112;&#65292;&#36890;&#36807;&#21457;&#24067;&#20855;&#26377;13&#31181;&#34880;&#31649;&#32452;&#20998;&#27880;&#37322;&#30340;Willis&#24490;&#29615;&#65288;CoW&#65289;&#25968;&#25454;&#38598;&#65292;&#24182;&#20351;&#29992;&#34394;&#25311;&#29616;&#23454;&#65288;VR&#65289;&#25216;&#26415;&#36827;&#34892;&#25299;&#25169;&#24863;&#30693;&#35299;&#21078;&#20998;&#21106;&#65292;&#35299;&#20915;&#20102;&#25163;&#21160;&#21644;&#32791;&#26102;&#30340;CoW&#34920;&#24449;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2312.17670</link><description>&lt;p&gt;
TopCoW&#65306;&#22522;&#20110;&#25299;&#25169;&#24863;&#30693;&#35299;&#21078;&#20998;&#21106;&#30340;Willis&#24490;&#29615;&#65288;CoW&#65289;&#22312;CTA&#21644;MRA&#20013;&#30340;&#22522;&#20934;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
TopCoW: Benchmarking Topology-Aware Anatomical Segmentation of the Circle of Willis (CoW) for CTA and MRA. (arXiv:2312.17670v2 [cs.CV] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.17670
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;TopCoW&#25361;&#25112;&#65292;&#36890;&#36807;&#21457;&#24067;&#20855;&#26377;13&#31181;&#34880;&#31649;&#32452;&#20998;&#27880;&#37322;&#30340;Willis&#24490;&#29615;&#65288;CoW&#65289;&#25968;&#25454;&#38598;&#65292;&#24182;&#20351;&#29992;&#34394;&#25311;&#29616;&#23454;&#65288;VR&#65289;&#25216;&#26415;&#36827;&#34892;&#25299;&#25169;&#24863;&#30693;&#35299;&#21078;&#20998;&#21106;&#65292;&#35299;&#20915;&#20102;&#25163;&#21160;&#21644;&#32791;&#26102;&#30340;CoW&#34920;&#24449;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Willis&#24490;&#29615;&#65288;CoW&#65289;&#26159;&#36830;&#25509;&#22823;&#33041;&#20027;&#35201;&#24490;&#29615;&#30340;&#37325;&#35201;&#21160;&#33033;&#32593;&#32476;&#12290;&#20854;&#34880;&#31649;&#32467;&#26500;&#34987;&#35748;&#20026;&#24433;&#21709;&#30528;&#20005;&#37325;&#31070;&#32463;&#34880;&#31649;&#30142;&#30149;&#30340;&#39118;&#38505;&#12289;&#20005;&#37325;&#31243;&#24230;&#21644;&#20020;&#24202;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#23545;&#39640;&#24230;&#21464;&#21270;&#30340;CoW&#35299;&#21078;&#36827;&#34892;&#34920;&#24449;&#20173;&#28982;&#26159;&#19968;&#39033;&#38656;&#35201;&#25163;&#21160;&#21644;&#32791;&#26102;&#30340;&#19987;&#23478;&#20219;&#21153;&#12290;CoW&#36890;&#24120;&#36890;&#36807;&#20004;&#31181;&#34880;&#31649;&#36896;&#24433;&#25104;&#20687;&#27169;&#24335;&#36827;&#34892;&#25104;&#20687;&#65292;&#21363;&#30913;&#20849;&#25391;&#34880;&#31649;&#25104;&#20687;&#65288;MRA&#65289;&#21644;&#35745;&#31639;&#26426;&#26029;&#23618;&#34880;&#31649;&#36896;&#24433;&#65288;CTA&#65289;&#65292;&#20294;&#26159;&#20851;&#20110;CTA&#30340;CoW&#35299;&#21078;&#30340;&#20844;&#20849;&#25968;&#25454;&#38598;&#21450;&#20854;&#27880;&#37322;&#38750;&#24120;&#26377;&#38480;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#22312;2023&#24180;&#32452;&#32455;&#20102;TopCoW&#25361;&#25112;&#36187;&#65292;&#24182;&#21457;&#24067;&#20102;&#19968;&#20010;&#24102;&#26377;&#27880;&#37322;&#30340;CoW&#25968;&#25454;&#38598;&#12290;TopCoW&#25968;&#25454;&#38598;&#26159;&#31532;&#19968;&#20010;&#20855;&#26377;13&#31181;&#21487;&#33021;&#30340;CoW&#34880;&#31649;&#32452;&#20998;&#30340;&#20307;&#32032;&#32423;&#27880;&#37322;&#30340;&#20844;&#20849;&#25968;&#25454;&#38598;&#65292;&#36890;&#36807;&#34394;&#25311;&#29616;&#23454;&#65288;VR&#65289;&#25216;&#26415;&#23454;&#29616;&#12290;&#23427;&#20063;&#26159;&#31532;&#19968;&#20010;&#24102;&#26377;&#26469;&#33258;&#21516;&#19968;&#24739;&#32773;&#30340;&#25104;&#23545;MRA&#21644;CTA&#30340;&#22823;&#22411;&#25968;&#25454;&#38598;&#12290;TopCoW&#25361;&#25112;&#23558;CoW&#34920;&#24449;&#38382;&#39064;&#24418;&#24335;&#21270;&#20026;&#22810;&#31867;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Circle of Willis (CoW) is an important network of arteries connecting major circulations of the brain. Its vascular architecture is believed to affect the risk, severity, and clinical outcome of serious neuro-vascular diseases. However, characterizing the highly variable CoW anatomy is still a manual and time-consuming expert task. The CoW is usually imaged by two angiographic imaging modalities, magnetic resonance angiography (MRA) and computed tomography angiography (CTA), but there exist limited public datasets with annotations on CoW anatomy, especially for CTA. Therefore we organized the TopCoW Challenge in 2023 with the release of an annotated CoW dataset. The TopCoW dataset was the first public dataset with voxel-level annotations for thirteen possible CoW vessel components, enabled by virtual-reality (VR) technology. It was also the first large dataset with paired MRA and CTA from the same patients. TopCoW challenge formalized the CoW characterization problem as a multiclas
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#26041;&#27861;&#22312;&#30701;&#26102;&#38388;&#20869;&#26631;&#35760;8000&#20010;&#33145;&#37096;CT&#25195;&#25551;&#20013;&#30340;8&#20010;&#22120;&#23448;&#65292;&#24314;&#31435;&#20102;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#30340;&#22810;&#22120;&#23448;&#25968;&#25454;&#38598;&#12290;</title><link>http://arxiv.org/abs/2305.09666</link><description>&lt;p&gt;
&#22312;&#19977;&#21608;&#20869;&#20026;8,000&#20010;&#33145;&#37096;CT&#25195;&#25551;&#26631;&#27880;&#22810;&#22120;&#23448;&#20998;&#21106;
&lt;/p&gt;
&lt;p&gt;
Annotating 8,000 Abdominal CT Volumes for Multi-Organ Segmentation in Three Weeks. (arXiv:2305.09666v1 [eess.IV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09666
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#26041;&#27861;&#22312;&#30701;&#26102;&#38388;&#20869;&#26631;&#35760;8000&#20010;&#33145;&#37096;CT&#25195;&#25551;&#20013;&#30340;8&#20010;&#22120;&#23448;&#65292;&#24314;&#31435;&#20102;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#30340;&#22810;&#22120;&#23448;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21307;&#23398;&#24433;&#20687;&#26631;&#27880;&#65292;&#29305;&#21035;&#26159;&#22120;&#23448;&#20998;&#21106;&#65292;&#26159;&#36153;&#26102;&#36153;&#21147;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31995;&#32479;&#39640;&#25928;&#30340;&#26041;&#27861;&#26469;&#21152;&#36895;&#22120;&#23448;&#20998;&#21106;&#30340;&#26631;&#27880;&#36807;&#31243;&#12290;&#25105;&#20204;&#26631;&#27880;&#20102;8,448&#20010;&#33145;&#37096;CT&#25195;&#25551;&#65292;&#26631;&#35760;&#20102;&#33086;&#33039;&#12289;&#32925;&#33039;&#12289;&#32958;&#33039;&#12289;&#32963;&#12289;&#32966;&#22218;&#12289;&#33008;&#33146;&#12289;&#20027;&#21160;&#33033;&#21644;&#19979;&#33108;&#38745;&#33033;&#12290;&#20256;&#32479;&#30340;&#26631;&#27880;&#26041;&#27861;&#38656;&#35201;&#19968;&#20301;&#32463;&#39564;&#20016;&#23500;&#30340;&#26631;&#27880;&#21592;1600&#21608;&#65292;&#32780;&#25105;&#20204;&#30340;&#26631;&#27880;&#26041;&#27861;&#20165;&#29992;&#20102;&#19977;&#21608;&#12290;
&lt;/p&gt;
&lt;p&gt;
Annotating medical images, particularly for organ segmentation, is laborious and time-consuming. For example, annotating an abdominal organ requires an estimated rate of 30-60 minutes per CT volume based on the expertise of an annotator and the size, visibility, and complexity of the organ. Therefore, publicly available datasets for multi-organ segmentation are often limited in data size and organ diversity. This paper proposes a systematic and efficient method to expedite the annotation process for organ segmentation. We have created the largest multi-organ dataset (by far) with the spleen, liver, kidneys, stomach, gallbladder, pancreas, aorta, and IVC annotated in 8,448 CT volumes, equating to 3.2 million slices. The conventional annotation methods would take an experienced annotator up to 1,600 weeks (or roughly 30.8 years) to complete this task. In contrast, our annotation method has accomplished this task in three weeks (based on an 8-hour workday, five days a week) while maintain
&lt;/p&gt;</description></item></channel></rss>