<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102; AI &#22312;&#23398;&#20064;&#21644;&#25945;&#32946;&#20013;&#30340;&#22810;&#32500;&#35270;&#35282;&#65292;&#24378;&#35843;&#20102; AI&#12289;&#20998;&#26512;&#21644;&#23398;&#20064;&#36807;&#31243;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#25361;&#25112;&#20102;&#23558; AI &#35270;&#20026;&#38543;&#26426;&#24037;&#20855;&#30340;&#35266;&#24565;&#65292;&#24378;&#35843;&#20102; AI &#20316;&#20026;&#29702;&#35299;&#20154;&#31867;&#23398;&#20064;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#29420;&#29305;&#30340;&#25945;&#32946;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#27010;&#24565;&#21270;&#12290;</title><link>https://arxiv.org/abs/2403.16081</link><description>&lt;p&gt;
&#25945;&#32946;&#20013;&#23398;&#20064;&#12289;&#20998;&#26512;&#21644;&#20154;&#24037;&#26234;&#33021;&#30340;&#30456;&#20114;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
The Interplay of Learning, Analytics, and Artificial Intelligence in Education
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16081
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102; AI &#22312;&#23398;&#20064;&#21644;&#25945;&#32946;&#20013;&#30340;&#22810;&#32500;&#35270;&#35282;&#65292;&#24378;&#35843;&#20102; AI&#12289;&#20998;&#26512;&#21644;&#23398;&#20064;&#36807;&#31243;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#25361;&#25112;&#20102;&#23558; AI &#35270;&#20026;&#38543;&#26426;&#24037;&#20855;&#30340;&#35266;&#24565;&#65292;&#24378;&#35843;&#20102; AI &#20316;&#20026;&#29702;&#35299;&#20154;&#31867;&#23398;&#20064;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#29420;&#29305;&#30340;&#25945;&#32946;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#27010;&#24565;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20154;&#24037;&#26234;&#33021;&#22312;&#23398;&#20064;&#21644;&#25945;&#32946;&#20013;&#30340;&#22810;&#32500;&#35270;&#35282;&#65292;&#24378;&#35843;&#20154;&#24037;&#26234;&#33021;&#12289;&#20998;&#26512;&#21644;&#23398;&#20064;&#36807;&#31243;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#31508;&#32773;&#25361;&#25112;&#20102;&#23558;&#20154;&#24037;&#26234;&#33021;&#20165;&#35270;&#20026;&#38543;&#26426;&#24037;&#20855;&#30340;&#26222;&#36941;&#35266;&#24565;&#65292;&#20363;&#22914;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#65292;&#20027;&#24352;&#37325;&#35270;&#23545;&#20154;&#24037;&#26234;&#33021;&#30340;&#26367;&#20195;&#27010;&#24565;&#12290;&#25991;&#31456;&#31361;&#20986;&#20102;&#20154;&#31867;&#26234;&#33021;&#19982;&#20154;&#24037;&#20449;&#24687;&#22788;&#29702;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;AI&#31639;&#27861;&#20013;&#22266;&#26377;&#30340;&#35748;&#30693;&#22810;&#26679;&#24615;&#65292;&#24182;&#25552;&#20986;AI&#20063;&#21487;&#20197;&#20316;&#20026;&#29702;&#35299;&#20154;&#31867;&#23398;&#20064;&#30340;&#24037;&#20855;&#12290;&#20174;&#23558;AI&#35270;&#20026;&#20154;&#31867;&#26234;&#33021;&#30340;&#31867;&#27604;&#30340;&#26089;&#26399;&#23398;&#20064;&#31185;&#23398;&#21644;&#25945;&#32946;&#20013;&#30340;AI&#30740;&#31350;&#24050;&#32463;&#20559;&#31163;&#36825;&#19968;&#35266;&#28857;&#65292;&#20419;&#20351;&#26377;&#24517;&#35201;&#37325;&#26032;&#28857;&#29123;&#36825;&#31181;&#32852;&#31995;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#31181;&#29420;&#29305;&#30340;&#25945;&#32946;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#27010;&#24565;&#21270;&#65306;&#20154;&#31867;&#35748;&#30693;&#30340;&#22806;&#37096;&#21270;&#12289;&#20869;&#21270;AI&#27169;&#22411;&#20197;&#24433;&#21709;&#20154;&#31867;&#24605;&#32500;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16081v1 Announce Type: cross  Abstract: This paper presents a multi dimensional view of AI's role in learning and education, emphasizing the intricate interplay between AI, analytics, and the learning processes. Here, I challenge the prevalent narrow conceptualization of AI as stochastic tools, as exemplified in generative AI, and argue for the importance of alternative conceptualisations of AI. I highlight the differences between human intelligence and artificial information processing, the cognitive diversity inherent in AI algorithms, and posit that AI can also serve as an instrument for understanding human learning. Early learning sciences and AI in Education research, which saw AI as an analogy for human intelligence, have diverged from this perspective, prompting a need to rekindle this connection. The paper presents three unique conceptualizations of AI in education: the externalization of human cognition, the internalization of AI models to influence human thought pr
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#25991;&#21270;&#25972;&#21512;&#26041;&#38754;&#34920;&#29616;&#26356;&#20339;&#65292;&#29305;&#21035;&#26159;&#36890;&#36807;&#19982;&#29305;&#23450;&#25991;&#21270;&#30340;&#20027;&#23548;&#35821;&#35328;&#25552;&#31034;&#25110;&#31934;&#21046;&#35821;&#35328;&#28151;&#21512;&#39044;&#35757;&#32451;&#12290;</title><link>https://arxiv.org/abs/2402.13231</link><description>&lt;p&gt;
&#30740;&#31350;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#25991;&#21270;&#25972;&#21512;
&lt;/p&gt;
&lt;p&gt;
Investigating Cultural Alignment of Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13231
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#25991;&#21270;&#25972;&#21512;&#26041;&#38754;&#34920;&#29616;&#26356;&#20339;&#65292;&#29305;&#21035;&#26159;&#36890;&#36807;&#19982;&#29305;&#23450;&#25991;&#21270;&#30340;&#20027;&#23548;&#35821;&#35328;&#25552;&#31034;&#25110;&#31934;&#21046;&#35821;&#35328;&#28151;&#21512;&#39044;&#35757;&#32451;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38271;&#20037;&#20197;&#26469;&#65292;&#35821;&#35328;&#21644;&#25991;&#21270;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#20851;&#31995;&#19968;&#30452;&#26159;&#35821;&#35328;&#20154;&#31867;&#23398;&#39046;&#22495;&#25506;&#32034;&#30340;&#19968;&#20010;&#35838;&#39064;&#12290;&#34987;&#25512;&#24191;&#20026;&#38598;&#20307;&#20154;&#31867;&#30693;&#35782;&#24211;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#25552;&#20986;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#65306;&#36825;&#20123;&#27169;&#22411;&#26159;&#21542;&#30495;&#27491;&#27010;&#25324;&#20102;&#19981;&#21516;&#25991;&#21270;&#25152;&#37319;&#29992;&#30340;&#22810;&#26679;&#30693;&#35782;&#65311;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#20123;&#27169;&#22411;&#22312;&#20004;&#20010;&#32500;&#24230;&#19978;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#25991;&#21270;&#25972;&#21512;&#24615; -- &#39318;&#20808;&#65292;&#24403;&#25552;&#31034;&#20351;&#29992;&#29305;&#23450;&#25991;&#21270;&#30340;&#20027;&#23548;&#35821;&#35328;&#26102;&#65292;&#20854;&#27425;&#65292;&#24403;&#39044;&#20808;&#20351;&#29992;&#35813;&#25991;&#21270;&#37319;&#29992;&#30340;&#35821;&#35328;&#30340;&#31934;&#21046;&#28151;&#21512;&#36827;&#34892;&#39044;&#35757;&#32451;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#31038;&#20250;&#23398;&#35843;&#26597;&#26469;&#37327;&#21270;&#25991;&#21270;&#25972;&#21512;&#65292;&#23558;&#27169;&#22411;&#30340;&#21709;&#24212;&#19982;&#23454;&#38469;&#35843;&#26597;&#21442;&#19982;&#32773;&#20316;&#20026;&#21442;&#32771;&#36827;&#34892;&#27604;&#36739;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;LLMs&#29992;&#38463;&#25289;&#20271;&#35821;&#21644;&#33521;&#35821;&#20197;&#19981;&#21516;&#30340;&#39044;&#35757;&#32451;&#25968;&#25454;&#28151;&#21512;&#25552;&#31034;&#26469;&#22797;&#21046;&#22312;&#22467;&#21450;&#21644;&#32654;&#22269;&#21508;&#22320;&#36827;&#34892;&#30340;&#35843;&#26597;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13231v1 Announce Type: new  Abstract: The intricate relationship between language and culture has long been a subject of exploration within the realm of linguistic anthropology. Large Language Models (LLMs), promoted as repositories of collective human knowledge, raise a pivotal question: do these models genuinely encapsulate the diverse knowledge adopted by different cultures? Our study reveals that these models demonstrate greater cultural alignment along two dimensions -- firstly, when prompted with the dominant language of a specific culture, and secondly, when pretrained with a refined mixture of languages employed by that culture. We quantify cultural alignment by simulating sociological surveys, comparing model responses to those of actual survey participants as references. Specifically, we replicate a survey conducted in various regions of Egypt and the United States through prompting LLMs with different pretraining data mixtures in both Arabic and English with the p
&lt;/p&gt;</description></item><item><title>FUTURE-AI&#26159;&#31532;&#19968;&#20010;&#22269;&#38469;&#20849;&#35782;&#26694;&#26550;&#65292;&#20026;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#30340;&#21487;&#20449;AI&#24037;&#20855;&#24320;&#21457;&#21644;&#37096;&#32626;&#25552;&#20379;&#25351;&#23548;&#21407;&#21017;&#21644;&#26368;&#20339;&#23454;&#36341;&#12290;</title><link>http://arxiv.org/abs/2309.12325</link><description>&lt;p&gt;
FUTURE-AI&#65306;&#22312;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#30340;&#21487;&#20449;&#21644;&#21487;&#37096;&#32626;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#38469;&#20849;&#35782;&#25351;&#21335;
&lt;/p&gt;
&lt;p&gt;
FUTURE-AI: International consensus guideline for trustworthy and deployable artificial intelligence in healthcare. (arXiv:2309.12325v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12325
&lt;/p&gt;
&lt;p&gt;
FUTURE-AI&#26159;&#31532;&#19968;&#20010;&#22269;&#38469;&#20849;&#35782;&#26694;&#26550;&#65292;&#20026;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#30340;&#21487;&#20449;AI&#24037;&#20855;&#24320;&#21457;&#21644;&#37096;&#32626;&#25552;&#20379;&#25351;&#23548;&#21407;&#21017;&#21644;&#26368;&#20339;&#23454;&#36341;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#22312;&#21307;&#23398;&#21644;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21462;&#24471;&#20102;&#37325;&#22823;&#36827;&#23637;&#65292;&#20294;AI&#25216;&#26415;&#22312;&#29616;&#23454;&#20020;&#24202;&#23454;&#36341;&#20013;&#30340;&#37096;&#32626;&#21644;&#37319;&#29992;&#20173;&#21463;&#38480;&#12290;&#36817;&#24180;&#26469;&#65292;&#20154;&#20204;&#23545;&#21307;&#30103;AI&#30340;&#25216;&#26415;&#12289;&#20020;&#24202;&#12289;&#20262;&#29702;&#21644;&#27861;&#24459;&#39118;&#38505;&#25552;&#20986;&#20102;&#20851;&#27880;&#12290;&#20026;&#20102;&#22686;&#21152;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#37319;&#29992;&#65292;&#21307;&#30103;AI&#24037;&#20855;&#24517;&#39035;&#24471;&#21040;&#24739;&#32773;&#12289;&#20020;&#24202;&#21307;&#29983;&#12289;&#20581;&#24247;&#32452;&#32455;&#21644;&#24403;&#23616;&#30340;&#20449;&#20219;&#21644;&#25509;&#21463;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;FUTURE-AI&#25351;&#21335;&#20316;&#20026;&#31532;&#19968;&#20010;&#29992;&#20110;&#25351;&#23548;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#21487;&#20449;AI&#24037;&#20855;&#24320;&#21457;&#21644;&#37096;&#32626;&#30340;&#22269;&#38469;&#20849;&#35782;&#26694;&#26550;&#12290;FUTURE-AI&#32852;&#30431;&#25104;&#31435;&#20110;2021&#24180;&#65292;&#30446;&#21069;&#21253;&#25324;&#26469;&#33258;51&#20010;&#22269;&#23478;&#30340;118&#20301;&#36328;&#23398;&#31185;&#19987;&#23478;&#65292;&#20195;&#34920;&#20102;&#25152;&#26377;&#22823;&#27954;&#65292;&#21253;&#25324;AI&#31185;&#23398;&#23478;&#12289;&#20020;&#24202;&#21307;&#29983;&#12289;&#20262;&#29702;&#23398;&#23478;&#21644;&#31038;&#20250;&#31185;&#23398;&#23478;&#12290;&#22312;&#20026;&#26399;&#20004;&#24180;&#30340;&#26102;&#38388;&#37324;&#65292;&#32852;&#30431;&#36890;&#36807;&#36845;&#20195;&#36807;&#31243;&#23450;&#20041;&#20102;&#21487;&#20449;AI&#30340;&#25351;&#23548;&#21407;&#21017;&#21644;&#26368;&#20339;&#23454;&#36341;&#65292;&#20854;&#20013;&#21253;&#25324;
&lt;/p&gt;
&lt;p&gt;
Despite major advances in artificial intelligence (AI) for medicine and healthcare, the deployment and adoption of AI technologies remain limited in real-world clinical practice. In recent years, concerns have been raised about the technical, clinical, ethical and legal risks associated with medical AI. To increase real world adoption, it is essential that medical AI tools are trusted and accepted by patients, clinicians, health organisations and authorities. This work describes the FUTURE-AI guideline as the first international consensus framework for guiding the development and deployment of trustworthy AI tools in healthcare. The FUTURE-AI consortium was founded in 2021 and currently comprises 118 inter-disciplinary experts from 51 countries representing all continents, including AI scientists, clinicians, ethicists, and social scientists. Over a two-year period, the consortium defined guiding principles and best practices for trustworthy AI through an iterative process comprising a
&lt;/p&gt;</description></item></channel></rss>