<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#20316;&#20026;&#26377;&#38480;&#20803;&#20912;&#30422;&#27169;&#25311;&#30340;&#24555;&#36895;&#39640;&#20445;&#30495;&#24230;&#30340;&#20223;&#30495;&#22120;&#65292;&#24182;&#22312;Pine Island Glacier&#30340;&#30636;&#24577;&#27169;&#25311;&#20013;&#23637;&#31034;&#20102;&#19982;&#20256;&#32479;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#30456;&#27604;&#26356;&#20934;&#30830;&#30340;&#37325;&#29616;&#20912;&#30422;&#21402;&#24230;&#21644;&#36895;&#24230;&#30340;&#33021;&#21147;&#12290;&#21516;&#26102;&#65292;&#36825;&#20123;GNN&#25104;&#21151;&#25429;&#25417;&#21040;&#20102;&#26356;&#39640;&#24213;&#37096;&#29076;&#21270;&#36895;&#29575;&#24341;&#36215;&#30340;&#20912;&#36136;&#37327;&#25439;&#22833;&#21644;&#21152;&#36895;&#36807;&#31243;&#12290;&#22312;&#22270;&#24418;&#22788;&#29702;&#21333;&#20803;&#19978;&#23454;&#29616;&#30340;GNN&#20223;&#30495;&#22120;&#26174;&#31034;&#20986;&#39640;&#36798;50&#20493;&#30340;&#21152;&#36895;&#12290;</title><link>https://arxiv.org/abs/2402.05291</link><description>&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#20316;&#20026;&#26377;&#38480;&#20803;&#20912;&#30422;&#27169;&#25311;&#30340;&#24555;&#36895;&#39640;&#20445;&#30495;&#24230;&#30340;&#20223;&#30495;&#22120;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Networks as Fast and High-fidelity Emulators for Finite-Element Ice Sheet Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05291
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#20316;&#20026;&#26377;&#38480;&#20803;&#20912;&#30422;&#27169;&#25311;&#30340;&#24555;&#36895;&#39640;&#20445;&#30495;&#24230;&#30340;&#20223;&#30495;&#22120;&#65292;&#24182;&#22312;Pine Island Glacier&#30340;&#30636;&#24577;&#27169;&#25311;&#20013;&#23637;&#31034;&#20102;&#19982;&#20256;&#32479;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#30456;&#27604;&#26356;&#20934;&#30830;&#30340;&#37325;&#29616;&#20912;&#30422;&#21402;&#24230;&#21644;&#36895;&#24230;&#30340;&#33021;&#21147;&#12290;&#21516;&#26102;&#65292;&#36825;&#20123;GNN&#25104;&#21151;&#25429;&#25417;&#21040;&#20102;&#26356;&#39640;&#24213;&#37096;&#29076;&#21270;&#36895;&#29575;&#24341;&#36215;&#30340;&#20912;&#36136;&#37327;&#25439;&#22833;&#21644;&#21152;&#36895;&#36807;&#31243;&#12290;&#22312;&#22270;&#24418;&#22788;&#29702;&#21333;&#20803;&#19978;&#23454;&#29616;&#30340;GNN&#20223;&#30495;&#22120;&#26174;&#31034;&#20986;&#39640;&#36798;50&#20493;&#30340;&#21152;&#36895;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#20912;&#30422;&#21644;&#28023;&#24179;&#38754;&#31995;&#32479;&#27169;&#22411;&#65288;ISSM&#65289;&#30340;&#26377;&#38480;&#20803;&#26041;&#27861;&#21487;&#20197;&#24555;&#36895;&#20934;&#30830;&#22320;&#35299;&#20915;&#30001;Stokes&#26041;&#31243;&#25551;&#36848;&#30340;&#20912;&#21160;&#21147;&#23398;&#38382;&#39064;&#65292;&#20294;&#36825;&#31181;&#25968;&#20540;&#24314;&#27169;&#38656;&#35201;&#22312;&#20013;&#22830;&#22788;&#29702;&#21333;&#20803;&#65288;CPU&#65289;&#19978;&#36827;&#34892;&#23494;&#38598;&#30340;&#35745;&#31639;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#20316;&#20026;&#24555;&#36895;&#20195;&#29702;&#27169;&#22411;&#26469;&#20445;&#25345;ISSM&#30340;&#26377;&#38480;&#20803;&#32467;&#26500;&#12290;&#21033;&#29992;Pine Island Glacier&#65288;PIG&#65289;&#30340;20&#24180;&#30636;&#24577;&#27169;&#25311;&#65292;&#25105;&#20204;&#35757;&#32451;&#21644;&#27979;&#35797;&#20102;&#19977;&#20010;GNN&#65306;&#22270;&#21367;&#31215;&#32593;&#32476;&#65288;GCN&#65289;&#65292;&#22270;&#27880;&#24847;&#21147;&#32593;&#32476;&#65288;GAT&#65289;&#21644;&#31561;&#21464;&#22270;&#21367;&#31215;&#32593;&#32476;&#65288;EGCN&#65289;&#12290;&#36825;&#20123;GNN&#19982;&#32463;&#20856;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#65288;MLP&#65289;&#30456;&#27604;&#65292;&#33021;&#22815;&#26356;&#20934;&#30830;&#22320;&#37325;&#29616;&#20912;&#21402;&#24230;&#21644;&#36895;&#24230;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;PIG&#20013;&#65292;GNN&#25104;&#21151;&#25429;&#25417;&#21040;&#20102;&#30001;&#26356;&#39640;&#24213;&#37096;&#29076;&#21270;&#36895;&#29575;&#24341;&#36215;&#30340;&#20912;&#36136;&#37327;&#25439;&#22833;&#21644;&#21152;&#36895;&#12290;&#24403;&#25105;&#20204;&#30340;GNN&#20223;&#30495;&#22120;&#22312;&#22270;&#24418;&#22788;&#29702;&#21333;&#20803;&#65288;GPU&#65289;&#19978;&#23454;&#29616;&#26102;&#65292;&#23427;&#20204;&#26174;&#31034;&#20986;&#39640;&#36798;50&#20493;&#30340;&#21152;&#36895;&#12290;
&lt;/p&gt;
&lt;p&gt;
Although the finite element approach of the Ice-sheet and Sea-level System Model (ISSM) solves ice dynamics problems governed by Stokes equations quickly and accurately, such numerical modeling requires intensive computation on central processing units (CPU). In this study, we develop graph neural networks (GNN) as fast surrogate models to preserve the finite element structure of ISSM. Using the 20-year transient simulations in the Pine Island Glacier (PIG), we train and test three GNNs: graph convolutional network (GCN), graph attention network (GAT), and equivariant graph convolutional network (EGCN). These GNNs reproduce ice thickness and velocity with better accuracy than the classic convolutional neural network (CNN) and multi-layer perception (MLP). In particular, GNNs successfully capture the ice mass loss and acceleration induced by higher basal melting rates in the PIG. When our GNN emulators are implemented on graphic processing units (GPUs), they show up to 50 times faster c
&lt;/p&gt;</description></item></channel></rss>