<rss version="2.0"><channel><title>Chat Arxiv cs.CG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CG</description><item><title>&#21333;&#32431;&#22797;&#24418;&#27744;&#21270;&#23618;NervePool&#22312;&#27744;&#21270;&#22270;&#32467;&#26500;&#25968;&#25454;&#26102;&#65292;&#22522;&#20110;&#39030;&#28857;&#20998;&#21306;&#29983;&#25104;&#21333;&#32431;&#22797;&#24418;&#30340;&#20998;&#23618;&#34920;&#31034;&#65292;&#21487;&#20197;&#28789;&#27963;&#22320;&#24314;&#27169;&#26356;&#39640;&#38454;&#30340;&#20851;&#31995;&#65292;&#21516;&#26102;&#32553;&#23567;&#39640;&#32500;&#21333;&#32431;&#24418;&#65292;&#23454;&#29616;&#38477;&#37319;&#26679;&#65292;&#20943;&#23569;&#35745;&#31639;&#25104;&#26412;&#21644;&#20943;&#23569;&#36807;&#25311;&#21512;&#12290;</title><link>http://arxiv.org/abs/2305.06315</link><description>&lt;p&gt;
NervePool: &#19968;&#20010;&#21333;&#32431;&#22797;&#24418;&#27744;&#21270;&#23618;
&lt;/p&gt;
&lt;p&gt;
NervePool: A Simplicial Pooling Layer. (arXiv:2305.06315v1 [cs.CG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.06315
&lt;/p&gt;
&lt;p&gt;
&#21333;&#32431;&#22797;&#24418;&#27744;&#21270;&#23618;NervePool&#22312;&#27744;&#21270;&#22270;&#32467;&#26500;&#25968;&#25454;&#26102;&#65292;&#22522;&#20110;&#39030;&#28857;&#20998;&#21306;&#29983;&#25104;&#21333;&#32431;&#22797;&#24418;&#30340;&#20998;&#23618;&#34920;&#31034;&#65292;&#21487;&#20197;&#28789;&#27963;&#22320;&#24314;&#27169;&#26356;&#39640;&#38454;&#30340;&#20851;&#31995;&#65292;&#21516;&#26102;&#32553;&#23567;&#39640;&#32500;&#21333;&#32431;&#24418;&#65292;&#23454;&#29616;&#38477;&#37319;&#26679;&#65292;&#20943;&#23569;&#35745;&#31639;&#25104;&#26412;&#21644;&#20943;&#23569;&#36807;&#25311;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#22270;&#32467;&#26500;&#25968;&#25454;&#30340;&#28145;&#24230;&#23398;&#20064;&#38382;&#39064;&#65292;&#27744;&#21270;&#23618;&#23545;&#20110;&#38477;&#37319;&#26679;&#12289;&#20943;&#23569;&#35745;&#31639;&#25104;&#26412;&#21644;&#20943;&#23569;&#36807;&#25311;&#21512;&#37117;&#24456;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27744;&#21270;&#23618;&#65292;NervePool&#65292;&#36866;&#29992;&#20110;&#21333;&#32431;&#22797;&#24418;&#32467;&#26500;&#30340;&#25968;&#25454;&#65292;&#36825;&#31181;&#32467;&#26500;&#26159;&#22270;&#30340;&#25512;&#24191;&#65292;&#21253;&#25324;&#27604;&#39030;&#28857;&#21644;&#36793;&#26356;&#39640;&#32500;&#24230;&#30340;&#21333;&#32431;&#24418;&#65307;&#36825;&#31181;&#32467;&#26500;&#21487;&#20197;&#26356;&#28789;&#27963;&#22320;&#24314;&#27169;&#26356;&#39640;&#38454;&#30340;&#20851;&#31995;&#12290;&#25152;&#25552;&#20986;&#30340;&#21333;&#32431;&#22797;&#21512;&#32553;&#23567;&#26041;&#26696;&#22522;&#20110;&#39030;&#28857;&#30340;&#20998;&#21306;&#26500;&#24314;&#65292;&#36825;&#20351;&#24471;&#25105;&#20204;&#21487;&#20197;&#29983;&#25104;&#21333;&#32431;&#22797;&#24418;&#30340;&#20998;&#23618;&#34920;&#31034;&#65292;&#20197;&#19968;&#31181;&#23398;&#20064;&#30340;&#26041;&#24335;&#25240;&#21472;&#20449;&#24687;&#12290;NervePool&#24314;&#31435;&#22312;&#23398;&#20064;&#30340;&#39030;&#28857;&#32676;&#38598;&#20998;&#37197;&#30340;&#22522;&#30784;&#19978;&#65292;&#24182;&#20197;&#19968;&#31181;&#30830;&#23450;&#24615;&#30340;&#26041;&#24335;&#25193;&#23637;&#21040;&#39640;&#32500;&#21333;&#32431;&#24418;&#30340;&#32553;&#23567;&#12290;&#34429;&#28982;&#22312;&#23454;&#36341;&#20013;&#65292;&#27744;&#21270;&#25805;&#20316;&#26159;&#36890;&#36807;&#19968;&#31995;&#21015;&#30697;&#38453;&#36816;&#31639;&#26469;&#35745;&#31639;&#30340;&#65292;&#20294;&#26159;&#20854;&#25299;&#25169;&#21160;&#26426;&#26159;&#19968;&#20010;&#22522;&#20110;&#21333;&#32431;&#24418;&#26143;&#26143;&#30340;&#24182;&#38598;&#21644;&#31070;&#32463;&#22797;&#21512;&#20307;&#30340;&#38598;&#21512;&#26500;&#36896;&#12290;
&lt;/p&gt;
&lt;p&gt;
For deep learning problems on graph-structured data, pooling layers are important for down sampling, reducing computational cost, and to minimize overfitting. We define a pooling layer, NervePool, for data structured as simplicial complexes, which are generalizations of graphs that include higher-dimensional simplices beyond vertices and edges; this structure allows for greater flexibility in modeling higher-order relationships. The proposed simplicial coarsening scheme is built upon partitions of vertices, which allow us to generate hierarchical representations of simplicial complexes, collapsing information in a learned fashion. NervePool builds on the learned vertex cluster assignments and extends to coarsening of higher dimensional simplices in a deterministic fashion. While in practice, the pooling operations are computed via a series of matrix operations, the topological motivation is a set-theoretic construction based on unions of stars of simplices and the nerve complex
&lt;/p&gt;</description></item></channel></rss>