<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#35843;&#26597;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#38544;&#31169;&#23041;&#32961;&#21644;&#23545;&#31574;&#65292;&#24182;&#23545;&#27700;&#24179;&#32852;&#37030;&#23398;&#20064;&#12289;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#21644;&#36801;&#31227;&#32852;&#37030;&#23398;&#20064;&#30340;&#20856;&#22411;&#31867;&#22411;&#36827;&#34892;&#20102;&#20998;&#31867;&#21644;&#25551;&#36848;&#12290;</title><link>https://arxiv.org/abs/2402.00342</link><description>&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#20013;&#38544;&#31169;&#23041;&#32961;&#21644;&#23545;&#31574;&#30340;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Survey of Privacy Threats and Countermeasures in Federated Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00342
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35843;&#26597;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#38544;&#31169;&#23041;&#32961;&#21644;&#23545;&#31574;&#65292;&#24182;&#23545;&#27700;&#24179;&#32852;&#37030;&#23398;&#20064;&#12289;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#21644;&#36801;&#31227;&#32852;&#37030;&#23398;&#20064;&#30340;&#20856;&#22411;&#31867;&#22411;&#36827;&#34892;&#20102;&#20998;&#31867;&#21644;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#34987;&#24191;&#27867;&#35748;&#20026;&#26159;&#19968;&#31181;&#27880;&#37325;&#38544;&#31169;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#22240;&#20026;&#23458;&#25143;&#31471;&#20043;&#38388;&#27809;&#26377;&#30452;&#25509;&#20132;&#25442;&#35757;&#32451;&#25968;&#25454;&#12290;&#28982;&#32780;&#65292;&#32852;&#37030;&#23398;&#20064;&#20013;&#23384;&#22312;&#38544;&#31169;&#23041;&#32961;&#65292;&#24182;&#19988;&#24050;&#32463;&#23545;&#38544;&#31169;&#23545;&#31574;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#27880;&#24847;&#21040;&#24120;&#35265;&#21644;&#29420;&#29305;&#30340;&#38544;&#31169;&#23041;&#32961;&#22312;&#20856;&#22411;&#31867;&#22411;&#30340;&#32852;&#37030;&#23398;&#20064;&#20013;&#23578;&#26410;&#20197;&#20840;&#38754;&#21644;&#20855;&#20307;&#30340;&#26041;&#24335;&#36827;&#34892;&#20998;&#31867;&#21644;&#25551;&#36848;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#27700;&#24179;&#32852;&#37030;&#23398;&#20064;&#12289;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#21644;&#36801;&#31227;&#32852;&#37030;&#23398;&#20064;&#30340;&#38544;&#31169;&#23041;&#32961;&#21644;&#23545;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated learning is widely considered to be as a privacy-aware learning method because no training data is exchanged directly between clients. Nevertheless, there are threats to privacy in federated learning, and privacy countermeasures have been studied. However, we note that common and unique privacy threats among typical types of federated learning have not been categorized and described in a comprehensive and specific way. In this paper, we describe privacy threats and countermeasures for the typical types of federated learning; horizontal federated learning, vertical federated learning, and transfer federated learning.
&lt;/p&gt;</description></item></channel></rss>