<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#36229;&#36807;250,000&#20010;&#21807;&#19968;&#20107;&#23454;&#26680;&#26597;&#30340;&#20998;&#26512;&#65292;&#25506;&#31350;&#20102;&#22810;&#35821;&#35328;&#38169;&#35823;&#20449;&#24687;&#30340;&#26222;&#36941;&#24615;&#21644;&#21160;&#24577;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#37096;&#20998;&#38169;&#35823;&#20449;&#24687;&#33021;&#22815;&#31359;&#36234;&#35821;&#35328;&#38556;&#30861;&#65292;&#24182;&#19988;&#22312;&#30456;&#21516;&#35821;&#35328;&#20013;&#26356;&#26377;&#21487;&#33021;&#20256;&#25773;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#38169;&#35823;&#20449;&#24687;&#38543;&#26102;&#38388;&#28436;&#21464;&#24182;&#22312;&#19981;&#21516;&#35821;&#35328;&#38388;&#21457;&#29983;&#31361;&#21464;&#12290;</title><link>http://arxiv.org/abs/2310.18089</link><description>&lt;p&gt;
&#22312;&#32763;&#35793;&#20013;&#36855;&#22833;-&#22810;&#35821;&#35328;&#38169;&#35823;&#20449;&#24687;&#21450;&#20854;&#28436;&#21464;
&lt;/p&gt;
&lt;p&gt;
Lost in Translation -- Multilingual Misinformation and its Evolution. (arXiv:2310.18089v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18089
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#36229;&#36807;250,000&#20010;&#21807;&#19968;&#20107;&#23454;&#26680;&#26597;&#30340;&#20998;&#26512;&#65292;&#25506;&#31350;&#20102;&#22810;&#35821;&#35328;&#38169;&#35823;&#20449;&#24687;&#30340;&#26222;&#36941;&#24615;&#21644;&#21160;&#24577;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#37096;&#20998;&#38169;&#35823;&#20449;&#24687;&#33021;&#22815;&#31359;&#36234;&#35821;&#35328;&#38556;&#30861;&#65292;&#24182;&#19988;&#22312;&#30456;&#21516;&#35821;&#35328;&#20013;&#26356;&#26377;&#21487;&#33021;&#20256;&#25773;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#38169;&#35823;&#20449;&#24687;&#38543;&#26102;&#38388;&#28436;&#21464;&#24182;&#22312;&#19981;&#21516;&#35821;&#35328;&#38388;&#21457;&#29983;&#31361;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25968;&#23383;&#26102;&#20195;&#65292;&#35823;&#23548;&#21644;&#34394;&#20551;&#20449;&#24687;&#27491;&#22312;&#36805;&#36895;&#22312;&#21508;&#31181;&#35821;&#35328;&#21644;&#36793;&#30028;&#38388;&#20256;&#25773;&#65292;&#26500;&#25104;&#20102;&#26085;&#30410;&#22686;&#38271;&#30340;&#23041;&#32961;&#12290;&#26412;&#25991;&#36890;&#36807;&#23545;95&#31181;&#35821;&#35328;&#20013;&#36229;&#36807;250,000&#20010;&#21807;&#19968;&#20107;&#23454;&#26680;&#26597;&#30340;&#20998;&#26512;&#65292;&#25506;&#31350;&#20102;&#22810;&#35821;&#35328;&#38169;&#35823;&#20449;&#24687;&#30340;&#26222;&#36941;&#24615;&#21644;&#21160;&#24577;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#21457;&#29616;&#22823;&#22810;&#25968;&#38169;&#35823;&#20449;&#24687;&#20027;&#24352;&#20165;&#34987;&#20107;&#23454;&#26680;&#26597;&#19968;&#27425;&#65292;&#20294;11.7%&#30340;&#20027;&#24352;(&#36229;&#36807;21,000&#20010;)&#34987;&#26680;&#26597;&#22810;&#27425;&#12290;&#36816;&#29992;&#20107;&#23454;&#26680;&#26597;&#20316;&#20026;&#38169;&#35823;&#20449;&#24687;&#20256;&#25773;&#30340;&#20195;&#29702;&#25351;&#26631;&#65292;&#25105;&#20204;&#21457;&#29616;33%&#30340;&#37325;&#22797;&#20027;&#24352;&#31359;&#36234;&#35821;&#35328;&#38556;&#30861;&#65292;&#26263;&#31034;&#37096;&#20998;&#38169;&#35823;&#20449;&#24687;&#28183;&#36879;&#20102;&#35821;&#35328;&#36793;&#30028;&#12290;&#28982;&#32780;&#65292;&#25193;&#25955;&#27169;&#24335;&#34920;&#29616;&#20986;&#36739;&#24378;&#30340;&#21516;&#36136;&#24615;&#65292;&#38169;&#35823;&#20449;&#24687;&#26356;&#26377;&#21487;&#33021;&#22312;&#30456;&#21516;&#35821;&#35328;&#20013;&#20256;&#25773;&#12290;&#20026;&#30740;&#31350;&#20027;&#24352;&#38543;&#26102;&#38388;&#30340;&#28436;&#21464;&#21644;&#36328;&#35821;&#35328;&#30340;&#31361;&#21464;&#65292;&#25105;&#20204;&#20351;&#29992;&#22810;&#35821;&#35328;&#21477;&#23376;&#23884;&#20837;&#26469;&#34920;&#31034;&#20107;&#23454;&#26680;&#26597;&#65292;&#24182;&#23545;&#35821;&#20041;&#30456;&#20284;&#30340;&#20027;&#24352;&#36827;&#34892;&#32858;&#31867;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#36830;&#25509;&#32452;&#20214;&#21644;&#26368;&#30701;&#36335;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;
Misinformation and disinformation are growing threats in the digital age, spreading rapidly across languages and borders. This paper investigates the prevalence and dynamics of multilingual misinformation through an analysis of over 250,000 unique fact-checks spanning 95 languages. First, we find that while the majority of misinformation claims are only fact-checked once, 11.7%, corresponding to more than 21,000 claims, are checked multiple times. Using fact-checks as a proxy for the spread of misinformation, we find 33% of repeated claims cross linguistic boundaries, suggesting that some misinformation permeates language barriers. However, spreading patterns exhibit strong homophily, with misinformation more likely to spread within the same language. To study the evolution of claims over time and mutations across languages, we represent fact-checks with multilingual sentence embeddings and cluster semantically similar claims. We analyze the connected components and shortest paths conn
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;Matroid&#32422;&#26463;&#19979;&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#20013;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#27969;&#24335;&#31639;&#27861;&#21644;&#19981;&#21487;&#33021;&#30340;&#32467;&#26524;&#26469;&#26435;&#34913;&#25928;&#29575;&#12289;&#36136;&#37327;&#21644;&#20844;&#24179;&#24615;&#65292;&#24182;&#22312;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#23454;&#35777;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2305.15118</link><description>&lt;p&gt;
&#22312;&#19968;&#20010;Matroid&#32422;&#26463;&#19979;&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#20013;&#30340;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
Fairness in Streaming Submodular Maximization over a Matroid Constraint. (arXiv:2305.15118v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15118
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;Matroid&#32422;&#26463;&#19979;&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#20013;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#27969;&#24335;&#31639;&#27861;&#21644;&#19981;&#21487;&#33021;&#30340;&#32467;&#26524;&#26469;&#26435;&#34913;&#25928;&#29575;&#12289;&#36136;&#37327;&#21644;&#20844;&#24179;&#24615;&#65292;&#24182;&#22312;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#23454;&#35777;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#26159;&#20174;&#19968;&#20010;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#20013;&#36873;&#25321;&#19968;&#20010;&#20195;&#34920;&#24615;&#23376;&#38598;&#30340;&#33258;&#28982;&#27169;&#22411;&#12290;&#22914;&#26524;&#25968;&#25454;&#28857;&#20855;&#26377;&#25935;&#24863;&#23646;&#24615;&#65292;&#22914;&#24615;&#21035;&#25110;&#31181;&#26063;&#65292;&#24378;&#21046;&#20844;&#24179;&#24615;&#20197;&#36991;&#20813;&#20559;&#35265;&#21644;&#27495;&#35270;&#21464;&#24471;&#37325;&#35201;&#12290;&#36825;&#24341;&#36215;&#20102;&#23545;&#24320;&#21457;&#20844;&#24179;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#26497;&#22823;&#20852;&#36259;&#12290;&#26368;&#36817;&#65292;&#36825;&#26679;&#30340;&#31639;&#27861;&#24050;&#32463;&#34987;&#24320;&#21457;&#29992;&#20110;&#22522;&#20110;&#22522;&#25968;&#32422;&#26463;&#30340;&#21333;&#35843;&#23376;&#27169;&#26368;&#22823;&#21270;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#30340;&#33258;&#28982;&#25512;&#24191;&#21040;&#19968;&#20010;Matroid&#32422;&#26463;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#27969;&#24335;&#31639;&#27861;&#20197;&#21450;&#19981;&#21487;&#33021;&#30340;&#32467;&#26524;&#65292;&#36825;&#20123;&#32467;&#26524;&#22312;&#25928;&#29575;&#12289;&#36136;&#37327;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#25552;&#20379;&#20102;&#26435;&#34913;&#12290;&#25105;&#20204;&#22312;&#19968;&#31995;&#21015;&#30693;&#21517;&#30340;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#23545;&#25105;&#20204;&#30340;&#21457;&#29616;&#36827;&#34892;&#20102;&#32463;&#39564;&#35777;&#23454;&#65306;&#22522;&#20110;&#31034;&#20363;&#30340;&#32858;&#31867;&#12289;&#30005;&#24433;&#25512;&#33616;&#21644;&#31038;&#20132;&#32593;&#32476;&#20013;&#30340;&#26368;&#22823;&#35206;&#30422;&#12290;
&lt;/p&gt;
&lt;p&gt;
Streaming submodular maximization is a natural model for the task of selecting a representative subset from a large-scale dataset. If datapoints have sensitive attributes such as gender or race, it becomes important to enforce fairness to avoid bias and discrimination. This has spurred significant interest in developing fair machine learning algorithms. Recently, such algorithms have been developed for monotone submodular maximization under a cardinality constraint.  In this paper, we study the natural generalization of this problem to a matroid constraint. We give streaming algorithms as well as impossibility results that provide trade-offs between efficiency, quality and fairness. We validate our findings empirically on a range of well-known real-world applications: exemplar-based clustering, movie recommendation, and maximum coverage in social networks.
&lt;/p&gt;</description></item></channel></rss>