<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#25552;&#20986;&#19968;&#31181;&#26032;&#22411;&#21452;&#33258;&#21160;&#32534;&#30721;&#22120;&#27169;&#22411;(TAE)&#65292;&#36890;&#36807;&#23558;&#28508;&#22312;&#34920;&#31034;&#36716;&#25442;&#20026;&#21487;&#20998;&#31163;&#34920;&#31034;&#26469;&#35299;&#20915;&#32593;&#32476;&#25915;&#20987;&#26816;&#27979;&#20013;&#28151;&#21512;&#34920;&#31034;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2403.15509</link><description>&lt;p&gt;
&#21452;&#33258;&#21160;&#32534;&#30721;&#22120;&#27169;&#22411;&#29992;&#20110;&#23398;&#20064;&#32593;&#32476;&#25915;&#20987;&#26816;&#27979;&#20013;&#30340;&#21487;&#20998;&#31163;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Twin Auto-Encoder Model for Learning Separable Representation in Cyberattack Detection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15509
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#19968;&#31181;&#26032;&#22411;&#21452;&#33258;&#21160;&#32534;&#30721;&#22120;&#27169;&#22411;(TAE)&#65292;&#36890;&#36807;&#23558;&#28508;&#22312;&#34920;&#31034;&#36716;&#25442;&#20026;&#21487;&#20998;&#31163;&#34920;&#31034;&#26469;&#35299;&#20915;&#32593;&#32476;&#25915;&#20987;&#26816;&#27979;&#20013;&#28151;&#21512;&#34920;&#31034;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34920;&#24449;&#23398;&#20064;&#22312;&#32593;&#32476;&#25915;&#20987;&#26816;&#27979;&#31561;&#35768;&#22810;&#38382;&#39064;&#30340;&#25104;&#21151;&#20013;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#22823;&#22810;&#25968;&#32593;&#32476;&#25915;&#20987;&#26816;&#27979;&#30340;&#34920;&#24449;&#23398;&#20064;&#26041;&#27861;&#22522;&#20110;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;AE&#65289;&#27169;&#22411;&#30340;&#28508;&#22312;&#21521;&#37327;&#12290;&#20026;&#20102;&#35299;&#20915;AEs&#34920;&#31034;&#20013;&#28151;&#21512;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#21452;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;TAE&#65289;&#30340;&#26032;&#22411;&#27169;&#22411;&#12290;TAE&#23558;&#28508;&#22312;&#34920;&#31034;&#30830;&#23450;&#22320;&#36716;&#25442;&#20026;&#26356;&#26131;&#21306;&#20998;&#30340;&#34920;&#31034;&#65292;&#21363;\textit{&#21487;&#20998;&#31163;&#34920;&#31034;}&#65292;&#24182;&#22312;&#36755;&#20986;&#31471;&#37325;&#24314;&#21487;&#20998;&#31163;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15509v1 Announce Type: cross  Abstract: Representation Learning (RL) plays a pivotal role in the success of many problems including cyberattack detection. Most of the RL methods for cyberattack detection are based on the latent vector of Auto-Encoder (AE) models. An AE transforms raw data into a new latent representation that better exposes the underlying characteristics of the input data. Thus, it is very useful for identifying cyberattacks. However, due to the heterogeneity and sophistication of cyberattacks, the representation of AEs is often entangled/mixed resulting in the difficulty for downstream attack detection models. To tackle this problem, we propose a novel mod called Twin Auto-Encoder (TAE). TAE deterministically transforms the latent representation into a more distinguishable representation namely the \textit{separable representation} and the reconstructsuct the separable representation at the output. The output of TAE called the \textit{reconstruction represe
&lt;/p&gt;</description></item></channel></rss>