<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#20197;Booking.com&#20026;&#22522;&#30784;&#65292;&#20197;&#21487;&#35270;&#21270;&#20010;&#20154;&#25968;&#25454;&#27969;&#20026;&#30740;&#31350;&#65292;&#23637;&#31034;&#20844;&#21496;&#22914;&#20309;&#20998;&#20139;&#28040;&#36153;&#32773;&#20010;&#20154;&#25968;&#25454;&#65292;&#24182;&#35752;&#35770;&#20351;&#29992;&#38544;&#31169;&#25919;&#31574;&#21578;&#30693;&#23458;&#25143;&#20010;&#20154;&#25968;&#25454;&#27969;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;&#26412;&#26696;&#20363;&#30740;&#31350;&#20026;&#26410;&#26469;&#26356;&#20197;&#25968;&#25454;&#27969;&#20026;&#23548;&#21521;&#30340;&#38544;&#31169;&#25919;&#31574;&#20998;&#26512;&#21644;&#24314;&#31435;&#26356;&#20840;&#38754;&#30340;&#20010;&#20154;&#25968;&#25454;&#27969;&#26412;&#20307;&#35770;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;</title><link>http://arxiv.org/abs/2304.09603</link><description>&lt;p&gt;
&#21487;&#35270;&#21270;&#20010;&#20154;&#25968;&#25454;&#27969;&#65306;&#20197;Booking.com&#20026;&#20363;&#30340;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Visualising Personal Data Flows: Insights from a Case Study of Booking.com. (arXiv:2304.09603v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09603
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20197;Booking.com&#20026;&#22522;&#30784;&#65292;&#20197;&#21487;&#35270;&#21270;&#20010;&#20154;&#25968;&#25454;&#27969;&#20026;&#30740;&#31350;&#65292;&#23637;&#31034;&#20844;&#21496;&#22914;&#20309;&#20998;&#20139;&#28040;&#36153;&#32773;&#20010;&#20154;&#25968;&#25454;&#65292;&#24182;&#35752;&#35770;&#20351;&#29992;&#38544;&#31169;&#25919;&#31574;&#21578;&#30693;&#23458;&#25143;&#20010;&#20154;&#25968;&#25454;&#27969;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;&#26412;&#26696;&#20363;&#30740;&#31350;&#20026;&#26410;&#26469;&#26356;&#20197;&#25968;&#25454;&#27969;&#20026;&#23548;&#21521;&#30340;&#38544;&#31169;&#25919;&#31574;&#20998;&#26512;&#21644;&#24314;&#31435;&#26356;&#20840;&#38754;&#30340;&#20010;&#20154;&#25968;&#25454;&#27969;&#26412;&#20307;&#35770;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21830;&#19994;&#26426;&#26500;&#25345;&#26377;&#21644;&#22788;&#29702;&#30340;&#20010;&#20154;&#25968;&#25454;&#37327;&#36234;&#26469;&#36234;&#22810;&#12290;&#25919;&#31574;&#21644;&#27861;&#24459;&#19981;&#26029;&#21464;&#21270;&#65292;&#35201;&#27714;&#36825;&#20123;&#20844;&#21496;&#22312;&#25910;&#38598;&#12289;&#23384;&#20648;&#12289;&#22788;&#29702;&#21644;&#20849;&#20139;&#36825;&#20123;&#25968;&#25454;&#26041;&#38754;&#26356;&#21152;&#36879;&#26126;&#12290;&#26412;&#25991;&#25253;&#21578;&#20102;&#25105;&#20204;&#20197;Booking.com&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#20174;&#20182;&#20204;&#30340;&#38544;&#31169;&#25919;&#31574;&#20013;&#25552;&#21462;&#20010;&#20154;&#25968;&#25454;&#27969;&#30340;&#21487;&#35270;&#21270;&#24037;&#20316;&#12290;&#36890;&#36807;&#23637;&#31034;&#35813;&#20844;&#21496;&#22914;&#20309;&#20998;&#20139;&#20854;&#28040;&#36153;&#32773;&#30340;&#20010;&#20154;&#25968;&#25454;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#38382;&#39064;&#65292;&#24182;&#25193;&#23637;&#20102;&#26377;&#20851;&#20351;&#29992;&#38544;&#31169;&#25919;&#31574;&#21578;&#30693;&#23458;&#25143;&#20010;&#20154;&#25968;&#25454;&#27969;&#33539;&#22260;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#30340;&#35752;&#35770;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#26412;&#26696;&#20363;&#30740;&#31350;&#21487;&#20197;&#20026;&#26410;&#26469;&#26356;&#20197;&#25968;&#25454;&#27969;&#20026;&#23548;&#21521;&#30340;&#38544;&#31169;&#25919;&#31574;&#20998;&#26512;&#21644;&#22312;&#22797;&#26434;&#21830;&#19994;&#29983;&#24577;&#31995;&#32479;&#20013;&#24314;&#31435;&#26356;&#20840;&#38754;&#30340;&#20010;&#20154;&#25968;&#25454;&#27969;&#26412;&#20307;&#35770;&#30340;&#30740;&#31350;&#25552;&#20379;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;
Commercial organisations are holding and processing an ever-increasing amount of personal data. Policies and laws are continually changing to require these companies to be more transparent regarding collection, storage, processing and sharing of this data. This paper reports our work of taking Booking.com as a case study to visualise personal data flows extracted from their privacy policy. By showcasing how the company shares its consumers' personal data, we raise questions and extend discussions on the challenges and limitations of using privacy policy to inform customers the true scale and landscape of personal data flows. More importantly, this case study can inform us about future research on more data flow-oriented privacy policy analysis and on the construction of a more comprehensive ontology on personal data flows in complicated business ecosystems.
&lt;/p&gt;</description></item></channel></rss>