<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#21487;&#35777;&#40657;&#30418;&#25915;&#20987;&#65292;&#33021;&#22815;&#20445;&#35777;&#25915;&#20987;&#25104;&#21151;&#29575;&#65292;&#35774;&#35745;&#20102;&#22810;&#31181;&#26032;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2304.04343</link><description>&lt;p&gt;
&#21487;&#35777;&#40657;&#30418;&#25915;&#20987;&#65306;&#30830;&#20445;&#23545;&#25239;&#24615;&#26679;&#26412;&#30340;&#25915;&#20987;&#25104;&#21151;&#29575;
&lt;/p&gt;
&lt;p&gt;
Certifiable Black-Box Attack: Ensuring Provably Successful Attack for Adversarial Examples. (arXiv:2304.04343v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#21487;&#35777;&#40657;&#30418;&#25915;&#20987;&#65292;&#33021;&#22815;&#20445;&#35777;&#25915;&#20987;&#25104;&#21151;&#29575;&#65292;&#35774;&#35745;&#20102;&#22810;&#31181;&#26032;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#40657;&#30418;&#23545;&#25239;&#25915;&#20987;&#20855;&#26377;&#30772;&#22351;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#24378;&#22823;&#28508;&#21147;&#12290;&#29616;&#26377;&#30340;&#40657;&#30418;&#23545;&#25239;&#25915;&#20987;&#36890;&#36807;&#36845;&#20195;&#26597;&#35810;&#30446;&#26631;&#27169;&#22411;&#21644;/&#25110;&#21033;&#29992;&#26412;&#22320;&#20195;&#29702;&#27169;&#22411;&#30340;&#21487;&#36716;&#31227;&#24615;&#26469;&#21046;&#20316;&#23545;&#25239;&#26679;&#26412;&#12290;&#24403;&#23454;&#39564;&#35774;&#35745;&#25915;&#20987;&#26102;&#65292;&#25915;&#20987;&#26159;&#21542;&#25104;&#21151;&#23545;&#25915;&#20987;&#32773;&#26469;&#35828;&#20173;&#28982;&#26159;&#26410;&#30693;&#30340;&#12290;&#26412;&#25991;&#36890;&#36807;&#20462;&#25913;&#38543;&#26426;&#24179;&#28369;&#24615;&#29702;&#35770;&#65292;&#39318;&#27425;&#30740;&#31350;&#20102;&#21487;&#35777;&#40657;&#30418;&#25915;&#20987;&#30340;&#26032;&#33539;&#20363;&#65292;&#33021;&#22815;&#20445;&#35777;&#21046;&#20316;&#30340;&#23545;&#25239;&#26679;&#26412;&#30340;&#25915;&#20987;&#25104;&#21151;&#29575;&#65292;&#20026;&#27492;&#35774;&#35745;&#20102;&#22810;&#31181;&#26032;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
Black-box adversarial attacks have shown strong potential to subvert machine learning models. Existing black-box adversarial attacks craft the adversarial examples by iteratively querying the target model and/or leveraging the transferability of a local surrogate model. Whether such attack can succeed remains unknown to the adversary when empirically designing the attack. In this paper, to our best knowledge, we take the first step to study a new paradigm of adversarial attacks -- certifiable black-box attack that can guarantee the attack success rate of the crafted adversarial examples. Specifically, we revise the randomized smoothing to establish novel theories for ensuring the attack success rate of the adversarial examples. To craft the adversarial examples with the certifiable attack success rate (CASR) guarantee, we design several novel techniques, including a randomized query method to query the target model, an initialization method with smoothed self-supervised perturbation to
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36229;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#38598;&#25104;&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;&#65292;&#20351;&#29992;&#36229;&#22270;&#25429;&#25417;&#31471;&#21475;&#25195;&#25551;&#25915;&#20987;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#20351;&#29992;&#27966;&#29983;&#30340;&#24230;&#37327;&#26469;&#35757;&#32451;NIDS&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#39640;&#31934;&#24230;&#12289;&#39640;&#20934;&#30830;&#29575;&#12289;&#39640;&#21484;&#22238;&#29575;&#24615;&#33021;&#19979;&#23454;&#26102;&#30417;&#27979;&#21644;&#26816;&#27979;&#31471;&#21475;&#25195;&#25551;&#27963;&#21160;&#12289;&#20854;&#20182;&#31867;&#22411;&#30340;&#25915;&#20987;&#21644;&#25932;&#23545;&#20837;&#20405;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;NIDS&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2211.03933</link><description>&lt;p&gt;
&#22522;&#20110;&#36229;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#38598;&#25104;&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
A Hypergraph-Based Machine Learning Ensemble Network Intrusion Detection System. (arXiv:2211.03933v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.03933
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36229;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#38598;&#25104;&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;&#65292;&#20351;&#29992;&#36229;&#22270;&#25429;&#25417;&#31471;&#21475;&#25195;&#25551;&#25915;&#20987;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#20351;&#29992;&#27966;&#29983;&#30340;&#24230;&#37327;&#26469;&#35757;&#32451;NIDS&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#39640;&#31934;&#24230;&#12289;&#39640;&#20934;&#30830;&#29575;&#12289;&#39640;&#21484;&#22238;&#29575;&#24615;&#33021;&#19979;&#23454;&#26102;&#30417;&#27979;&#21644;&#26816;&#27979;&#31471;&#21475;&#25195;&#25551;&#27963;&#21160;&#12289;&#20854;&#20182;&#31867;&#22411;&#30340;&#25915;&#20987;&#21644;&#25932;&#23545;&#20837;&#20405;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;NIDS&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;(NIDS)&#22312;&#26816;&#27979;&#24694;&#24847;&#25915;&#20987;&#26102;&#20173;&#28982;&#38754;&#20020;&#25361;&#25112;&#12290;NIDS&#36890;&#24120;&#22312;&#31163;&#32447;&#29366;&#24577;&#19979;&#24320;&#21457;&#65292;&#20294;&#38754;&#23545;&#33258;&#21160;&#29983;&#25104;&#30340;&#31471;&#21475;&#25195;&#25551;&#28183;&#36879;&#23581;&#35797;&#26102;&#65292;&#20250;&#23548;&#33268;&#20174;&#23545;&#25163;&#36866;&#24212;&#21040;NIDS&#21709;&#24212;&#30340;&#26174;&#30528;&#26102;&#38388;&#28382;&#21518;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#20197;Internet&#21327;&#35758;&#22320;&#22336;&#21644;&#30446;&#26631;&#31471;&#21475;&#20026;&#37325;&#28857;&#30340;&#36229;&#22270;&#26469;&#25429;&#25417;&#31471;&#21475;&#25195;&#25551;&#25915;&#20987;&#30340;&#28436;&#21270;&#27169;&#24335;&#12290;&#28982;&#21518;&#20351;&#29992;&#27966;&#29983;&#30340;&#22522;&#20110;&#36229;&#22270;&#30340;&#24230;&#37327;&#26469;&#35757;&#32451;&#19968;&#20010;&#38598;&#25104;&#26426;&#22120;&#23398;&#20064;(ML)&#30340;NIDS&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#39640;&#31934;&#24230;&#12289;&#39640;&#20934;&#30830;&#29575;&#12289;&#39640;&#21484;&#22238;&#29575;&#24615;&#33021;&#19979;&#23454;&#26102;&#35843;&#25972;&#65292;&#30417;&#27979;&#21644;&#26816;&#27979;&#31471;&#21475;&#25195;&#25551;&#27963;&#21160;&#12289;&#20854;&#20182;&#31867;&#22411;&#30340;&#25915;&#20987;&#21644;&#25932;&#23545;&#20837;&#20405;&#12290;&#36825;&#20010;ML&#33258;&#36866;&#24212;&#30340;NIDS&#26159;&#36890;&#36807;&#20197;&#19979;&#20960;&#20010;&#37096;&#20998;&#30340;&#32452;&#21512;&#24320;&#21457;&#20986;&#26469;&#30340;&#65306;(1)&#20837;&#20405;&#31034;&#20363;&#65292;(2)NIDS&#26356;&#26032;&#35268;&#21017;&#65292;(3)&#35302;&#21457;NIDS&#37325;&#26032;&#35757;&#32451;&#35831;&#27714;&#30340;&#25915;&#20987;&#38408;&#20540;&#36873;&#25321;&#65292;&#20197;&#21450;(4)&#22312;&#27809;&#26377;&#20808;&#21069;&#32593;&#32476;&#24615;&#36136;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#30340;&#29983;&#20135;&#29615;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;
Network intrusion detection systems (NIDS) to detect malicious attacks continue to meet challenges. NIDS are often developed offline while they face auto-generated port scan infiltration attempts, resulting in a significant time lag from adversarial adaption to NIDS response. To address these challenges, we use hypergraphs focused on internet protocol addresses and destination ports to capture evolving patterns of port scan attacks. The derived set of hypergraph-based metrics are then used to train an ensemble machine learning (ML) based NIDS that allows for real-time adaption in monitoring and detecting port scanning activities, other types of attacks, and adversarial intrusions at high accuracy, precision and recall performances. This ML adapting NIDS was developed through the combination of (1) intrusion examples, (2) NIDS update rules, (3) attack threshold choices to trigger NIDS retraining requests, and (4) a production environment with no prior knowledge of the nature of network 
&lt;/p&gt;</description></item></channel></rss>