<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#25552;&#20986;&#19968;&#31181;&#29992;&#20110;&#20013;&#39118;&#20998;&#21106;&#30340;&#21512;&#25104;&#26694;&#26550;&#65292;&#20351;&#29992;&#30149;&#21464;&#29305;&#23450;&#22686;&#24378;&#31574;&#30053;&#25193;&#23637;&#20102;SynthSeg&#26041;&#27861;&#65292;&#36890;&#36807;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#23454;&#29616;&#23545;&#20581;&#24247;&#32452;&#32455;&#21644;&#30149;&#29702;&#30149;&#21464;&#30340;&#20998;&#21106;&#65292;&#26080;&#38656;&#29305;&#23450;&#24207;&#21015;&#30340;&#35757;&#32451;&#25968;&#25454;&#65292;&#22312;&#39046;&#22495;&#20869;&#21644;&#39046;&#22495;&#22806;&#25968;&#25454;&#38598;&#30340;&#35780;&#20272;&#20013;&#34920;&#29616;&#20986;&#40065;&#26834;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2404.01946</link><description>&lt;p&gt;
&#29992;&#20110;&#40065;&#26834;&#24615;&#20013;&#39118;&#20998;&#21106;&#30340;&#21512;&#25104;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Synthetic Data for Robust Stroke Segmentation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01946
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#19968;&#31181;&#29992;&#20110;&#20013;&#39118;&#20998;&#21106;&#30340;&#21512;&#25104;&#26694;&#26550;&#65292;&#20351;&#29992;&#30149;&#21464;&#29305;&#23450;&#22686;&#24378;&#31574;&#30053;&#25193;&#23637;&#20102;SynthSeg&#26041;&#27861;&#65292;&#36890;&#36807;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#23454;&#29616;&#23545;&#20581;&#24247;&#32452;&#32455;&#21644;&#30149;&#29702;&#30149;&#21464;&#30340;&#20998;&#21106;&#65292;&#26080;&#38656;&#29305;&#23450;&#24207;&#21015;&#30340;&#35757;&#32451;&#25968;&#25454;&#65292;&#22312;&#39046;&#22495;&#20869;&#21644;&#39046;&#22495;&#22806;&#25968;&#25454;&#38598;&#30340;&#35780;&#20272;&#20013;&#34920;&#29616;&#20986;&#40065;&#26834;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01946v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449; &#25688;&#35201;&#65306;&#30446;&#21069;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#31070;&#32463;&#24433;&#20687;&#35821;&#20041;&#20998;&#21106;&#38656;&#35201;&#39640;&#20998;&#36776;&#29575;&#25195;&#25551;&#21644;&#22823;&#37327;&#27880;&#37322;&#25968;&#25454;&#38598;&#65292;&#36825;&#32473;&#20020;&#24202;&#36866;&#29992;&#24615;&#24102;&#26469;&#20102;&#26174;&#33879;&#38556;&#30861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21512;&#25104;&#26694;&#26550;&#65292;&#29992;&#20110;&#30149;&#21464;&#20998;&#21106;&#20219;&#21153;&#65292;&#25193;&#23637;&#20102;&#24050;&#24314;&#31435;&#30340;SynthSeg&#26041;&#27861;&#30340;&#33021;&#21147;&#65292;&#20197;&#36866;&#24212;&#20855;&#26377;&#30149;&#21464;&#29305;&#23450;&#22686;&#24378;&#31574;&#30053;&#30340;&#22823;&#22411;&#24322;&#36136;&#30149;&#21464;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;&#20174;&#20581;&#24247;&#21644;&#20013;&#39118;&#25968;&#25454;&#38598;&#27966;&#29983;&#30340;&#26631;&#31614;&#26144;&#23556;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#22312;&#36825;&#37324;&#28436;&#31034;&#20102;UNet&#26550;&#26500;&#65292;&#20419;&#36827;&#20102;&#20581;&#24247;&#32452;&#32455;&#21644;&#30149;&#29702;&#30149;&#21464;&#30340;&#20998;&#21106;&#65292;&#32780;&#26080;&#38656;&#29305;&#23450;&#20110;&#24207;&#21015;&#30340;&#35757;&#32451;&#25968;&#25454;&#12290;&#38024;&#23545;&#39046;&#22495;&#20869;&#21644;&#39046;&#22495;&#22806;&#65288;OOD&#65289;&#25968;&#25454;&#38598;&#36827;&#34892;&#35780;&#20272;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#34920;&#29616;&#20986;&#40065;&#26834;&#24615;&#33021;&#65292;&#19982;&#35757;&#32451;&#39046;&#22495;&#20869;&#30340;&#24403;&#21069;&#26041;&#27861;&#30456;&#23218;&#32654;&#65292;&#24182;&#22312;OOD&#25968;&#25454;&#19978;&#26174;&#30528;&#20248;&#20110;&#23427;&#20204;&#12290;&#36825;&#19968;&#36129;&#29486;&#26377;&#26395;&#25512;&#21160;&#21307;&#23398;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01946v1 Announce Type: cross  Abstract: Deep learning-based semantic segmentation in neuroimaging currently requires high-resolution scans and extensive annotated datasets, posing significant barriers to clinical applicability. We present a novel synthetic framework for the task of lesion segmentation, extending the capabilities of the established SynthSeg approach to accommodate large heterogeneous pathologies with lesion-specific augmentation strategies. Our method trains deep learning models, demonstrated here with the UNet architecture, using label maps derived from healthy and stroke datasets, facilitating the segmentation of both healthy tissue and pathological lesions without sequence-specific training data. Evaluated against in-domain and out-of-domain (OOD) datasets, our framework demonstrates robust performance, rivaling current methods within the training domain and significantly outperforming them on OOD data. This contribution holds promise for advancing medical
&lt;/p&gt;</description></item><item><title>JMA&#26159;&#19968;&#31181;&#36890;&#29992;&#31639;&#27861;&#65292;&#29992;&#20110;&#29983;&#25104;&#20960;&#20046;&#26368;&#20248;&#30340;&#23450;&#21521;&#23545;&#25239;&#26679;&#26412;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;Jacobian&#24341;&#36215;&#30340;&#39532;&#27663;&#36317;&#31163;&#65292;&#32771;&#34385;&#20102;&#23558;&#36755;&#20837;&#26679;&#26412;&#30340;&#28508;&#22312;&#31354;&#38388;&#34920;&#31034;&#22312;&#32473;&#23450;&#26041;&#21521;&#19978;&#31227;&#21160;&#25152;&#38656;&#30340;&#25237;&#20837;&#12290;&#35813;&#31639;&#27861;&#22312;&#35299;&#20915;&#23545;&#25239;&#26679;&#26412;&#38382;&#39064;&#26041;&#38754;&#25552;&#20379;&#20102;&#26368;&#20248;&#35299;&#12290;</title><link>http://arxiv.org/abs/2401.01199</link><description>&lt;p&gt;
JMA:&#19968;&#31181;&#24555;&#36895;&#29983;&#25104;&#20960;&#20046;&#26368;&#20248;&#23450;&#21521;&#23545;&#25239;&#26679;&#26412;&#30340;&#36890;&#29992;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
JMA: a General Algorithm to Craft Nearly Optimal Targeted Adversarial Example. (arXiv:2401.01199v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01199
&lt;/p&gt;
&lt;p&gt;
JMA&#26159;&#19968;&#31181;&#36890;&#29992;&#31639;&#27861;&#65292;&#29992;&#20110;&#29983;&#25104;&#20960;&#20046;&#26368;&#20248;&#30340;&#23450;&#21521;&#23545;&#25239;&#26679;&#26412;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;Jacobian&#24341;&#36215;&#30340;&#39532;&#27663;&#36317;&#31163;&#65292;&#32771;&#34385;&#20102;&#23558;&#36755;&#20837;&#26679;&#26412;&#30340;&#28508;&#22312;&#31354;&#38388;&#34920;&#31034;&#22312;&#32473;&#23450;&#26041;&#21521;&#19978;&#31227;&#21160;&#25152;&#38656;&#30340;&#25237;&#20837;&#12290;&#35813;&#31639;&#27861;&#22312;&#35299;&#20915;&#23545;&#25239;&#26679;&#26412;&#38382;&#39064;&#26041;&#38754;&#25552;&#20379;&#20102;&#26368;&#20248;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#20026;&#27490;&#65292;&#22823;&#22810;&#25968;&#29992;&#20110;&#29983;&#25104;&#38024;&#23545;&#28145;&#24230;&#23398;&#20064;&#20998;&#31867;&#22120;&#30340;&#23450;&#21521;&#23545;&#25239;&#26679;&#26412;&#30340;&#26041;&#27861;&#37117;&#26159;&#39640;&#24230;&#27425;&#20248;&#30340;&#65292;&#36890;&#24120;&#20381;&#36182;&#20110;&#22686;&#21152;&#30446;&#26631;&#31867;&#21035;&#30340;&#21487;&#33021;&#24615;&#65292;&#22240;&#27492;&#38544;&#21547;&#22320;&#19987;&#27880;&#20110;&#19968;&#28909;&#32534;&#30721;&#35774;&#32622;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#21152;&#36890;&#29992;&#30340;&#12289;&#29702;&#35770;&#19978;&#21487;&#38752;&#30340;&#23450;&#21521;&#25915;&#20987;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21033;&#29992;&#26368;&#23567;&#21270;&#38597;&#21487;&#27604;&#24341;&#36215;&#30340;&#39532;&#27663;&#36317;&#31163;&#65288;JMA&#65289;&#39033;&#65292;&#32771;&#34385;&#23558;&#36755;&#20837;&#26679;&#26412;&#30340;&#28508;&#22312;&#31354;&#38388;&#34920;&#31034;&#22312;&#32473;&#23450;&#26041;&#21521;&#19978;&#31227;&#21160;&#25152;&#38656;&#30340;&#25237;&#20837;&#65288;&#22312;&#36755;&#20837;&#31354;&#38388;&#20013;&#65289;&#12290;&#36890;&#36807;&#21033;&#29992;&#27779;&#23572;&#22827;&#20108;&#37325;&#24615;&#23450;&#29702;&#27714;&#35299;&#26368;&#23567;&#21270;&#38382;&#39064;&#65292;&#23558;&#38382;&#39064;&#31616;&#21270;&#20026;&#35299;&#38750;&#36127;&#26368;&#23567;&#20108;&#20056;&#65288;NNLS&#65289;&#38382;&#39064;&#12290;&#25152;&#25552;&#20986;&#30340;&#31639;&#27861;&#20026;Szegedy&#31561;&#20154;&#26368;&#21021;&#24341;&#20837;&#30340;&#23545;&#25239;&#26679;&#26412;&#38382;&#39064;&#30340;&#32447;&#24615;&#21270;&#29256;&#26412;&#25552;&#20379;&#20102;&#26368;&#20248;&#35299;&#12290;&#25105;&#20204;&#36827;&#34892;&#30340;&#23454;&#39564;&#35777;&#23454;&#20102;&#25152;&#25552;&#20986;&#30340;&#25915;&#20987;&#30340;&#24191;&#27867;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Most of the approaches proposed so far to craft targeted adversarial examples against Deep Learning classifiers are highly suboptimal and typically rely on increasing the likelihood of the target class, thus implicitly focusing on one-hot encoding settings. In this paper, we propose a more general, theoretically sound, targeted attack that resorts to the minimization of a Jacobian-induced MAhalanobis distance (JMA) term, taking into account the effort (in the input space) required to move the latent space representation of the input sample in a given direction. The minimization is solved by exploiting the Wolfe duality theorem, reducing the problem to the solution of a Non-Negative Least Square (NNLS) problem. The proposed algorithm provides an optimal solution to a linearized version of the adversarial example problem originally introduced by Szegedy et al. \cite{szegedy2013intriguing}. The experiments we carried out confirm the generality of the proposed attack which is proven to be 
&lt;/p&gt;</description></item></channel></rss>