<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#35813;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#31639;&#26415;&#30005;&#36335;&#32422;&#26463;&#32534;&#30721;&#20026;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#20195;&#25968;&#35745;&#31639;&#22312;&#26377;&#38480;&#22495;&#19978;&#35299;&#20915;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#20197;&#31934;&#30830;&#23450;&#20301;ZKP&#30005;&#36335;&#20013;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#38169;&#35823;&#12290;</title><link>https://arxiv.org/abs/2403.15676</link><description>&lt;p&gt;
AC4&#65306;&#29992;&#20110;ZKP&#20013;&#30005;&#36335;&#32422;&#26463;&#30340;&#20195;&#25968;&#35745;&#31639;&#26816;&#26597;&#22120;
&lt;/p&gt;
&lt;p&gt;
AC4: Algebraic Computation Checker for Circuit Constraints in ZKPs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15676
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#31639;&#26415;&#30005;&#36335;&#32422;&#26463;&#32534;&#30721;&#20026;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#20195;&#25968;&#35745;&#31639;&#22312;&#26377;&#38480;&#22495;&#19978;&#35299;&#20915;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#20197;&#31934;&#30830;&#23450;&#20301;ZKP&#30005;&#36335;&#20013;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
ZKP&#31995;&#32479;&#24050;&#32463;&#24341;&#36215;&#20102;&#20154;&#20204;&#30340;&#20851;&#27880;&#65292;&#22312;&#24403;&#20195;&#23494;&#30721;&#23398;&#20013;&#21457;&#25381;&#30528;&#22522;&#30784;&#24615;&#20316;&#29992;&#12290; Zk-SNARK&#21327;&#35758;&#20027;&#23548;&#20102;ZKP&#30340;&#20351;&#29992;&#65292;&#36890;&#24120;&#36890;&#36807;&#31639;&#26415;&#30005;&#36335;&#32534;&#31243;&#33539;&#24335;&#23454;&#29616;&#12290;&#28982;&#32780;&#65292;&#27424;&#32422;&#26463;&#25110;&#36807;&#32422;&#26463;&#30340;&#30005;&#36335;&#21487;&#33021;&#23548;&#33268;&#38169;&#35823;&#12290; &#27424;&#32422;&#26463;&#30340;&#30005;&#36335;&#25351;&#30340;&#26159;&#32570;&#20047;&#24517;&#35201;&#32422;&#26463;&#30340;&#30005;&#36335;&#65292;&#23548;&#33268;&#30005;&#36335;&#20013;&#20986;&#29616;&#24847;&#22806;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#23548;&#33268;&#39564;&#35777;&#32773;&#25509;&#21463;&#38169;&#35823;&#35265;&#35777;&#12290; &#36807;&#32422;&#26463;&#30340;&#30005;&#36335;&#26159;&#25351;&#32422;&#26463;&#36807;&#24230;&#30340;&#30005;&#36335;&#65292;&#23548;&#33268;&#30005;&#36335;&#32570;&#20047;&#24517;&#35201;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#23548;&#33268;&#39564;&#35777;&#32773;&#25509;&#21463;&#27809;&#26377;&#35265;&#35777;&#65292;&#20351;&#30005;&#36335;&#27627;&#26080;&#24847;&#20041;&#12290; &#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#25214;&#20986;ZKP&#30005;&#36335;&#20013;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#38169;&#35823;&#12290; &#35813;&#26041;&#27861;&#28041;&#21450;&#23558;&#31639;&#26415;&#30005;&#36335;&#32422;&#26463;&#32534;&#30721;&#20026;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#20195;&#25968;&#35745;&#31639;&#22312;&#26377;&#38480;&#22495;&#19978;&#35299;&#20915;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15676v1 Announce Type: cross  Abstract: ZKP systems have surged attention and held a fundamental role in contemporary cryptography. Zk-SNARK protocols dominate the ZKP usage, often implemented through arithmetic circuit programming paradigm. However, underconstrained or overconstrained circuits may lead to bugs. Underconstrained circuits refer to circuits that lack the necessary constraints, resulting in unexpected solutions in the circuit and causing the verifier to accept a bogus witness. Overconstrained circuits refer to circuits that are constrained excessively, resulting in the circuit lacking necessary solutions and causing the verifier to accept no witness, rendering the circuit meaningless. This paper introduces a novel approach for pinpointing two distinct types of bugs in ZKP circuits. The method involves encoding the arithmetic circuit constraints to polynomial equation systems and solving polynomial equation systems over a finite field by algebraic computation. T
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#32479;&#35745;&#23398;&#20064;&#26041;&#27861;&#21644;&#22522;&#30784;&#35774;&#26045;&#36830;&#32493;&#27979;&#37327;&#25968;&#25454;&#65292;&#20197;&#21450;&#22312;&#20869;&#37096;&#27979;&#35797;&#21488;&#19978;&#36827;&#34892;&#25915;&#20987;&#27169;&#25311;&#65292;&#23454;&#29616;&#20102;IT&#22522;&#30784;&#35774;&#26045;&#20013;&#30340;&#33258;&#21160;&#20837;&#20405;&#26816;&#27979;&#12290;</title><link>https://arxiv.org/abs/2402.13081</link><description>&lt;p&gt;
&#20351;&#29992;&#32479;&#35745;&#23398;&#20064;&#21644;&#27979;&#35797;&#21488;&#27979;&#37327;&#36827;&#34892;IT&#20837;&#20405;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
IT Intrusion Detection Using Statistical Learning and Testbed Measurements
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13081
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#32479;&#35745;&#23398;&#20064;&#26041;&#27861;&#21644;&#22522;&#30784;&#35774;&#26045;&#36830;&#32493;&#27979;&#37327;&#25968;&#25454;&#65292;&#20197;&#21450;&#22312;&#20869;&#37096;&#27979;&#35797;&#21488;&#19978;&#36827;&#34892;&#25915;&#20987;&#27169;&#25311;&#65292;&#23454;&#29616;&#20102;IT&#22522;&#30784;&#35774;&#26045;&#20013;&#30340;&#33258;&#21160;&#20837;&#20405;&#26816;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;IT&#22522;&#30784;&#35774;&#26045;&#20013;&#30340;&#33258;&#21160;&#20837;&#20405;&#26816;&#27979;&#65292;&#29305;&#21035;&#26159;&#35782;&#21035;&#25915;&#20987;&#24320;&#22987;&#12289;&#25915;&#20987;&#31867;&#22411;&#20197;&#21450;&#25915;&#20987;&#32773;&#37319;&#21462;&#30340;&#21160;&#20316;&#39034;&#24207;&#30340;&#38382;&#39064;&#65292;&#22522;&#20110;&#22522;&#30784;&#35774;&#26045;&#30340;&#36830;&#32493;&#27979;&#37327;&#12290;&#25105;&#20204;&#24212;&#29992;&#32479;&#35745;&#23398;&#20064;&#26041;&#27861;&#65292;&#21253;&#25324;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#65288;HMM&#65289;&#12289;&#38271;&#30701;&#26399;&#35760;&#24518;&#65288;LSTM&#65289;&#21644;&#38543;&#26426;&#26862;&#26519;&#20998;&#31867;&#22120;&#65288;RFC&#65289;&#65292;&#23558;&#35266;&#27979;&#24207;&#21015;&#26144;&#23556;&#21040;&#39044;&#27979;&#25915;&#20987;&#21160;&#20316;&#24207;&#21015;&#12290;&#19982;&#22823;&#22810;&#25968;&#30456;&#20851;&#30740;&#31350;&#19981;&#21516;&#65292;&#25105;&#20204;&#25317;&#26377;&#20016;&#23500;&#30340;&#25968;&#25454;&#26469;&#35757;&#32451;&#27169;&#22411;&#24182;&#35780;&#20272;&#20854;&#39044;&#27979;&#33021;&#21147;&#12290;&#25968;&#25454;&#26469;&#33258;&#25105;&#20204;&#22312;&#20869;&#37096;&#27979;&#35797;&#21488;&#19978;&#29983;&#25104;&#30340;&#36319;&#36394;&#25968;&#25454;&#65292;&#22312;&#36825;&#37324;&#25105;&#20204;&#23545;&#27169;&#25311;&#30340;IT&#22522;&#30784;&#35774;&#26045;&#36827;&#34892;&#25915;&#20987;&#12290;&#25105;&#20204;&#24037;&#20316;&#30340;&#26680;&#24515;&#26159;&#19968;&#20010;&#26426;&#22120;&#23398;&#20064;&#31649;&#36947;&#65292;&#23558;&#26469;&#33258;&#39640;&#32500;&#35266;&#27979;&#31354;&#38388;&#30340;&#27979;&#37327;&#26144;&#23556;&#21040;&#20302;&#32500;&#31354;&#38388;&#25110;&#23569;&#37327;&#35266;&#27979;&#31526;&#21495;&#30340;&#31354;&#38388;&#12290;&#25105;&#20204;&#30740;&#31350;&#31163;&#32447;&#21644;&#22312;&#32447;&#20837;&#20405;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13081v1 Announce Type: new  Abstract: We study automated intrusion detection in an IT infrastructure, specifically the problem of identifying the start of an attack, the type of attack, and the sequence of actions an attacker takes, based on continuous measurements from the infrastructure. We apply statistical learning methods, including Hidden Markov Model (HMM), Long Short-Term Memory (LSTM), and Random Forest Classifier (RFC) to map sequences of observations to sequences of predicted attack actions. In contrast to most related research, we have abundant data to train the models and evaluate their predictive power. The data comes from traces we generate on an in-house testbed where we run attacks against an emulated IT infrastructure. Central to our work is a machine-learning pipeline that maps measurements from a high-dimensional observation space to a space of low dimensionality or to a small set of observation symbols. Investigating intrusions in offline as well as onli
&lt;/p&gt;</description></item></channel></rss>