<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38750;&#20984;&#20248;&#21270;&#20013;&#25214;&#21040;&#20809;&#28369;&#30446;&#26631;&#20989;&#25968;&#30340;&#36817;&#20284;&#31283;&#23450;&#28857;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#21644;&#26597;&#35810;&#22797;&#26434;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#32467;&#26524;&#12290;&#23545;&#20110;$d=2$&#30340;&#24773;&#20917;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#38646;&#38454;&#31639;&#27861;&#65292;&#21482;&#38656;&#35201;&#23569;&#37327;&#30340;&#20989;&#25968;&#20540;&#26597;&#35810;&#21363;&#21487;&#25214;&#21040;$\varepsilon$-&#36817;&#20284;&#31283;&#23450;&#28857;&#12290;</title><link>http://arxiv.org/abs/2310.09157</link><description>&lt;p&gt;
&#23547;&#25214;&#38750;&#20984;&#20248;&#21270;&#20013;&#30340;&#31283;&#23450;&#28857;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Computational Complexity of Finding Stationary Points in Non-Convex Optimization. (arXiv:2310.09157v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09157
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38750;&#20984;&#20248;&#21270;&#20013;&#25214;&#21040;&#20809;&#28369;&#30446;&#26631;&#20989;&#25968;&#30340;&#36817;&#20284;&#31283;&#23450;&#28857;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#21644;&#26597;&#35810;&#22797;&#26434;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#32467;&#26524;&#12290;&#23545;&#20110;$d=2$&#30340;&#24773;&#20917;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#38646;&#38454;&#31639;&#27861;&#65292;&#21482;&#38656;&#35201;&#23569;&#37327;&#30340;&#20989;&#25968;&#20540;&#26597;&#35810;&#21363;&#21487;&#25214;&#21040;$\varepsilon$-&#36817;&#20284;&#31283;&#23450;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23547;&#25214;&#38750;&#20984;&#20294;&#20809;&#28369;&#30446;&#26631;&#20989;&#25968;$f$&#22312;&#26080;&#38480;&#21046;&#30340;$d$&#32500;&#22495;&#19978;&#30340;&#36817;&#20284;&#31283;&#23450;&#28857;&#65292;&#21363;&#26799;&#24230;&#36817;&#20284;&#20026;&#38646;&#30340;&#28857;&#65292;&#26159;&#32463;&#20856;&#38750;&#20984;&#20248;&#21270;&#20013;&#26368;&#22522;&#26412;&#30340;&#38382;&#39064;&#20043;&#19968;&#12290;&#28982;&#32780;&#65292;&#24403;&#38382;&#39064;&#30340;&#32500;&#24230;$d$&#19982;&#36817;&#20284;&#35823;&#24046;&#29420;&#31435;&#26102;&#65292;&#36825;&#20010;&#38382;&#39064;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#21644;&#26597;&#35810;&#22797;&#26434;&#24615;&#20173;&#19981;&#21313;&#20998;&#28165;&#26970;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20197;&#19979;&#35745;&#31639;&#22797;&#26434;&#24615;&#21644;&#26597;&#35810;&#22797;&#26434;&#24615;&#32467;&#26524;&#65306;1.&#22312;&#26080;&#38480;&#21046;&#30340;&#22495;&#20013;&#23547;&#25214;&#36817;&#20284;&#31283;&#23450;&#28857;&#30340;&#38382;&#39064;&#26159;PLS&#23436;&#20840;&#38382;&#39064;&#12290;2.&#23545;&#20110;$d=2$&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#38646;&#38454;&#31639;&#27861;&#65292;&#29992;&#20110;&#23547;&#25214;$\varepsilon$-&#36817;&#20284;&#31283;&#23450;&#28857;&#65292;&#21482;&#38656;&#35201;&#23545;&#30446;&#26631;&#20989;&#25968;&#36827;&#34892;&#26368;&#22810;$O(1/\varepsilon)$&#27425;&#20989;&#25968;&#20540;&#26597;&#35810;&#12290;3.&#25105;&#20204;&#35777;&#26126;&#24403;$d=2$&#26102;&#65292;&#20219;&#20309;&#31639;&#27861;&#33267;&#23569;&#38656;&#35201;$\Omega(1/\varepsilon)$&#27425;&#23545;&#30446;&#26631;&#20989;&#25968;&#21644;/&#25110;&#26799;&#24230;&#30340;&#26597;&#35810;&#26469;&#25214;&#21040;$\varepsilon$-&#36817;&#20284;&#31283;&#23450;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Finding approximate stationary points, i.e., points where the gradient is approximately zero, of non-convex but smooth objective functions $f$ over unrestricted $d$-dimensional domains is one of the most fundamental problems in classical non-convex optimization. Nevertheless, the computational and query complexity of this problem are still not well understood when the dimension $d$ of the problem is independent of the approximation error. In this paper, we show the following computational and query complexity results:  1. The problem of finding approximate stationary points over unrestricted domains is PLS-complete.  2. For $d = 2$, we provide a zero-order algorithm for finding $\varepsilon$-approximate stationary points that requires at most $O(1/\varepsilon)$ value queries to the objective function.  3. We show that any algorithm needs at least $\Omega(1/\varepsilon)$ queries to the objective function and/or its gradient to find $\varepsilon$-approximate stationary points when $d=2$.
&lt;/p&gt;</description></item></channel></rss>