<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26816;&#27979;&#37329;&#34701;&#26426;&#22120;&#20154;&#22312;&#20197;&#22826;&#22346;&#24179;&#21488;&#19978;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#24314;&#31435;&#20102;&#37329;&#34701;&#26426;&#22120;&#20154;&#30340;&#20998;&#31867;&#27861;&#65292;&#23545;&#26426;&#22120;&#20154;&#36827;&#34892;&#20102;&#26816;&#27979;&#24182;&#21019;&#24314;&#20102;&#22320;&#38754;&#23454;&#20917;&#25968;&#25454;&#38598;&#12290;</title><link>https://arxiv.org/abs/2403.19530</link><description>&lt;p&gt;
&#22312;&#20197;&#22826;&#22346;&#21306;&#22359;&#38142;&#19978;&#26816;&#27979;&#37329;&#34701;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
Detecting Financial Bots on the Ethereum Blockchain
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19530
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26816;&#27979;&#37329;&#34701;&#26426;&#22120;&#20154;&#22312;&#20197;&#22826;&#22346;&#24179;&#21488;&#19978;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#24314;&#31435;&#20102;&#37329;&#34701;&#26426;&#22120;&#20154;&#30340;&#20998;&#31867;&#27861;&#65292;&#23545;&#26426;&#22120;&#20154;&#36827;&#34892;&#20102;&#26816;&#27979;&#24182;&#21019;&#24314;&#20102;&#22320;&#38754;&#23454;&#20917;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38598;&#25104;&#26426;&#22120;&#20154;&#22312;&#20998;&#24067;&#24335;&#36134;&#26412;&#25216;&#26415;&#65288;DLTs&#65289;&#20013;&#20419;&#36827;&#20102;&#25928;&#29575;&#21644;&#33258;&#21160;&#21270;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#30340;&#20351;&#29992;&#20063;&#19982;&#25504;&#22842;&#24615;&#20132;&#26131;&#21644;&#24066;&#22330;&#25805;&#32437;&#30456;&#20851;&#65292;&#24182;&#21487;&#33021;&#23545;&#31995;&#32479;&#23436;&#25972;&#24615;&#26500;&#25104;&#23041;&#32961;&#12290;&#22240;&#27492;&#65292;&#20102;&#35299;DLTs&#20013;&#26426;&#22120;&#20154;&#30340;&#37096;&#32626;&#31243;&#24230;&#33267;&#20851;&#37325;&#35201;&#65307;&#23613;&#31649;&#22914;&#27492;&#65292;&#30446;&#21069;&#30340;&#26816;&#27979;&#31995;&#32479;&#20027;&#35201;&#22522;&#20110;&#35268;&#21017;&#65292;&#24182;&#19988;&#32570;&#20047;&#28789;&#27963;&#24615;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26816;&#27979;&#20197;&#22826;&#22346;&#24179;&#21488;&#19978;&#37329;&#34701;&#26426;&#22120;&#20154;&#30340;&#26032;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#31995;&#32479;&#21270;&#29616;&#26377;&#30340;&#31185;&#23398;&#25991;&#29486;&#24182;&#25910;&#38598;&#36726;&#20107;&#35777;&#25454;&#65292;&#20197;&#24314;&#31435;&#37329;&#34701;&#26426;&#22120;&#20154;&#30340;&#20998;&#31867;&#27861;&#65292;&#21253;&#25324;7&#20010;&#31867;&#21035;&#21644;24&#20010;&#23376;&#31867;&#21035;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#21019;&#24314;&#19968;&#20010;&#21253;&#21547;133&#20010;&#20154;&#31867;&#21644;137&#20010;&#26426;&#22120;&#20154;&#22320;&#22336;&#30340;&#22320;&#38754;&#23454;&#20917;&#25968;&#25454;&#38598;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#20351;&#29992;&#26080;&#30417;&#30563;&#21644;&#26377;&#30417;&#30563;&#30340;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26469;&#26816;&#27979;&#37096;&#32626;&#22312;&#20197;&#22826;&#22346;&#19978;&#30340;&#26426;&#22120;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19530v1 Announce Type: cross  Abstract: The integration of bots in Distributed Ledger Technologies (DLTs) fosters efficiency and automation. However, their use is also associated with predatory trading and market manipulation, and can pose threats to system integrity. It is therefore essential to understand the extent of bot deployment in DLTs; despite this, current detection systems are predominantly rule-based and lack flexibility. In this study, we present a novel approach that utilizes machine learning for the detection of financial bots on the Ethereum platform. First, we systematize existing scientific literature and collect anecdotal evidence to establish a taxonomy for financial bots, comprising 7 categories and 24 subcategories. Next, we create a ground-truth dataset consisting of 133 human and 137 bot addresses. Third, we employ both unsupervised and supervised machine learning algorithms to detect bots deployed on Ethereum. The highest-performing clustering algori
&lt;/p&gt;</description></item></channel></rss>