<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>WinoQueer&#26159;&#19968;&#20010;&#31038;&#21306;&#21327;&#21516;&#22522;&#20934;&#65292;&#26088;&#22312;&#34913;&#37327;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#21542;&#23384;&#22312;&#23545;LGBTQ+&#31038;&#21306;&#26377;&#23475;&#30340;&#20559;&#35265;&#12290;&#30740;&#31350;&#21457;&#29616;&#29616;&#25104;&#27169;&#22411;&#26222;&#36941;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#21453;&#21516;&#20559;&#35265;&#65292;&#36890;&#36807;&#22312;&#35813;&#31038;&#21306;&#25776;&#20889;&#25110;&#30001;&#35813;&#31038;&#21306;&#25104;&#21592;&#25776;&#20889;&#30340;&#25968;&#25454;&#19978;&#36827;&#34892;&#24494;&#35843;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#20943;&#36731;&#20559;&#35265;&#12290;</title><link>http://arxiv.org/abs/2306.15087</link><description>&lt;p&gt;
WinoQueer&#65306;&#38024;&#23545;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20013;&#21453;LGBTQ+&#20559;&#35265;&#30340;&#31038;&#21306;&#21327;&#21516;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
WinoQueer: A Community-in-the-Loop Benchmark for Anti-LGBTQ+ Bias in Large Language Models. (arXiv:2306.15087v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15087
&lt;/p&gt;
&lt;p&gt;
WinoQueer&#26159;&#19968;&#20010;&#31038;&#21306;&#21327;&#21516;&#22522;&#20934;&#65292;&#26088;&#22312;&#34913;&#37327;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#21542;&#23384;&#22312;&#23545;LGBTQ+&#31038;&#21306;&#26377;&#23475;&#30340;&#20559;&#35265;&#12290;&#30740;&#31350;&#21457;&#29616;&#29616;&#25104;&#27169;&#22411;&#26222;&#36941;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#21453;&#21516;&#20559;&#35265;&#65292;&#36890;&#36807;&#22312;&#35813;&#31038;&#21306;&#25776;&#20889;&#25110;&#30001;&#35813;&#31038;&#21306;&#25104;&#21592;&#25776;&#20889;&#30340;&#25968;&#25454;&#19978;&#36827;&#34892;&#24494;&#35843;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#20943;&#36731;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;WinoQueer&#65306;&#19968;&#20010;&#19987;&#38376;&#35774;&#35745;&#29992;&#26469;&#27979;&#35797;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#26159;&#21542;&#23384;&#22312;&#23545;LGBTQ+&#31038;&#21306;&#26377;&#23475;&#30340;&#20559;&#35265;&#30340;&#22522;&#20934;&#12290;&#35813;&#22522;&#20934;&#26159;&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#20174;&#31038;&#21306;&#35843;&#26597;&#20013;&#29983;&#25104;&#30340;&#20559;&#35265;&#22522;&#20934;&#12290;&#25105;&#20204;&#23558;&#35813;&#22522;&#20934;&#24212;&#29992;&#20110;&#20960;&#20010;&#27969;&#34892;&#30340;LLMs&#65292;&#24182;&#21457;&#29616;&#29616;&#25104;&#27169;&#22411;&#26222;&#36941;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#21453;&#21516;&#20559;&#35265;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36890;&#36807;&#22312;&#35813;&#31038;&#21306;&#25776;&#20889;&#25110;&#30001;&#35813;&#31038;&#21306;&#25104;&#21592;&#25776;&#20889;&#30340;&#25968;&#25454;&#19978;&#36827;&#34892;&#24494;&#35843;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#20943;&#36731;LLM&#23545;&#36793;&#32536;&#21270;&#31038;&#21306;&#30340;&#20559;&#35265;&#65292;&#24182;&#19988;&#31038;&#21306;&#25104;&#21592;&#25776;&#20889;&#30340;&#31038;&#20132;&#23186;&#20307;&#25991;&#26412;&#27604;&#38750;&#31038;&#21306;&#25104;&#21592;&#25776;&#20889;&#30340;&#26032;&#38395;&#25991;&#26412;&#26356;&#26377;&#25928;&#12290;&#25105;&#20204;&#30340;&#31038;&#21306;&#21327;&#21516;&#22522;&#20934;&#24320;&#21457;&#26041;&#27861;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#20154;&#21592;&#25552;&#20379;&#20102;&#19968;&#20010;&#34013;&#22270;&#65292;&#20197;&#24320;&#21457;&#38754;&#21521;&#20854;&#20182;&#36793;&#32536;&#21270;&#31038;&#21306;&#30340;&#12289;&#20197;&#31038;&#21306;&#20026;&#20013;&#24515;&#30340;&#12289;&#22522;&#20110;&#20260;&#23475;&#30340;LLM&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present WinoQueer: a benchmark specifically designed to measure whether large language models (LLMs) encode biases that are harmful to the LGBTQ+ community. The benchmark is community-sourced, via application of a novel method that generates a bias benchmark from a community survey. We apply our benchmark to several popular LLMs and find that off-the-shelf models generally do exhibit considerable anti-queer bias. Finally, we show that LLM bias against a marginalized community can be somewhat mitigated by finetuning on data written about or by members of that community, and that social media text written by community members is more effective than news text written about the community by non-members. Our method for community-in-the-loop benchmark development provides a blueprint for future researchers to develop community-driven, harms-grounded LLM benchmarks for other marginalized communities.
&lt;/p&gt;</description></item></channel></rss>