<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20813;&#20808;&#39564;&#27491;&#26080;&#26631;&#23398;&#20064;&#30340;&#23545;&#27604;&#26041;&#27861;&#65292;&#36890;&#36807;&#39044;&#35757;&#32451;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;&#29305;&#24449;&#31354;&#38388;&#24182;&#21033;&#29992;&#23884;&#20837;&#30340;&#27987;&#24230;&#29305;&#24615;&#23545;&#26410;&#26631;&#35760;&#26679;&#26412;&#36827;&#34892;&#20266;&#26631;&#31614;&#22788;&#29702;&#65292;&#30456;&#27604;&#29616;&#26377;&#26041;&#27861;&#65292;&#22312;&#22810;&#20010;&#26631;&#20934;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20248;&#24322;&#65292;&#21516;&#26102;&#19981;&#38656;&#35201;&#20808;&#39564;&#30693;&#35782;&#25110;&#31867;&#20808;&#39564;&#30340;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2402.06038</link><description>&lt;p&gt;
&#20813;&#20808;&#39564;&#27491;&#26080;&#26631;&#65288;Positive Unlabeled&#65289;&#23398;&#20064;&#30340;&#23545;&#27604;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Contrastive Approach to Prior Free Positive Unlabeled Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06038
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20813;&#20808;&#39564;&#27491;&#26080;&#26631;&#23398;&#20064;&#30340;&#23545;&#27604;&#26041;&#27861;&#65292;&#36890;&#36807;&#39044;&#35757;&#32451;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;&#29305;&#24449;&#31354;&#38388;&#24182;&#21033;&#29992;&#23884;&#20837;&#30340;&#27987;&#24230;&#29305;&#24615;&#23545;&#26410;&#26631;&#35760;&#26679;&#26412;&#36827;&#34892;&#20266;&#26631;&#31614;&#22788;&#29702;&#65292;&#30456;&#27604;&#29616;&#26377;&#26041;&#27861;&#65292;&#22312;&#22810;&#20010;&#26631;&#20934;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20248;&#24322;&#65292;&#21516;&#26102;&#19981;&#38656;&#35201;&#20808;&#39564;&#30693;&#35782;&#25110;&#31867;&#20808;&#39564;&#30340;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27491;&#26080;&#26631;&#65288;Positive Unlabeled&#65289;&#23398;&#20064;&#26159;&#25351;&#22312;&#32473;&#23450;&#23569;&#37327;&#26631;&#35760;&#30340;&#27491;&#26679;&#26412;&#21644;&#19968;&#32452;&#26410;&#26631;&#35760;&#26679;&#26412;&#65288;&#21487;&#33021;&#26159;&#27491;&#20363;&#25110;&#36127;&#20363;&#65289;&#30340;&#24773;&#20917;&#19979;&#23398;&#20064;&#19968;&#20010;&#20108;&#20998;&#31867;&#22120;&#30340;&#20219;&#21153;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#27491;&#26080;&#26631;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#20445;&#35777;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;&#23398;&#20064;&#29305;&#24449;&#31354;&#38388;&#65292;&#24182;&#21033;&#29992;&#23884;&#20837;&#30340;&#27987;&#24230;&#29305;&#24615;&#23545;&#26410;&#26631;&#35760;&#26679;&#26412;&#36827;&#34892;&#20266;&#26631;&#31614;&#22788;&#29702;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#22810;&#20010;&#26631;&#20934;&#27491;&#26080;&#26631;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#36731;&#26494;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#27491;&#26080;&#26631;&#23398;&#20064;&#26041;&#27861;&#65292;&#32780;&#19981;&#38656;&#35201;&#20808;&#39564;&#30693;&#35782;&#25110;&#31867;&#20808;&#39564;&#30340;&#20272;&#35745;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26631;&#35760;&#25968;&#25454;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#20173;&#28982;&#26377;&#25928;&#65292;&#32780;&#22823;&#22810;&#25968;&#27491;&#26080;&#26631;&#23398;&#20064;&#31639;&#27861;&#21017;&#22833;&#36133;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#31616;&#21333;&#30340;&#29702;&#35770;&#20998;&#26512;&#26469;&#25512;&#21160;&#25105;&#20204;&#25552;&#20986;&#30340;&#31639;&#27861;&#65292;&#24182;&#20026;&#25105;&#20204;&#30340;&#26041;&#27861;&#24314;&#31435;&#20102;&#19968;&#33324;&#21270;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Positive Unlabeled (PU) learning refers to the task of learning a binary classifier given a few labeled positive samples, and a set of unlabeled samples (which could be positive or negative). In this paper, we propose a novel PU learning framework, that starts by learning a feature space through pretext-invariant representation learning and then applies pseudo-labeling to the unlabeled examples, leveraging the concentration property of the embeddings. Overall, our proposed approach handily outperforms state-of-the-art PU learning methods across several standard PU benchmark datasets, while not requiring a-priori knowledge or estimate of class prior. Remarkably, our method remains effective even when labeled data is scant, where most PU learning algorithms falter. We also provide simple theoretical analysis motivating our proposed algorithms and establish generalization guarantee for our approach.
&lt;/p&gt;</description></item></channel></rss>