<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LARA&#30340;&#26032;&#22411;&#20215;&#26684;&#21464;&#21160;&#39044;&#27979;&#26694;&#26550;&#65292;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#37096;&#20998;&#65306;&#23616;&#37096;&#24863;&#30693;&#27880;&#24847;&#21147;&#21644;&#36845;&#20195;&#32454;&#21270;&#26631;&#27880;&#12290;&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#37329;&#34701;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;LARA&#22312;&#20934;&#30830;&#24615;&#21644;&#30408;&#21033;&#33021;&#21147;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2107.11972</link><description>&lt;p&gt;
&#24403;&#26426;&#20250;&#26469;&#20020;&#26102;&#36827;&#34892;&#20132;&#26131;&#65306;&#22522;&#20110;&#27880;&#24847;&#21147;&#26426;&#21046;&#21644;&#36845;&#20195;&#32454;&#21270;&#26631;&#27880;&#30340;&#20215;&#26684;&#21464;&#21160;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Trade When Opportunity Comes: Price Movement Forecasting via Locality-Aware Attention and Iterative Refinement Labeling. (arXiv:2107.11972v3 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.11972
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LARA&#30340;&#26032;&#22411;&#20215;&#26684;&#21464;&#21160;&#39044;&#27979;&#26694;&#26550;&#65292;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#37096;&#20998;&#65306;&#23616;&#37096;&#24863;&#30693;&#27880;&#24847;&#21147;&#21644;&#36845;&#20195;&#32454;&#21270;&#26631;&#27880;&#12290;&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#37329;&#34701;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;LARA&#22312;&#20934;&#30830;&#24615;&#21644;&#30408;&#21033;&#33021;&#21147;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20215;&#26684;&#21464;&#21160;&#39044;&#27979;&#26088;&#22312;&#26681;&#25454;&#24403;&#21069;&#24066;&#22330;&#24773;&#20917;&#21644;&#20854;&#20182;&#30456;&#20851;&#20449;&#24687;&#39044;&#27979;&#37329;&#34701;&#36164;&#20135;&#30340;&#26410;&#26469;&#36235;&#21183;&#12290;&#26368;&#36817;&#65292;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#26041;&#27861;&#22312;&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#20013;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#65292;&#24182;&#21462;&#24471;&#20102;&#20196;&#20154;&#28385;&#24847;&#30340;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#37329;&#34701;&#25968;&#25454;&#30340;&#20302;&#20449;&#22122;&#27604;&#21644;&#38543;&#26426;&#24615;&#26497;&#24378;&#65292;&#22909;&#30340;&#20132;&#26131;&#26426;&#20250;&#26497;&#20026;&#31232;&#23569;&#12290;&#22240;&#27492;&#65292;&#22914;&#26524;&#19981;&#20180;&#32454;&#36873;&#25321;&#28508;&#22312;&#30340;&#30408;&#21033;&#26679;&#26412;&#65292;&#36825;&#20123;ML&#26041;&#27861;&#23481;&#26131;&#25429;&#25417;&#21040;&#22122;&#22768;&#32780;&#19981;&#26159;&#30495;&#23454;&#20449;&#21495;&#30340;&#27169;&#24335;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LARA&#30340;&#26032;&#22411;&#20215;&#26684;&#21464;&#21160;&#39044;&#27979;&#26694;&#26550;&#65292;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#37096;&#20998;&#65306;&#23616;&#37096;&#24863;&#30693;&#27880;&#24847;&#21147;&#65288;LA-Attention&#65289;&#21644;&#36845;&#20195;&#32454;&#21270;&#26631;&#27880;&#65288;IRL&#65289;&#12290;LA-Attention&#26088;&#22312;&#26377;&#36873;&#25321;&#22320;&#20851;&#27880;&#37329;&#34701;&#25968;&#25454;&#20013;&#26368;&#20855;&#20449;&#24687;&#37327;&#30340;&#23616;&#37096;&#21306;&#22495;&#65292;&#32780;IRL&#21017;&#26088;&#22312;&#36845;&#20195;&#22320;&#32454;&#21270;&#26631;&#27880;&#36807;&#31243;&#65292;&#36807;&#28388;&#25481;&#22122;&#22768;&#21644;&#26080;&#20851;&#26679;&#26412;&#12290;&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#37329;&#34701;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;LARA&#22312;&#20934;&#30830;&#24615;&#21644;&#30408;&#21033;&#33021;&#21147;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Price movement forecasting aims at predicting the future trends of financial assets based on the current market conditions and other relevant information. Recently, machine learning (ML) methods have become increasingly popular and achieved promising results for price movement forecasting in both academia and industry. Most existing ML solutions formulate the forecasting problem as a classification (to predict the direction) or a regression (to predict the return) problem over the entire set of training data. However, due to the extremely low signal-to-noise ratio and stochastic nature of financial data, good trading opportunities are extremely scarce. As a result, without careful selection of potentially profitable samples, such ML methods are prone to capture the patterns of noises instead of real signals. To address this issue, we propose a novel price movement forecasting framework named LARA consisting of two main components: Locality-Aware Attention (LA-Attention) and Iterative R
&lt;/p&gt;</description></item></channel></rss>