<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#28857;&#20113;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;VF-Net&#65289;&#29992;&#20110;&#29273;&#31185;&#28857;&#20113;&#25968;&#25454;&#30340;&#22788;&#29702;&#65292;&#35813;&#27169;&#22411;&#22312;&#21508;&#31181;&#20219;&#21153;&#20013;&#20855;&#26377;&#26174;&#33879;&#30340;&#24615;&#33021;&#65292;&#21253;&#25324;&#32593;&#26684;&#29983;&#25104;&#12289;&#24418;&#29366;&#23436;&#25972;&#21644;&#34920;&#31034;&#23398;&#20064;&#12290;</title><link>http://arxiv.org/abs/2307.10895</link><description>&lt;p&gt;
&#29273;&#31185;&#28857;&#20113;&#30340;&#21464;&#20998;&#33258;&#32534;&#30721;
&lt;/p&gt;
&lt;p&gt;
Variational Autoencoding of Dental Point Clouds. (arXiv:2307.10895v2 [cs.CV] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10895
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#28857;&#20113;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;VF-Net&#65289;&#29992;&#20110;&#29273;&#31185;&#28857;&#20113;&#25968;&#25454;&#30340;&#22788;&#29702;&#65292;&#35813;&#27169;&#22411;&#22312;&#21508;&#31181;&#20219;&#21153;&#20013;&#20855;&#26377;&#26174;&#33879;&#30340;&#24615;&#33021;&#65292;&#21253;&#25324;&#32593;&#26684;&#29983;&#25104;&#12289;&#24418;&#29366;&#23436;&#25972;&#21644;&#34920;&#31034;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#29273;&#31185;&#23398;&#21462;&#24471;&#20102;&#37325;&#22823;&#36827;&#23637;&#65292;&#20294;&#20173;&#38754;&#20020;&#35768;&#22810;&#25361;&#25112;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;FDI 16&#25968;&#25454;&#38598;&#65292;&#36825;&#26159;&#19968;&#20010;&#21253;&#21547;&#20102;&#22823;&#37327;&#29273;&#40831;&#32593;&#26684;&#21644;&#28857;&#20113;&#30340;&#25968;&#25454;&#38598;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65306;&#21464;&#20998;FoldingNet&#65288;VF-Net&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#19987;&#20026;&#28857;&#20113;&#35774;&#35745;&#30340;&#23436;&#20840;&#27010;&#29575;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#20808;&#21069;&#30340;&#28857;&#20113;&#28508;&#21464;&#37327;&#27169;&#22411;&#32570;&#20047;&#36755;&#20837;&#21644;&#36755;&#20986;&#28857;&#20043;&#38388;&#30340;&#19968;&#19968;&#23545;&#24212;&#20851;&#31995;&#12290;&#30456;&#21453;&#65292;&#23427;&#20204;&#20381;&#36182;&#20110;&#20248;&#21270;Chamfer&#36317;&#31163;&#65292;&#36825;&#26159;&#19968;&#31181;&#32570;&#20047;&#24402;&#19968;&#21270;&#20998;&#24067;&#23545;&#24212;&#30340;&#24230;&#37327;&#65292;&#22240;&#27492;&#19981;&#36866;&#21512;&#27010;&#29575;&#24314;&#27169;&#12290;&#25105;&#20204;&#29992;&#21512;&#36866;&#30340;&#32534;&#30721;&#22120;&#21462;&#20195;&#20102;&#26126;&#30830;&#30340;&#26368;&#23567;&#21270;Chamfer&#36317;&#31163;&#65292;&#25552;&#39640;&#20102;&#35745;&#31639;&#25928;&#29575;&#65292;&#21516;&#26102;&#31616;&#21270;&#20102;&#27010;&#29575;&#25193;&#23637;&#12290;&#36825;&#20351;&#24471;&#22312;&#21508;&#31181;&#20219;&#21153;&#20013;&#37117;&#21487;&#20197;&#30452;&#25509;&#24212;&#29992;&#65292;&#21253;&#25324;&#32593;&#26684;&#29983;&#25104;&#12289;&#24418;&#29366;&#23436;&#25972;&#21644;&#34920;&#31034;&#23398;&#20064;&#12290;&#22312;&#23454;&#35777;&#26041;&#38754;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#29273;&#40831;&#37325;&#24314;&#20013;&#36739;&#20302;&#30340;&#37325;&#24314;&#35823;&#24046;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Digital dentistry has made significant advancements, yet numerous challenges remain. This paper introduces the FDI 16 dataset, an extensive collection of tooth meshes and point clouds. Additionally, we present a novel approach: Variational FoldingNet (VF-Net), a fully probabilistic variational autoencoder designed for point clouds. Notably, prior latent variable models for point clouds lack a one-to-one correspondence between input and output points. Instead, they rely on optimizing Chamfer distances, a metric that lacks a normalized distributional counterpart, rendering it unsuitable for probabilistic modeling. We replace the explicit minimization of Chamfer distances with a suitable encoder, increasing computational efficiency while simplifying the probabilistic extension. This allows for straightforward application in various tasks, including mesh generation, shape completion, and representation learning. Empirically, we provide evidence of lower reconstruction error in dental recon
&lt;/p&gt;</description></item></channel></rss>