<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#26694;&#26550;&#65292;&#26088;&#22312;&#20026;&#29992;&#25143;&#25552;&#20379;&#33410;&#28857;&#38544;&#31169;&#20445;&#25252;&#65292;&#24182;&#36890;&#36807;&#22312;&#33410;&#28857;&#32423;&#21035;&#23545;&#29305;&#24449;&#21644;&#26631;&#31614;&#25968;&#25454;&#36827;&#34892;&#38543;&#26426;&#21270;&#25200;&#21160;&#26469;&#23454;&#29616;&#12290;&#36890;&#36807;&#39057;&#29575;&#20272;&#35745;&#21644;&#37325;&#26500;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#23545;&#25200;&#21160;&#25968;&#25454;&#20013;&#29305;&#24449;&#21644;&#26631;&#31614;&#30340;&#24674;&#22797;&#12290;</title><link>http://arxiv.org/abs/2309.08569</link><description>&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#65306;&#19968;&#31181;&#37325;&#26500;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Local Differential Privacy in Graph Neural Networks: a Reconstruction Approach. (arXiv:2309.08569v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08569
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#26694;&#26550;&#65292;&#26088;&#22312;&#20026;&#29992;&#25143;&#25552;&#20379;&#33410;&#28857;&#38544;&#31169;&#20445;&#25252;&#65292;&#24182;&#36890;&#36807;&#22312;&#33410;&#28857;&#32423;&#21035;&#23545;&#29305;&#24449;&#21644;&#26631;&#31614;&#25968;&#25454;&#36827;&#34892;&#38543;&#26426;&#21270;&#25200;&#21160;&#26469;&#23454;&#29616;&#12290;&#36890;&#36807;&#39057;&#29575;&#20272;&#35745;&#21644;&#37325;&#26500;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#23545;&#25200;&#21160;&#25968;&#25454;&#20013;&#29305;&#24449;&#21644;&#26631;&#31614;&#30340;&#24674;&#22797;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#23545;&#24314;&#27169;&#22797;&#26434;&#22270;&#25968;&#25454;&#21462;&#24471;&#20102;&#24040;&#22823;&#25104;&#21151;&#12290;&#28982;&#32780;&#65292;&#26377;&#20851;GNN&#30340;&#38544;&#31169;&#20445;&#25252;&#30340;&#30740;&#31350;&#36824;&#24456;&#26377;&#38480;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23398;&#20064;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#19981;&#20007;&#22833;&#22826;&#22810;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#20026;&#29992;&#25143;&#25552;&#20379;&#33410;&#28857;&#38544;&#31169;&#20445;&#25252;&#12290;&#25105;&#20204;&#20851;&#27880;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#24046;&#20998;&#38544;&#31169;&#27010;&#24565;&#65292;&#21363;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#65292;&#24182;&#22312;&#25968;&#25454;&#34987;&#38598;&#20013;&#26381;&#21153;&#22120;&#36827;&#34892;&#27169;&#22411;&#35757;&#32451;&#20043;&#21069;&#65292;&#23545;&#33410;&#28857;&#32423;&#21035;&#30340;&#29305;&#24449;&#21644;&#26631;&#31614;&#25968;&#25454;&#24212;&#29992;&#38543;&#26426;&#21270;&#26426;&#21046;&#36827;&#34892;&#25200;&#21160;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#39640;&#32500;&#29305;&#24449;&#35774;&#32622;&#20013;&#24212;&#29992;&#38543;&#26426;&#21270;&#26426;&#21046;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#20855;&#26377;&#20005;&#26684;&#38544;&#31169;&#20445;&#35777;&#30340;LDP&#21327;&#35758;&#12290;&#22522;&#20110;&#38543;&#26426;&#21270;&#25968;&#25454;&#30340;&#32479;&#35745;&#20998;&#26512;&#20013;&#30340;&#39057;&#29575;&#20272;&#35745;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#37325;&#26500;&#26041;&#27861;&#26469;&#36817;&#20284;&#20174;&#25200;&#21160;&#25968;&#25454;&#20013;&#24674;&#22797;&#29305;&#24449;&#21644;&#26631;&#31614;&#12290;&#25105;&#20204;&#36824;&#21046;&#23450;&#20102;&#36825;&#20010;&#23398;&#20064;&#26694;&#26550;&#65292;&#21033;&#29992;&#20102;&#22270;&#32858;&#31867;&#20013;&#30340;&#39057;&#29575;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Networks have achieved tremendous success in modeling complex graph data in a variety of applications. However, there are limited studies investigating privacy protection in GNNs. In this work, we propose a learning framework that can provide node privacy at the user level, while incurring low utility loss. We focus on a decentralized notion of Differential Privacy, namely Local Differential Privacy, and apply randomization mechanisms to perturb both feature and label data at the node level before the data is collected by a central server for model training. Specifically, we investigate the application of randomization mechanisms in high-dimensional feature settings and propose an LDP protocol with strict privacy guarantees. Based on frequency estimation in statistical analysis of randomized data, we develop reconstruction methods to approximate features and labels from perturbed data. We also formulate this learning framework to utilize frequency estimates of graph cluste
&lt;/p&gt;</description></item></channel></rss>