<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#21644;&#23398;&#29983;&#36873;&#25321;&#65292;&#25913;&#36827;&#20102;&#26234;&#33021;&#36741;&#23548;&#31995;&#32479;&#30340;&#24615;&#33021;&#21644;&#21160;&#26426;&#12290;&#20351;&#29992;ZPDES&#31639;&#27861;&#65292;&#35813;&#31995;&#32479;&#33021;&#22815;&#26368;&#22823;&#21270;&#23398;&#20064;&#36827;&#23637;&#65292;&#24182;&#22312;&#23454;&#22320;&#30740;&#31350;&#20013;&#25552;&#39640;&#20102;&#19981;&#21516;&#23398;&#29983;&#32676;&#20307;&#30340;&#23398;&#20064;&#25104;&#32489;&#12290;&#30740;&#31350;&#36824;&#25506;&#35752;&#20102;&#23398;&#29983;&#36873;&#25321;&#23545;&#23398;&#20064;&#25928;&#29575;&#21644;&#21160;&#26426;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.01669</link><description>&lt;p&gt;
&#26234;&#33021;&#36741;&#23548;&#31995;&#32479;&#20013;&#30340;&#24615;&#33021;&#21644;&#21160;&#26426;&#30340;&#25913;&#36827;&#65306;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#21644;&#23398;&#20064;&#32773;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Improved Performances and Motivation in Intelligent Tutoring Systems: Combining Machine Learning and Learner Choice
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01669
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#21644;&#23398;&#29983;&#36873;&#25321;&#65292;&#25913;&#36827;&#20102;&#26234;&#33021;&#36741;&#23548;&#31995;&#32479;&#30340;&#24615;&#33021;&#21644;&#21160;&#26426;&#12290;&#20351;&#29992;ZPDES&#31639;&#27861;&#65292;&#35813;&#31995;&#32479;&#33021;&#22815;&#26368;&#22823;&#21270;&#23398;&#20064;&#36827;&#23637;&#65292;&#24182;&#22312;&#23454;&#22320;&#30740;&#31350;&#20013;&#25552;&#39640;&#20102;&#19981;&#21516;&#23398;&#29983;&#32676;&#20307;&#30340;&#23398;&#20064;&#25104;&#32489;&#12290;&#30740;&#31350;&#36824;&#25506;&#35752;&#20102;&#23398;&#29983;&#36873;&#25321;&#23545;&#23398;&#20064;&#25928;&#29575;&#21644;&#21160;&#26426;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23398;&#26657;&#20013;&#65292;&#22823;&#35268;&#27169;&#30340;&#35838;&#22530;&#35268;&#27169;&#32473;&#20010;&#24615;&#21270;&#23398;&#20064;&#24102;&#26469;&#20102;&#25361;&#25112;&#65292;&#25945;&#32946;&#25216;&#26415;&#65292;&#23588;&#20854;&#26159;&#26234;&#33021;&#36741;&#23548;&#31995;&#32479;&#65288;ITS&#65289;&#35797;&#22270;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#22522;&#20110;&#23398;&#20064;&#36827;&#23637;&#20551;&#35774;&#65288;LPH&#65289;&#21644;&#22810;&#33218;&#36172;&#21338;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30340;ZPDES&#31639;&#27861;&#23545;&#26368;&#22823;&#21270;&#23398;&#20064;&#36827;&#23637;&#65288;LP&#65289;&#30340;&#32451;&#20064;&#36827;&#34892;&#25490;&#24207;&#12290;&#35813;&#31639;&#27861;&#22312;&#20043;&#21069;&#30340;&#23454;&#22320;&#30740;&#31350;&#20013;&#24050;&#32463;&#26174;&#31034;&#20986;&#23558;&#23398;&#20064;&#34920;&#29616;&#25552;&#21319;&#21040;&#26356;&#24191;&#27867;&#30340;&#23398;&#29983;&#32676;&#20307;&#20013;&#65292;&#19982;&#25163;&#24037;&#35774;&#35745;&#30340;&#35838;&#31243;&#30456;&#27604;&#12290;&#28982;&#32780;&#65292;&#20854;&#21160;&#26426;&#24433;&#21709;&#23578;&#26410;&#35780;&#20272;&#12290;&#27492;&#22806;&#65292;ZPDES&#19981;&#20801;&#35768;&#23398;&#29983;&#21457;&#34920;&#36873;&#25321;&#24847;&#35265;&#12290;&#36825;&#31181;&#32570;&#20047;&#26426;&#26500;&#30340;&#38480;&#21046;&#19982;&#20851;&#27880;&#24314;&#27169;&#22909;&#22855;&#39537;&#21160;&#23398;&#20064;&#30340;LPH&#29702;&#35770;&#19981;&#19968;&#33268;&#12290;&#25105;&#20204;&#22312;&#36825;&#37324;&#30740;&#31350;&#20102;&#36825;&#31181;&#36873;&#25321;&#21487;&#33021;&#24615;&#30340;&#24341;&#20837;&#22914;&#20309;&#24433;&#21709;&#23398;&#20064;&#25928;&#29575;&#21644;&#21160;&#26426;&#12290;&#32473;&#23450;&#30340;&#36873;&#25321;&#19982;&#32451;&#20064;&#38590;&#24230;&#27491;&#20132;&#30340;&#32500;&#24230;&#26377;&#20851;&#65292;&#20316;&#20026;&#19968;&#31181;&#26377;&#36259;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large class sizes pose challenges to personalized learning in schools, which educational technologies, especially intelligent tutoring systems (ITS), aim to address. In this context, the ZPDES algorithm, based on the Learning Progress Hypothesis (LPH) and multi-armed bandit machine learning techniques, sequences exercises that maximize learning progress (LP). This algorithm was previously shown in field studies to boost learning performances for a wider diversity of students compared to a hand-designed curriculum. However, its motivational impact was not assessed. Also, ZPDES did not allow students to express choices. This limitation in agency is at odds with the LPH theory concerned with modeling curiosity-driven learning. We here study how the introduction of such choice possibilities impact both learning efficiency and motivation. The given choice concerns dimensions that are orthogonal to exercise difficulty, acting as a playful feature.   In an extensive field study (265 7-8 years
&lt;/p&gt;</description></item></channel></rss>