<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#20026;&#20102;&#32531;&#35299;&#21270;&#23398;&#25968;&#25454;&#34987;&#29992;&#20110;&#24320;&#21457;&#35782;&#21035;&#26032;&#22411;&#27602;&#32032;&#25110;&#21270;&#23398;&#25112;&#21058;&#30340;&#39044;&#27979;&#27169;&#22411;&#30340;&#21452;&#37325;&#29992;&#36884;&#39118;&#38505;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#19981;&#21487;&#30693;&#30340;&#26041;&#27861;&#65292;&#21487;&#22312;&#20445;&#30041;&#26377;&#21033;&#20110;&#35757;&#32451;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#25968;&#25454;&#30340;&#25928;&#29992;&#21306;&#22495;&#30340;&#21516;&#26102;&#65292;&#23545;&#25935;&#24863;&#20449;&#24687;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#26377;&#36873;&#25321;&#24615;&#30340;&#28155;&#21152;&#22122;&#38899;&#65292;&#35813;&#26041;&#27861;&#34987;&#35777;&#26126;&#26159;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#24573;&#30053;&#25935;&#24863;&#25968;&#25454;&#20250;&#22686;&#21152;&#27169;&#22411;&#30340;&#26041;&#24046;&#12290;</title><link>http://arxiv.org/abs/2304.10510</link><description>&lt;p&gt;
&#32531;&#35299;&#21452;&#37325;&#29992;&#36884;&#39118;&#38505;&#30340;&#21270;&#23398;&#25968;&#25454;&#23457;&#26597;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Censoring chemical data to mitigate dual use risk. (arXiv:2304.10510v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10510
&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#32531;&#35299;&#21270;&#23398;&#25968;&#25454;&#34987;&#29992;&#20110;&#24320;&#21457;&#35782;&#21035;&#26032;&#22411;&#27602;&#32032;&#25110;&#21270;&#23398;&#25112;&#21058;&#30340;&#39044;&#27979;&#27169;&#22411;&#30340;&#21452;&#37325;&#29992;&#36884;&#39118;&#38505;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#19981;&#21487;&#30693;&#30340;&#26041;&#27861;&#65292;&#21487;&#22312;&#20445;&#30041;&#26377;&#21033;&#20110;&#35757;&#32451;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#25968;&#25454;&#30340;&#25928;&#29992;&#21306;&#22495;&#30340;&#21516;&#26102;&#65292;&#23545;&#25935;&#24863;&#20449;&#24687;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#26377;&#36873;&#25321;&#24615;&#30340;&#28155;&#21152;&#22122;&#38899;&#65292;&#35813;&#26041;&#27861;&#34987;&#35777;&#26126;&#26159;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#24573;&#30053;&#25935;&#24863;&#25968;&#25454;&#20250;&#22686;&#21152;&#27169;&#22411;&#30340;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#30340;&#21452;&#37325;&#29992;&#36884;&#65288;&#27169;&#22411;&#26082;&#21487;&#20197;&#29992;&#20110;&#26377;&#30410;&#29992;&#36884;&#21448;&#21487;&#20197;&#29992;&#20110;&#24694;&#24847;&#30446;&#30340;&#65289;&#25552;&#20986;&#20102;&#37325;&#22823;&#25361;&#25112;&#12290;&#26368;&#36817;&#65292;&#22312;&#21270;&#23398;&#39046;&#22495;&#65292;&#30001;&#20110;&#21547;&#26377;&#25935;&#24863;&#26631;&#31614;&#65288;&#22914;&#27602;&#29702;&#23398;&#20449;&#24687;&#65289;&#30340;&#21270;&#23398;&#25968;&#25454;&#38598;&#21487;&#33021;&#34987;&#29992;&#20110;&#24320;&#21457;&#35782;&#21035;&#26032;&#22411;&#27602;&#32032;&#25110;&#21270;&#23398;&#25112;&#21058;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#36825;&#24050;&#25104;&#20026;&#19968;&#20010;&#29305;&#21035;&#30340;&#25285;&#24551;&#12290;&#20026;&#20102;&#32531;&#35299;&#21452;&#37325;&#29992;&#36884;&#39118;&#38505;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#19981;&#21487;&#30693;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#26377;&#36873;&#25321;&#24615;&#22320;&#28155;&#21152;&#22122;&#38899;&#21040;&#25968;&#25454;&#38598;&#20013;&#65292;&#21516;&#26102;&#20445;&#30041;&#26377;&#21033;&#20110;&#35757;&#32451;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#25968;&#25454;&#30340;&#25928;&#29992;&#21306;&#22495;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#25152;&#25552;&#20986;&#26041;&#27861;&#22312;&#26368;&#23567;&#20108;&#20056;&#27861;&#12289;&#22810;&#23618;&#24863;&#30693;&#22120;&#21644;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#26377;&#25928;&#24615;, &#21457;&#29616;&#26377;&#36873;&#25321;&#24615;&#28155;&#21152;&#22122;&#22768;&#25968;&#25454;&#21487;&#20197;&#24341;&#20837;&#27169;&#22411;&#30340;&#26041;&#24046;&#21644;&#39044;&#27979;&#25935;&#24863;&#26631;&#31614;&#30340;&#20559;&#24046;&#65292;&#36825;&#34920;&#26126;&#21487;&#20197;&#23454;&#29616;&#21253;&#21547;&#25935;&#24863;&#20449;&#24687;&#30340;&#25968;&#25454;&#38598;&#30340;&#23433;&#20840;&#20849;&#20139;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#24573;&#30053;&#25935;&#24863;&#25968;&#25454;&#36890;&#24120;&#20250;&#22686;&#21152;&#27169;&#22411;&#30340;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
The dual use of machine learning applications, where models can be used for both beneficial and malicious purposes, presents a significant challenge. This has recently become a particular concern in chemistry, where chemical datasets containing sensitive labels (e.g. toxicological information) could be used to develop predictive models that identify novel toxins or chemical warfare agents. To mitigate dual use risks, we propose a model-agnostic method of selectively noising datasets while preserving the utility of the data for training deep neural networks in a beneficial region. We evaluate the effectiveness of the proposed method across least squares, a multilayer perceptron, and a graph neural network. Our findings show selectively noised datasets can induce model variance and bias in predictions for sensitive labels with control, suggesting the safe sharing of datasets containing sensitive information is feasible. We also find omitting sensitive data often increases model variance 
&lt;/p&gt;</description></item></channel></rss>