<rss version="2.0"><channel><title>Chat Arxiv cs.CG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CG</description><item><title>&#36825;&#26159;&#19968;&#31181;&#20351;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#36827;&#34892;MRI&#22270;&#20687;&#20998;&#21106;&#30340;&#26032;&#26041;&#27861;&#65292;&#30456;&#27604;&#20256;&#32479;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20855;&#26377;&#20248;&#21183;&#65292;&#26080;&#38656;&#22823;&#37327;&#27880;&#37322;&#25968;&#25454;&#38598;&#65292;&#25552;&#20379;&#26356;&#21487;&#35299;&#37322;&#21644;&#31283;&#23450;&#30340;&#20998;&#21106;&#26694;&#26550;&#12290;</title><link>http://arxiv.org/abs/2401.01160</link><description>&lt;p&gt;
&#26080;&#38656;&#35757;&#32451;&#30340;MRI&#31435;&#26041;&#25345;&#32493;&#21516;&#35843;&#20998;&#21106;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Train-Free Segmentation in MRI with Cubical Persistent Homology. (arXiv:2401.01160v1 [eess.IV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01160
&lt;/p&gt;
&lt;p&gt;
&#36825;&#26159;&#19968;&#31181;&#20351;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#36827;&#34892;MRI&#22270;&#20687;&#20998;&#21106;&#30340;&#26032;&#26041;&#27861;&#65292;&#30456;&#27604;&#20256;&#32479;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20855;&#26377;&#20248;&#21183;&#65292;&#26080;&#38656;&#22823;&#37327;&#27880;&#37322;&#25968;&#25454;&#38598;&#65292;&#25552;&#20379;&#26356;&#21487;&#35299;&#37322;&#21644;&#31283;&#23450;&#30340;&#20998;&#21106;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25551;&#36848;&#20102;&#19968;&#31181;&#26032;&#30340;MRI&#25195;&#25551;&#20998;&#21106;&#26041;&#27861;&#65292;&#20351;&#29992;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#65288;TDA&#65289;&#65292;&#30456;&#27604;&#20256;&#32479;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20855;&#26377;&#20960;&#20010;&#20248;&#28857;&#12290;&#23427;&#20998;&#20026;&#19977;&#20010;&#27493;&#39588;&#65292;&#39318;&#20808;&#36890;&#36807;&#33258;&#21160;&#38408;&#20540;&#30830;&#23450;&#35201;&#20998;&#21106;&#30340;&#25972;&#20010;&#23545;&#35937;&#65292;&#28982;&#21518;&#26816;&#27979;&#19968;&#20010;&#24050;&#30693;&#25299;&#25169;&#32467;&#26500;&#30340;&#29420;&#29305;&#23376;&#38598;&#65292;&#26368;&#21518;&#25512;&#23548;&#20986;&#20998;&#21106;&#30340;&#21508;&#20010;&#32452;&#25104;&#37096;&#20998;&#12290;&#34429;&#28982;&#35843;&#29992;&#20102;TDA&#30340;&#32463;&#20856;&#24605;&#24819;&#65292;&#20294;&#36825;&#26679;&#30340;&#31639;&#27861;&#20174;&#26410;&#19982;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#20998;&#31163;&#25552;&#20986;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#38500;&#20102;&#32771;&#34385;&#22270;&#20687;&#30340;&#21516;&#35843;&#24615;&#22806;&#65292;&#36824;&#32771;&#34385;&#20102;&#20195;&#34920;&#24615;&#21608;&#26399;&#30340;&#23450;&#20301;&#65292;&#36825;&#26159;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#20284;&#20046;&#20174;&#26410;&#34987;&#21033;&#29992;&#36807;&#30340;&#20449;&#24687;&#12290;&#29305;&#21035;&#26159;&#65292;&#23427;&#25552;&#20379;&#20102;&#26080;&#38656;&#22823;&#37327;&#27880;&#37322;&#25968;&#25454;&#38598;&#36827;&#34892;&#20998;&#21106;&#30340;&#33021;&#21147;&#12290;TDA&#36824;&#36890;&#36807;&#23558;&#25299;&#25169;&#29305;&#24449;&#26126;&#30830;&#26144;&#23556;&#21040;&#20998;&#21106;&#32452;&#20214;&#26469;&#25552;&#20379;&#26356;&#21487;&#35299;&#37322;&#21644;&#31283;&#23450;&#30340;&#20998;&#21106;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
We describe a new general method for segmentation in MRI scans using Topological Data Analysis (TDA), offering several advantages over traditional machine learning approaches. It works in three steps, first identifying the whole object to segment via automatic thresholding, then detecting a distinctive subset whose topology is known in advance, and finally deducing the various components of the segmentation. Although convoking classical ideas of TDA, such an algorithm has never been proposed separately from deep learning methods. To achieve this, our approach takes into account, in addition to the homology of the image, the localization of representative cycles, a piece of information that seems never to have been exploited in this context. In particular, it offers the ability to perform segmentation without the need for large annotated data sets. TDA also provides a more interpretable and stable framework for segmentation by explicitly mapping topological features to segmentation comp
&lt;/p&gt;</description></item></channel></rss>