<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#26041;&#27861;&#65292;JudgeDeceiver&#65292;&#38024;&#23545;LLM-as-a-Judge&#65292;&#36890;&#36807;&#33258;&#21160;&#21270;&#29983;&#25104;&#23545;&#25239;&#24207;&#21015;&#23454;&#29616;&#20102;&#26377;&#38024;&#23545;&#24615;&#21644;&#39640;&#25928;&#30340;&#27169;&#22411;&#35780;&#20272;&#25805;&#25511;&#12290;</title><link>https://arxiv.org/abs/2403.17710</link><description>&lt;p&gt;
&#22522;&#20110;&#20248;&#21270;&#30340;&#23545;LLM&#35780;&#21028;&#31995;&#32479;&#30340;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Optimization-based Prompt Injection Attack to LLM-as-a-Judge
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17710
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#26041;&#27861;&#65292;JudgeDeceiver&#65292;&#38024;&#23545;LLM-as-a-Judge&#65292;&#36890;&#36807;&#33258;&#21160;&#21270;&#29983;&#25104;&#23545;&#25239;&#24207;&#21015;&#23454;&#29616;&#20102;&#26377;&#38024;&#23545;&#24615;&#21644;&#39640;&#25928;&#30340;&#27169;&#22411;&#35780;&#20272;&#25805;&#25511;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
LLM-as-a-Judge &#26159;&#19968;&#31181;&#21487;&#20197;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#35780;&#20272;&#25991;&#26412;&#20449;&#24687;&#30340;&#26032;&#39062;&#35299;&#20915;&#26041;&#26696;&#12290;&#26681;&#25454;&#29616;&#26377;&#30740;&#31350;&#65292;LLMs&#22312;&#25552;&#20379;&#20256;&#32479;&#20154;&#31867;&#35780;&#20272;&#30340;&#24341;&#20154;&#27880;&#30446;&#26367;&#20195;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#31995;&#32479;&#38024;&#23545;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;JudgeDeceiver&#65292;&#19968;&#31181;&#38024;&#23545;LLM-as-a-Judge&#37327;&#36523;&#23450;&#21046;&#30340;&#22522;&#20110;&#20248;&#21270;&#30340;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21046;&#23450;&#20102;&#19968;&#20010;&#31934;&#30830;&#30340;&#20248;&#21270;&#30446;&#26631;&#65292;&#29992;&#20110;&#25915;&#20987;LLM-as-a-Judge&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#24182;&#21033;&#29992;&#20248;&#21270;&#31639;&#27861;&#39640;&#25928;&#22320;&#33258;&#21160;&#21270;&#29983;&#25104;&#23545;&#25239;&#24207;&#21015;&#65292;&#23454;&#29616;&#23545;&#27169;&#22411;&#35780;&#20272;&#30340;&#26377;&#38024;&#23545;&#24615;&#21644;&#26377;&#25928;&#30340;&#25805;&#20316;&#12290;&#19982;&#25163;&#24037;&#21046;&#20316;&#30340;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#34920;&#29616;&#20986;&#21331;&#36234;&#30340;&#21151;&#25928;&#65292;&#32473;&#22522;&#20110;LLM&#30340;&#21028;&#26029;&#31995;&#32479;&#24403;&#21069;&#30340;&#23433;&#20840;&#33539;&#24335;&#24102;&#26469;&#20102;&#37325;&#22823;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17710v1 Announce Type: cross  Abstract: LLM-as-a-Judge is a novel solution that can assess textual information with large language models (LLMs). Based on existing research studies, LLMs demonstrate remarkable performance in providing a compelling alternative to traditional human assessment. However, the robustness of these systems against prompt injection attacks remains an open question. In this work, we introduce JudgeDeceiver, a novel optimization-based prompt injection attack tailored to LLM-as-a-Judge. Our method formulates a precise optimization objective for attacking the decision-making process of LLM-as-a-Judge and utilizes an optimization algorithm to efficiently automate the generation of adversarial sequences, achieving targeted and effective manipulation of model evaluations. Compared to handcraft prompt injection attacks, our method demonstrates superior efficacy, posing a significant challenge to the current security paradigms of LLM-based judgment systems. T
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#38754;&#21521;&#20114;&#32852;&#32593;&#21307;&#30103;&#29289;&#32852;&#32593;&#31995;&#32479;&#30340;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#23433;&#20840;&#19982;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;&#65292;&#26088;&#22312;&#35299;&#20915;IoMT&#31995;&#32479;&#38754;&#20020;&#30340;&#23433;&#20840;&#25361;&#25112;&#65292;&#21253;&#25324;&#25968;&#25454;&#25935;&#24863;&#24615;&#12289;&#24694;&#24847;&#25915;&#20987;&#21644;&#24322;&#24120;&#26816;&#27979;&#12290;</title><link>https://arxiv.org/abs/2403.09752</link><description>&lt;p&gt;
&#38754;&#21521;IoMT&#31995;&#32479;&#30340;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#23433;&#20840;&#19982;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Explainable Machine Learning-Based Security and Privacy Protection Framework for Internet of Medical Things Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09752
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#38754;&#21521;&#20114;&#32852;&#32593;&#21307;&#30103;&#29289;&#32852;&#32593;&#31995;&#32479;&#30340;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#23433;&#20840;&#19982;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;&#65292;&#26088;&#22312;&#35299;&#20915;IoMT&#31995;&#32479;&#38754;&#20020;&#30340;&#23433;&#20840;&#25361;&#25112;&#65292;&#21253;&#25324;&#25968;&#25454;&#25935;&#24863;&#24615;&#12289;&#24694;&#24847;&#25915;&#20987;&#21644;&#24322;&#24120;&#26816;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20114;&#32852;&#32593;&#21307;&#30103;&#29289;&#32852;&#32593;&#65288;IoMT&#65289;&#36328;&#36234;&#20102;&#20256;&#32479;&#21307;&#30103;&#36793;&#30028;&#65292;&#23454;&#29616;&#20102;&#20174;&#34987;&#21160;&#27835;&#30103;&#21521;&#20027;&#21160;&#39044;&#38450;&#30340;&#36807;&#28193;&#12290;&#36825;&#31181;&#21019;&#26032;&#26041;&#27861;&#36890;&#36807;&#23454;&#26102;&#20581;&#24247;&#25968;&#25454;&#25910;&#38598;&#23454;&#29616;&#26089;&#26399;&#30142;&#30149;&#26816;&#27979;&#21644;&#20010;&#24615;&#21270;&#25252;&#29702;&#65292;&#29305;&#21035;&#22312;&#24930;&#24615;&#30149;&#31649;&#29702;&#26041;&#38754;&#65292;IoMT&#21487;&#20197;&#33258;&#21160;&#21270;&#27835;&#30103;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22788;&#29702;&#25968;&#25454;&#30340;&#25935;&#24863;&#24615;&#21644;&#20215;&#20540;&#65292;IoMT&#38754;&#20020;&#30528;&#20005;&#37325;&#30340;&#23433;&#20840;&#25361;&#25112;&#65292;&#36825;&#20250;&#23041;&#32961;&#21040;&#20854;&#29992;&#25143;&#30340;&#29983;&#21629;&#65292;&#22240;&#27492;&#21560;&#24341;&#20102;&#24694;&#24847;&#21033;&#30410;&#12290;&#27492;&#22806;&#65292;&#21033;&#29992;&#26080;&#32447;&#36890;&#20449;&#36827;&#34892;&#25968;&#25454;&#20256;&#36755;&#20250;&#20351;&#21307;&#30103;&#25968;&#25454;&#26292;&#38706;&#20110;&#34987;&#32593;&#32476;&#29359;&#32618;&#20998;&#23376;&#25130;&#33719;&#21644;&#31713;&#25913;&#30340;&#39118;&#38505;&#20043;&#19979;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#20154;&#20026;&#38169;&#35823;&#12289;&#32593;&#32476;&#24178;&#25200;&#25110;&#30828;&#20214;&#25925;&#38556;&#65292;&#21487;&#33021;&#20250;&#20986;&#29616;&#24322;&#24120;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30340;&#24322;&#24120;&#26816;&#27979;&#26159;&#19968;&#20010;&#26377;&#36259;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#23427;&#20877;&#27425;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09752v1 Announce Type: cross  Abstract: The Internet of Medical Things (IoMT) transcends traditional medical boundaries, enabling a transition from reactive treatment to proactive prevention. This innovative method revolutionizes healthcare by facilitating early disease detection and tailored care, particularly in chronic disease management, where IoMT automates treatments based on real-time health data collection. Nonetheless, its benefits are countered by significant security challenges that endanger the lives of its users due to the sensitivity and value of the processed data, thereby attracting malicious interests. Moreover, the utilization of wireless communication for data transmission exposes medical data to interception and tampering by cybercriminals. Additionally, anomalies may arise due to human errors, network interference, or hardware malfunctions. In this context, anomaly detection based on Machine Learning (ML) is an interesting solution, but it comes up again
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Syntactic Ghost&#30340;&#26032;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#23545;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#26080;&#24863;&#30693;&#21644;&#36890;&#29992;&#30340;&#21518;&#38376;&#26893;&#20837;&#12290;</title><link>https://arxiv.org/abs/2402.18945</link><description>&lt;p&gt;
Syntactic Ghost&#65306;&#19968;&#31181;&#23545;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#30340;&#26080;&#24863;&#30693;&#36890;&#29992;&#21518;&#38376;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Syntactic Ghost: An Imperceptible General-purpose Backdoor Attacks on Pre-trained Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18945
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Syntactic Ghost&#30340;&#26032;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#23545;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#26080;&#24863;&#30693;&#21644;&#36890;&#29992;&#30340;&#21518;&#38376;&#26893;&#20837;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#65288;PLMs&#65289;&#34987;&#21457;&#29616;&#23481;&#26131;&#21463;&#21040;&#21518;&#38376;&#25915;&#20987;&#65292;&#21487;&#20197;&#23558;&#28431;&#27934;&#36716;&#31227;&#21040;&#21508;&#31181;&#19979;&#28216;&#20219;&#21153;&#20013;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;PLM&#21518;&#38376;&#25915;&#20987;&#37319;&#29992;&#26126;&#26174;&#30340;&#35302;&#21457;&#22120;&#65292;&#22312;&#25163;&#21160;&#23545;&#20934;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#65292;&#22240;&#27492;&#22312;&#25928;&#26524;&#12289;&#38544;&#21311;&#24615;&#21644;&#36890;&#29992;&#24615;&#26041;&#38754;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#26399;&#26395;&#30446;&#26631;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#19981;&#21487;&#35265;&#21644;&#36890;&#29992;&#30340;&#21518;&#38376;&#26893;&#20837;&#65292;&#31216;&#20026;Syntactic Ghost&#65288;&#31616;&#31216;&#20026;synGhost&#65289;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#35813;&#26041;&#27861;&#25932;&#24847;&#22320;&#20351;&#29992;&#20855;&#26377;&#19981;&#21516;&#39044;&#23450;&#20041;&#21477;&#27861;&#32467;&#26500;&#30340;&#27602;&#23475;&#26679;&#26412;&#20316;&#20026;&#38544;&#34109;&#35302;&#21457;&#22120;&#65292;&#28982;&#21518;&#23558;&#21518;&#38376;&#26893;&#20837;&#21040;&#39044;&#35757;&#32451;&#34920;&#31034;&#31354;&#38388;&#65292;&#32780;&#19981;&#20250;&#30772;&#22351;&#21407;&#22987;&#30693;&#35782;&#12290;&#27602;&#23475;&#26679;&#26412;&#30340;&#36755;&#20986;&#34920;&#31034;&#22312;&#29305;&#24449;&#31354;&#38388;&#20013;&#23613;&#21487;&#33021;&#22343;&#21248;&#22320;&#20998;&#24067;&#65292;&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#24418;&#25104;&#24191;&#27867;&#30340;&#21518;&#38376;&#12290;&#27492;&#22806;&#65292;&#22312;&#20142;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18945v1 Announce Type: cross  Abstract: Pre-trained language models (PLMs) have been found susceptible to backdoor attacks, which can transfer vulnerabilities to various downstream tasks. However, existing PLM backdoors are conducted with explicit triggers under the manually aligned, thus failing to satisfy expectation goals simultaneously in terms of effectiveness, stealthiness, and universality. In this paper, we propose a novel approach to achieve invisible and general backdoor implantation, called \textbf{Syntactic Ghost} (synGhost for short). Specifically, the method hostilely manipulates poisoned samples with different predefined syntactic structures as stealth triggers and then implants the backdoor to pre-trained representation space without disturbing the primitive knowledge. The output representations of poisoned samples are distributed as uniformly as possible in the feature space via contrastive learning, forming a wide range of backdoors. Additionally, in light 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#26368;&#26032;&#30340;&#38754;&#37096;&#28145;&#24230;&#20266;&#36896;&#26816;&#27979;&#22120;&#36827;&#34892;&#20102;&#20840;&#38754;&#22238;&#39038;&#21644;&#20998;&#26512;&#65292;&#25552;&#20379;&#20102;&#23545;&#20854;&#26377;&#25928;&#24615;&#24433;&#21709;&#22240;&#32032;&#30340;&#28145;&#20837;&#35265;&#35299;&#65292;&#24182;&#22312;&#21508;&#31181;&#25915;&#20987;&#22330;&#26223;&#20013;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2401.04364</link><description>&lt;p&gt;
SoK&#65306;&#38754;&#37096;&#28145;&#24230;&#20266;&#36896;&#26816;&#27979;&#22120;
&lt;/p&gt;
&lt;p&gt;
SoK: Facial Deepfake Detectors. (arXiv:2401.04364v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#26368;&#26032;&#30340;&#38754;&#37096;&#28145;&#24230;&#20266;&#36896;&#26816;&#27979;&#22120;&#36827;&#34892;&#20102;&#20840;&#38754;&#22238;&#39038;&#21644;&#20998;&#26512;&#65292;&#25552;&#20379;&#20102;&#23545;&#20854;&#26377;&#25928;&#24615;&#24433;&#21709;&#22240;&#32032;&#30340;&#28145;&#20837;&#35265;&#35299;&#65292;&#24182;&#22312;&#21508;&#31181;&#25915;&#20987;&#22330;&#26223;&#20013;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#20266;&#36896;&#25216;&#26415;&#36805;&#36895;&#25104;&#20026;&#23545;&#31038;&#20250;&#26500;&#25104;&#28145;&#36828;&#21644;&#20005;&#37325;&#23041;&#32961;&#30340;&#21407;&#22240;&#20043;&#19968;&#65292;&#20027;&#35201;&#30001;&#20110;&#20854;&#26131;&#20110;&#21046;&#20316;&#21644;&#20256;&#25773;&#12290;&#36825;&#31181;&#24773;&#20917;&#21152;&#36895;&#20102;&#28145;&#24230;&#20266;&#36896;&#26816;&#27979;&#25216;&#26415;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#29616;&#26377;&#30340;&#26816;&#27979;&#22120;&#22312;&#39564;&#35777;&#26102; heavily &#20381;&#36182;&#23454;&#39564;&#23460;&#29983;&#25104;&#30340;&#25968;&#25454;&#38598;&#65292;&#36825;&#21487;&#33021;&#26080;&#27861;&#26377;&#25928;&#22320;&#35753;&#23427;&#20204;&#24212;&#23545;&#26032;&#39062;&#12289;&#26032;&#20852;&#21644;&#23454;&#38469;&#30340;&#28145;&#24230;&#20266;&#36896;&#25216;&#26415;&#12290;&#26412;&#25991;&#23545;&#26368;&#26032;&#30340;&#28145;&#24230;&#20266;&#36896;&#26816;&#27979;&#22120;&#36827;&#34892;&#24191;&#27867;&#20840;&#38754;&#30340;&#22238;&#39038;&#21644;&#20998;&#26512;&#65292;&#26681;&#25454;&#20960;&#20010;&#20851;&#38190;&#26631;&#20934;&#23545;&#23427;&#20204;&#36827;&#34892;&#35780;&#20272;&#12290;&#36825;&#20123;&#26631;&#20934;&#23558;&#36825;&#20123;&#26816;&#27979;&#22120;&#20998;&#20026; 4 &#20010;&#39640;&#32423;&#32452;&#21035;&#21644; 13 &#20010;&#32454;&#31890;&#24230;&#23376;&#32452;&#21035;&#65292;&#37117;&#36981;&#24490;&#19968;&#20010;&#32479;&#19968;&#30340;&#26631;&#20934;&#27010;&#24565;&#26694;&#26550;&#12290;&#36825;&#31181;&#20998;&#31867;&#21644;&#26694;&#26550;&#25552;&#20379;&#20102;&#23545;&#24433;&#21709;&#26816;&#27979;&#22120;&#21151;&#25928;&#30340;&#22240;&#32032;&#30340;&#28145;&#20837;&#21644;&#23454;&#29992;&#30340;&#35265;&#35299;&#12290;&#25105;&#20204;&#23545; 16 &#20010;&#20027;&#35201;&#30340;&#26816;&#27979;&#22120;&#22312;&#21508;&#31181;&#26631;&#20934;&#30340;&#25915;&#20987;&#22330;&#26223;&#20013;&#30340;&#26222;&#36866;&#24615;&#36827;&#34892;&#35780;&#20272;&#65292;&#21253;&#25324;&#40657;&#30418;&#25915;&#20987;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deepfakes have rapidly emerged as a profound and serious threat to society, primarily due to their ease of creation and dissemination. This situation has triggered an accelerated development of deepfake detection technologies. However, many existing detectors rely heavily on lab-generated datasets for validation, which may not effectively prepare them for novel, emerging, and real-world deepfake techniques. In this paper, we conduct an extensive and comprehensive review and analysis of the latest state-of-the-art deepfake detectors, evaluating them against several critical criteria. These criteria facilitate the categorization of these detectors into 4 high-level groups and 13 fine-grained sub-groups, all aligned with a unified standard conceptual framework. This classification and framework offer deep and practical insights into the factors that affect detector efficacy. We assess the generalizability of 16 leading detectors across various standard attack scenarios, including black-bo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26426;&#23494;&#30340;&#25968;&#25454;&#36873;&#25321;&#21644;&#35780;&#20272;&#26041;&#27861;&#65292;&#36890;&#36807;&#21019;&#26032;&#30340;&#27969;&#31243;&#21644;&#31616;&#21270;&#30340;&#20302;&#32500;&#24230;&#25805;&#20316;&#26469;&#23454;&#29616;&#65292;&#20197;&#20445;&#25252;&#25968;&#25454;&#21644;&#27169;&#22411;&#30340;&#38544;&#31169;&#65292;&#24182;&#22312;&#22810;&#20010;Transformer&#27169;&#22411;&#21644;NLP/CV&#22522;&#20934;&#27979;&#35797;&#20013;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2310.02373</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#30340;&#23433;&#20840;&#26377;&#25928;&#25968;&#25454;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Secure and Effective Data Appraisal for Machine Learning. (arXiv:2310.02373v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02373
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26426;&#23494;&#30340;&#25968;&#25454;&#36873;&#25321;&#21644;&#35780;&#20272;&#26041;&#27861;&#65292;&#36890;&#36807;&#21019;&#26032;&#30340;&#27969;&#31243;&#21644;&#31616;&#21270;&#30340;&#20302;&#32500;&#24230;&#25805;&#20316;&#26469;&#23454;&#29616;&#65292;&#20197;&#20445;&#25252;&#25968;&#25454;&#21644;&#27169;&#22411;&#30340;&#38544;&#31169;&#65292;&#24182;&#22312;&#22810;&#20010;Transformer&#27169;&#22411;&#21644;NLP/CV&#22522;&#20934;&#27979;&#35797;&#20013;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20010;&#26080;&#25304;&#26080;&#26463;&#30340;&#25968;&#25454;&#24066;&#22330;&#38656;&#35201;&#22312;&#25968;&#25454;&#25152;&#26377;&#32773;&#21644;&#27169;&#22411;&#25152;&#26377;&#32773;&#26368;&#32456;&#20132;&#26131;&#21069;&#33021;&#22815;&#23545;&#35757;&#32451;&#25968;&#25454;&#36827;&#34892;&#31169;&#23494;&#36873;&#25321;&#21644;&#35780;&#20272;&#12290;&#20026;&#20102;&#20445;&#25252;&#25968;&#25454;&#21644;&#27169;&#22411;&#30340;&#38544;&#31169;&#65292;&#36825;&#20010;&#36807;&#31243;&#28041;&#21450;&#20351;&#29992;&#22810;&#26041;&#35745;&#31639;(MPC)&#26469;&#23457;&#26597;&#30446;&#26631;&#27169;&#22411;&#12290;&#23613;&#31649;&#20043;&#21069;&#30340;&#30740;&#31350;&#35748;&#20026;&#22522;&#20110;MPC&#30340;Transformer&#27169;&#22411;&#35780;&#20272;&#36807;&#20110;&#32791;&#36153;&#36164;&#28304;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26041;&#27861;&#65292;&#20351;&#25968;&#25454;&#36873;&#25321;&#25104;&#20026;&#21487;&#34892;&#30340;&#12290;&#26412;&#30740;&#31350;&#30340;&#36129;&#29486;&#21253;&#25324;&#19977;&#20010;&#20851;&#38190;&#35201;&#32032;&#65306;(1)&#20351;&#29992;MPC&#36827;&#34892;&#26426;&#23494;&#25968;&#25454;&#36873;&#25321;&#30340;&#24320;&#21019;&#24615;&#27969;&#31243;&#65307;(2)&#36890;&#36807;&#22312;&#26377;&#38480;&#30340;&#30456;&#20851;&#25968;&#25454;&#23376;&#38598;&#19978;&#35757;&#32451;&#31616;&#21270;&#30340;&#20302;&#32500;&#24230;MLP&#26469;&#22797;&#21046;&#22797;&#26434;&#30340;&#39640;&#32500;&#24230;&#25805;&#20316;&#65307;(3)&#24182;&#21457;&#12289;&#22810;&#38454;&#27573;&#22320;&#23454;&#29616;MPC&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#19968;&#31995;&#21015;Transformer&#27169;&#22411;&#21644;NLP/CV&#22522;&#20934;&#27979;&#35797;&#20013;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#19982;&#30452;&#25509;&#22522;&#20110;MPC&#30340;&#35780;&#20272;&#30456;&#27604;
&lt;/p&gt;
&lt;p&gt;
Essential for an unfettered data market is the ability to discreetly select and evaluate training data before finalizing a transaction between the data owner and model owner. To safeguard the privacy of both data and model, this process involves scrutinizing the target model through Multi-Party Computation (MPC). While prior research has posited that the MPC-based evaluation of Transformer models is excessively resource-intensive, this paper introduces an innovative approach that renders data selection practical. The contributions of this study encompass three pivotal elements: (1) a groundbreaking pipeline for confidential data selection using MPC, (2) replicating intricate high-dimensional operations with simplified low-dimensional MLPs trained on a limited subset of pertinent data, and (3) implementing MPC in a concurrent, multi-phase manner. The proposed method is assessed across an array of Transformer models and NLP/CV benchmarks. In comparison to the direct MPC-based evaluation 
&lt;/p&gt;</description></item><item><title>SecureFalcon&#26159;&#22522;&#20110;FalconLLM&#30340;&#32593;&#32476;&#25512;&#29702;&#31995;&#32479;&#65292;&#36890;&#36807;&#24494;&#35843;FalconLLM&#26469;&#23454;&#29616;&#32593;&#32476;&#23433;&#20840;&#24212;&#29992;&#65292;&#33021;&#22815;&#35782;&#21035;C&#20195;&#30721;&#26679;&#26412;&#20013;&#30340;&#28431;&#27934;&#21644;&#38750;&#28431;&#27934;&#20869;&#23481;&#12290;</title><link>http://arxiv.org/abs/2307.06616</link><description>&lt;p&gt;
SecureFalcon:&#19979;&#19968;&#20195;&#38754;&#21521;&#32593;&#32476;&#23433;&#20840;&#30340;&#32593;&#32476;&#25512;&#29702;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
SecureFalcon: The Next Cyber Reasoning System for Cyber Security. (arXiv:2307.06616v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06616
&lt;/p&gt;
&lt;p&gt;
SecureFalcon&#26159;&#22522;&#20110;FalconLLM&#30340;&#32593;&#32476;&#25512;&#29702;&#31995;&#32479;&#65292;&#36890;&#36807;&#24494;&#35843;FalconLLM&#26469;&#23454;&#29616;&#32593;&#32476;&#23433;&#20840;&#24212;&#29992;&#65292;&#33021;&#22815;&#35782;&#21035;C&#20195;&#30721;&#26679;&#26412;&#20013;&#30340;&#28431;&#27934;&#21644;&#38750;&#28431;&#27934;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36719;&#20214;&#28431;&#27934;&#23548;&#33268;&#21508;&#31181;&#19981;&#21033;&#24433;&#21709;&#65292;&#22914;&#23849;&#28291;&#12289;&#25968;&#25454;&#20002;&#22833;&#21644;&#23433;&#20840;&#28431;&#27934;&#65292;&#20005;&#37325;&#24433;&#21709;&#36719;&#20214;&#24212;&#29992;&#21644;&#31995;&#32479;&#30340;&#24066;&#22330;&#37319;&#29992;&#29575;&#12290;&#23613;&#31649;&#20256;&#32479;&#30340;&#26041;&#27861;&#65292;&#22914;&#33258;&#21160;&#21270;&#36719;&#20214;&#27979;&#35797;&#12289;&#25925;&#38556;&#23450;&#20301;&#21644;&#20462;&#22797;&#24050;&#32463;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#65292;&#20294;&#38745;&#24577;&#20998;&#26512;&#24037;&#20855;&#26368;&#24120;&#29992;&#19988;&#26377;&#22266;&#26377;&#30340;&#35823;&#25253;&#29575;&#65292;&#32473;&#24320;&#21457;&#20154;&#21592;&#30340;&#29983;&#20135;&#21147;&#24102;&#26469;&#20102;&#23454;&#36136;&#24615;&#25361;&#25112;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#20026;&#36825;&#20123;&#25345;&#20037;&#38382;&#39064;&#25552;&#20379;&#20102;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#20854;&#20013;&#65292;FalconLLM&#22312;&#35782;&#21035;&#22797;&#26434;&#27169;&#24335;&#21644;&#28431;&#27934;&#26041;&#38754;&#26174;&#31034;&#20986;&#37325;&#35201;&#28508;&#21147;&#65292;&#22240;&#27492;&#22312;&#36719;&#20214;&#28431;&#27934;&#26816;&#27979;&#20013;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#27425;&#23545;FalconLLM&#36827;&#34892;&#20102;&#38024;&#23545;&#32593;&#32476;&#23433;&#20840;&#24212;&#29992;&#30340;&#24494;&#35843;&#65292;&#20174;&#32780;&#25512;&#20986;&#20102;SecureFalcon&#65292;&#36825;&#26159;&#22522;&#20110;FalconLLM&#30340;&#21019;&#26032;&#27169;&#22411;&#26550;&#26500;&#12290;SecureFalcon&#34987;&#35757;&#32451;&#29992;&#20110;&#21306;&#20998;&#26377;&#28431;&#27934;&#21644;&#26080;&#28431;&#27934;&#30340;C&#20195;&#30721;&#26679;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Software vulnerabilities leading to various detriments such as crashes, data loss, and security breaches, significantly hinder the quality, affecting the market adoption of software applications and systems. Although traditional methods such as automated software testing, fault localization, and repair have been intensively studied, static analysis tools are most commonly used and have an inherent false positives rate, posing a solid challenge to developer productivity. Large Language Models (LLMs) offer a promising solution to these persistent issues. Among these, FalconLLM has shown substantial potential in identifying intricate patterns and complex vulnerabilities, hence crucial in software vulnerability detection. In this paper, for the first time, FalconLLM is being fine-tuned for cybersecurity applications, thus introducing SecureFalcon, an innovative model architecture built upon FalconLLM. SecureFalcon is trained to differentiate between vulnerable and non-vulnerable C code sam
&lt;/p&gt;</description></item></channel></rss>