<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#20154;&#31867;&#21644;&#20154;&#24037;&#26234;&#33021;&#24418;&#25104;&#30340;&#22810;&#23618;&#27425;&#38598;&#20307;&#26234;&#33021;&#32593;&#32476;&#65292;&#21487;&#20197;&#23454;&#29616;&#36229;&#36234;&#20219;&#19968;&#21333;&#29420;&#23454;&#20307;&#30340;&#38598;&#20307;&#26234;&#33021;&#27700;&#24179;&#12290;</title><link>https://arxiv.org/abs/2403.10433</link><description>&lt;p&gt;
AI&#22686;&#24378;&#30340;&#38598;&#20307;&#26234;&#33021;&#65306;&#29616;&#29366;&#19982;&#23637;&#26395;
&lt;/p&gt;
&lt;p&gt;
AI-enhanced Collective Intelligence: The State of the Art and Prospects
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10433
&lt;/p&gt;
&lt;p&gt;
&#20154;&#31867;&#21644;&#20154;&#24037;&#26234;&#33021;&#24418;&#25104;&#30340;&#22810;&#23618;&#27425;&#38598;&#20307;&#26234;&#33021;&#32593;&#32476;&#65292;&#21487;&#20197;&#23454;&#29616;&#36229;&#36234;&#20219;&#19968;&#21333;&#29420;&#23454;&#20307;&#30340;&#38598;&#20307;&#26234;&#33021;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#30340;&#31038;&#20250;&#25361;&#25112;&#36229;&#20986;&#20102;&#20154;&#31867;&#20010;&#20307;&#25110;&#38598;&#20307;&#21162;&#21147;&#30340;&#33021;&#21147;&#12290;&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#30340;&#21457;&#23637;&#65292;&#20854;&#22312;&#20154;&#31867;&#38598;&#20307;&#20013;&#30340;&#35282;&#33394;&#23558;&#20174;&#36741;&#21161;&#24037;&#20855;&#36716;&#21464;&#20026;&#21442;&#19982;&#24335;&#25104;&#21592;&#12290;&#20154;&#31867;&#21644;&#20154;&#24037;&#26234;&#33021;&#25317;&#26377;&#20114;&#34917;&#30340;&#33021;&#21147;&#65292;&#24403;&#20108;&#32773;&#21327;&#21516;&#20316;&#29992;&#26102;&#65292;&#21487;&#20197;&#23454;&#29616;&#19968;&#31181;&#36229;&#36234;&#21333;&#29420;&#20154;&#31867;&#25110;&#20154;&#24037;&#26234;&#33021;&#38598;&#20307;&#33021;&#21147;&#30340;&#38598;&#20307;&#26234;&#33021;&#27700;&#24179;&#12290;&#28982;&#32780;&#65292;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#20013;&#30340;&#20132;&#20114;&#26412;&#36136;&#19978;&#26159;&#22797;&#26434;&#30340;&#65292;&#28041;&#21450;&#22797;&#26434;&#30340;&#36807;&#31243;&#21644;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#26412;&#32508;&#36848;&#20174;&#32593;&#32476;&#31185;&#23398;&#30340;&#35270;&#35282;&#20986;&#21457;&#65292;&#26500;&#24819;&#20102;&#19968;&#20010;&#22810;&#23618;&#27425;&#30340;&#20154;&#24037;&#26234;&#33021;&#38598;&#20307;&#26234;&#33021;&#34920;&#31034;&#65292;&#21253;&#25324;&#35748;&#30693;&#23618;&#12289;&#29289;&#29702;&#23618;&#21644;&#20449;&#24687;&#23618;&#12290;&#22312;&#36825;&#20010;&#22810;&#23618;&#32593;&#32476;&#20013;&#65292;&#20154;&#31867;&#21644;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#23637;&#29616;&#20986;&#19981;&#21516;&#30340;&#29305;&#24449;&#65307;&#20154;&#31867;&#22312;&#22810;&#26679;&#24615;&#26041;&#38754;&#20174;&#34920;&#23618;&#21040;&#28145;&#23618;&#23646;&#24615;&#19981;&#21516;&#65292;&#32780;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#22312;&#31243;&#24230;&#19978;&#20063;&#26377;&#25152;&#21306;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10433v1 Announce Type: cross  Abstract: The current societal challenges exceed the capacity of human individual or collective effort alone. As AI evolves, its role within human collectives is poised to vary from an assistive tool to a participatory member. Humans and AI possess complementary capabilities that, when synergized, can achieve a level of collective intelligence that surpasses the collective capabilities of either humans or AI in isolation. However, the interactions in human-AI systems are inherently complex, involving intricate processes and interdependencies. This review incorporates perspectives from network science to conceptualize a multilayer representation of human-AI collective intelligence, comprising a cognition layer, a physical layer, and an information layer. Within this multilayer network, humans and AI agents exhibit varying characteristics; humans differ in diversity from surface-level to deep-level attributes, while AI agents range in degrees of f
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;&#65292;&#37325;&#28857;&#20851;&#27880;&#20102;&#20892;&#19994;&#12289;&#30044;&#29287;&#19994;&#21644;&#28180;&#19994;&#31561;&#39046;&#22495;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;&#20892;&#19994;&#39135;&#21697;&#20998;&#31867;&#12289;&#29983;&#38271;&#30417;&#27979;&#12289;&#20135;&#37327;&#39044;&#27979;&#21644;&#21697;&#36136;&#35780;&#20272;&#31561;&#26041;&#38754;&#34920;&#29616;&#20986;&#24378;&#22823;&#30340;&#33021;&#21147;&#65292;&#21516;&#26102;&#20063;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#20197;&#21450;&#28508;&#22312;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2305.01899</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#38761;&#21629;&#65306;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#30340;&#20840;&#38754;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Revolutionizing Agrifood Systems with Artificial Intelligence: A Survey. (arXiv:2305.01899v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01899
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;&#65292;&#37325;&#28857;&#20851;&#27880;&#20102;&#20892;&#19994;&#12289;&#30044;&#29287;&#19994;&#21644;&#28180;&#19994;&#31561;&#39046;&#22495;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;&#20892;&#19994;&#39135;&#21697;&#20998;&#31867;&#12289;&#29983;&#38271;&#30417;&#27979;&#12289;&#20135;&#37327;&#39044;&#27979;&#21644;&#21697;&#36136;&#35780;&#20272;&#31561;&#26041;&#38754;&#34920;&#29616;&#20986;&#24378;&#22823;&#30340;&#33021;&#21147;&#65292;&#21516;&#26102;&#20063;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#20197;&#21450;&#28508;&#22312;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20840;&#29699;&#20154;&#21475;&#30340;&#36805;&#36895;&#22686;&#38271;&#65292;&#36716;&#21464;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#65292;&#20351;&#20854;&#26356;&#20855;&#29983;&#20135;&#21147;&#12289;&#25928;&#29575;&#12289;&#23433;&#20840;&#21644;&#21487;&#25345;&#32493;&#24615;&#65292;&#26159;&#32531;&#35299;&#28508;&#22312;&#31918;&#39135;&#30701;&#32570;&#30340;&#20851;&#38190;&#12290;&#26368;&#36817;&#65292;&#28145;&#24230;&#23398;&#20064;&#31561;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;&#35821;&#35328;&#12289;&#35270;&#35273;&#12289;&#36965;&#24863;&#21644;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#24212;&#29992;&#31561;&#21508;&#20010;&#39046;&#22495;&#22343;&#26174;&#31034;&#20986;&#20102;&#20854;&#24378;&#22823;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#20154;&#24037;&#26234;&#33021;&#23545;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#30340;&#25972;&#20307;&#24433;&#21709;&#20173;&#19981;&#28165;&#26970;&#12290;&#26412;&#25991;&#20840;&#38754;&#22238;&#39038;&#20102;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22914;&#20309;&#25913;&#21464;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#65292;&#24182;&#20026;&#29616;&#20195;&#20892;&#19994;&#39135;&#21697;&#34892;&#19994;&#20570;&#20986;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24635;&#32467;&#20102;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#20013;&#30340;&#25968;&#25454;&#33719;&#21462;&#26041;&#27861;&#65292;&#21253;&#25324;&#33719;&#21462;&#12289;&#23384;&#20648;&#21644;&#22788;&#29702;&#25216;&#26415;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#35814;&#32454;&#20171;&#32461;&#20102;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;&#20892;&#19994;&#12289;&#30044;&#29287;&#19994;&#21644;&#28180;&#19994;&#31561;&#39046;&#22495;&#20013;&#30340;&#36827;&#23637;&#24773;&#20917;&#65292;&#28085;&#30422;&#20102;&#20892;&#19994;&#39135;&#21697;&#20998;&#31867;&#12289;&#29983;&#38271;&#30417;&#27979;&#12289;&#20135;&#37327;&#39044;&#27979;&#21644;&#21697;&#36136;&#35780;&#20272;&#31561;&#20027;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#65292;&#24182;&#35752;&#35770;&#20102;&#22312;&#20892;&#19994;&#39135;&#21697;&#31995;&#32479;&#24212;&#29992;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#20013;&#28508;&#22312;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the world population rapidly increasing, transforming our agrifood systems to be more productive, efficient, safe, and sustainable is crucial to mitigate potential food shortages. Recently, artificial intelligence (AI) techniques such as deep learning (DL) have demonstrated their strong abilities in various areas, including language, vision, remote sensing (RS), and agrifood systems applications. However, the overall impact of AI on agrifood systems remains unclear. In this paper, we thoroughly review how AI techniques can transform agrifood systems and contribute to the modern agrifood industry. Firstly, we summarize the data acquisition methods in agrifood systems, including acquisition, storage, and processing techniques. Secondly, we present a progress review of AI methods in agrifood systems, specifically in agriculture, animal husbandry, and fishery, covering topics such as agrifood classification, growth monitoring, yield prediction, and quality assessment. Furthermore, we 
&lt;/p&gt;</description></item></channel></rss>