<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;Python&#39033;&#30446;&#30340;&#21160;&#24577;&#20998;&#26512;&#31649;&#36947;&#65292;&#32467;&#21512;&#27169;&#31946;&#27979;&#35797;&#12289;&#35821;&#26009;&#24211;&#26368;&#23567;&#21270;&#12289;&#23849;&#28291;&#20998;&#31867;&#21644;&#35206;&#30422;&#29575;&#25910;&#38598;&#65292;&#20197;&#30830;&#20445;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#30340;&#23433;&#20840;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.12723</link><description>&lt;p&gt;
&#29992;&#20110;&#21487;&#20449;&#36182;&#30340;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#30340;Python&#27169;&#31946;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Python Fuzzing for Trustworthy Machine Learning Frameworks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12723
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;Python&#39033;&#30446;&#30340;&#21160;&#24577;&#20998;&#26512;&#31649;&#36947;&#65292;&#32467;&#21512;&#27169;&#31946;&#27979;&#35797;&#12289;&#35821;&#26009;&#24211;&#26368;&#23567;&#21270;&#12289;&#23849;&#28291;&#20998;&#31867;&#21644;&#35206;&#30422;&#29575;&#25910;&#38598;&#65292;&#20197;&#30830;&#20445;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#30340;&#23433;&#20840;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30830;&#20445;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#30340;&#23433;&#20840;&#24615;&#21644;&#21487;&#38752;&#24615;&#23545;&#20110;&#26500;&#24314;&#21487;&#20449;&#36182;&#30340;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#31995;&#32479;&#33267;&#20851;&#37325;&#35201;&#12290;&#27169;&#31946;&#27979;&#35797;&#26159;&#23433;&#20840;&#36719;&#20214;&#24320;&#21457;&#29983;&#21629;&#21608;&#26399;&#65288;SSDLC&#65289;&#20013;&#19968;&#31181;&#27969;&#34892;&#30340;&#25216;&#26415;&#65292;&#21487;&#29992;&#20110;&#24320;&#21457;&#23433;&#20840;&#21644;&#20581;&#22766;&#30340;&#36719;&#20214;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20351;&#29992;Sydr-Fuzz&#24037;&#20855;&#38598;&#38024;&#23545;Python&#39033;&#30446;&#30340;&#21160;&#24577;&#20998;&#26512;&#31649;&#36947;&#12290;&#25105;&#20204;&#30340;&#31649;&#36947;&#21253;&#25324;&#27169;&#31946;&#27979;&#35797;&#12289;&#35821;&#26009;&#24211;&#26368;&#23567;&#21270;&#12289;&#23849;&#28291;&#20998;&#31867;&#21644;&#35206;&#30422;&#29575;&#25910;&#38598;&#12290;&#23849;&#28291;&#20998;&#31867;&#21644;&#20005;&#37325;&#24615;&#35780;&#20272;&#26159;&#30830;&#20445;&#21450;&#26102;&#35299;&#20915;&#26368;&#20851;&#38190;&#28431;&#27934;&#30340;&#37325;&#35201;&#27493;&#39588;&#12290;&#27492;&#22806;&#65292;&#25152;&#25552;&#20986;&#30340;&#31649;&#36947;&#38598;&#25104;&#22312;GitLab CI&#20013;&#12290;&#20026;&#20102;&#30830;&#23450;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#20013;&#26368;&#26131;&#21463;&#25915;&#20987;&#30340;&#37096;&#20998;&#65292;&#25105;&#20204;&#20998;&#26512;&#23427;&#20204;&#28508;&#22312;&#30340;&#25915;&#20987;&#38754;&#65292;&#24182;&#20026;PyTorch&#12289;TensorFlow&#24320;&#21457;&#27169;&#31946;&#27979;&#35797;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12723v1 Announce Type: cross  Abstract: Ensuring the security and reliability of machine learning frameworks is crucial for building trustworthy AI-based systems. Fuzzing, a popular technique in secure software development lifecycle (SSDLC), can be used to develop secure and robust software. Popular machine learning frameworks such as PyTorch and TensorFlow are complex and written in multiple programming languages including C/C++ and Python. We propose a dynamic analysis pipeline for Python projects using the Sydr-Fuzz toolset. Our pipeline includes fuzzing, corpus minimization, crash triaging, and coverage collection. Crash triaging and severity estimation are important steps to ensure that the most critical vulnerabilities are addressed promptly. Furthermore, the proposed pipeline is integrated in GitLab CI. To identify the most vulnerable parts of the machine learning frameworks, we analyze their potential attack surfaces and develop fuzz targets for PyTorch, TensorFlow, 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#26469;&#24314;&#27169;&#20113;&#31995;&#32479;&#20013;&#30340;&#35775;&#38382;&#25511;&#21046;&#31574;&#30053;&#65292;&#24182;&#24320;&#21457;&#20102;&#22522;&#20110;PDDL&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#26469;&#26816;&#27979;&#21487;&#33021;&#23548;&#33268;&#35832;&#22914;&#21202;&#32034;&#36719;&#20214;&#21644;&#25935;&#24863;&#25968;&#25454;&#22806;&#27844;&#31561;&#24191;&#27867;&#25915;&#20987;&#30340;&#23433;&#20840;&#28431;&#27934;&#12290;</title><link>https://arxiv.org/abs/2402.10985</link><description>&lt;p&gt;
&#21033;&#29992;AI&#35268;&#21010;&#25216;&#26415;&#26816;&#27979;&#20113;&#23433;&#20840;&#28431;&#27934;
&lt;/p&gt;
&lt;p&gt;
Leveraging AI Planning For Detecting Cloud Security Vulnerabilities
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10985
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#26469;&#24314;&#27169;&#20113;&#31995;&#32479;&#20013;&#30340;&#35775;&#38382;&#25511;&#21046;&#31574;&#30053;&#65292;&#24182;&#24320;&#21457;&#20102;&#22522;&#20110;PDDL&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#26469;&#26816;&#27979;&#21487;&#33021;&#23548;&#33268;&#35832;&#22914;&#21202;&#32034;&#36719;&#20214;&#21644;&#25935;&#24863;&#25968;&#25454;&#22806;&#27844;&#31561;&#24191;&#27867;&#25915;&#20987;&#30340;&#23433;&#20840;&#28431;&#27934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20113;&#35745;&#31639;&#26381;&#21153;&#25552;&#20379;&#20102;&#21487;&#25193;&#23637;&#19988;&#20855;&#26377;&#25104;&#26412;&#25928;&#30410;&#30340;&#25968;&#25454;&#23384;&#20648;&#12289;&#22788;&#29702;&#21644;&#21327;&#20316;&#35299;&#20915;&#26041;&#26696;&#12290;&#38543;&#30528;&#23427;&#20204;&#30340;&#26222;&#21450;&#65292;&#19982;&#20854;&#23433;&#20840;&#28431;&#27934;&#30456;&#20851;&#30340;&#25285;&#24551;&#20063;&#22312;&#22686;&#38271;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#25968;&#25454;&#27844;&#38706;&#21644;&#21202;&#32034;&#36719;&#20214;&#31561;&#22797;&#26434;&#25915;&#20987;&#12290;&#20026;&#20102;&#24212;&#23545;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#39318;&#20808;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#34920;&#36798;&#20113;&#31995;&#32479;&#20013;&#19981;&#21516;&#23545;&#35937;&#65288;&#22914;&#29992;&#25143;&#12289;&#25968;&#25454;&#23384;&#20648;&#12289;&#23433;&#20840;&#35282;&#33394;&#65289;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#24314;&#27169;&#20113;&#31995;&#32479;&#20013;&#30340;&#35775;&#38382;&#25511;&#21046;&#31574;&#30053;&#12290;&#35775;&#38382;&#25511;&#21046;&#35823;&#37197;&#32622;&#36890;&#24120;&#26159;&#20113;&#25915;&#20987;&#30340;&#20027;&#35201;&#21407;&#22240;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;PDDL&#27169;&#22411;&#65292;&#29992;&#20110;&#26816;&#27979;&#23433;&#20840;&#28431;&#27934;&#65292;&#20363;&#22914;&#21487;&#33021;&#23548;&#33268;&#24191;&#27867;&#25915;&#20987;&#65288;&#22914;&#21202;&#32034;&#36719;&#20214;&#65289;&#21644;&#25935;&#24863;&#25968;&#25454;&#22806;&#27844;&#31561;&#12290;&#35268;&#21010;&#22120;&#21487;&#20197;&#29983;&#25104;&#25915;&#20987;&#20197;&#35782;&#21035;&#20113;&#20013;&#30340;&#27492;&#31867;&#28431;&#27934;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;14&#20010;&#19981;&#21516;&#21830;&#19994;&#32452;&#32455;&#30340;&#30495;&#23454;&#20122;&#39532;&#36874;AWS&#20113;&#37197;&#32622;&#19978;&#27979;&#35797;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10985v1 Announce Type: cross  Abstract: Cloud computing services provide scalable and cost-effective solutions for data storage, processing, and collaboration. Alongside their growing popularity, concerns related to their security vulnerabilities leading to data breaches and sophisticated attacks such as ransomware are growing. To address these, first, we propose a generic framework to express relations between different cloud objects such as users, datastores, security roles, to model access control policies in cloud systems. Access control misconfigurations are often the primary driver for cloud attacks. Second, we develop a PDDL model for detecting security vulnerabilities which can for example lead to widespread attacks such as ransomware, sensitive data exfiltration among others. A planner can then generate attacks to identify such vulnerabilities in the cloud. Finally, we test our approach on 14 real Amazon AWS cloud configurations of different commercial organizations
&lt;/p&gt;</description></item><item><title>Ensembler&#26159;&#19968;&#20010;&#38450;&#27490;&#27169;&#22411;&#21453;&#28436;&#25915;&#20987;&#30340;&#21487;&#25193;&#23637;&#26694;&#26550;&#65292;&#36890;&#36807;&#21033;&#29992;&#27169;&#22411;&#38598;&#25104;&#21644;&#24341;&#20837;&#25200;&#21160;&#30340;&#26041;&#24335;&#65292;&#22312;&#21327;&#20316;&#25512;&#29702;&#36807;&#31243;&#20013;&#26377;&#25928;&#22320;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;</title><link>http://arxiv.org/abs/2401.10859</link><description>&lt;p&gt;
Ensembler:&#20351;&#29992;&#27169;&#22411;&#38598;&#25104;&#22312;&#21327;&#20316;&#25512;&#29702;&#36807;&#31243;&#20013;&#38450;&#27490;&#27169;&#22411;&#21453;&#28436;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Ensembler: Combating model inversion attacks using model ensemble during collaborative inference. (arXiv:2401.10859v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10859
&lt;/p&gt;
&lt;p&gt;
Ensembler&#26159;&#19968;&#20010;&#38450;&#27490;&#27169;&#22411;&#21453;&#28436;&#25915;&#20987;&#30340;&#21487;&#25193;&#23637;&#26694;&#26550;&#65292;&#36890;&#36807;&#21033;&#29992;&#27169;&#22411;&#38598;&#25104;&#21644;&#24341;&#20837;&#25200;&#21160;&#30340;&#26041;&#24335;&#65292;&#22312;&#21327;&#20316;&#25512;&#29702;&#36807;&#31243;&#20013;&#26377;&#25928;&#22320;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#22312;&#21508;&#20010;&#39046;&#22495;&#23637;&#31034;&#20986;&#20102;&#21331;&#36234;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#24222;&#22823;&#30340;&#27169;&#22411;&#22823;&#23567;&#20419;&#20351;&#36793;&#32536;&#35774;&#22791;&#23558;&#25512;&#29702;&#36807;&#31243;&#30340;&#22823;&#37096;&#20998;&#36716;&#31227;&#21040;&#20113;&#31471;&#12290;&#34429;&#28982;&#36825;&#31181;&#20570;&#27861;&#24102;&#26469;&#20102;&#35768;&#22810;&#20248;&#21183;&#65292;&#20294;&#20063;&#24341;&#21457;&#20102;&#20851;&#20110;&#29992;&#25143;&#25968;&#25454;&#38544;&#31169;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#22312;&#20113;&#26381;&#21153;&#22120;&#30340;&#21487;&#20449;&#24230;&#21463;&#21040;&#36136;&#30097;&#30340;&#24773;&#20917;&#19979;&#65292;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#30340;&#23454;&#29992;&#21644;&#36866;&#24212;&#24615;&#26041;&#27861;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;Ensembler&#65292;&#36825;&#26159;&#19968;&#20010;&#21487;&#25193;&#23637;&#30340;&#26694;&#26550;&#65292;&#26088;&#22312;&#22823;&#22823;&#22686;&#21152;&#23545;&#25239;&#26041;&#36827;&#34892;&#27169;&#22411;&#21453;&#28436;&#25915;&#20987;&#30340;&#38590;&#24230;&#12290;Ensembler&#21033;&#29992;&#22312;&#23545;&#25239;&#26381;&#21153;&#22120;&#19978;&#36816;&#34892;&#30340;&#27169;&#22411;&#32452;&#21512;&#65292;&#19982;&#29616;&#26377;&#30340;&#22312;&#21327;&#20316;&#25512;&#29702;&#36807;&#31243;&#20013;&#24341;&#20837;&#25200;&#21160;&#21040;&#25935;&#24863;&#25968;&#25454;&#30340;&#26041;&#27861;&#24182;&#34892;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#21363;&#20351;&#19982;&#22522;&#26412;&#30340;&#39640;&#26031;&#22122;&#22768;&#30456;&#32467;&#21512;&#65292;Ensembler&#20063;&#21487;&#20197;&#26377;&#25928;&#22320;&#20445;&#25252;&#22270;&#20687;&#20813;&#21463;&#37325;&#24314;&#25915;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep learning models have exhibited remarkable performance across various domains. Nevertheless, the burgeoning model sizes compel edge devices to offload a significant portion of the inference process to the cloud. While this practice offers numerous advantages, it also raises critical concerns regarding user data privacy. In scenarios where the cloud server's trustworthiness is in question, the need for a practical and adaptable method to safeguard data privacy becomes imperative. In this paper, we introduce Ensembler, an extensible framework designed to substantially increase the difficulty of conducting model inversion attacks for adversarial parties. Ensembler leverages model ensembling on the adversarial server, running in parallel with existing approaches that introduce perturbations to sensitive data during colloborative inference. Our experiments demonstrate that when combined with even basic Gaussian noise, Ensembler can effectively shield images from reconstruction attacks, 
&lt;/p&gt;</description></item></channel></rss>