<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#20197;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#20026;&#22522;&#30784;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23454;&#29616;&#25968;&#25454;&#38544;&#31169;&#20445;&#25252;&#30340;&#26041;&#27861;&#12290;&#26041;&#27861;&#23558;&#32508;&#21512;&#22122;&#22768;&#28155;&#21152;&#21040;&#25968;&#25454;&#20013;&#65292;&#20351;&#24471;&#39640;&#26031;&#36807;&#31243;&#39044;&#27979;&#27169;&#22411;&#36798;&#21040;&#29305;&#23450;&#30340;&#38544;&#31169;&#32423;&#21035;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#26680;&#26041;&#27861;&#20171;&#32461;&#20102;&#36830;&#32493;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38544;&#31169;&#24863;&#30693;&#35299;&#24418;&#24335;&#65292;&#20197;&#21450;&#30740;&#31350;&#20102;&#20854;&#29702;&#35770;&#24615;&#36136;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#21355;&#26143;&#36712;&#36857;&#36319;&#36394;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2305.16541</link><description>&lt;p&gt;
&#38754;&#21521;&#38544;&#31169;&#30340;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Privacy-aware Gaussian Process Regression. (arXiv:2305.16541v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.16541
&lt;/p&gt;
&lt;p&gt;
&#20197;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#20026;&#22522;&#30784;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23454;&#29616;&#25968;&#25454;&#38544;&#31169;&#20445;&#25252;&#30340;&#26041;&#27861;&#12290;&#26041;&#27861;&#23558;&#32508;&#21512;&#22122;&#22768;&#28155;&#21152;&#21040;&#25968;&#25454;&#20013;&#65292;&#20351;&#24471;&#39640;&#26031;&#36807;&#31243;&#39044;&#27979;&#27169;&#22411;&#36798;&#21040;&#29305;&#23450;&#30340;&#38544;&#31169;&#32423;&#21035;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#26680;&#26041;&#27861;&#20171;&#32461;&#20102;&#36830;&#32493;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38544;&#31169;&#24863;&#30693;&#35299;&#24418;&#24335;&#65292;&#20197;&#21450;&#30740;&#31350;&#20102;&#20854;&#29702;&#35770;&#24615;&#36136;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#21355;&#26143;&#36712;&#36857;&#36319;&#36394;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22312;&#38544;&#31169;&#32422;&#26463;&#26465;&#20214;&#19979;&#30340;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#30340;&#29702;&#35770;&#21644;&#26041;&#27861;&#26694;&#26550;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#25968;&#25454;&#25152;&#26377;&#32773;&#22240;&#38544;&#31169;&#25285;&#24551;&#32780;&#19981;&#24895;&#19982;&#20844;&#20247;&#20998;&#20139;&#20854;&#20174;&#20854;&#25968;&#25454;&#26500;&#24314;&#30340;&#39640;&#20445;&#30495;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#26102;&#20351;&#29992;&#12290;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#20851;&#38190;&#24605;&#24819;&#26159;&#36890;&#36807;&#28155;&#21152;&#32508;&#21512;&#22122;&#22768;&#26469;&#20351;&#39640;&#26031;&#36807;&#31243;&#39044;&#27979;&#27169;&#22411;&#30340;&#39044;&#27979;&#26041;&#24046;&#36798;&#21040;&#39044;&#20808;&#25351;&#23450;&#30340;&#38544;&#31169;&#32423;&#21035;&#12290;&#21512;&#25104;&#22122;&#22768;&#30340;&#26368;&#20248;&#21327;&#26041;&#24046;&#30697;&#38453;&#20197;&#21322;&#23450;&#32534;&#31243;&#30340;&#24418;&#24335;&#32473;&#20986;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#22522;&#20110;&#26680;&#30340;&#26041;&#27861;&#26469;&#30740;&#31350;&#22312;&#36830;&#32493;&#32422;&#26463;&#38544;&#31169;&#26465;&#20214;&#19979;&#30340;&#38544;&#31169;&#24863;&#30693;&#35299;&#30340;&#24418;&#24335;&#65292;&#24182;&#30740;&#31350;&#20102;&#23427;&#20204;&#30340;&#29702;&#35770;&#23646;&#24615;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20351;&#29992;&#36319;&#36394;&#21355;&#26143;&#36712;&#36857;&#30340;&#27169;&#22411;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose the first theoretical and methodological framework for Gaussian process regression subject to privacy constraints. The proposed method can be used when a data owner is unwilling to share a high-fidelity supervised learning model built from their data with the public due to privacy concerns. The key idea of the proposed method is to add synthetic noise to the data until the predictive variance of the Gaussian process model reaches a prespecified privacy level. The optimal covariance matrix of the synthetic noise is formulated in terms of semi-definite programming. We also introduce the formulation of privacy-aware solutions under continuous privacy constraints using kernel-based approaches, and study their theoretical properties. The proposed method is illustrated by considering a model that tracks the trajectories of satellites.
&lt;/p&gt;</description></item></channel></rss>