<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#36890;&#36807;&#27010;&#29575;&#22635;&#20805;&#25935;&#24863;&#29305;&#24449;&#65292;&#32852;&#21512;&#23398;&#20064;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#27010;&#29575;&#65292;&#22686;&#24378;&#19968;&#33324;&#20844;&#24179;&#39118;&#38505;&#65292;&#23454;&#29616;&#20934;&#30830;&#24615;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#30340;&#25913;&#36827;&#24179;&#34913;</title><link>https://arxiv.org/abs/2402.13393</link><description>&lt;p&gt;
&#38024;&#23545;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#30340;&#20844;&#24179;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Fairness Risks for Group-conditionally Missing Demographics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13393
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27010;&#29575;&#22635;&#20805;&#25935;&#24863;&#29305;&#24449;&#65292;&#32852;&#21512;&#23398;&#20064;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#27010;&#29575;&#65292;&#22686;&#24378;&#19968;&#33324;&#20844;&#24179;&#39118;&#38505;&#65292;&#23454;&#29616;&#20934;&#30830;&#24615;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#30340;&#25913;&#36827;&#24179;&#34913;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#20844;&#24179;&#24847;&#35782;&#30340;&#20998;&#31867;&#27169;&#22411;&#36817;&#24180;&#26469;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#65292;&#22240;&#20026;&#23545;&#26576;&#20123;&#20154;&#21475;&#32479;&#35745;&#32676;&#20307;&#30340;&#27495;&#35270;&#38382;&#39064;&#26085;&#30410;&#24341;&#36215;&#25285;&#24551;&#12290;&#22823;&#22810;&#25968;&#29616;&#26377;&#27169;&#22411;&#35201;&#27714;&#23436;&#20840;&#20102;&#35299;&#25935;&#24863;&#29305;&#24449;&#65292;&#36825;&#21487;&#33021;&#30001;&#20110;&#38544;&#31169;&#12289;&#27861;&#24459;&#38382;&#39064;&#21644;&#20010;&#20154;&#23545;&#27495;&#35270;&#30340;&#24656;&#24807;&#32780;&#19981;&#20999;&#23454;&#38469;&#12290;&#25105;&#20204;&#23558;&#35299;&#20915;&#30340;&#20851;&#38190;&#25361;&#25112;&#26159;&#19981;&#21487;&#29992;&#24615;&#30340;&#32676;&#20307;&#20381;&#36182;&#24615;&#65292;&#20363;&#22914;&#65292;&#26576;&#20123;&#24180;&#40836;&#33539;&#22260;&#30340;&#20154;&#21487;&#33021;&#26356;&#19981;&#24895;&#36879;&#38706;&#20182;&#20204;&#30340;&#24180;&#40836;&#12290;&#25105;&#20204;&#30340;&#35299;&#20915;&#26041;&#26696;&#36890;&#36807;&#23545;&#25935;&#24863;&#29305;&#24449;&#36827;&#34892;&#27010;&#29575;&#22635;&#20805;&#65292;&#21516;&#26102;&#22312;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#20013;&#32852;&#21512;&#23398;&#20064;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#30340;&#27010;&#29575;&#65292;&#23558;&#19968;&#33324;&#20844;&#24179;&#39118;&#38505;&#19982;&#20043;&#22686;&#24378;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22270;&#20687;&#21644;&#34920;&#26684;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20986;&#20102;&#26377;&#25928;&#24615;&#65292;&#23454;&#29616;&#20102;&#20934;&#30830;&#24615;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#30340;&#25913;&#36827;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13393v1 Announce Type: new  Abstract: Fairness-aware classification models have gained increasing attention in recent years as concerns grow on discrimination against some demographic groups. Most existing models require full knowledge of the sensitive features, which can be impractical due to privacy, legal issues, and an individual's fear of discrimination. The key challenge we will address is the group dependency of the unavailability, e.g., people of some age range may be more reluctant to reveal their age. Our solution augments general fairness risks with probabilistic imputations of the sensitive features, while jointly learning the group-conditionally missing probabilities in a variational auto-encoder. Our model is demonstrated effective on both image and tabular datasets, achieving an improved balance between accuracy and fairness.
&lt;/p&gt;</description></item></channel></rss>