<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#20174;&#23545;&#25239;&#24615;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#20998;&#20139;&#25193;&#25955;&#27169;&#22411;&#21487;&#33021;&#23384;&#22312;&#30340;&#38544;&#31169;&#21644;&#20844;&#24179;&#39118;&#38505;&#65292;&#29305;&#21035;&#26159;&#25506;&#35752;&#20102;&#22312;&#19968;&#26041;&#20351;&#29992;&#31169;&#20154;&#25968;&#25454;&#35757;&#32451;&#27169;&#22411;&#21518;&#25552;&#20379;&#32473;&#21478;&#19968;&#26041;&#40657;&#30418;&#35775;&#38382;&#26435;&#38480;&#30340;&#24773;&#20917;&#12290;</title><link>https://arxiv.org/abs/2402.18607</link><description>&lt;p&gt;
&#22312;&#20998;&#20139;&#25193;&#25955;&#27169;&#22411;&#20013;&#25506;&#35752;&#38544;&#31169;&#21644;&#20844;&#24179;&#39118;&#38505;&#65306;&#19968;&#31181;&#23545;&#25239;&#24615;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Exploring Privacy and Fairness Risks in Sharing Diffusion Models: An Adversarial Perspective
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18607
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#23545;&#25239;&#24615;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#20998;&#20139;&#25193;&#25955;&#27169;&#22411;&#21487;&#33021;&#23384;&#22312;&#30340;&#38544;&#31169;&#21644;&#20844;&#24179;&#39118;&#38505;&#65292;&#29305;&#21035;&#26159;&#25506;&#35752;&#20102;&#22312;&#19968;&#26041;&#20351;&#29992;&#31169;&#20154;&#25968;&#25454;&#35757;&#32451;&#27169;&#22411;&#21518;&#25552;&#20379;&#32473;&#21478;&#19968;&#26041;&#40657;&#30418;&#35775;&#38382;&#26435;&#38480;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#36817;&#24180;&#26469;&#22312;&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#24341;&#36215;&#20102;&#24191;&#27867;&#20851;&#27880;&#65292;&#22240;&#20026;&#20854;&#22312;&#37319;&#26679;&#36136;&#37327;&#21644;&#20998;&#24067;&#35206;&#30422;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;&#22240;&#27492;&#65292;&#25552;&#20986;&#20102;&#36328;&#19981;&#21516;&#32452;&#32455;&#20998;&#20139;&#39044;&#35757;&#32451;&#25193;&#25955;&#27169;&#22411;&#30340;&#24314;&#35758;&#65292;&#20197;&#25552;&#39640;&#25968;&#25454;&#21033;&#29992;&#29575;&#21516;&#26102;&#36890;&#36807;&#36991;&#20813;&#30452;&#25509;&#20998;&#20139;&#31169;&#20154;&#25968;&#25454;&#26469;&#22686;&#24378;&#38544;&#31169;&#20445;&#25252;&#12290;&#28982;&#32780;&#65292;&#19982;&#36825;&#31181;&#26041;&#27861;&#30456;&#20851;&#30340;&#28508;&#22312;&#39118;&#38505;&#23578;&#26410;&#24471;&#21040;&#20840;&#38754;&#35843;&#26597;&#12290;&#26412;&#25991;&#20174;&#23545;&#25239;&#24615;&#30340;&#35282;&#24230;&#25506;&#35752;&#20102;&#19982;&#20998;&#20139;&#25193;&#25955;&#27169;&#22411;&#30456;&#20851;&#30340;&#28508;&#22312;&#38544;&#31169;&#21644;&#20844;&#24179;&#39118;&#38505;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#19968;&#26041;&#65288;&#20998;&#20139;&#32773;&#65289;&#20351;&#29992;&#31169;&#20154;&#25968;&#25454;&#35757;&#32451;&#25193;&#25955;&#27169;&#22411;&#24182;&#21521;&#21478;&#19968;&#26041;&#65288;&#25509;&#25910;&#32773;&#65289;&#25552;&#20379;&#39044;&#35757;&#32451;&#27169;&#22411;&#30340;&#40657;&#30418;&#35775;&#38382;&#26435;&#38480;&#29992;&#20110;&#19979;&#28216;&#20219;&#21153;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20998;&#20139;&#32773;&#21487;&#20197;&#23454;&#34892;&#30340;&#34892;&#21160;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18607v1 Announce Type: cross  Abstract: Diffusion models have recently gained significant attention in both academia and industry due to their impressive generative performance in terms of both sampling quality and distribution coverage. Accordingly, proposals are made for sharing pre-trained diffusion models across different organizations, as a way of improving data utilization while enhancing privacy protection by avoiding sharing private data directly. However, the potential risks associated with such an approach have not been comprehensively examined.   In this paper, we take an adversarial perspective to investigate the potential privacy and fairness risks associated with the sharing of diffusion models. Specifically, we investigate the circumstances in which one party (the sharer) trains a diffusion model using private data and provides another party (the receiver) black-box access to the pre-trained model for downstream tasks. We demonstrate that the sharer can execut
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#24046;&#20998;&#38544;&#31169;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#65288;DP-SGD&#65289;&#20013;&#30340;&#24635;&#26799;&#24230;&#26041;&#24046;&#65292;&#25105;&#20204;&#21457;&#29616;&#22823;&#25209;&#27425;&#22823;&#23567;&#26377;&#21161;&#20110;&#20943;&#23567;&#21063;&#37319;&#27171;&#24341;&#36215;&#30340;&#26041;&#24046;&#65292;&#20174;&#32780;&#25552;&#39640;&#20248;&#21270;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.03990</link><description>&lt;p&gt;
&#21063;&#37319;&#27171;&#24182;&#19981;&#26159;&#39764;&#27861;: &#22823;&#25209;&#37327;&#22823;&#23567;&#28858;&#20160;&#40636;&#36969;&#29992;&#26044;&#24046;&#20998;&#38577;&#31169;&#38568;&#27231;&#20778;&#21270;
&lt;/p&gt;
&lt;p&gt;
Subsampling is not Magic: Why Large Batch Sizes Work for Differentially Private Stochastic Optimisation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03990
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#24046;&#20998;&#38544;&#31169;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#65288;DP-SGD&#65289;&#20013;&#30340;&#24635;&#26799;&#24230;&#26041;&#24046;&#65292;&#25105;&#20204;&#21457;&#29616;&#22823;&#25209;&#27425;&#22823;&#23567;&#26377;&#21161;&#20110;&#20943;&#23567;&#21063;&#37319;&#27171;&#24341;&#36215;&#30340;&#26041;&#24046;&#65292;&#20174;&#32780;&#25552;&#39640;&#20248;&#21270;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20497;&#30740;&#31350;&#20102;&#25209;&#27425;&#22823;&#23567;&#23565;&#24046;&#20998;&#38577;&#31169;&#38568;&#27231;&#26799;&#24230;&#19979;&#38477;&#65288;DP-SGD&#65289;&#20013;&#32317;&#26799;&#24230;&#26041;&#24046;&#30340;&#24433;&#38911;&#65292;&#23563;&#27714;&#23565;&#22823;&#25209;&#27425;&#22823;&#23567;&#26377;&#29992;&#24615;&#30340;&#29702;&#35542;&#35299;&#37323;&#12290;&#30001;&#26044;DP-SGD&#26159;&#29694;&#20195;&#24046;&#20998;&#38577;&#31169;&#28145;&#24230;&#23416;&#32722;&#30340;&#22522;&#30990;&#65292;&#20854;&#24615;&#36074;&#24050;&#34987;&#24291;&#27867;&#30740;&#31350;&#65292;&#26368;&#36817;&#30340;&#24037;&#20316;&#22312;&#23526;&#36368;&#20013;&#30332;&#29694;&#22823;&#25209;&#27425;&#22823;&#23567;&#26377;&#30410;&#12290;&#28982;&#32780;&#65292;&#23565;&#26044;&#36889;&#31278;&#22909;&#34389;&#30340;&#29702;&#35542;&#35299;&#37323;&#30446;&#21069;&#26368;&#22810;&#21482;&#33021;&#35498;&#26159;&#21855;&#30332;&#24335;&#30340;&#12290;&#25105;&#20497;&#39318;&#20808;&#35264;&#23519;&#21040;&#65292;&#22312;DP-SGD&#20013;&#65292;&#32317;&#26799;&#24230;&#26041;&#24046;&#21487;&#20197;&#20998;&#35299;&#28858;&#30001;&#21063;&#37319;&#27171;&#21644;&#22122;&#32882;&#24341;&#36215;&#30340;&#26041;&#24046;&#12290;&#28982;&#24460;&#65292;&#25105;&#20497;&#35657;&#26126;&#22312;&#28961;&#38480;&#27425;&#36845;&#20195;&#30340;&#26997;&#38480;&#24773;&#27841;&#19979;&#65292;&#26377;&#25928;&#30340;&#22122;&#32882;&#24341;&#36215;&#30340;&#26041;&#24046;&#23565;&#25209;&#27425;&#22823;&#23567;&#26159;&#19981;&#35722;&#30340;&#12290;&#21097;&#19979;&#30340;&#21063;&#37319;&#27171;&#24341;&#36215;&#30340;&#26041;&#24046;&#38568;&#33879;&#25209;&#27425;&#22823;&#23567;&#30340;&#22686;&#22823;&#32780;&#28187;&#23567;&#65292;&#22240;&#27492;&#22823;&#25209;&#27425;&#22823;&#23567;&#28187;&#23567;&#20102;&#26377;&#25928;&#30340;&#32317;&#26799;&#24230;&#26041;&#24046;&#12290;&#25105;&#20497;&#22312;&#25976;&#20540;&#19978;&#30906;&#35469;&#36889;&#31278;&#28472;&#36914;&#30340;&#24773;&#27841;&#22312;&#23526;&#38555;&#29872;&#22659;&#20013;&#26159;&#30456;&#38364;&#30340;&#65292;&#30070;&#25209;&#27425;&#22823;&#23567;&#19981;&#23567;&#30340;&#26178;&#20505;&#26371;&#36215;&#20316;&#29992;&#65292;&#20006;&#19988;&#30332;&#29694;
&lt;/p&gt;
&lt;p&gt;
We study the effect of the batch size to the total gradient variance in differentially private stochastic gradient descent (DP-SGD), seeking a theoretical explanation for the usefulness of large batch sizes. As DP-SGD is the basis of modern DP deep learning, its properties have been widely studied, and recent works have empirically found large batch sizes to be beneficial. However, theoretical explanations of this benefit are currently heuristic at best. We first observe that the total gradient variance in DP-SGD can be decomposed into subsampling-induced and noise-induced variances. We then prove that in the limit of an infinite number of iterations, the effective noise-induced variance is invariant to the batch size. The remaining subsampling-induced variance decreases with larger batch sizes, so large batches reduce the effective total gradient variance. We confirm numerically that the asymptotic regime is relevant in practical settings when the batch size is not small, and find tha
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;Magmaw&#65292;&#36825;&#26159;&#19968;&#31181;&#38024;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#36827;&#34892;&#27169;&#24577;&#19981;&#21487;&#30693;&#23545;&#25239;&#25915;&#20987;&#30340;&#40657;&#30418;&#25915;&#20987;&#26041;&#27861;&#12290;&#23427;&#33021;&#22815;&#29983;&#25104;&#36890;&#29992;&#30340;&#23545;&#25239;&#25200;&#21160;&#65292;&#24182;&#24341;&#20837;&#20102;&#26032;&#30340;&#25915;&#20987;&#30446;&#26631;&#12290;&#23454;&#39564;&#35777;&#23454;&#20102;&#20854;&#23545;&#29616;&#26377;&#38450;&#24481;&#26041;&#27861;&#30340;&#38887;&#24615;&#12290;&#20351;&#29992;&#23454;&#26102;&#26080;&#32447;&#25915;&#20987;&#24179;&#21488;&#36827;&#34892;&#20102;&#27010;&#24565;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2311.00207</link><description>&lt;p&gt;
Magmaw: &#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#30340;&#27169;&#24577;&#19981;&#21487;&#30693;&#23545;&#25239;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Magmaw: Modality-Agnostic Adversarial Attacks on Machine Learning-Based Wireless Communication Systems. (arXiv:2311.00207v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00207
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;Magmaw&#65292;&#36825;&#26159;&#19968;&#31181;&#38024;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#36827;&#34892;&#27169;&#24577;&#19981;&#21487;&#30693;&#23545;&#25239;&#25915;&#20987;&#30340;&#40657;&#30418;&#25915;&#20987;&#26041;&#27861;&#12290;&#23427;&#33021;&#22815;&#29983;&#25104;&#36890;&#29992;&#30340;&#23545;&#25239;&#25200;&#21160;&#65292;&#24182;&#24341;&#20837;&#20102;&#26032;&#30340;&#25915;&#20987;&#30446;&#26631;&#12290;&#23454;&#39564;&#35777;&#23454;&#20102;&#20854;&#23545;&#29616;&#26377;&#38450;&#24481;&#26041;&#27861;&#30340;&#38887;&#24615;&#12290;&#20351;&#29992;&#23454;&#26102;&#26080;&#32447;&#25915;&#20987;&#24179;&#21488;&#36827;&#34892;&#20102;&#27010;&#24565;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#21512;&#24182;&#31471;&#21040;&#31471;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#30340;&#25152;&#26377;&#29289;&#29702;&#23618;&#27169;&#22359;&#20197;&#23454;&#29616;&#32852;&#21512;&#25910;&#21457;&#22120;&#20248;&#21270;&#26041;&#38754;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;&#23613;&#31649;&#24050;&#32463;&#26377;&#35768;&#22810;&#38024;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#31995;&#32479;&#30340;&#23545;&#25239;&#25915;&#20987;&#26041;&#27861;&#65292;&#20294;&#29616;&#26377;&#26041;&#27861;&#24182;&#26410;&#25552;&#20379;&#21253;&#25324;&#28304;&#25968;&#25454;&#30340;&#22810;&#27169;&#24577;&#12289;&#20849;&#21516;&#30340;&#29289;&#29702;&#23618;&#32452;&#20214;&#21644;&#26080;&#32447;&#39046;&#22495;&#32422;&#26463;&#22312;&#20869;&#30340;&#20840;&#38754;&#35270;&#35282;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;Magmaw&#65292;&#36825;&#26159;&#19968;&#31181;&#33021;&#22815;&#38024;&#23545;&#36890;&#36807;&#26080;&#32447;&#20449;&#36947;&#20256;&#36755;&#30340;&#20219;&#20309;&#22810;&#27169;&#24577;&#20449;&#21495;&#29983;&#25104;&#36890;&#29992;&#23545;&#25239;&#25200;&#21160;&#30340;&#40657;&#30418;&#25915;&#20987;&#26041;&#27861;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#19979;&#28216;&#24212;&#29992;&#30340;&#23545;&#25239;&#25915;&#20987;&#24341;&#20837;&#20102;&#26032;&#30340;&#30446;&#26631;&#12290;&#23454;&#39564;&#35777;&#23454;&#20102;&#35813;&#25915;&#20987;&#23545;&#29616;&#26377;&#24191;&#27867;&#20351;&#29992;&#30340;&#23545;&#25239;&#35757;&#32451;&#21644;&#25200;&#21160;&#20449;&#21495;&#20943;&#27861;&#38450;&#24481;&#26041;&#27861;&#30340;&#38887;&#24615;&#12290;&#20026;&#20102;&#27010;&#24565;&#35777;&#26126;&#65292;&#25105;&#20204;&#20351;&#29992;&#36719;&#20214;&#23450;&#20041;&#26080;&#32447;&#30005;&#31995;&#32479;&#26500;&#24314;&#20102;&#19968;&#20010;&#23454;&#26102;&#26080;&#32447;&#25915;&#20987;&#24179;&#21488;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine Learning (ML) has been instrumental in enabling joint transceiver optimization by merging all physical layer blocks of the end-to-end wireless communication systems. Although there have been a number of adversarial attacks on ML-based wireless systems, the existing methods do not provide a comprehensive view including multi-modality of the source data, common physical layer components, and wireless domain constraints. This paper proposes Magmaw, the first black-box attack methodology capable of generating universal adversarial perturbations for any multimodal signal transmitted over a wireless channel. We further introduce new objectives for adversarial attacks on ML-based downstream applications. The resilience of the attack to the existing widely used defense methods of adversarial training and perturbation signal subtraction is experimentally verified. For proof-of-concept evaluation, we build a real-time wireless attack platform using a software-defined radio system. Experi
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#35774;&#35745;&#19968;&#27454;&#25915;&#38450;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20351;&#29992;&#24207;&#21015;&#37329;&#34701;&#25968;&#25454;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#23545;&#25239;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#29616;&#29366;&#21644;&#21160;&#24577;&#65292;&#24182;&#19988;&#36890;&#36807;&#20998;&#26512;&#27604;&#36187;&#21160;&#24577;&#65292;&#22238;&#31572;&#20102;&#38544;&#34255;&#27169;&#22411;&#20813;&#21463;&#24694;&#24847;&#29992;&#25143;&#25915;&#20987;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#33021;&#30772;&#35299;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.11406</link><description>&lt;p&gt;
&#35774;&#35745;&#19968;&#27454;&#25915;&#38450;&#28216;&#25103;&#65306;&#36890;&#36807;&#31454;&#20105;&#26469;&#22686;&#21152;&#37329;&#34701;&#20132;&#26131;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Designing an attack-defense game: how to increase robustness of financial transaction models via a competition. (arXiv:2308.11406v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11406
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35774;&#35745;&#19968;&#27454;&#25915;&#38450;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20351;&#29992;&#24207;&#21015;&#37329;&#34701;&#25968;&#25454;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#23545;&#25239;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#29616;&#29366;&#21644;&#21160;&#24577;&#65292;&#24182;&#19988;&#36890;&#36807;&#20998;&#26512;&#27604;&#36187;&#21160;&#24577;&#65292;&#22238;&#31572;&#20102;&#38544;&#34255;&#27169;&#22411;&#20813;&#21463;&#24694;&#24847;&#29992;&#25143;&#25915;&#20987;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#33021;&#30772;&#35299;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#37329;&#34701;&#39046;&#22495;&#24694;&#24847;&#25915;&#20987;&#39118;&#38505;&#19981;&#26029;&#21319;&#32423;&#21644;&#30001;&#27492;&#24341;&#21457;&#30340;&#20005;&#37325;&#25439;&#23475;&#65292;&#23545;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#23545;&#25239;&#31574;&#30053;&#21644;&#40065;&#26834;&#30340;&#38450;&#24481;&#26426;&#21046;&#26377;&#28145;&#20837;&#30340;&#29702;&#35299;&#33267;&#20851;&#37325;&#35201;&#12290;&#38543;&#30528;&#38134;&#34892;&#26085;&#30410;&#24191;&#27867;&#37319;&#29992;&#26356;&#31934;&#30830;&#20294;&#28508;&#22312;&#33030;&#24369;&#30340;&#31070;&#32463;&#32593;&#32476;&#65292;&#36825;&#19968;&#23041;&#32961;&#21464;&#24471;&#26356;&#21152;&#20005;&#37325;&#12290;&#25105;&#20204;&#26088;&#22312;&#35843;&#26597;&#20351;&#29992;&#24207;&#21015;&#37329;&#34701;&#25968;&#25454;&#20316;&#20026;&#36755;&#20837;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#23545;&#25239;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#24403;&#21069;&#29366;&#24577;&#21644;&#21160;&#24577;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#27604;&#36187;&#65292;&#20801;&#35768;&#23545;&#29616;&#20195;&#37329;&#34701;&#20132;&#26131;&#25968;&#25454;&#20013;&#30340;&#38382;&#39064;&#36827;&#34892;&#36924;&#30495;&#32780;&#35814;&#32454;&#30340;&#30740;&#31350;&#12290;&#21442;&#19982;&#32773;&#30452;&#25509;&#31454;&#20105;&#65292;&#22240;&#27492;&#21487;&#33021;&#30340;&#25915;&#20987;&#21644;&#38450;&#24481;&#22312;&#25509;&#36817;&#30495;&#23454;&#26465;&#20214;&#19979;&#36827;&#34892;&#20102;&#26816;&#39564;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#20998;&#26512;&#27604;&#36187;&#21160;&#24577;&#65292;&#22238;&#31572;&#20102;&#38544;&#34255;&#27169;&#22411;&#20813;&#21463;&#24694;&#24847;&#29992;&#25143;&#25915;&#20987;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#33021;&#30772;&#35299;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given the escalating risks of malicious attacks in the finance sector and the consequential severe damage, a thorough understanding of adversarial strategies and robust defense mechanisms for machine learning models is critical. The threat becomes even more severe with the increased adoption in banks more accurate, but potentially fragile neural networks. We aim to investigate the current state and dynamics of adversarial attacks and defenses for neural network models that use sequential financial data as the input.  To achieve this goal, we have designed a competition that allows realistic and detailed investigation of problems in modern financial transaction data. The participants compete directly against each other, so possible attacks and defenses are examined in close-to-real-life conditions. Our main contributions are the analysis of the competition dynamics that answers the questions on how important it is to conceal a model from malicious users, how long does it take to break i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20197;Booking.com&#20026;&#22522;&#30784;&#65292;&#20197;&#21487;&#35270;&#21270;&#20010;&#20154;&#25968;&#25454;&#27969;&#20026;&#30740;&#31350;&#65292;&#23637;&#31034;&#20844;&#21496;&#22914;&#20309;&#20998;&#20139;&#28040;&#36153;&#32773;&#20010;&#20154;&#25968;&#25454;&#65292;&#24182;&#35752;&#35770;&#20351;&#29992;&#38544;&#31169;&#25919;&#31574;&#21578;&#30693;&#23458;&#25143;&#20010;&#20154;&#25968;&#25454;&#27969;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;&#26412;&#26696;&#20363;&#30740;&#31350;&#20026;&#26410;&#26469;&#26356;&#20197;&#25968;&#25454;&#27969;&#20026;&#23548;&#21521;&#30340;&#38544;&#31169;&#25919;&#31574;&#20998;&#26512;&#21644;&#24314;&#31435;&#26356;&#20840;&#38754;&#30340;&#20010;&#20154;&#25968;&#25454;&#27969;&#26412;&#20307;&#35770;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;</title><link>http://arxiv.org/abs/2304.09603</link><description>&lt;p&gt;
&#21487;&#35270;&#21270;&#20010;&#20154;&#25968;&#25454;&#27969;&#65306;&#20197;Booking.com&#20026;&#20363;&#30340;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Visualising Personal Data Flows: Insights from a Case Study of Booking.com. (arXiv:2304.09603v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09603
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20197;Booking.com&#20026;&#22522;&#30784;&#65292;&#20197;&#21487;&#35270;&#21270;&#20010;&#20154;&#25968;&#25454;&#27969;&#20026;&#30740;&#31350;&#65292;&#23637;&#31034;&#20844;&#21496;&#22914;&#20309;&#20998;&#20139;&#28040;&#36153;&#32773;&#20010;&#20154;&#25968;&#25454;&#65292;&#24182;&#35752;&#35770;&#20351;&#29992;&#38544;&#31169;&#25919;&#31574;&#21578;&#30693;&#23458;&#25143;&#20010;&#20154;&#25968;&#25454;&#27969;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#12290;&#26412;&#26696;&#20363;&#30740;&#31350;&#20026;&#26410;&#26469;&#26356;&#20197;&#25968;&#25454;&#27969;&#20026;&#23548;&#21521;&#30340;&#38544;&#31169;&#25919;&#31574;&#20998;&#26512;&#21644;&#24314;&#31435;&#26356;&#20840;&#38754;&#30340;&#20010;&#20154;&#25968;&#25454;&#27969;&#26412;&#20307;&#35770;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21830;&#19994;&#26426;&#26500;&#25345;&#26377;&#21644;&#22788;&#29702;&#30340;&#20010;&#20154;&#25968;&#25454;&#37327;&#36234;&#26469;&#36234;&#22810;&#12290;&#25919;&#31574;&#21644;&#27861;&#24459;&#19981;&#26029;&#21464;&#21270;&#65292;&#35201;&#27714;&#36825;&#20123;&#20844;&#21496;&#22312;&#25910;&#38598;&#12289;&#23384;&#20648;&#12289;&#22788;&#29702;&#21644;&#20849;&#20139;&#36825;&#20123;&#25968;&#25454;&#26041;&#38754;&#26356;&#21152;&#36879;&#26126;&#12290;&#26412;&#25991;&#25253;&#21578;&#20102;&#25105;&#20204;&#20197;Booking.com&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#20174;&#20182;&#20204;&#30340;&#38544;&#31169;&#25919;&#31574;&#20013;&#25552;&#21462;&#20010;&#20154;&#25968;&#25454;&#27969;&#30340;&#21487;&#35270;&#21270;&#24037;&#20316;&#12290;&#36890;&#36807;&#23637;&#31034;&#35813;&#20844;&#21496;&#22914;&#20309;&#20998;&#20139;&#20854;&#28040;&#36153;&#32773;&#30340;&#20010;&#20154;&#25968;&#25454;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#38382;&#39064;&#65292;&#24182;&#25193;&#23637;&#20102;&#26377;&#20851;&#20351;&#29992;&#38544;&#31169;&#25919;&#31574;&#21578;&#30693;&#23458;&#25143;&#20010;&#20154;&#25968;&#25454;&#27969;&#33539;&#22260;&#30340;&#25361;&#25112;&#21644;&#38480;&#21046;&#30340;&#35752;&#35770;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#26412;&#26696;&#20363;&#30740;&#31350;&#21487;&#20197;&#20026;&#26410;&#26469;&#26356;&#20197;&#25968;&#25454;&#27969;&#20026;&#23548;&#21521;&#30340;&#38544;&#31169;&#25919;&#31574;&#20998;&#26512;&#21644;&#22312;&#22797;&#26434;&#21830;&#19994;&#29983;&#24577;&#31995;&#32479;&#20013;&#24314;&#31435;&#26356;&#20840;&#38754;&#30340;&#20010;&#20154;&#25968;&#25454;&#27969;&#26412;&#20307;&#35770;&#30340;&#30740;&#31350;&#25552;&#20379;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;
Commercial organisations are holding and processing an ever-increasing amount of personal data. Policies and laws are continually changing to require these companies to be more transparent regarding collection, storage, processing and sharing of this data. This paper reports our work of taking Booking.com as a case study to visualise personal data flows extracted from their privacy policy. By showcasing how the company shares its consumers' personal data, we raise questions and extend discussions on the challenges and limitations of using privacy policy to inform customers the true scale and landscape of personal data flows. More importantly, this case study can inform us about future research on more data flow-oriented privacy policy analysis and on the construction of a more comprehensive ontology on personal data flows in complicated business ecosystems.
&lt;/p&gt;</description></item></channel></rss>