<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#36890;&#36807;&#23558;&#36125;&#21494;&#26031;&#20844;&#24335;&#24212;&#29992;&#20110;&#27169;&#22411;&#21442;&#25968;&#21644;&#27169;&#22411;&#36755;&#20837;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25913;&#36827;&#23545;&#25239;&#24615;&#26679;&#26412;&#21487;&#36801;&#31227;&#24615;&#30340;&#26041;&#27861;&#65292;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#20855;&#26377;&#26174;&#33879;&#25552;&#39640;&#25928;&#26524;&#65292;&#24182;&#36229;&#36807;&#20102;&#24403;&#21069;&#26368;&#26032;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2307.11334</link><description>&lt;p&gt;
&#36890;&#36807;&#36125;&#21494;&#26031;&#25915;&#20987;&#25552;&#39640;&#23545;&#25239;&#24615;&#26679;&#26412;&#30340;&#21487;&#36801;&#31227;&#24615;
&lt;/p&gt;
&lt;p&gt;
Improving Transferability of Adversarial Examples via Bayesian Attacks. (arXiv:2307.11334v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11334
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23558;&#36125;&#21494;&#26031;&#20844;&#24335;&#24212;&#29992;&#20110;&#27169;&#22411;&#21442;&#25968;&#21644;&#27169;&#22411;&#36755;&#20837;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25913;&#36827;&#23545;&#25239;&#24615;&#26679;&#26412;&#21487;&#36801;&#31227;&#24615;&#30340;&#26041;&#27861;&#65292;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#20855;&#26377;&#26174;&#33879;&#25552;&#39640;&#25928;&#26524;&#65292;&#24182;&#36229;&#36807;&#20102;&#24403;&#21069;&#26368;&#26032;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#23545;&#25105;&#20204;&#22312;ICLR&#19978;&#21457;&#34920;&#24037;&#20316;&#30340;&#37325;&#35201;&#25193;&#23637;&#12290;&#25105;&#20204;&#30340;ICLR&#24037;&#20316;&#25552;&#20986;&#20102;&#23558;&#36125;&#21494;&#26031;&#20844;&#24335;&#24212;&#29992;&#20110;&#27169;&#22411;&#21442;&#25968;&#65292;&#20197;&#25552;&#39640;&#23545;&#25239;&#24615;&#26679;&#26412;&#30340;&#21487;&#36801;&#31227;&#24615;&#65292;&#20174;&#32780;&#26377;&#25928;&#27169;&#25311;&#20102;&#26080;&#38480;&#22810;&#20010;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#38598;&#21512;&#12290;&#32780;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#36125;&#21494;&#26031;&#20844;&#24335;&#24212;&#29992;&#20110;&#27169;&#22411;&#36755;&#20837;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#25193;&#23637;&#65292;&#20351;&#24471;&#27169;&#22411;&#36755;&#20837;&#21644;&#27169;&#22411;&#21442;&#25968;&#37117;&#33021;&#22815;&#36827;&#34892;&#32852;&#21512;&#22810;&#26679;&#21270;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#30740;&#31350;&#35777;&#26126;&#65306;1&#65289;&#23545;&#27169;&#22411;&#36755;&#20837;&#21644;&#27169;&#22411;&#21442;&#25968;&#21516;&#26102;&#24212;&#29992;&#36125;&#21494;&#26031;&#20844;&#24335;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#21487;&#36801;&#31227;&#24615;&#65307;2&#65289;&#36890;&#36807;&#24341;&#20837;&#23545;&#27169;&#22411;&#36755;&#20837;&#21518;&#39564;&#20998;&#24067;&#30340;&#39640;&#32423;&#36817;&#20284;&#65292;&#25915;&#20987;&#26080;&#38656;&#27169;&#22411;&#24494;&#35843;&#26102;&#65292;&#23545;&#25239;&#24615;&#21487;&#36801;&#31227;&#24615;&#24471;&#21040;&#36827;&#19968;&#27493;&#25552;&#21319;&#65292;&#36229;&#36807;&#20102;&#25152;&#26377;&#30340;&#26368;&#26032;&#25216;&#26415;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#21407;&#21017;&#30340;&#26041;&#27861;&#26469;&#23545;&#27169;&#22411;&#21442;&#25968;&#36827;&#34892;&#24494;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a substantial extension of our work published at ICLR. Our ICLR work advocated for enhancing transferability in adversarial examples by incorporating a Bayesian formulation into model parameters, which effectively emulates the ensemble of infinitely many deep neural networks, while, in this paper, we introduce a novel extension by incorporating the Bayesian formulation into the model input as well, enabling the joint diversification of both the model input and model parameters. Our empirical findings demonstrate that: 1) the combination of Bayesian formulations for both the model input and model parameters yields significant improvements in transferability; 2) by introducing advanced approximations of the posterior distribution over the model input, adversarial transferability achieves further enhancement, surpassing all state-of-the-arts when attacking without model fine-tuning. Moreover, we propose a principled approach to fine-tune model parameters in such an ext
&lt;/p&gt;</description></item></channel></rss>