<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;FinBen&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#19987;&#38376;&#35774;&#35745;&#29992;&#20110;&#24443;&#24213;&#35780;&#20272;LLMs&#22312;&#37329;&#34701;&#39046;&#22495;&#33021;&#21147;&#30340;&#20840;&#38754;&#24320;&#28304;&#35780;&#20272;&#22522;&#20934;&#65292;&#23545;15&#20010;&#20195;&#34920;&#24615;LLMs&#36827;&#34892;&#35780;&#20272;&#65292;&#25581;&#31034;&#20102;&#23427;&#20204;&#30340;&#20248;&#21183;&#21644;&#23616;&#38480;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.12659</link><description>&lt;p&gt;
FinBen&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20840;&#38754;&#36130;&#21153;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
The FinBen: An Holistic Financial Benchmark for Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12659
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;FinBen&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#19987;&#38376;&#35774;&#35745;&#29992;&#20110;&#24443;&#24213;&#35780;&#20272;LLMs&#22312;&#37329;&#34701;&#39046;&#22495;&#33021;&#21147;&#30340;&#20840;&#38754;&#24320;&#28304;&#35780;&#20272;&#22522;&#20934;&#65292;&#23545;15&#20010;&#20195;&#34920;&#24615;LLMs&#36827;&#34892;&#35780;&#20272;&#65292;&#25581;&#31034;&#20102;&#23427;&#20204;&#30340;&#20248;&#21183;&#21644;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
LLMs&#24050;&#32463;&#25913;&#21464;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65292;&#24182;&#26174;&#31034;&#20986;&#22312;&#21508;&#20010;&#39046;&#22495;&#20855;&#26377;&#28508;&#21147;&#65292;&#20294;&#30001;&#20110;&#32570;&#20047;&#24443;&#24213;&#30340;&#35780;&#20272;&#21644;&#37329;&#34701;&#20219;&#21153;&#30340;&#22797;&#26434;&#24615;&#65292;&#23427;&#20204;&#22312;&#37329;&#34701;&#39046;&#22495;&#30340;&#28508;&#21147;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#24320;&#21457;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;FinBen&#65292;&#31532;&#19968;&#20010;&#20840;&#38754;&#30340;&#24320;&#28304;&#35780;&#20272;&#22522;&#20934;&#65292;&#19987;&#38376;&#35774;&#35745;&#29992;&#20110;&#24443;&#24213;&#35780;&#20272;LLMs&#22312;&#37329;&#34701;&#39046;&#22495;&#30340;&#33021;&#21147;&#12290;FinBen&#21253;&#25324;23&#31181;&#37329;&#34701;&#20219;&#21153;&#30340;35&#20010;&#25968;&#25454;&#38598;&#65292;&#36825;&#20123;&#20219;&#21153;&#26681;&#25454;&#21345;&#29305;&#23572;-&#38669;&#24681;-&#21345;&#32599;&#23572;&#29702;&#35770;&#30340;&#28789;&#24863;&#32452;&#32455;&#25104;&#19977;&#20010;&#19981;&#21516;&#38590;&#24230;&#30340;&#35889;&#65292;&#20197;&#35780;&#20272;LLMs&#22312;&#24402;&#32435;&#25512;&#29702;&#12289;&#32852;&#24819;&#35760;&#24518;&#12289;&#25968;&#37327;&#25512;&#29702;&#12289;&#26230;&#20307;&#26234;&#21147;&#31561;&#26041;&#38754;&#30340;&#35748;&#30693;&#33021;&#21147;&#12290;&#25105;&#20204;&#23545;15&#20010;&#20195;&#34920;&#24615;LLMs&#65288;&#21253;&#25324;GPT-4&#12289;ChatGPT&#21644;&#26368;&#26032;&#30340;Gemini&#65289;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#25581;&#31034;&#20102;&#23427;&#20204;&#30340;&#20248;&#21183;&#21644;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12659v1 Announce Type: cross  Abstract: LLMs have transformed NLP and shown promise in various fields, yet their potential in finance is underexplored due to a lack of thorough evaluations and the complexity of financial tasks. This along with the rapid development of LLMs, highlights the urgent need for a systematic financial evaluation benchmark for LLMs. In this paper, we introduce FinBen, the first comprehensive open-sourced evaluation benchmark, specifically designed to thoroughly assess the capabilities of LLMs in the financial domain. FinBen encompasses 35 datasets across 23 financial tasks, organized into three spectrums of difficulty inspired by the Cattell-Horn-Carroll theory, to evaluate LLMs' cognitive abilities in inductive reasoning, associative memory, quantitative reasoning, crystallized intelligence, and more. Our evaluation of 15 representative LLMs, including GPT-4, ChatGPT, and the latest Gemini, reveals insights into their strengths and limitations withi
&lt;/p&gt;</description></item></channel></rss>