<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#38381;&#29615;&#26080;&#30417;&#30563;&#34920;&#31034;&#35299;&#32544;&#26041;&#27861;CL-Dis&#65292;&#20351;&#29992;&#25193;&#25955;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;Diff-AE&#65289;&#21644;&#946;-VAE&#20849;&#21516;&#25552;&#21462;&#35821;&#20041;&#35299;&#32544;&#34920;&#31034;&#65292;&#20197;&#35299;&#20915;&#34920;&#31034;&#35299;&#32544;&#38754;&#20020;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.02346</link><description>&lt;p&gt;
&#38381;&#29615;&#26080;&#30417;&#30563;&#34920;&#31034;&#35299;&#32544;&#30340;&#946;-VAE&#33976;&#39311;&#19982;&#25193;&#25955;&#27010;&#29575;&#21453;&#39304;
&lt;/p&gt;
&lt;p&gt;
Closed-Loop Unsupervised Representation Disentanglement with $\beta$-VAE Distillation and Diffusion Probabilistic Feedback
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02346
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38381;&#29615;&#26080;&#30417;&#30563;&#34920;&#31034;&#35299;&#32544;&#26041;&#27861;CL-Dis&#65292;&#20351;&#29992;&#25193;&#25955;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;Diff-AE&#65289;&#21644;&#946;-VAE&#20849;&#21516;&#25552;&#21462;&#35821;&#20041;&#35299;&#32544;&#34920;&#31034;&#65292;&#20197;&#35299;&#20915;&#34920;&#31034;&#35299;&#32544;&#38754;&#20020;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34920;&#31034;&#35299;&#32544;&#21487;&#33021;&#26377;&#21161;&#20110;AI&#26681;&#26412;&#19978;&#29702;&#35299;&#29616;&#23454;&#19990;&#30028;&#65292;&#20174;&#32780;&#20351;&#21028;&#21035;&#21644;&#29983;&#25104;&#20219;&#21153;&#21463;&#30410;&#12290;&#30446;&#21069;&#33267;&#23569;&#26377;&#19977;&#20010;&#26410;&#35299;&#20915;&#30340;&#26680;&#24515;&#38382;&#39064;&#65306;&#65288;i&#65289;&#36807;&#20110;&#20381;&#36182;&#26631;&#31614;&#27880;&#37322;&#21644;&#21512;&#25104;&#25968;&#25454;-&#23548;&#33268;&#22312;&#33258;&#28982;&#24773;&#26223;&#19979;&#27867;&#21270;&#33021;&#21147;&#36739;&#24046;&#65307;&#65288;ii&#65289;&#21551;&#21457;&#24335;/&#25163;&#24037;&#21046;&#20316;&#30340;&#35299;&#32544;&#32422;&#26463;&#20351;&#24471;&#38590;&#20197;&#33258;&#36866;&#24212;&#22320;&#23454;&#29616;&#26368;&#20339;&#35757;&#32451;&#26435;&#34913;&#65307;&#65288;iii&#65289;&#32570;&#20047;&#21512;&#29702;&#30340;&#35780;&#20272;&#25351;&#26631;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#30495;&#23454;&#30340;&#26080;&#26631;&#31614;&#25968;&#25454;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#34987;&#31216;&#20026;CL-Dis&#30340;&#38381;&#29615;&#26080;&#30417;&#30563;&#34920;&#31034;&#35299;&#32544;&#26041;&#27861;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#25193;&#25955;&#30340;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;Diff-AE&#65289;&#20316;&#20026;&#39592;&#24178;&#65292;&#24182;&#20351;&#29992;&#946;-VAE&#20316;&#20026;&#21103;&#39550;&#39542;&#21592;&#26469;&#25552;&#21462;&#35821;&#20041;&#35299;&#32544;&#30340;&#34920;&#31034;&#12290;&#25193;&#25955;&#27169;&#22411;&#30340;&#24378;&#22823;&#29983;&#25104;&#33021;&#21147;&#21644;VAE&#27169;&#22411;&#30340;&#33391;&#22909;&#35299;&#32544;&#33021;&#21147;&#26159;&#20114;&#34917;&#30340;&#12290;&#20026;&#20102;&#21152;&#24378;&#35299;&#32544;&#65292;&#20351;&#29992;VAE&#28508;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Representation disentanglement may help AI fundamentally understand the real world and thus benefit both discrimination and generation tasks. It currently has at least three unresolved core issues: (i) heavy reliance on label annotation and synthetic data -- causing poor generalization on natural scenarios; (ii) heuristic/hand-craft disentangling constraints make it hard to adaptively achieve an optimal training trade-off; (iii) lacking reasonable evaluation metric, especially for the real label-free data. To address these challenges, we propose a \textbf{C}losed-\textbf{L}oop unsupervised representation \textbf{Dis}entanglement approach dubbed \textbf{CL-Dis}. Specifically, we use diffusion-based autoencoder (Diff-AE) as a backbone while resorting to $\beta$-VAE as a co-pilot to extract semantically disentangled representations. The strong generation ability of diffusion model and the good disentanglement ability of VAE model are complementary. To strengthen disentangling, VAE-latent 
&lt;/p&gt;</description></item></channel></rss>