<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#29616;&#20195;&#35821;&#35328;&#27169;&#22411;&#22312;&#32534;&#31243;&#20013;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;&#25351;&#20196;&#35843;&#20248;&#26159;&#19968;&#20010;&#22686;&#24378;&#20854;&#23454;&#29992;&#24615;&#30340;&#20851;&#38190;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#26041;&#26696;&#24573;&#35270;&#20102;&#29983;&#25104;&#20195;&#30721;&#30340;&#23433;&#20840;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;SafeCoder&#65292;&#36890;&#36807;&#23433;&#20840;&#24494;&#35843;&#21644;&#26631;&#20934;&#25351;&#20196;&#35843;&#20248;&#30456;&#32467;&#21512;&#65292;&#26469;&#20248;&#21270;&#23433;&#20840;&#24615;&#21644;&#23454;&#29992;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09497</link><description>&lt;p&gt;
&#23433;&#20840;&#20195;&#30721;&#29983;&#25104;&#30340;&#25351;&#20196;&#35843;&#20248;
&lt;/p&gt;
&lt;p&gt;
Instruction Tuning for Secure Code Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09497
&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#35821;&#35328;&#27169;&#22411;&#22312;&#32534;&#31243;&#20013;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;&#25351;&#20196;&#35843;&#20248;&#26159;&#19968;&#20010;&#22686;&#24378;&#20854;&#23454;&#29992;&#24615;&#30340;&#20851;&#38190;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#26041;&#26696;&#24573;&#35270;&#20102;&#29983;&#25104;&#20195;&#30721;&#30340;&#23433;&#20840;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;SafeCoder&#65292;&#36890;&#36807;&#23433;&#20840;&#24494;&#35843;&#21644;&#26631;&#20934;&#25351;&#20196;&#35843;&#20248;&#30456;&#32467;&#21512;&#65292;&#26469;&#20248;&#21270;&#23433;&#20840;&#24615;&#21644;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#35821;&#35328;&#27169;&#22411;(LMs)&#22312;&#26085;&#24120;&#21644;&#19987;&#19994;&#29615;&#22659;&#20013;&#24471;&#21040;&#20102;&#24191;&#27867;&#30340;&#35748;&#21487;&#65292;&#23588;&#20854;&#22312;&#32534;&#31243;&#20013;&#12290;&#25351;&#20196;&#35843;&#20248;&#26159;&#19968;&#31181;&#20851;&#38190;&#30340;&#36807;&#31243;&#65292;&#36890;&#36807;&#35757;&#32451;LMs&#36981;&#24490;&#29992;&#25143;&#25351;&#20196;&#21644;&#20154;&#31867;&#20559;&#22909;&#65292;&#20174;&#32780;&#22823;&#22823;&#22686;&#24378;&#20102;LMs&#30340;&#23454;&#29992;&#24615;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#25351;&#20196;&#35843;&#20248;&#26041;&#26696;&#24573;&#35270;&#20102;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#65306;&#29983;&#25104;&#20195;&#30721;&#30340;&#23433;&#20840;&#24615;&#12290;&#22240;&#27492;&#65292;&#21363;&#20351;&#26159;&#26368;&#20808;&#36827;&#30340;&#25351;&#20196;&#35843;&#20248;&#30340;LMs&#20063;&#32463;&#24120;&#20135;&#29983;&#19981;&#23433;&#20840;&#30340;&#20195;&#30721;&#65292;&#24102;&#26469;&#20102;&#37325;&#22823;&#30340;&#23433;&#20840;&#39118;&#38505;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;SafeCoder&#26469;&#22635;&#34917;&#36825;&#20010;&#24046;&#36317;&#12290;SafeCoder&#20351;&#29992;&#19968;&#20010;&#22810;&#26679;&#21270;&#21644;&#39640;&#36136;&#37327;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#23433;&#20840;&#20026;&#20013;&#24515;&#30340;&#24494;&#35843;&#65292;&#25105;&#20204;&#20351;&#29992;&#33258;&#21160;&#21270;&#27969;&#27700;&#32447;&#25910;&#38598;&#20102;&#36825;&#20010;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#23558;&#23433;&#20840;&#24494;&#35843;&#19982;&#26631;&#20934;&#30340;&#25351;&#20196;&#35843;&#20248;&#30456;&#32467;&#21512;&#65292;&#20197;&#20415;&#21516;&#26102;&#20248;&#21270;&#23433;&#20840;&#24615;&#21644;&#23454;&#29992;&#24615;&#12290;&#23613;&#31649;&#31616;&#21333;&#65292;&#20294;&#25105;&#20204;&#23637;&#31034;&#20102;SafeCoder&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09497v1 Announce Type: cross  Abstract: Modern language models (LMs) have gained widespread acceptance in everyday and professional contexts, particularly in programming. An essential procedure enabling this adoption is instruction tuning, which substantially enhances LMs' practical utility by training them to follow user instructions and human preferences. However, existing instruction tuning schemes overlook a crucial aspect: the security of generated code. As a result, even the state-of-the-art instruction-tuned LMs frequently produce unsafe code, posing significant security risks. In this work, we introduce SafeCoder to address this gap. SafeCoder performs security-centric fine-tuning using a diverse and high-quality dataset that we collected using an automated pipeline. We integrate the security fine-tuning with standard instruction tuning, to facilitate a joint optimization of both security and utility. Despite its simplicity, we show that SafeCoder is effective across
&lt;/p&gt;</description></item><item><title>DISTINQT&#26159;&#19968;&#31181;&#38754;&#21521;&#26410;&#26469;&#31227;&#21160;&#21644;&#26080;&#32447;&#32593;&#32476;&#30340;&#38544;&#31169;&#24863;&#30693;&#20998;&#24067;&#24335;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;QoS&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2401.10158</link><description>&lt;p&gt;
DISTINQT: &#19968;&#31181;&#38754;&#21521;&#26410;&#26469;&#31227;&#21160;&#21644;&#26080;&#32447;&#32593;&#32476;&#30340;&#20998;&#24067;&#24335;&#38544;&#31169;&#24863;&#30693;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;QoS&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
DISTINQT: A Distributed Privacy Aware Learning Framework for QoS Prediction for Future Mobile and Wireless Networks. (arXiv:2401.10158v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10158
&lt;/p&gt;
&lt;p&gt;
DISTINQT&#26159;&#19968;&#31181;&#38754;&#21521;&#26410;&#26469;&#31227;&#21160;&#21644;&#26080;&#32447;&#32593;&#32476;&#30340;&#38544;&#31169;&#24863;&#30693;&#20998;&#24067;&#24335;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;QoS&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
5G&#21644;6G&#20197;&#21518;&#30340;&#32593;&#32476;&#23558;&#25903;&#25345;&#20381;&#36182;&#19968;&#23450;&#26381;&#21153;&#36136;&#37327;&#65288;QoS&#65289;&#30340;&#26032;&#30340;&#21644;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#29992;&#20363;&#21644;&#24212;&#29992;&#31243;&#24207;&#12290;&#21450;&#26102;&#39044;&#27979;QoS&#23545;&#20110;&#23433;&#20840;&#20851;&#38190;&#24212;&#29992;&#65288;&#22914;&#36710;&#36742;&#36890;&#20449;&#65289;&#23588;&#20026;&#37325;&#35201;&#12290;&#23613;&#31649;&#30452;&#21040;&#26368;&#36817;&#65292;QoS&#39044;&#27979;&#19968;&#30452;&#30001;&#38598;&#20013;&#24335;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#35299;&#20915;&#26041;&#26696;&#23436;&#25104;&#65292;&#20294;&#24050;&#32463;&#20986;&#29616;&#20102;&#19968;&#20123;&#38544;&#31169;&#12289;&#35745;&#31639;&#21644;&#36816;&#33829;&#26041;&#38754;&#30340;&#38382;&#39064;&#12290;&#26367;&#20195;&#26041;&#26696;&#24050;&#32463;&#20986;&#29616;&#65288;&#22914;&#20998;&#21106;&#23398;&#20064;&#12289;&#32852;&#37030;&#23398;&#20064;&#65289;&#65292;&#23558;&#22797;&#26434;&#24230;&#36739;&#20302;&#30340;AI&#20219;&#21153;&#20998;&#24067;&#22312;&#33410;&#28857;&#20043;&#38388;&#65292;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;&#28982;&#32780;&#65292;&#32771;&#34385;&#21040;&#26410;&#26469;&#26080;&#32447;&#32593;&#32476;&#30340;&#24322;&#26500;&#24615;&#65292;&#24403;&#28041;&#21450;&#21487;&#25193;&#23637;&#30340;&#20998;&#24067;&#24335;&#23398;&#20064;&#26041;&#27861;&#26102;&#65292;&#20250;&#20986;&#29616;&#26032;&#30340;&#25361;&#25112;&#12290;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;DISTINQT&#30340;&#38754;&#21521;QoS&#39044;&#27979;&#30340;&#38544;&#31169;&#24863;&#30693;&#20998;&#24067;&#24335;&#23398;&#20064;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
Beyond 5G and 6G networks are expected to support new and challenging use cases and applications that depend on a certain level of Quality of Service (QoS) to operate smoothly. Predicting the QoS in a timely manner is of high importance, especially for safety-critical applications as in the case of vehicular communications. Although until recent years the QoS prediction has been carried out by centralized Artificial Intelligence (AI) solutions, a number of privacy, computational, and operational concerns have emerged. Alternative solutions have been surfaced (e.g. Split Learning, Federated Learning), distributing AI tasks of reduced complexity across nodes, while preserving the privacy of the data. However, new challenges rise when it comes to scalable distributed learning approaches, taking into account the heterogeneous nature of future wireless networks. The current work proposes DISTINQT, a privacy-aware distributed learning framework for QoS prediction. Our framework supports mult
&lt;/p&gt;</description></item></channel></rss>