<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>PromptCrypt&#26159;&#19968;&#31181;&#20351;&#29992;&#34920;&#24773;&#31526;&#21495;&#23545;&#29992;&#25143;&#36755;&#20837;&#36827;&#34892;&#21152;&#23494;&#30340;&#26426;&#21046;&#65292;&#20445;&#25252;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#20013;&#29992;&#25143;&#30340;&#38544;&#31169;&#65292;&#38450;&#27490;&#25968;&#25454;&#27844;&#38706;&#21644;&#35299;&#23494;&#12290;</title><link>https://arxiv.org/abs/2402.05868</link><description>&lt;p&gt;
PromptCrypt: &#20351;&#29992;&#34920;&#24773;&#31526;&#21495;&#23545;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#23433;&#20840;&#36890;&#20449;&#30340;&#25552;&#31034;&#21152;&#23494;
&lt;/p&gt;
&lt;p&gt;
PromptCrypt: Prompt Encryption for Secure Communication with Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05868
&lt;/p&gt;
&lt;p&gt;
PromptCrypt&#26159;&#19968;&#31181;&#20351;&#29992;&#34920;&#24773;&#31526;&#21495;&#23545;&#29992;&#25143;&#36755;&#20837;&#36827;&#34892;&#21152;&#23494;&#30340;&#26426;&#21046;&#65292;&#20445;&#25252;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#20013;&#29992;&#25143;&#30340;&#38544;&#31169;&#65292;&#38450;&#27490;&#25968;&#25454;&#27844;&#38706;&#21644;&#35299;&#23494;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#20113;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22914;ChatGPT&#22312;&#26085;&#24120;&#25805;&#20316;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#25104;&#20026;&#21508;&#31181;&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#34429;&#28982;&#36825;&#20123;&#27169;&#22411;&#22312;&#21487;&#35775;&#38382;&#24615;&#21644;&#21151;&#33021;&#24615;&#26041;&#38754;&#24102;&#26469;&#20102;&#37325;&#22823;&#22909;&#22788;&#65292;&#20294;&#23427;&#20204;&#20063;&#24341;&#20837;&#20102;&#37325;&#35201;&#30340;&#38544;&#31169;&#38382;&#39064;&#65306;&#22312;&#20113;&#22522;&#30784;&#26550;&#26500;&#20013;&#20256;&#36755;&#21644;&#23384;&#20648;&#29992;&#25143;&#25968;&#25454;&#20250;&#20135;&#29983;&#37325;&#22823;&#30340;&#25968;&#25454;&#27844;&#38706;&#21644;&#26410;&#32463;&#25480;&#26435;&#35775;&#38382;&#25935;&#24863;&#20449;&#24687;&#30340;&#39118;&#38505;&#65307;&#21363;&#20351;&#25968;&#25454;&#30340;&#20256;&#36755;&#21644;&#23384;&#20648;&#34987;&#21152;&#23494;&#65292;LLM&#26381;&#21153;&#25552;&#20379;&#21830;&#20173;&#28982;&#30693;&#36947;&#25968;&#25454;&#30340;&#30495;&#23454;&#20869;&#23481;&#65292;&#20174;&#32780;&#38459;&#27490;&#20010;&#20154;&#25110;&#23454;&#20307;&#25918;&#24515;&#20351;&#29992;&#27492;&#31867;LLM&#26381;&#21153;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#20294;&#26377;&#25928;&#30340;&#26426;&#21046;PromptCrypt&#26469;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#12290;&#23427;&#20351;&#29992;&#34920;&#24773;&#31526;&#21495;&#23545;&#29992;&#25143;&#36755;&#20837;&#36827;&#34892;&#21152;&#23494;&#65292;&#28982;&#21518;&#23558;&#20854;&#21457;&#36865;&#21040;LLM&#65292;&#26377;&#25928;&#22320;&#20351;&#20854;&#23545;&#20154;&#31867;&#25110;LLM&#30340;&#26816;&#26597;&#26080;&#27861;&#29702;&#35299;&#65292;&#21516;&#26102;&#20445;&#30041;&#21407;&#22987;&#25552;&#31034;&#30340;&#24847;&#22270;&#65292;&#20174;&#32780;&#30830;&#20445;&#29992;&#25143;&#38544;&#31169;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cloud-based large language models (LLMs) such as ChatGPT have increasingly become integral to daily operations, serving as vital tools across various applications. While these models offer substantial benefits in terms of accessibility and functionality, they also introduce significant privacy concerns: the transmission and storage of user data in cloud infrastructures pose substantial risks of data breaches and unauthorized access to sensitive information; even if the transmission and storage of data is encrypted, the LLM service provider itself still knows the real contents of the data, preventing individuals or entities from confidently using such LLM services. To address these concerns, this paper proposes a simple yet effective mechanism PromptCrypt to protect user privacy. It uses Emoji to encrypt the user inputs before sending them to LLM, effectively rendering them indecipherable to human or LLM's examination while retaining the original intent of the prompt, thus ensuring the 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#21512;&#36866;&#30340;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#35774;&#35745;&#26469;&#35299;&#20915;&#21152;&#23494;&#32463;&#27982;&#31995;&#32479;&#20013;&#34180;&#24369;&#24066;&#22330;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#23637;&#31034;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#35774;&#35745;&#29305;&#24615;&#30340;&#20998;&#31867;&#27861;&#65292;&#24182;&#35774;&#35745;&#20102;&#23454;&#26045;&#35299;&#20915;&#34180;&#24369;&#24066;&#22330;&#38382;&#39064;&#30340;&#20856;&#22411;&#12290;</title><link>http://arxiv.org/abs/2309.12818</link><description>&lt;p&gt;
&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#22312;&#21152;&#23494;&#32463;&#27982;&#31995;&#32479;&#20013;&#35299;&#20915;&#34180;&#24369;&#24066;&#22330;&#38382;&#39064;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
How Automated Market Makers Approach the Thin Market Problem in Cryptoeocnomic Systems. (arXiv:2309.12818v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12818
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#21512;&#36866;&#30340;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#35774;&#35745;&#26469;&#35299;&#20915;&#21152;&#23494;&#32463;&#27982;&#31995;&#32479;&#20013;&#34180;&#24369;&#24066;&#22330;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#23637;&#31034;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#35774;&#35745;&#29305;&#24615;&#30340;&#20998;&#31867;&#27861;&#65292;&#24182;&#35774;&#35745;&#20102;&#23454;&#26045;&#35299;&#20915;&#34180;&#24369;&#24066;&#22330;&#38382;&#39064;&#30340;&#20856;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#30340;&#36866;&#24403;&#35774;&#35745;&#23545;&#20110;&#22312;&#21152;&#23494;&#32463;&#27982;&#31995;&#32479;&#30340;&#24066;&#22330;&#19978;&#20351;&#25968;&#23383;&#20195;&#24065;&#24471;&#20197;&#25345;&#32493;&#20132;&#26131;&#33267;&#20851;&#37325;&#35201;&#12290;&#35774;&#35745;&#19981;&#24403;&#30340;AMMs&#21487;&#33021;&#23548;&#33268;&#36825;&#20123;&#24066;&#22330;&#36973;&#21463;&#34180;&#24369;&#24066;&#22330;&#38382;&#39064;&#65288;TMP&#65289;&#65292;&#20174;&#32780;&#23548;&#33268;&#21152;&#23494;&#32463;&#27982;&#31995;&#32479;&#26080;&#27861;&#23454;&#29616;&#20854;&#30446;&#26631;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;AMM&#20998;&#31867;&#27861;&#23637;&#31034;AMM&#35774;&#35745;&#29305;&#24615;&#12290;&#22522;&#20110;&#35813;&#20998;&#31867;&#27861;&#65292;&#25105;&#20204;&#35774;&#35745;&#20986;&#20102;&#23454;&#26045;&#35299;&#20915;TMP&#30340;&#20027;&#35201;&#35299;&#20915;&#26041;&#26696;&#30340;AMM&#20856;&#22411;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#30340;&#26159;&#36890;&#36807;&#21512;&#36866;&#30340;AMM&#35774;&#35745;&#26469;&#24110;&#21161;&#20174;&#19994;&#20154;&#21592;&#21644;&#30740;&#31350;&#20154;&#21592;&#35299;&#20915;TMP&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
The proper design of automated market makers (AMMs) is crucial to enable the continuous trading of assets represented as digital tokens on markets of cryptoeconomic systems. Improperly designed AMMs can make such markets suffer from the thin market problem (TMP), which can cause cryptoeconomic systems to fail their purposes. We developed an AMM taxonomy that showcases AMM design characteristics. Based on the AMM taxonomy, we devised AMM archetypes implementing principal solution approaches for the TMP. The main purpose of this article is to support practitioners and researchers in tackling the TMP through proper AMM designs.
&lt;/p&gt;</description></item></channel></rss>