<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#37327;&#21270;&#21644;&#20943;&#36731;&#34920;&#26684;&#29983;&#25104;&#27169;&#22411;&#30340;&#38544;&#31169;&#39118;&#38505;&#65292;&#36890;&#36807;&#23545;&#20116;&#31181;&#26368;&#20808;&#36827;&#30340;&#34920;&#26684;&#21512;&#25104;&#22120;&#36827;&#34892;&#23454;&#35777;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#24046;&#20998;&#38544;&#31169;&#34920;&#26684;&#28508;&#22312;&#25193;&#25955;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2403.07842</link><description>&lt;p&gt;
&#37327;&#21270;&#21644;&#20943;&#36731;&#34920;&#26684;&#29983;&#25104;&#27169;&#22411;&#30340;&#38544;&#31169;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Quantifying and Mitigating Privacy Risks for Tabular Generative Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07842
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#37327;&#21270;&#21644;&#20943;&#36731;&#34920;&#26684;&#29983;&#25104;&#27169;&#22411;&#30340;&#38544;&#31169;&#39118;&#38505;&#65292;&#36890;&#36807;&#23545;&#20116;&#31181;&#26368;&#20808;&#36827;&#30340;&#34920;&#26684;&#21512;&#25104;&#22120;&#36827;&#34892;&#23454;&#35777;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#24046;&#20998;&#38544;&#31169;&#34920;&#26684;&#28508;&#22312;&#25193;&#25955;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#27169;&#22411;&#20986;&#29616;&#20316;&#20026;&#20445;&#25252;&#38544;&#31169;&#30340;&#25968;&#25454;&#20849;&#20139;&#35299;&#20915;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#35813;&#21512;&#25104;&#25968;&#25454;&#38598;&#24212;&#35813;&#31867;&#20284;&#20110;&#21407;&#22987;&#25968;&#25454;&#65292;&#32780;&#19981;&#20250;&#36879;&#38706;&#21487;&#35782;&#21035;&#30340;&#31169;&#20154;&#20449;&#24687;&#12290;&#34920;&#26684;&#21512;&#25104;&#22120;&#30340;&#26680;&#24515;&#25216;&#26415;&#26681;&#26893;&#20110;&#22270;&#20687;&#29983;&#25104;&#27169;&#22411;&#65292;&#33539;&#22260;&#20174;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#21040;&#26368;&#36817;&#30340;&#25193;&#25955;&#27169;&#22411;&#12290;&#26368;&#36817;&#30340;&#20808;&#21069;&#24037;&#20316;&#25581;&#31034;&#21644;&#37327;&#21270;&#20102;&#34920;&#26684;&#25968;&#25454;&#19978;&#30340;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#65292;&#25581;&#31034;&#20102;&#21512;&#25104;&#25968;&#25454;&#30340;&#38544;&#31169;&#39118;&#38505;&#12290;&#25105;&#20204;&#39318;&#20808;&#36827;&#34892;&#20102;&#35814;&#23613;&#30340;&#23454;&#35777;&#20998;&#26512;&#65292;&#31361;&#20986;&#20102;&#20116;&#31181;&#26368;&#20808;&#36827;&#30340;&#34920;&#26684;&#21512;&#25104;&#22120;&#38024;&#23545;&#20843;&#31181;&#38544;&#31169;&#25915;&#20987;&#30340;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#65292;&#29305;&#21035;&#20851;&#27880;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#12290;&#22312;&#35266;&#23519;&#21040;&#34920;&#26684;&#25193;&#25955;&#20013;&#39640;&#25968;&#25454;&#36136;&#37327;&#20294;&#20063;&#39640;&#38544;&#31169;&#39118;&#38505;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;DP-TLDM&#65292;&#24046;&#20998;&#38544;&#31169;&#34920;&#26684;&#28508;&#22312;&#25193;&#25955;&#27169;&#22411;&#65292;&#30001;&#33258;&#21160;&#32534;&#30721;&#22120;&#32593;&#32476;&#32452;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07842v1 Announce Type: new  Abstract: Synthetic data from generative models emerges as the privacy-preserving data-sharing solution. Such a synthetic data set shall resemble the original data without revealing identifiable private information. The backbone technology of tabular synthesizers is rooted in image generative models, ranging from Generative Adversarial Networks (GANs) to recent diffusion models. Recent prior work sheds light on the utility-privacy tradeoff on tabular data, revealing and quantifying privacy risks on synthetic data. We first conduct an exhaustive empirical analysis, highlighting the utility-privacy tradeoff of five state-of-the-art tabular synthesizers, against eight privacy attacks, with a special focus on membership inference attacks. Motivated by the observation of high data quality but also high privacy risk in tabular diffusion, we propose DP-TLDM, Differentially Private Tabular Latent Diffusion Model, which is composed of an autoencoder networ
&lt;/p&gt;</description></item></channel></rss>