<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;Rashomon Set of Optimal Trees (ROOT)&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#30340;&#23569;&#25968;&#20154;&#32676;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#25552;&#20379;&#26356;&#31934;&#30830;&#21644;&#21487;&#35299;&#37322;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.14512</link><description>&lt;p&gt;
&#25105;&#20204;&#38169;&#36807;&#20102;&#35841;&#65311;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#25581;&#31034;&#23569;&#25968;&#20154;&#32676;&#29305;&#24449;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Who Are We Missing? A Principled Approach to Characterizing the Underrepresented Population. (arXiv:2401.14512v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;Rashomon Set of Optimal Trees (ROOT)&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#30340;&#23569;&#25968;&#20154;&#32676;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#25552;&#20379;&#26356;&#31934;&#30830;&#21644;&#21487;&#35299;&#37322;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#22312;&#29702;&#35299;&#22240;&#26524;&#25928;&#24212;&#26041;&#38754;&#36215;&#21040;&#20102;&#20851;&#38190;&#20316;&#29992;&#65292;&#28982;&#32780;&#23558;&#25512;&#35770;&#25193;&#23637;&#21040;&#30446;&#26631;&#20154;&#32676;&#26102;&#38754;&#20020;&#25928;&#24212;&#24322;&#36136;&#24615;&#21644;&#20195;&#34920;&#24615;&#19981;&#36275;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#35770;&#25991;&#35299;&#20915;&#20102;&#22312;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#35782;&#21035;&#21644;&#25551;&#36848;&#23569;&#25968;&#20154;&#32676;&#30340;&#20851;&#38190;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25913;&#36827;&#30446;&#26631;&#20154;&#32676;&#20197;&#25552;&#21319;&#26222;&#36866;&#24615;&#30340;&#21019;&#26032;&#26694;&#26550;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#8212;&#8212;Rashomon Set of Optimal Trees (ROOT)&#65292;&#26469;&#25551;&#36848;&#23569;&#25968;&#20154;&#32676;&#12290;ROOT&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#30830;&#20445;&#26356;&#31934;&#30830;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;ROOT&#29983;&#25104;&#21487;&#35299;&#37322;&#30340;&#23569;&#25968;&#20154;&#32676;&#29305;&#24449;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#20154;&#21592;&#26377;&#25928;&#27807;&#36890;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#26041;&#38754;&#30456;&#23545;&#20110;&#20854;&#20182;&#26041;&#27861;&#23637;&#29616;&#20102;&#25913;&#36827;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Randomized controlled trials (RCTs) serve as the cornerstone for understanding causal effects, yet extending inferences to target populations presents challenges due to effect heterogeneity and underrepresentation. Our paper addresses the critical issue of identifying and characterizing underrepresented subgroups in RCTs, proposing a novel framework for refining target populations to improve generalizability. We introduce an optimization-based approach, Rashomon Set of Optimal Trees (ROOT), to characterize underrepresented groups. ROOT optimizes the target subpopulation distribution by minimizing the variance of the target average treatment effect estimate, ensuring more precise treatment effect estimations. Notably, ROOT generates interpretable characteristics of the underrepresented population, aiding researchers in effective communication. Our approach demonstrates improved precision and interpretability compared to alternatives, as illustrated with synthetic data experiments. We ap
&lt;/p&gt;</description></item></channel></rss>