<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#36890;&#36807;&#22823;&#35268;&#27169;&#30417;&#27979;&#21644;&#20998;&#26512;GPT&#21830;&#24215;&#65292;&#24320;&#21457;&#20102;&#33258;&#21160;&#21270;&#24037;&#20855;&#26469;&#30740;&#31350;GPT&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#28431;&#27934;&#21644;&#25220;&#34989;&#24773;&#20917;&#12290;</title><link>https://arxiv.org/abs/2402.15105</link><description>&lt;p&gt;
GPT&#24212;&#29992;&#30340;&#21021;&#25506;&#65306;&#26684;&#23616;&#19982;&#33030;&#24369;&#24615;
&lt;/p&gt;
&lt;p&gt;
A First Look at GPT Apps: Landscape and Vulnerability
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15105
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22823;&#35268;&#27169;&#30417;&#27979;&#21644;&#20998;&#26512;GPT&#21830;&#24215;&#65292;&#24320;&#21457;&#20102;&#33258;&#21160;&#21270;&#24037;&#20855;&#26469;&#30740;&#31350;GPT&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#28431;&#27934;&#21644;&#25220;&#34989;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#36827;&#27493;&#65292;&#36234;&#26469;&#36234;&#22797;&#26434;&#21644;&#24378;&#22823;&#30340;GPT&#36827;&#20837;&#24066;&#22330;&#12290;&#23613;&#31649;&#23427;&#20204;&#24456;&#21463;&#27426;&#36814;&#65292;&#20294;LLM&#29983;&#24577;&#31995;&#32479;&#20173;&#28982;&#23578;&#26410;&#34987;&#25506;&#32034;&#12290;&#27492;&#22806;&#65292;LLMs&#23545;&#25915;&#20987;&#30340;&#25935;&#24863;&#24615;&#24341;&#21457;&#20102;&#23545;&#23433;&#20840;&#24615;&#21644;&#25220;&#34989;&#30340;&#25285;&#24551;&#12290;&#22240;&#27492;&#65292;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23545;GPT&#21830;&#24215;&#36827;&#34892;&#20102;&#24320;&#21019;&#24615;&#30340;&#25506;&#32034;&#65292;&#26088;&#22312;&#30740;&#31350;GPT&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#28431;&#27934;&#21644;&#25220;&#34989;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#25454;&#25105;&#20204;&#25152;&#30693;&#30340;&#31532;&#19968;&#27425;&#22823;&#35268;&#27169;&#30417;&#27979;&#21644;&#20998;&#26512;&#65292;&#20998;&#21035;&#26159;&#19968;&#20010;&#38750;&#23448;&#26041;&#30340;GPTStore.AI&#21644;&#19968;&#20010;&#23448;&#26041;&#30340;OpenAI GPT Store&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;TriLevel GPT Reversing&#65288;T-GR&#65289;&#31574;&#30053;&#65292;&#29992;&#20110;&#25552;&#21462;GPT&#20869;&#37096;&#20449;&#24687;&#12290;&#20026;&#20102;&#26377;&#25928;&#22320;&#23436;&#25104;&#36825;&#20004;&#39033;&#20219;&#21153;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#20004;&#20010;&#33258;&#21160;&#21270;&#24037;&#20855;&#65306;&#19968;&#20010;&#29992;&#20110;&#32593;&#32476;&#25235;&#21462;&#65292;&#21478;&#19968;&#20010;&#35774;&#35745;&#29992;&#20110;&#19982;GPT&#36827;&#34892;&#31243;&#24207;&#21270;&#20132;&#20114;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#25581;&#31034;&#20102;&#29992;&#25143;&#21644;&#24320;&#21457;&#32773;&#23545;GPT&#20132;&#20114;&#21644;&#21019;&#24314;&#30340;&#24040;&#22823;&#28909;&#24773;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15105v1 Announce Type: cross  Abstract: With the advancement of Large Language Models (LLMs), increasingly sophisticated and powerful GPTs are entering the market. Despite their popularity, the LLM ecosystem still remains unexplored. Additionally, LLMs' susceptibility to attacks raises concerns over safety and plagiarism. Thus, in this work, we conduct a pioneering exploration of GPT stores, aiming to study vulnerabilities and plagiarism within GPT applications. To begin with, we conduct, to our knowledge, the first large-scale monitoring and analysis of two stores, an unofficial GPTStore.AI, and an official OpenAI GPT Store. Then, we propose a TriLevel GPT Reversing (T-GR) strategy for extracting GPT internals. To complete these two tasks efficiently, we develop two automated tools: one for web scraping and another designed for programmatically interacting with GPTs. Our findings reveal a significant enthusiasm among users and developers for GPT interaction and creation, as
&lt;/p&gt;</description></item></channel></rss>