<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#25163;&#26426;&#25968;&#25454;&#21457;&#29616;&#65292;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#65292;&#29983;&#27963;&#22312;&#20302;&#36130;&#23500;&#31038;&#21306;&#30340;&#22478;&#24066;&#29992;&#25143;&#26356;&#19981;&#21487;&#33021;&#37319;&#21462;&#33258;&#25105;&#38548;&#31163;&#30340;&#34892;&#21160;&#65292;&#36139;&#31351;&#29992;&#25143;&#20013;&#37027;&#20123;&#26366;&#32463;&#36890;&#21220;&#19978;&#29677;&#21040;&#39640;&#36130;&#23500;&#31038;&#21306;&#30340;&#20154;&#21017;&#29305;&#21035;&#23481;&#26131;&#21463;&#21040;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2305.06888</link><description>&lt;p&gt;
&#21457;&#23637;&#20013;&#22269;&#23478;COVID-19&#30123;&#24773;&#26399;&#38388;&#30340;&#31038;&#20250;&#32463;&#27982;&#24046;&#24322;&#19982;&#20986;&#34892;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Socioeconomic disparities in mobility behavior during the COVID-19 pandemic in developing countries. (arXiv:2305.06888v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.06888
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25163;&#26426;&#25968;&#25454;&#21457;&#29616;&#65292;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#65292;&#29983;&#27963;&#22312;&#20302;&#36130;&#23500;&#31038;&#21306;&#30340;&#22478;&#24066;&#29992;&#25143;&#26356;&#19981;&#21487;&#33021;&#37319;&#21462;&#33258;&#25105;&#38548;&#31163;&#30340;&#34892;&#21160;&#65292;&#36139;&#31351;&#29992;&#25143;&#20013;&#37027;&#20123;&#26366;&#32463;&#36890;&#21220;&#19978;&#29677;&#21040;&#39640;&#36130;&#23500;&#31038;&#21306;&#30340;&#20154;&#21017;&#29305;&#21035;&#23481;&#26131;&#21463;&#21040;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25163;&#26426;&#25968;&#25454;&#22312;&#37327;&#21270;COVID-19&#30123;&#24773;&#26399;&#38388;&#30340;&#20154;&#31867;&#27969;&#21160;&#20013;&#21457;&#25381;&#20102;&#20851;&#38190;&#20316;&#29992;&#12290;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#20851;&#27880;&#39640;&#25910;&#20837;&#22269;&#23478;&#30340;&#22320;&#21306;&#24635;&#20307;&#24773;&#20917;&#65292;&#25513;&#30422;&#20102;&#30123;&#24773;&#23545;&#26368;&#33030;&#24369;&#32676;&#20307;&#30340;&#24378;&#28872;&#24433;&#21709;&#12290;&#25105;&#20204;&#32467;&#21512;&#26469;&#33258;&#31227;&#21160;&#30005;&#35805;&#21644;&#20154;&#21475;&#26222;&#26597;&#30340;&#22320;&#29702;&#20301;&#32622;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;2020&#24180;3&#26376;&#33267;12&#26376;&#26399;&#38388;3&#20010;&#22823;&#27954;&#30340;6&#20010;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#65292;&#25581;&#31034;&#20102;&#19981;&#21516;&#31038;&#20250;&#32463;&#27982;&#32676;&#20307;&#24212;&#23545;&#30123;&#24773;&#30340;&#34892;&#20026;&#24046;&#24322;&#12290;&#24403;&#30123;&#24773;&#29190;&#21457;&#26102;&#65292;&#29983;&#27963;&#22312;&#20302;&#36130;&#23500;&#31038;&#21306;&#20013;&#30340;&#22478;&#24066;&#29992;&#25143;&#26356;&#19981;&#21487;&#33021;&#36890;&#36807;&#33258;&#25105;&#38548;&#31163;&#22312;&#23478;&#20013;&#12289;&#25644;&#36801;&#21040;&#20892;&#26449;&#22320;&#21306;&#25110;&#32773;&#20572;&#27490;&#36890;&#21220;&#24037;&#20316;&#26469;&#24212;&#23545;&#12290;&#36139;&#31351;&#29992;&#25143;&#20013;&#65292;&#37027;&#20123;&#22312;&#30123;&#24773;&#20043;&#21069;&#26366;&#36890;&#21220;&#19978;&#29677;&#21040;&#39640;&#36130;&#23500;&#31038;&#21306;&#30340;&#20154;&#21017;&#38754;&#20020;&#30528;&#37325;&#22823;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mobile phone data have played a key role in quantifying human mobility during the COVID-19 pandemic. Existing studies on mobility patterns have primarily focused on regional aggregates in high-income countries, obfuscating the accentuated impact of the pandemic on the most vulnerable populations. By combining geolocation data from mobile phones and population census for 6 middle-income countries across 3 continents between March and December 2020, we uncovered common disparities in the behavioral response to the pandemic across socioeconomic groups. When the pandemic hit, urban users living in low-wealth neighborhoods were less likely to respond by self-isolating at home, relocating to rural areas, or refraining from commuting to work. The gap in the behavioral responses between socioeconomic groups persisted during the entire observation period. Among low-wealth users, those who used to commute to work in high-wealth neighborhoods pre-pandemic were particularly at risk, facing both th
&lt;/p&gt;</description></item></channel></rss>