<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#25991;&#25506;&#32034;&#20102;&#39044;&#27979;&#31639;&#27861;&#20013;&#22810;&#32452;&#20844;&#24179;&#24615;&#21644;&#20266;&#38543;&#26426;&#24615;&#30340;&#32852;&#31995;&#65292;&#25552;&#20379;&#20102;&#26032;&#30340;&#22810;&#26657;&#20934;&#31639;&#27861;&#21644;&#23454;&#20540;&#20989;&#25968;&#26680;&#24341;&#29702;&#35777;&#26126;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2301.08837</link><description>&lt;p&gt;
&#20174;&#20266;&#38543;&#26426;&#24615;&#21040;&#22810;&#32452;&#20844;&#24179;&#24615;&#20877;&#21040;&#22238;&#26469;
&lt;/p&gt;
&lt;p&gt;
From Pseudorandomness to Multi-Group Fairness and Back. (arXiv:2301.08837v3 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08837
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#32034;&#20102;&#39044;&#27979;&#31639;&#27861;&#20013;&#22810;&#32452;&#20844;&#24179;&#24615;&#21644;&#20266;&#38543;&#26426;&#24615;&#30340;&#32852;&#31995;&#65292;&#25552;&#20379;&#20102;&#26032;&#30340;&#22810;&#26657;&#20934;&#31639;&#27861;&#21644;&#23454;&#20540;&#20989;&#25968;&#26680;&#24341;&#29702;&#35777;&#26126;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#39044;&#27979;&#31639;&#27861;&#20013;&#22810;&#32452;&#20844;&#24179;&#24615;&#21644;&#27844;&#38706;-&#38887;&#24615;&#21644;&#22270;&#24418;&#35268;&#21017;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#22312;&#19968;&#20123;&#21442;&#25968;&#33539;&#22260;&#20869;&#25552;&#20379;&#20102;&#26032;&#30340;&#22810;&#26657;&#20934;&#21644;&#23454;&#20540;&#20989;&#25968;&#26680;&#24341;&#29702;&#35777;&#26126;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We identify and explore connections between the recent literature on multi-group fairness for prediction algorithms and the pseudorandomness notions of leakage-resilience and graph regularity. We frame our investigation using new, statistical distance-based variants of multicalibration that are closely related to the concept of outcome indistinguishability. Adopting this perspective leads us naturally not only to our graph theoretic results, but also to new, more efficient algorithms for multicalibration in certain parameter regimes and a novel proof of a hardcore lemma for real-valued functions.
&lt;/p&gt;</description></item></channel></rss>