<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>XAI-CF&#26159;&#19968;&#20010;&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#65292;&#24212;&#29992;&#20110;&#32593;&#32476;&#21462;&#35777;&#39046;&#22495;&#65292;&#20197;&#35299;&#20915;&#22797;&#26434;&#32593;&#32476;&#35774;&#22791;&#21644;&#22823;&#37327;&#25968;&#25454;&#24102;&#26469;&#30340;&#25361;&#25112;&#65292;&#24182;&#30830;&#20445;&#19982;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#27807;&#36890;&#21644;&#27861;&#24459;&#26631;&#20934;&#30340;&#19968;&#33268;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.02452</link><description>&lt;p&gt;
XAI-CF -- &#25506;&#35752;&#21487;&#35299;&#37322;&#20154;&#24037;&#26234;&#33021;&#22312;&#32593;&#32476;&#21462;&#35777;&#20013;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
XAI-CF -- Examining the Role of Explainable Artificial Intelligence in Cyber Forensics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02452
&lt;/p&gt;
&lt;p&gt;
XAI-CF&#26159;&#19968;&#20010;&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#65292;&#24212;&#29992;&#20110;&#32593;&#32476;&#21462;&#35777;&#39046;&#22495;&#65292;&#20197;&#35299;&#20915;&#22797;&#26434;&#32593;&#32476;&#35774;&#22791;&#21644;&#22823;&#37327;&#25968;&#25454;&#24102;&#26469;&#30340;&#25361;&#25112;&#65292;&#24182;&#30830;&#20445;&#19982;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#27807;&#36890;&#21644;&#27861;&#24459;&#26631;&#20934;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22797;&#26434;&#32593;&#32476;&#35774;&#22791;&#30340;&#20852;&#36215;&#65292;&#32593;&#32476;&#21462;&#35777;&#65288;CF&#65289;&#38754;&#20020;&#30528;&#35768;&#22810;&#26032;&#30340;&#25361;&#25112;&#12290;&#20363;&#22914;&#65292;&#26234;&#33021;&#25163;&#26426;&#19978;&#36816;&#34892;&#30528;&#25968;&#21313;&#20010;&#31995;&#32479;&#65292;&#27599;&#20010;&#31995;&#32479;&#25317;&#26377;&#19978;&#30334;&#19975;&#20010;&#21487;&#19979;&#36733;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22312;&#36825;&#20040;&#24222;&#22823;&#30340;&#25968;&#25454;&#20013;&#36827;&#34892;&#31579;&#26597;&#24182;&#29702;&#35299;&#38656;&#35201;&#26032;&#30340;&#25216;&#26415;&#65292;&#20363;&#22914;&#26469;&#33258;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#30340;&#25216;&#26415;&#12290;&#35201;&#25104;&#21151;&#23558;&#36825;&#20123;&#25216;&#26415;&#24212;&#29992;&#20110;&#32593;&#32476;&#21462;&#35777;&#20013;&#65292;&#25105;&#20204;&#38656;&#35201;&#21521;&#32593;&#32476;&#21462;&#35777;&#30340;&#21033;&#30410;&#30456;&#20851;&#32773;&#65288;&#22914;&#21462;&#35777;&#20998;&#26512;&#24072;&#21644;&#27861;&#38498;&#25104;&#21592;&#65289;&#35777;&#26126;&#21644;&#35299;&#37322;&#32467;&#26524;&#65292;&#20197;&#20415;&#20182;&#20204;&#20570;&#20986;&#26126;&#26234;&#30340;&#20915;&#31574;&#12290;&#22914;&#26524;&#25105;&#20204;&#24819;&#25104;&#21151;&#22320;&#23558;&#20154;&#24037;&#26234;&#33021;&#24212;&#29992;&#20110;&#32593;&#32476;&#21462;&#35777;&#20013;&#65292;&#23601;&#38656;&#35201;&#23545;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#24314;&#31435;&#20449;&#20219;&#12290;&#25509;&#21463;&#22312;&#32593;&#32476;&#21462;&#35777;&#20013;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#30340;&#19968;&#20123;&#22240;&#32032;&#26159;&#20351;&#20154;&#24037;&#26234;&#33021;&#30495;&#23454;&#12289;&#21487;&#35299;&#37322;&#12289;&#21487;&#29702;&#35299;&#21644;&#20132;&#20114;&#12290;&#36825;&#26679;&#65292;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#23558;&#26356;&#23481;&#26131;&#34987;&#20844;&#20247;&#25509;&#21463;&#65292;&#24182;&#30830;&#20445;&#19982;&#27861;&#24459;&#26631;&#20934;&#20445;&#25345;&#19968;&#33268;&#12290;&#19968;&#20010;&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#65288;XAI&#65289;&#31995;&#32479;&#21487;&#20197;&#22312;&#32593;&#32476;&#21462;&#35777;&#20013;&#25285;&#24403;&#36825;&#20010;&#35282;&#33394;&#65292;&#25105;&#20204;&#23558;&#36825;&#26679;&#30340;&#31995;&#32479;&#31216;&#20026;XAI-CF&#12290;
&lt;/p&gt;
&lt;p&gt;
With the rise of complex cyber devices Cyber Forensics (CF) is facing many new challenges. For example, there are dozens of systems running on smartphones, each with more than millions of downloadable applications. Sifting through this large amount of data and making sense requires new techniques, such as from the field of Artificial Intelligence (AI). To apply these techniques successfully in CF, we need to justify and explain the results to the stakeholders of CF, such as forensic analysts and members of the court, for them to make an informed decision. If we want to apply AI successfully in CF, there is a need to develop trust in AI systems. Some other factors in accepting the use of AI in CF are to make AI authentic, interpretable, understandable, and interactive. This way, AI systems will be more acceptable to the public and ensure alignment with legal standards. An explainable AI (XAI) system can play this role in CF, and we call such a system XAI-CF. XAI-CF is indispensable and 
&lt;/p&gt;</description></item></channel></rss>