<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#36890;&#36807;&#37325;&#26032;&#21442;&#25968;&#21270;&#25193;&#25955;&#36807;&#31243;&#24182;&#30452;&#25509;&#20272;&#35745;&#22270;&#20687;&#21644;&#22122;&#22768;&#65292;&#26412;&#25991;&#25913;&#36827;&#20102;&#21435;&#22122;&#25193;&#25955;&#27169;&#22411;&#65292;&#25552;&#39640;&#20102;&#22270;&#20687;&#29983;&#25104;&#30340;&#36895;&#24230;&#21644;&#36136;&#37327;&#12290;</title><link>http://arxiv.org/abs/2310.17167</link><description>&lt;p&gt;
&#36890;&#36807;&#21516;&#26102;&#20272;&#35745;&#22270;&#20687;&#21644;&#22122;&#22768;&#25913;&#36827;&#21435;&#22122;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Improving Denoising Diffusion Models via Simultaneous Estimation of Image and Noise. (arXiv:2310.17167v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17167
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#37325;&#26032;&#21442;&#25968;&#21270;&#25193;&#25955;&#36807;&#31243;&#24182;&#30452;&#25509;&#20272;&#35745;&#22270;&#20687;&#21644;&#22122;&#22768;&#65292;&#26412;&#25991;&#25913;&#36827;&#20102;&#21435;&#22122;&#25193;&#25955;&#27169;&#22411;&#65292;&#25552;&#39640;&#20102;&#22270;&#20687;&#29983;&#25104;&#30340;&#36895;&#24230;&#21644;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#20004;&#20010;&#20851;&#38190;&#30340;&#36129;&#29486;&#65292;&#26088;&#22312;&#36890;&#36807;&#21453;&#21521;&#25193;&#25955;&#36807;&#31243;&#29983;&#25104;&#30340;&#22270;&#20687;&#30340;&#36895;&#24230;&#21644;&#36136;&#37327;&#12290;&#31532;&#19968;&#20010;&#36129;&#29486;&#26159;&#36890;&#36807;&#20197;&#22270;&#20687;&#21644;&#22122;&#22768;&#20043;&#38388;&#30340;&#22235;&#20998;&#20043;&#19968;&#22278;&#24359;&#19978;&#30340;&#35282;&#24230;&#37325;&#26032;&#21442;&#25968;&#21270;&#25193;&#25955;&#36807;&#31243;&#65292;&#29305;&#21035;&#26159;&#35774;&#32622;&#20256;&#32479;&#30340; $\displaystyle \sqrt{\bar{\alpha}}=\cos(\eta)$&#12290;&#36825;&#31181;&#37325;&#26032;&#21442;&#25968;&#21270;&#28040;&#38500;&#20102;&#20004;&#20010;&#22855;&#24322;&#28857;&#65292;&#24182;&#20801;&#35768;&#23558;&#25193;&#25955;&#28436;&#21270;&#34920;&#36798;&#20026;&#19968;&#20010;&#33391;&#22909;&#34892;&#20026;&#30340;&#24120;&#24494;&#20998;&#26041;&#31243;&#65288;ODE&#65289;&#12290;&#20174;&#32780;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#20351;&#29992;&#26356;&#39640;&#38454;&#30340;ODE&#27714;&#35299;&#22120;&#65292;&#22914;Runge-Kutta&#26041;&#27861;&#12290;&#31532;&#20108;&#20010;&#36129;&#29486;&#26159;&#30452;&#25509;&#20351;&#29992;&#25105;&#20204;&#30340;&#32593;&#32476;&#20272;&#35745;&#22270;&#20687;&#65288;$\mathbf{x}_0$&#65289;&#21644;&#22122;&#22768;&#65288;$\mathbf{\epsilon}$&#65289;&#65292;&#36825;&#20351;&#24471;&#36870;&#21521;&#25193;&#25955;&#36807;&#31243;&#20013;&#30340;&#26356;&#26032;&#27493;&#39588;&#35745;&#31639;&#26356;&#21152;&#31283;&#23450;&#65292;&#22240;&#20026;&#22312;&#36807;&#31243;&#30340;&#19981;&#21516;&#38454;&#27573;&#20934;&#30830;&#20272;&#35745;&#22270;&#20687;&#21644;&#22122;&#22768;&#37117;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#22312;&#36825;&#20123;&#21464;&#21270;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#23454;&#29616;&#20102;...
&lt;/p&gt;
&lt;p&gt;
This paper introduces two key contributions aimed at improving the speed and quality of images generated through inverse diffusion processes. The first contribution involves reparameterizing the diffusion process in terms of the angle on a quarter-circular arc between the image and noise, specifically setting the conventional $\displaystyle \sqrt{\bar{\alpha}}=\cos(\eta)$. This reparameterization eliminates two singularities and allows for the expression of diffusion evolution as a well-behaved ordinary differential equation (ODE). In turn, this allows higher order ODE solvers such as Runge-Kutta methods to be used effectively. The second contribution is to directly estimate both the image ($\mathbf{x}_0$) and noise ($\mathbf{\epsilon}$) using our network, which enables more stable calculations of the update step in the inverse diffusion steps, as accurate estimation of both the image and noise are crucial at different stages of the process. Together with these changes, our model achie
&lt;/p&gt;</description></item></channel></rss>