<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23545;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#24182;&#20998;&#26512;&#20102;&#32844;&#19994;&#23545;LLM&#33021;&#21147;&#30340;&#26292;&#38706;&#31243;&#24230;&#21450;&#20854;&#19982;&#24037;&#36164;&#27700;&#24179;&#21644;&#32463;&#39564;&#28322;&#20215;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#39640;&#34218;&#21644;&#32463;&#39564;&#23494;&#38598;&#22411;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#26367;&#20195;&#39118;&#38505;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#34892;&#19994;&#26292;&#38706;&#30340;&#32463;&#27982;&#22686;&#38271;&#27169;&#22411;&#65292;&#20197;&#37327;&#21270;AI&#37319;&#29992;&#23545;&#29983;&#20135;&#21147;&#21644;&#23601;&#19994;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#29702;&#35299;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#20013;&#36234;&#26469;&#36234;&#24378;&#22823;&#30340;AI&#31995;&#32479;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2308.08776</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Large Language Models at Work in China's Labor Market. (arXiv:2308.08776v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23545;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#24182;&#20998;&#26512;&#20102;&#32844;&#19994;&#23545;LLM&#33021;&#21147;&#30340;&#26292;&#38706;&#31243;&#24230;&#21450;&#20854;&#19982;&#24037;&#36164;&#27700;&#24179;&#21644;&#32463;&#39564;&#28322;&#20215;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#39640;&#34218;&#21644;&#32463;&#39564;&#23494;&#38598;&#22411;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#26367;&#20195;&#39118;&#38505;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#34892;&#19994;&#26292;&#38706;&#30340;&#32463;&#27982;&#22686;&#38271;&#27169;&#22411;&#65292;&#20197;&#37327;&#21270;AI&#37319;&#29992;&#23545;&#29983;&#20135;&#21147;&#21644;&#23601;&#19994;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#29702;&#35299;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#20013;&#36234;&#26469;&#36234;&#24378;&#22823;&#30340;AI&#31995;&#32479;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23545;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#32467;&#21512;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#21644;LLM&#20998;&#31867;&#65292;&#25353;&#29031;Eloundou&#31561;&#20154;&#65288;2023&#65289;&#30340;&#26041;&#27861;&#20998;&#26512;&#20102;&#32844;&#19994;&#23545;LLM&#33021;&#21147;&#30340;&#26292;&#38706;&#31243;&#24230;&#12290;&#28982;&#21518;&#23558;&#32844;&#19994;&#26292;&#38706;&#31243;&#24230;&#32858;&#21512;&#21040;&#34892;&#19994;&#27700;&#24179;&#19978;&#65292;&#24471;&#21040;&#34892;&#19994;&#26292;&#38706;&#24471;&#20998;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#32844;&#19994;&#26292;&#38706;&#21644;&#24037;&#36164;&#27700;&#24179;/&#32463;&#39564;&#28322;&#20215;&#20043;&#38388;&#23384;&#22312;&#27491;&#30456;&#20851;&#20851;&#31995;&#65292;&#34920;&#26126;&#39640;&#34218;&#21644;&#32463;&#39564;&#23494;&#38598;&#22411;&#30340;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#30528;LLM&#39537;&#21160;&#36719;&#20214;&#30340;&#26356;&#22823;&#26367;&#20195;&#39118;&#38505;&#12290;&#34892;&#19994;&#26292;&#38706;&#24471;&#20998;&#19982;&#19987;&#23478;&#35780;&#20272;&#21644;&#32463;&#27982;&#30452;&#35273;&#30456;&#19968;&#33268;&#12290;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#34892;&#19994;&#26292;&#38706;&#30340;&#32463;&#27982;&#22686;&#38271;&#27169;&#22411;&#65292;&#20197;&#37327;&#21270;AI&#37319;&#29992;&#24102;&#26469;&#30340;&#29983;&#20135;&#21147;&#21644;&#23601;&#19994;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#24635;&#20307;&#26469;&#35828;&#65292;&#26412;&#30740;&#31350;&#20026;&#29702;&#35299;&#20013;&#22269;&#36234;&#26469;&#36234;&#24378;&#22823;&#30340;AI&#31995;&#32479;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#20998;&#26512;&#22522;&#30784;&#12290;&#20027;&#35201;&#21019;&#26032;&#21253;&#25324;&#32844;&#19994;&#27700;&#24179;&#30340;&#26292;&#38706;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper explores the potential impacts of large language models (LLMs) on the Chinese labor market. We analyze occupational exposure to LLM capabilities by incorporating human expertise and LLM classifications, following Eloundou et al. (2023)'s methodology. We then aggregate occupation exposure to the industry level to obtain industry exposure scores. The results indicate a positive correlation between occupation exposure and wage levels/experience premiums, suggesting higher-paying and experience-intensive jobs may face greater displacement risks from LLM-powered software. The industry exposure scores align with expert assessments and economic intuitions. We also develop an economic growth model incorporating industry exposure to quantify the productivity-employment trade-off from AI adoption. Overall, this study provides an analytical basis for understanding the labor market impacts of increasingly capable AI systems in China. Key innovations include the occupation-level exposure
&lt;/p&gt;</description></item></channel></rss>