<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;PoisonedRAG&#30340;&#30693;&#35782;&#27745;&#26579;&#25915;&#20987;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#36827;&#34892;&#25915;&#20987;&#21644;&#30772;&#22351;&#12290;</title><link>https://arxiv.org/abs/2402.07867</link><description>&lt;p&gt;
PoisonedRAG: &#30693;&#35782;&#27745;&#26579;&#25915;&#20987;&#23545;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
PoisonedRAG: Knowledge Poisoning Attacks to Retrieval-Augmented Generation of Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07867
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;PoisonedRAG&#30340;&#30693;&#35782;&#27745;&#26579;&#25915;&#20987;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#36827;&#34892;&#25915;&#20987;&#21644;&#30772;&#22351;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30001;&#20110;&#20854;&#21331;&#36234;&#30340;&#29983;&#25104;&#33021;&#21147;&#32780;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25104;&#21151;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#23427;&#20204;&#20063;&#23384;&#22312;&#22266;&#26377;&#30340;&#23616;&#38480;&#24615;&#65292;&#22914;&#32570;&#20047;&#26368;&#26032;&#30340;&#30693;&#35782;&#21644;&#34394;&#26500;&#12290;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#65288;RAG&#65289;&#26159;&#19968;&#31181;&#26368;&#20808;&#36827;&#30340;&#25216;&#26415;&#65292;&#20197;&#20943;&#36731;&#36825;&#20123;&#38480;&#21046;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23545;&#20110;&#32473;&#23450;&#30340;&#38382;&#39064;&#65292;RAG&#20174;&#30693;&#35782;&#25968;&#25454;&#24211;&#20013;&#26816;&#32034;&#30456;&#20851;&#30693;&#35782;&#65292;&#20197;&#22686;&#24378;LLM&#30340;&#36755;&#20837;&#12290;&#20363;&#22914;&#65292;&#24403;&#30693;&#35782;&#25968;&#25454;&#24211;&#20013;&#21253;&#21547;&#20174;&#32500;&#22522;&#30334;&#31185;&#25910;&#38598;&#30340;&#25968;&#30334;&#19975;&#20010;&#25991;&#26412;&#26102;&#65292;&#26816;&#32034;&#21040;&#30340;&#30693;&#35782;&#21487;&#20197;&#26159;&#19982;&#32473;&#23450;&#38382;&#39064;&#22312;&#35821;&#20041;&#19978;&#26368;&#30456;&#20284;&#30340;&#21069;K&#20010;&#25991;&#26412;&#38598;&#12290;&#22240;&#27492;&#65292;LLM&#21487;&#20197;&#21033;&#29992;&#26816;&#32034;&#21040;&#30340;&#30693;&#35782;&#20316;&#20026;&#19978;&#19979;&#25991;&#20026;&#32473;&#23450;&#38382;&#39064;&#29983;&#25104;&#31572;&#26696;&#12290;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#25913;&#21892;RAG&#30340;&#20934;&#30830;&#24615;&#25110;&#25928;&#29575;&#65292;&#32780;&#23545;&#20854;&#23433;&#20840;&#24615;&#30340;&#25506;&#32034;&#36739;&#23569;&#12290;&#25105;&#20204;&#26088;&#22312;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models (LLMs) have achieved remarkable success due to their exceptional generative capabilities. Despite their success, they also have inherent limitations such as a lack of up-to-date knowledge and hallucination. Retrieval-Augmented Generation (RAG) is a state-of-the-art technique to mitigate those limitations. In particular, given a question, RAG retrieves relevant knowledge from a knowledge database to augment the input of the LLM. For instance, the retrieved knowledge could be a set of top-k texts that are most semantically similar to the given question when the knowledge database contains millions of texts collected from Wikipedia. As a result, the LLM could utilize the retrieved knowledge as the context to generate an answer for the given question. Existing studies mainly focus on improving the accuracy or efficiency of RAG, leaving its security largely unexplored. We aim to bridge the gap in this work. Particularly, we propose PoisonedRAG , a set of knowledge pois
&lt;/p&gt;</description></item></channel></rss>