<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>FairEHR-CLP&#26159;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#21033;&#29992;&#23545;&#27604;&#23398;&#20064;&#65292;&#36890;&#36807;&#29983;&#25104;&#24739;&#32773;&#30340;&#21512;&#25104;&#23545;&#24212;&#26469;&#23454;&#29616;&#22810;&#26679;&#21270;&#30340;&#20154;&#21475;&#32479;&#35745;&#36523;&#20221;&#65292;&#24182;&#21033;&#29992;&#20844;&#24179;&#24863;&#30693;&#39044;&#27979;&#26041;&#27861;&#28040;&#38500;EHR&#20013;&#30340;&#31038;&#20250;&#20559;&#35265;&#12290;</title><link>https://rss.arxiv.org/abs/2402.00955</link><description>&lt;p&gt;
FairEHR-CLP&#65306;&#20197;&#23545;&#27604;&#23398;&#20064;&#23454;&#29616;&#30340;&#20844;&#24179;&#24863;&#30693;&#22810;&#27169;&#24577;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#30340;&#20020;&#24202;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
FairEHR-CLP: Towards Fairness-Aware Clinical Predictions with Contrastive Learning in Multimodal Electronic Health Records
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.00955
&lt;/p&gt;
&lt;p&gt;
FairEHR-CLP&#26159;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#21033;&#29992;&#23545;&#27604;&#23398;&#20064;&#65292;&#36890;&#36807;&#29983;&#25104;&#24739;&#32773;&#30340;&#21512;&#25104;&#23545;&#24212;&#26469;&#23454;&#29616;&#22810;&#26679;&#21270;&#30340;&#20154;&#21475;&#32479;&#35745;&#36523;&#20221;&#65292;&#24182;&#21033;&#29992;&#20844;&#24179;&#24863;&#30693;&#39044;&#27979;&#26041;&#27861;&#28040;&#38500;EHR&#20013;&#30340;&#31038;&#20250;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#20013;&#65292;&#30830;&#20445;&#39044;&#27979;&#27169;&#22411;&#30340;&#20844;&#24179;&#24615;&#33267;&#20851;&#37325;&#35201;&#12290;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#65288;EHR&#65289;&#24050;&#25104;&#20026;&#21307;&#30103;&#20915;&#31574;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#28982;&#32780;&#29616;&#26377;&#30340;&#22686;&#24378;&#27169;&#22411;&#20844;&#24179;&#24615;&#30340;&#26041;&#27861;&#20165;&#38480;&#20110;&#21333;&#27169;&#24577;&#25968;&#25454;&#65292;&#24182;&#26410;&#35299;&#20915;EHR&#20013;&#19982;&#20154;&#21475;&#32479;&#35745;&#22240;&#32032;&#20132;&#32455;&#22312;&#19968;&#36215;&#30340;&#22810;&#26041;&#38754;&#31038;&#20250;&#20559;&#35265;&#12290;&#20026;&#20102;&#20943;&#36731;&#36825;&#20123;&#20559;&#35265;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;FairEHR-CLP&#65306;&#19968;&#31181;&#20844;&#24179;&#24863;&#30693;&#20020;&#24202;&#39044;&#27979;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#22312;EHR&#20013;&#36827;&#34892;&#25805;&#20316;&#12290;FairEHR-CLP&#36890;&#36807;&#20004;&#20010;&#38454;&#27573;&#30340;&#36807;&#31243;&#25805;&#20316;&#65292;&#21033;&#29992;&#24739;&#32773;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#12289;&#32437;&#21521;&#25968;&#25454;&#21644;&#20020;&#24202;&#35760;&#24405;&#12290;&#39318;&#20808;&#65292;&#20026;&#27599;&#20010;&#24739;&#32773;&#29983;&#25104;&#21512;&#25104;&#23545;&#24212;&#26469;&#23454;&#29616;&#22810;&#26679;&#21270;&#30340;&#20154;&#21475;&#32479;&#35745;&#36523;&#20221;&#65292;&#21516;&#26102;&#20445;&#30041;&#24517;&#35201;&#30340;&#20581;&#24247;&#20449;&#24687;&#12290;&#20854;&#27425;&#65292;&#20844;&#24179;&#24863;&#30693;&#39044;&#27979;&#21033;&#29992;&#23545;&#27604;&#23398;&#20064;&#23558;&#24739;&#32773;&#30340;&#34920;&#31034;&#22312;&#25935;&#24863;&#23646;&#24615;&#19978;&#36827;&#34892;&#23545;&#40784;&#65292;&#19982;&#20855;&#26377;softmax&#23618;&#30340;MLP&#20998;&#31867;&#22120;&#20849;&#21516;&#20248;&#21270;&#29992;&#20110;&#20020;&#24202;&#20998;&#31867;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the high-stakes realm of healthcare, ensuring fairness in predictive models is crucial. Electronic Health Records (EHRs) have become integral to medical decision-making, yet existing methods for enhancing model fairness restrict themselves to unimodal data and fail to address the multifaceted social biases intertwined with demographic factors in EHRs. To mitigate these biases, we present FairEHR-CLP: a general framework for Fairness-aware Clinical Predictions with Contrastive Learning in EHRs. FairEHR-CLP operates through a two-stage process, utilizing patient demographics, longitudinal data, and clinical notes. First, synthetic counterparts are generated for each patient, allowing for diverse demographic identities while preserving essential health information. Second, fairness-aware predictions employ contrastive learning to align patient representations across sensitive attributes, jointly optimized with an MLP classifier with a softmax layer for clinical classification tasks. Ac
&lt;/p&gt;</description></item></channel></rss>