<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;Partial Mean Behavior Poisson (PMBP)&#36807;&#31243;&#65292;&#23427;&#26159;&#19968;&#31181;&#26032;&#30340;&#28857;&#36807;&#31243;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#24314;&#27169;&#26102;&#38388;&#25139;&#21644;&#21306;&#38388;&#23631;&#34109;&#25968;&#25454;&#65292;&#24182;&#25104;&#21151;&#24674;&#22797;&#20102;MHP&#21442;&#25968;&#21644;&#35889;&#21322;&#24452;&#12290;</title><link>http://arxiv.org/abs/2111.02062</link><description>&lt;p&gt;
&#36328;&#25968;&#25454;&#31890;&#24230;&#38142;&#25509;&#65306;&#25311;&#21512;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#21040;&#37096;&#20998;&#21306;&#38388;&#23631;&#34109;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Linking Across Data Granularity: Fitting Multivariate Hawkes Processes to Partially Interval-Censored Data. (arXiv:2111.02062v3 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.02062
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;Partial Mean Behavior Poisson (PMBP)&#36807;&#31243;&#65292;&#23427;&#26159;&#19968;&#31181;&#26032;&#30340;&#28857;&#36807;&#31243;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#24314;&#27169;&#26102;&#38388;&#25139;&#21644;&#21306;&#38388;&#23631;&#34109;&#25968;&#25454;&#65292;&#24182;&#25104;&#21151;&#24674;&#22797;&#20102;MHP&#21442;&#25968;&#21644;&#35889;&#21322;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;(MHP)&#34987;&#24191;&#27867;&#29992;&#20110;&#20998;&#26512;&#30456;&#20114;&#20316;&#29992;&#30340;&#25968;&#25454;&#27969;&#65292;&#20854;&#20013;&#20107;&#20214;&#22312;&#33258;&#36523;&#32500;&#24230;&#20869;&#65288;&#36890;&#36807;&#33258;&#28608;&#65289;&#25110;&#19981;&#21516;&#32500;&#24230;&#20043;&#38388;&#65288;&#36890;&#36807;&#20132;&#21449;&#28608;&#21457;&#65289;&#29983;&#25104;&#26032;&#20107;&#20214;&#12290;&#28982;&#32780;&#65292;&#22312;&#26576;&#20123;&#24212;&#29992;&#20013;&#65292;&#26576;&#20123;&#32500;&#24230;&#20013;&#30340;&#20010;&#21035;&#20107;&#20214;&#26102;&#38388;&#25139;&#26159;&#19981;&#21487;&#35266;&#27979;&#30340;&#65292;&#21482;&#26377;&#22312;&#26102;&#38388;&#38388;&#38548;&#20869;&#30340;&#20107;&#20214;&#35745;&#25968;&#26159;&#24050;&#30693;&#30340;&#65292;&#34987;&#31216;&#20026;&#37096;&#20998;&#21306;&#38388;&#23631;&#34109;&#25968;&#25454;&#12290;MHP&#19981;&#36866;&#29992;&#20110;&#22788;&#29702;&#36825;&#31181;&#25968;&#25454;&#65292;&#22240;&#20026;&#20854;&#20272;&#35745;&#38656;&#35201;&#20107;&#20214;&#26102;&#38388;&#25139;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Partial Mean Behavior Poisson (PMBP)&#36807;&#31243;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#28857;&#36807;&#31243;&#65292;&#19982;MHP&#20849;&#20139;&#21442;&#25968;&#31561;&#25928;&#24615;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#24314;&#27169;&#26102;&#38388;&#25139;&#21644;&#21306;&#38388;&#23631;&#34109;&#25968;&#25454;&#12290;&#25105;&#20204;&#20351;&#29992;&#21512;&#25104;&#21644;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#23637;&#31034;&#20102;PMBP&#36807;&#31243;&#30340;&#33021;&#21147;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;PMBP&#36807;&#31243;&#21487;&#20197;&#36817;&#20284;MHP&#21442;&#25968;&#24182;&#24674;&#22797;&#35889;&#21322;&#24452;&#65292;&#20351;&#29992;&#21512;&#25104;&#20107;&#20214;&#21382;&#21490;&#25968;&#25454;&#36827;&#34892;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
The multivariate Hawkes process (MHP) is widely used for analyzing data streams that interact with each other, where events generate new events within their own dimension (via self-excitation) or across different dimensions (via cross-excitation). However, in certain applications, the timestamps of individual events in some dimensions are unobservable, and only event counts within intervals are known, referred to as partially interval-censored data. The MHP is unsuitable for handling such data since its estimation requires event timestamps. In this study, we introduce the Partial Mean Behavior Poisson (PMBP) process, a novel point process which shares parameter equivalence with the MHP and can effectively model both timestamped and interval-censored data. We demonstrate the capabilities of the PMBP process using synthetic and real-world datasets. Firstly, we illustrate that the PMBP process can approximate MHP parameters and recover the spectral radius using synthetic event histories. 
&lt;/p&gt;</description></item></channel></rss>