<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#37325;&#26032;&#23454;&#29616;&#21644;&#35780;&#20272;&#20102;18&#20010;&#20195;&#34920;&#24615;&#30340;&#36807;&#21435;&#30740;&#31350;&#65292;&#24182;&#22312;&#21253;&#21547;124,000&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#24179;&#34913;&#12289;&#30456;&#20851;&#21644;&#26368;&#26032;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#26032;&#23454;&#39564;&#65292;&#21457;&#29616;&#20165;&#36890;&#36807;&#38745;&#24577;&#20998;&#26512;&#25552;&#21462;&#30340;&#29305;&#24449;&#23601;&#33021;&#23454;&#29616;&#39640;&#36798;96.8%&#30340;&#24694;&#24847;&#36719;&#20214;&#26816;&#27979;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2301.12778</link><description>&lt;p&gt;
&#25506;&#31350;&#23433;&#21331;&#24694;&#24847;&#36719;&#20214;&#26816;&#27979;&#20013;&#30340;&#29305;&#24449;&#21644;&#27169;&#22411;&#37325;&#35201;&#24615;&#65306;&#19968;&#39033;&#23454;&#26045;&#35843;&#26597;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23454;&#39564;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
Investigating Feature and Model Importance in Android Malware Detection: An Implemented Survey and Experimental Comparison of ML-Based Methods
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2301.12778
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23454;&#29616;&#21644;&#35780;&#20272;&#20102;18&#20010;&#20195;&#34920;&#24615;&#30340;&#36807;&#21435;&#30740;&#31350;&#65292;&#24182;&#22312;&#21253;&#21547;124,000&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#24179;&#34913;&#12289;&#30456;&#20851;&#21644;&#26368;&#26032;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#26032;&#23454;&#39564;&#65292;&#21457;&#29616;&#20165;&#36890;&#36807;&#38745;&#24577;&#20998;&#26512;&#25552;&#21462;&#30340;&#29305;&#24449;&#23601;&#33021;&#23454;&#29616;&#39640;&#36798;96.8%&#30340;&#24694;&#24847;&#36719;&#20214;&#26816;&#27979;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Android&#30340;&#26222;&#21450;&#24847;&#21619;&#30528;&#23427;&#25104;&#20026;&#24694;&#24847;&#36719;&#20214;&#30340;&#24120;&#35265;&#30446;&#26631;&#12290;&#22810;&#24180;&#26469;&#65292;&#21508;&#31181;&#30740;&#31350;&#21457;&#29616;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#33021;&#22815;&#26377;&#25928;&#21306;&#20998;&#24694;&#24847;&#36719;&#20214;&#21644;&#33391;&#24615;&#24212;&#29992;&#31243;&#24207;&#12290;&#28982;&#32780;&#65292;&#38543;&#30528;&#25805;&#20316;&#31995;&#32479;&#30340;&#28436;&#36827;&#65292;&#24694;&#24847;&#36719;&#20214;&#20063;&#22312;&#19981;&#26029;&#21457;&#23637;&#65292;&#23545;&#20808;&#21069;&#30740;&#31350;&#30340;&#21457;&#29616;&#25552;&#20986;&#20102;&#36136;&#30097;&#65292;&#20854;&#20013;&#35768;&#22810;&#25253;&#21578;&#31216;&#20351;&#29992;&#23567;&#22411;&#12289;&#36807;&#26102;&#19988;&#32463;&#24120;&#19981;&#24179;&#34913;&#30340;&#25968;&#25454;&#38598;&#33021;&#22815;&#33719;&#24471;&#38750;&#24120;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#37325;&#26032;&#23454;&#29616;&#20102;18&#39033;&#20855;&#20195;&#34920;&#24615;&#30340;&#36807;&#21435;&#30740;&#31350;&#24182;&#20351;&#29992;&#21253;&#25324;124,000&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#24179;&#34913;&#12289;&#30456;&#20851;&#19988;&#26368;&#26032;&#30340;&#25968;&#25454;&#38598;&#23545;&#23427;&#20204;&#36827;&#34892;&#37325;&#26032;&#35780;&#20272;&#12290;&#25105;&#20204;&#36824;&#36827;&#34892;&#20102;&#26032;&#30340;&#23454;&#39564;&#65292;&#20197;&#22635;&#34917;&#29616;&#26377;&#30693;&#35782;&#20013;&#30340;&#31354;&#30333;&#65292;&#24182;&#21033;&#29992;&#30740;&#31350;&#32467;&#26524;&#30830;&#23450;&#22312;&#24403;&#20195;&#29615;&#22659;&#20013;&#29992;&#20110;&#23433;&#21331;&#24694;&#24847;&#36719;&#20214;&#26816;&#27979;&#30340;&#26368;&#26377;&#25928;&#29305;&#24449;&#21644;&#27169;&#22411;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#20165;&#36890;&#36807;&#38745;&#24577;&#20998;&#26512;&#25552;&#21462;&#30340;&#29305;&#24449;&#21363;&#21487;&#23454;&#29616;&#39640;&#36798;96.8%&#30340;&#26816;&#27979;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2301.12778v2 Announce Type: replace  Abstract: The popularity of Android means it is a common target for malware. Over the years, various studies have found that machine learning models can effectively discriminate malware from benign applications. However, as the operating system evolves, so does malware, bringing into question the findings of these previous studies, many of which report very high accuracies using small, outdated, and often imbalanced datasets. In this paper, we reimplement 18 representative past works and reevaluate them using a balanced, relevant, and up-to-date dataset comprising 124,000 applications. We also carry out new experiments designed to fill holes in existing knowledge, and use our findings to identify the most effective features and models to use for Android malware detection within a contemporary environment. We show that high detection accuracies (up to 96.8%) can be achieved using features extracted through static analysis alone, yielding a mode
&lt;/p&gt;</description></item></channel></rss>