<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>UDEEP&#26159;&#19968;&#20010;&#22522;&#20110;&#36793;&#32536;&#35745;&#31639;&#26426;&#35270;&#35273;&#30340;&#24179;&#21488;&#65292;&#21487;&#20197;&#24110;&#21161;&#35299;&#20915;&#20837;&#20405;&#20449;&#21495;&#40857;&#34430;&#21644;&#24223;&#24323;&#22609;&#26009;&#23545;&#27700;&#29983;&#29983;&#24577;&#31995;&#32479;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2401.06157</link><description>&lt;p&gt;
UDEEP: &#22522;&#20110;&#36793;&#32536;&#30340;&#27700;&#19979;&#20449;&#21495;&#40857;&#34430;&#21644;&#22609;&#26009;&#26816;&#27979;&#30340;&#35745;&#31639;&#26426;&#35270;&#35273;
&lt;/p&gt;
&lt;p&gt;
UDEEP: Edge-based Computer Vision for In-Situ Underwater Crayfish and Plastic Detection. (arXiv:2401.06157v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06157
&lt;/p&gt;
&lt;p&gt;
UDEEP&#26159;&#19968;&#20010;&#22522;&#20110;&#36793;&#32536;&#35745;&#31639;&#26426;&#35270;&#35273;&#30340;&#24179;&#21488;&#65292;&#21487;&#20197;&#24110;&#21161;&#35299;&#20915;&#20837;&#20405;&#20449;&#21495;&#40857;&#34430;&#21644;&#24223;&#24323;&#22609;&#26009;&#23545;&#27700;&#29983;&#29983;&#24577;&#31995;&#32479;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20837;&#20405;&#30340;&#20449;&#21495;&#40857;&#34430;&#23545;&#29983;&#24577;&#31995;&#32479;&#36896;&#25104;&#20102;&#19981;&#21033;&#24433;&#21709;&#12290;&#23427;&#20204;&#20256;&#25773;&#20102;&#23545;&#33521;&#22269;&#21807;&#19968;&#30340;&#26412;&#22320;&#30333;&#29226;&#40857;&#34430;&#33268;&#21629;&#30340;&#30495;&#33740;&#22411;&#40857;&#34430;&#30239;&#30123;&#30149;(Aphanomyces astaci)&#12290;&#20837;&#20405;&#30340;&#20449;&#21495;&#40857;&#34430;&#24191;&#27867;&#25366;&#25496;&#27934;&#31348;&#65292;&#30772;&#22351;&#26646;&#24687;&#22320;&#65292;&#20405;&#34432;&#27827;&#23736;&#24182;&#23545;&#27700;&#36136;&#20135;&#29983;&#19981;&#21033;&#24433;&#21709;&#65292;&#21516;&#26102;&#31454;&#20105;&#26412;&#22320;&#29289;&#31181;&#30340;&#36164;&#28304;&#24182;&#23548;&#33268;&#26412;&#22320;&#31181;&#32676;&#19979;&#38477;&#12290;&#27492;&#22806;&#65292;&#27745;&#26579;&#20063;&#20351;&#30333;&#29226;&#40857;&#34430;&#26356;&#21152;&#23481;&#26131;&#21463;&#21040;&#25439;&#23475;&#65292;&#20854;&#31181;&#32676;&#22312;&#33521;&#22269;&#26576;&#20123;&#22320;&#21306;&#19979;&#38477;&#36229;&#36807;90&#65285;&#65292;&#20351;&#20854;&#26497;&#26131;&#28626;&#20020;&#28781;&#32477;&#12290;&#20026;&#20102;&#20445;&#25252;&#27700;&#29983;&#29983;&#24577;&#31995;&#32479;&#65292;&#35299;&#20915;&#20837;&#20405;&#29289;&#31181;&#21644;&#24223;&#24323;&#22609;&#26009;&#23545;&#33521;&#22269;&#27827;&#27969;&#29983;&#24577;&#31995;&#32479;&#30340;&#25361;&#25112;&#33267;&#20851;&#37325;&#35201;&#12290;UDEEP&#24179;&#21488;&#21487;&#20197;&#36890;&#36807;&#23454;&#26102;&#20998;&#31867;&#20449;&#21495;&#40857;&#34430;&#21644;&#22609;&#26009;&#30862;&#29255;&#65292;&#20805;&#24403;&#29615;&#22659;&#30417;&#27979;&#30340;&#20851;&#38190;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
Invasive signal crayfish have a detrimental impact on ecosystems. They spread the fungal-type crayfish plague disease (Aphanomyces astaci) that is lethal to the native white clawed crayfish, the only native crayfish species in Britain. Invasive signal crayfish extensively burrow, causing habitat destruction, erosion of river banks and adverse changes in water quality, while also competing with native species for resources and leading to declines in native populations. Moreover, pollution exacerbates the vulnerability of White-clawed crayfish, with their populations declining by over 90% in certain English counties, making them highly susceptible to extinction. To safeguard aquatic ecosystems, it is imperative to address the challenges posed by invasive species and discarded plastics in the United Kingdom's river ecosystem's. The UDEEP platform can play a crucial role in environmental monitoring by performing on-the-fly classification of Signal crayfish and plastic debris while leveragi
&lt;/p&gt;</description></item></channel></rss>