<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#21033;&#29992;&#36947;&#24503;&#20154;&#24037;&#26234;&#33021;&#21407;&#21017;&#21644;&#25351;&#21335;&#26469;&#35299;&#20915;&#39640;&#32423;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#27835;&#29702;&#21644;&#21033;&#29992;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.10745</link><description>&lt;p&gt;
&#23545;&#39640;&#32423;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#27835;&#29702;&#21644;&#21033;&#29992;&#30340;&#36947;&#24503;&#20154;&#24037;&#26234;&#33021;&#21407;&#21017;&#21644;&#25351;&#21335;
&lt;/p&gt;
&lt;p&gt;
Ethical Artificial Intelligence Principles and Guidelines for the Governance and Utilization of Highly Advanced Large Language Models. (arXiv:2401.10745v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10745
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#21033;&#29992;&#36947;&#24503;&#20154;&#24037;&#26234;&#33021;&#21407;&#21017;&#21644;&#25351;&#21335;&#26469;&#35299;&#20915;&#39640;&#32423;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#27835;&#29702;&#21644;&#21033;&#29992;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;ChatGPT&#12289;LaMDA&#21644;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#25104;&#21151;&#65292;&#25216;&#26415;&#34892;&#19994;&#21644;&#20854;&#20182;&#34892;&#19994;&#23545;LLMs&#30340;&#24320;&#21457;&#21644;&#20351;&#29992;&#26377;&#25152;&#22686;&#21152;&#12290;&#34429;&#28982;LLMs&#30340;&#27700;&#24179;&#23578;&#26410;&#36229;&#36807;&#20154;&#31867;&#26234;&#33021;&#65292;&#20294;&#24635;&#26377;&#19968;&#22825;&#20250;&#36798;&#21040;&#36825;&#19968;&#28857;&#12290;&#36825;&#31181;LLMs&#21487;&#20197;&#31216;&#20026;&#39640;&#32423;LLMs&#12290;&#30446;&#21069;&#65292;&#30001;&#20110;&#23578;&#26410;&#36798;&#21040;&#36825;&#19968;&#28857;&#65292;&#20351;&#29992;&#36947;&#24503;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21407;&#21017;&#21644;&#25351;&#21335;&#26469;&#35299;&#20915;&#39640;&#32423;LLMs&#30340;&#38382;&#39064;&#36824;&#21463;&#21040;&#38480;&#21046;&#12290;&#28982;&#32780;&#65292;&#36825;&#26159;&#19968;&#20010;&#38382;&#39064;&#65292;&#22240;&#20026;&#19968;&#26086;&#36798;&#21040;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#23558;&#26080;&#27861;&#20805;&#20998;&#20934;&#22791;&#22909;&#20197;&#36947;&#24503;&#21644;&#26368;&#20339;&#26041;&#24335;&#22788;&#29702;&#20854;&#20135;&#29983;&#30340;&#21518;&#26524;&#65292;&#36825;&#23558;&#23548;&#33268;&#19981;&#21487;&#39044;&#26399;&#30340;&#21518;&#26524;&#12290;&#26412;&#25991;&#35752;&#35770;&#20102;&#22914;&#20309;&#21033;&#29992;&#36947;&#24503;&#20154;&#24037;&#26234;&#33021;&#21407;&#21017;&#21644;&#25351;&#21335;&#26469;&#35299;&#20915;&#39640;&#32423;LLMs&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given the success of ChatGPT, LaMDA and other large language models (LLMs), there has been an increase in development and usage of LLMs within the technology sector and other sectors. While the level in which LLMs has not reached a level where it has surpassed human intelligence, there will be a time when it will. Such LLMs can be referred to as advanced LLMs. Currently, there are limited usage of ethical artificial intelligence (AI) principles and guidelines addressing advanced LLMs due to the fact that we have not reached that point yet. However, this is a problem as once we do reach that point, we will not be adequately prepared to deal with the aftermath of it in an ethical and optimal way, which will lead to undesired and unexpected consequences. This paper addresses this issue by discussing what ethical AI principles and guidelines can be used to address highly advanced LLMs.
&lt;/p&gt;</description></item><item><title>&#24037;&#19994;&#30028;&#30340;&#30740;&#31350;&#22242;&#38431;&#22312;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#20013;&#26377;&#26356;&#39640;&#30340;&#20851;&#27880;&#24230;&#21644;&#24341;&#29992;&#29575;&#65292;&#19988;&#26356;&#26377;&#21487;&#33021;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#27169;&#22411;&#12290;&#32780;&#23398;&#26415;&#30028;&#30340;&#22242;&#38431;&#21017;&#26356;&#20542;&#21521;&#20110;&#20135;&#29983;&#20855;&#26377;&#26356;&#39640;&#31243;&#24230;&#21019;&#26032;&#30340;&#24037;&#20316;&#65292;&#20986;&#29616;&#38750;&#24120;&#19981;&#23547;&#24120;&#21644;&#20856;&#22411;&#30340;&#35770;&#25991;&#12290;&#36825;&#31181;&#24433;&#21709;&#21147;-&#21019;&#26032;&#24230;&#20248;&#21183;&#22312;&#19981;&#21516;&#39046;&#22495;&#12289;&#22242;&#38431;&#35268;&#27169;&#12289;&#36164;&#21382;&#21644;&#22768;&#26395;&#19979;&#22343;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2401.10268</link><description>&lt;p&gt;
&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#23545;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#30340;&#20114;&#34917;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
The complementary contributions of academia and industry to AI research. (arXiv:2401.10268v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10268
&lt;/p&gt;
&lt;p&gt;
&#24037;&#19994;&#30028;&#30340;&#30740;&#31350;&#22242;&#38431;&#22312;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#20013;&#26377;&#26356;&#39640;&#30340;&#20851;&#27880;&#24230;&#21644;&#24341;&#29992;&#29575;&#65292;&#19988;&#26356;&#26377;&#21487;&#33021;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#27169;&#22411;&#12290;&#32780;&#23398;&#26415;&#30028;&#30340;&#22242;&#38431;&#21017;&#26356;&#20542;&#21521;&#20110;&#20135;&#29983;&#20855;&#26377;&#26356;&#39640;&#31243;&#24230;&#21019;&#26032;&#30340;&#24037;&#20316;&#65292;&#20986;&#29616;&#38750;&#24120;&#19981;&#23547;&#24120;&#21644;&#20856;&#22411;&#30340;&#35770;&#25991;&#12290;&#36825;&#31181;&#24433;&#21709;&#21147;-&#21019;&#26032;&#24230;&#20248;&#21183;&#22312;&#19981;&#21516;&#39046;&#22495;&#12289;&#22242;&#38431;&#35268;&#27169;&#12289;&#36164;&#21382;&#21644;&#22768;&#26395;&#19979;&#22343;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22312;&#24037;&#19994;&#30028;&#21644;&#23398;&#26415;&#30028;&#20013;&#37117;&#21462;&#24471;&#20102;&#24040;&#22823;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#24037;&#19994;&#30028;&#36817;&#26399;&#30340;&#31361;&#30772;&#24615;&#36827;&#23637;&#24341;&#36215;&#20102;&#20154;&#20204;&#23545;&#23398;&#26415;&#30740;&#31350;&#22312;&#35813;&#39046;&#22495;&#20013;&#30340;&#20316;&#29992;&#30340;&#26032;&#35270;&#35282;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23545;&#36807;&#21435;25&#24180;&#20013;&#20004;&#20010;&#29615;&#22659;&#20013;&#20135;&#29983;&#30340;&#20154;&#24037;&#26234;&#33021;&#30340;&#24433;&#21709;&#21644;&#31867;&#22411;&#36827;&#34892;&#20102;&#25551;&#36848;&#65292;&#24182;&#24314;&#31435;&#20102;&#20960;&#31181;&#27169;&#24335;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30001;&#24037;&#19994;&#30028;&#30740;&#31350;&#20154;&#21592;&#32452;&#25104;&#30340;&#22242;&#38431;&#21457;&#34920;&#30340;&#25991;&#31456;&#24448;&#24448;&#26356;&#21463;&#20851;&#27880;&#65292;&#20855;&#26377;&#26356;&#39640;&#30340;&#34987;&#24341;&#29992;&#21644;&#24341;&#21457;&#24341;&#29992;&#39072;&#35206;&#30340;&#21487;&#33021;&#24615;&#65292;&#19988;&#26356;&#26377;&#21487;&#33021;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#27169;&#22411;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;&#32431;&#23398;&#26415;&#22242;&#38431;&#21457;&#34920;&#20102;&#22823;&#37096;&#20998;&#30340;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#65292;&#24182;&#20542;&#21521;&#20110;&#20135;&#29983;&#26356;&#39640;&#31243;&#24230;&#30340;&#21019;&#26032;&#24037;&#20316;&#65292;&#21333;&#31687;&#35770;&#25991;&#26377;&#25968;&#20493;&#30340;&#21487;&#33021;&#24615;&#26159;&#38750;&#24120;&#19981;&#23547;&#24120;&#21644;&#20856;&#22411;&#30340;&#12290;&#24037;&#19994;&#30028;&#21644;&#23398;&#26415;&#30028;&#22312;&#24433;&#21709;&#21147;-&#21019;&#26032;&#24230;&#26041;&#38754;&#30340;&#20248;&#21183;&#19981;&#21463;&#23376;&#39046;&#22495;&#12289;&#22242;&#38431;&#35268;&#27169;&#12289;&#36164;&#21382;&#21644;&#22768;&#26395;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#23398;&#26415;&#30028;&#20135;&#29983;&#20102;&#26356;&#22810;&#32508;&#36848;&#21644;&#20998;&#26512;&#22411;&#35770;&#25991;&#65292;&#32780;&#24037;&#19994;&#30028;&#21017;&#26356;&#22810;&#22320;&#27880;&#37325;&#24212;&#29992;&#21644;&#25216;&#26415;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) has seen tremendous development in industry and academia. However, striking recent advances by industry have stunned the world, inviting a fresh perspective on the role of academic research in this field. Here, we characterize the impact and type of AI produced by both environments over the last 25 years and establish several patterns. We find that articles published by teams consisting exclusively of industry researchers tend to get greater attention, with a higher chance of being highly cited and citation-disruptive, and several times more likely to produce state-of-the-art models. In contrast, we find that exclusively academic teams publish the bulk of AI research and tend to produce higher novelty work, with single papers having several times higher likelihood of being unconventional and atypical. The respective impact-novelty advantages of industry and academia are robust to controls for subfield, team size, seniority, and prestige. We find that academ
&lt;/p&gt;</description></item></channel></rss>