<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;ChatGPT&#29983;&#25104;&#21512;&#25104;&#35757;&#32451;&#25968;&#25454;&#26469;&#22686;&#24378;LLMs&#21435;&#20559;&#35265;&#21270;&#30340;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#39640;&#25928;&#22320;&#21435;&#38500;&#24050;&#30693;&#20559;&#35265;&#24182;&#36328;&#36234;&#19981;&#21516;&#31867;&#21035;&#36827;&#34892;&#21435;&#20559;&#35265;&#21270;&#12290;</title><link>https://arxiv.org/abs/2402.11764</link><description>&lt;p&gt;
&#22522;&#20110;ChatGPT&#30340;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;&#29992;&#20110;&#25913;&#21892;LLMs&#30340;&#21442;&#25968;&#39640;&#25928;&#21435;&#20559;&#35265;&#21270;
&lt;/p&gt;
&lt;p&gt;
ChatGPT Based Data Augmentation for Improved Parameter-Efficient Debiasing of LLMs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11764
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;ChatGPT&#29983;&#25104;&#21512;&#25104;&#35757;&#32451;&#25968;&#25454;&#26469;&#22686;&#24378;LLMs&#21435;&#20559;&#35265;&#21270;&#30340;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#39640;&#25928;&#22320;&#21435;&#38500;&#24050;&#30693;&#20559;&#35265;&#24182;&#36328;&#36234;&#19981;&#21516;&#31867;&#21035;&#36827;&#34892;&#21435;&#20559;&#35265;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#34429;&#28982;&#21151;&#33021;&#24378;&#22823;&#65292;&#20294;&#23384;&#22312;&#26377;&#23475;&#30340;&#31038;&#20250;&#20559;&#35265;&#12290;&#30001;&#20110;&#35745;&#31639;&#25104;&#26412;&#12289;&#25968;&#25454;&#32422;&#26463;&#21644;&#21487;&#33021;&#38477;&#20302;&#22810;&#20219;&#21153;&#35821;&#35328;&#33021;&#21147;&#65292;&#21435;&#20559;&#35265;&#21270;&#36890;&#24120;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;ChatGPT&#29983;&#25104;&#21512;&#25104;&#35757;&#32451;&#25968;&#25454;&#30340;&#26032;&#26041;&#27861;&#65292;&#26088;&#22312;&#22686;&#24378;LLMs&#30340;&#21435;&#20559;&#35265;&#21270;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#31574;&#30053;&#65306;&#30446;&#26631;&#25552;&#31034;&#65292;&#23545;&#24050;&#30693;&#20559;&#35265;&#25552;&#20379;&#26377;&#25928;&#30340;&#21435;&#20559;&#35265;&#21270;&#65292;&#20294;&#38656;&#35201;&#20107;&#20808;&#25351;&#23450;&#38382;&#39064;&#20013;&#30340;&#20559;&#35265;; &#19968;&#33324;&#25552;&#31034;&#65292;&#34429;&#28982;&#25928;&#26524;&#31245;&#36874;&#65292;&#20294;&#33021;&#22815;&#36328;&#21508;&#31181;&#31867;&#21035;&#36827;&#34892;&#21435;&#20559;&#35265;&#21270;&#12290;&#25105;&#20204;&#21033;&#29992;&#36866;&#37197;&#22120;&#35843;&#25972;&#26469;&#23454;&#29616;&#36164;&#28304;&#39640;&#25928;&#30340;LLM&#21435;&#20559;&#35265;&#21270;&#65292;&#24182;&#27604;&#36739;&#20102;&#25105;&#20204;&#30340;&#21512;&#25104;&#25968;&#25454;&#19982;&#29616;&#26377;&#21435;&#20559;&#35265;&#21270;&#25968;&#25454;&#38598;&#30340;&#25928;&#26524;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65306;&#65288;1&#65289;ChatGPT&#21487;&#20197;&#39640;&#25928;&#22320;&#29983;&#25104;&#29992;&#20110;&#21435;&#20559;&#35265;&#21270;&#20854;&#20182;LLMs&#30340;&#39640;&#36136;&#37327;&#35757;&#32451;&#25968;&#25454;&#65307;&#65288;2&#65289;&#36890;&#36807;&#25105;&#20204;&#30340;&#26041;&#27861;&#29983;&#25104;&#30340;&#25968;&#25454;&#36229;&#36234;&#20102;&#29616;&#26377;&#25968;&#25454;&#38598;&#22312;&#21435;&#20559;&#35265;&#21270;&#19978;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11764v1 Announce Type: cross  Abstract: Large Language models (LLMs), while powerful, exhibit harmful social biases. Debiasing is often challenging due to computational costs, data constraints, and potential degradation of multi-task language capabilities. This work introduces a novel approach utilizing ChatGPT to generate synthetic training data, aiming to enhance the debiasing of LLMs. We propose two strategies: Targeted Prompting, which provides effective debiasing for known biases but necessitates prior specification of bias in question; and General Prompting, which, while slightly less effective, offers debiasing across various categories. We leverage resource-efficient LLM debiasing using adapter tuning and compare the effectiveness of our synthetic data to existing debiasing datasets. Our results reveal that: (1) ChatGPT can efficiently produce high-quality training data for debiasing other LLMs; (2) data produced via our approach surpasses existing datasets in debias
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#32034;&#32852;&#37030;&#26041;&#27861;&#22312;&#27969;&#34892;&#30149;&#30417;&#27979;&#20013;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#36890;&#36807;&#25512;&#36865;&#21040;&#20445;&#31649;&#20154;&#30340;&#38450;&#28779;&#22681;&#24182;&#36827;&#34892;&#20803;&#20998;&#26512;&#65292;&#26469;&#35299;&#20915;&#25968;&#25454;&#20998;&#24067;&#21644;&#20849;&#20139;&#38480;&#21046;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#21512;&#30340;$p$-&#20540;&#21512;&#24182;&#26041;&#27861;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#32852;&#37030;&#27969;&#34892;&#30149;&#30417;&#27979;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2307.02616</link><description>&lt;p&gt;
&#32852;&#37030;&#27969;&#34892;&#30149;&#30417;&#27979;
&lt;/p&gt;
&lt;p&gt;
Federated Epidemic Surveillance. (arXiv:2307.02616v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02616
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#32034;&#32852;&#37030;&#26041;&#27861;&#22312;&#27969;&#34892;&#30149;&#30417;&#27979;&#20013;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#36890;&#36807;&#25512;&#36865;&#21040;&#20445;&#31649;&#20154;&#30340;&#38450;&#28779;&#22681;&#24182;&#36827;&#34892;&#20803;&#20998;&#26512;&#65292;&#26469;&#35299;&#20915;&#25968;&#25454;&#20998;&#24067;&#21644;&#20849;&#20139;&#38480;&#21046;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#21512;&#30340;$p$-&#20540;&#21512;&#24182;&#26041;&#27861;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#32852;&#37030;&#27969;&#34892;&#30149;&#30417;&#27979;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#34892;&#30149;&#30340;&#30417;&#27979;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#65292;&#29305;&#21035;&#26159;&#24403;&#20851;&#38190;&#25968;&#25454;&#20998;&#25955;&#19988;&#21033;&#30410;&#30456;&#20851;&#26041;&#26080;&#27861;&#25110;&#19981;&#24895;&#20849;&#20139;&#26102;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#38556;&#30861;&#65292;&#24212;&#24320;&#21457;&#32852;&#37030;&#26041;&#27861;&#26469;&#25972;&#21512;&#23454;&#20307;&#24895;&#24847;&#25552;&#20379;&#30340;&#36739;&#19981;&#25935;&#24863;&#30340;&#35777;&#25454;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#32034;&#23558;&#20551;&#35774;&#26816;&#39564;&#25512;&#36865;&#21040;&#27599;&#20010;&#20445;&#31649;&#20154;&#30340;&#38450;&#28779;&#22681;&#21518;&#65292;&#20877;&#36890;&#36807;&#20803;&#20998;&#26512;&#26469;&#21512;&#24182;&#32467;&#26524;&#30340;&#21487;&#34892;&#24615;&#65292;&#24182;&#30830;&#23450;&#37325;&#24314;&#20551;&#35774;&#26816;&#39564;&#21644;&#20248;&#21270;&#25512;&#29702;&#30340;&#26368;&#20339;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#26469;&#35782;&#21035;&#25351;&#26631;&#30340;&#28608;&#22686;&#65292;&#24182;&#23545;&#30495;&#23454;&#25968;&#25454;&#21644;&#21322;&#21512;&#25104;&#25968;&#25454;&#36827;&#34892;&#21151;&#25928;&#20998;&#26512;&#21644;&#23454;&#39564;&#65292;&#20197;&#23637;&#31034;&#25105;&#20204;&#25152;&#25552;&#20986;&#30340;&#20551;&#35774;&#26816;&#39564;&#30340;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#21512;&#36866;&#30340;$p$-&#20540;&#21512;&#24182;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#20984;&#26174;&#20102;&#20351;&#29992;$p$-&#20540;&#21512;&#24182;&#20316;&#20026;&#27969;&#34892;&#30149;&#30417;&#27979;&#30340;&#32852;&#37030;&#26041;&#27861;&#30340;&#28508;&#21147;&#65292;&#24182;&#20026;&#25972;&#21512;&#21487;&#29992;&#20449;&#24687;&#25552;&#20379;&#20102;&#23453;&#36149;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
The surveillance of a pandemic is a challenging task, especially when crucial data is distributed and stakeholders cannot or are unwilling to share. To overcome this obstacle, federated methodologies should be developed to incorporate less sensitive evidence that entities are willing to provide. This study aims to explore the feasibility of pushing hypothesis tests behind each custodian's firewall and then meta-analysis to combine the results, and to determine the optimal approach for reconstructing the hypothesis test and optimizing the inference. We propose a hypothesis testing framework to identify a surge in the indicators and conduct power analyses and experiments on real and semi-synthetic data to showcase the properties of our proposed hypothesis test and suggest suitable methods for combining $p$-values. Our findings highlight the potential of using $p$-value combination as a federated methodology for pandemic surveillance and provide valuable insights into integrating availabl
&lt;/p&gt;</description></item></channel></rss>