<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#20197;&#20102;&#35299;AI&#22522;&#20110;&#30340;&#29983;&#20135;&#21147;&#20195;&#29702;&#30340;&#20559;&#22909;&#65292;&#24182;&#24320;&#21457;&#20986;&#20010;&#24615;&#21270;&#35299;&#20915;&#26041;&#26696;&#12290;&#36890;&#36807;&#35843;&#26597;&#21644;&#20351;&#29992;&#36965;&#27979;&#25968;&#25454;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;GPT-4&#39537;&#21160;&#30340;&#20010;&#24615;&#21270;&#29983;&#20135;&#21147;&#20195;&#29702;&#65292;&#24182;&#22312;&#30740;&#31350;&#20013;&#19982;&#20854;&#20182;&#36741;&#21161;&#24037;&#20855;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#31361;&#20986;&#20102;&#29992;&#25143;&#20013;&#24515;&#35774;&#35745;&#12289;&#36866;&#24212;&#24615;&#21644;&#20010;&#24615;&#21270;&#19982;&#38544;&#31169;&#20043;&#38388;&#30340;&#24179;&#34913;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.08960</link><description>&lt;p&gt;
&#20174;&#29992;&#25143;&#35843;&#26597;&#21040;&#36965;&#27979;&#39537;&#21160;&#20195;&#29702;&#65306;&#25506;&#32034;&#20010;&#24615;&#21270;&#30340;&#29983;&#20135;&#21147;&#35299;&#20915;&#26041;&#26696;&#30340;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
From User Surveys to Telemetry-Driven Agents: Exploring the Potential of Personalized Productivity Solutions. (arXiv:2401.08960v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08960
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#20197;&#20102;&#35299;AI&#22522;&#20110;&#30340;&#29983;&#20135;&#21147;&#20195;&#29702;&#30340;&#20559;&#22909;&#65292;&#24182;&#24320;&#21457;&#20986;&#20010;&#24615;&#21270;&#35299;&#20915;&#26041;&#26696;&#12290;&#36890;&#36807;&#35843;&#26597;&#21644;&#20351;&#29992;&#36965;&#27979;&#25968;&#25454;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;GPT-4&#39537;&#21160;&#30340;&#20010;&#24615;&#21270;&#29983;&#20135;&#21147;&#20195;&#29702;&#65292;&#24182;&#22312;&#30740;&#31350;&#20013;&#19982;&#20854;&#20182;&#36741;&#21161;&#24037;&#20855;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#31361;&#20986;&#20102;&#29992;&#25143;&#20013;&#24515;&#35774;&#35745;&#12289;&#36866;&#24212;&#24615;&#21644;&#20010;&#24615;&#21270;&#19982;&#38544;&#31169;&#20043;&#38388;&#30340;&#24179;&#34913;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20102;&#35299;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#29983;&#20135;&#21147;&#20195;&#29702;&#30340;&#20559;&#22909;&#65292;&#24182;&#24320;&#21457;&#20986;&#26681;&#25454;&#29992;&#25143;&#38656;&#27714;&#23450;&#21046;&#30340;&#20010;&#24615;&#21270;&#35299;&#20915;&#26041;&#26696;&#12290;&#36890;&#36807;&#20004;&#20010;&#38454;&#27573;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#39318;&#20808;&#23545;363&#21517;&#21442;&#19982;&#32773;&#36827;&#34892;&#20102;&#35843;&#26597;&#65292;&#25506;&#32034;&#20102;&#29983;&#20135;&#21147;&#12289;&#27807;&#36890;&#39118;&#26684;&#12289;&#20195;&#29702;&#26041;&#27861;&#12289;&#20010;&#24615;&#29305;&#24449;&#12289;&#20010;&#24615;&#21270;&#21644;&#38544;&#31169;&#31561;&#21508;&#20010;&#26041;&#38754;&#12290;&#20511;&#21161;&#35843;&#26597;&#32467;&#26524;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#30001;Viva Insights&#25910;&#38598;&#30340;&#36965;&#27979;&#25968;&#25454;&#39537;&#21160;&#30340;&#20010;&#24615;&#21270;&#29983;&#20135;&#21147;&#20195;&#29702;&#65292;&#35813;&#20195;&#29702;&#21033;&#29992;GPT-4&#25552;&#20379;&#23450;&#21046;&#30340;&#24110;&#21161;&#12290;&#25105;&#20204;&#22312;&#28041;&#21450;40&#21517;&#21442;&#19982;&#32773;&#30340;&#30740;&#31350;&#20013;&#65292;&#23558;&#20854;&#24615;&#33021;&#19982;&#20202;&#34920;&#26495;&#21644;&#21465;&#36848;&#31561;&#26367;&#20195;&#30340;&#29983;&#20135;&#21147;&#36741;&#21161;&#24037;&#20855;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#20984;&#26174;&#20102;&#29992;&#25143;&#20013;&#24515;&#35774;&#35745;&#12289;&#36866;&#24212;&#24615;&#20197;&#21450;&#20010;&#24615;&#21270;&#21644;&#38544;&#31169;&#20043;&#38388;&#30340;&#24179;&#34913;&#22312;AI&#36741;&#21161;&#29983;&#20135;&#21147;&#24037;&#20855;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;&#36890;&#36807;&#20511;&#37492;&#25105;&#20204;&#30740;&#31350;&#20013;&#25552;&#28860;&#30340;&#35265;&#35299;&#65292;&#25105;&#20204;&#30456;&#20449;&#25105;&#20204;&#30340;&#24037;&#20316;&#21487;&#20197;&#21551;&#21457;&#21644;&#25351;&#23548;&#26410;&#26469;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a comprehensive, user-centric approach to understand preferences in AI-based productivity agents and develop personalized solutions tailored to users' needs. Utilizing a two-phase method, we first conducted a survey with 363 participants, exploring various aspects of productivity, communication style, agent approach, personality traits, personalization, and privacy. Drawing on the survey insights, we developed a GPT-4 powered personalized productivity agent that utilizes telemetry data gathered via Viva Insights from information workers to provide tailored assistance. We compared its performance with alternative productivity-assistive tools, such as dashboard and narrative, in a study involving 40 participants. Our findings highlight the importance of user-centric design, adaptability, and the balance between personalization and privacy in AI-assisted productivity tools. By building on the insights distilled from our study, we believe that our work can enable and guide futur
&lt;/p&gt;</description></item></channel></rss>