<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#30740;&#31350;&#36890;&#36807;&#20840;&#38754;&#30740;&#31350;&#20219;&#21153;&#38590;&#24230;&#65292;&#21457;&#29616;&#36739;&#26089;&#26102;&#38388;&#27493;&#38271;&#30340;&#21435;&#22122;&#20219;&#21153;&#26356;&#20855;&#25361;&#25112;&#24615;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#21435;&#22122;&#20219;&#21153;&#38590;&#24230;&#30340;&#28176;&#36827;&#24335;&#35838;&#31243;&#35757;&#32451;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.10348</link><description>&lt;p&gt;
&#22522;&#20110;&#21435;&#22122;&#20219;&#21153;&#38590;&#24230;&#30340;&#28176;&#36827;&#24335;&#35838;&#31243;&#35757;&#32451;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Denoising Task Difficulty-based Curriculum for Training Diffusion Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10348
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#36890;&#36807;&#20840;&#38754;&#30740;&#31350;&#20219;&#21153;&#38590;&#24230;&#65292;&#21457;&#29616;&#36739;&#26089;&#26102;&#38388;&#27493;&#38271;&#30340;&#21435;&#22122;&#20219;&#21153;&#26356;&#20855;&#25361;&#25112;&#24615;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#21435;&#22122;&#20219;&#21153;&#38590;&#24230;&#30340;&#28176;&#36827;&#24335;&#35838;&#31243;&#35757;&#32451;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#25193;&#25955;&#30340;&#29983;&#25104;&#27169;&#22411;&#24050;&#25104;&#20026;&#29983;&#25104;&#24314;&#27169;&#39046;&#22495;&#24378;&#22823;&#30340;&#24037;&#20855;&#12290;&#23613;&#31649;&#23545;&#21508;&#20010;&#26102;&#38388;&#27493;&#38271;&#21644;&#22122;&#22768;&#27700;&#24179;&#20043;&#38388;&#30340;&#21435;&#22122;&#36827;&#34892;&#20102;&#24191;&#27867;&#30740;&#31350;&#65292;&#20294;&#20851;&#20110;&#21435;&#22122;&#20219;&#21153;&#30340;&#30456;&#23545;&#38590;&#24230;&#20173;&#23384;&#22312;&#20105;&#35758;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#23545;&#20219;&#21153;&#38590;&#24230;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#30740;&#31350;&#65292;&#37325;&#28857;&#20851;&#27880;&#25910;&#25947;&#34892;&#20026;&#21644;&#26102;&#38388;&#27493;&#38271;&#38388;&#36830;&#32493;&#27010;&#29575;&#20998;&#24067;&#30340;&#30456;&#23545;&#29109;&#21464;&#21270;&#12290;&#25105;&#20204;&#30340;&#35266;&#23519;&#26174;&#31034;&#65292;&#36739;&#26089;&#26102;&#38388;&#27493;&#38271;&#30340;&#21435;&#22122;&#23384;&#22312;&#25910;&#25947;&#32531;&#24930;&#21644;&#36739;&#39640;&#30340;&#30456;&#23545;&#29109;&#65292;&#34920;&#26126;&#22312;&#36825;&#20123;&#36739;&#20302;&#26102;&#38388;&#27493;&#38271;&#19978;&#20219;&#21153;&#38590;&#24230;&#22686;&#21152;&#12290;&#22522;&#20110;&#36825;&#20123;&#35266;&#23519;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#30001;&#26131;&#21040;&#38590;&#30340;&#23398;&#20064;&#26041;&#26696;&#65292;&#20511;&#37492;&#28176;&#36827;&#24335;&#23398;&#20064;&#30340;&#24605;&#24819;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10348v1 Announce Type: cross  Abstract: Diffusion-based generative models have emerged as powerful tools in the realm of generative modeling. Despite extensive research on denoising across various timesteps and noise levels, a conflict persists regarding the relative difficulties of the denoising tasks. While various studies argue that lower timesteps present more challenging tasks, others contend that higher timesteps are more difficult. To address this conflict, our study undertakes a comprehensive examination of task difficulties, focusing on convergence behavior and changes in relative entropy between consecutive probability distributions across timesteps. Our observational study reveals that denoising at earlier timesteps poses challenges characterized by slower convergence and higher relative entropy, indicating increased task difficulty at these lower timesteps. Building on these observations, we introduce an easy-to-hard learning scheme, drawing from curriculum learn
&lt;/p&gt;</description></item></channel></rss>