<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#30740;&#31350;&#26159;&#20851;&#20110;&#22312;&#23391;&#21152;&#25289;&#22269;&#32972;&#26223;&#19979;&#23545;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;&#36827;&#34892;&#24320;&#21019;&#24615;&#25506;&#32034;&#65292;&#25581;&#31034;&#20102;&#30007;&#24615;&#21463;&#23475;&#32773;&#30340;&#23384;&#22312;&#12289;&#27169;&#24335;&#21644;&#28508;&#22312;&#22240;&#32032;&#65292;&#22635;&#34917;&#20102;&#29616;&#26377;&#25991;&#29486;&#23545;&#30007;&#24615;&#21463;&#23475;&#32773;&#30740;&#31350;&#31354;&#30333;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.15594</link><description>&lt;p&gt;
&#36890;&#36807;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#21644;&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#27934;&#35265;&#20998;&#26512;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;
&lt;/p&gt;
&lt;p&gt;
Analyzing Male Domestic Violence through Exploratory Data Analysis and Explainable Machine Learning Insights
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15594
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26159;&#20851;&#20110;&#22312;&#23391;&#21152;&#25289;&#22269;&#32972;&#26223;&#19979;&#23545;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;&#36827;&#34892;&#24320;&#21019;&#24615;&#25506;&#32034;&#65292;&#25581;&#31034;&#20102;&#30007;&#24615;&#21463;&#23475;&#32773;&#30340;&#23384;&#22312;&#12289;&#27169;&#24335;&#21644;&#28508;&#22312;&#22240;&#32032;&#65292;&#22635;&#34917;&#20102;&#29616;&#26377;&#25991;&#29486;&#23545;&#30007;&#24615;&#21463;&#23475;&#32773;&#30740;&#31350;&#31354;&#30333;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23478;&#24237;&#26292;&#21147;&#36890;&#24120;&#34987;&#35270;&#20026;&#19968;&#20010;&#20851;&#20110;&#22899;&#24615;&#21463;&#23475;&#32773;&#30340;&#24615;&#21035;&#38382;&#39064;&#65292;&#22312;&#36817;&#24180;&#26469;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#12290;&#23613;&#31649;&#26377;&#36825;&#31181;&#20851;&#27880;&#65292;&#23391;&#21152;&#25289;&#22269;&#29305;&#21035;&#26159;&#30007;&#24615;&#21463;&#23475;&#32773;&#20173;&#28982;&#20027;&#35201;&#34987;&#24573;&#35270;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#20195;&#34920;&#20102;&#22312;&#23391;&#21152;&#25289;&#22269;&#32972;&#26223;&#19979;&#23545;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;&#65288;MDV&#65289;&#36825;&#19968;&#26410;&#34987;&#20805;&#20998;&#25506;&#35752;&#39046;&#22495;&#30340;&#24320;&#21019;&#24615;&#25506;&#32034;&#65292;&#25581;&#31034;&#20102;&#20854;&#26222;&#36941;&#24615;&#12289;&#27169;&#24335;&#21644;&#28508;&#22312;&#22240;&#32032;&#12290;&#29616;&#26377;&#25991;&#29486;&#20027;&#35201;&#24378;&#35843;&#23478;&#24237;&#26292;&#21147;&#24773;&#22659;&#20013;&#22899;&#24615;&#30340;&#21463;&#23475;&#65292;&#23548;&#33268;&#23545;&#30007;&#24615;&#21463;&#23475;&#32773;&#30340;&#30740;&#31350;&#31354;&#30333;&#12290;&#25105;&#20204;&#20174;&#23391;&#21152;&#25289;&#22269;&#20027;&#35201;&#22478;&#24066;&#25910;&#38598;&#20102;&#25968;&#25454;&#65292;&#24182;&#36827;&#34892;&#20102;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#20197;&#20102;&#35299;&#28508;&#22312;&#21160;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;11&#31181;&#20256;&#32479;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65288;&#21253;&#25324;&#40664;&#35748;&#21644;&#20248;&#21270;&#30340;&#36229;&#21442;&#25968;&#65289;&#12289;2&#31181;&#28145;&#24230;&#23398;&#20064;&#21644;4&#31181;&#38598;&#25104;&#27169;&#22411;&#12290;&#23613;&#31649;&#37319;&#29992;&#20102;&#21508;&#31181;&#26041;&#27861;&#65292;CatBoost&#30001;&#20110;&#20854;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15594v1 Announce Type: cross  Abstract: Domestic violence, which is often perceived as a gendered issue among female victims, has gained increasing attention in recent years. Despite this focus, male victims of domestic abuse remain primarily overlooked, particularly in Bangladesh. Our study represents a pioneering exploration of the underexplored realm of male domestic violence (MDV) within the Bangladeshi context, shedding light on its prevalence, patterns, and underlying factors. Existing literature predominantly emphasizes female victimization in domestic violence scenarios, leading to an absence of research on male victims. We collected data from the major cities of Bangladesh and conducted exploratory data analysis to understand the underlying dynamics. We implemented 11 traditional machine learning models with default and optimized hyperparameters, 2 deep learning, and 4 ensemble models. Despite various approaches, CatBoost has emerged as the top performer due to its 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#33258;&#36866;&#24212;&#35821;&#20041;&#24863;&#30693;&#22270;&#31070;&#32463;&#32593;&#32476;&#25913;&#36827;&#35748;&#30693;&#35786;&#26029;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#24357;&#34917;&#20102;&#29616;&#26377;&#30740;&#31350;&#20013;&#23545;&#36793;&#32536;&#20869;&#30340;&#24322;&#36136;&#24615;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#24573;&#35270;&#12290;</title><link>https://arxiv.org/abs/2403.05559</link><description>&lt;p&gt;
&#29992;&#33258;&#36866;&#24212;&#20851;&#31995;&#22270;&#31070;&#32463;&#32593;&#32476;&#25913;&#36827;&#35748;&#30693;&#35786;&#26029;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Improving Cognitive Diagnosis Models with Adaptive Relational Graph Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05559
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#33258;&#36866;&#24212;&#35821;&#20041;&#24863;&#30693;&#22270;&#31070;&#32463;&#32593;&#32476;&#25913;&#36827;&#35748;&#30693;&#35786;&#26029;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#24357;&#34917;&#20102;&#29616;&#26377;&#30740;&#31350;&#20013;&#23545;&#36793;&#32536;&#20869;&#30340;&#24322;&#36136;&#24615;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#24573;&#35270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35748;&#30693;&#35786;&#26029;&#65288;CD&#65289;&#31639;&#27861;&#22312;&#26234;&#33021;&#25945;&#32946;&#20013;&#21463;&#21040;&#36234;&#26469;&#36234;&#22810;&#30340;&#30740;&#31350;&#20851;&#27880;&#12290;&#20856;&#22411;&#30340;CD&#31639;&#27861;&#36890;&#36807;&#25512;&#26029;&#23398;&#29983;&#30340;&#33021;&#21147;&#65288;&#21363;&#20182;&#20204;&#22312;&#21508;&#31181;&#30693;&#35782;&#27010;&#24565;&#19978;&#30340;&#29087;&#32451;&#27700;&#24179;&#65289;&#26469;&#24110;&#21161;&#23398;&#29983;&#12290;&#36825;&#31181;&#29087;&#32451;&#27700;&#24179;&#21487;&#20197;&#36827;&#19968;&#27493;&#23454;&#29616;&#38024;&#23545;&#24615;&#30340;&#25216;&#33021;&#35757;&#32451;&#21644;&#20010;&#24615;&#21270;&#30340;&#32451;&#20064;&#24314;&#35758;&#65292;&#20174;&#32780;&#20419;&#36827;&#22312;&#32447;&#25945;&#32946;&#20013;&#23398;&#29983;&#30340;&#23398;&#20064;&#25928;&#29575;&#12290;&#26368;&#36817;&#65292;&#30740;&#31350;&#20154;&#21592;&#21457;&#29616;&#24314;&#31435;&#21644;&#25972;&#21512;&#23398;&#29983;-&#32451;&#20064;&#20108;&#37096;&#22270;&#23545;&#20110;&#22686;&#24378;&#35786;&#26029;&#24615;&#33021;&#26159;&#26377;&#30410;&#30340;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;&#30740;&#31350;&#20173;&#28982;&#23384;&#22312;&#23616;&#38480;&#24615;&#12290;&#19968;&#26041;&#38754;&#65292;&#30740;&#31350;&#20154;&#21592;&#24573;&#35270;&#20102;&#36793;&#32536;&#20869;&#30340;&#24322;&#36136;&#24615;&#65292;&#21363;&#21487;&#33021;&#23384;&#22312;&#27491;&#30830;&#21644;&#38169;&#35823;&#30340;&#31572;&#26696;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#20182;&#20204;&#24573;&#35270;&#20102;&#36793;&#32536;&#20869;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#20363;&#22914;&#65292;&#27491;&#30830;&#30340;&#31572;&#26696;&#21487;&#33021;&#34920;&#31034;&#30495;&#27491;&#25484;&#25569;&#25110;&#24184;&#36816;&#29468;&#27979;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#35821;&#20041;&#24863;&#30693;&#22270;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05559v1 Announce Type: cross  Abstract: Cognitive Diagnosis (CD) algorithms receive growing research interest in intelligent education. Typically, these CD algorithms assist students by inferring their abilities (i.e., their proficiency levels on various knowledge concepts). The proficiency levels can enable further targeted skill training and personalized exercise recommendations, thereby promoting students' learning efficiency in online education. Recently, researchers have found that building and incorporating a student-exercise bipartite graph is beneficial for enhancing diagnostic performance. However, there are still limitations in their studies. On one hand, researchers overlook the heterogeneity within edges, where there can be both correct and incorrect answers. On the other hand, they disregard the uncertainty within edges, e.g., a correct answer can indicate true mastery or fortunate guessing. To address the limitations, we propose Adaptive Semantic-aware Graph-ba
&lt;/p&gt;</description></item></channel></rss>