<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29305;&#27931;&#20234;&#27169;&#22411;&#26816;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#28608;&#27963;&#20248;&#21270;&#20026;&#27169;&#22411;&#21019;&#24314;&#31614;&#21517;&#65292;&#28982;&#21518;&#35757;&#32451;&#20998;&#31867;&#22120;&#26469;&#26816;&#27979;&#29305;&#27931;&#20234;&#27169;&#22411;&#12290;&#35813;&#26041;&#27861;&#22312;&#20004;&#20010;&#20844;&#20849;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2306.04877</link><description>&lt;p&gt;
&#20351;&#29992;&#28608;&#27963;&#20248;&#21270;&#36827;&#34892;&#29305;&#27931;&#20234;&#27169;&#22411;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Trojan Model Detection Using Activation Optimization. (arXiv:2306.04877v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04877
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29305;&#27931;&#20234;&#27169;&#22411;&#26816;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#28608;&#27963;&#20248;&#21270;&#20026;&#27169;&#22411;&#21019;&#24314;&#31614;&#21517;&#65292;&#28982;&#21518;&#35757;&#32451;&#20998;&#31867;&#22120;&#26469;&#26816;&#27979;&#29305;&#27931;&#20234;&#27169;&#22411;&#12290;&#35813;&#26041;&#27861;&#22312;&#20004;&#20010;&#20844;&#20849;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#25968;&#25454;&#30340;&#19981;&#21487;&#29992;&#24615;&#25110;&#22823;&#35268;&#27169;&#65292;&#20197;&#21450;&#35757;&#32451;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#39640;&#35745;&#31639;&#21644;&#20154;&#21147;&#25104;&#26412;&#65292;&#36890;&#24120;&#20250;&#22312;&#21487;&#33021;&#30340;&#24773;&#20917;&#19979;&#20381;&#36182;&#20110;&#24320;&#28304;&#39044;&#35757;&#32451;&#27169;&#22411;&#12290;&#20294;&#26159;&#65292;&#20174;&#23433;&#20840;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#36825;&#31181;&#20570;&#27861;&#38750;&#24120;&#20196;&#20154;&#25285;&#24551;&#12290;&#39044;&#35757;&#32451;&#27169;&#22411;&#21487;&#33021;&#20250;&#34987;&#24863;&#26579;&#29305;&#27931;&#20234;&#25915;&#20987;&#65292;&#22312;&#36825;&#31181;&#25915;&#20987;&#20013;&#65292;&#25915;&#20987;&#32773;&#23884;&#20837;&#19968;&#20010;&#35302;&#21457;&#22120;&#22312;&#27169;&#22411;&#20013;&#65292;&#20351;&#24471;&#24403;&#35302;&#21457;&#22120;&#23384;&#22312;&#20110;&#36755;&#20837;&#20013;&#26102;&#65292;&#25915;&#20987;&#32773;&#21487;&#20197;&#25511;&#21046;&#27169;&#22411;&#30340;&#34892;&#20026;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29305;&#27931;&#20234;&#27169;&#22411;&#26816;&#27979;&#26041;&#27861;&#30340;&#21021;&#27493;&#24037;&#20316;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26681;&#25454;&#28608;&#27963;&#20248;&#21270;&#20026;&#27169;&#22411;&#21019;&#24314;&#31614;&#21517;&#12290;&#28982;&#21518;&#35757;&#32451;&#20998;&#31867;&#22120;&#26469;&#26816;&#27979;&#29305;&#27931;&#20234;&#27169;&#22411;&#24182;&#32473;&#20986;&#20854;&#31614;&#21517;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#20004;&#20010;&#20844;&#20849;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to data's unavailability or large size, and the high computational and human labor costs of training machine learning models, it is a common practice to rely on open source pre-trained models whenever possible. However, this practice is worry some from the security perspective. Pre-trained models can be infected with Trojan attacks, in which the attacker embeds a trigger in the model such that the model's behavior can be controlled by the attacker when the trigger is present in the input. In this paper, we present our preliminary work on a novel method for Trojan model detection. Our method creates a signature for a model based on activation optimization. A classifier is then trained to detect a Trojan model given its signature. Our method achieves state of the art performance on two public datasets.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#20445;&#25252;&#20010;&#20154;&#25935;&#24863;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#29983;&#25104;&#39640;&#25928;&#20302;&#32500;&#21512;&#25104;&#25968;&#25454;&#30340;&#31639;&#27861;&#65292;&#24182;&#22312;Wasserstein&#36317;&#31163;&#26041;&#38754;&#20855;&#26377;&#25928;&#29992;&#20445;&#35777;&#65307;&#19982;&#26631;&#20934;&#25200;&#21160;&#20998;&#26512;&#19981;&#21516;&#65292;&#20351;&#29992;&#31169;&#26377;&#20027;&#25104;&#20998;&#20998;&#26512;&#36807;&#31243;&#36991;&#20813;&#20102;&#32500;&#24230;&#35781;&#21650;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2305.17148</link><description>&lt;p&gt;
&#39640;&#32500;&#25968;&#25454;&#30340;&#24046;&#20998;&#38544;&#31169;&#20302;&#32500;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Differentially private low-dimensional representation of high-dimensional data. (arXiv:2305.17148v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#20445;&#25252;&#20010;&#20154;&#25935;&#24863;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#29983;&#25104;&#39640;&#25928;&#20302;&#32500;&#21512;&#25104;&#25968;&#25454;&#30340;&#31639;&#27861;&#65292;&#24182;&#22312;Wasserstein&#36317;&#31163;&#26041;&#38754;&#20855;&#26377;&#25928;&#29992;&#20445;&#35777;&#65307;&#19982;&#26631;&#20934;&#25200;&#21160;&#20998;&#26512;&#19981;&#21516;&#65292;&#20351;&#29992;&#31169;&#26377;&#20027;&#25104;&#20998;&#20998;&#26512;&#36807;&#31243;&#36991;&#20813;&#20102;&#32500;&#24230;&#35781;&#21650;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24046;&#20998;&#38544;&#31169;&#21512;&#25104;&#25968;&#25454;&#25552;&#20379;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#26426;&#21046;&#65292;&#21487;&#20197;&#22312;&#20445;&#25252;&#20010;&#20154;&#25935;&#24863;&#20449;&#24687;&#30340;&#21516;&#26102;&#36827;&#34892;&#25968;&#25454;&#20998;&#26512;&#12290;&#28982;&#32780;&#65292;&#24403;&#25968;&#25454;&#22788;&#20110;&#39640;&#32500;&#31354;&#38388;&#20013;&#26102;&#65292;&#21512;&#25104;&#25968;&#25454;&#30340;&#20934;&#30830;&#24615;&#20250;&#21463;&#21040;&#32500;&#24230;&#35781;&#21650;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24046;&#20998;&#38544;&#31169;&#31639;&#27861;&#65292;&#21487;&#20197;&#20174;&#39640;&#32500;&#25968;&#25454;&#38598;&#20013;&#39640;&#25928;&#22320;&#29983;&#25104;&#20302;&#32500;&#21512;&#25104;&#25968;&#25454;&#65292;&#24182;&#22312;Wasserstein&#36317;&#31163;&#26041;&#38754;&#20855;&#26377;&#25928;&#29992;&#20445;&#35777;&#12290;&#25105;&#20204;&#31639;&#27861;&#30340;&#19968;&#20010;&#20851;&#38190;&#27493;&#39588;&#26159;&#20351;&#29992;&#20855;&#26377;&#36817;&#20046;&#26368;&#20248;&#31934;&#24230;&#30028;&#38480;&#30340;&#31169;&#26377;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#36807;&#31243;&#65292;&#20174;&#32780;&#35268;&#36991;&#20102;&#32500;&#24230;&#35781;&#21650;&#30340;&#24433;&#21709;&#12290;&#19982;&#20351;&#29992;Davis-Kahan&#23450;&#29702;&#36827;&#34892;&#26631;&#20934;&#25200;&#21160;&#20998;&#26512;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#31169;&#26377;PCA&#20998;&#26512;&#19981;&#38656;&#35201;&#20551;&#35774;&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#35889;&#38388;&#38553;&#12290;
&lt;/p&gt;
&lt;p&gt;
Differentially private synthetic data provide a powerful mechanism to enable data analysis while protecting sensitive information about individuals. However, when the data lie in a high-dimensional space, the accuracy of the synthetic data suffers from the curse of dimensionality. In this paper, we propose a differentially private algorithm to generate low-dimensional synthetic data efficiently from a high-dimensional dataset with a utility guarantee with respect to the Wasserstein distance. A key step of our algorithm is a private principal component analysis (PCA) procedure with a near-optimal accuracy bound that circumvents the curse of dimensionality. Different from the standard perturbation analysis using the Davis-Kahan theorem, our analysis of private PCA works without assuming the spectral gap for the sample covariance matrix.
&lt;/p&gt;</description></item></channel></rss>