<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>DistriBlock&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#35782;&#21035;&#23545;&#25239;&#24615;&#38899;&#39057;&#26679;&#26412;&#30340;&#26377;&#25928;&#26816;&#27979;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#36755;&#20986;&#20998;&#24067;&#30340;&#29305;&#24449;&#65292;&#21253;&#25324;&#20013;&#20301;&#25968;&#12289;&#26368;&#22823;&#20540;&#21644;&#26368;&#23567;&#20540;&#12289;&#29109;&#20197;&#21450;&#19982;&#21518;&#32493;&#26102;&#38388;&#27493;&#39588;&#30340;&#20998;&#24067;&#20043;&#38388;&#30340;&#25955;&#24230;&#65292;&#24212;&#29992;&#20108;&#20803;&#20998;&#31867;&#22120;&#36827;&#34892;&#39044;&#27979;&#12290;&#36825;&#39033;&#30740;&#31350;&#35777;&#26126;&#20102;DistriBlock&#22312;&#35782;&#21035;&#23545;&#25239;&#24615;&#38899;&#39057;&#26679;&#26412;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2305.17000</link><description>&lt;p&gt;
DistriBlock: &#36890;&#36807;&#21033;&#29992;&#36755;&#20986;&#20998;&#24067;&#30340;&#29305;&#24449;&#35782;&#21035;&#23545;&#25239;&#24615;&#38899;&#39057;&#26679;&#26412;
&lt;/p&gt;
&lt;p&gt;
DistriBlock: Identifying adversarial audio samples by leveraging characteristics of the output distribution
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2305.17000
&lt;/p&gt;
&lt;p&gt;
DistriBlock&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#35782;&#21035;&#23545;&#25239;&#24615;&#38899;&#39057;&#26679;&#26412;&#30340;&#26377;&#25928;&#26816;&#27979;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#36755;&#20986;&#20998;&#24067;&#30340;&#29305;&#24449;&#65292;&#21253;&#25324;&#20013;&#20301;&#25968;&#12289;&#26368;&#22823;&#20540;&#21644;&#26368;&#23567;&#20540;&#12289;&#29109;&#20197;&#21450;&#19982;&#21518;&#32493;&#26102;&#38388;&#27493;&#39588;&#30340;&#20998;&#24067;&#20043;&#38388;&#30340;&#25955;&#24230;&#65292;&#24212;&#29992;&#20108;&#20803;&#20998;&#31867;&#22120;&#36827;&#34892;&#39044;&#27979;&#12290;&#36825;&#39033;&#30740;&#31350;&#35777;&#26126;&#20102;DistriBlock&#22312;&#35782;&#21035;&#23545;&#25239;&#24615;&#38899;&#39057;&#26679;&#26412;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#25239;&#24615;&#25915;&#20987;&#21487;&#33021;&#35823;&#23548;&#33258;&#21160;&#35821;&#38899;&#35782;&#21035;&#65288;ASR&#65289;&#31995;&#32479;&#65292;&#20351;&#20854;&#39044;&#27979;&#20219;&#24847;&#30446;&#26631;&#25991;&#26412;&#65292;&#20174;&#32780;&#26500;&#25104;&#26126;&#26174;&#30340;&#23433;&#20840;&#23041;&#32961;&#12290;&#20026;&#20102;&#38450;&#27490;&#36825;&#31181;&#25915;&#20987;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;DistriBlock&#65292;&#19968;&#31181;&#36866;&#29992;&#20110;&#20219;&#20309;ASR&#31995;&#32479;&#30340;&#39640;&#25928;&#26816;&#27979;&#31574;&#30053;&#65292;&#35813;&#31995;&#32479;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#39588;&#19978;&#39044;&#27979;&#36755;&#20986;&#26631;&#35760;&#30340;&#27010;&#29575;&#20998;&#24067;&#12290;&#25105;&#20204;&#23545;&#35813;&#20998;&#24067;&#30340;&#19968;&#32452;&#29305;&#24449;&#36827;&#34892;&#27979;&#37327;&#65306;&#36755;&#20986;&#27010;&#29575;&#30340;&#20013;&#20301;&#25968;&#12289;&#26368;&#22823;&#20540;&#21644;&#26368;&#23567;&#20540;&#65292;&#20998;&#24067;&#30340;&#29109;&#65292;&#20197;&#21450;&#19982;&#21518;&#32493;&#26102;&#38388;&#27493;&#39588;&#30340;&#20998;&#24067;&#20043;&#38388;&#30340;Kullback-Leibler&#21644;Jensen-Shannon&#25955;&#24230;&#12290;&#28982;&#21518;&#65292;&#36890;&#36807;&#21033;&#29992;&#23545;&#33391;&#24615;&#21644;&#23545;&#25239;&#24615;&#25968;&#25454;&#35266;&#23519;&#21040;&#30340;&#29305;&#24449;&#65292;&#25105;&#20204;&#24212;&#29992;&#20108;&#20803;&#20998;&#31867;&#22120;&#65292;&#21253;&#25324;&#31616;&#21333;&#30340;&#22522;&#20110;&#38408;&#20540;&#30340;&#20998;&#31867;&#12289;&#36825;&#31181;&#20998;&#31867;&#22120;&#30340;&#38598;&#21512;&#20197;&#21450;&#31070;&#32463;&#32593;&#32476;&#12290;&#36890;&#36807;&#23545;&#19981;&#21516;&#26368;&#20808;&#36827;&#30340;ASR&#31995;&#32479;&#21644;&#35821;&#35328;&#25968;&#25454;&#38598;&#36827;&#34892;&#24191;&#27867;&#20998;&#26512;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;DistriBlock&#22312;&#35782;&#21035;&#23545;&#25239;&#24615;&#38899;&#39057;&#26679;&#26412;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2305.17000v2 Announce Type: replace-cross  Abstract: Adversarial attacks can mislead automatic speech recognition (ASR) systems into predicting an arbitrary target text, thus posing a clear security threat. To prevent such attacks, we propose DistriBlock, an efficient detection strategy applicable to any ASR system that predicts a probability distribution over output tokens in each time step. We measure a set of characteristics of this distribution: the median, maximum, and minimum over the output probabilities, the entropy of the distribution, as well as the Kullback-Leibler and the Jensen-Shannon divergence with respect to the distributions of the subsequent time step. Then, by leveraging the characteristics observed for both benign and adversarial data, we apply binary classifiers, including simple threshold-based classification, ensembles of such classifiers, and neural networks. Through extensive analysis across different state-of-the-art ASR systems and language data sets, 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20840;&#38754;&#25506;&#35752;&#20102;&#19982;&#35821;&#35328;&#23398;&#20064;&#27169;&#22411;&#65288;LLMs&#65289;&#38754;&#20020;&#30340;&#23433;&#20840;&#23041;&#32961;&#30456;&#20851;&#30340;&#20262;&#29702;&#25361;&#25112;&#12290;&#20998;&#26512;&#20102;&#20116;&#31181;&#20027;&#35201;&#23041;&#32961;&#30340;&#20262;&#29702;&#21518;&#26524;&#65292;&#24182;&#24378;&#35843;&#20102;&#30830;&#20445;&#36825;&#20123;&#31995;&#32479;&#22312;&#20262;&#29702;&#35268;&#33539;&#33539;&#22260;&#20869;&#36816;&#20316;&#30340;&#32039;&#36843;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.12273</link><description>&lt;p&gt;
&#20132;&#20114;&#30340;&#20262;&#29702;&#38382;&#39064;&#65306;&#32531;&#35299;LLMs&#20013;&#30340;&#23433;&#20840;&#23041;&#32961;
&lt;/p&gt;
&lt;p&gt;
The Ethics of Interaction: Mitigating Security Threats in LLMs. (arXiv:2401.12273v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12273
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20840;&#38754;&#25506;&#35752;&#20102;&#19982;&#35821;&#35328;&#23398;&#20064;&#27169;&#22411;&#65288;LLMs&#65289;&#38754;&#20020;&#30340;&#23433;&#20840;&#23041;&#32961;&#30456;&#20851;&#30340;&#20262;&#29702;&#25361;&#25112;&#12290;&#20998;&#26512;&#20102;&#20116;&#31181;&#20027;&#35201;&#23041;&#32961;&#30340;&#20262;&#29702;&#21518;&#26524;&#65292;&#24182;&#24378;&#35843;&#20102;&#30830;&#20445;&#36825;&#20123;&#31995;&#32479;&#22312;&#20262;&#29702;&#35268;&#33539;&#33539;&#22260;&#20869;&#36816;&#20316;&#30340;&#32039;&#36843;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20840;&#38754;&#25506;&#35752;&#20102;&#19982;&#35821;&#35328;&#23398;&#20064;&#27169;&#22411;&#65288;LLMs&#65289;&#38754;&#20020;&#30340;&#23433;&#20840;&#23041;&#32961;&#30456;&#20851;&#30340;&#20262;&#29702;&#25361;&#25112;&#12290;&#36825;&#20123;&#22797;&#26434;&#30340;&#25968;&#23383;&#23384;&#20648;&#24211;&#26085;&#30410;&#34701;&#20837;&#21040;&#25105;&#20204;&#30340;&#26085;&#24120;&#29983;&#27963;&#20013;&#65292;&#22240;&#27492;&#25104;&#20026;&#25915;&#20987;&#30340;&#20027;&#35201;&#30446;&#26631;&#65292;&#21487;&#33021;&#21361;&#21450;&#20854;&#35757;&#32451;&#25968;&#25454;&#21644;&#25968;&#25454;&#28304;&#30340;&#26426;&#23494;&#24615;&#12290;&#26412;&#25991;&#28145;&#20837;&#30740;&#31350;&#20102;&#36825;&#20123;&#23433;&#20840;&#23041;&#32961;&#23545;&#31038;&#20250;&#21644;&#20010;&#20154;&#38544;&#31169;&#30340;&#24494;&#22937;&#20262;&#29702;&#24433;&#21709;&#12290;&#25105;&#20204;&#23545;&#20116;&#20010;&#20027;&#35201;&#23041;&#32961;&#36827;&#34892;&#20102;&#35814;&#32454;&#20998;&#26512;&#65306;&#25552;&#31034;&#27880;&#20837;&#12289;&#36234;&#29425;&#12289;&#20010;&#20154;&#21487;&#35782;&#21035;&#20449;&#24687;&#65288;PII&#65289;&#26333;&#38706;&#12289;&#24615;&#21035;&#26174;&#38706;&#20869;&#23481;&#21644;&#22522;&#20110;&#20167;&#24680;&#30340;&#20869;&#23481;&#12290;&#25105;&#20204;&#19981;&#20165;&#20165;&#36827;&#34892;&#20102;&#35782;&#21035;&#65292;&#36824;&#35780;&#20272;&#20102;&#23427;&#20204;&#30340;&#20851;&#38190;&#20262;&#29702;&#21518;&#26524;&#20197;&#21450;&#23545;&#24378;&#21270;&#38450;&#24481;&#31574;&#30053;&#30340;&#32039;&#36843;&#24615;&#12290;&#23545;LLMs&#30340;&#19981;&#26029;&#20381;&#36182;&#20984;&#26174;&#20102;&#30830;&#20445;&#36825;&#20123;&#31995;&#32479;&#22312;&#20262;&#29702;&#35268;&#33539;&#33539;&#22260;&#20869;&#36816;&#20316;&#30340;&#37325;&#35201;&#24615;&#65292;&#29305;&#21035;&#26159;&#30001;&#20110;&#23427;&#20204;&#30340;&#28389;&#29992;&#21487;&#33021;&#23548;&#33268;&#37325;&#22823;&#31038;&#20250;&#21644;&#20010;&#20154;&#20260;&#23475;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#23558;&#36825;&#20123;&#31995;&#32479;&#27010;&#24565;&#21270;&#30340;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper comprehensively explores the ethical challenges arising from security threats to Language Learning Models (LLMs). These intricate digital repositories are increasingly integrated into our daily lives, making them prime targets for attacks that can compromise their training data and the confidentiality of their data sources. The paper delves into the nuanced ethical repercussions of such security threats on society and individual privacy. We scrutinize five major threats: prompt injection, jailbreaking, Personal Identifiable Information (PII) exposure, sexually explicit content, and hate based content, going beyond mere identification to assess their critical ethical consequences and the urgency they create for robust defensive strategies. The escalating reliance on LLMs underscores the crucial need for ensuring these systems operate within the bounds of ethical norms, particularly as their misuse can lead to significant societal and individual harm. We propose conceptualizin
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;HTML&#20869;&#23481;&#30340;&#39640;&#32423;&#26816;&#27979;&#27169;&#22411;&#65292;&#38598;&#25104;&#20102;&#22810;&#23618;&#24863;&#30693;&#22120;&#21644;&#39044;&#35757;&#32451;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#27169;&#22411;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#34701;&#21512;&#26041;&#27861;&#26816;&#27979;&#32593;&#32476;&#38035;&#40060;&#32593;&#31449;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#21019;&#36896;&#20102;&#19968;&#20010;&#26368;&#26032;&#30340;&#25968;&#25454;&#38598;&#26469;&#25903;&#25345;&#36825;&#39033;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2401.04820</link><description>&lt;p&gt;
&#36890;&#36807;HTML&#20869;&#23481;&#30340;&#22810;&#27169;&#22411;&#20998;&#26512;&#26816;&#27979;&#32593;&#32476;&#38035;&#40060;&#32593;&#31449;
&lt;/p&gt;
&lt;p&gt;
Phishing Website Detection through Multi-Model Analysis of HTML Content. (arXiv:2401.04820v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04820
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;HTML&#20869;&#23481;&#30340;&#39640;&#32423;&#26816;&#27979;&#27169;&#22411;&#65292;&#38598;&#25104;&#20102;&#22810;&#23618;&#24863;&#30693;&#22120;&#21644;&#39044;&#35757;&#32451;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#27169;&#22411;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#34701;&#21512;&#26041;&#27861;&#26816;&#27979;&#32593;&#32476;&#38035;&#40060;&#32593;&#31449;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#21019;&#36896;&#20102;&#19968;&#20010;&#26368;&#26032;&#30340;&#25968;&#25454;&#38598;&#26469;&#25903;&#25345;&#36825;&#39033;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20114;&#32852;&#32593;&#30340;&#20852;&#36215;&#65292;&#25105;&#20204;&#30340;&#36890;&#20449;&#21644;&#24037;&#20316;&#26041;&#24335;&#21457;&#29983;&#20102;&#24040;&#22823;&#30340;&#21464;&#21270;&#12290;&#34429;&#28982;&#23427;&#20026;&#25105;&#20204;&#24102;&#26469;&#20102;&#26032;&#30340;&#26426;&#20250;&#65292;&#20294;&#20063;&#22686;&#21152;&#20102;&#32593;&#32476;&#23041;&#32961;&#12290;&#20854;&#20013;&#19968;&#31181;&#24120;&#35265;&#19988;&#20005;&#37325;&#30340;&#23041;&#32961;&#26159;&#32593;&#32476;&#38035;&#40060;&#65292;&#40657;&#23458;&#20351;&#29992;&#27450;&#39575;&#24615;&#26041;&#27861;&#31363;&#21462;&#25935;&#24863;&#20449;&#24687;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#22522;&#20110;HTML&#20869;&#23481;&#30340;&#20808;&#36827;&#26816;&#27979;&#27169;&#22411;&#65292;&#38024;&#23545;&#32593;&#32476;&#38035;&#40060;&#38382;&#39064;&#36827;&#34892;&#20102;&#25506;&#35752;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#38598;&#25104;&#20102;&#29992;&#20110;&#32467;&#26500;&#21270;&#34920;&#26684;&#25968;&#25454;&#30340;&#19987;&#38376;&#30340;&#22810;&#23618;&#24863;&#30693;&#22120;(MLP)&#27169;&#22411;&#21644;&#20004;&#20010;&#39044;&#35757;&#32451;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;(NLP)&#27169;&#22411;&#65292;&#20197;&#20998;&#26512;&#39029;&#38754;&#26631;&#39064;&#21644;&#20869;&#23481;&#31561;&#25991;&#26412;&#29305;&#24449;&#12290;&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#34701;&#21512;&#36807;&#31243;&#65292;&#36825;&#20123;&#27169;&#22411;&#29983;&#25104;&#30340;&#23884;&#20837;&#21521;&#37327;&#34987;&#21644;&#35856;&#22320;&#32452;&#21512;&#22312;&#19968;&#36215;&#65292;&#24182;&#36755;&#20837;&#21040;&#32447;&#24615;&#20998;&#31867;&#22120;&#20013;&#12290;&#37492;&#20110;&#30446;&#21069;&#32570;&#20047;&#20840;&#38754;&#30340;&#32593;&#32476;&#38035;&#40060;&#30740;&#31350;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#30340;&#36129;&#29486;&#36824;&#21253;&#25324;&#21019;&#24314;&#19968;&#20010;&#26368;&#26032;&#30340;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
The way we communicate and work has changed significantly with the rise of the Internet. While it has opened up new opportunities, it has also brought about an increase in cyber threats. One common and serious threat is phishing, where cybercriminals employ deceptive methods to steal sensitive information.This study addresses the pressing issue of phishing by introducing an advanced detection model that meticulously focuses on HTML content. Our proposed approach integrates a specialized Multi-Layer Perceptron (MLP) model for structured tabular data and two pretrained Natural Language Processing (NLP) models for analyzing textual features such as page titles and content. The embeddings from these models are harmoniously combined through a novel fusion process. The resulting fused embeddings are then input into a linear classifier. Recognizing the scarcity of recent datasets for comprehensive phishing research, our contribution extends to the creation of an up-to-date dataset, which we o
&lt;/p&gt;</description></item><item><title>SecureReg&#26159;&#19968;&#20010;&#32467;&#21512;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#22495;&#21517;&#27880;&#20876;&#36807;&#31243;&#20013;&#20027;&#21160;&#26292;&#38706;&#24694;&#24847;&#22495;&#21517;&#27880;&#20876;&#65292;&#25552;&#20379;&#20102;&#26089;&#26399;&#23041;&#32961;&#26816;&#27979;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#26174;&#33879;&#20943;&#23569;&#20102;&#28431;&#27934;&#31383;&#21475;&#65292;&#24182;&#20026;&#20027;&#21160;&#39044;&#38450;&#24615;&#25805;&#20316;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2401.03196</link><description>&lt;p&gt;
SecureReg:&#19968;&#20010;&#32467;&#21512;&#26041;&#27861;&#29992;&#20110;&#20027;&#21160;&#26292;&#38706;&#24694;&#24847;&#22495;&#21517;&#27880;&#20876;
&lt;/p&gt;
&lt;p&gt;
SecureReg: A Combined Framework for Proactively Exposing Malicious Domain Name Registrations. (arXiv:2401.03196v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03196
&lt;/p&gt;
&lt;p&gt;
SecureReg&#26159;&#19968;&#20010;&#32467;&#21512;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#22495;&#21517;&#27880;&#20876;&#36807;&#31243;&#20013;&#20027;&#21160;&#26292;&#38706;&#24694;&#24847;&#22495;&#21517;&#27880;&#20876;&#65292;&#25552;&#20379;&#20102;&#26089;&#26399;&#23041;&#32961;&#26816;&#27979;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#26174;&#33879;&#20943;&#23569;&#20102;&#28431;&#27934;&#31383;&#21475;&#65292;&#24182;&#20026;&#20027;&#21160;&#39044;&#38450;&#24615;&#25805;&#20316;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#32593;&#32476;&#23433;&#20840;&#23041;&#32961;&#19981;&#26029;&#22686;&#21152;&#65292;&#19981;&#27861;&#20998;&#23376;&#27599;&#22825;&#27880;&#20876;&#25968;&#21315;&#20010;&#26032;&#22495;&#21517;&#36827;&#34892;&#22403;&#22334;&#37038;&#20214;&#12289;&#32593;&#32476;&#38035;&#40060;&#21644;&#39537;&#21160;&#19979;&#36733;&#31561;&#20114;&#32852;&#32593;&#25915;&#20987;&#65292;&#24378;&#35843;&#20102;&#21019;&#26032;&#26816;&#27979;&#26041;&#27861;&#30340;&#38656;&#27714;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20808;&#36827;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#27880;&#20876;&#36807;&#31243;&#24320;&#22987;&#26102;&#35782;&#21035;&#21487;&#30097;&#22495;&#21517;&#12290;&#38468;&#24102;&#30340;&#25968;&#25454;&#27969;&#31243;&#36890;&#36807;&#27604;&#36739;&#26032;&#22495;&#21517;&#19982;&#27880;&#20876;&#22495;&#21517;&#20135;&#29983;&#20851;&#38190;&#29305;&#24449;&#65292;&#24378;&#35843;&#20102;&#20851;&#38190;&#30456;&#20284;&#24230;&#24471;&#20998;&#12290;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#25216;&#26415;&#30340;&#26032;&#39062;&#32452;&#21512;&#65292;&#21253;&#25324;&#39044;&#35757;&#32451;&#30340;Canine&#27169;&#22411;&#21644;&#22810;&#23618;&#24863;&#30693;&#22120;&#65288;MLP&#65289;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;&#31995;&#32479;&#20998;&#26512;&#35821;&#20041;&#21644;&#25968;&#20540;&#23646;&#24615;&#65292;&#20026;&#26089;&#26399;&#23041;&#32961;&#26816;&#27979;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#32508;&#21512;&#26041;&#27861;&#26174;&#33879;&#20943;&#23569;&#20102;&#28431;&#27934;&#31383;&#21475;&#65292;&#21152;&#24378;&#20102;&#23545;&#28508;&#22312;&#23041;&#32961;&#30340;&#38450;&#24481;&#12290;&#30740;&#31350;&#32467;&#26524;&#35777;&#26126;&#20102;&#35813;&#32508;&#21512;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#20026;&#24320;&#21457;&#20027;&#21160;&#39044;&#38450;&#24615;&#25805;&#20316;&#30340;&#21162;&#21147;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Rising cyber threats, with miscreants registering thousands of new domains daily for Internet-scale attacks like spam, phishing, and drive-by downloads, emphasize the need for innovative detection methods. This paper introduces a cutting-edge approach for identifying suspicious domains at the onset of the registration process. The accompanying data pipeline generates crucial features by comparing new domains to registered domains,emphasizing the crucial similarity score. Leveraging a novel combination of Natural Language Processing (NLP) techniques, including a pretrained Canine model, and Multilayer Perceptron (MLP) models, our system analyzes semantic and numerical attributes, providing a robust solution for early threat detection. This integrated approach significantly reduces the window of vulnerability, fortifying defenses against potential threats. The findings demonstrate the effectiveness of the integrated approach and contribute to the ongoing efforts in developing proactive s
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20351;&#29992;LLMs&#26469;&#29983;&#25104;&#30828;&#20214;&#30340;&#23433;&#20840;&#26029;&#35328;&#12290;&#36890;&#36807;&#20351;&#29992;&#33258;&#28982;&#35821;&#35328;&#25552;&#31034;&#29983;&#25104;SystemVerilog&#26029;&#35328;&#26469;&#26367;&#20195;&#32534;&#20889;&#20855;&#26377;&#25361;&#25112;&#30340;&#23433;&#20840;&#26029;&#35328;&#12290;</title><link>http://arxiv.org/abs/2306.14027</link><description>&lt;p&gt;
&#22522;&#20110;LLM&#30340;&#30828;&#20214;&#26029;&#35328;&#29983;&#25104;&#36741;&#21161;
&lt;/p&gt;
&lt;p&gt;
LLM-assisted Generation of Hardware Assertions. (arXiv:2306.14027v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14027
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20351;&#29992;LLMs&#26469;&#29983;&#25104;&#30828;&#20214;&#30340;&#23433;&#20840;&#26029;&#35328;&#12290;&#36890;&#36807;&#20351;&#29992;&#33258;&#28982;&#35821;&#35328;&#25552;&#31034;&#29983;&#25104;SystemVerilog&#26029;&#35328;&#26469;&#26367;&#20195;&#32534;&#20889;&#20855;&#26377;&#25361;&#25112;&#30340;&#23433;&#20840;&#26029;&#35328;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#31639;&#26426;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#36890;&#24120;&#20381;&#36182;&#20110;&#30828;&#20214;&#30340;&#23433;&#20840;&#24615;&#12290;&#30828;&#20214;&#28431;&#27934;&#23545;&#31995;&#32479;&#26377;&#20005;&#37325;&#24433;&#21709;&#65292;&#22240;&#27492;&#38656;&#35201;&#25216;&#26415;&#25903;&#25345;&#23433;&#20840;&#39564;&#35777;&#27963;&#21160;&#12290;&#26029;&#35328;&#39564;&#35777;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#39564;&#35777;&#25216;&#26415;&#65292;&#23427;&#28041;&#21450;&#22312;&#19968;&#32452;&#26029;&#35328;&#20013;&#25429;&#25417;&#35774;&#35745;&#24847;&#22270;&#65292;&#36825;&#20123;&#26029;&#35328;&#21487;&#29992;&#20110;&#24418;&#24335;&#39564;&#35777;&#25110;&#22522;&#20110;&#27979;&#35797;&#30340;&#26816;&#26597;&#12290;&#28982;&#32780;&#65292;&#32534;&#20889;&#20197;&#23433;&#20840;&#20026;&#20013;&#24515;&#30340;&#26029;&#35328;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20351;&#29992;&#26032;&#22411;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#36827;&#34892;&#30828;&#20214;&#26029;&#35328;&#29983;&#25104;&#30340;&#20195;&#30721;&#29983;&#25104;&#25216;&#26415;&#65292;&#20854;&#20013;&#20027;&#35201;&#20351;&#29992;&#33258;&#28982;&#35821;&#35328;&#25552;&#31034;&#65288;&#20363;&#22914;&#22312;&#26029;&#35328;&#25991;&#20214;&#20013;&#30475;&#21040;&#30340;&#20195;&#30721;&#27880;&#37322;&#65289;&#29983;&#25104;SystemVerilog&#26029;&#35328;&#12290;&#25105;&#20204;&#20851;&#27880;&#19968;&#31181;&#27969;&#34892;&#30340;LLM&#65292;&#24182;&#23545;&#20854;&#22312;&#32473;&#23450;&#19981;&#21516;&#35814;&#32454;&#32423;&#21035;&#30340;&#25552;&#31034;&#30340;&#24773;&#20917;&#19979;&#32534;&#20889;&#26029;&#35328;&#30340;&#33021;&#21147;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#35780;&#20272;&#26694;&#26550;&#65292;&#29983;&#25104;&#21508;&#31181;LLM&#36741;&#21161;&#19979;&#20135;&#29983;&#30340;&#31995;&#32479;&#26029;&#35328;&#24418;&#24335;&#36827;&#34892;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
The security of computer systems typically relies on a hardware root of trust. As vulnerabilities in hardware can have severe implications on a system, there is a need for techniques to support security verification activities. Assertion-based verification is a popular verification technique that involves capturing design intent in a set of assertions that can be used in formal verification or testing-based checking. However, writing security-centric assertions is a challenging task. In this work, we investigate the use of emerging large language models (LLMs) for code generation in hardware assertion generation for security, where primarily natural language prompts, such as those one would see as code comments in assertion files, are used to produce SystemVerilog assertions. We focus our attention on a popular LLM and characterize its ability to write assertions out of the box, given varying levels of detail in the prompt. We design an evaluation framework that generates a variety of 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;FedGT&#26694;&#26550;&#65292;&#36890;&#36807;&#32676;&#20307;&#27979;&#35797;&#30340;&#26041;&#27861;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35782;&#21035;&#24182;&#21024;&#38500;&#24694;&#24847;&#23458;&#25143;&#65292;&#20174;&#32780;&#24179;&#34913;&#20102;&#38544;&#31169;&#21644;&#23433;&#20840;&#65292;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#24182;&#25552;&#39640;&#20102;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2305.05506</link><description>&lt;p&gt;
&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#24179;&#34913;&#38544;&#31169;&#19982;&#23433;&#20840;&#65306;FedGT&#30340;&#32676;&#20307;&#27979;&#35797;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Balancing Privacy and Security in Federated Learning with FedGT: A Group Testing Framework. (arXiv:2305.05506v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05506
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;FedGT&#26694;&#26550;&#65292;&#36890;&#36807;&#32676;&#20307;&#27979;&#35797;&#30340;&#26041;&#27861;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35782;&#21035;&#24182;&#21024;&#38500;&#24694;&#24847;&#23458;&#25143;&#65292;&#20174;&#32780;&#24179;&#34913;&#20102;&#38544;&#31169;&#21644;&#23433;&#20840;&#65292;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#24182;&#25552;&#39640;&#20102;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;FedGT&#65292;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#24182;&#36827;&#34892;&#23433;&#20840;&#32858;&#21512;&#12290;&#21463;&#21040;&#32676;&#20307;&#27979;&#35797;&#30340;&#21551;&#21457;&#65292;&#35813;&#26694;&#26550;&#21033;&#29992;&#37325;&#21472;&#30340;&#23458;&#25143;&#32452;&#26469;&#26816;&#27979;&#24694;&#24847;&#23458;&#25143;&#30340;&#23384;&#22312;&#65292;&#24182;&#36890;&#36807;&#35793;&#30721;&#25805;&#20316;&#35782;&#21035;&#23427;&#20204;&#12290;&#28982;&#21518;&#65292;&#23558;&#36825;&#20123;&#34987;&#35782;&#21035;&#30340;&#23458;&#25143;&#20174;&#27169;&#22411;&#30340;&#35757;&#32451;&#20013;&#21024;&#38500;&#65292;&#24182;&#22312;&#20854;&#20313;&#23458;&#25143;&#20043;&#38388;&#25191;&#34892;&#35757;&#32451;&#12290;FedGT&#22312;&#38544;&#31169;&#21644;&#23433;&#20840;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#65292;&#20801;&#35768;&#25913;&#36827;&#35782;&#21035;&#33021;&#21147;&#21516;&#26102;&#20173;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#26381;&#21153;&#22120;&#23398;&#20064;&#27599;&#20010;&#32452;&#20013;&#23458;&#25143;&#30340;&#32858;&#21512;&#27169;&#22411;&#12290;&#36890;&#36807;&#23545;MNIST&#21644;CIFAR-10&#25968;&#25454;&#38598;&#36827;&#34892;&#22823;&#37327;&#23454;&#39564;&#65292;&#35777;&#26126;&#20102;FedGT&#30340;&#26377;&#25928;&#24615;&#65292;&#23637;&#31034;&#20102;&#20854;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#30340;&#33021;&#21147;&#65292;&#20855;&#26377;&#20302;&#35823;&#26816;&#21644;&#34394;&#35686;&#27010;&#29575;&#65292;&#20135;&#29983;&#39640;&#27169;&#22411;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose FedGT, a novel framework for identifying malicious clients in federated learning with secure aggregation. Inspired by group testing, the framework leverages overlapping groups of clients to detect the presence of malicious clients in the groups and to identify them via a decoding operation. The identified clients are then removed from the training of the model, which is performed over the remaining clients. FedGT strikes a balance between privacy and security, allowing for improved identification capabilities while still preserving data privacy. Specifically, the server learns the aggregated model of the clients in each group. The effectiveness of FedGT is demonstrated through extensive experiments on the MNIST and CIFAR-10 datasets, showing its ability to identify malicious clients with low misdetection and false alarm probabilities, resulting in high model utility.
&lt;/p&gt;</description></item></channel></rss>