<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#24341;&#20837;&#20102;&#19968;&#31181;&#24102;&#26377;&#29978;&#33267;&#31435;&#26041;&#38750;&#32447;&#24615;&#30340;&#31616;&#21333;&#23454;&#29616;&#28608;&#27963;&#20989;&#25968;&#65292;&#36890;&#36807;&#24341;&#20837;&#21487;&#20248;&#21270;&#21442;&#25968;&#20351;&#24471;&#28608;&#27963;&#20989;&#25968;&#20855;&#26377;&#26356;&#22823;&#30340;&#33258;&#30001;&#24230;&#65292;&#21487;&#20197;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#30340;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#19981;&#38656;&#35201;&#22826;&#22810;&#39069;&#22806;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;</title><link>https://arxiv.org/abs/2403.19896</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#22686;&#24378;&#33258;&#36866;&#24212;&#28608;&#27963;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Nonlinearity Enhanced Adaptive Activation Function
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19896
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#31181;&#24102;&#26377;&#29978;&#33267;&#31435;&#26041;&#38750;&#32447;&#24615;&#30340;&#31616;&#21333;&#23454;&#29616;&#28608;&#27963;&#20989;&#25968;&#65292;&#36890;&#36807;&#24341;&#20837;&#21487;&#20248;&#21270;&#21442;&#25968;&#20351;&#24471;&#28608;&#27963;&#20989;&#25968;&#20855;&#26377;&#26356;&#22823;&#30340;&#33258;&#30001;&#24230;&#65292;&#21487;&#20197;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#30340;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#19981;&#38656;&#35201;&#22826;&#22810;&#39069;&#22806;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#19968;&#31181;&#31616;&#21333;&#23454;&#29616;&#30340;&#28608;&#27963;&#20989;&#25968;&#65292;&#20855;&#26377;&#29978;&#33267;&#31435;&#26041;&#38750;&#32447;&#24615;&#65292;&#21487;&#20197;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#30340;&#20934;&#30830;&#24615;&#65292;&#32780;&#19981;&#38656;&#35201;&#22826;&#22810;&#39069;&#22806;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;&#36890;&#36807;&#19968;&#31181;&#26126;&#26174;&#30340;&#25910;&#25947;&#19982;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#26469;&#23454;&#29616;&#12290;&#35813;&#28608;&#27963;&#20989;&#25968;&#36890;&#36807;&#24341;&#20837;&#21487;&#20248;&#21270;&#21442;&#25968;&#26469;&#27867;&#21270;&#26631;&#20934;RELU&#20989;&#25968;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#39069;&#22806;&#30340;&#33258;&#30001;&#24230;&#65292;&#20351;&#24471;&#38750;&#32447;&#24615;&#31243;&#24230;&#21487;&#20197;&#34987;&#35843;&#25972;&#12290;&#36890;&#36807;&#19982;&#26631;&#20934;&#25216;&#26415;&#36827;&#34892;&#27604;&#36739;&#65292;&#23558;&#22312;MNIST&#25968;&#23383;&#25968;&#25454;&#38598;&#30340;&#32972;&#26223;&#19979;&#37327;&#21270;&#30456;&#20851;&#20934;&#30830;&#24615;&#30340;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19896v1 Announce Type: new  Abstract: A simply implemented activation function with even cubic nonlinearity is introduced that increases the accuracy of neural networks without substantial additional computational resources. This is partially enabled through an apparent tradeoff between convergence and accuracy. The activation function generalizes the standard RELU function by introducing additional degrees of freedom through optimizable parameters that enable the degree of nonlinearity to be adjusted. The associated accuracy enhancement is quantified in the context of the MNIST digit data set through a comparison with standard techniques.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#20026;&#32032;&#25551;&#34917;&#19969;&#37197;&#22791;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#20301;&#32622;&#32534;&#30721;&#26469;&#20445;&#25252;&#19981;&#21516;&#32472;&#22270;&#29256;&#26412;&#30340;&#26041;&#27861;&#65292;&#23558;&#32472;&#22270;&#39034;&#24207;&#20449;&#24687;&#23884;&#20837;&#22270;&#33410;&#28857;&#20013;&#65292;&#20197;&#26356;&#22909;&#22320;&#23398;&#20064;&#22270;&#24418;&#32032;&#25551;&#34920;&#31034;&#12290;</title><link>https://arxiv.org/abs/2403.17525</link><description>&lt;p&gt;
&#20026;&#22270;&#24418;&#32032;&#25551;&#34920;&#31034;&#35013;&#22791;&#20855;&#26377;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#20301;&#32622;&#32534;&#30721;&#30340;&#32032;&#25551;&#34917;&#19969;
&lt;/p&gt;
&lt;p&gt;
Equipping Sketch Patches with Context-Aware Positional Encoding for Graphic Sketch Representation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17525
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#20026;&#32032;&#25551;&#34917;&#19969;&#37197;&#22791;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#20301;&#32622;&#32534;&#30721;&#26469;&#20445;&#25252;&#19981;&#21516;&#32472;&#22270;&#29256;&#26412;&#30340;&#26041;&#27861;&#65292;&#23558;&#32472;&#22270;&#39034;&#24207;&#20449;&#24687;&#23884;&#20837;&#22270;&#33410;&#28857;&#20013;&#65292;&#20197;&#26356;&#22909;&#22320;&#23398;&#20064;&#22270;&#24418;&#32032;&#25551;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#24133;&#32032;&#25551;&#30340;&#32472;&#21046;&#39034;&#24207;&#35760;&#24405;&#20102;&#23427;&#26159;&#22914;&#20309;&#36880;&#31508;&#30001;&#20154;&#31867;&#21019;&#24314;&#30340;&#12290;&#23545;&#20110;&#22270;&#24418;&#32032;&#25551;&#34920;&#31034;&#23398;&#20064;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#36890;&#36807;&#26681;&#25454;&#22522;&#20110;&#26102;&#38388;&#30340;&#26368;&#36817;&#37051;&#31574;&#30053;&#23558;&#27599;&#20010;&#34917;&#19969;&#19982;&#21478;&#19968;&#20010;&#30456;&#36830;&#65292;&#23558;&#32032;&#25551;&#32472;&#22270;&#39034;&#24207;&#27880;&#20837;&#21040;&#22270;&#36793;&#26500;&#24314;&#20013;&#12290;&#28982;&#32780;&#65292;&#36825;&#26679;&#26500;&#24314;&#30340;&#22270;&#36793;&#21487;&#33021;&#19981;&#21487;&#38752;&#65292;&#22240;&#20026;&#32032;&#25551;&#21487;&#33021;&#26377;&#19981;&#21516;&#29256;&#26412;&#30340;&#32472;&#22270;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#32463;&#36807;&#21464;&#20307;&#32472;&#21046;&#20445;&#25252;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20026;&#32032;&#25551;&#34917;&#19969;&#37197;&#22791;&#20855;&#26377;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#20301;&#32622;&#32534;&#30721;(PE)&#65292;&#20197;&#26356;&#22909;&#22320;&#21033;&#29992;&#32472;&#22270;&#39034;&#24207;&#26469;&#23398;&#20064;&#22270;&#24418;&#32032;&#25551;&#34920;&#31034;&#12290;&#25105;&#20204;&#27809;&#26377;&#23558;&#32032;&#25551;&#32472;&#21046;&#27880;&#20837;&#21040;&#22270;&#36793;&#20013;&#65292;&#32780;&#26159;&#20165;&#23558;&#36825;&#20123;&#39034;&#24207;&#20449;&#24687;&#23884;&#20837;&#21040;&#22270;&#33410;&#28857;&#20013;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#27599;&#20010;&#34917;&#19969;&#23884;&#20837;&#37117;&#37197;&#22791;&#26377;&#27491;&#24358;&#32477;&#23545;PE&#65292;&#20197;&#31361;&#20986;&#32472;&#22270;&#39034;&#24207;&#20013;&#30340;&#39034;&#24207;&#20301;&#32622;&#12290;&#23427;&#30340;&#30456;&#37051;&#34917;&#19969;&#25353;self-att&#30340;&#20215;&#20540;&#25490;&#24207;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17525v1 Announce Type: cross  Abstract: The drawing order of a sketch records how it is created stroke-by-stroke by a human being. For graphic sketch representation learning, recent studies have injected sketch drawing orders into graph edge construction by linking each patch to another in accordance to a temporal-based nearest neighboring strategy. However, such constructed graph edges may be unreliable, since a sketch could have variants of drawings. In this paper, we propose a variant-drawing-protected method by equipping sketch patches with context-aware positional encoding (PE) to make better use of drawing orders for learning graphic sketch representation. Instead of injecting sketch drawings into graph edges, we embed these sequential information into graph nodes only. More specifically, each patch embedding is equipped with a sinusoidal absolute PE to highlight the sequential position in the drawing order. And its neighboring patches, ranked by the values of self-att
&lt;/p&gt;</description></item></channel></rss>