<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#25955;&#21435;&#22122;&#20316;&#20026;&#38024;&#23545;&#24178;&#20928;&#26631;&#31614;&#20013;&#27602;&#30340;&#35748;&#35777;&#38450;&#24481;&#65292;&#33021;&#23558;&#25915;&#20987;&#25104;&#21151;&#29575;&#38477;&#20302;&#21040;0-16%&#65292;&#21516;&#26102;&#20960;&#20046;&#19981;&#24433;&#21709;&#27979;&#35797;&#20934;&#30830;&#24615;&#65292;&#20026;&#26410;&#26469;&#24320;&#21457;&#26356;&#24378;&#24178;&#20928;&#26631;&#31614;&#25915;&#20987;&#21644;&#21033;&#29992;&#35813;&#38450;&#24481;&#25514;&#26045;&#20316;&#20026;&#24378;&#26377;&#21147;&#22522;&#30784;&#25552;&#20379;&#20102;&#37325;&#35201;&#21551;&#31034;&#12290;</title><link>https://arxiv.org/abs/2403.11981</link><description>&lt;p&gt;
&#25193;&#25955;&#21435;&#22122;&#20316;&#20026;&#19968;&#31181;&#38024;&#23545;&#24178;&#20928;&#26631;&#31614;&#20013;&#27602;&#30340;&#35748;&#35777;&#38450;&#24481;
&lt;/p&gt;
&lt;p&gt;
Diffusion Denoising as a Certified Defense against Clean-label Poisoning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11981
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#25955;&#21435;&#22122;&#20316;&#20026;&#38024;&#23545;&#24178;&#20928;&#26631;&#31614;&#20013;&#27602;&#30340;&#35748;&#35777;&#38450;&#24481;&#65292;&#33021;&#23558;&#25915;&#20987;&#25104;&#21151;&#29575;&#38477;&#20302;&#21040;0-16%&#65292;&#21516;&#26102;&#20960;&#20046;&#19981;&#24433;&#21709;&#27979;&#35797;&#20934;&#30830;&#24615;&#65292;&#20026;&#26410;&#26469;&#24320;&#21457;&#26356;&#24378;&#24178;&#20928;&#26631;&#31614;&#25915;&#20987;&#21644;&#21033;&#29992;&#35813;&#38450;&#24481;&#25514;&#26045;&#20316;&#20026;&#24378;&#26377;&#21147;&#22522;&#30784;&#25552;&#20379;&#20102;&#37325;&#35201;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#24178;&#20928;&#26631;&#31614;&#20013;&#27602;&#25915;&#20987;&#30340;&#35748;&#35777;&#38450;&#24481;&#26041;&#27861;&#12290;&#36825;&#20123;&#25915;&#20987;&#36890;&#36807;&#21521;&#35757;&#32451;&#25968;&#25454;&#20013;&#27880;&#20837;&#23569;&#37327;&#30340;&#27602;&#23475;&#26679;&#26412;&#65288;&#20363;&#22914;1%&#65289;&#65292;&#20854;&#20013;&#21253;&#21547;$p$-&#33539;&#25968;&#21463;&#38480;&#30340;&#23545;&#25239;&#24615;&#25200;&#21160;&#65292;&#20174;&#32780;&#35825;&#23548;&#23545;&#27979;&#35797;&#36755;&#20837;&#30340;&#30446;&#26631;&#35823;&#20998;&#31867;&#12290;&#21463;&#21040;$&#21435;&#22122;&#24179;&#28369;$&#23454;&#29616;&#30340;&#23545;&#25239;&#40065;&#26834;&#24615;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#19968;&#20010;&#29616;&#25104;&#30340;&#25193;&#25955;&#27169;&#22411;&#23545;&#31713;&#25913;&#30340;&#35757;&#32451;&#25968;&#25454;&#36827;&#34892;&#28040;&#27602;&#12290;&#25105;&#20204;&#24191;&#27867;&#27979;&#35797;&#20102;&#25105;&#20204;&#30340;&#38450;&#24481;&#25514;&#26045;&#23545;&#19971;&#31181;&#24178;&#20928;&#26631;&#31614;&#20013;&#27602;&#25915;&#20987;&#30340;&#38450;&#25252;&#25928;&#26524;&#65292;&#24182;&#19988;&#23558;&#23427;&#20204;&#30340;&#25915;&#20987;&#25104;&#21151;&#29575;&#38477;&#20302;&#21040;0-16%&#65292;&#21516;&#26102;&#27979;&#35797;&#20934;&#30830;&#24615;&#20960;&#20046;&#27809;&#26377;&#19979;&#38477;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#38450;&#24481;&#19982;&#29616;&#26377;&#30340;&#38024;&#23545;&#24178;&#20928;&#26631;&#31614;&#20013;&#27602;&#30340;&#23545;&#31574;&#36827;&#34892;&#27604;&#36739;&#65292;&#26174;&#31034;&#20986;&#25105;&#20204;&#30340;&#38450;&#24481;&#25928;&#26524;&#26368;&#20339;&#65292;&#24182;&#25552;&#20379;&#26368;&#20339;&#30340;&#27169;&#22411;&#25928;&#29992;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#20984;&#26174;&#20102;&#26410;&#26469;&#38656;&#35201;&#24320;&#23637;&#26356;&#24378;&#22823;&#30340;&#24178;&#20928;&#26631;&#31614;&#25915;&#20987;&#24182;&#20351;&#29992;&#25105;&#20204;&#30340;&#35748;&#35777;&#20294;&#23454;&#29992;&#30340;&#38450;&#24481;&#20316;&#20026;&#31283;&#22266;&#22522;&#30784;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11981v1 Announce Type: cross  Abstract: We present a certified defense to clean-label poisoning attacks. These attacks work by injecting a small number of poisoning samples (e.g., 1%) that contain $p$-norm bounded adversarial perturbations into the training data to induce a targeted misclassification of a test-time input. Inspired by the adversarial robustness achieved by $denoised$ $smoothing$, we show how an off-the-shelf diffusion model can sanitize the tampered training data. We extensively test our defense against seven clean-label poisoning attacks and reduce their attack success to 0-16% with only a negligible drop in the test time accuracy. We compare our defense with existing countermeasures against clean-label poisoning, showing that the defense reduces the attack success the most and offers the best model utility. Our results highlight the need for future work on developing stronger clean-label attacks and using our certified yet practical defense as a strong base
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#30456;&#20851;&#32852;&#30340;&#22270;&#20687;&#23545;AI&#29983;&#25104;&#25253;&#21578;&#36827;&#34892;&#20107;&#23454;&#26680;&#26597;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#21306;&#20998;&#25253;&#21578;&#20013;&#30340;&#30495;&#20551;&#21477;&#23376;&#12290;&#36825;&#23545;&#21152;&#24555;&#20020;&#24202;&#24037;&#20316;&#27969;&#31243;&#65292;&#25552;&#39640;&#20934;&#30830;&#24615;&#24182;&#38477;&#20302;&#24635;&#20307;&#25104;&#26412;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2307.14634</link><description>&lt;p&gt;
AI&#29983;&#25104;&#25253;&#21578;&#30340;&#20107;&#23454;&#26680;&#26597;
&lt;/p&gt;
&lt;p&gt;
Fact-Checking of AI-Generated Reports. (arXiv:2307.14634v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14634
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#30456;&#20851;&#32852;&#30340;&#22270;&#20687;&#23545;AI&#29983;&#25104;&#25253;&#21578;&#36827;&#34892;&#20107;&#23454;&#26680;&#26597;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#21306;&#20998;&#25253;&#21578;&#20013;&#30340;&#30495;&#20551;&#21477;&#23376;&#12290;&#36825;&#23545;&#21152;&#24555;&#20020;&#24202;&#24037;&#20316;&#27969;&#31243;&#65292;&#25552;&#39640;&#20934;&#30830;&#24615;&#24182;&#38477;&#20302;&#24635;&#20307;&#25104;&#26412;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30340;&#36827;&#27493;&#65292;&#29616;&#22312;&#21487;&#20197;&#29983;&#25104;&#36924;&#30495;&#30340;&#33258;&#21160;&#25253;&#21578;&#26469;&#23545;&#25918;&#23556;&#23398;&#22270;&#20687;&#36827;&#34892;&#21021;&#27493;&#38405;&#35835;&#12290;&#36825;&#21487;&#20197;&#21152;&#24555;&#20020;&#24202;&#24037;&#20316;&#27969;&#31243;&#65292;&#25552;&#39640;&#20934;&#30830;&#24615;&#24182;&#38477;&#20302;&#24635;&#20307;&#25104;&#26412;&#12290;&#28982;&#32780;&#65292;&#20247;&#25152;&#21608;&#30693;&#65292;&#36825;&#31181;&#27169;&#22411;&#24448;&#24448;&#20250;&#20135;&#29983;&#24187;&#35273;&#65292;&#23548;&#33268;&#29983;&#25104;&#25253;&#21578;&#20013;&#20986;&#29616;&#38169;&#35823;&#30340;&#21457;&#29616;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#30456;&#20851;&#32852;&#30340;&#22270;&#20687;&#23545;AI&#29983;&#25104;&#25253;&#21578;&#36827;&#34892;&#20107;&#23454;&#26680;&#26597;&#30340;&#26032;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36890;&#36807;&#23398;&#20064;&#22270;&#20687;&#19982;&#25551;&#36848;&#30495;&#23454;&#25110;&#28508;&#22312;&#34394;&#20551;&#21457;&#29616;&#30340;&#21477;&#23376;&#20043;&#38388;&#30340;&#20851;&#32852;&#65292;&#24320;&#21457;&#30340;&#26680;&#26597;&#32773;&#21306;&#20998;&#25253;&#21578;&#20013;&#30340;&#30495;&#20551;&#21477;&#23376;&#12290;&#20026;&#20102;&#35757;&#32451;&#36825;&#26679;&#30340;&#26680;&#26597;&#32773;&#65292;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#25200;&#21160;&#21407;&#22987;&#19982;&#22270;&#20687;&#30456;&#20851;&#30340;&#25918;&#23556;&#23398;&#25253;&#21578;&#20013;&#30340;&#21457;&#29616;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#20266;&#36896;&#25253;&#21578;&#25968;&#25454;&#38598;&#12290;&#28982;&#21518;&#23558;&#26469;&#33258;&#36825;&#20123;&#25253;&#21578;&#30340;&#30495;&#20551;&#21477;&#23376;&#30340;&#25991;&#26412;&#32534;&#30721;&#19982;&#22270;&#20687;&#32534;&#30721;&#37197;&#23545;&#65292;&#23398;&#20064;&#26144;&#23556;&#21040;&#30495;/&#20551;&#26631;&#31614;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
With advances in generative artificial intelligence (AI), it is now possible to produce realistic-looking automated reports for preliminary reads of radiology images. This can expedite clinical workflows, improve accuracy and reduce overall costs. However, it is also well-known that such models often hallucinate, leading to false findings in the generated reports. In this paper, we propose a new method of fact-checking of AI-generated reports using their associated images. Specifically, the developed examiner differentiates real and fake sentences in reports by learning the association between an image and sentences describing real or potentially fake findings. To train such an examiner, we first created a new dataset of fake reports by perturbing the findings in the original ground truth radiology reports associated with images. Text encodings of real and fake sentences drawn from these reports are then paired with image encodings to learn the mapping to real/fake labels. The utility 
&lt;/p&gt;</description></item></channel></rss>