<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>Serpent&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22270;&#20687;&#24674;&#22797;&#26550;&#26500;&#65292;&#21033;&#29992;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#22312;&#20840;&#23616;&#24863;&#21463;&#37326;&#21644;&#35745;&#31639;&#25928;&#29575;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#65292;&#23454;&#29616;&#20102;&#19982;&#26368;&#20808;&#36827;&#25216;&#26415;&#30456;&#24403;&#30340;&#37325;&#24314;&#36136;&#37327;&#65292;&#20294;&#35745;&#31639;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;</title><link>https://arxiv.org/abs/2403.17902</link><description>&lt;p&gt;
Serpent&#65306;&#36890;&#36807;&#22810;&#23610;&#24230;&#32467;&#26500;&#21270;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#23454;&#29616;&#21487;&#25193;&#23637;&#39640;&#25928;&#30340;&#22270;&#20687;&#24674;&#22797;
&lt;/p&gt;
&lt;p&gt;
Serpent: Scalable and Efficient Image Restoration via Multi-scale Structured State Space Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17902
&lt;/p&gt;
&lt;p&gt;
Serpent&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22270;&#20687;&#24674;&#22797;&#26550;&#26500;&#65292;&#21033;&#29992;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#22312;&#20840;&#23616;&#24863;&#21463;&#37326;&#21644;&#35745;&#31639;&#25928;&#29575;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#65292;&#23454;&#29616;&#20102;&#19982;&#26368;&#20808;&#36827;&#25216;&#26415;&#30456;&#24403;&#30340;&#37325;&#24314;&#36136;&#37327;&#65292;&#20294;&#35745;&#31639;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#25928;&#22270;&#20687;&#24674;&#22797;&#26550;&#26500;&#30340;&#35745;&#31639;&#24314;&#31569;&#22359;&#39046;&#22495;&#65292;&#20027;&#35201;&#30001;&#21367;&#31215;&#22788;&#29702;&#21644;&#21508;&#31181;&#27880;&#24847;&#26426;&#21046;&#30340;&#32452;&#21512;&#25152;&#20027;&#23548;&#12290;&#28982;&#32780;&#65292;&#21367;&#31215;&#28388;&#27874;&#22120;&#26412;&#36136;&#19978;&#26159;&#23616;&#37096;&#30340;&#65292;&#22240;&#27492;&#22312;&#24314;&#27169;&#22270;&#20687;&#30340;&#38271;&#36317;&#31163;&#20381;&#36182;&#24615;&#26041;&#38754;&#23384;&#22312;&#22256;&#38590;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#27880;&#24847;&#26426;&#21046;&#25797;&#38271;&#25429;&#33719;&#20219;&#24847;&#22270;&#20687;&#21306;&#22495;&#20043;&#38388;&#30340;&#20840;&#23616;&#30456;&#20114;&#20316;&#29992;&#65292;&#20294;&#23545;&#22270;&#20687;&#23610;&#23544;&#30340;&#20108;&#27425;&#25104;&#26412;&#36739;&#39640;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Serpent&#65292;&#36825;&#26159;&#19968;&#31181;&#21033;&#29992;&#26368;&#36817;&#22312;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;SSMs&#65289;&#26041;&#38754;&#30340;&#36827;&#23637;&#20316;&#20026;&#20854;&#26680;&#24515;&#35745;&#31639;&#27169;&#22359;&#30340;&#26550;&#26500;&#12290;SSMs&#26368;&#21021;&#29992;&#20110;&#24207;&#21015;&#24314;&#27169;&#65292;&#21487;&#20197;&#36890;&#36807;&#26377;&#21033;&#30340;&#36755;&#20837;&#23610;&#23544;&#30340;&#32447;&#24615;&#32553;&#25918;&#26469;&#32500;&#25345;&#20840;&#23616;&#24863;&#21463;&#37326;&#12290;&#25105;&#20204;&#30340;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;&#65292;Serpent&#21487;&#20197;&#23454;&#29616;&#19982;&#26368;&#20808;&#36827;&#25216;&#26415;&#30456;&#24403;&#30340;&#37325;&#24314;&#36136;&#37327;&#65292;&#21516;&#26102;&#38656;&#35201;&#25968;&#37327;&#32423;&#30340;&#35745;&#31639;&#37327;&#36739;&#23569;&#65288;&#22312;FLOPS&#19978;&#39640;&#36798;150&#20493;&#30340;&#20943;&#23569;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17902v1 Announce Type: cross  Abstract: The landscape of computational building blocks of efficient image restoration architectures is dominated by a combination of convolutional processing and various attention mechanisms. However, convolutional filters are inherently local and therefore struggle at modeling long-range dependencies in images. On the other hand, attention excels at capturing global interactions between arbitrary image regions, however at a quadratic cost in image dimension. In this work, we propose Serpent, an architecture that leverages recent advances in state space models (SSMs) in its core computational block. SSMs, originally introduced for sequence modeling, can maintain a global receptive field with a favorable linear scaling in input size. Our preliminary results demonstrate that Serpent can achieve reconstruction quality on par with state-of-the-art techniques, while requiring orders of magnitude less compute (up to $150$ fold reduction in FLOPS) an
&lt;/p&gt;</description></item><item><title>UrbanVLP&#26159;&#19968;&#31181;&#22810;&#31890;&#24230;&#20449;&#24687;&#38598;&#25104;&#30340;&#35270;&#35273;&#35821;&#35328;&#39044;&#35757;&#32451;&#27169;&#22411;&#65292;&#26088;&#22312;&#20811;&#26381;&#30446;&#21069;&#22478;&#24066;&#25351;&#26631;&#39044;&#27979;&#20013;&#39044;&#35757;&#32451;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#25552;&#39640;&#20102;&#21487;&#35299;&#37322;&#24615;&#21644;&#31934;&#24230;</title><link>https://arxiv.org/abs/2403.16831</link><description>&lt;p&gt;
UrbanVLP&#65306;&#29992;&#20110;&#22478;&#24066;&#25351;&#26631;&#39044;&#27979;&#30340;&#22810;&#31890;&#24230;&#35270;&#35273;&#35821;&#35328;&#39044;&#35757;&#32451;&#22522;&#30784;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
UrbanVLP: A Multi-Granularity Vision-Language Pre-Trained Foundation Model for Urban Indicator Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16831
&lt;/p&gt;
&lt;p&gt;
UrbanVLP&#26159;&#19968;&#31181;&#22810;&#31890;&#24230;&#20449;&#24687;&#38598;&#25104;&#30340;&#35270;&#35273;&#35821;&#35328;&#39044;&#35757;&#32451;&#27169;&#22411;&#65292;&#26088;&#22312;&#20811;&#26381;&#30446;&#21069;&#22478;&#24066;&#25351;&#26631;&#39044;&#27979;&#20013;&#39044;&#35757;&#32451;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#25552;&#39640;&#20102;&#21487;&#35299;&#37322;&#24615;&#21644;&#31934;&#24230;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22478;&#24066;&#25351;&#26631;&#39044;&#27979;&#26088;&#22312;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#25512;&#26029;&#19981;&#21516;&#22478;&#24066;&#26223;&#35266;&#20013;&#30340;&#31038;&#20250;&#32463;&#27982;&#25351;&#26631;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#27969;&#34892;&#30340;&#39044;&#35757;&#32451;&#27169;&#22411;&#65292;&#29305;&#21035;&#26159;&#20381;&#36182;&#21355;&#26143;&#22270;&#20687;&#30340;&#27169;&#22411;&#65292;&#38754;&#20020;&#30528;&#21452;&#37325;&#25361;&#25112;&#12290;&#39318;&#20808;&#65292;&#20165;&#38598;&#20013;&#22312;&#21355;&#26143;&#25968;&#25454;&#20013;&#30340;&#23439;&#35266;&#32423;&#21035;&#27169;&#24335;&#21487;&#33021;&#24341;&#20837;&#20559;&#35265;&#65292;&#22312;&#24494;&#35266;&#32423;&#21035;&#32570;&#20047;&#32454;&#33268;&#30340;&#32454;&#33410;&#65292;&#20363;&#22914;&#26576;&#22320;&#30340;&#24314;&#31569;&#32454;&#33410;&#12290;&#20854;&#27425;&#65292;&#39044;&#35757;&#32451;&#27169;&#22411;&#32570;&#20047;&#21487;&#35299;&#37322;&#24615;&#65292;&#38480;&#21046;&#20102;&#23427;&#20204;&#22312;&#25552;&#20379;&#22478;&#24066;&#35268;&#21010;&#36879;&#26126;&#35777;&#25454;&#26041;&#38754;&#30340;&#23454;&#29992;&#24615;&#12290;&#38024;&#23545;&#36825;&#20123;&#38382;&#39064;&#65292;&#26412;&#25991;&#35774;&#35745;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;Vision-Language Pre-Trained Model&#65288;UrbanVLP&#65289;&#12290;&#25105;&#20204;&#30340;UrbanVLP&#26080;&#32541;&#25972;&#21512;&#26469;&#33258;&#23439;&#35266;&#65288;&#21355;&#26143;&#65289;&#21644;&#24494;&#35266;&#65288;&#34903;&#26223;&#65289;&#32423;&#21035;&#30340;&#22810;&#31890;&#24230;&#20449;&#24687;&#65292;&#20811;&#26381;&#20102;&#20808;&#21069;&#39044;&#35757;&#32451;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#12290;&#27492;&#22806;&#65292;&#23427;&#24341;&#20837;&#20102;&#33258;&#21160;&#29983;&#25104;&#25991;&#26412;&#21644;&#26657;&#20934;&#65292;&#25552;&#39640;&#20102;&#22312;&#19979;&#28216;&#24212;&#29992;&#20013;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16831v1 Announce Type: cross  Abstract: Urban indicator prediction aims to infer socio-economic metrics in diverse urban landscapes using data-driven methods. However, prevalent pre-trained models, particularly those reliant on satellite imagery, face dual challenges. Firstly, concentrating solely on macro-level patterns from satellite data may introduce bias, lacking nuanced details at micro levels, such as architectural details at a place. Secondly, the lack of interpretability in pre-trained models limits their utility in providing transparent evidence for urban planning. In response to these issues, we devise a novel Vision-Language Pre-Trained Model (UrbanVLP) in this paper. Our UrbanVLP seamlessly integrates multi-granularity information from both macro (satellite) and micro (street-view) levels, overcoming the limitations of prior pre-trained models. Moreover, it introduces automatic text generation and calibration, elevating interpretability in downstream application
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26816;&#27979;&#30001;TTI&#27169;&#22411;&#29983;&#25104;&#30340;&#21345;&#36890;&#35282;&#33394;&#22270;&#20687;&#20013;&#35270;&#35273;&#24187;&#35273;&#30340;&#31995;&#32479;&#65292;&#36890;&#36807;&#32467;&#21512;&#23039;&#21183;&#24863;&#30693;&#19978;&#19979;&#25991;&#35270;&#35273;&#23398;&#20064;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#65292;&#21033;&#29992;RGB&#22270;&#20687;&#21644;&#23039;&#21183;&#20449;&#24687;&#65292;&#23454;&#29616;&#20102;&#26356;&#20934;&#30830;&#30340;&#20915;&#31574;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#35270;&#35273;&#24187;&#35273;&#30340;&#35782;&#21035;&#33021;&#21147;&#65292;&#25512;&#21160;&#20102;TTI&#27169;&#22411;&#22312;&#38750;&#29031;&#29255;&#30495;&#23454;&#39046;&#22495;&#30340;&#21457;&#23637;&#12290;</title><link>https://arxiv.org/abs/2403.15048</link><description>&lt;p&gt;
&#21345;&#36890;&#24187;&#35273;&#26816;&#27979;: &#23039;&#21183;&#24863;&#30693;&#19978;&#19979;&#25991;&#35270;&#35273;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Cartoon Hallucinations Detection: Pose-aware In Context Visual Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15048
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26816;&#27979;&#30001;TTI&#27169;&#22411;&#29983;&#25104;&#30340;&#21345;&#36890;&#35282;&#33394;&#22270;&#20687;&#20013;&#35270;&#35273;&#24187;&#35273;&#30340;&#31995;&#32479;&#65292;&#36890;&#36807;&#32467;&#21512;&#23039;&#21183;&#24863;&#30693;&#19978;&#19979;&#25991;&#35270;&#35273;&#23398;&#20064;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#65292;&#21033;&#29992;RGB&#22270;&#20687;&#21644;&#23039;&#21183;&#20449;&#24687;&#65292;&#23454;&#29616;&#20102;&#26356;&#20934;&#30830;&#30340;&#20915;&#31574;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#35270;&#35273;&#24187;&#35273;&#30340;&#35782;&#21035;&#33021;&#21147;&#65292;&#25512;&#21160;&#20102;TTI&#27169;&#22411;&#22312;&#38750;&#29031;&#29255;&#30495;&#23454;&#39046;&#22495;&#30340;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#25991;&#26412;&#21040;&#22270;&#20687;&#65288;TTI&#65289;&#27169;&#22411;&#24050;&#32463;&#25104;&#20026;&#21508;&#31181;&#29983;&#25104;&#39046;&#22495;&#20013;&#29983;&#25104;&#35757;&#32451;&#25968;&#25454;&#30340;&#24120;&#35265;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#35270;&#35273;&#24187;&#35273;&#65292;&#23588;&#20854;&#26159;&#22312;&#38750;&#29031;&#29255;&#30495;&#23454;&#39118;&#26684;&#22914;&#21345;&#36890;&#20154;&#29289;&#20013;&#21253;&#21547;&#20102;&#24863;&#30693;&#19978;&#20851;&#38190;&#30340;&#32570;&#38519;&#65292;&#20381;&#28982;&#26159;&#19968;&#20010;&#20196;&#20154;&#25285;&#24551;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29992;&#20110;&#26816;&#27979;TTI&#27169;&#22411;&#29983;&#25104;&#30340;&#21345;&#36890;&#35282;&#33394;&#22270;&#20687;&#30340;&#35270;&#35273;&#24187;&#35273;&#26816;&#27979;&#31995;&#32479;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#20102;&#23039;&#21183;&#24863;&#30693;&#19978;&#19979;&#25991;&#35270;&#35273;&#23398;&#20064;&#65288;PA-ICVL&#65289;&#19982;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#65288;VLMs&#65289;&#65292;&#21516;&#26102;&#21033;&#29992;RGB&#22270;&#20687;&#21644;&#23039;&#21183;&#20449;&#24687;&#12290;&#36890;&#36807;&#20174;&#19968;&#20010;&#32463;&#36807;&#24494;&#35843;&#30340;&#23039;&#21183;&#20272;&#35745;&#22120;&#20013;&#33719;&#24471;&#23039;&#21183;&#25351;&#23548;&#65292;&#25105;&#20204;&#20351;VLM&#33021;&#22815;&#20570;&#20986;&#26356;&#20934;&#30830;&#30340;&#20915;&#31574;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#35782;&#21035;&#35270;&#35273;&#24187;&#35273;&#26041;&#38754;&#65292;&#19982;&#20165;&#20381;&#36182;&#20110;RGB&#22270;&#20687;&#30340;&#22522;&#32447;&#26041;&#27861;&#30456;&#27604;&#65292;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#20943;&#36731;&#35270;&#35273;&#24187;&#35273;&#65292;&#25512;&#21160;&#20102;TTI&#27169;&#22411;&#22312;&#38750;&#29031;&#29255;&#30495;&#23454;&#39046;&#22495;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15048v1 Announce Type: cross  Abstract: Large-scale Text-to-Image (TTI) models have become a common approach for generating training data in various generative fields. However, visual hallucinations, which contain perceptually critical defects, remain a concern, especially in non-photorealistic styles like cartoon characters. We propose a novel visual hallucination detection system for cartoon character images generated by TTI models. Our approach leverages pose-aware in-context visual learning (PA-ICVL) with Vision-Language Models (VLMs), utilizing both RGB images and pose information. By incorporating pose guidance from a fine-tuned pose estimator, we enable VLMs to make more accurate decisions. Experimental results demonstrate significant improvements in identifying visual hallucinations compared to baseline methods relying solely on RGB images. This research advances TTI models by mitigating visual hallucinations, expanding their potential in non-photorealistic domains.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#30417;&#30563;&#39044;&#35757;&#32451;&#26041;&#27861;MaPeT&#65292;&#19981;&#21516;&#20110;&#29616;&#26377;&#30340;&#20351;&#29992;&#25513;&#30721;&#22270;&#20687;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#33258;&#22238;&#24402;&#21644;&#32622;&#25442;&#39044;&#27979;&#26469;&#25429;&#33719;&#22270;&#20687;&#22359;&#20869;&#30340;&#20381;&#36182;&#20851;&#31995;&#24182;&#20943;&#23569;&#25968;&#25454;&#22122;&#22768;&#30340;&#24433;&#21709;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#19979;&#28216;&#20219;&#21153;&#30340;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.07346</link><description>&lt;p&gt;
&#23398;&#20064;&#29992;&#20110;&#35270;&#35273;Transformer&#39044;&#35757;&#32451;&#30340;&#25513;&#30721;&#21644;&#32622;&#25442;&#35270;&#35273;&#20196;&#29260;&#12290;
&lt;/p&gt;
&lt;p&gt;
Learning to Mask and Permute Visual Tokens for Vision Transformer Pre-Training. (arXiv:2306.07346v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07346
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#30417;&#30563;&#39044;&#35757;&#32451;&#26041;&#27861;MaPeT&#65292;&#19981;&#21516;&#20110;&#29616;&#26377;&#30340;&#20351;&#29992;&#25513;&#30721;&#22270;&#20687;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#33258;&#22238;&#24402;&#21644;&#32622;&#25442;&#39044;&#27979;&#26469;&#25429;&#33719;&#22270;&#20687;&#22359;&#20869;&#30340;&#20381;&#36182;&#20851;&#31995;&#24182;&#20943;&#23569;&#25968;&#25454;&#22122;&#22768;&#30340;&#24433;&#21709;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#19979;&#28216;&#20219;&#21153;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#33258;&#30417;&#30563;&#39044;&#35757;&#32451;&#25216;&#26415;&#24050;&#25104;&#20026;&#25552;&#39640;&#22270;&#20687;&#20998;&#31867;&#31561;&#35270;&#35273;&#20219;&#21153;&#24615;&#33021;&#30340;&#26377;&#21069;&#36884;&#30340;&#26041;&#27861;&#12290;&#26368;&#36817;&#30340;&#26041;&#27861;&#20351;&#29992;&#25513;&#30721;&#22270;&#20687;&#27169;&#22411;&#33539;&#24335;&#65292;&#36890;&#36807;&#37325;&#26500;&#19982;&#38543;&#26426;&#25513;&#30721;&#22270;&#20687;&#22359;&#30456;&#20851;&#32852;&#30340;&#35270;&#35273;&#20196;&#29260;&#26469;&#39044;&#35757;&#32451;&#39592;&#24178;&#32593;&#32476;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#25513;&#34109;&#26041;&#27861;&#20250;&#22312;&#39044;&#35757;&#32451;&#36807;&#31243;&#20013;&#24341;&#20837;&#22122;&#22768;&#36827;&#20837;&#36755;&#20837;&#25968;&#25454;&#65292;&#23548;&#33268;&#24615;&#33021;&#19979;&#38477;&#12290;&#27492;&#22806;&#65292;&#36755;&#20837;&#25513;&#34109;&#24573;&#30053;&#20102;&#21463;&#25439;&#22359;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#22686;&#21152;&#20102;&#19979;&#28216;&#24494;&#35843;&#20219;&#21153;&#20013;&#35266;&#23519;&#21040;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#30417;&#30563;&#39044;&#35757;&#32451;&#26041;&#27861;&#65292;&#21517;&#20026;&#25513;&#34109;&#21644;&#32622;&#25442;&#35270;&#35273;&#21464;&#21387;&#22120;&#65288;MaPeT&#65289;&#65292;&#23427;&#20351;&#29992;&#33258;&#22238;&#24402;&#21644;&#32622;&#25442;&#39044;&#27979;&#26469;&#25429;&#33719;&#22359;&#20869;&#20381;&#36182;&#24615;&#12290;&#27492;&#22806;&#65292;MaPeT&#20351;&#29992;&#36741;&#21161;&#20301;&#32622;&#20449;&#24687;&#26469;&#20943;&#23569;&#39044;&#35757;&#32451;&#21644;&#24494;&#35843;&#38454;&#27573;&#20013;&#30340;&#24046;&#24322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The use of self-supervised pre-training has emerged as a promising approach to enhance the performance of visual tasks such as image classification. In this context, recent approaches have employed the Masked Image Modeling paradigm, which pre-trains a backbone by reconstructing visual tokens associated with randomly masked image patches. This masking approach, however, introduces noise into the input data during pre-training, leading to discrepancies that can impair performance during the fine-tuning phase. Furthermore, input masking neglects the dependencies between corrupted patches, increasing the inconsistencies observed in downstream fine-tuning tasks. To overcome these issues, we propose a new self-supervised pre-training approach, named Masked and Permuted Vision Transformer (MaPeT), that employs autoregressive and permuted predictions to capture intra-patch dependencies. In addition, MaPeT employs auxiliary positional information to reduce the disparity between the pre-trainin
&lt;/p&gt;</description></item></channel></rss>