<rss version="2.0"><channel><title>Chat Arxiv cs.CG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CG</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#28151;&#21512;&#26465;&#24418;&#30721;&#30340;&#26032;&#26041;&#27861;&#65292;&#21033;&#29992;&#26631;&#20934;&#25345;&#20037;&#21516;&#35843;&#19982;&#22270;&#20687;&#25345;&#20037;&#21516;&#35843;&#32467;&#21512;&#65292;&#21487;&#20197;&#37327;&#21270;&#20219;&#24847;&#32500;&#24230;&#20004;&#20010;&#28857;&#38598;&#20043;&#38388;&#30340;&#20960;&#20309;-&#25299;&#25169;&#30456;&#20114;&#20316;&#29992;&#65292;&#20197;&#21450;&#24341;&#20837;&#31616;&#21333;&#30340;&#32479;&#35745;&#37327;&#26469;&#37327;&#21270;&#36825;&#31181;&#30456;&#20114;&#20316;&#29992;&#30340;&#22797;&#26434;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.15058</link><description>&lt;p&gt;
&#28151;&#21512;&#26465;&#24418;&#30721;&#65306;&#37327;&#21270;&#28857;&#20113;&#20043;&#38388;&#30340;&#20960;&#20309;-&#25299;&#25169;&#30456;&#20114;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Mixup Barcodes: Quantifying Geometric-Topological Interactions between Point Clouds
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15058
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#28151;&#21512;&#26465;&#24418;&#30721;&#30340;&#26032;&#26041;&#27861;&#65292;&#21033;&#29992;&#26631;&#20934;&#25345;&#20037;&#21516;&#35843;&#19982;&#22270;&#20687;&#25345;&#20037;&#21516;&#35843;&#32467;&#21512;&#65292;&#21487;&#20197;&#37327;&#21270;&#20219;&#24847;&#32500;&#24230;&#20004;&#20010;&#28857;&#38598;&#20043;&#38388;&#30340;&#20960;&#20309;-&#25299;&#25169;&#30456;&#20114;&#20316;&#29992;&#65292;&#20197;&#21450;&#24341;&#20837;&#31616;&#21333;&#30340;&#32479;&#35745;&#37327;&#26469;&#37327;&#21270;&#36825;&#31181;&#30456;&#20114;&#20316;&#29992;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;&#26631;&#20934;&#25345;&#20037;&#21516;&#35843;&#19982;&#22270;&#20687;&#25345;&#20037;&#21516;&#35843;&#30456;&#32467;&#21512;&#65292;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#34920;&#24449;&#24418;&#29366;&#21644;&#23427;&#20204;&#20043;&#38388;&#30456;&#20114;&#20316;&#29992;&#30340;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#65306;&#65288;1&#65289;&#28151;&#21512;&#26465;&#24418;&#30721;&#65292;&#25429;&#25417;&#20219;&#24847;&#32500;&#24230;&#20004;&#20010;&#28857;&#38598;&#20043;&#38388;&#30340;&#20960;&#20309;-&#25299;&#25169;&#30456;&#20114;&#20316;&#29992;&#65288;&#28151;&#21512;&#65289;&#65307;&#65288;2&#65289;&#31616;&#21333;&#30340;&#24635;&#28151;&#21512;&#21644;&#24635;&#30334;&#20998;&#27604;&#28151;&#21512;&#32479;&#35745;&#37327;&#65292;&#20316;&#20026;&#19968;&#20010;&#21333;&#19968;&#25968;&#23383;&#26469;&#37327;&#21270;&#30456;&#20114;&#20316;&#29992;&#30340;&#22797;&#26434;&#24615;&#65307;&#65288;3&#65289;&#19968;&#20010;&#29992;&#20110;&#25805;&#20316;&#19978;&#36848;&#24037;&#20855;&#30340;&#36719;&#20214;&#24037;&#20855;&#12290;&#20316;&#20026;&#19968;&#20010;&#27010;&#24565;&#39564;&#35777;&#65292;&#25105;&#20204;&#23558;&#35813;&#24037;&#20855;&#24212;&#29992;&#21040;&#19968;&#20010;&#28304;&#33258;&#26426;&#22120;&#23398;&#20064;&#30340;&#38382;&#39064;&#19978;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#31867;&#21035;&#23884;&#20837;&#30340;&#21487;&#20998;&#31163;&#24615;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25299;&#25169;&#28151;&#21512;&#26159;&#19968;&#31181;&#29992;&#20110;&#34920;&#24449;&#20302;&#32500;&#21644;&#39640;&#32500;&#25968;&#25454;&#20132;&#20114;&#30340;&#26377;&#25928;&#26041;&#27861;&#12290;&#19982;&#25345;&#20037;&#21516;&#35843;&#30340;&#20856;&#22411;&#29992;&#27861;&#30456;&#27604;&#65292;&#36825;&#20010;&#26032;&#24037;&#20855;&#23545;&#20110;&#25299;&#25169;&#29305;&#24449;&#30340;&#20960;&#20309;&#20301;&#32622;&#26356;&#20026;&#25935;&#24863;&#65292;&#36825;&#36890;&#24120;&#26159;&#21487;&#21462;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15058v1 Announce Type: cross  Abstract: We combine standard persistent homology with image persistent homology to define a novel way of characterizing shapes and interactions between them. In particular, we introduce: (1) a mixup barcode, which captures geometric-topological interactions (mixup) between two point sets in arbitrary dimension; (2) simple summary statistics, total mixup and total percentage mixup, which quantify the complexity of the interactions as a single number; (3) a software tool for playing with the above.   As a proof of concept, we apply this tool to a problem arising from machine learning. In particular, we study the disentanglement in embeddings of different classes. The results suggest that topological mixup is a useful method for characterizing interactions for low and high-dimensional data. Compared to the typical usage of persistent homology, the new tool is sensitive to the geometric locations of the topological features, which is often desirabl
&lt;/p&gt;</description></item></channel></rss>