<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#36890;&#36807;&#21338;&#24328;&#35770;&#26041;&#27861;&#25506;&#35752;PinFi&#26426;&#21046;&#21450;&#20854;&#26356;&#24191;&#27867;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;PinFi&#33021;&#22815;&#22312;LPs&#12289;&#21334;&#23478;&#21644;&#20080;&#23478;&#20043;&#38388;&#24314;&#31435;&#21160;&#24577;&#22343;&#34913;&#12290;</title><link>https://arxiv.org/abs/2404.02174</link><description>&lt;p&gt;
&#35802;&#23454;&#30340;PinFi&#31995;&#32479;&#20013;&#22359;&#22870;&#21169;&#30340;&#36793;&#30028;
&lt;/p&gt;
&lt;p&gt;
Bounds of Block Rewards in Honest PinFi Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02174
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21338;&#24328;&#35770;&#26041;&#27861;&#25506;&#35752;PinFi&#26426;&#21046;&#21450;&#20854;&#26356;&#24191;&#27867;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;PinFi&#33021;&#22815;&#22312;LPs&#12289;&#21334;&#23478;&#21644;&#20080;&#23478;&#20043;&#38388;&#24314;&#31435;&#21160;&#24577;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
PinFi&#26159;&#19968;&#31867;&#26032;&#22411;&#30340;&#21327;&#35758;&#65292;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#23450;&#20215;&#36880;&#28176;&#36140;&#20540;&#30340;&#36164;&#20135;&#65292;&#20854;&#20215;&#20540;&#38543;&#30528;&#26102;&#38388;&#33258;&#28982;&#19979;&#38477;&#12290;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#22312;&#21327;&#35758;&#21151;&#33021;&#21644;&#24066;&#22330;&#25928;&#29575;&#20013;&#36215;&#30528;&#26680;&#24515;&#20316;&#29992;&#12290;&#26412;&#30740;&#31350;&#35299;&#20915;&#20102;&#21327;&#35758;&#20013;&#30340;&#20851;&#38190;&#31283;&#23450;&#24615;&#21644;&#21487;&#25345;&#32493;&#24615;&#25361;&#25112;&#65292;&#21363;LPs&#26356;&#20542;&#21521;&#20110;&#22312;&#22806;&#37096;&#24066;&#22330;&#20986;&#21806;&#32780;&#38750;&#21442;&#19982;&#21327;&#35758;&#65307;&#22312;PinFi&#31995;&#32479;&#20869;&#20986;&#21806;&#32780;&#38750;&#20316;&#20026;LPs&#36827;&#34892;&#36129;&#29486;&#65307;&#20197;&#21450;LPs&#19981;&#24895;&#22312;&#21327;&#35758;&#20869;&#20986;&#21806;&#30340;&#22330;&#26223;&#12290;&#25105;&#20204;&#37319;&#29992;&#21338;&#24328;&#35770;&#26041;&#27861;&#25506;&#35752;PinFi&#30340;&#26426;&#21046;&#21450;&#20854;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21508;&#31181;&#24120;&#35265;&#26465;&#20214;&#19979;&#65292;&#24182;&#19988;&#20551;&#35774;&#21442;&#19982;&#32773;&#35802;&#23454;&#65292;PinFi&#33021;&#22815;&#22312;LPs&#12289;&#21334;&#23478;&#21644;&#20080;&#23478;&#20043;&#38388;&#24314;&#31435;&#21160;&#24577;&#22343;&#34913;&#12290;&#36825;&#31181;&#24179;&#34913;&#26159;&#36890;&#36807;&#31934;&#24515;&#26657;&#20934;&#30340;&#22870;&#21169;&#26426;&#21046;&#26469;&#32500;&#25345;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02174v1 Announce Type: cross  Abstract: PinFi is a class of novel protocols for decentralized pricing of dissipative assets, whose value naturally declines over time. Central to the protocol's functionality and its market efficiency is the role of liquidity providers (LPs). This study addresses critical stability and sustainability challenges within the protocol, namely: the propensity of LPs to prefer selling in external markets over participation in the protocol; a similar inclination towards selling within the PinFi system rather than contributing as LPs; and a scenario where LPs are disinclined to sell within the protocol. Employing a game-theoretic approach, we explore PinFi's mechanisms and its broader ramifications. Our findings reveal that, under a variety of common conditions and with an assumption of participant integrity, PinFi is capable of fostering a dynamic equilibrium among LPs, sellers, and buyers. This balance is maintained through a carefully calibrated ra
&lt;/p&gt;</description></item></channel></rss>