<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#33258;&#21160;&#24341;&#23548;&#36710;&#30340;&#22312;&#32447;&#12289;&#26080;&#20914;&#31361;&#35843;&#24230;&#21644;&#36335;&#24452;&#35268;&#21010;&#38382;&#39064;&#30340;&#22522;&#20110;&#24490;&#29615;&#22270;&#30340;&#31639;&#27861;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#35813;&#31639;&#27861;&#35201;&#20040;&#20248;&#20110;&#20854;&#20182;&#31639;&#27861;&#65292;&#35201;&#20040;&#22312;&#26356;&#30701;&#30340;&#35745;&#31639;&#26102;&#38388;&#20869;&#33719;&#24471;&#21516;&#26679;&#33391;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;</title><link>https://arxiv.org/abs/2310.02195</link><description>&lt;p&gt;
&#39640;&#25928;&#22312;&#32447;&#35843;&#24230;&#21644;&#36335;&#24452;&#35268;&#21010;&#65306;&#22522;&#20110;&#24490;&#29615;&#22270;&#30340;&#33258;&#21160;&#24341;&#23548;&#36710;
&lt;/p&gt;
&lt;p&gt;
Efficient Online Scheduling and Routing for Automated Guided Vehicles In Loop-Based Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2310.02195
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#33258;&#21160;&#24341;&#23548;&#36710;&#30340;&#22312;&#32447;&#12289;&#26080;&#20914;&#31361;&#35843;&#24230;&#21644;&#36335;&#24452;&#35268;&#21010;&#38382;&#39064;&#30340;&#22522;&#20110;&#24490;&#29615;&#22270;&#30340;&#31639;&#27861;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#35813;&#31639;&#27861;&#35201;&#20040;&#20248;&#20110;&#20854;&#20182;&#31639;&#27861;&#65292;&#35201;&#20040;&#22312;&#26356;&#30701;&#30340;&#35745;&#31639;&#26102;&#38388;&#20869;&#33719;&#24471;&#21516;&#26679;&#33391;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#24341;&#23548;&#36710;&#65288;AGVs&#65289;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#34892;&#21508;&#19994;&#65292;&#20197;&#26080;&#20914;&#31361;&#26041;&#24335;&#23545;&#23427;&#20204;&#36827;&#34892;&#35843;&#24230;&#21644;&#36335;&#24452;&#35268;&#21010;&#23545;&#20110;&#23427;&#20204;&#30340;&#39640;&#25928;&#36816;&#34892;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24490;&#29615;&#22270;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#20219;&#24847;&#23481;&#37327;&#21644;&#39034;&#24207;&#20316;&#19994;&#30340;AGVs&#30340;&#22312;&#32447;&#12289;&#26080;&#20914;&#31361;&#35843;&#24230;&#21644;&#36335;&#24452;&#35268;&#21010;&#38382;&#39064;&#12290;&#35813;&#31639;&#27861;&#19982;&#31934;&#30830;&#26041;&#27861;&#12289;&#36138;&#23146;&#21551;&#21457;&#24335;&#26041;&#27861;&#21644;&#20803;&#21551;&#21457;&#24335;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#20195;&#34920;&#23454;&#38469;&#21046;&#36896;&#21378;&#30340;&#27169;&#22411;&#19978;&#20351;&#29992;&#29702;&#35770;&#21644;&#30495;&#23454;&#23454;&#20363;&#36827;&#34892;&#23454;&#39564;&#65292;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#35201;&#20040;&#20248;&#20110;&#20854;&#20182;&#31639;&#27861;&#65292;&#35201;&#20040;&#22312;&#26356;&#30701;&#30340;&#35745;&#31639;&#26102;&#38388;&#20869;&#33719;&#24471;&#21516;&#26679;&#33391;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2310.02195v2 Announce Type: replace-cross  Abstract: Automated guided vehicles (AGVs) are widely used in various industries, and scheduling and routing them in a conflict-free manner is crucial to their efficient operation. We propose a loop-based algorithm that solves the online, conflict-free scheduling and routing problem for AGVs with any capacity and ordered jobs in loop-based graphs. The proposed algorithm is compared against an exact method, a greedy heuristic and a metaheuristic. We experimentally show, using theoretical and real instances on a model representing a real manufacturing plant, that this algorithm either outperforms the other algorithms or gets an equally good solution in less computing time.
&lt;/p&gt;</description></item></channel></rss>