<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>ProtChatGPT&#26159;&#19968;&#20010;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#31995;&#32479;&#65292;&#36890;&#36807;&#33258;&#28982;&#35821;&#35328;&#23398;&#20064;&#21644;&#29702;&#35299;&#34507;&#30333;&#36136;&#32467;&#26500;&#65292;&#20026;&#29992;&#25143;&#25552;&#20379;&#19978;&#20256;&#34507;&#30333;&#36136;&#12289;&#25552;&#38382;&#21644;&#20132;&#20114;&#24335;&#23545;&#35805;&#31561;&#21151;&#33021;&#65292;&#26377;&#21161;&#20110;&#36827;&#19968;&#27493;&#29702;&#35299;&#34507;&#30333;&#36136;&#30340;&#32467;&#26500;&#19982;&#21151;&#33021;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2402.09649</link><description>&lt;p&gt;
ProtChatGPT&#65306;&#29992;&#20110;&#29702;&#35299;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#30340;&#34507;&#30333;&#36136;
&lt;/p&gt;
&lt;p&gt;
ProtChatGPT: Towards Understanding Proteins with Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09649
&lt;/p&gt;
&lt;p&gt;
ProtChatGPT&#26159;&#19968;&#20010;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#31995;&#32479;&#65292;&#36890;&#36807;&#33258;&#28982;&#35821;&#35328;&#23398;&#20064;&#21644;&#29702;&#35299;&#34507;&#30333;&#36136;&#32467;&#26500;&#65292;&#20026;&#29992;&#25143;&#25552;&#20379;&#19978;&#20256;&#34507;&#30333;&#36136;&#12289;&#25552;&#38382;&#21644;&#20132;&#20114;&#24335;&#23545;&#35805;&#31561;&#21151;&#33021;&#65292;&#26377;&#21161;&#20110;&#36827;&#19968;&#27493;&#29702;&#35299;&#34507;&#30333;&#36136;&#30340;&#32467;&#26500;&#19982;&#21151;&#33021;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34507;&#30333;&#36136;&#30740;&#31350;&#22312;&#21508;&#20010;&#22522;&#30784;&#23398;&#31185;&#20013;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#29702;&#35299;&#20854;&#22797;&#26434;&#30340;&#32467;&#26500;&#19982;&#21151;&#33021;&#20851;&#31995;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26368;&#36817;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#29702;&#35299;&#29305;&#23450;&#20219;&#21153;&#30340;&#30693;&#35782;&#26041;&#38754;&#21462;&#24471;&#20102;&#37325;&#22823;&#36827;&#23637;&#65292;&#36825;&#34920;&#26126;&#20102;&#29992;&#20110;&#34507;&#30333;&#36136;&#30340;ChatGPT-like&#31995;&#32479;&#22312;&#20419;&#36827;&#22522;&#30784;&#30740;&#31350;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;ProtChatGPT&#65292;&#26088;&#22312;&#36890;&#36807;&#33258;&#28982;&#35821;&#35328;&#23398;&#20064;&#21644;&#29702;&#35299;&#34507;&#30333;&#36136;&#32467;&#26500;&#12290;ProtChatGPT&#20351;&#29992;&#25143;&#21487;&#20197;&#19978;&#20256;&#34507;&#30333;&#36136;&#12289;&#25552;&#38382;&#24182;&#36827;&#34892;&#20132;&#20114;&#24335;&#23545;&#35805;&#20197;&#20135;&#29983;&#20840;&#38754;&#30340;&#22238;&#31572;&#12290;&#35813;&#31995;&#32479;&#21253;&#25324;&#34507;&#30333;&#32534;&#30721;&#22120;&#12289;&#34507;&#30333;&#35821;&#35328;&#30456;&#20851;&#36716;&#25442;&#22120;&#65288;PLP-former&#65289;&#12289;&#25237;&#24433;&#36866;&#37197;&#22120;&#21644;LLM&#12290;&#34507;&#30333;&#36136;&#39318;&#20808;&#36890;&#36807;&#34507;&#30333;&#32534;&#30721;&#22120;&#21644;PLP-former&#36827;&#34892;&#32534;&#30721;&#20197;&#20135;&#29983;&#34507;&#30333;&#36136;&#23884;&#20837;&#65292;&#28982;&#21518;&#36890;&#36807;&#36866;&#37197;&#22120;&#23558;&#20854;&#25237;&#23556;&#21040;&#19982;LLM&#30456;&#31526;&#21512;&#12290;&#26368;&#21518;&#65292;LLM&#23558;&#29992;&#25143;&#30340;&#38382;&#39064;&#19982;&#34507;&#30333;&#36136;&#23884;&#20837;&#36827;&#34892;&#32508;&#21512;&#22788;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09649v1 Announce Type: cross  Abstract: Protein research is crucial in various fundamental disciplines, but understanding their intricate structure-function relationships remains challenging. Recent Large Language Models (LLMs) have made significant strides in comprehending task-specific knowledge, suggesting the potential for ChatGPT-like systems specialized in protein to facilitate basic research. In this work, we introduce ProtChatGPT, which aims at learning and understanding protein structures via natural languages. ProtChatGPT enables users to upload proteins, ask questions, and engage in interactive conversations to produce comprehensive answers. The system comprises protein encoders, a Protein-Language Pertaining Transformer (PLP-former), a projection adapter, and an LLM. The protein first undergoes protein encoders and PLP-former to produce protein embeddings, which are then projected by the adapter to conform with the LLM. The LLM finally combines user questions wit
&lt;/p&gt;</description></item></channel></rss>