<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>ClaimVer&#26159;&#19968;&#20010;&#20154;&#20026;&#20013;&#24515;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#30693;&#35782;&#22270;&#35889;&#23454;&#29616;&#21487;&#35299;&#37322;&#30340;&#22768;&#26126;&#32423;&#39564;&#35777;&#21644;&#35777;&#25454;&#24402;&#22240;&#65292;&#33268;&#21147;&#20110;&#25552;&#39640;&#29992;&#25143;&#23545;&#25991;&#26412;&#39564;&#35777;&#26041;&#27861;&#30340;&#20449;&#20219;&#24182;&#24378;&#35843;&#32454;&#31890;&#24230;&#35777;&#25454;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.09724</link><description>&lt;p&gt;
ClaimVer&#65306;&#36890;&#36807;&#30693;&#35782;&#22270;&#35889;&#23454;&#29616;&#21487;&#35299;&#37322;&#30340;&#22768;&#26126;&#32423;&#39564;&#35777;&#21644;&#35777;&#25454;&#24402;&#22240;
&lt;/p&gt;
&lt;p&gt;
ClaimVer: Explainable Claim-Level Verification and Evidence Attribution of Text Through Knowledge Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09724
&lt;/p&gt;
&lt;p&gt;
ClaimVer&#26159;&#19968;&#20010;&#20154;&#20026;&#20013;&#24515;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#30693;&#35782;&#22270;&#35889;&#23454;&#29616;&#21487;&#35299;&#37322;&#30340;&#22768;&#26126;&#32423;&#39564;&#35777;&#21644;&#35777;&#25454;&#24402;&#22240;&#65292;&#33268;&#21147;&#20110;&#25552;&#39640;&#29992;&#25143;&#23545;&#25991;&#26412;&#39564;&#35777;&#26041;&#27861;&#30340;&#20449;&#20219;&#24182;&#24378;&#35843;&#32454;&#31890;&#24230;&#35777;&#25454;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24191;&#27867;&#20256;&#25773;&#30340;&#20449;&#24687;&#35823;&#23548;&#21644;&#31038;&#20132;&#23186;&#20307;&#20197;&#21450;&#20154;&#24037;&#26234;&#33021;&#29983;&#25104;&#30340;&#25991;&#26412;&#30340;&#28608;&#22686;&#20013;&#65292;&#39564;&#35777;&#21644;&#20449;&#20219;&#25152;&#36935;&#21040;&#30340;&#20449;&#24687;&#21464;&#24471;&#26085;&#30410;&#22256;&#38590;&#12290;&#35768;&#22810;&#20107;&#23454;&#26680;&#26597;&#26041;&#27861;&#21644;&#24037;&#20855;&#24050;&#34987;&#24320;&#21457;&#65292;&#20294;&#23427;&#20204;&#24448;&#24448;&#32570;&#20047;&#36866;&#24403;&#30340;&#21487;&#35299;&#37322;&#24615;&#25110;&#32454;&#31890;&#24230;&#65292;&#26080;&#27861;&#22312;&#21508;&#31181;&#24773;&#22659;&#20013;&#21457;&#25381;&#20316;&#29992;&#12290;&#19968;&#31181;&#26131;&#20110;&#20351;&#29992;&#12289;&#21487;&#35775;&#38382;&#19988;&#33021;&#22815;&#25191;&#34892;&#32454;&#31890;&#24230;&#35777;&#25454;&#24402;&#22240;&#30340;&#25991;&#26412;&#39564;&#35777;&#26041;&#27861;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#24314;&#31435;&#29992;&#25143;&#23545;&#36825;&#31181;&#26041;&#27861;&#30340;&#20449;&#20219;&#38656;&#35201;&#21576;&#29616;&#27599;&#20010;&#39044;&#27979;&#32972;&#21518;&#30340;&#29702;&#30001;&#65292;&#22240;&#20026;&#30740;&#31350;&#34920;&#26126;&#36825;&#26174;&#33879;&#24433;&#21709;&#20154;&#20204;&#23545;&#33258;&#21160;&#21270;&#31995;&#32479;&#30340;&#20449;&#20219;&#12290;&#23558;&#29992;&#25143;&#20851;&#27880;&#37325;&#28857;&#25918;&#22312;&#20855;&#20307;&#30340;&#38382;&#39064;&#20869;&#23481;&#19978;&#65292;&#32780;&#19981;&#26159;&#25552;&#20379;&#31616;&#21333;&#30340;&#31548;&#32479;&#26631;&#31614;&#20063;&#38750;&#24120;&#37325;&#35201;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;$\textit{ClaimVer&#65292;&#19968;&#20010;&#20197;&#20154;&#20026;&#20013;&#24515;&#30340;&#26694;&#26550;}$&#65292;&#26088;&#22312;&#28385;&#36275;&#29992;&#25143;&#30340;&#20449;&#24687;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09724v1 Announce Type: new  Abstract: In the midst of widespread misinformation and disinformation through social media and the proliferation of AI-generated texts, it has become increasingly difficult for people to validate and trust information they encounter. Many fact-checking approaches and tools have been developed, but they often lack appropriate explainability or granularity to be useful in various contexts. A text validation method that is easy to use, accessible, and can perform fine-grained evidence attribution has become crucial. More importantly, building user trust in such a method requires presenting the rationale behind each prediction, as research shows this significantly influences people's belief in automated systems. It is also paramount to localize and bring users' attention to the specific problematic content, instead of providing simple blanket labels. In this paper, we present $\textit{ClaimVer, a human-centric framework}$ tailored to meet users' info
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#65292;&#26088;&#22312;&#21516;&#26102;&#20943;&#23569;&#20132;&#36890;&#25317;&#22581;&#27700;&#24179;&#21644;&#32553;&#23567;&#19981;&#21516;&#26053;&#34892;&#32773;&#20043;&#38388;&#30340;&#25104;&#26412;&#24046;&#24322;&#65292;&#20174;&#32780;&#25552;&#39640;&#25928;&#29575;&#21644;&#20844;&#24179;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.16844</link><description>&lt;p&gt;
&#29992;&#20110;&#25928;&#29575;&#21644;&#20844;&#24179;&#24615;&#30340;&#25317;&#22581;&#23450;&#20215;&#65306;&#29702;&#35770;&#21450;&#20854;&#22312;&#26087;&#37329;&#23665;&#28286;&#21306;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Congestion Pricing for Efficiency and Equity: Theory and Applications to the San Francisco Bay Area. (arXiv:2401.16844v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16844
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#65292;&#26088;&#22312;&#21516;&#26102;&#20943;&#23569;&#20132;&#36890;&#25317;&#22581;&#27700;&#24179;&#21644;&#32553;&#23567;&#19981;&#21516;&#26053;&#34892;&#32773;&#20043;&#38388;&#30340;&#25104;&#26412;&#24046;&#24322;&#65292;&#20174;&#32780;&#25552;&#39640;&#25928;&#29575;&#21644;&#20844;&#24179;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25317;&#22581;&#23450;&#20215;&#34987;&#35768;&#22810;&#22478;&#24066;&#29992;&#20110;&#32531;&#35299;&#20132;&#36890;&#25317;&#22581;&#65292;&#20294;&#30001;&#20110;&#23545;&#20302;&#25910;&#20837;&#26053;&#34892;&#32773;&#24433;&#21709;&#36739;&#22823;&#65292;&#24341;&#21457;&#20102;&#20851;&#20110;&#31038;&#20250;&#32463;&#27982;&#24046;&#36317;&#25193;&#22823;&#30340;&#25285;&#24551;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#65292;&#19981;&#20165;&#21487;&#20197;&#26368;&#22823;&#38480;&#24230;&#22320;&#20943;&#23569;&#20132;&#36890;&#25317;&#22581;&#65292;&#36824;&#21487;&#20197;&#23558;&#20844;&#24179;&#24615;&#30446;&#26631;&#32435;&#20837;&#20854;&#20013;&#65292;&#20197;&#20943;&#23569;&#19981;&#21516;&#25903;&#20184;&#24847;&#24895;&#30340;&#26053;&#34892;&#32773;&#20043;&#38388;&#30340;&#25104;&#26412;&#24046;&#24322;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#22522;&#20110;&#19968;&#20010;&#20855;&#26377;&#24322;&#36136;&#26053;&#34892;&#32773;&#32676;&#20307;&#30340;&#25317;&#22581;&#21338;&#24328;&#27169;&#22411;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#31181;&#32771;&#34385;&#23454;&#38469;&#22240;&#32032;&#30340;&#23450;&#20215;&#26041;&#26696;&#65292;&#20363;&#22914;&#23545;&#19981;&#21516;&#26053;&#34892;&#32773;&#32676;&#20307;&#25910;&#21462;&#24046;&#24322;&#21270;&#30340;&#36890;&#34892;&#36153;&#20197;&#21450;&#24449;&#25910;&#25972;&#20010;&#36335;&#32593;&#20013;&#30340;&#25152;&#26377;&#36793;&#25110;&#21482;&#24449;&#25910;&#20854;&#20013;&#19968;&#37096;&#20998;&#36793;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#22312;&#26087;&#37329;&#23665;&#28286;&#21306;&#30340;&#26657;&#20934;&#39640;&#36895;&#20844;&#36335;&#32593;&#32476;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#23450;&#20215;&#26041;&#26696;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#21487;&#20197;&#25552;&#39640;&#25928;&#29575;&#65288;&#21363;&#20943;&#23569;&#24179;&#22343;&#26053;&#34892;&#26102;&#38388;&#65289;&#21644;&#20844;&#24179;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Congestion pricing, while adopted by many cities to alleviate traffic congestion, raises concerns about widening socioeconomic disparities due to its disproportionate impact on low-income travelers. In this study, we address this concern by proposing a new class of congestion pricing schemes that not only minimize congestion levels but also incorporate an equity objective to reduce cost disparities among travelers with different willingness-to-pay. Our analysis builds on a congestion game model with heterogeneous traveler populations. We present four pricing schemes that account for practical considerations, such as the ability to charge differentiated tolls to various traveler populations and the option to toll all or only a subset of edges in the network. We evaluate our pricing schemes in the calibrated freeway network of the San Francisco Bay Area. We demonstrate that the proposed congestion pricing schemes improve both efficiency (in terms of reduced average travel time) and equit
&lt;/p&gt;</description></item></channel></rss>