<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#25991;&#36890;&#36807;&#31995;&#32479;&#35843;&#26597;&#65292;&#21457;&#29616;&#25972;&#21512;&#39046;&#22495;&#30693;&#35782;&#21487;&#20197;&#25552;&#39640;&#20998;&#23376;&#24615;&#36136;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#21033;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#34701;&#21512;&#21487;&#20197;&#20135;&#29983;&#26356;&#31934;&#30830;&#30340;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.07249</link><description>&lt;p&gt;
&#39046;&#22495;&#30693;&#35782;&#21644;&#22810;&#27169;&#24577;&#23545;&#26234;&#33021;&#20998;&#23376;&#24615;&#36136;&#39044;&#27979;&#30340;&#24433;&#21709;&#65306;&#19968;&#39033;&#31995;&#32479;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
The Impact of Domain Knowledge and Multi-Modality on Intelligent Molecular Property Prediction: A Systematic Survey
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07249
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#31995;&#32479;&#35843;&#26597;&#65292;&#21457;&#29616;&#25972;&#21512;&#39046;&#22495;&#30693;&#35782;&#21487;&#20197;&#25552;&#39640;&#20998;&#23376;&#24615;&#36136;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#21033;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#34701;&#21512;&#21487;&#20197;&#20135;&#29983;&#26356;&#31934;&#30830;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#39044;&#27979;&#20998;&#23376;&#24615;&#36136;&#23545;&#20110;&#33647;&#29289;&#24320;&#21457;&#23588;&#20854;&#26159;&#34394;&#25311;&#31579;&#36873;&#21644;&#21270;&#21512;&#29289;&#20248;&#21270;&#30340;&#36827;&#23637;&#33267;&#20851;&#37325;&#35201;&#12290;&#36817;&#24180;&#26469;&#24341;&#20837;&#20102;&#35768;&#22810;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#22312;&#22686;&#24378;&#20998;&#23376;&#24615;&#36136;&#39044;&#27979;&#65288;MPP&#65289;&#26041;&#38754;&#26174;&#31034;&#20986;&#26174;&#33879;&#28508;&#21147;&#65292;&#29305;&#21035;&#26159;&#25552;&#39640;&#20102;&#20934;&#30830;&#24615;&#21644;&#23545;&#20998;&#23376;&#32467;&#26500;&#30340;&#27934;&#23519;&#21147;&#12290;&#28982;&#32780;&#65292;&#26377;&#20004;&#20010;&#20851;&#38190;&#38382;&#39064;&#65306;&#39046;&#22495;&#30693;&#35782;&#30340;&#25972;&#21512;&#26159;&#21542;&#22686;&#24378;&#20102;&#20998;&#23376;&#24615;&#36136;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#20351;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#34701;&#21512;&#26159;&#21542;&#27604;&#21333;&#19968;&#25968;&#25454;&#26469;&#28304;&#26041;&#27861;&#20135;&#29983;&#26356;&#31934;&#30830;&#30340;&#32467;&#26524;&#65311;&#20026;&#20102;&#25506;&#31350;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#20840;&#38754;&#22238;&#39038;&#21644;&#23450;&#37327;&#20998;&#26512;&#20102;&#22522;&#20110;&#21508;&#31181;&#22522;&#20934;&#30340;&#26368;&#26032;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#25972;&#21512;&#20998;&#23376;&#20449;&#24687;&#23558;&#20998;&#21035;&#25552;&#39640;MPP&#22238;&#24402;&#21644;&#20998;&#31867;&#20219;&#21153;&#30340;&#20934;&#30830;&#24615;&#65292;&#20998;&#21035;&#39640;&#36798;3.98&#65285;&#21644;1.72&#65285;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#20351;&#29992;&#19977;&#32500;&#20449;&#24687;&#19982;&#19968;&#32500;&#21644;&#20108;&#32500;&#20449;&#24687;&#30456;&#32467;&#21512;&#20250;&#20135;&#29983;&#26356;&#22909;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The precise prediction of molecular properties is essential for advancements in drug development, particularly in virtual screening and compound optimization. The recent introduction of numerous deep learning-based methods has shown remarkable potential in enhancing molecular property prediction (MPP), especially improving accuracy and insights into molecular structures. Yet, two critical questions arise: does the integration of domain knowledge augment the accuracy of molecular property prediction and does employing multi-modal data fusion yield more precise results than unique data source methods? To explore these matters, we comprehensively review and quantitatively analyze recent deep learning methods based on various benchmarks. We discover that integrating molecular information will improve both MPP regression and classification tasks by upto 3.98% and 1.72%, respectively. We also discover that the utilizing 3-dimensional information with 1-dimensional and 2-dimensional informati
&lt;/p&gt;</description></item></channel></rss>