<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#29983;&#29289;&#22280;&#20154;&#24037;&#26234;&#33021;&#26159;&#19968;&#31181;&#26032;&#30340;&#33539;&#24335;&#65292;&#20197;&#29983;&#24577;&#20013;&#24515;&#20027;&#20041;&#20026;&#22522;&#30784;&#65292;&#26088;&#22312;&#25429;&#25417;&#29983;&#29289;&#22280;&#30340;&#22797;&#26434;&#24615;&#24182;&#30830;&#20445;&#20154;&#24037;&#26234;&#33021;&#19981;&#20250;&#23545;&#20854;&#36896;&#25104;&#25439;&#23475;&#12290;</title><link>https://arxiv.org/abs/2401.17805</link><description>&lt;p&gt;
&#29983;&#29289;&#22280;&#20154;&#24037;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Biospheric AI
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17805
&lt;/p&gt;
&lt;p&gt;
&#29983;&#29289;&#22280;&#20154;&#24037;&#26234;&#33021;&#26159;&#19968;&#31181;&#26032;&#30340;&#33539;&#24335;&#65292;&#20197;&#29983;&#24577;&#20013;&#24515;&#20027;&#20041;&#20026;&#22522;&#30784;&#65292;&#26088;&#22312;&#25429;&#25417;&#29983;&#29289;&#22280;&#30340;&#22797;&#26434;&#24615;&#24182;&#30830;&#20445;&#20154;&#24037;&#26234;&#33021;&#19981;&#20250;&#23545;&#20854;&#36896;&#25104;&#25439;&#23475;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20154;&#24037;&#26234;&#33021;&#20262;&#29702;&#21644;&#20215;&#20540;&#35843;&#25972;&#39046;&#22495;&#20013;&#65292;&#20154;&#31867;&#20013;&#24515;&#20027;&#20041;&#21344;&#25454;&#20027;&#23548;&#22320;&#20301;&#12290;&#36825;&#20123;&#23398;&#31185;&#30340;&#20851;&#27880;&#37325;&#28857;&#20165;&#38480;&#20110;&#20154;&#31867;&#20215;&#20540;&#35266;&#65292;&#23548;&#33268;&#20854;&#27934;&#23519;&#21147;&#30340;&#28145;&#24230;&#21644;&#24191;&#24230;&#21463;&#38480;&#12290;&#26368;&#36817;&#65292;&#19968;&#20123;&#23398;&#32773;&#24050;&#24320;&#22987;&#23581;&#35797;&#25193;&#22823;&#21040;&#20197;&#24863;&#30693;&#32773;&#20026;&#20013;&#24515;&#30340;&#35270;&#35282;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#36825;&#20004;&#31181;&#35266;&#28857;&#37117;&#19981;&#36275;&#20197;&#25429;&#25417;&#29983;&#29289;&#22280;&#30340;&#23454;&#38469;&#22797;&#26434;&#24615;&#65292;&#24182;&#30830;&#20445;&#20154;&#24037;&#26234;&#33021;&#19981;&#20250;&#23545;&#20854;&#36896;&#25104;&#25439;&#23475;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33539;&#24335;&#8212;&#8212;&#29983;&#29289;&#22280;&#20154;&#24037;&#26234;&#33021;&#65292;&#23427;&#37319;&#29992;&#20102;&#19968;&#20010;&#29983;&#24577;&#20013;&#24515;&#20027;&#20041;&#30340;&#35270;&#35282;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#36825;&#31181;&#20154;&#24037;&#26234;&#33021;&#21487;&#33021;&#34987;&#35774;&#35745;&#30340;&#20551;&#35774;&#24615;&#26041;&#24335;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19982;&#29983;&#29289;&#22280;&#21033;&#30410;&#19968;&#33268;&#30340;&#29616;&#20195;&#20154;&#24037;&#26234;&#33021;&#27169;&#22411;&#30740;&#31350;&#21644;&#24212;&#29992;&#30340;&#26041;&#21521;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#36825;&#39033;&#24037;&#20316;&#35797;&#22270;&#36808;&#20986;&#39318;&#35201;&#27493;&#39588;&#65292;&#30740;&#31350;&#20154;&#24037;&#26234;&#33021;&#19982;&#29983;&#29289;&#22280;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
The dominant paradigm in AI ethics and value alignment is highly anthropocentric. The focus of these disciplines is strictly on human values which limits the depth and breadth of their insights. Recently, attempts to expand to a sentientist perspective have been initiated. We argue that neither of these outlooks is sufficient to capture the actual complexity of the biosphere and ensure that AI does not damage it. Thus, we propose a new paradigm -- Biospheric AI that assumes an ecocentric perspective. We discuss hypothetical ways in which such an AI might be designed. Moreover, we give directions for research and application of the modern AI models that would be consistent with the biospheric interests. All in all, this work attempts to take first steps towards a comprehensive program of research that focuses on the interactions between AI and the biosphere.
&lt;/p&gt;</description></item></channel></rss>