<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>SVGCraft&#24341;&#20837;&#20102;&#19968;&#31181;&#31471;&#21040;&#31471;&#26694;&#26550;&#65292;&#21487;&#20197;&#20174;&#25991;&#26412;&#25551;&#36848;&#20013;&#29983;&#25104;&#25551;&#32472;&#25972;&#20010;&#22330;&#26223;&#30340;&#30690;&#37327;&#22270;&#65292;&#20854;&#20013;&#21253;&#25324;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;LLM&#36827;&#34892;&#24067;&#23616;&#29983;&#25104;&#12289;&#20135;&#29983;&#36974;&#32617;&#28508;&#21464;&#37327;&#20197;&#36827;&#34892;&#20934;&#30830;&#23545;&#35937;&#25918;&#32622;&#12289;&#34701;&#21512;&#27880;&#24847;&#21147;&#22270;&#20197;&#21450;&#20351;&#29992;&#25193;&#25955;U-Net&#36827;&#34892;&#21512;&#25104;&#65292;&#21516;&#26102;&#36890;&#36807;&#39044;&#35757;&#32451;&#30340;&#32534;&#30721;&#22120;&#21644;LPIPS&#25439;&#22833;&#36827;&#34892;&#20248;&#21270;&#12290;</title><link>https://arxiv.org/abs/2404.00412</link><description>&lt;p&gt;
SVGCraft:&#36229;&#36234;&#21333;&#20010;&#30446;&#26631;&#25991;&#23383;&#21040;SVG&#32508;&#21512;&#30011;&#24067;&#24067;&#23616;
&lt;/p&gt;
&lt;p&gt;
SVGCraft: Beyond Single Object Text-to-SVG Synthesis with Comprehensive Canvas Layout
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00412
&lt;/p&gt;
&lt;p&gt;
SVGCraft&#24341;&#20837;&#20102;&#19968;&#31181;&#31471;&#21040;&#31471;&#26694;&#26550;&#65292;&#21487;&#20197;&#20174;&#25991;&#26412;&#25551;&#36848;&#20013;&#29983;&#25104;&#25551;&#32472;&#25972;&#20010;&#22330;&#26223;&#30340;&#30690;&#37327;&#22270;&#65292;&#20854;&#20013;&#21253;&#25324;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;LLM&#36827;&#34892;&#24067;&#23616;&#29983;&#25104;&#12289;&#20135;&#29983;&#36974;&#32617;&#28508;&#21464;&#37327;&#20197;&#36827;&#34892;&#20934;&#30830;&#23545;&#35937;&#25918;&#32622;&#12289;&#34701;&#21512;&#27880;&#24847;&#21147;&#22270;&#20197;&#21450;&#20351;&#29992;&#25193;&#25955;U-Net&#36827;&#34892;&#21512;&#25104;&#65292;&#21516;&#26102;&#36890;&#36807;&#39044;&#35757;&#32451;&#30340;&#32534;&#30721;&#22120;&#21644;LPIPS&#25439;&#22833;&#36827;&#34892;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20174;&#25991;&#26412;&#25552;&#31034;&#21040;&#30690;&#37327;&#22270;&#30340;VectorArt&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#35270;&#35273;&#20219;&#21153;&#65292;&#38656;&#35201;&#23545;&#24050;&#30693;&#21644;&#26410;&#30693;&#23454;&#20307;&#36827;&#34892;&#22810;&#26679;&#21270;&#32780;&#30495;&#23454;&#30340;&#25551;&#36848;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#23616;&#38480;&#20110;&#29983;&#25104;&#21333;&#20010;&#23545;&#35937;&#65292;&#32780;&#19981;&#26159;&#30001;&#22810;&#20010;&#20803;&#32032;&#32452;&#25104;&#30340;&#22330;&#26223;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;SVGCraft&#65292;&#36825;&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#31471;&#21040;&#31471;&#26694;&#26550;&#65292;&#29992;&#20110;&#20174;&#25991;&#26412;&#25551;&#36848;&#20013;&#29983;&#25104;&#25551;&#32472;&#25972;&#20010;&#22330;&#26223;&#30340;&#30690;&#37327;&#22270;&#12290;&#35813;&#26694;&#26550;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;LLM&#20174;&#25991;&#26412;&#25552;&#31034;&#29983;&#25104;&#24067;&#23616;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#25216;&#26415;&#65292;&#36890;&#36807;&#29983;&#20135;&#29305;&#23450;&#36793;&#30028;&#26694;&#20013;&#30340;&#25513;&#33180;&#28508;&#21464;&#37327;&#23454;&#29616;&#20934;&#30830;&#30340;&#23545;&#35937;&#25918;&#32622;&#12290;&#23427;&#24341;&#20837;&#20102;&#19968;&#20010;&#34701;&#21512;&#26426;&#21046;&#65292;&#29992;&#20110;&#38598;&#25104;&#27880;&#24847;&#21147;&#22270;&#65292;&#24182;&#20351;&#29992;&#25193;&#25955;U-Net&#36827;&#34892;&#36830;&#36143;&#30340;&#21512;&#25104;&#65292;&#21152;&#24555;&#32472;&#22270;&#36807;&#31243;&#12290;&#29983;&#25104;&#30340;SVG&#20351;&#29992;&#39044;&#35757;&#32451;&#30340;&#32534;&#30721;&#22120;&#21644;LPIPS&#25439;&#22833;&#36827;&#34892;&#20248;&#21270;&#65292;&#36890;&#36807;&#36879;&#26126;&#24230;&#35843;&#21046;&#26469;&#26368;&#22823;&#31243;&#24230;&#22320;&#22686;&#21152;&#30456;&#20284;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00412v1 Announce Type: cross  Abstract: Generating VectorArt from text prompts is a challenging vision task, requiring diverse yet realistic depictions of the seen as well as unseen entities. However, existing research has been mostly limited to the generation of single objects, rather than comprehensive scenes comprising multiple elements. In response, this work introduces SVGCraft, a novel end-to-end framework for the creation of vector graphics depicting entire scenes from textual descriptions. Utilizing a pre-trained LLM for layout generation from text prompts, this framework introduces a technique for producing masked latents in specified bounding boxes for accurate object placement. It introduces a fusion mechanism for integrating attention maps and employs a diffusion U-Net for coherent composition, speeding up the drawing process. The resulting SVG is optimized using a pre-trained encoder and LPIPS loss with opacity modulation to maximize similarity. Additionally, th
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;GuideGen&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#26681;&#25454;&#25991;&#26412;&#25552;&#31034;&#32852;&#21512;&#29983;&#25104;CT&#22270;&#20687;&#21644;&#33145;&#37096;&#22120;&#23448;&#20197;&#21450;&#32467;&#30452;&#32928;&#30284;&#32452;&#32455;&#25513;&#33180;&#65292;&#20026;&#21307;&#23398;&#22270;&#20687;&#20998;&#26512;&#39046;&#22495;&#25552;&#20379;&#20102;&#19968;&#31181;&#29983;&#25104;&#25968;&#25454;&#38598;&#30340;&#26032;&#36884;&#24452;&#12290;</title><link>https://arxiv.org/abs/2403.07247</link><description>&lt;p&gt;
GuideGen&#65306;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;CT&#20307;&#31215;&#21644;&#35299;&#21078;&#32467;&#26500;&#29983;&#25104;&#30340;&#25991;&#26412;&#24341;&#23548;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
GuideGen: A Text-guided Framework for Joint CT Volume and Anatomical structure Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07247
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;GuideGen&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#26681;&#25454;&#25991;&#26412;&#25552;&#31034;&#32852;&#21512;&#29983;&#25104;CT&#22270;&#20687;&#21644;&#33145;&#37096;&#22120;&#23448;&#20197;&#21450;&#32467;&#30452;&#32928;&#30284;&#32452;&#32455;&#25513;&#33180;&#65292;&#20026;&#21307;&#23398;&#22270;&#20687;&#20998;&#26512;&#39046;&#22495;&#25552;&#20379;&#20102;&#19968;&#31181;&#29983;&#25104;&#25968;&#25454;&#38598;&#30340;&#26032;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07247v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449; &#25688;&#35201;&#65306;&#20026;&#20102;&#25910;&#38598;&#24102;&#26377;&#22270;&#20687;&#21644;&#30456;&#24212;&#26631;&#31614;&#30340;&#22823;&#22411;&#21307;&#23398;&#25968;&#25454;&#38598;&#32780;&#36827;&#34892;&#30340;&#27880;&#37322;&#36127;&#25285;&#21644;&#22823;&#37327;&#24037;&#20316;&#24456;&#23569;&#26159;&#21010;&#31639;&#19988;&#20196;&#20154;&#26395;&#32780;&#29983;&#30031;&#30340;&#12290;&#36825;&#23548;&#33268;&#20102;&#32570;&#20047;&#20016;&#23500;&#30340;&#35757;&#32451;&#25968;&#25454;&#65292;&#21066;&#24369;&#20102;&#19979;&#28216;&#20219;&#21153;&#65292;&#24182;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21152;&#21095;&#20102;&#21307;&#23398;&#39046;&#22495;&#38754;&#20020;&#30340;&#22270;&#20687;&#20998;&#26512;&#25361;&#25112;&#12290;&#20316;&#20026;&#19968;&#31181;&#26435;&#23452;&#20043;&#35745;&#65292;&#37492;&#20110;&#29983;&#25104;&#24615;&#31070;&#32463;&#27169;&#22411;&#30340;&#26368;&#36817;&#25104;&#21151;&#65292;&#29616;&#22312;&#21487;&#20197;&#22312;&#22806;&#37096;&#32422;&#26463;&#30340;&#24341;&#23548;&#19979;&#20197;&#39640;&#20445;&#30495;&#24230;&#21512;&#25104;&#22270;&#20687;&#25968;&#25454;&#38598;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#36825;&#31181;&#21487;&#33021;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;GuideGen&#65306;&#19968;&#31181;&#32852;&#21512;&#29983;&#25104;&#33145;&#37096;&#22120;&#23448;&#21644;&#32467;&#30452;&#32928;&#30284;CT&#22270;&#20687;&#21644;&#32452;&#32455;&#25513;&#33180;&#30340;&#31649;&#32447;&#65292;&#20854;&#21463;&#25991;&#26412;&#25552;&#31034;&#26465;&#20214;&#32422;&#26463;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#20307;&#31215;&#25513;&#33180;&#37319;&#26679;&#22120;&#65292;&#20197;&#36866;&#24212;&#25513;&#33180;&#26631;&#31614;&#30340;&#31163;&#25955;&#20998;&#24067;&#24182;&#29983;&#25104;&#20302;&#20998;&#36776;&#29575;3D&#32452;&#32455;&#25513;&#33180;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#30340;&#26465;&#20214;&#22270;&#20687;&#29983;&#25104;&#22120;&#20250;&#22312;&#25910;&#21040;&#30456;&#24212;&#25991;&#26412;&#25552;&#31034;&#30340;&#24773;&#20917;&#19979;&#33258;&#22238;&#24402;&#29983;&#25104;CT&#20999;&#29255;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07247v1 Announce Type: cross  Abstract: The annotation burden and extensive labor for gathering a large medical dataset with images and corresponding labels are rarely cost-effective and highly intimidating. This results in a lack of abundant training data that undermines downstream tasks and partially contributes to the challenge image analysis faces in the medical field. As a workaround, given the recent success of generative neural models, it is now possible to synthesize image datasets at a high fidelity guided by external constraints. This paper explores this possibility and presents \textbf{GuideGen}: a pipeline that jointly generates CT images and tissue masks for abdominal organs and colorectal cancer conditioned on a text prompt. Firstly, we introduce Volumetric Mask Sampler to fit the discrete distribution of mask labels and generate low-resolution 3D tissue masks. Secondly, our Conditional Image Generator autoregressively generates CT slices conditioned on a corre
&lt;/p&gt;</description></item></channel></rss>