<rss version="2.0"><channel><title>Chat Arxiv cs.CG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CG</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#26684;&#23376;&#38598;&#25104;&#25299;&#25169;&#25551;&#36848;&#31526;&#26694;&#26550;&#65292;&#23558;&#25345;&#20037;&#22270;&#36716;&#21270;&#20026;&#26377;&#38480;&#32500;&#21521;&#37327;&#31354;&#38388;&#30340;&#20803;&#32032;&#65292;&#36890;&#36807;&#22522;&#20110;&#31163;&#25955;&#27979;&#24230;&#30340;&#21151;&#33021;&#65292;&#35777;&#26126;&#20102;&#37096;&#20998;&#25104;&#21592;&#22312;&#24230;&#37327;&#19978;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#31454;&#20105;&#29978;&#33267;&#36229;&#36234;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2312.17093</link><description>&lt;p&gt;
LITE&#65306;&#31283;&#23450;&#30340;&#26684;&#23376;&#38598;&#25104;&#25299;&#25169;&#25551;&#36848;&#31526;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
LITE: A Stable Framework for Lattice-Integrated Embedding of Topological Descriptors. (arXiv:2312.17093v2 [math.AT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.17093
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#26684;&#23376;&#38598;&#25104;&#25299;&#25169;&#25551;&#36848;&#31526;&#26694;&#26550;&#65292;&#23558;&#25345;&#20037;&#22270;&#36716;&#21270;&#20026;&#26377;&#38480;&#32500;&#21521;&#37327;&#31354;&#38388;&#30340;&#20803;&#32032;&#65292;&#36890;&#36807;&#22522;&#20110;&#31163;&#25955;&#27979;&#24230;&#30340;&#21151;&#33021;&#65292;&#35777;&#26126;&#20102;&#37096;&#20998;&#25104;&#21592;&#22312;&#24230;&#37327;&#19978;&#30340;&#31283;&#23450;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#31454;&#20105;&#29978;&#33267;&#36229;&#36234;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#25345;&#20037;&#22270;&#25551;&#36848;&#31526;&#23478;&#26063;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;&#36825;&#20123;&#22270;&#36716;&#21270;&#20026;&#26377;&#38480;&#32500;&#21521;&#37327;&#31354;&#38388;&#20013;&#30340;&#20803;&#32032;&#65292;&#20351;&#29992;&#22522;&#20110;&#23427;&#20204;&#25152;&#24341;&#36215;&#30340;&#31163;&#25955;&#27979;&#24230;&#30340;&#27867;&#20989;&#12290;&#34429;&#28982;&#25105;&#20204;&#30340;&#28966;&#28857;&#20027;&#35201;&#26159;&#22312;&#22522;&#20110;&#36523;&#20221;&#21644;&#39057;&#29575;&#30340;&#36716;&#25442;&#19978;&#65292;&#20294;&#25105;&#20204;&#24182;&#19981;&#23616;&#38480;&#20110;&#36825;&#20123;&#31867;&#22411;&#30340;&#25216;&#26415;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#36716;&#25442;&#23478;&#26063;&#31216;&#20026;LITE &#65288;Lattice Integrated Topological Embedding&#65289;&#65292;&#24182;&#19988;&#23545;&#35813;&#23478;&#26063;&#30340;&#19968;&#20123;&#25104;&#21592;&#22312;1-&#24247;&#25176;&#27931;&#32500;&#22855;-&#40065;&#23486;&#26031;&#22374;&#24230;&#37327;&#19979;&#35777;&#26126;&#20102;&#31283;&#23450;&#24615;&#65292;&#30830;&#20445;&#23545;&#32454;&#24494;&#30340;&#25968;&#25454;&#21464;&#21270;&#20855;&#26377;&#21453;&#24212;&#24615;&#12290;&#24191;&#27867;&#30340;&#23545;&#27604;&#20998;&#26512;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#25551;&#36848;&#31526;&#22312;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#25991;&#29486;&#20013;&#19982;&#24403;&#21069;&#26368;&#20808;&#36827;&#30340;&#26041;&#27861;&#30456;&#31454;&#20105;&#65292;&#24182;&#19988;&#32463;&#24120;&#36229;&#36234;&#29616;&#26377;&#30340;&#26041;&#27861;&#12290;&#36825;&#39033;&#30740;&#31350;&#19981;&#20165;&#20026;&#25968;&#25454;&#31185;&#23398;&#23478;&#24341;&#20837;&#20102;&#21019;&#26032;&#30340;&#35266;&#28857;&#65292;&#32780;&#19988;&#25209;&#35780;&#20102;&#30446;&#21069;&#20851;&#20110;&#21521;&#37327;&#21270;&#26041;&#27861;&#23398;&#30340;&#25991;&#29486;&#30340;&#36712;&#36857;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we introduce a new family of descriptors for persistence diagrams. Our approach transforms these diagrams into elements of a finite-dimensional vector space using functionals based on the discrete measures they induce. While our focus is primarily on identity and frequency-based transformations, we do not restrict our approach exclusively to this types of techniques. We term this family of transformations as LITE (Lattice Integrated Topological Embedding) and prove stability for some members of this family against the 1-$Kantorovitch$-$Rubinstein$ metric, ensuring its responsiveness to subtle data variations. Extensive comparative analysis reveals that our descriptor performs competitively with the current state-of-art from the topological data analysis literature, and often surpasses, the existing methods. This research not only introduces an innovative perspective for data scientists but also critiques the current trajectory of literature on methodologies for vectorizi
&lt;/p&gt;</description></item></channel></rss>