<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#22478;&#24066;&#22522;&#30784;&#27169;&#22411;&#22312;&#26234;&#33021;&#22478;&#24066;&#21457;&#23637;&#20013;&#30340;&#37325;&#35201;&#24615;&#21644;&#28508;&#21147;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#20998;&#31867;&#26041;&#27861;&#12290;&#36825;&#20010;&#26032;&#20852;&#39046;&#22495;&#38754;&#20020;&#30528;&#19968;&#20123;&#25361;&#25112;&#65292;&#22914;&#32570;&#20047;&#28165;&#26224;&#30340;&#23450;&#20041;&#21644;&#31995;&#32479;&#24615;&#30340;&#32508;&#36848;&#65292;&#38656;&#35201;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#21644;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2402.01749</link><description>&lt;p&gt;
&#36808;&#21521;&#22478;&#24066;&#26234;&#33021;&#65306;&#22478;&#24066;&#22522;&#30784;&#27169;&#22411;&#32508;&#36848;&#19982;&#23637;&#26395;
&lt;/p&gt;
&lt;p&gt;
Towards Urban General Intelligence: A Review and Outlook of Urban Foundation Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01749
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#22478;&#24066;&#22522;&#30784;&#27169;&#22411;&#22312;&#26234;&#33021;&#22478;&#24066;&#21457;&#23637;&#20013;&#30340;&#37325;&#35201;&#24615;&#21644;&#28508;&#21147;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#20998;&#31867;&#26041;&#27861;&#12290;&#36825;&#20010;&#26032;&#20852;&#39046;&#22495;&#38754;&#20020;&#30528;&#19968;&#20123;&#25361;&#25112;&#65292;&#22914;&#32570;&#20047;&#28165;&#26224;&#30340;&#23450;&#20041;&#21644;&#31995;&#32479;&#24615;&#30340;&#32508;&#36848;&#65292;&#38656;&#35201;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#21644;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#29616;&#24050;&#25104;&#20026;&#26234;&#33021;&#22478;&#24066;&#26381;&#21153;&#36827;&#27493;&#30340;&#26680;&#24515;&#65292;&#23545;&#25552;&#39640;&#22478;&#24066;&#29615;&#22659;&#30340;&#25928;&#29575;&#12289;&#21487;&#25345;&#32493;&#24615;&#21644;&#23452;&#23621;&#24615;&#36215;&#21040;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#26368;&#36817;&#20986;&#29616;&#30340;ChatGPT&#31561;&#22522;&#30784;&#27169;&#22411;&#22312;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#26631;&#24535;&#30528;&#19968;&#20010;&#38761;&#21629;&#24615;&#30340;&#36716;&#21464;&#12290;&#23427;&#20204;&#22312;&#19978;&#19979;&#25991;&#29702;&#35299;&#12289;&#38382;&#39064;&#35299;&#20915;&#21644;&#36866;&#24212;&#21508;&#31181;&#20219;&#21153;&#26041;&#38754;&#30340;&#26080;&#19982;&#20262;&#27604;&#30340;&#33021;&#21147;&#34920;&#26126;&#65292;&#23558;&#36825;&#20123;&#27169;&#22411;&#25972;&#21512;&#21040;&#22478;&#24066;&#39046;&#22495;&#20013;&#21487;&#33021;&#23545;&#26234;&#33021;&#22478;&#24066;&#30340;&#21457;&#23637;&#20135;&#29983;&#21464;&#38761;&#24615;&#24433;&#21709;&#12290;&#23613;&#31649;&#23545;&#22478;&#24066;&#22522;&#30784;&#27169;&#22411;&#65288;UFMs&#65289;&#30340;&#20852;&#36259;&#26085;&#30410;&#22686;&#38271;&#65292;&#20294;&#36825;&#20010;&#26032;&#20852;&#39046;&#22495;&#38754;&#20020;&#30528;&#19968;&#20123;&#25361;&#25112;&#65292;&#22914;&#32570;&#20047;&#28165;&#26224;&#30340;&#23450;&#20041;&#12289;&#31995;&#32479;&#24615;&#30340;&#32508;&#36848;&#21644;&#21487;&#26222;&#36941;&#21270;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#39318;&#20808;&#20171;&#32461;&#20102;UFM&#30340;&#27010;&#24565;&#65292;&#24182;&#35752;&#35770;&#20102;&#26500;&#24314;&#23427;&#20204;&#25152;&#38754;&#20020;&#30340;&#29420;&#29305;&#25361;&#25112;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#20998;&#31867;&#26041;&#27861;&#65292;&#23545;&#24403;&#21069;&#19982;UFM&#30456;&#20851;&#30340;&#24037;&#20316;&#36827;&#34892;&#20102;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning techniques are now integral to the advancement of intelligent urban services, playing a crucial role in elevating the efficiency, sustainability, and livability of urban environments. The recent emergence of foundation models such as ChatGPT marks a revolutionary shift in the fields of machine learning and artificial intelligence. Their unparalleled capabilities in contextual understanding, problem solving, and adaptability across a wide range of tasks suggest that integrating these models into urban domains could have a transformative impact on the development of smart cities. Despite growing interest in Urban Foundation Models~(UFMs), this burgeoning field faces challenges such as a lack of clear definitions, systematic reviews, and universalizable solutions. To this end, this paper first introduces the concept of UFM and discusses the unique challenges involved in building them. We then propose a data-centric taxonomy that categorizes current UFM-related works, base
&lt;/p&gt;</description></item></channel></rss>