<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;Magmaw&#65292;&#36825;&#26159;&#19968;&#31181;&#38024;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#36827;&#34892;&#27169;&#24577;&#19981;&#21487;&#30693;&#23545;&#25239;&#25915;&#20987;&#30340;&#40657;&#30418;&#25915;&#20987;&#26041;&#27861;&#12290;&#23427;&#33021;&#22815;&#29983;&#25104;&#36890;&#29992;&#30340;&#23545;&#25239;&#25200;&#21160;&#65292;&#24182;&#24341;&#20837;&#20102;&#26032;&#30340;&#25915;&#20987;&#30446;&#26631;&#12290;&#23454;&#39564;&#35777;&#23454;&#20102;&#20854;&#23545;&#29616;&#26377;&#38450;&#24481;&#26041;&#27861;&#30340;&#38887;&#24615;&#12290;&#20351;&#29992;&#23454;&#26102;&#26080;&#32447;&#25915;&#20987;&#24179;&#21488;&#36827;&#34892;&#20102;&#27010;&#24565;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2311.00207</link><description>&lt;p&gt;
Magmaw: &#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#30340;&#27169;&#24577;&#19981;&#21487;&#30693;&#23545;&#25239;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Magmaw: Modality-Agnostic Adversarial Attacks on Machine Learning-Based Wireless Communication Systems. (arXiv:2311.00207v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00207
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;Magmaw&#65292;&#36825;&#26159;&#19968;&#31181;&#38024;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#36827;&#34892;&#27169;&#24577;&#19981;&#21487;&#30693;&#23545;&#25239;&#25915;&#20987;&#30340;&#40657;&#30418;&#25915;&#20987;&#26041;&#27861;&#12290;&#23427;&#33021;&#22815;&#29983;&#25104;&#36890;&#29992;&#30340;&#23545;&#25239;&#25200;&#21160;&#65292;&#24182;&#24341;&#20837;&#20102;&#26032;&#30340;&#25915;&#20987;&#30446;&#26631;&#12290;&#23454;&#39564;&#35777;&#23454;&#20102;&#20854;&#23545;&#29616;&#26377;&#38450;&#24481;&#26041;&#27861;&#30340;&#38887;&#24615;&#12290;&#20351;&#29992;&#23454;&#26102;&#26080;&#32447;&#25915;&#20987;&#24179;&#21488;&#36827;&#34892;&#20102;&#27010;&#24565;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#21512;&#24182;&#31471;&#21040;&#31471;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#30340;&#25152;&#26377;&#29289;&#29702;&#23618;&#27169;&#22359;&#20197;&#23454;&#29616;&#32852;&#21512;&#25910;&#21457;&#22120;&#20248;&#21270;&#26041;&#38754;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;&#23613;&#31649;&#24050;&#32463;&#26377;&#35768;&#22810;&#38024;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#32447;&#31995;&#32479;&#30340;&#23545;&#25239;&#25915;&#20987;&#26041;&#27861;&#65292;&#20294;&#29616;&#26377;&#26041;&#27861;&#24182;&#26410;&#25552;&#20379;&#21253;&#25324;&#28304;&#25968;&#25454;&#30340;&#22810;&#27169;&#24577;&#12289;&#20849;&#21516;&#30340;&#29289;&#29702;&#23618;&#32452;&#20214;&#21644;&#26080;&#32447;&#39046;&#22495;&#32422;&#26463;&#22312;&#20869;&#30340;&#20840;&#38754;&#35270;&#35282;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;Magmaw&#65292;&#36825;&#26159;&#19968;&#31181;&#33021;&#22815;&#38024;&#23545;&#36890;&#36807;&#26080;&#32447;&#20449;&#36947;&#20256;&#36755;&#30340;&#20219;&#20309;&#22810;&#27169;&#24577;&#20449;&#21495;&#29983;&#25104;&#36890;&#29992;&#23545;&#25239;&#25200;&#21160;&#30340;&#40657;&#30418;&#25915;&#20987;&#26041;&#27861;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#19979;&#28216;&#24212;&#29992;&#30340;&#23545;&#25239;&#25915;&#20987;&#24341;&#20837;&#20102;&#26032;&#30340;&#30446;&#26631;&#12290;&#23454;&#39564;&#35777;&#23454;&#20102;&#35813;&#25915;&#20987;&#23545;&#29616;&#26377;&#24191;&#27867;&#20351;&#29992;&#30340;&#23545;&#25239;&#35757;&#32451;&#21644;&#25200;&#21160;&#20449;&#21495;&#20943;&#27861;&#38450;&#24481;&#26041;&#27861;&#30340;&#38887;&#24615;&#12290;&#20026;&#20102;&#27010;&#24565;&#35777;&#26126;&#65292;&#25105;&#20204;&#20351;&#29992;&#36719;&#20214;&#23450;&#20041;&#26080;&#32447;&#30005;&#31995;&#32479;&#26500;&#24314;&#20102;&#19968;&#20010;&#23454;&#26102;&#26080;&#32447;&#25915;&#20987;&#24179;&#21488;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine Learning (ML) has been instrumental in enabling joint transceiver optimization by merging all physical layer blocks of the end-to-end wireless communication systems. Although there have been a number of adversarial attacks on ML-based wireless systems, the existing methods do not provide a comprehensive view including multi-modality of the source data, common physical layer components, and wireless domain constraints. This paper proposes Magmaw, the first black-box attack methodology capable of generating universal adversarial perturbations for any multimodal signal transmitted over a wireless channel. We further introduce new objectives for adversarial attacks on ML-based downstream applications. The resilience of the attack to the existing widely used defense methods of adversarial training and perturbation signal subtraction is experimentally verified. For proof-of-concept evaluation, we build a real-time wireless attack platform using a software-defined radio system. Experi
&lt;/p&gt;</description></item></channel></rss>