<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#36229;&#22797;&#25968;&#31070;&#32463;&#32593;&#32476;&#30340;&#22810;&#35270;&#22270;&#20083;&#33146;&#30284;&#20998;&#31867;&#26041;&#27861;&#65292;&#33021;&#22815;&#27169;&#25311;&#24182;&#21033;&#29992;&#20083;&#25151;X&#20809;&#26816;&#26597;&#30340;&#19981;&#21516;&#35270;&#22270;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#32959;&#30244;&#35782;&#21035;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2204.05798</link><description>&lt;p&gt;
&#22810;&#35270;&#22270;&#36229;&#22797;&#25968;&#23398;&#20064;&#29992;&#20110;&#20083;&#33146;&#30284;&#31579;&#26597;
&lt;/p&gt;
&lt;p&gt;
Multi-View Hypercomplex Learning for Breast Cancer Screening
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2204.05798
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#36229;&#22797;&#25968;&#31070;&#32463;&#32593;&#32476;&#30340;&#22810;&#35270;&#22270;&#20083;&#33146;&#30284;&#20998;&#31867;&#26041;&#27861;&#65292;&#33021;&#22815;&#27169;&#25311;&#24182;&#21033;&#29992;&#20083;&#25151;X&#20809;&#26816;&#26597;&#30340;&#19981;&#21516;&#35270;&#22270;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#32959;&#30244;&#35782;&#21035;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#19978;&#65292;&#29992;&#20110;&#20083;&#33146;&#30284;&#20998;&#31867;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#25191;&#34892;&#21333;&#35270;&#22270;&#20998;&#26512;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20083;&#33146;X-ray&#22270;&#20687;&#20013;&#21253;&#21547;&#30340;&#30456;&#20851;&#24615;&#65292;&#25918;&#23556;&#31185;&#21307;&#29983;&#21516;&#26102;&#20998;&#26512;&#32452;&#25104;&#20083;&#25151;X&#20809;&#25668;&#24433;&#26816;&#26597;&#30340;&#25152;&#26377;&#22235;&#20010;&#35270;&#22270;&#65292;&#36825;&#20026;&#35782;&#21035;&#32959;&#30244;&#25552;&#20379;&#20102;&#20851;&#38190;&#20449;&#24687;&#12290;&#37492;&#20110;&#27492;&#65292;&#19968;&#20123;&#30740;&#31350;&#24050;&#32463;&#24320;&#22987;&#25552;&#20986;&#22810;&#35270;&#22270;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#26679;&#30340;&#29616;&#26377;&#26550;&#26500;&#20013;&#65292;&#20083;&#25151;X&#20809;&#22270;&#20687;&#34987;&#29420;&#31435;&#30340;&#21367;&#31215;&#20998;&#25903;&#22788;&#29702;&#20026;&#29420;&#31435;&#30340;&#22270;&#20687;&#65292;&#20174;&#32780;&#22833;&#21435;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#23616;&#38480;&#24615;&#65292;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#36229;&#22797;&#25968;&#31070;&#32463;&#32593;&#32476;&#30340;&#22810;&#35270;&#22270;&#20083;&#33146;&#30284;&#20998;&#31867;&#26041;&#27861;&#12290;&#30001;&#20110;&#36229;&#22797;&#25968;&#20195;&#25968;&#29305;&#24615;&#65292;&#25105;&#20204;&#30340;&#32593;&#32476;&#33021;&#22815;&#24314;&#27169;&#24182;&#21033;&#29992;&#32452;&#25104;&#20083;&#25151;X&#20809;&#26816;&#26597;&#30340;&#19981;&#21516;&#35270;&#22270;&#20043;&#38388;&#30340;&#29616;&#26377;&#30456;&#20851;&#24615;&#65292;&#20174;&#32780;&#27169;&#25311;&#38405;&#29255;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2204.05798v3 Announce Type: replace-cross  Abstract: Traditionally, deep learning methods for breast cancer classification perform a single-view analysis. However, radiologists simultaneously analyze all four views that compose a mammography exam, owing to the correlations contained in mammography views, which present crucial information for identifying tumors. In light of this, some studies have started to propose multi-view methods. Nevertheless, in such existing architectures, mammogram views are processed as independent images by separate convolutional branches, thus losing correlations among them. To overcome such limitations, in this paper, we propose a methodological approach for multi-view breast cancer classification based on parameterized hypercomplex neural networks. Thanks to hypercomplex algebra properties, our networks are able to model, and thus leverage, existing correlations between the different views that comprise a mammogram, thus mimicking the reading process
&lt;/p&gt;</description></item></channel></rss>