<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>DrivAerNet&#25552;&#20379;&#20102;&#19968;&#20010;&#22823;&#35268;&#27169;&#39640;&#20445;&#30495;&#24230;&#30340;&#27773;&#36710;&#25968;&#25454;&#38598;&#65292;&#20197;&#35299;&#20915;&#24037;&#31243;&#24212;&#29992;&#20013;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25152;&#38656;&#30340;&#25968;&#25454;&#19981;&#36275;&#38382;&#39064;&#65292;&#32780;RegDGCNN&#21033;&#29992;&#36825;&#19968;&#25968;&#25454;&#38598;&#30452;&#25509;&#20174;3D&#32593;&#26684;&#25552;&#20379;&#39640;&#31934;&#24230;&#30340;&#38459;&#21147;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.08055</link><description>&lt;p&gt;
DrivAerNet&#65306;&#29992;&#20110;&#25968;&#25454;&#39537;&#21160;&#27668;&#21160;&#35774;&#35745;&#21644;&#22522;&#20110;&#22270;&#30340;&#38459;&#21147;&#39044;&#27979;&#30340;&#21442;&#25968;&#21270;&#27773;&#36710;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
DrivAerNet: A Parametric Car Dataset for Data-Driven Aerodynamic Design and Graph-Based Drag Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08055
&lt;/p&gt;
&lt;p&gt;
DrivAerNet&#25552;&#20379;&#20102;&#19968;&#20010;&#22823;&#35268;&#27169;&#39640;&#20445;&#30495;&#24230;&#30340;&#27773;&#36710;&#25968;&#25454;&#38598;&#65292;&#20197;&#35299;&#20915;&#24037;&#31243;&#24212;&#29992;&#20013;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25152;&#38656;&#30340;&#25968;&#25454;&#19981;&#36275;&#38382;&#39064;&#65292;&#32780;RegDGCNN&#21033;&#29992;&#36825;&#19968;&#25968;&#25454;&#38598;&#30452;&#25509;&#20174;3D&#32593;&#26684;&#25552;&#20379;&#39640;&#31934;&#24230;&#30340;&#38459;&#21147;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102; DrivAerNet&#65292;&#36825;&#26159;&#19968;&#20010;&#22823;&#35268;&#27169;&#39640;&#20445;&#30495;&#24230;&#30340;CFD&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#21547;3D&#24037;&#19994;&#26631;&#20934;&#27773;&#36710;&#24418;&#29366;&#65292;&#20197;&#21450; RegDGCNN&#65292;&#36825;&#26159;&#19968;&#20010;&#21160;&#24577;&#22270;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#26088;&#22312;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#27773;&#36710;&#27668;&#21160;&#35774;&#35745;&#12290;DrivAerNet&#25317;&#26377;4000&#20010;&#35814;&#32454;&#30340;3D&#27773;&#36710;&#32593;&#26684;&#65292;&#20351;&#29992;50&#19975;&#20010;&#34920;&#38754;&#32593;&#26684;&#38754;&#21644;&#20840;&#38754;&#27668;&#21160;&#24615;&#33021;&#25968;&#25454;&#65292;&#21253;&#25324;&#23436;&#25972;&#30340;3D&#21387;&#21147;&#12289;&#36895;&#24230;&#22330;&#21644;&#22721;&#38754;&#21098;&#20999;&#24212;&#21147;&#65292;&#28385;&#36275;&#20102;&#24037;&#31243;&#24212;&#29992;&#20013;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25152;&#38656;&#30340;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#30340;&#36843;&#20999;&#38656;&#27714;&#12290;&#23427;&#27604;&#20808;&#21069;&#21487;&#29992;&#30340;&#26368;&#22823;&#20844;&#24320;&#27773;&#36710;&#25968;&#25454;&#38598;&#22823;60&#65285;&#65292;&#20063;&#26159;&#21807;&#19968;&#21516;&#26102;&#27169;&#25311;&#36718;&#27586;&#21644;&#24213;&#30424;&#30340;&#24320;&#28304;&#25968;&#25454;&#38598;&#12290;RegDGCNN&#21033;&#29992;&#36825;&#19968;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#65292;&#30452;&#25509;&#20174;3D&#32593;&#26684;&#25552;&#20379;&#39640;&#31934;&#24230;&#30340;&#38459;&#21147;&#20272;&#35745;&#65292;&#32469;&#36807;&#20102;&#20256;&#32479;&#38480;&#21046;&#65292;&#22914;&#38656;&#35201;2D&#22270;&#20687;&#28210;&#26579;&#25110;&#31526;&#21495;&#36317;&#31163;&#22330;&#65288;SDF&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08055v1 Announce Type: new  Abstract: This study introduces DrivAerNet, a large-scale high-fidelity CFD dataset of 3D industry-standard car shapes, and RegDGCNN, a dynamic graph convolutional neural network model, both aimed at aerodynamic car design through machine learning. DrivAerNet, with its 4000 detailed 3D car meshes using 0.5 million surface mesh faces and comprehensive aerodynamic performance data comprising of full 3D pressure, velocity fields, and wall-shear stresses, addresses the critical need for extensive datasets to train deep learning models in engineering applications. It is 60\% larger than the previously available largest public dataset of cars, and is the only open-source dataset that also models wheels and underbody. RegDGCNN leverages this large-scale dataset to provide high-precision drag estimates directly from 3D meshes, bypassing traditional limitations such as the need for 2D image rendering or Signed Distance Fields (SDF). By enabling fast drag e
&lt;/p&gt;</description></item></channel></rss>