<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20844;&#24179;&#35780;&#20272;&#26041;&#27861;&#65292;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#32676;&#20307;&#20013;&#30456;&#20284;&#30340;&#20010;&#20307;&#26469;&#35299;&#20915;&#32676;&#20307;&#20043;&#38388;&#30340;&#31995;&#32479;&#24046;&#24322;&#12290;&#36825;&#31181;&#26041;&#27861;&#22522;&#20110;&#20542;&#21521;&#24471;&#20998;&#65292;&#35782;&#21035;&#23545;&#31561;&#20010;&#20307;&#65292;&#36991;&#20813;&#20102;&#27604;&#36739;&#19981;&#21516;&#31867;&#22411;&#30340;&#20010;&#20307;&#65292;&#20174;&#32780;&#25552;&#39640;&#20844;&#24179;&#24615;&#35780;&#20272;&#30340;&#20934;&#30830;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.18160</link><description>&lt;p&gt;
&#23545;&#31561;&#20844;&#24179;&#24615;&#8212;&#8212;&#35299;&#20915;&#20844;&#24179;&#35780;&#20272;&#20013;&#32676;&#20307;&#20043;&#38388;&#31995;&#32479;&#24046;&#24322;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Counterpart Fairness -- Addressing Systematic between-group Differences in Fairness Evaluation. (arXiv:2305.18160v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18160
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20844;&#24179;&#35780;&#20272;&#26041;&#27861;&#65292;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#32676;&#20307;&#20013;&#30456;&#20284;&#30340;&#20010;&#20307;&#26469;&#35299;&#20915;&#32676;&#20307;&#20043;&#38388;&#30340;&#31995;&#32479;&#24046;&#24322;&#12290;&#36825;&#31181;&#26041;&#27861;&#22522;&#20110;&#20542;&#21521;&#24471;&#20998;&#65292;&#35782;&#21035;&#23545;&#31561;&#20010;&#20307;&#65292;&#36991;&#20813;&#20102;&#27604;&#36739;&#19981;&#21516;&#31867;&#22411;&#30340;&#20010;&#20307;&#65292;&#20174;&#32780;&#25552;&#39640;&#20844;&#24179;&#24615;&#35780;&#20272;&#30340;&#20934;&#30830;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#36741;&#21161;&#20915;&#31574;&#26102;&#65292;&#30830;&#20445;&#31639;&#27861;&#20915;&#31574;&#20844;&#24179;&#24615;&#33267;&#20851;&#37325;&#35201;&#65292;&#21363;&#19981;&#27495;&#35270;&#29305;&#23450;&#20010;&#20307;/&#32676;&#20307;&#65292;&#23588;&#20854;&#26159;&#26469;&#33258;&#24369;&#21183;&#32676;&#20307;&#30340;&#20154;&#12290;&#29616;&#26377;&#30340;&#32676;&#20307;&#20844;&#24179;&#26041;&#27861;&#35201;&#27714;&#36827;&#34892;&#24179;&#31561;&#30340;&#32676;&#20307;&#27979;&#37327;&#65292;&#20294;&#26410;&#32771;&#34385;&#32676;&#20307;&#20043;&#38388;&#30340;&#31995;&#32479;&#24046;&#24322;&#12290;&#28151;&#28102;&#22240;&#32032;&#65292;&#36825;&#20123;&#22240;&#32032;&#34429;&#28982;&#19982;&#25935;&#24863;&#21464;&#37327;&#26080;&#20851;&#65292;&#20294;&#34920;&#29616;&#20986;&#31995;&#32479;&#24046;&#24322;&#65292;&#20250;&#23545;&#20844;&#24179;&#35780;&#20272;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#35748;&#20026;&#20844;&#24179;&#27979;&#37327;&#24212;&#35813;&#22522;&#20110;&#19981;&#21516;&#32676;&#20307;&#20013;&#30456;&#20284;&#20110;&#24863;&#20852;&#36259;&#20219;&#21153;&#30340;&#23545;&#31561;&#20154;&#65288;&#21363;&#24444;&#27492;&#30456;&#20284;&#30340;&#20010;&#20307;&#65289;&#20043;&#38388;&#30340;&#27604;&#36739;&#65292;&#20854;&#32676;&#20307;&#36523;&#20221;&#19981;&#21487;&#36890;&#36807;&#25506;&#32034;&#28151;&#28102;&#22240;&#32032;&#31639;&#27861;&#22320;&#21306;&#20998;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#22522;&#20110;&#20542;&#21521;&#24471;&#20998;&#30340;&#26041;&#27861;&#26469;&#35782;&#21035;&#23545;&#31561;&#20010;&#20307;&#65292;&#20197;&#36991;&#20813;&#20844;&#24179;&#35780;&#20272;&#27604;&#36739;&#8220;&#27225;&#23376;&#8221;&#21644;&#8220;&#33529;&#26524;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;
When using machine learning (ML) to aid decision-making, it is critical to ensure that an algorithmic decision is fair, i.e., it does not discriminate against specific individuals/groups, particularly those from underprivileged populations. Existing group fairness methods require equal group-wise measures, which however fails to consider systematic between-group differences. The confounding factors, which are non-sensitive variables but manifest systematic differences, can significantly affect fairness evaluation. To tackle this problem, we believe that a fairness measurement should be based on the comparison between counterparts (i.e., individuals who are similar to each other with respect to the task of interest) from different groups, whose group identities cannot be distinguished algorithmically by exploring confounding factors. We have developed a propensity-score-based method for identifying counterparts, which prevents fairness evaluation from comparing "oranges" with "apples". 
&lt;/p&gt;</description></item></channel></rss>