<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>Conti&#20844;&#21496;&#30340;&#32842;&#22825;&#35760;&#24405;&#27844;&#38706;&#32473;&#25105;&#20204;&#25552;&#20379;&#20102;&#20102;&#35299;&#21202;&#32034;&#36719;&#20214;&#26381;&#21153;&#36816;&#33829;&#21830;&#20869;&#37096;&#36816;&#20316;&#30340;&#26426;&#20250;&#12290;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#21644;&#21487;&#35270;&#21270;&#31574;&#30053;&#65292;&#30740;&#31350;&#21457;&#29616;&#19994;&#21153;&#12289;&#25216;&#26415;&#12289;&#20869;&#37096;&#20219;&#21153;&#31649;&#29702;&#12289;&#24694;&#24847;&#36719;&#20214;&#21644;&#23458;&#25143;&#26381;&#21153;&#26159;Conti&#25104;&#21592;&#35752;&#35770;&#30340;&#20027;&#35201;&#20027;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.16061</link><description>&lt;p&gt;
Conti&#20844;&#21496;&#65306;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#20102;&#35299;&#19968;&#20010;&#22823;&#22411;&#21202;&#32034;&#36719;&#20214;&#26381;&#21153;&#36816;&#33829;&#21830;&#30340;&#20869;&#37096;&#35752;&#35770;
&lt;/p&gt;
&lt;p&gt;
Conti Inc.: Understanding the Internal Discussions of a large Ransomware-as-a-Service Operator with Machine Learning. (arXiv:2308.16061v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.16061
&lt;/p&gt;
&lt;p&gt;
Conti&#20844;&#21496;&#30340;&#32842;&#22825;&#35760;&#24405;&#27844;&#38706;&#32473;&#25105;&#20204;&#25552;&#20379;&#20102;&#20102;&#35299;&#21202;&#32034;&#36719;&#20214;&#26381;&#21153;&#36816;&#33829;&#21830;&#20869;&#37096;&#36816;&#20316;&#30340;&#26426;&#20250;&#12290;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#21644;&#21487;&#35270;&#21270;&#31574;&#30053;&#65292;&#30740;&#31350;&#21457;&#29616;&#19994;&#21153;&#12289;&#25216;&#26415;&#12289;&#20869;&#37096;&#20219;&#21153;&#31649;&#29702;&#12289;&#24694;&#24847;&#36719;&#20214;&#21644;&#23458;&#25143;&#26381;&#21153;&#26159;Conti&#25104;&#21592;&#35752;&#35770;&#30340;&#20027;&#35201;&#20027;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21202;&#32034;&#36719;&#20214;&#26381;&#21153;&#65288;RaaS&#65289;&#27491;&#22312;&#22686;&#21152;&#21202;&#32034;&#36719;&#20214;&#25915;&#20987;&#30340;&#35268;&#27169;&#21644;&#22797;&#26434;&#24615;&#12290;&#20102;&#35299;RaaS&#32972;&#21518;&#30340;&#20869;&#37096;&#36816;&#20316;&#19968;&#30452;&#26159;&#20010;&#25361;&#25112;&#65292;&#22240;&#20026;&#27492;&#31867;&#27963;&#21160;&#26159;&#38750;&#27861;&#30340;&#12290;&#26368;&#36817;Conti&#20844;&#21496;&#27844;&#38706;&#30340;&#32842;&#22825;&#35760;&#24405;&#32473;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#20102;&#35299;&#36825;&#31867;&#32452;&#32455;&#20869;&#37096;&#36816;&#20316;&#30340;&#33391;&#26426;&#12290;&#26412;&#25991;&#20351;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#21644;&#28508;&#22312;&#29380;&#21033;&#20811;&#38647;&#20998;&#37197;&#65288;LDA&#65289;&#31561;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#20197;&#21450;&#21487;&#35270;&#21270;&#31574;&#30053;&#65292;&#20998;&#26512;&#20102;Conti&#20844;&#21496;&#32842;&#22825;&#35760;&#24405;&#20013;&#30340;&#20027;&#35201;&#20027;&#39064;&#35752;&#35770;&#12290;&#21457;&#29616;&#20102;&#20116;&#20010;&#35752;&#35770;&#20027;&#39064;&#65306;1&#65289;&#19994;&#21153;&#65292;2&#65289;&#25216;&#26415;&#65292;3&#65289;&#20869;&#37096;&#20219;&#21153;/&#31649;&#29702;&#65292;4&#65289;&#24694;&#24847;&#36719;&#20214;&#65292;5&#65289;&#23458;&#25143;&#26381;&#21153;/&#38382;&#39064;&#35299;&#20915;&#12290;&#27492;&#22806;&#65292;Conti&#25104;&#21592;&#30340;&#20027;&#39064;&#20998;&#24067;&#26174;&#31034;&#65292;&#21482;&#26377;4%&#30340;&#20154;&#36827;&#34892;&#20102;&#19987;&#38376;&#30340;&#35752;&#35770;&#65292;&#32780;&#20960;&#20046;&#25152;&#26377;&#20154;&#65288;96%&#65289;&#37117;&#26159;&#20840;&#33021;&#22411;&#65292;&#24847;&#21619;&#30528;&#20182;&#20204;&#30340;&#35752;&#35770;&#37117;&#22260;&#32469;&#30528;&#36825;&#20116;&#20010;&#20027;&#39064;&#23637;&#24320;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ransomware-as-a-service (RaaS) is increasing the scale and complexity of ransomware attacks. Understanding the internal operations behind RaaS has been a challenge due to the illegality of such activities. The recent chat leak of the Conti RaaS operator, one of the most infamous ransomware operators on the international scene, offers a key opportunity to better understand the inner workings of such organizations. This paper analyzes the main topic discussions in the Conti chat leak using machine learning techniques such as Natural Language Processing (NLP) and Latent Dirichlet Allocation (LDA), as well as visualization strategies. Five discussion topics are found: 1) Business, 2) Technical, 3) Internal tasking/Management, 4) Malware, and 5) Customer Service/Problem Solving. Moreover, the distribution of topics among Conti members shows that only 4% of individuals have specialized discussions while almost all individuals (96%) are all-rounders, meaning that their discussions revolve aro
&lt;/p&gt;</description></item></channel></rss>