<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#39640;&#32500;&#38382;&#39064;&#12289;&#22312;&#20219;&#24847;&#25968;&#37327;&#25308;&#21344;&#24237;&#25915;&#20987;&#32773;&#19979;&#30340;&#26032;&#26041;&#27861;&#65292;&#26680;&#24515;&#26159;&#19968;&#31181;&#30452;&#25509;&#30340;&#39640;&#32500;&#21322;&#39564;&#35777;&#22343;&#20540;&#20272;&#35745;&#26041;&#27861;&#65292;&#20855;&#26377;&#26497;&#23567;&#26497;&#20540;&#32479;&#35745;&#29575;&#12290;</title><link>http://arxiv.org/abs/2307.13352</link><description>&lt;p&gt;
&#39640;&#32500;&#20998;&#24067;&#24335;&#26799;&#24230;&#19979;&#38477;&#31639;&#27861;&#22312;&#20219;&#24847;&#25968;&#37327;&#25308;&#21344;&#24237;&#25915;&#20987;&#32773;&#19979;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
High Dimensional Distributed Gradient Descent with Arbitrary Number of Byzantine Attackers. (arXiv:2307.13352v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13352
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#39640;&#32500;&#38382;&#39064;&#12289;&#22312;&#20219;&#24847;&#25968;&#37327;&#25308;&#21344;&#24237;&#25915;&#20987;&#32773;&#19979;&#30340;&#26032;&#26041;&#27861;&#65292;&#26680;&#24515;&#26159;&#19968;&#31181;&#30452;&#25509;&#30340;&#39640;&#32500;&#21322;&#39564;&#35777;&#22343;&#20540;&#20272;&#35745;&#26041;&#27861;&#65292;&#20855;&#26377;&#26497;&#23567;&#26497;&#20540;&#32479;&#35745;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#20855;&#26377;&#25308;&#21344;&#24237;&#25925;&#38556;&#30340;&#24378;&#40065;&#26834;&#20998;&#24067;&#24335;&#23398;&#20064;&#24341;&#36215;&#20102;&#24191;&#27867;&#20851;&#27880;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#22823;&#22810;&#21463;&#21040;&#32500;&#24230;&#35781;&#21650;&#30340;&#38480;&#21046;&#65292;&#38543;&#30528;&#29616;&#20195;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#22797;&#26434;&#24615;&#30340;&#22686;&#21152;&#65292;&#36825;&#20010;&#38382;&#39064;&#21464;&#24471;&#36234;&#26469;&#36234;&#20005;&#37325;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#39640;&#32500;&#38382;&#39064;&#12289;&#22312;&#20219;&#24847;&#25968;&#37327;&#25308;&#21344;&#24237;&#25915;&#20987;&#32773;&#19979;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#35774;&#35745;&#26680;&#24515;&#26159;&#19968;&#31181;&#30452;&#25509;&#30340;&#39640;&#32500;&#21322;&#39564;&#35777;&#22343;&#20540;&#20272;&#35745;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#24819;&#27861;&#26159;&#39318;&#20808;&#35782;&#21035;&#19968;&#20010;&#23376;&#31354;&#38388;&#65292;&#36890;&#36807;&#24037;&#20316;&#26426;&#19978;&#20256;&#30340;&#26799;&#24230;&#21521;&#37327;&#20272;&#35745;&#19982;&#35813;&#23376;&#31354;&#38388;&#22402;&#30452;&#30340;&#22343;&#20540;&#20998;&#37327;&#65292;&#32780;&#36890;&#36807;&#36741;&#21161;&#25968;&#25454;&#38598;&#20272;&#35745;&#35813;&#23376;&#31354;&#38388;&#20869;&#30340;&#22343;&#20540;&#20998;&#37327;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26032;&#26041;&#27861;&#29992;&#20316;&#20998;&#24067;&#24335;&#23398;&#20064;&#38382;&#39064;&#30340;&#32858;&#21512;&#22120;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;&#26032;&#26041;&#27861;&#20855;&#26377;&#26497;&#23567;&#26497;&#20540;&#32479;&#35745;&#29575;&#12290;&#29305;&#21035;&#22320;&#65292;&#23545;&#32500;&#24230;&#30340;&#20381;&#36182;&#24615;&#24471;&#21040;&#20102;&#26174;&#33879;&#25913;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;
Robust distributed learning with Byzantine failures has attracted extensive research interests in recent years. However, most of existing methods suffer from curse of dimensionality, which is increasingly serious with the growing complexity of modern machine learning models. In this paper, we design a new method that is suitable for high dimensional problems, under arbitrary number of Byzantine attackers. The core of our design is a direct high dimensional semi-verified mean estimation method. Our idea is to identify a subspace first. The components of mean value perpendicular to this subspace can be estimated via gradient vectors uploaded from worker machines, while the components within this subspace are estimated using auxiliary dataset. We then use our new method as the aggregator of distributed learning problems. Our theoretical analysis shows that the new method has minimax optimal statistical rates. In particular, the dependence on dimensionality is significantly improved compar
&lt;/p&gt;</description></item></channel></rss>