<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#19981;&#30830;&#23450;&#24615;&#30340;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;&#32676;&#20307;&#32423;&#24773;&#32490;&#35782;&#21035;&#12290;&#36890;&#36807;&#27169;&#22411;&#21270;&#27599;&#20010;&#20010;&#20307;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#21033;&#29992;&#38543;&#26426;&#23884;&#20837;&#26469;&#20195;&#26367;&#30830;&#23450;&#24615;&#30340;&#28857;&#23884;&#20837;&#12290;&#36825;&#31181;&#34920;&#31034;&#33021;&#22815;&#25429;&#25417;&#27010;&#29575;&#21644;&#22312;&#25512;&#26029;&#38454;&#27573;&#20135;&#29983;&#22810;&#26679;&#30340;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2310.04306</link><description>&lt;p&gt;
&#36890;&#36807;&#32771;&#34385;&#19981;&#30830;&#23450;&#24615;&#30340;&#23398;&#20064;&#26041;&#27861;&#23454;&#29616;&#40065;&#26834;&#30340;&#32676;&#20307;&#32423;&#24773;&#32490;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Towards A Robust Group-level Emotion Recognition via Uncertainty-Aware Learning. (arXiv:2310.04306v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04306
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#19981;&#30830;&#23450;&#24615;&#30340;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;&#32676;&#20307;&#32423;&#24773;&#32490;&#35782;&#21035;&#12290;&#36890;&#36807;&#27169;&#22411;&#21270;&#27599;&#20010;&#20010;&#20307;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#21033;&#29992;&#38543;&#26426;&#23884;&#20837;&#26469;&#20195;&#26367;&#30830;&#23450;&#24615;&#30340;&#28857;&#23884;&#20837;&#12290;&#36825;&#31181;&#34920;&#31034;&#33021;&#22815;&#25429;&#25417;&#27010;&#29575;&#21644;&#22312;&#25512;&#26029;&#38454;&#27573;&#20135;&#29983;&#22810;&#26679;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32676;&#20307;&#32423;&#24773;&#32490;&#35782;&#21035;&#26159;&#20154;&#31867;&#34892;&#20026;&#20998;&#26512;&#20013;&#19981;&#21487;&#20998;&#21106;&#30340;&#19968;&#37096;&#20998;&#65292;&#26088;&#22312;&#35782;&#21035;&#22810;&#20154;&#22330;&#26223;&#20013;&#30340;&#25972;&#20307;&#24773;&#32490;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#33268;&#21147;&#20110;&#25972;&#21512;&#19981;&#21516;&#30340;&#24773;&#32490;&#32447;&#32034;&#65292;&#32780;&#24573;&#35270;&#20102;&#22312;&#26080;&#32422;&#26463;&#29615;&#22659;&#19979;&#23384;&#22312;&#30340;&#22242;&#20307;&#20869;&#25317;&#25380;&#21644;&#36974;&#25377;&#31561;&#22266;&#26377;&#19981;&#30830;&#23450;&#24615;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#20165;&#26377;&#32676;&#20307;&#32423;&#26631;&#31614;&#21487;&#29992;&#65292;&#22312;&#19968;&#20010;&#32676;&#20307;&#20013;&#20010;&#20307;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24773;&#32490;&#39044;&#27979;&#20250;&#28151;&#28102;&#32593;&#32476;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#19981;&#30830;&#23450;&#24615;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#20026;&#32676;&#20307;&#32423;&#24773;&#32490;&#35782;&#21035;&#25552;&#21462;&#26356;&#21152;&#40065;&#26834;&#30340;&#34920;&#31034;&#12290;&#36890;&#36807;&#26126;&#30830;&#22320;&#24314;&#27169;&#27599;&#20010;&#20010;&#20307;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#25105;&#20204;&#21033;&#29992;&#39640;&#26031;&#20998;&#24067;&#20013;&#30340;&#38543;&#26426;&#23884;&#20837;&#26469;&#20195;&#26367;&#30830;&#23450;&#24615;&#30340;&#28857;&#23884;&#20837;&#12290;&#36825;&#31181;&#34920;&#31034;&#25429;&#25417;&#20102;&#19981;&#21516;&#24773;&#32490;&#30340;&#27010;&#29575;&#65292;&#24182;&#36890;&#36807;&#36825;&#31181;&#38543;&#26426;&#24615;&#22312;&#25512;&#26029;&#38454;&#27573;&#20135;&#29983;&#22810;&#26679;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Group-level emotion recognition (GER) is an inseparable part of human behavior analysis, aiming to recognize an overall emotion in a multi-person scene. However, the existing methods are devoted to combing diverse emotion cues while ignoring the inherent uncertainties under unconstrained environments, such as congestion and occlusion occurring within a group. Additionally, since only group-level labels are available, inconsistent emotion predictions among individuals in one group can confuse the network. In this paper, we propose an uncertainty-aware learning (UAL) method to extract more robust representations for GER. By explicitly modeling the uncertainty of each individual, we utilize stochastic embedding drawn from a Gaussian distribution instead of deterministic point embedding. This representation captures the probabilities of different emotions and generates diverse predictions through this stochasticity during the inference stage. Furthermore, uncertainty-sensitive scores are a
&lt;/p&gt;</description></item></channel></rss>