<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#36890;&#36807;&#27010;&#29575;&#22635;&#20805;&#25935;&#24863;&#29305;&#24449;&#65292;&#32852;&#21512;&#23398;&#20064;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#27010;&#29575;&#65292;&#22686;&#24378;&#19968;&#33324;&#20844;&#24179;&#39118;&#38505;&#65292;&#23454;&#29616;&#20934;&#30830;&#24615;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#30340;&#25913;&#36827;&#24179;&#34913;</title><link>https://arxiv.org/abs/2402.13393</link><description>&lt;p&gt;
&#38024;&#23545;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#30340;&#20844;&#24179;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Fairness Risks for Group-conditionally Missing Demographics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13393
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27010;&#29575;&#22635;&#20805;&#25935;&#24863;&#29305;&#24449;&#65292;&#32852;&#21512;&#23398;&#20064;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#27010;&#29575;&#65292;&#22686;&#24378;&#19968;&#33324;&#20844;&#24179;&#39118;&#38505;&#65292;&#23454;&#29616;&#20934;&#30830;&#24615;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#30340;&#25913;&#36827;&#24179;&#34913;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#20844;&#24179;&#24847;&#35782;&#30340;&#20998;&#31867;&#27169;&#22411;&#36817;&#24180;&#26469;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#65292;&#22240;&#20026;&#23545;&#26576;&#20123;&#20154;&#21475;&#32479;&#35745;&#32676;&#20307;&#30340;&#27495;&#35270;&#38382;&#39064;&#26085;&#30410;&#24341;&#36215;&#25285;&#24551;&#12290;&#22823;&#22810;&#25968;&#29616;&#26377;&#27169;&#22411;&#35201;&#27714;&#23436;&#20840;&#20102;&#35299;&#25935;&#24863;&#29305;&#24449;&#65292;&#36825;&#21487;&#33021;&#30001;&#20110;&#38544;&#31169;&#12289;&#27861;&#24459;&#38382;&#39064;&#21644;&#20010;&#20154;&#23545;&#27495;&#35270;&#30340;&#24656;&#24807;&#32780;&#19981;&#20999;&#23454;&#38469;&#12290;&#25105;&#20204;&#23558;&#35299;&#20915;&#30340;&#20851;&#38190;&#25361;&#25112;&#26159;&#19981;&#21487;&#29992;&#24615;&#30340;&#32676;&#20307;&#20381;&#36182;&#24615;&#65292;&#20363;&#22914;&#65292;&#26576;&#20123;&#24180;&#40836;&#33539;&#22260;&#30340;&#20154;&#21487;&#33021;&#26356;&#19981;&#24895;&#36879;&#38706;&#20182;&#20204;&#30340;&#24180;&#40836;&#12290;&#25105;&#20204;&#30340;&#35299;&#20915;&#26041;&#26696;&#36890;&#36807;&#23545;&#25935;&#24863;&#29305;&#24449;&#36827;&#34892;&#27010;&#29575;&#22635;&#20805;&#65292;&#21516;&#26102;&#22312;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#20013;&#32852;&#21512;&#23398;&#20064;&#32676;&#20307;&#26465;&#20214;&#24615;&#32570;&#22833;&#30340;&#27010;&#29575;&#65292;&#23558;&#19968;&#33324;&#20844;&#24179;&#39118;&#38505;&#19982;&#20043;&#22686;&#24378;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22270;&#20687;&#21644;&#34920;&#26684;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20986;&#20102;&#26377;&#25928;&#24615;&#65292;&#23454;&#29616;&#20102;&#20934;&#30830;&#24615;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#30340;&#25913;&#36827;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13393v1 Announce Type: new  Abstract: Fairness-aware classification models have gained increasing attention in recent years as concerns grow on discrimination against some demographic groups. Most existing models require full knowledge of the sensitive features, which can be impractical due to privacy, legal issues, and an individual's fear of discrimination. The key challenge we will address is the group dependency of the unavailability, e.g., people of some age range may be more reluctant to reveal their age. Our solution augments general fairness risks with probabilistic imputations of the sensitive features, while jointly learning the group-conditionally missing probabilities in a variational auto-encoder. Our model is demonstrated effective on both image and tabular datasets, achieving an improved balance between accuracy and fairness.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#32508;&#36848;&#21644;&#35843;&#26597;&#30740;&#31350;&#29289;&#32852;&#32593;&#22312;&#20919;&#38142;&#20013;&#30340;&#23454;&#26045;&#38556;&#30861;&#65292;&#21457;&#29616;&#20102;13&#20010;&#20851;&#38190;&#38556;&#30861;&#12290;&#20854;&#20013;&#65292;&#21512;&#35268;&#24615;&#21644;&#20919;&#38142;&#32593;&#32476;&#26159;&#29289;&#32852;&#32593;&#37319;&#29992;&#31574;&#30053;&#30340;&#20851;&#38190;&#39537;&#21160;&#22240;&#32032;&#12290;MICMAC&#21644;DEMATEL&#26041;&#27861;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#35780;&#20272;&#38556;&#30861;&#20043;&#38388;&#30340;&#20114;&#21160;&#20851;&#31995;&#21644;&#22240;&#26524;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2402.01804</link><description>&lt;p&gt;
&#20919;&#38142;&#20013;&#29289;&#32852;&#32593;&#23454;&#26045;&#38556;&#30861;&#30340;&#20998;&#26512;&#65306;&#19968;&#31181;&#38598;&#25104;&#30340;ISM-MICMAC&#21644;DEMATEL&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Analysis of Internet of Things implementation barriers in the cold supply chain: an integrated ISM-MICMAC and DEMATEL approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01804
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#32508;&#36848;&#21644;&#35843;&#26597;&#30740;&#31350;&#29289;&#32852;&#32593;&#22312;&#20919;&#38142;&#20013;&#30340;&#23454;&#26045;&#38556;&#30861;&#65292;&#21457;&#29616;&#20102;13&#20010;&#20851;&#38190;&#38556;&#30861;&#12290;&#20854;&#20013;&#65292;&#21512;&#35268;&#24615;&#21644;&#20919;&#38142;&#32593;&#32476;&#26159;&#29289;&#32852;&#32593;&#37319;&#29992;&#31574;&#30053;&#30340;&#20851;&#38190;&#39537;&#21160;&#22240;&#32032;&#12290;MICMAC&#21644;DEMATEL&#26041;&#27861;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#35780;&#20272;&#38556;&#30861;&#20043;&#38388;&#30340;&#20114;&#21160;&#20851;&#31995;&#21644;&#22240;&#26524;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23558;&#29289;&#32852;&#32593;&#25216;&#26415;&#25972;&#21512;&#21040;&#20919;&#38142;&#20013;&#21487;&#20197;&#25552;&#39640;&#36879;&#26126;&#24230;&#12289;&#25928;&#29575;&#21644;&#36136;&#37327;&#65292;&#20248;&#21270;&#36816;&#33829;&#27969;&#31243;&#24182;&#25552;&#39640;&#29983;&#20135;&#21147;&#12290;&#22312;&#22797;&#26434;&#30340;&#29615;&#22659;&#19979;&#65292;&#29289;&#32852;&#32593;&#22312;&#20919;&#38142;&#20013;&#30340;&#38598;&#25104;&#21463;&#21040;&#29305;&#23450;&#30340;&#38556;&#30861;&#30340;&#38459;&#30861;&#65292;&#38656;&#35201;&#36827;&#34892;&#20840;&#38754;&#30340;&#30740;&#31350;&#12290;&#36890;&#36807;&#23545;&#29289;&#32852;&#32593;&#23454;&#26045;&#30340;&#30456;&#20851;&#25991;&#29486;&#36827;&#34892;&#32508;&#36848;&#65292;&#20849;&#21457;&#29616;&#20102;13&#20010;&#38556;&#30861;&#12290;&#35843;&#26597;&#25968;&#25454;&#32463;&#36807;&#20132;&#21449;&#39564;&#35777;&#20197;&#30830;&#20445;&#36136;&#37327;&#65292;&#24182;&#37319;&#29992;Cronbach's alpha&#27979;&#35797;&#26469;&#30830;&#20445;&#26377;&#25928;&#24615;&#12290;&#26412;&#30740;&#31350;&#22312;&#31532;&#19968;&#38454;&#27573;&#24212;&#29992;&#35299;&#37322;&#24615;&#32467;&#26500;&#24314;&#27169;&#25216;&#26415;&#20197;&#35782;&#21035;&#20027;&#35201;&#38556;&#30861;&#12290;&#22312;&#36825;&#20123;&#38556;&#30861;&#20013;&#65292;&#8220;&#21512;&#35268;&#24615;&#8221;&#21644;&#8220;&#20919;&#38142;&#32593;&#32476;&#8221;&#26159;&#29289;&#32852;&#32593;&#37319;&#29992;&#31574;&#30053;&#30340;&#20851;&#38190;&#39537;&#21160;&#22240;&#32032;&#12290;MICMAC&#30340;&#39537;&#21160;&#21644;&#20381;&#36182;&#21147;&#37327;&#20803;&#32032;&#20998;&#31867;&#26377;&#21161;&#20110;&#35780;&#20272;&#38556;&#30861;&#20043;&#38388;&#30340;&#20114;&#21160;&#12290;&#22312;&#26412;&#30740;&#31350;&#30340;&#31532;&#20108;&#38454;&#27573;&#20013;&#65292;&#36890;&#36807;DEMATEL&#26041;&#27861;&#30830;&#23450;&#20102;&#25152;&#35782;&#21035;&#38556;&#30861;&#20043;&#38388;&#30340;&#22240;&#26524;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Integrating Internet of Things (IoT) technology inside the cold supply chain can enhance transparency, efficiency, and quality, optimizing operating procedures and increasing productivity. The integration of IoT in this complicated setting is hindered by specific barriers that need a thorough examination. Prominent barriers to IoT implementation in the cold supply chain are identified using a two-stage model. After reviewing the available literature on the topic of IoT implementation, a total of 13 barriers were found. The survey data was cross-validated for quality, and Cronbach's alpha test was employed to ensure validity. This research applies the interpretative structural modeling technique in the first phase to identify the main barriers. Among those barriers, "regularity compliance" and "cold chain networks" are key drivers for IoT adoption strategies. MICMAC's driving and dependence power element categorization helps evaluate the barrier interactions. In the second phase of this
&lt;/p&gt;</description></item></channel></rss>