<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#39044;&#27979;&#39134;&#26426;&#26426;&#36523;&#21160;&#24577;&#27700;&#38477;&#36733;&#33655;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#21367;&#31215;&#33258;&#32534;&#30721;&#22120;&#21644;&#38271;&#30701;&#26399;&#35760;&#24518;&#32593;&#32476;&#25110;Koopman&#31639;&#23376;&#26041;&#27861;&#65292;&#21462;&#24471;&#20102;&#20196;&#20154;&#28385;&#24847;&#30340;&#39044;&#27979;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.10724</link><description>&lt;p&gt;
&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#27700;&#38477;&#36733;&#33655;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Machine Learning based Prediction of Ditching Loads
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10724
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#39044;&#27979;&#39134;&#26426;&#26426;&#36523;&#21160;&#24577;&#27700;&#38477;&#36733;&#33655;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#21367;&#31215;&#33258;&#32534;&#30721;&#22120;&#21644;&#38271;&#30701;&#26399;&#35760;&#24518;&#32593;&#32476;&#25110;Koopman&#31639;&#23376;&#26041;&#27861;&#65292;&#21462;&#24471;&#20102;&#20196;&#20154;&#28385;&#24847;&#30340;&#39044;&#27979;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#39044;&#27979;&#39134;&#26426;&#26426;&#36523;&#21160;&#24577;&#27700;&#38477;&#36733;&#33655;&#30340;&#26041;&#27861;&#12290;&#25152;&#37319;&#29992;&#30340;&#23398;&#20064;&#36807;&#31243;&#20998;&#20026;&#20004;&#37096;&#20998;&#65292;&#21363;&#20351;&#29992;&#21367;&#31215;&#33258;&#32534;&#30721;&#22120;&#65288;CAE&#65289;&#37325;&#26500;&#31354;&#38388;&#36733;&#33655;&#65292;&#20197;&#21450;&#22312;&#38543;&#21518;&#30340;&#37096;&#20998;&#20013;&#36825;&#20123;&#36733;&#33655;&#30340;&#30636;&#26102;&#28436;&#21270;&#12290;&#35780;&#20272;&#20102;&#19981;&#21516;&#30340;CAE&#31574;&#30053;&#65292;&#24182;&#23558;&#20854;&#19982;&#38271;&#30701;&#26399;&#35760;&#24518;&#65288;LSTM&#65289;&#32593;&#32476;&#25110;&#22522;&#20110;Koopman&#31639;&#23376;&#30340;&#26041;&#27861;&#30456;&#32467;&#21512;&#65292;&#20197;&#39044;&#27979;&#30636;&#26102;&#34892;&#20026;&#12290;&#35757;&#32451;&#25968;&#25454;&#26159;&#36890;&#36807;von-Karman&#21644;Wagner&#30340;&#21160;&#37327;&#26041;&#27861;&#30340;&#25193;&#23637;&#32534;&#21046;&#30340;&#65292;&#35757;&#32451;&#26041;&#27861;&#30340;&#22522;&#26412;&#21407;&#29702;&#34987;&#31616;&#35201;&#24635;&#32467;&#12290;&#25152;&#28041;&#21450;&#30340;&#24212;&#29992;&#26159;&#25351;DLR-D150&#39134;&#26426;&#30340;&#20840;&#23610;&#23544;&#26426;&#36523;&#65292;&#21253;&#25324;&#19968;&#31995;&#21015;&#27700;&#24179;&#21644;&#22402;&#30452;&#36827;&#22330;&#36895;&#24230;&#65292;&#20837;&#23556;&#35282;&#20026;6&#176;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#25152;&#26377;&#22235;&#20010;&#30740;&#31350;&#30340;&#20195;&#29702;&#27169;&#22411;&#65292;&#37319;&#29992;LSTM&#32467;&#21512;...&#65288;&#20869;&#23481;&#32570;&#22833;&#65289;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10724v1 Announce Type: new  Abstract: We present approaches to predict dynamic ditching loads on aircraft fuselages using machine learning. The employed learning procedure is structured into two parts, the reconstruction of the spatial loads using a convolutional autoencoder (CAE) and the transient evolution of these loads in a subsequent part. Different CAE strategies are assessed and combined with either long short-term memory (LSTM) networks or Koopman-operator based methods to predict the transient behaviour. The training data is compiled by an extension of the momentum method of von-Karman and Wagner and the rationale of the training approach is briefly summarised. The application included refers to a full-scale fuselage of a DLR-D150 aircraft for a range of horizontal and vertical approach velocities at 6{\deg} incidence. Results indicate a satisfactory level of predictive agreement for all four investigated surrogate models examined, with the combination of an LSTM an
&lt;/p&gt;</description></item></channel></rss>