<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#25968;&#23398;&#26694;&#26550;&#65292;&#21517;&#20026;&#35748;&#30693;&#23433;&#20840;&#65292;&#29992;&#20110;&#25551;&#36848;&#21644;&#20998;&#26512;&#31070;&#32463;&#25216;&#26415;&#23545;&#20010;&#20307;&#35748;&#30693;&#38544;&#31169;&#21644;&#33258;&#27835;&#21487;&#33021;&#20135;&#29983;&#30340;&#24433;&#21709;&#65292;&#35299;&#20915;&#20102;&#30456;&#20851;&#38382;&#39064;&#25551;&#36848;&#21644;&#20998;&#26512;&#30340;&#38556;&#30861;&#12290;</title><link>https://arxiv.org/abs/2403.07945</link><description>&lt;p&gt;
&#19968;&#20010;&#35299;&#20915;&#31070;&#32463;&#25216;&#26415;&#35748;&#30693;&#23433;&#20840;&#38382;&#39064;&#30340;&#25968;&#23398;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Mathematical Framework for the Problem of Security for Cognition in Neurotechnology
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07945
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#25968;&#23398;&#26694;&#26550;&#65292;&#21517;&#20026;&#35748;&#30693;&#23433;&#20840;&#65292;&#29992;&#20110;&#25551;&#36848;&#21644;&#20998;&#26512;&#31070;&#32463;&#25216;&#26415;&#23545;&#20010;&#20307;&#35748;&#30693;&#38544;&#31169;&#21644;&#33258;&#27835;&#21487;&#33021;&#20135;&#29983;&#30340;&#24433;&#21709;&#65292;&#35299;&#20915;&#20102;&#30456;&#20851;&#38382;&#39064;&#25551;&#36848;&#21644;&#20998;&#26512;&#30340;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#31070;&#32463;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#22312;&#31070;&#32463;&#25216;&#26415;&#21644;&#23433;&#20840;&#20043;&#38388;&#21019;&#36896;&#20102;&#19968;&#20010;&#26032;&#20852;&#30340;&#20851;&#38190;&#20132;&#21449;&#28857;&#12290;&#26893;&#20837;&#24335;&#35774;&#22791;&#12289;&#38750;&#20405;&#20837;&#24335;&#30417;&#27979;&#21644;&#38750;&#20405;&#20837;&#24335;&#27835;&#30103;&#37117;&#24102;&#26469;&#20102;&#36829;&#21453;&#20010;&#20307;&#35748;&#30693;&#38544;&#31169;&#21644;&#33258;&#27835;&#30340;&#21069;&#26223;&#12290;&#36234;&#26469;&#36234;&#22810;&#30340;&#31185;&#23398;&#23478;&#21644;&#21307;&#29983;&#21628;&#21505;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064; -- &#25105;&#20204;&#31216;&#20043;&#20026;&#35748;&#30693;&#23433;&#20840; -- &#20294;&#24212;&#29992;&#24037;&#20316;&#21463;&#21040;&#38480;&#21046;&#12290;&#38459;&#30861;&#31185;&#23398;&#21644;&#24037;&#31243;&#21162;&#21147;&#35299;&#20915;&#35748;&#30693;&#23433;&#20840;&#38382;&#39064;&#30340;&#19968;&#20010;&#20027;&#35201;&#38556;&#30861;&#26159;&#32570;&#20047;&#28165;&#26224;&#25551;&#36848;&#21644;&#20998;&#26512;&#30456;&#20851;&#38382;&#39064;&#30340;&#25163;&#27573;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#35748;&#30693;&#23433;&#20840;&#65292;&#36825;&#26159;&#19968;&#20010;&#25968;&#23398;&#26694;&#26550;&#65292;&#36890;&#36807;&#20511;&#37492;&#22810;&#20010;&#39046;&#22495;&#30340;&#26041;&#27861;&#21644;&#32467;&#26524;&#65292;&#23454;&#29616;&#36825;&#31181;&#25551;&#36848;&#21644;&#20998;&#26512;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20123;&#23545;&#35748;&#30693;&#23433;&#20840;&#26377;&#37325;&#35201;&#24433;&#21709;&#30340;&#32479;&#35745;&#29305;&#24615;&#65292;&#28982;&#21518;&#25552;&#20986;&#25551;&#36848;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07945v1 Announce Type: cross  Abstract: The rapid advancement in neurotechnology in recent years has created an emerging critical intersection between neurotechnology and security. Implantable devices, non-invasive monitoring, and non-invasive therapies all carry with them the prospect of violating the privacy and autonomy of individuals' cognition. A growing number of scientists and physicians have made calls to address this issue -- which we term Cognitive Security -- but applied efforts have been limited. A major barrier hampering scientific and engineering efforts to address Cognitive Security is the lack of a clear means of describing and analyzing relevant problems. In this paper we develop Cognitive Security, a mathematical framework which enables such description and analysis by drawing on methods and results from multiple fields. We demonstrate certain statistical properties which have significant implications for Cognitive Security, and then present descriptions of
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#38024;&#23545;&#29983;&#25104;&#27169;&#22411;&#25552;&#20986;&#20102;&#19968;&#31181;&#27010;&#29575;&#27874;&#21160;&#35780;&#20272;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#26041;&#27861;(PFAMI)&#65292;&#36890;&#36807;&#26816;&#27979;&#27010;&#29575;&#20998;&#24067;&#30340;&#27874;&#21160;&#24615;&#26469;&#25512;&#26029;&#27169;&#22411;&#20013;&#26159;&#21542;&#23384;&#22312;&#26576;&#26465;&#35757;&#32451;&#35760;&#24405;&#30340;&#25104;&#21592;&#36523;&#20221;&#12290;</title><link>http://arxiv.org/abs/2308.12143</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#27010;&#29575;&#27874;&#21160;&#30340;&#29983;&#25104;&#27169;&#22411;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Probabilistic Fluctuation based Membership Inference Attack for Generative Models. (arXiv:2308.12143v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12143
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#29983;&#25104;&#27169;&#22411;&#25552;&#20986;&#20102;&#19968;&#31181;&#27010;&#29575;&#27874;&#21160;&#35780;&#20272;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#26041;&#27861;(PFAMI)&#65292;&#36890;&#36807;&#26816;&#27979;&#27010;&#29575;&#20998;&#24067;&#30340;&#27874;&#21160;&#24615;&#26469;&#25512;&#26029;&#27169;&#22411;&#20013;&#26159;&#21542;&#23384;&#22312;&#26576;&#26465;&#35757;&#32451;&#35760;&#24405;&#30340;&#25104;&#21592;&#36523;&#20221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;(MIA)&#36890;&#36807;&#26597;&#35810;&#27169;&#22411;&#26469;&#35782;&#21035;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#35757;&#32451;&#38598;&#20013;&#26159;&#21542;&#23384;&#22312;&#26576;&#26465;&#35760;&#24405;&#12290;&#23545;&#32463;&#20856;&#20998;&#31867;&#27169;&#22411;&#30340;MIA&#24050;&#26377;&#24456;&#22810;&#30740;&#31350;&#65292;&#26368;&#36817;&#30340;&#24037;&#20316;&#24320;&#22987;&#25506;&#32034;&#22914;&#20309;&#23558;MIA&#24212;&#29992;&#21040;&#29983;&#25104;&#27169;&#22411;&#19978;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#29616;&#26377;&#30340;&#38754;&#21521;&#29983;&#25104;&#27169;&#22411;&#30340;MIA&#20027;&#35201;&#20381;&#36182;&#20110;&#30446;&#26631;&#27169;&#22411;&#30340;&#36807;&#25311;&#21512;&#29616;&#35937;&#12290;&#28982;&#32780;&#65292;&#36807;&#25311;&#21512;&#21487;&#20197;&#36890;&#36807;&#37319;&#29992;&#21508;&#31181;&#27491;&#21017;&#21270;&#25216;&#26415;&#26469;&#36991;&#20813;&#65292;&#32780;&#29616;&#26377;&#30340;MIA&#22312;&#23454;&#36341;&#20013;&#34920;&#29616;&#19981;&#20339;&#12290;&#19982;&#36807;&#25311;&#21512;&#19981;&#21516;&#65292;&#35760;&#24518;&#23545;&#20110;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#23454;&#29616;&#26368;&#20339;&#24615;&#33021;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#65292;&#20351;&#20854;&#25104;&#20026;&#19968;&#31181;&#26356;&#20026;&#26222;&#36941;&#30340;&#29616;&#35937;&#12290;&#29983;&#25104;&#27169;&#22411;&#20013;&#30340;&#35760;&#24518;&#23548;&#33268;&#29983;&#25104;&#35760;&#24405;&#30340;&#27010;&#29575;&#20998;&#24067;&#21576;&#29616;&#20986;&#22686;&#38271;&#30340;&#36235;&#21183;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27010;&#29575;&#27874;&#21160;&#30340;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#26041;&#27861;(PFAMI)&#65292;&#23427;&#26159;&#19968;&#31181;&#40657;&#30418;MIA&#65292;&#36890;&#36807;&#26816;&#27979;&#27010;&#29575;&#27874;&#21160;&#26469;&#25512;&#26029;&#25104;&#21592;&#36523;&#20221;&#12290;
&lt;/p&gt;
&lt;p&gt;
Membership Inference Attack (MIA) identifies whether a record exists in a machine learning model's training set by querying the model. MIAs on the classic classification models have been well-studied, and recent works have started to explore how to transplant MIA onto generative models. Our investigation indicates that existing MIAs designed for generative models mainly depend on the overfitting in target models. However, overfitting can be avoided by employing various regularization techniques, whereas existing MIAs demonstrate poor performance in practice. Unlike overfitting, memorization is essential for deep learning models to attain optimal performance, making it a more prevalent phenomenon. Memorization in generative models leads to an increasing trend in the probability distribution of generating records around the member record. Therefore, we propose a Probabilistic Fluctuation Assessing Membership Inference Attack (PFAMI), a black-box MIA that infers memberships by detecting t
&lt;/p&gt;</description></item></channel></rss>