<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#22522;&#20110;&#36710;&#36742;&#32452;&#20316;&#20026;&#20998;&#26512;&#23545;&#35937;&#65292;&#25506;&#35752;&#20102;&#32771;&#34385;&#36710;&#36742;&#32452;&#21644;&#36947;&#36335;&#27573;&#29305;&#24449;&#30340;&#39118;&#38505;&#24418;&#25104;&#21644;&#20256;&#25773;&#26426;&#21046;&#65292;&#35782;&#21035;&#20986;&#24433;&#21709;&#30896;&#25758;&#39118;&#38505;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;</title><link>https://arxiv.org/abs/2402.12415</link><description>&lt;p&gt;
&#22522;&#20110;&#36710;&#36742;&#32452;&#30340;&#39640;&#36895;&#20844;&#36335;&#30896;&#25758;&#39118;&#38505;&#24418;&#25104;&#21644;&#20256;&#25773;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Vehicle-group-based Crash Risk Formation and Propagation Analysis for Expressways
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12415
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22522;&#20110;&#36710;&#36742;&#32452;&#20316;&#20026;&#20998;&#26512;&#23545;&#35937;&#65292;&#25506;&#35752;&#20102;&#32771;&#34385;&#36710;&#36742;&#32452;&#21644;&#36947;&#36335;&#27573;&#29305;&#24449;&#30340;&#39118;&#38505;&#24418;&#25104;&#21644;&#20256;&#25773;&#26426;&#21046;&#65292;&#35782;&#21035;&#20986;&#24433;&#21709;&#30896;&#25758;&#39118;&#38505;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20808;&#21069;&#30340;&#30740;&#31350;&#20027;&#35201;&#23558;&#36335;&#27573;&#19978;&#30340;&#30896;&#25758;&#25968;&#37327;&#25110;&#21487;&#33021;&#24615;&#19982;&#20132;&#36890;&#21442;&#25968;&#25110;&#36335;&#27573;&#30340;&#20960;&#20309;&#29305;&#24449;&#32852;&#31995;&#36215;&#26469;&#65292;&#36890;&#24120;&#24573;&#30053;&#20102;&#36710;&#36742;&#36830;&#32493;&#36816;&#21160;&#21644;&#19982;&#38468;&#36817;&#36710;&#36742;&#30340;&#20114;&#21160;&#23545;&#20854;&#24433;&#21709;&#12290;&#36890;&#20449;&#25216;&#26415;&#30340;&#36827;&#27493;&#36171;&#20104;&#20102;&#20174;&#21608;&#22260;&#36710;&#36742;&#25910;&#38598;&#39550;&#39542;&#20449;&#24687;&#30340;&#33021;&#21147;&#65292;&#20351;&#24471;&#30740;&#31350;&#22522;&#20110;&#36710;&#36742;&#32452;&#30340;&#30896;&#25758;&#39118;&#38505;&#25104;&#20026;&#21487;&#33021;&#12290;&#22522;&#20110;&#39640;&#20998;&#36776;&#29575;&#36710;&#36742;&#36712;&#36857;&#25968;&#25454;&#65292;&#26412;&#30740;&#31350;&#20197;&#36710;&#36742;&#32452;&#20316;&#20026;&#20998;&#26512;&#23545;&#35937;&#65292;&#25506;&#35752;&#20102;&#32771;&#34385;&#36710;&#36742;&#32452;&#21644;&#36947;&#36335;&#27573;&#29305;&#24449;&#30340;&#39118;&#38505;&#24418;&#25104;&#21644;&#20256;&#25773;&#26426;&#21046;&#12290;&#30830;&#23450;&#20102;&#20960;&#20010;&#24433;&#21709;&#30896;&#25758;&#39118;&#38505;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#21253;&#25324;&#36807;&#21435;&#30340;&#39640;&#39118;&#38505;&#36710;&#36742;&#32452;&#29366;&#24577;&#12289;&#22797;&#26434;&#30340;&#36710;&#36742;&#34892;&#20026;&#12289;&#22823;&#22411;&#36710;&#36742;&#30340;&#39640;&#30334;&#20998;&#27604;&#12289;&#36710;&#36742;&#32452;&#20869;&#39057;&#32321;&#21464;&#36947;&#20197;&#21450;&#29305;&#23450;&#30340;&#36947;&#36335;&#20960;&#20309;&#24418;&#29366;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12415v1 Announce Type: new  Abstract: Previous studies in predicting crash risk primarily associated the number or likelihood of crashes on a road segment with traffic parameters or geometric characteristics of the segment, usually neglecting the impact of vehicles' continuous movement and interactions with nearby vehicles. Advancements in communication technologies have empowered driving information collected from surrounding vehicles, enabling the study of group-based crash risks. Based on high-resolution vehicle trajectory data, this research focused on vehicle groups as the subject of analysis and explored risk formation and propagation mechanisms considering features of vehicle groups and road segments. Several key factors contributing to crash risks were identified, including past high-risk vehicle-group states, complex vehicle behaviors, high percentage of large vehicles, frequent lane changes within a vehicle group, and specific road geometries. A multinomial logisti
&lt;/p&gt;</description></item></channel></rss>