<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;Walsh&#31995;&#25968;&#36924;&#36817;&#20915;&#31574;&#36793;&#30028;&#30340;&#23545;&#25239;&#25915;&#20987;&#26816;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#35266;&#23519;&#28165;&#26224;&#22270;&#20687;&#21644;&#23545;&#25239;&#22270;&#20687;&#20043;&#38388;&#30340;Walsh&#31995;&#25968;&#36924;&#36817;&#24046;&#24322;&#65292;&#23454;&#29616;&#20102;&#23545;&#23545;&#25239;&#25915;&#20987;&#30340;&#26816;&#27979;&#12290;</title><link>http://arxiv.org/abs/2211.10227</link><description>&lt;p&gt;
&#20351;&#29992;&#38598;&#25104;&#36793;&#30028;&#36924;&#36817;&#30340;&#23545;&#25239;&#26816;&#27979;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Adversarial Detection by Approximation of Ensemble Boundary. (arXiv:2211.10227v4 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.10227
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;Walsh&#31995;&#25968;&#36924;&#36817;&#20915;&#31574;&#36793;&#30028;&#30340;&#23545;&#25239;&#25915;&#20987;&#26816;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#35266;&#23519;&#28165;&#26224;&#22270;&#20687;&#21644;&#23545;&#25239;&#22270;&#20687;&#20043;&#38388;&#30340;Walsh&#31995;&#25968;&#36924;&#36817;&#24046;&#24322;&#65292;&#23454;&#29616;&#20102;&#23545;&#23545;&#25239;&#25915;&#20987;&#30340;&#26816;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#23545;&#25239;&#25915;&#20987;&#26816;&#27979;&#26041;&#27861;&#65292;&#38024;&#23545;&#35299;&#20915;&#20004;&#31867;&#27169;&#24335;&#35782;&#21035;&#38382;&#39064;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#38598;&#25104;&#12290;&#35813;&#38598;&#25104;&#20351;&#29992;Walsh&#31995;&#25968;&#36827;&#34892;&#32452;&#21512;&#65292;&#33021;&#22815;&#36924;&#36817;&#24067;&#23572;&#20989;&#25968;&#24182;&#25511;&#21046;&#38598;&#25104;&#20915;&#31574;&#36793;&#30028;&#30340;&#22797;&#26434;&#24615;&#12290;&#26412;&#25991;&#30340;&#20551;&#35774;&#26159;&#39640;&#26354;&#29575;&#30340;&#20915;&#31574;&#36793;&#30028;&#20801;&#35768;&#25214;&#21040;&#23545;&#25239;&#25200;&#21160;&#65292;&#20294;&#20250;&#25913;&#21464;&#20915;&#31574;&#36793;&#30028;&#30340;&#26354;&#29575;&#65292;&#32780;&#19982;&#28165;&#26224;&#22270;&#20687;&#30456;&#27604;&#65292;&#20351;&#29992;Walsh&#31995;&#25968;&#23545;&#20854;&#36827;&#34892;&#36924;&#36817;&#30340;&#26041;&#24335;&#20063;&#26377;&#25152;&#19981;&#21516;&#12290;&#36890;&#36807;&#35266;&#23519;&#28165;&#26224;&#22270;&#20687;&#21644;&#23545;&#25239;&#22270;&#20687;&#20043;&#38388;&#30340;Walsh&#31995;&#25968;&#36924;&#36817;&#24046;&#24322;&#65292;&#23454;&#39564;&#35777;&#26126;&#20102;&#25915;&#20987;&#30340;&#21487;&#36801;&#31227;&#24615;&#21487;&#29992;&#20110;&#26816;&#27979;&#12290;&#27492;&#22806;&#65292;&#36924;&#36817;&#20915;&#31574;&#36793;&#30028;&#21487;&#33021;&#26377;&#21161;&#20110;&#29702;&#35299;DNN&#30340;&#23398;&#20064;&#21644;&#21487;&#36801;&#31227;&#24615;&#29305;&#24615;&#12290;&#23613;&#31649;&#26412;&#25991;&#30340;&#23454;&#39564;&#20351;&#29992;&#22270;&#20687;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#24314;&#27169;&#20004;&#31867;&#27169;&#24335;&#35782;&#21035;&#38382;&#39064;&#30340;&#38598;&#25104;&#36793;&#30028;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;
A new method of detecting adversarial attacks is proposed for an ensemble of Deep Neural Networks (DNNs) solving two-class pattern recognition problems. The ensemble is combined using Walsh coefficients which are capable of approximating Boolean functions and thereby controlling the complexity of the ensemble decision boundary. The hypothesis in this paper is that decision boundaries with high curvature allow adversarial perturbations to be found, but change the curvature of the decision boundary, which is then approximated in a different way by Walsh coefficients compared to the clean images. By observing the difference in Walsh coefficient approximation between clean and adversarial images, it is shown experimentally that transferability of attack may be used for detection. Furthermore, approximating the decision boundary may aid in understanding the learning and transferability properties of DNNs. While the experiments here use images, the proposed approach of modelling two-class en
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#26609;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#26694;&#26550;&#65292;&#20854;&#20013;&#21253;&#25324;&#32593;&#32476;&#39118;&#38505;&#35780;&#20272;&#21644;&#32593;&#32476;&#36164;&#26412;&#31649;&#29702;&#12290;&#36890;&#36807;&#22522;&#20110;&#21382;&#21490;&#32593;&#32476;&#20107;&#20214;&#25968;&#25454;&#38598;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;&#20840;&#38754;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#23545;&#20110;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#35828;&#26126;&#26368;&#20339;&#31574;&#30053;&#21462;&#20915;&#20110;&#19981;&#21516;&#22240;&#32032;&#12290;</title><link>http://arxiv.org/abs/2205.08435</link><description>&lt;p&gt;
&#36164;&#26412;&#31649;&#29702;&#30340;&#32593;&#32476;&#39118;&#38505;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Cyber Risk Assessment for Capital Management. (arXiv:2205.08435v3 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.08435
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#26609;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#26694;&#26550;&#65292;&#20854;&#20013;&#21253;&#25324;&#32593;&#32476;&#39118;&#38505;&#35780;&#20272;&#21644;&#32593;&#32476;&#36164;&#26412;&#31649;&#29702;&#12290;&#36890;&#36807;&#22522;&#20110;&#21382;&#21490;&#32593;&#32476;&#20107;&#20214;&#25968;&#25454;&#38598;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;&#20840;&#38754;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#23545;&#20110;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#35828;&#26126;&#26368;&#20339;&#31574;&#30053;&#21462;&#20915;&#20110;&#19981;&#21516;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#39118;&#38505;&#26159;&#19968;&#20010;&#22312;&#26085;&#30410;&#25968;&#23383;&#21270;&#30340;&#19990;&#30028;&#20013;&#26080;&#22788;&#19981;&#22312;&#30340;&#39118;&#38505;&#65292;&#20247;&#25152;&#21608;&#30693;&#65292;&#36825;&#31181;&#39118;&#38505;&#24456;&#38590;&#31649;&#29702;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#26609;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#26694;&#26550;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#31532;&#19968;&#26609;&#65292;&#32593;&#32476;&#39118;&#38505;&#35780;&#20272;&#65292;&#23558;&#20445;&#38505;&#20013;&#30340;&#39057;&#29575;-&#20005;&#37325;&#24615;&#27169;&#22411;&#19982;&#32593;&#32476;&#23433;&#20840;&#20013;&#30340;&#32423;&#32852;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20197;&#25429;&#25417;&#32593;&#32476;&#39118;&#38505;&#30340;&#29420;&#29305;&#29305;&#24449;&#12290;&#31532;&#20108;&#26609;&#65292;&#32593;&#32476;&#36164;&#26412;&#31649;&#29702;&#65292;&#25552;&#20379;&#20102;&#26377;&#20851;&#24179;&#34913;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#31574;&#30053;&#30340;&#20449;&#24687;&#20915;&#31574;&#65292;&#21253;&#25324;&#32593;&#32476;&#23433;&#20840;&#25237;&#36164;&#12289;&#20445;&#38505;&#35206;&#30422;&#21644;&#20648;&#22791;&#37329;&#12290;&#36825;&#20010;&#26694;&#26550;&#36890;&#36807;&#22522;&#20110;&#21382;&#21490;&#32593;&#32476;&#20107;&#20214;&#25968;&#25454;&#38598;&#30340;&#26696;&#20363;&#30740;&#31350;&#36827;&#34892;&#20102;&#28436;&#31034;&#65292;&#34920;&#26126;&#23545;&#20110;&#39044;&#31639;&#26377;&#38480;&#12289;&#30446;&#26631;&#22810;&#26679;&#21270;&#30340;&#20844;&#21496;&#26469;&#35828;&#65292;&#20840;&#38754;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#23545;&#20110;&#32593;&#32476;&#39118;&#38505;&#31649;&#29702;&#33267;&#20851;&#37325;&#35201;&#12290;&#25935;&#24863;&#24615;&#20998;&#26512;&#36824;&#35828;&#26126;&#20102;&#26368;&#20339;&#31574;&#30053;&#21462;&#20915;&#20110;&#35832;&#22810;&#22240;&#32032;&#65292;&#22914;&#32593;&#32476;&#23433;&#20840;&#25237;&#36164;&#30340;&#25968;&#37327;&#21644;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cyber risk is an omnipresent risk in the increasingly digitized world that is known to be difficult to manage. This paper proposes a two-pillar cyber risk management framework to address such difficulty. The first pillar, cyber risk assessment, blends the frequency-severity model in insurance with the cascade model in cybersecurity, to capture the unique feature of cyber risk. The second pillar, cyber capital management, provides informative decision-making on a balanced cyber risk management strategy, which includes cybersecurity investments, insurance coverage, and reserves. This framework is demonstrated by a case study based on a historical cyber incident dataset, which shows that a comprehensive cost-benefit analysis is necessary for a budget-constrained company with competing objectives for cyber risk management. Sensitivity analysis also illustrates that the best strategy depends on various factors, such as the amount of cybersecurity investments and the effectiveness of cyberse
&lt;/p&gt;</description></item></channel></rss>