<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>UAMM&#26159;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#24066;&#22330;&#20570;&#24066;&#21830;&#26041;&#27861;&#65292;&#36890;&#36807;&#32771;&#34385;&#22806;&#37096;&#24066;&#22330;&#20215;&#26684;&#21644;&#27969;&#21160;&#24615;&#27744;&#30340;&#26242;&#26102;&#25439;&#22833;&#26469;&#23450;&#20215;&#65292;&#24182;&#19988;&#26377;&#25928;&#28040;&#38500;&#20102;&#22871;&#21033;&#26426;&#20250;&#12290;</title><link>http://arxiv.org/abs/2308.06375</link><description>&lt;p&gt;
UAMM: UBET&#33258;&#21160;&#24066;&#22330;&#20570;&#24066;&#21830;
&lt;/p&gt;
&lt;p&gt;
UAMM: UBET Automated Market Maker. (arXiv:2308.06375v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06375
&lt;/p&gt;
&lt;p&gt;
UAMM&#26159;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#24066;&#22330;&#20570;&#24066;&#21830;&#26041;&#27861;&#65292;&#36890;&#36807;&#32771;&#34385;&#22806;&#37096;&#24066;&#22330;&#20215;&#26684;&#21644;&#27969;&#21160;&#24615;&#27744;&#30340;&#26242;&#26102;&#25439;&#22833;&#26469;&#23450;&#20215;&#65292;&#24182;&#19988;&#26377;&#25928;&#28040;&#38500;&#20102;&#22871;&#21033;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#24066;&#22330;&#20570;&#24066;&#21830;&#65288;AMM&#65289;&#26159;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#65288;DEX&#65289;&#20351;&#29992;&#30340;&#23450;&#20215;&#26426;&#21046;&#12290;&#20256;&#32479;&#30340;AMM&#26041;&#27861;&#20165;&#22522;&#20110;&#20854;&#33258;&#36523;&#30340;&#27969;&#21160;&#24615;&#27744;&#36827;&#34892;&#23450;&#20215;&#65292;&#32780;&#19981;&#32771;&#34385;&#22806;&#37096;&#24066;&#22330;&#25110;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#30340;&#39118;&#38505;&#31649;&#29702;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;UBET AMM&#65288;UAMM&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#32771;&#34385;&#22806;&#37096;&#24066;&#22330;&#20215;&#26684;&#21644;&#27969;&#21160;&#24615;&#27744;&#30340;&#26242;&#26102;&#25439;&#22833;&#26469;&#35745;&#31639;&#20215;&#26684;&#12290;&#23613;&#31649;&#20381;&#36182;&#20110;&#22806;&#37096;&#24066;&#22330;&#20215;&#26684;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#35745;&#31639;&#28369;&#28857;&#26102;&#20173;&#28982;&#20445;&#25345;&#20102;&#24658;&#23450;&#20135;&#21697;&#26354;&#32447;&#30340;&#26399;&#26395;&#23646;&#24615;&#12290;UAMM&#30340;&#20851;&#38190;&#35201;&#32032;&#26159;&#26681;&#25454;&#26399;&#26395;&#30340;&#30446;&#26631;&#20313;&#39069;&#30830;&#23450;&#21512;&#36866;&#30340;&#28369;&#28857;&#37329;&#39069;&#65292;&#20197;&#40723;&#21169;&#27969;&#21160;&#24615;&#27744;&#26368;&#23567;&#21270;&#26242;&#26102;&#25439;&#22833;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#22806;&#37096;&#24066;&#22330;&#20215;&#26684;&#26377;&#25928;&#26102;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#28040;&#38500;&#20102;&#22871;&#21033;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;
Automated market makers (AMMs) are pricing mechanisms utilized by decentralized exchanges (DEX). Traditional AMM approaches are constrained by pricing solely based on their own liquidity pool, without consideration of external markets or risk management for liquidity providers. In this paper, we propose a new approach known as UBET AMM (UAMM), which calculates prices by considering external market prices and the impermanent loss of the liquidity pool. Despite relying on external market prices, our method maintains the desired properties of a constant product curve when computing slippages. The key element of UAMM is determining the appropriate slippage amount based on the desired target balance, which encourages the liquidity pool to minimize impermanent loss. We demonstrate that our approach eliminates arbitrage opportunities when external market prices are efficient.
&lt;/p&gt;</description></item></channel></rss>