<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>DE-DeepONet&#36890;&#36807;&#25972;&#21512;&#23548;&#25968;&#20449;&#24687;&#25552;&#39640;&#20102;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#23588;&#20854;&#22312;&#35757;&#32451;&#25968;&#25454;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#30456;&#27604;&#20256;&#32479;DeepONet&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.19242</link><description>&lt;p&gt;
&#28145;&#24230;&#23548;&#25968;&#22686;&#24378;&#30340;&#25805;&#20316;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Derivative-enhanced Deep Operator Network
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19242
&lt;/p&gt;
&lt;p&gt;
DE-DeepONet&#36890;&#36807;&#25972;&#21512;&#23548;&#25968;&#20449;&#24687;&#25552;&#39640;&#20102;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#23588;&#20854;&#22312;&#35757;&#32451;&#25968;&#25454;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#30456;&#27604;&#20256;&#32479;DeepONet&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#25805;&#20316;&#32593;&#32476;&#65288;DeepONets&#65289;&#26159;&#19968;&#31867;&#23398;&#20064;&#20989;&#25968;&#31354;&#38388;&#20043;&#38388;&#26144;&#23556;&#30340;&#31070;&#32463;&#31639;&#23376;&#65292;&#26368;&#36817;&#34987;&#24320;&#21457;&#20026;&#21442;&#25968;&#21270;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDEs&#65289;&#30340;&#20195;&#29702;&#27169;&#22411;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23548;&#25968;&#22686;&#24378;&#30340;&#28145;&#24230;&#25805;&#20316;&#32593;&#32476;&#65288;DE-DeepONet&#65289;&#65292;&#23427;&#21033;&#29992;&#23548;&#25968;&#20449;&#24687;&#22686;&#24378;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#25552;&#20379;&#26356;&#20934;&#30830;&#30340;&#23548;&#25968;&#36817;&#20284;&#65292;&#29305;&#21035;&#26159;&#22312;&#35757;&#32451;&#25968;&#25454;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#12290;DE-DeepONet&#23558;&#36755;&#20837;&#30340;&#32500;&#24230;&#32553;&#20943;&#21040;DeepONet&#20013;&#65292;&#24182;&#22312;&#35757;&#32451;&#30340;&#25439;&#22833;&#20989;&#25968;&#20013;&#21253;&#21547;&#20004;&#31181;&#31867;&#22411;&#30340;&#23548;&#25968;&#26631;&#31614;&#65292;&#21363;&#20851;&#20110;&#36755;&#20837;&#20989;&#25968;&#30340;&#36755;&#20986;&#20989;&#25968;&#30340;&#26041;&#21521;&#23548;&#25968;&#21644;&#20851;&#20110;&#29289;&#29702;&#22495;&#21464;&#37327;&#30340;&#36755;&#20986;&#20989;&#25968;&#30340;&#26799;&#24230;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#19977;&#20010;&#19981;&#26029;&#22686;&#21152;&#22797;&#26434;&#24230;&#30340;&#26041;&#31243;&#19978;&#27979;&#35797;DE-DeepONet&#65292;&#20197;&#23637;&#31034;&#20854;&#30456;&#23545;&#20110;&#26222;&#36890;DeepONet&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19242v1 Announce Type: new  Abstract: Deep operator networks (DeepONets), a class of neural operators that learn mappings between function spaces, have recently been developed as surrogate models for parametric partial differential equations (PDEs). In this work we propose a derivative-enhanced deep operator network (DE-DeepONet), which leverages the derivative information to enhance the prediction accuracy, and provide a more accurate approximation of the derivatives, especially when the training data are limited. DE-DeepONet incorporates dimension reduction of input into DeepONet and includes two types of derivative labels in the loss function for training, that is, the directional derivatives of the output function with respect to the input function and the gradient of the output function with respect to the physical domain variables. We test DE-DeepONet on three different equations with increasing complexity to demonstrate its effectiveness compared to the vanilla DeepON
&lt;/p&gt;</description></item></channel></rss>