<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20132;&#26131;&#30340;&#26041;&#27861;&#26469;&#25552;&#39640;&#20197;&#22826;&#22346;&#19978;&#24222;&#27663;&#39575;&#23616;&#30340;&#26816;&#27979;&#40065;&#26834;&#24615;&#21644;&#20934;&#30830;&#24615;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20027;&#35201;&#22522;&#20110;&#26234;&#33021;&#21512;&#32422;&#28304;&#20195;&#30721;&#25110;&#25805;&#20316;&#30721;&#36827;&#34892;&#26816;&#27979;&#65292;&#20294;&#32570;&#20047;&#40065;&#26834;&#24615;&#12290;&#36890;&#36807;&#20998;&#26512;&#20132;&#26131;&#25968;&#25454;&#65292;&#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#35782;&#21035;&#24222;&#27663;&#39575;&#23616;&#65292;&#22240;&#20026;&#20132;&#26131;&#26356;&#38590;&#20266;&#35013;&#12290;</title><link>http://arxiv.org/abs/2308.16391</link><description>&lt;p&gt;
&#25552;&#39640;&#20197;&#22826;&#22346;&#19978;&#24222;&#27663;&#39575;&#23616;&#26816;&#27979;&#30340;&#40065;&#26834;&#24615;&#21644;&#20934;&#30830;&#24615;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Improving Robustness and Accuracy of Ponzi Scheme Detection on Ethereum Using Time-Dependent Features. (arXiv:2308.16391v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.16391
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20132;&#26131;&#30340;&#26041;&#27861;&#26469;&#25552;&#39640;&#20197;&#22826;&#22346;&#19978;&#24222;&#27663;&#39575;&#23616;&#30340;&#26816;&#27979;&#40065;&#26834;&#24615;&#21644;&#20934;&#30830;&#24615;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20027;&#35201;&#22522;&#20110;&#26234;&#33021;&#21512;&#32422;&#28304;&#20195;&#30721;&#25110;&#25805;&#20316;&#30721;&#36827;&#34892;&#26816;&#27979;&#65292;&#20294;&#32570;&#20047;&#40065;&#26834;&#24615;&#12290;&#36890;&#36807;&#20998;&#26512;&#20132;&#26131;&#25968;&#25454;&#65292;&#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#35782;&#21035;&#24222;&#27663;&#39575;&#23616;&#65292;&#22240;&#20026;&#20132;&#26131;&#26356;&#38590;&#20266;&#35013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#30340;&#24555;&#36895;&#21457;&#23637;&#23548;&#33268;&#36234;&#26469;&#36234;&#22810;&#30340;&#36164;&#37329;&#28044;&#20837;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#65292;&#20063;&#21560;&#24341;&#20102;&#36817;&#24180;&#26469;&#32593;&#32476;&#29359;&#32618;&#20998;&#23376;&#30340;&#20852;&#36259;&#12290;&#24222;&#27663;&#39575;&#23616;&#20316;&#20026;&#19968;&#31181;&#32769;&#24335;&#30340;&#27450;&#35784;&#34892;&#20026;&#65292;&#29616;&#22312;&#20063;&#27969;&#34892;&#20110;&#21306;&#22359;&#38142;&#19978;&#65292;&#32473;&#35768;&#22810;&#21152;&#23494;&#36135;&#24065;&#25237;&#36164;&#32773;&#36896;&#25104;&#20102;&#24040;&#22823;&#30340;&#36130;&#21153;&#25439;&#22833;&#12290;&#29616;&#26377;&#25991;&#29486;&#20013;&#24050;&#32463;&#25552;&#20986;&#20102;&#19968;&#20123;&#24222;&#27663;&#39575;&#23616;&#26816;&#27979;&#26041;&#27861;&#65292;&#20854;&#20013;&#22823;&#22810;&#25968;&#26159;&#22522;&#20110;&#26234;&#33021;&#21512;&#32422;&#30340;&#28304;&#20195;&#30721;&#25110;&#25805;&#20316;&#30721;&#36827;&#34892;&#26816;&#27979;&#30340;&#12290;&#34429;&#28982;&#22522;&#20110;&#21512;&#32422;&#20195;&#30721;&#30340;&#26041;&#27861;&#22312;&#20934;&#30830;&#24615;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#20294;&#23427;&#32570;&#20047;&#40065;&#26834;&#24615;&#65306;&#39318;&#20808;&#65292;&#22823;&#37096;&#20998;&#20197;&#22826;&#22346;&#19978;&#30340;&#21512;&#32422;&#28304;&#20195;&#30721;&#24182;&#19981;&#20844;&#24320;&#21487;&#29992;&#65307;&#20854;&#27425;&#65292;&#24222;&#27663;&#39575;&#23616;&#24320;&#21457;&#32773;&#21487;&#20197;&#36890;&#36807;&#28151;&#28102;&#25805;&#20316;&#30721;&#25110;&#32773;&#21019;&#36896;&#26032;&#30340;&#20998;&#37197;&#36923;&#36753;&#26469;&#27450;&#39575;&#22522;&#20110;&#21512;&#32422;&#20195;&#30721;&#30340;&#26816;&#27979;&#27169;&#22411;&#65288;&#22240;&#20026;&#36825;&#20123;&#27169;&#22411;&#20165;&#22312;&#29616;&#26377;&#30340;&#24222;&#27663;&#36923;&#36753;&#19978;&#36827;&#34892;&#35757;&#32451;&#65289;&#12290;&#22522;&#20110;&#20132;&#26131;&#30340;&#26041;&#27861;&#21487;&#20197;&#25552;&#39640;&#26816;&#27979;&#30340;&#40065;&#26834;&#24615;&#65292;&#22240;&#20026;&#19982;&#26234;&#33021;&#21512;&#32422;&#19981;&#21516;&#65292;&#20132;&#26131;&#26356;&#21152;&#38590;&#20197;&#20266;&#35013;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rapid development of blockchain has led to more and more funding pouring into the cryptocurrency market, which also attracted cybercriminals' interest in recent years. The Ponzi scheme, an old-fashioned fraud, is now popular on the blockchain, causing considerable financial losses to many crypto-investors. A few Ponzi detection methods have been proposed in the literature, most of which detect a Ponzi scheme based on its smart contract source code or opcode. The contract-code-based approach, while achieving very high accuracy, is not robust: first, the source codes of a majority of contracts on Ethereum are not available, and second, a Ponzi developer can fool a contract-code-based detection model by obfuscating the opcode or inventing a new profit distribution logic that cannot be detected (since these models were trained on existing Ponzi logics only). A transaction-based approach could improve the robustness of detection because transactions, unlike smart contracts, are harder t
&lt;/p&gt;</description></item></channel></rss>