<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#38382;&#31572;&#31995;&#32479;&#65292;&#36890;&#36807;&#22810;&#32423;&#24635;&#32467;&#27861;&#23545;&#27861;&#24459;&#25991;&#26412;&#36827;&#34892;&#22788;&#29702;&#65292;&#23454;&#29616;&#20102;F1&#20998;&#25968;&#30340;&#26174;&#33879;&#25552;&#21319;</title><link>https://arxiv.org/abs/2403.13107</link><description>&lt;p&gt;
&#38754;&#21521;&#27861;&#24459;&#25991;&#26412;&#30340;&#22810;&#32423;&#24635;&#32467;&#26080;&#30417;&#30563;&#38382;&#31572;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Towards Unsupervised Question Answering System with Multi-level Summarization for Legal Text
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13107
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#38382;&#31572;&#31995;&#32479;&#65292;&#36890;&#36807;&#22810;&#32423;&#24635;&#32467;&#27861;&#23545;&#27861;&#24459;&#25991;&#26412;&#36827;&#34892;&#22788;&#29702;&#65292;&#23454;&#29616;&#20102;F1&#20998;&#25968;&#30340;&#26174;&#33879;&#25552;&#21319;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#24635;&#32467;&#20102;&#22242;&#38431;SCaLAR&#22312;SemEval-2024&#20219;&#21153;5&#19978;&#30340;&#24037;&#20316;&#65306;&#27665;&#20107;&#31243;&#24207;&#20013;&#30340;&#27861;&#24459;&#35770;&#35777;&#25512;&#29702;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#20108;&#20803;&#20998;&#31867;&#20219;&#21153;&#65292;&#30001;&#20110;&#28041;&#21450;&#21040;&#30340;&#27861;&#24459;&#25991;&#26412;&#30340;&#22797;&#26434;&#24615;&#32780;&#20196;&#20154;&#26395;&#32780;&#21364;&#27493;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#32780;&#21448;&#26032;&#39062;&#30340;&#22522;&#20110;&#30456;&#20284;&#24230;&#21644;&#36317;&#31163;&#30340;&#26080;&#30417;&#30563;&#26041;&#27861;&#26469;&#29983;&#25104;&#26631;&#31614;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#20351;&#29992;&#38598;&#25104;&#29305;&#24449;&#65288;&#21253;&#25324;CNN&#12289;GRU&#21644;LSTM&#65289;&#30340;&#22810;&#32423;Legal-Bert&#23884;&#20837;&#30340;&#34701;&#21512;&#12290;&#20026;&#20102;&#35299;&#20915;&#25968;&#25454;&#38598;&#20013;&#27861;&#24459;&#35299;&#37322;&#30340;&#20887;&#38271;&#24615;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#22522;&#20110;T5&#30340;&#20998;&#27573;&#25688;&#35201;&#65292;&#25104;&#21151;&#22320;&#20445;&#30041;&#20102;&#20851;&#38190;&#20449;&#24687;&#65292;&#25552;&#21319;&#20102;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#26080;&#30417;&#30563;&#31995;&#32479;&#22312;&#24320;&#21457;&#38598;&#19978;&#35265;&#35777;&#20102;macro F1&#20998;&#25968;&#22686;&#21152;&#20102;20&#20010;&#30334;&#20998;&#28857;&#65292;&#22312;&#27979;&#35797;&#38598;&#19978;&#22686;&#21152;&#20102;10&#20010;&#30334;&#20998;&#28857;&#65292;&#32771;&#34385;&#21040;&#20854;&#31616;&#21333;&#30340;&#26550;&#26500;&#65292;&#36825;&#26159;&#20196;&#20154;&#40723;&#33310;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13107v1 Announce Type: new  Abstract: This paper summarizes Team SCaLAR's work on SemEval-2024 Task 5: Legal Argument Reasoning in Civil Procedure. To address this Binary Classification task, which was daunting due to the complexity of the Legal Texts involved, we propose a simple yet novel similarity and distance-based unsupervised approach to generate labels. Further, we explore the Multi-level fusion of Legal-Bert embeddings using ensemble features, including CNN, GRU, and LSTM. To address the lengthy nature of Legal explanation in the dataset, we introduce T5-based segment-wise summarization, which successfully retained crucial information, enhancing the model's performance. Our unsupervised system witnessed a 20-point increase in macro F1-score on the development set and a 10-point increase on the test set, which is promising given its uncomplicated architecture.
&lt;/p&gt;</description></item><item><title>Farsight&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#23454;&#22320;&#20132;&#20114;&#24037;&#20855;&#65292;&#24110;&#21161;&#20154;&#20204;&#22312;&#35774;&#35745;AI&#24212;&#29992;&#21407;&#22411;&#26102;&#35782;&#21035;&#28508;&#22312;&#21361;&#23475;&#65292;&#29992;&#25143;&#30740;&#31350;&#34920;&#26126;&#20351;&#29992;Farsight&#21518;&#65292;AI&#21407;&#22411;&#35774;&#35745;&#32773;&#33021;&#22815;&#26356;&#22909;&#22320;&#29420;&#31435;&#35782;&#21035;&#19982;&#25552;&#31034;&#30456;&#20851;&#30340;&#28508;&#22312;&#21361;&#23475;&#12290;</title><link>https://arxiv.org/abs/2402.15350</link><description>&lt;p&gt;
Farsight&#65306;&#22312;AI&#24212;&#29992;&#21407;&#22411;&#35774;&#35745;&#36807;&#31243;&#20013;&#22521;&#20859;&#36127;&#36131;&#20219;&#30340;AI&#24847;&#35782;
&lt;/p&gt;
&lt;p&gt;
Farsight: Fostering Responsible AI Awareness During AI Application Prototyping
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15350
&lt;/p&gt;
&lt;p&gt;
Farsight&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#23454;&#22320;&#20132;&#20114;&#24037;&#20855;&#65292;&#24110;&#21161;&#20154;&#20204;&#22312;&#35774;&#35745;AI&#24212;&#29992;&#21407;&#22411;&#26102;&#35782;&#21035;&#28508;&#22312;&#21361;&#23475;&#65292;&#29992;&#25143;&#30740;&#31350;&#34920;&#26126;&#20351;&#29992;Farsight&#21518;&#65292;AI&#21407;&#22411;&#35774;&#35745;&#32773;&#33021;&#22815;&#26356;&#22909;&#22320;&#29420;&#31435;&#35782;&#21035;&#19982;&#25552;&#31034;&#30456;&#20851;&#30340;&#28508;&#22312;&#21361;&#23475;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30340;&#25552;&#31034;&#39537;&#21160;&#30028;&#38754;&#20351;&#24471;&#21407;&#22411;&#35774;&#35745;&#21644;&#26500;&#24314;AI&#24212;&#29992;&#27604;&#20197;&#24448;&#20219;&#20309;&#26102;&#20505;&#37117;&#26356;&#23481;&#26131;&#12290;&#28982;&#32780;&#65292;&#35782;&#21035;&#21487;&#33021;&#22312;AI&#24212;&#29992;&#20013;&#20986;&#29616;&#30340;&#28508;&#22312;&#21361;&#23475;&#20173;&#28982;&#26159;&#19968;&#20010;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#22312;&#22522;&#20110;&#25552;&#31034;&#30340;&#21407;&#22411;&#35774;&#35745;&#36807;&#31243;&#20013;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#23454;&#22320;&#20132;&#20114;&#24037;&#20855;Farsight&#65292;&#24110;&#21161;&#20154;&#20204;&#35782;&#21035;&#20182;&#20204;&#27491;&#22312;&#35774;&#35745;&#21407;&#22411;&#30340;AI&#24212;&#29992;&#20013;&#21487;&#33021;&#20986;&#29616;&#30340;&#28508;&#22312;&#21361;&#23475;&#12290;&#26681;&#25454;&#29992;&#25143;&#30340;&#25552;&#31034;&#65292;Farsight&#31361;&#20986;&#26174;&#31034;&#20102;&#19982;&#30456;&#20851;AI&#20107;&#20214;&#26377;&#20851;&#30340;&#26032;&#38395;&#25991;&#31456;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#25506;&#32034;&#21644;&#32534;&#36753;LLM&#29983;&#25104;&#30340;&#29992;&#20363;&#12289;&#21033;&#30410;&#30456;&#20851;&#32773;&#21644;&#21361;&#23475;&#12290;&#25105;&#20204;&#25253;&#21578;&#20102;&#19982;10&#20301;AI&#21407;&#22411;&#35774;&#35745;&#32773;&#36827;&#34892;&#30340;&#20849;&#21516;&#35774;&#35745;&#30740;&#31350;&#30340;&#35774;&#35745;&#35265;&#35299;&#65292;&#20197;&#21450;&#19982;42&#20301;AI&#21407;&#22411;&#35774;&#35745;&#32773;&#36827;&#34892;&#30340;&#29992;&#25143;&#30740;&#31350;&#32467;&#26524;&#12290;&#22312;&#20351;&#29992;Farsight&#21518;&#65292;&#25105;&#20204;&#29992;&#25143;&#30740;&#31350;&#20013;&#30340;AI&#21407;&#22411;&#35774;&#35745;&#32773;&#33021;&#22815;&#26356;&#22909;&#22320;&#29420;&#31435;&#35782;&#21035;&#19982;&#25552;&#31034;&#30456;&#20851;&#30340;&#28508;&#22312;&#21361;&#23475;&#65292;&#24182;&#21457;&#29616;&#25105;&#20204;&#30340;&#24037;&#20855;&#27604;&#29616;&#26377;&#36164;&#28304;&#26356;&#26377;&#29992;&#19988;&#26356;&#26131;&#20110;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15350v1 Announce Type: cross  Abstract: Prompt-based interfaces for Large Language Models (LLMs) have made prototyping and building AI-powered applications easier than ever before. However, identifying potential harms that may arise from AI applications remains a challenge, particularly during prompt-based prototyping. To address this, we present Farsight, a novel in situ interactive tool that helps people identify potential harms from the AI applications they are prototyping. Based on a user's prompt, Farsight highlights news articles about relevant AI incidents and allows users to explore and edit LLM-generated use cases, stakeholders, and harms. We report design insights from a co-design study with 10 AI prototypers and findings from a user study with 42 AI prototypers. After using Farsight, AI prototypers in our user study are better able to independently identify potential harms associated with a prompt and find our tool more useful and usable than existing resources. T
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#65292;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#24895;&#26223;&#65292;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20026;&#31038;&#20250;&#29616;&#35937;&#25552;&#20379;&#27934;&#23519;&#12290;</title><link>https://arxiv.org/abs/2402.12327</link><description>&lt;p&gt;
&#25105;&#20204;&#24212;&#35813;&#20132;&#27969;&#21527;&#65306;&#25506;&#32034;&#31454;&#20105;LLM&#20195;&#29702;&#20043;&#38388;&#30340;&#33258;&#21457;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Shall We Talk: Exploring Spontaneous Collaborations of Competing LLM Agents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12327
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#65292;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#24895;&#26223;&#65292;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20026;&#31038;&#20250;&#29616;&#35937;&#25552;&#20379;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#36827;&#23637;&#34920;&#26126;&#65292;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#39537;&#21160;&#30340;&#20195;&#29702;&#20855;&#26377;&#27169;&#25311;&#20154;&#31867;&#34892;&#20026;&#21644;&#31038;&#20250;&#21160;&#24577;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#23578;&#26410;&#30740;&#31350;LLM&#20195;&#29702;&#22312;&#27809;&#26377;&#26126;&#30830;&#25351;&#20196;&#30340;&#24773;&#20917;&#19979;&#33258;&#21457;&#24314;&#31435;&#21512;&#20316;&#20851;&#31995;&#30340;&#28508;&#21147;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19977;&#39033;&#26696;&#20363;&#30740;&#31350;&#65292;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#12290;&#36825;&#19968;&#21457;&#29616;&#19981;&#20165;&#23637;&#31034;&#20102;LLM&#20195;&#29702;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20013;&#31454;&#20105;&#19982;&#21512;&#20316;&#30340;&#33021;&#21147;&#65292;&#20063;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#24895;&#26223;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#36825;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#24314;&#27169;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#37027;&#20123;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20174;&#32780;&#25552;&#20379;&#23545;&#31038;&#20250;&#29616;&#35937;&#30340;&#27934;&#23519;&#12290;&#36825;&#39033;&#30740;&#31350;&#30340;&#28304;&#20195;&#30721;&#21487;&#22312;https://github.com/wuzengqing001225/SABM_ShallWe &#25214;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12327v1 Announce Type: new  Abstract: Recent advancements have shown that agents powered by large language models (LLMs) possess capabilities to simulate human behaviors and societal dynamics. However, the potential for LLM agents to spontaneously establish collaborative relationships in the absence of explicit instructions has not been studied. To address this gap, we conduct three case studies, revealing that LLM agents are capable of spontaneously forming collaborations even within competitive settings. This finding not only demonstrates the capacity of LLM agents to mimic competition and cooperation in human societies but also validates a promising vision of computational social science. Specifically, it suggests that LLM agents could be utilized to model human social interactions, including those with spontaneous collaborations, thus offering insights into social phenomena. The source codes for this study are available at https://github.com/wuzengqing001225/SABM_ShallWe
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#30340;&#20998;&#31867;&#27861;&#65292;&#23545;&#24403;&#21069;&#21457;&#23637;&#29366;&#24577;&#19979;&#30340;&#20851;&#38190;&#38480;&#21046;&#36827;&#34892;&#20102;&#23457;&#26597;&#65292;&#24182;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;</title><link>https://arxiv.org/abs/2402.05355</link><description>&lt;p&gt;
&#23433;&#20840;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#35843;&#30740;
&lt;/p&gt;
&lt;p&gt;
A Survey on Safe Multi-Modal Learning System
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05355
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#30340;&#20998;&#31867;&#27861;&#65292;&#23545;&#24403;&#21069;&#21457;&#23637;&#29366;&#24577;&#19979;&#30340;&#20851;&#38190;&#38480;&#21046;&#36827;&#34892;&#20102;&#23457;&#26597;&#65292;&#24182;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#22312;&#29616;&#23454;&#22330;&#26223;&#20013;&#30340;&#24191;&#27867;&#24212;&#29992;&#65292;&#23433;&#20840;&#38382;&#39064;&#21464;&#24471;&#36234;&#26469;&#36234;&#31361;&#20986;&#12290;&#23545;&#20110;&#36825;&#19968;&#39046;&#22495;&#30340;&#23433;&#20840;&#38382;&#39064;&#32570;&#20047;&#31995;&#32479;&#24615;&#30740;&#31350;&#24050;&#25104;&#20026;&#19968;&#20010;&#37325;&#35201;&#30340;&#38556;&#30861;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#30340;&#20998;&#31867;&#27861;&#65292;&#30830;&#23450;&#20102;&#36825;&#20123;&#38382;&#39064;&#30340;&#22235;&#20010;&#20851;&#38190;&#25903;&#26609;&#12290;&#20511;&#21161;&#36825;&#19968;&#20998;&#31867;&#27861;&#65292;&#25105;&#20204;&#23545;&#27599;&#20010;&#25903;&#26609;&#36827;&#34892;&#20102;&#28145;&#20837;&#23457;&#26597;&#65292;&#31361;&#20986;&#20102;&#24403;&#21069;&#21457;&#23637;&#29366;&#24577;&#30340;&#20851;&#38190;&#38480;&#21046;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25351;&#20986;&#20102;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#38754;&#20020;&#30340;&#29420;&#29305;&#25361;&#25112;&#65292;&#24182;&#25552;&#20379;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the wide deployment of multimodal learning systems (MMLS) in real-world scenarios, safety concerns have become increasingly prominent. The absence of systematic research into their safety is a significant barrier to progress in this field. To bridge the gap, we present the first taxonomy for MMLS safety, identifying four essential pillars of these concerns. Leveraging this taxonomy, we conduct in-depth reviews for each pillar, highlighting key limitations based on the current state of development. Finally, we pinpoint unique challenges in MMLS safety and provide potential directions for future research.
&lt;/p&gt;</description></item></channel></rss>