<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#23398;&#20064;&#20855;&#26377;&#26377;&#30028;&#38376;&#22797;&#26434;&#24230;&#30340;&#37327;&#23376;&#24577;&#21644;&#37193;&#31639;&#31526;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#19982;&#30456;&#24212;&#30340;&#38376;&#22797;&#26434;&#24230;&#32447;&#24615;&#30456;&#20851;&#65292;&#24182;&#19988;&#22312;&#35745;&#31639;&#22797;&#26434;&#24230;&#19978;&#23384;&#22312;&#25351;&#25968;&#20851;&#31995;&#65292;&#36825;&#19968;&#32467;&#26524;&#38480;&#21046;&#20102;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#34920;&#36798;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2310.19882</link><description>&lt;p&gt;
&#23398;&#20064;&#26377;&#30028;&#38376;&#22797;&#26434;&#24230;&#30340;&#37327;&#23376;&#24577;&#21644;&#37193;&#31639;&#31526;
&lt;/p&gt;
&lt;p&gt;
Learning quantum states and unitaries of bounded gate complexity. (arXiv:2310.19882v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.19882
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#23398;&#20064;&#20855;&#26377;&#26377;&#30028;&#38376;&#22797;&#26434;&#24230;&#30340;&#37327;&#23376;&#24577;&#21644;&#37193;&#31639;&#31526;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#19982;&#30456;&#24212;&#30340;&#38376;&#22797;&#26434;&#24230;&#32447;&#24615;&#30456;&#20851;&#65292;&#24182;&#19988;&#22312;&#35745;&#31639;&#22797;&#26434;&#24230;&#19978;&#23384;&#22312;&#25351;&#25968;&#20851;&#31995;&#65292;&#36825;&#19968;&#32467;&#26524;&#38480;&#21046;&#20102;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#34920;&#36798;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#37327;&#23376;&#29366;&#24577;&#37325;&#26500;&#38750;&#24120;&#22256;&#38590;&#65292;&#20294;&#23545;&#20110;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#37325;&#26500;&#32773;&#26469;&#35828;&#65292;&#22823;&#22810;&#25968;&#29366;&#24577;&#30340;&#20852;&#36259;&#19981;&#22823;&#12290;&#37492;&#20110;&#33258;&#28982;&#30028;&#20013;&#20986;&#29616;&#30340;&#29366;&#24577;&#21644;&#37193;&#31639;&#31526;&#37117;&#20855;&#26377;&#26377;&#30028;&#30340;&#38376;&#22797;&#26434;&#24230;&#65292;&#33258;&#28982;&#32780;&#28982;&#22320;&#24819;&#38382;&#26159;&#21542;&#21487;&#20197;&#23454;&#29616;&#39640;&#25928;&#30340;&#23398;&#20064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20026;&#20102;&#23558;&#30001;$G$&#20010;&#20004;&#37327;&#23376;&#27604;&#29305;&#38376;&#29983;&#25104;&#30340;&#29366;&#24577;&#23398;&#20064;&#21040;&#23567;&#30340;&#36857;&#36317;&#31163;&#65292;&#38656;&#35201;&#21644;&#20805;&#20998;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#19982;$G$&#32447;&#24615;&#27604;&#20363;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#23398;&#20064;&#30001;$G$&#20010;&#38376;&#29983;&#25104;&#30340;&#37193;&#31639;&#31526;&#21040;&#23567;&#30340;&#24179;&#22343;&#35823;&#24046;&#30340;&#26368;&#20248;&#26597;&#35810;&#22797;&#26434;&#24230;&#19982;$G$&#32447;&#24615;&#27604;&#20363;&#12290;&#34429;&#28982;&#21487;&#20197;&#23454;&#29616;&#26679;&#26412;&#39640;&#25928;&#30340;&#23398;&#20064;&#65292;&#20294;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#21512;&#29702;&#30340;&#23494;&#30721;&#23398;&#29468;&#24819;&#19979;&#65292;&#23398;&#20064;&#38376;&#22797;&#26434;&#24230;&#20026;$G$&#30340;&#29366;&#24577;&#21644;&#37193;&#31639;&#31526;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#24517;&#39035;&#19982;$G$&#25351;&#25968;&#27604;&#20363;&#12290;&#25105;&#20204;&#38416;&#26126;&#20102;&#36825;&#20123;&#32467;&#26524;&#22914;&#20309;&#30830;&#23450;&#20102;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#34920;&#36798;&#33021;&#21147;&#30340;&#22522;&#26412;&#38480;&#21046;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#26080;&#20813;&#36153;&#21320;&#39184;&#23450;&#29702;&#30340;&#26032;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
While quantum state tomography is notoriously hard, most states hold little interest to practically-minded tomographers. Given that states and unitaries appearing in Nature are of bounded gate complexity, it is natural to ask if efficient learning becomes possible. In this work, we prove that to learn a state generated by a quantum circuit with $G$ two-qubit gates to a small trace distance, a sample complexity scaling linearly in $G$ is necessary and sufficient. We also prove that the optimal query complexity to learn a unitary generated by $G$ gates to a small average-case error scales linearly in $G$. While sample-efficient learning can be achieved, we show that under reasonable cryptographic conjectures, the computational complexity for learning states and unitaries of gate complexity $G$ must scale exponentially in $G$. We illustrate how these results establish fundamental limitations on the expressivity of quantum machine learning models and provide new perspectives on no-free-lun
&lt;/p&gt;</description></item></channel></rss>