<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27169;&#22411;&#24066;&#22330;&#30340;&#35843;&#33410;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;AI&#20013;&#20171;&#24179;&#21488;&#38754;&#20020;&#30340;&#24179;&#21488;&#27835;&#29702;&#25361;&#25112;&#65292;&#24182;&#24635;&#32467;&#20102;&#19994;&#30028;&#30340;&#30456;&#20851;&#23454;&#36341;&#65292;&#21253;&#25324;&#35768;&#21487;&#12289;&#35775;&#38382;&#21644;&#20351;&#29992;&#38480;&#21046;&#12289;&#33258;&#21160;&#20869;&#23481;&#35843;&#33410;&#20197;&#21450;&#20844;&#24320;&#25919;&#31574;&#21046;&#23450;&#12290;</title><link>https://arxiv.org/abs/2311.12573</link><description>&lt;p&gt;
&#27169;&#22411;&#24066;&#22330;&#30340;&#35843;&#33410;: AI&#20013;&#20171;&#24179;&#21488;&#30340;&#24179;&#21488;&#27835;&#29702;&#38590;&#39064;
&lt;/p&gt;
&lt;p&gt;
Moderating Model Marketplaces: Platform Governance Puzzles for AI Intermediaries
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.12573
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27169;&#22411;&#24066;&#22330;&#30340;&#35843;&#33410;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;AI&#20013;&#20171;&#24179;&#21488;&#38754;&#20020;&#30340;&#24179;&#21488;&#27835;&#29702;&#25361;&#25112;&#65292;&#24182;&#24635;&#32467;&#20102;&#19994;&#30028;&#30340;&#30456;&#20851;&#23454;&#36341;&#65292;&#21253;&#25324;&#35768;&#21487;&#12289;&#35775;&#38382;&#21644;&#20351;&#29992;&#38480;&#21046;&#12289;&#33258;&#21160;&#20869;&#23481;&#35843;&#33410;&#20197;&#21450;&#20844;&#24320;&#25919;&#31574;&#21046;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv: 2311.12573v2 &#20844;&#21578;&#31867;&#22411;: replace-cross &#25688;&#35201;: AI&#24320;&#21457;&#31038;&#21306;&#36234;&#26469;&#36234;&#22810;&#22320;&#21033;&#29992;&#25176;&#31649;&#20013;&#20171;&#24179;&#21488;&#65292;&#22914;Hugging Face&#65292;&#20026;&#29992;&#25143;&#19978;&#20256;&#30340;&#27169;&#22411;&#21644;&#35757;&#32451;&#25968;&#25454;&#25552;&#20379;&#20415;&#25463;&#35775;&#38382;&#12290;&#36825;&#20123;&#27169;&#22411;&#24066;&#22330;&#38477;&#20302;&#20102;&#25104;&#21315;&#19978;&#19975;&#29992;&#25143;&#30340;&#25216;&#26415;&#37096;&#32626;&#38376;&#27099;&#65292;&#20294;&#20063;&#21487;&#33021;&#34987;&#29992;&#20110;&#35768;&#22810;&#28508;&#22312;&#26377;&#23475;&#21644;&#38750;&#27861;&#30340;&#26041;&#24335;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;AI&#31995;&#32479;&#22914;&#20309;&#26082;&#33021;&#8220;&#21253;&#21547;&#8221;&#20869;&#23481;&#21448;&#33021;&#26159;&#24320;&#25918;&#24335;&#24037;&#20855;&#65292;&#20174;&#32780;&#25104;&#20026;&#36804;&#20170;&#20026;&#27490;&#26368;&#26840;&#25163;&#30340;&#24179;&#21488;&#27835;&#29702;&#25361;&#25112;&#20043;&#19968;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20960;&#20010;&#26696;&#20363;&#30740;&#31350;&#26469;&#20998;&#26512;&#27169;&#22411;&#24066;&#22330;&#22914;&#20309;&#31649;&#29702;&#27169;&#22411;&#65292;&#36825;&#20123;&#26696;&#20363;&#36328;&#36234;&#20102;&#19977;&#20010;&#20855;&#26377;&#20195;&#34920;&#24615;&#30340;&#24179;&#21488;&#65292;&#21363;Hugging Face&#12289;GitHub&#21644;Civitai&#12290;&#22522;&#20110;&#36825;&#20123;&#20998;&#26512;&#65292;&#25105;&#20204;&#24635;&#32467;&#20102;&#19994;&#30028;&#27491;&#22312;&#21046;&#23450;&#30340;&#37325;&#35201;&#65288;&#20294;&#20173;&#28982;&#26377;&#38480;&#65289;&#24212;&#23545;&#35843;&#33410;&#38656;&#27714;&#30340;&#20570;&#27861;&#65306;&#35768;&#21487;&#12289;&#35775;&#38382;&#21644;&#20351;&#29992;&#38480;&#21046;&#12289;&#33258;&#21160;&#20869;&#23481;&#35843;&#33410;&#20197;&#21450;&#20844;&#24320;&#25919;&#31574;&#21046;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.12573v2 Announce Type: replace-cross  Abstract: The AI development community is increasingly making use of hosting intermediaries such as Hugging Face provide easy access to user-uploaded models and training data. These model marketplaces lower technical deployment barriers for hundreds of thousands of users, yet can be used in numerous potentially harmful and illegal ways. In this article, we explain ways in which AI systems, which can both `contain' content and be open-ended tools, present one of the trickiest platform governance challenges seen to date. We provide case studies of several incidents across three illustrative platforms -- Hugging Face, GitHub and Civitai -- to examine how model marketplaces moderate models. Building on this analysis, we outline important (and yet nevertheless limited) practices that industry has been developing to respond to moderation demands: licensing, access and use restrictions, automated content moderation, and open policy development.
&lt;/p&gt;</description></item></channel></rss>