<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35770;&#25991;&#35752;&#35770;&#20102;&#31639;&#27861;&#36766;&#32844;&#20316;&#20026;&#31649;&#29702;&#32452;&#32455;&#20869;&#20351;&#29992;AI&#31995;&#32479;&#30340;&#25112;&#30053;&#26041;&#27861;&#65292;&#25552;&#20986;&#36890;&#36807;&#22312;AI&#31995;&#32479;&#20013;&#23884;&#20837;&#27835;&#29702;&#26426;&#21046;&#65292;&#26377;&#24847;&#35782;&#21644;&#26126;&#26234;&#22320;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#33073;&#31163;AI&#36741;&#21161;&#65292;&#20197;&#25351;&#23548;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#20351;&#29992;&#25110;&#36991;&#20813;&#36825;&#20123;&#31995;&#32479;&#65292;&#20174;&#32780;&#33719;&#24471;&#22810;&#26041;&#38754;&#30340;&#21033;&#30410;&#12290;</title><link>https://arxiv.org/abs/2402.18326</link><description>&lt;p&gt;
&#31639;&#27861;&#20309;&#26102;&#35813;&#36766;&#32844;&#65311;
&lt;/p&gt;
&lt;p&gt;
When Should Algorithms Resign?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18326
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#35752;&#35770;&#20102;&#31639;&#27861;&#36766;&#32844;&#20316;&#20026;&#31649;&#29702;&#32452;&#32455;&#20869;&#20351;&#29992;AI&#31995;&#32479;&#30340;&#25112;&#30053;&#26041;&#27861;&#65292;&#25552;&#20986;&#36890;&#36807;&#22312;AI&#31995;&#32479;&#20013;&#23884;&#20837;&#27835;&#29702;&#26426;&#21046;&#65292;&#26377;&#24847;&#35782;&#21644;&#26126;&#26234;&#22320;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#33073;&#31163;AI&#36741;&#21161;&#65292;&#20197;&#25351;&#23548;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#20351;&#29992;&#25110;&#36991;&#20813;&#36825;&#20123;&#31995;&#32479;&#65292;&#20174;&#32780;&#33719;&#24471;&#22810;&#26041;&#38754;&#30340;&#21033;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#35752;&#35770;&#20102;&#31639;&#27861;&#36766;&#32844;&#65292;&#36825;&#26159;&#19968;&#31181;&#31649;&#29702;&#32452;&#32455;&#20869;&#20351;&#29992;AI&#31995;&#32479;&#30340;&#25112;&#30053;&#26041;&#27861;&#12290;&#31639;&#27861;&#36766;&#32844;&#28041;&#21450;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26377;&#24847;&#35782;&#21644;&#26126;&#26234;&#22320;&#33073;&#31163;AI&#36741;&#21161;&#65292;&#36890;&#36807;&#30452;&#25509;&#23558;&#27835;&#29702;&#26426;&#21046;&#23884;&#20837;&#21040;AI&#31995;&#32479;&#20013;&#12290;&#25105;&#20204;&#30340;&#25552;&#35758;&#19981;&#20165;&#20165;&#26159;&#20851;&#20110;&#19981;&#20351;&#29992;AI&#65292;&#36824;&#21253;&#25324;&#25351;&#23548;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#20351;&#29992;&#25110;&#36991;&#20813;&#36825;&#20123;&#31995;&#32479;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#31639;&#27861;&#36766;&#32844;&#30340;&#22810;&#26041;&#38754;&#21033;&#30410;&#65292;&#28085;&#30422;&#32463;&#27982;&#25928;&#29575;&#12289;&#22768;&#35465;&#22686;&#30410;&#21644;&#27861;&#24459;&#21512;&#35268;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#36890;&#36807;&#31215;&#26497;&#21644;&#28040;&#26497;&#21161;&#25512;&#12289;&#21033;&#30410;&#30456;&#20851;&#32773;&#28608;&#21169;&#23545;&#40784;&#20197;&#21450;&#23457;&#24910;&#32771;&#34385;AI&#21442;&#19982;&#31243;&#24230;&#31561;&#21508;&#31181;&#26041;&#27861;&#26469;&#23454;&#29616;&#36766;&#32844;&#12290;&#36890;&#36807;&#35832;&#22914;&#26377;&#36873;&#25321;&#22320;&#38459;&#27490;&#35775;&#38382;AI&#36755;&#20986;&#25110;&#23545;&#31995;&#32479;&#24615;&#33021;&#26126;&#30830;&#22768;&#26126;&#20813;&#36131;&#31561;&#25216;&#26415;&#25163;&#27573;&#65292;&#31639;&#27861;&#36766;&#32844;&#19981;&#20165;&#33021;&#38477;&#20302;&#19982;&#20043;&#30456;&#20851;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18326v1 Announce Type: cross  Abstract: This paper discusses algorithmic resignation, a strategic approach for managing the use of AI systems within organizations. Algorithmic resignation involves the deliberate and informed disengagement from AI assistance in certain scenarios, by embedding governance mechanisms directly into AI systems. Our proposal is not merely about disuse of AI but includes guiding when and how these systems should be used or avoided. We discuss the multifaceted benefits of algorithmic resignation, spanning economic efficiency, reputational gains, and legal compliance. Further, we outline the operationalization of resignation through various methods such as positive and negative nudges, stakeholder incentive alignment, and careful consideration of the level of AI engagement. Using techniques like barring access to AI outputs selectively or providing explicit disclaimers on system performance, algorithmic resignation not only mitigates risks associated 
&lt;/p&gt;</description></item></channel></rss>