<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25104;&#21151;&#23545;&#25239;&#26679;&#26412;&#27010;&#29575;&#19978;&#38480;&#30340;&#29702;&#35770;&#30028;&#38480;&#65292;&#21462;&#20915;&#20110;&#25200;&#21160;&#33539;&#25968;&#12289;&#26680;&#20989;&#25968;&#20197;&#21450;&#35757;&#32451;&#25968;&#25454;&#38598;&#20013;&#26368;&#25509;&#36817;&#30340;&#19981;&#21516;&#26631;&#31614;&#23545;&#20043;&#38388;&#30340;&#36317;&#31163;&#65292;&#24182;&#19988;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#29702;&#35770;&#32467;&#26524;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.01896</link><description>&lt;p&gt;
&#25104;&#21151;&#23545;&#25239;&#26679;&#26412;&#30340;&#24378;&#40065;&#26834;&#24615;&#30028;&#38480;&#65306;&#29702;&#35770;&#19982;&#23454;&#36341;
&lt;/p&gt;
&lt;p&gt;
Robustness Bounds on the Successful Adversarial Examples: Theory and Practice
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01896
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25104;&#21151;&#23545;&#25239;&#26679;&#26412;&#27010;&#29575;&#19978;&#38480;&#30340;&#29702;&#35770;&#30028;&#38480;&#65292;&#21462;&#20915;&#20110;&#25200;&#21160;&#33539;&#25968;&#12289;&#26680;&#20989;&#25968;&#20197;&#21450;&#35757;&#32451;&#25968;&#25454;&#38598;&#20013;&#26368;&#25509;&#36817;&#30340;&#19981;&#21516;&#26631;&#31614;&#23545;&#20043;&#38388;&#30340;&#36317;&#31163;&#65292;&#24182;&#19988;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#29702;&#35770;&#32467;&#26524;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#25239;&#26679;&#26412;&#65288;AE&#65289;&#26159;&#19968;&#31181;&#38024;&#23545;&#26426;&#22120;&#23398;&#20064;&#30340;&#25915;&#20987;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#25968;&#25454;&#28155;&#21152;&#19981;&#21487;&#24863;&#30693;&#30340;&#25200;&#21160;&#26469;&#35825;&#20351;&#38169;&#20998;&#12290;&#26412;&#25991;&#22522;&#20110;&#39640;&#26031;&#36807;&#31243;&#65288;GP&#65289;&#20998;&#31867;&#65292;&#30740;&#31350;&#20102;&#25104;&#21151;AE&#30340;&#27010;&#29575;&#19978;&#38480;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#26032;&#30340;&#19978;&#30028;&#65292;&#21462;&#20915;&#20110;AE&#30340;&#25200;&#21160;&#33539;&#25968;&#12289;GP&#20013;&#20351;&#29992;&#30340;&#26680;&#20989;&#25968;&#20197;&#21450;&#35757;&#32451;&#25968;&#25454;&#38598;&#20013;&#20855;&#26377;&#19981;&#21516;&#26631;&#31614;&#30340;&#26368;&#25509;&#36817;&#23545;&#20043;&#38388;&#30340;&#36317;&#31163;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#35813;&#19978;&#38480;&#19981;&#21463;&#26679;&#26412;&#25968;&#25454;&#38598;&#20998;&#24067;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;ImageNet&#30340;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25913;&#21464;&#26680;&#20989;&#25968;&#21442;&#25968;&#20250;&#23548;&#33268;&#25104;&#21151;AE&#27010;&#29575;&#19978;&#38480;&#30340;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01896v1 Announce Type: new  Abstract: Adversarial example (AE) is an attack method for machine learning, which is crafted by adding imperceptible perturbation to the data inducing misclassification. In the current paper, we investigated the upper bound of the probability of successful AEs based on the Gaussian Process (GP) classification. We proved a new upper bound that depends on AE's perturbation norm, the kernel function used in GP, and the distance of the closest pair with different labels in the training dataset. Surprisingly, the upper bound is determined regardless of the distribution of the sample dataset. We showed that our theoretical result was confirmed through the experiment using ImageNet. In addition, we showed that changing the parameters of the kernel function induces a change of the upper bound of the probability of successful AEs.
&lt;/p&gt;</description></item></channel></rss>