<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#38754;&#21521;&#20114;&#32852;&#32593;&#21307;&#30103;&#29289;&#32852;&#32593;&#31995;&#32479;&#30340;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#23433;&#20840;&#19982;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;&#65292;&#26088;&#22312;&#35299;&#20915;IoMT&#31995;&#32479;&#38754;&#20020;&#30340;&#23433;&#20840;&#25361;&#25112;&#65292;&#21253;&#25324;&#25968;&#25454;&#25935;&#24863;&#24615;&#12289;&#24694;&#24847;&#25915;&#20987;&#21644;&#24322;&#24120;&#26816;&#27979;&#12290;</title><link>https://arxiv.org/abs/2403.09752</link><description>&lt;p&gt;
&#38754;&#21521;IoMT&#31995;&#32479;&#30340;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#23433;&#20840;&#19982;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Explainable Machine Learning-Based Security and Privacy Protection Framework for Internet of Medical Things Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09752
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#38754;&#21521;&#20114;&#32852;&#32593;&#21307;&#30103;&#29289;&#32852;&#32593;&#31995;&#32479;&#30340;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#23433;&#20840;&#19982;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;&#65292;&#26088;&#22312;&#35299;&#20915;IoMT&#31995;&#32479;&#38754;&#20020;&#30340;&#23433;&#20840;&#25361;&#25112;&#65292;&#21253;&#25324;&#25968;&#25454;&#25935;&#24863;&#24615;&#12289;&#24694;&#24847;&#25915;&#20987;&#21644;&#24322;&#24120;&#26816;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20114;&#32852;&#32593;&#21307;&#30103;&#29289;&#32852;&#32593;&#65288;IoMT&#65289;&#36328;&#36234;&#20102;&#20256;&#32479;&#21307;&#30103;&#36793;&#30028;&#65292;&#23454;&#29616;&#20102;&#20174;&#34987;&#21160;&#27835;&#30103;&#21521;&#20027;&#21160;&#39044;&#38450;&#30340;&#36807;&#28193;&#12290;&#36825;&#31181;&#21019;&#26032;&#26041;&#27861;&#36890;&#36807;&#23454;&#26102;&#20581;&#24247;&#25968;&#25454;&#25910;&#38598;&#23454;&#29616;&#26089;&#26399;&#30142;&#30149;&#26816;&#27979;&#21644;&#20010;&#24615;&#21270;&#25252;&#29702;&#65292;&#29305;&#21035;&#22312;&#24930;&#24615;&#30149;&#31649;&#29702;&#26041;&#38754;&#65292;IoMT&#21487;&#20197;&#33258;&#21160;&#21270;&#27835;&#30103;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22788;&#29702;&#25968;&#25454;&#30340;&#25935;&#24863;&#24615;&#21644;&#20215;&#20540;&#65292;IoMT&#38754;&#20020;&#30528;&#20005;&#37325;&#30340;&#23433;&#20840;&#25361;&#25112;&#65292;&#36825;&#20250;&#23041;&#32961;&#21040;&#20854;&#29992;&#25143;&#30340;&#29983;&#21629;&#65292;&#22240;&#27492;&#21560;&#24341;&#20102;&#24694;&#24847;&#21033;&#30410;&#12290;&#27492;&#22806;&#65292;&#21033;&#29992;&#26080;&#32447;&#36890;&#20449;&#36827;&#34892;&#25968;&#25454;&#20256;&#36755;&#20250;&#20351;&#21307;&#30103;&#25968;&#25454;&#26292;&#38706;&#20110;&#34987;&#32593;&#32476;&#29359;&#32618;&#20998;&#23376;&#25130;&#33719;&#21644;&#31713;&#25913;&#30340;&#39118;&#38505;&#20043;&#19979;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#20154;&#20026;&#38169;&#35823;&#12289;&#32593;&#32476;&#24178;&#25200;&#25110;&#30828;&#20214;&#25925;&#38556;&#65292;&#21487;&#33021;&#20250;&#20986;&#29616;&#24322;&#24120;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30340;&#24322;&#24120;&#26816;&#27979;&#26159;&#19968;&#20010;&#26377;&#36259;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#23427;&#20877;&#27425;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09752v1 Announce Type: cross  Abstract: The Internet of Medical Things (IoMT) transcends traditional medical boundaries, enabling a transition from reactive treatment to proactive prevention. This innovative method revolutionizes healthcare by facilitating early disease detection and tailored care, particularly in chronic disease management, where IoMT automates treatments based on real-time health data collection. Nonetheless, its benefits are countered by significant security challenges that endanger the lives of its users due to the sensitivity and value of the processed data, thereby attracting malicious interests. Moreover, the utilization of wireless communication for data transmission exposes medical data to interception and tampering by cybercriminals. Additionally, anomalies may arise due to human errors, network interference, or hardware malfunctions. In this context, anomaly detection based on Machine Learning (ML) is an interesting solution, but it comes up again
&lt;/p&gt;</description></item></channel></rss>