<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#25209;&#21028;&#24615;&#35780;&#20272;&#30740;&#31350;&#20102;23&#20010;&#26368;&#20808;&#36827;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22522;&#20934;&#30340;&#19981;&#36275;&#20043;&#22788;&#65292;&#21253;&#25324;&#20559;&#35265;&#12289;&#30495;&#23454;&#25512;&#29702;&#34913;&#37327;&#22256;&#38590;&#12289;&#23454;&#29616;&#19981;&#19968;&#33268;&#24615;&#31561;&#38382;&#39064;&#65292;&#24378;&#35843;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#26102;&#20195;&#38656;&#35201;&#26631;&#20934;&#21270;&#26041;&#27861;&#12289;&#30417;&#31649;&#30830;&#23450;&#24615;&#21644;&#20262;&#29702;&#25351;&#21335;&#12290;</title><link>https://arxiv.org/abs/2402.09880</link><description>&lt;p&gt;
&#22312;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#26102;&#20195;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22522;&#20934;&#30340;&#19981;&#36275;&#20043;&#22788;
&lt;/p&gt;
&lt;p&gt;
Inadequacies of Large Language Model Benchmarks in the Era of Generative Artificial Intelligence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09880
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#25209;&#21028;&#24615;&#35780;&#20272;&#30740;&#31350;&#20102;23&#20010;&#26368;&#20808;&#36827;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22522;&#20934;&#30340;&#19981;&#36275;&#20043;&#22788;&#65292;&#21253;&#25324;&#20559;&#35265;&#12289;&#30495;&#23454;&#25512;&#29702;&#34913;&#37327;&#22256;&#38590;&#12289;&#23454;&#29616;&#19981;&#19968;&#33268;&#24615;&#31561;&#38382;&#39064;&#65292;&#24378;&#35843;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#26102;&#20195;&#38656;&#35201;&#26631;&#20934;&#21270;&#26041;&#27861;&#12289;&#30417;&#31649;&#30830;&#23450;&#24615;&#21644;&#20262;&#29702;&#25351;&#21335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#38543;&#30528;&#20854;&#26032;&#20852;&#33021;&#21147;&#30340;&#24555;&#36895;&#23835;&#36215;&#65292;&#24341;&#21457;&#20102;&#20844;&#20247;&#30340;&#22909;&#22855;&#24515;&#65292;&#20197;&#35780;&#20272;&#21644;&#27604;&#36739;&#19981;&#21516;&#30340;LLMs&#65292;&#35768;&#22810;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#20102;&#20182;&#20204;&#30340;LLM&#22522;&#20934;&#12290;&#25105;&#20204;&#27880;&#24847;&#21040;&#36825;&#20123;&#22522;&#20934;&#30340;&#21021;&#27493;&#19981;&#36275;&#65292;&#24320;&#22987;&#20102;&#19968;&#39033;&#30740;&#31350;&#65292;&#36890;&#36807;&#20154;&#20204;&#12289;&#36807;&#31243;&#21644;&#25216;&#26415;&#30340;&#35270;&#35282;&#65292;&#20197;&#21151;&#33021;&#21644;&#23433;&#20840;&#20004;&#22823;&#25903;&#26609;&#20026;&#22522;&#30784;&#65292;&#20351;&#29992;&#25105;&#20204;&#30340;&#26032;&#39062;&#32479;&#19968;&#35780;&#20272;&#26694;&#26550;&#23545;23&#20010;&#26368;&#20808;&#36827;&#30340;LLM&#22522;&#20934;&#36827;&#34892;&#20102;&#25209;&#21028;&#24615;&#35780;&#20272;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#19968;&#20123;&#37325;&#22823;&#38480;&#21046;&#65292;&#21253;&#25324;&#20559;&#35265;&#12289;&#27979;&#37327;&#30495;&#23454;&#25512;&#29702;&#30340;&#22256;&#38590;&#12289;&#36866;&#24212;&#24615;&#12289;&#23454;&#29616;&#19981;&#19968;&#33268;&#24615;&#12289;&#25552;&#31034;&#24037;&#31243;&#22797;&#26434;&#24615;&#12289;&#35780;&#20272;&#32773;&#22810;&#26679;&#24615;&#20197;&#21450;&#22312;&#19968;&#27425;&#32508;&#21512;&#35780;&#20272;&#20013;&#24573;&#35270;&#20102;&#25991;&#21270;&#21644;&#24847;&#35782;&#24418;&#24577;&#35268;&#33539;&#12290;&#25105;&#20204;&#30340;&#35752;&#35770;&#24378;&#35843;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#26102;&#20195;&#65292;&#36843;&#20999;&#38656;&#35201;&#26631;&#20934;&#21270;&#26041;&#27861;&#12289;&#30417;&#31649;&#30830;&#23450;&#24615;&#21644;&#20262;&#29702;&#25351;&#21335;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09880v1 Announce Type: new  Abstract: The rapid rise in popularity of Large Language Models (LLMs) with emerging capabilities has spurred public curiosity to evaluate and compare different LLMs, leading many researchers to propose their LLM benchmarks. Noticing preliminary inadequacies in those benchmarks, we embarked on a study to critically assess 23 state-of-the-art LLM benchmarks, using our novel unified evaluation framework through the lenses of people, process, and technology, under the pillars of functionality and security. Our research uncovered significant limitations, including biases, difficulties in measuring genuine reasoning, adaptability, implementation inconsistencies, prompt engineering complexity, evaluator diversity, and the overlooking of cultural and ideological norms in one comprehensive assessment. Our discussions emphasized the urgent need for standardized methodologies, regulatory certainties, and ethical guidelines in light of Artificial Intelligenc
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#35745;&#31639;&#26041;&#27861;&#23545;&#29992;&#25143;&#30340;&#28508;&#22312;&#26131;&#24863;&#24615;&#27700;&#24179;&#36827;&#34892;&#24314;&#27169;&#65292;&#21487;&#20197;&#24110;&#21161;&#29702;&#35299;&#26131;&#21463;&#38169;&#35823;&#20449;&#24687;&#24433;&#21709;&#30340;&#31243;&#24230;&#65292;&#20026;&#21518;&#32493;&#30740;&#31350;&#21644;&#24212;&#29992;&#25552;&#20379;&#37325;&#35201;&#21442;&#32771;&#12290;</title><link>https://arxiv.org/abs/2311.09630</link><description>&lt;p&gt;
&#35299;&#30721;&#26131;&#24863;&#24615;&#65306;&#36890;&#36807;&#35745;&#31639;&#26041;&#27861;&#23545;&#38169;&#35823;&#20449;&#24687;&#36827;&#34892;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Decoding Susceptibility: Modeling Misbelief to Misinformation Through a Computational Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.09630
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35745;&#31639;&#26041;&#27861;&#23545;&#29992;&#25143;&#30340;&#28508;&#22312;&#26131;&#24863;&#24615;&#27700;&#24179;&#36827;&#34892;&#24314;&#27169;&#65292;&#21487;&#20197;&#24110;&#21161;&#29702;&#35299;&#26131;&#21463;&#38169;&#35823;&#20449;&#24687;&#24433;&#21709;&#30340;&#31243;&#24230;&#65292;&#20026;&#21518;&#32493;&#30740;&#31350;&#21644;&#24212;&#29992;&#25552;&#20379;&#37325;&#35201;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26131;&#21463;&#38169;&#35823;&#20449;&#24687;&#24433;&#21709;&#30340;&#31243;&#24230;&#25551;&#36848;&#20102;&#23545;&#19981;&#21487;&#39564;&#35777;&#20027;&#24352;&#30340;&#20449;&#20208;&#31243;&#24230;&#65292;&#36825;&#26159;&#20010;&#20307;&#24605;&#32500;&#36807;&#31243;&#20013;&#30340;&#28508;&#22312;&#22240;&#32032;&#65292;&#19981;&#21487;&#35266;&#23519;&#12290;&#29616;&#26377;&#26131;&#24863;&#24615;&#30740;&#31350;&#20005;&#37325;&#20381;&#36182;&#20110;&#33258;&#25105;&#25253;&#21578;&#30340;&#20449;&#24565;&#65292;&#36825;&#21487;&#33021;&#23384;&#22312;&#20559;&#35265;&#65292;&#25910;&#38598;&#25104;&#26412;&#39640;&#65292;&#24182;&#19988;&#38590;&#20197;&#22312;&#21518;&#32493;&#24212;&#29992;&#20013;&#25193;&#23637;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#26041;&#27861;&#26469;&#24314;&#27169;&#29992;&#25143;&#30340;&#28508;&#22312;&#26131;&#24863;&#24615;&#27700;&#24179;&#12290;&#27491;&#22914;&#20808;&#21069;&#30340;&#30740;&#31350;&#25152;&#31034;&#65292;&#26131;&#24863;&#24615;&#21463;&#21040;&#21508;&#31181;&#22240;&#32032;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#20154;&#21475;&#32479;&#35745;&#22240;&#32032;&#12289;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#65289;&#65292;&#24182;&#30452;&#25509;&#24433;&#21709;&#20154;&#20204;&#22312;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#36716;&#21457;&#34892;&#20026;&#12290;&#20026;&#20102;&#34920;&#31034;&#22522;&#30784;&#24515;&#29702;&#36807;&#31243;&#65292;&#25105;&#20204;&#30340;&#26131;&#24863;&#24615;&#24314;&#27169;&#23558;&#36825;&#20123;&#22240;&#32032;&#20316;&#20026;&#36755;&#20837;&#65292;&#21463;&#21040;&#20154;&#20204;&#20998;&#20139;&#34892;&#20026;&#30417;&#30563;&#30340;&#24341;&#23548;&#12290;&#20351;&#29992;COVID-19&#20316;&#20026;&#23454;&#39564;&#39046;&#22495;&#65292;&#25105;&#20204;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;&#26131;&#24863;&#24615;&#35780;&#20998;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.09630v2 Announce Type: replace  Abstract: Susceptibility to misinformation describes the degree of belief in unverifiable claims, a latent aspect of individuals' mental processes that is not observable. Existing susceptibility studies heavily rely on self-reported beliefs, which can be subject to bias, expensive to collect, and challenging to scale for downstream applications. To address these limitations, in this work, we propose a computational approach to model users' latent susceptibility levels. As shown in previous research, susceptibility is influenced by various factors (e.g., demographic factors, political ideology), and directly influences people's reposting behavior on social media. To represent the underlying mental process, our susceptibility modeling incorporates these factors as inputs, guided by the supervision of people's sharing behavior. Using COVID-19 as a testbed domain, our experiments demonstrate a significant alignment between the susceptibility score
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#38754;&#37096;&#35782;&#21035;&#25216;&#26415;&#65292;&#36890;&#36807;&#29305;&#23450;&#30340;&#38754;&#37096;&#29305;&#24449;&#21457;&#29616;&#20102;&#20154;&#20204;&#30340;&#25919;&#27835;&#21462;&#21521;&#65292;&#29978;&#33267;&#21487;&#20197;&#20174;&#33258;&#28982;&#22270;&#20687;&#20013;&#25512;&#24191;&#12290;&#36825;&#31181;&#39044;&#27979;&#30340;&#31934;&#24230;&#27604;&#20154;&#31867;&#35780;&#20998;&#32773;&#39640;&#65292;&#30456;&#24403;&#20110;&#19968;&#20123;&#24037;&#20316;&#38754;&#35797;&#30340;&#39044;&#27979;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2303.16343</link><description>&lt;p&gt;
&#38754;&#37096;&#35782;&#21035;&#25216;&#26415;&#21487;&#20197;&#20174;&#38754;&#37096;&#22270;&#20687;&#20013;&#26174;&#31034;&#25919;&#27835;&#21462;&#21521;&#65292;&#21363;&#20351;&#25511;&#21046;&#31038;&#20250;&#20154;&#21475;&#32479;&#35745;&#21644;&#33258;&#25105;&#34920;&#29616;&#12290;(arXiv: 2303.16343v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
Facial recognition technology can expose political orientation from facial images even when controlling for demographics and self-presentation. (arXiv:2303.16343v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#38754;&#37096;&#35782;&#21035;&#25216;&#26415;&#65292;&#36890;&#36807;&#29305;&#23450;&#30340;&#38754;&#37096;&#29305;&#24449;&#21457;&#29616;&#20102;&#20154;&#20204;&#30340;&#25919;&#27835;&#21462;&#21521;&#65292;&#29978;&#33267;&#21487;&#20197;&#20174;&#33258;&#28982;&#22270;&#20687;&#20013;&#25512;&#24191;&#12290;&#36825;&#31181;&#39044;&#27979;&#30340;&#31934;&#24230;&#27604;&#20154;&#31867;&#35780;&#20998;&#32773;&#39640;&#65292;&#30456;&#24403;&#20110;&#19968;&#20123;&#24037;&#20316;&#38754;&#35797;&#30340;&#39044;&#27979;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#36816;&#29992;&#38754;&#37096;&#35782;&#21035;&#31639;&#27861;&#65292;&#20174;&#23454;&#39564;&#23460;&#35774;&#32622;&#19979;&#25293;&#25668;&#30340;591&#24352;&#20013;&#24615;&#38754;&#37096;&#22270;&#20687;&#20013;&#25552;&#21462;&#38754;&#37096;&#25551;&#36848;&#31526;&#12290;&#22312;&#25511;&#21046;&#24180;&#40836;&#12289;&#24615;&#21035;&#21644;&#31181;&#26063;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#20132;&#21449;&#39564;&#35777;&#30340;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#26469;&#39044;&#27979;&#21442;&#19982;&#32773;&#22312;&#25919;&#27835;&#21462;&#21521;&#37327;&#34920;&#19978;&#30340;&#24471;&#20998;(Cronbach&#30340;&#945;=0.94)&#12290;&#27169;&#22411;&#30340;&#24615;&#33021;&#36229;&#36807;&#20102;r = 0.20&#65292;&#36828;&#20248;&#20110;&#20154;&#31867;&#35780;&#20998;&#32773;&#65292;&#19982;&#24037;&#20316;&#38754;&#35797;&#39044;&#27979;&#24037;&#20316;&#25104;&#21151;&#12289;&#37202;&#31934;&#39537;&#21160;&#25915;&#20987;&#24615;&#25110;&#24515;&#29702;&#27835;&#30103;&#25913;&#21892;&#24515;&#29702;&#20581;&#24247;&#30340;&#25928;&#26524;&#30456;&#24403;&#12290;&#27492;&#22806;&#65292;&#20174;&#26631;&#20934;&#21270;&#22270;&#20687;&#34893;&#29983;&#20986;&#30340;&#27169;&#22411;&#22312;3,401&#21517;&#26469;&#33258;&#32654;&#22269;&#12289;&#33521;&#22269;&#21644;&#21152;&#25343;&#22823;&#30340;&#25919;&#27835;&#20154;&#29289;&#30340;&#33258;&#28982;&#22270;&#20687;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;(r = 0.12)&#65292;&#34920;&#26126;&#38754;&#37096;&#22806;&#35980;&#21644;&#25919;&#27835;&#21462;&#21521;&#20043;&#38388;&#30340;&#20851;&#32852;&#21487;&#25512;&#24191;&#21040;&#25105;&#20204;&#20043;&#22806;&#30340;&#20154;&#32676;&#12290;&#38754;&#37096;&#29305;&#24449;&#19982;&#25919;&#27835;&#21462;&#21521;&#30456;&#20851;&#30340;&#20998;&#26512;&#21457;&#29616;&#65292;&#20445;&#23432;&#27966;&#30340;&#19979;&#21322;&#33080;&#37096;&#20998;&#26356;&#22823;&#65292;&#34429;&#28982;&#25919;&#27835;&#21462;&#21521;&#19981;&#33021;&#20934;&#30830;&#22320;&#39044;&#27979;&#20010;&#20307;&#38754;&#37096;&#29305;&#24449;&#30340;&#25152;&#26377;&#21464;&#21270;&#65292;&#20294;&#26159;&#36825;&#31181;&#21457;&#29616;&#36824;&#26159;&#23500;&#26377;&#21551;&#21457;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
A facial recognition algorithm was used to extract face descriptors from carefully standardized images of 591 neutral faces taken in the laboratory setting. Face descriptors were entered into a cross-validated linear regression to predict participants' scores on a political orientation scale (Cronbach's alpha=.94) while controlling for age, gender, and ethnicity. The model's performance exceeded r=.20: much better than that of human raters and on par with how well job interviews predict job success, alcohol drives aggressiveness, or psychological therapy improves mental health. Moreover, the model derived from standardized images performed well (r=.12) in a sample of naturalistic images of 3,401 politicians from the U.S., UK, and Canada, suggesting that the associations between facial appearance and political orientation generalize beyond our sample. The analysis of facial features associated with political orientation revealed that conservatives had larger lower faces, although politi
&lt;/p&gt;</description></item></channel></rss>