<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#22312;&#20351;&#29992;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#30340;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#20013;&#21457;&#29616;&#20102;&#31867;&#20284;&#22823;&#33041;&#22238;&#25918;&#30340;&#29616;&#35937;&#65292;&#24182;&#35777;&#26126;&#20854;&#23545;&#20219;&#21153;&#30340;&#36129;&#29486;&#12290;&#36825;&#19968;&#21457;&#29616;&#25552;&#20379;&#20102;&#29702;&#35299;&#22238;&#25918;&#26426;&#21046;&#30340;&#26032;&#35270;&#35282;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01467</link><description>&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#26234;&#33021;&#20307;&#20869;&#20986;&#29616;&#31867;&#20284;&#22823;&#33041;&#22238;&#25918;&#30340;&#29616;&#35937;
&lt;/p&gt;
&lt;p&gt;
Brain-Like Replay Naturally Emerges in Reinforcement Learning Agents
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01467
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#22312;&#20351;&#29992;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#30340;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#20013;&#21457;&#29616;&#20102;&#31867;&#20284;&#22823;&#33041;&#22238;&#25918;&#30340;&#29616;&#35937;&#65292;&#24182;&#35777;&#26126;&#20854;&#23545;&#20219;&#21153;&#30340;&#36129;&#29486;&#12290;&#36825;&#19968;&#21457;&#29616;&#25552;&#20379;&#20102;&#29702;&#35299;&#22238;&#25918;&#26426;&#21046;&#30340;&#26032;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#33041;&#21306;&#22495;&#20013;&#26222;&#36941;&#35266;&#23519;&#21040;&#30340;&#22238;&#25918;&#29616;&#35937;&#26159;&#21542;&#33021;&#22815;&#22312;&#20154;&#24037;&#26234;&#33021;&#26234;&#33021;&#20307;&#20013;&#33258;&#28982;&#20135;&#29983;&#65311;&#22914;&#26524;&#26159;&#30340;&#35805;&#65292;&#23427;&#26159;&#21542;&#23545;&#20219;&#21153;&#26377;&#25152;&#36129;&#29486;&#65311;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#30340;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#65292;&#22312;&#20219;&#21153;&#20248;&#21270;&#30340;&#33539;&#24335;&#19979;&#21457;&#29616;&#20102;&#22238;&#25918;&#30340;&#33258;&#28982;&#20986;&#29616;&#65292;&#27169;&#22411;&#27169;&#25311;&#20102;&#28023;&#39532;&#20307;&#21644;&#21069;&#39069;&#21494;&#30382;&#23618;&#20197;&#21450;&#23427;&#20204;&#20043;&#38388;&#30340;&#30456;&#20114;&#27807;&#36890;&#21644;&#24863;&#35273;&#30382;&#23618;&#30340;&#36755;&#20837;&#12290;&#28023;&#39532;&#20307;&#20013;&#30340;&#22238;&#25918;&#26159;&#30001;&#20110;&#24773;&#26223;&#35760;&#24518;&#12289;&#35748;&#30693;&#22320;&#22270;&#20197;&#21450;&#29615;&#22659;&#35266;&#23519;&#32780;&#20135;&#29983;&#30340;&#65292;&#19982;&#21160;&#29289;&#23454;&#39564;&#25968;&#25454;&#30456;&#20284;&#65292;&#24182;&#19988;&#26159;&#39640;&#20219;&#21153;&#24615;&#33021;&#30340;&#26377;&#25928;&#25351;&#26631;&#12290;&#35813;&#27169;&#22411;&#36824;&#25104;&#21151;&#22320;&#37325;&#29616;&#20102;&#23616;&#37096;&#21644;&#38750;&#23616;&#37096;&#30340;&#22238;&#25918;&#65292;&#19982;&#20154;&#31867;&#23454;&#39564;&#25968;&#25454;&#30456;&#31526;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#20026;&#29702;&#35299;&#22238;&#25918;&#26426;&#21046;&#25552;&#20379;&#20102;&#26032;&#30340;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can replay, as a widely observed neural activity pattern in brain regions, particularly in the hippocampus and neocortex, emerge in an artificial agent? If yes, does it contribute to the tasks? In this work, without heavy dependence on complex assumptions, we discover naturally emergent replay under task-optimized paradigm using a recurrent neural network-based reinforcement learning model, which mimics the hippocampus and prefrontal cortex, as well as their intercommunication and the sensory cortex input. The emergent replay in the hippocampus, which results from the episodic memory and cognitive map as well as environment observations, well resembles animal experimental data and serves as an effective indicator of high task performance. The model also successfully reproduces local and nonlocal replay, which matches the human experimental data. Our work provides a new avenue for understanding the mechanisms behind replay.
&lt;/p&gt;</description></item></channel></rss>