<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#30740;&#31350;&#26159;&#20851;&#20110;&#22312;&#23391;&#21152;&#25289;&#22269;&#32972;&#26223;&#19979;&#23545;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;&#36827;&#34892;&#24320;&#21019;&#24615;&#25506;&#32034;&#65292;&#25581;&#31034;&#20102;&#30007;&#24615;&#21463;&#23475;&#32773;&#30340;&#23384;&#22312;&#12289;&#27169;&#24335;&#21644;&#28508;&#22312;&#22240;&#32032;&#65292;&#22635;&#34917;&#20102;&#29616;&#26377;&#25991;&#29486;&#23545;&#30007;&#24615;&#21463;&#23475;&#32773;&#30740;&#31350;&#31354;&#30333;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.15594</link><description>&lt;p&gt;
&#36890;&#36807;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#21644;&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#27934;&#35265;&#20998;&#26512;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;
&lt;/p&gt;
&lt;p&gt;
Analyzing Male Domestic Violence through Exploratory Data Analysis and Explainable Machine Learning Insights
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15594
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26159;&#20851;&#20110;&#22312;&#23391;&#21152;&#25289;&#22269;&#32972;&#26223;&#19979;&#23545;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;&#36827;&#34892;&#24320;&#21019;&#24615;&#25506;&#32034;&#65292;&#25581;&#31034;&#20102;&#30007;&#24615;&#21463;&#23475;&#32773;&#30340;&#23384;&#22312;&#12289;&#27169;&#24335;&#21644;&#28508;&#22312;&#22240;&#32032;&#65292;&#22635;&#34917;&#20102;&#29616;&#26377;&#25991;&#29486;&#23545;&#30007;&#24615;&#21463;&#23475;&#32773;&#30740;&#31350;&#31354;&#30333;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23478;&#24237;&#26292;&#21147;&#36890;&#24120;&#34987;&#35270;&#20026;&#19968;&#20010;&#20851;&#20110;&#22899;&#24615;&#21463;&#23475;&#32773;&#30340;&#24615;&#21035;&#38382;&#39064;&#65292;&#22312;&#36817;&#24180;&#26469;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#12290;&#23613;&#31649;&#26377;&#36825;&#31181;&#20851;&#27880;&#65292;&#23391;&#21152;&#25289;&#22269;&#29305;&#21035;&#26159;&#30007;&#24615;&#21463;&#23475;&#32773;&#20173;&#28982;&#20027;&#35201;&#34987;&#24573;&#35270;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#20195;&#34920;&#20102;&#22312;&#23391;&#21152;&#25289;&#22269;&#32972;&#26223;&#19979;&#23545;&#30007;&#24615;&#23478;&#24237;&#26292;&#21147;&#65288;MDV&#65289;&#36825;&#19968;&#26410;&#34987;&#20805;&#20998;&#25506;&#35752;&#39046;&#22495;&#30340;&#24320;&#21019;&#24615;&#25506;&#32034;&#65292;&#25581;&#31034;&#20102;&#20854;&#26222;&#36941;&#24615;&#12289;&#27169;&#24335;&#21644;&#28508;&#22312;&#22240;&#32032;&#12290;&#29616;&#26377;&#25991;&#29486;&#20027;&#35201;&#24378;&#35843;&#23478;&#24237;&#26292;&#21147;&#24773;&#22659;&#20013;&#22899;&#24615;&#30340;&#21463;&#23475;&#65292;&#23548;&#33268;&#23545;&#30007;&#24615;&#21463;&#23475;&#32773;&#30340;&#30740;&#31350;&#31354;&#30333;&#12290;&#25105;&#20204;&#20174;&#23391;&#21152;&#25289;&#22269;&#20027;&#35201;&#22478;&#24066;&#25910;&#38598;&#20102;&#25968;&#25454;&#65292;&#24182;&#36827;&#34892;&#20102;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#20197;&#20102;&#35299;&#28508;&#22312;&#21160;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;11&#31181;&#20256;&#32479;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65288;&#21253;&#25324;&#40664;&#35748;&#21644;&#20248;&#21270;&#30340;&#36229;&#21442;&#25968;&#65289;&#12289;2&#31181;&#28145;&#24230;&#23398;&#20064;&#21644;4&#31181;&#38598;&#25104;&#27169;&#22411;&#12290;&#23613;&#31649;&#37319;&#29992;&#20102;&#21508;&#31181;&#26041;&#27861;&#65292;CatBoost&#30001;&#20110;&#20854;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15594v1 Announce Type: cross  Abstract: Domestic violence, which is often perceived as a gendered issue among female victims, has gained increasing attention in recent years. Despite this focus, male victims of domestic abuse remain primarily overlooked, particularly in Bangladesh. Our study represents a pioneering exploration of the underexplored realm of male domestic violence (MDV) within the Bangladeshi context, shedding light on its prevalence, patterns, and underlying factors. Existing literature predominantly emphasizes female victimization in domestic violence scenarios, leading to an absence of research on male victims. We collected data from the major cities of Bangladesh and conducted exploratory data analysis to understand the underlying dynamics. We implemented 11 traditional machine learning models with default and optimized hyperparameters, 2 deep learning, and 4 ensemble models. Despite various approaches, CatBoost has emerged as the top performer due to its 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#27169;&#22411;&#26550;&#26500;&#21644;&#35757;&#32451;&#29615;&#22659;&#23545;&#35757;&#32451;&#26356;&#29615;&#20445;&#30340;&#35745;&#31639;&#26426;&#35270;&#35273;&#27169;&#22411;&#30340;&#24433;&#21709;&#65292;&#24182;&#25214;&#20986;&#20102;&#33021;&#28304;&#25928;&#29575;&#21644;&#27169;&#22411;&#27491;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2307.05520</link><description>&lt;p&gt;
DL&#27169;&#22411;&#21644;&#35757;&#32451;&#29615;&#22659;&#23545;&#33021;&#28304;&#28040;&#32791;&#26377;&#24433;&#21709;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Do DL models and training environments have an impact on energy consumption?. (arXiv:2307.05520v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05520
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#27169;&#22411;&#26550;&#26500;&#21644;&#35757;&#32451;&#29615;&#22659;&#23545;&#35757;&#32451;&#26356;&#29615;&#20445;&#30340;&#35745;&#31639;&#26426;&#35270;&#35273;&#27169;&#22411;&#30340;&#24433;&#21709;&#65292;&#24182;&#25214;&#20986;&#20102;&#33021;&#28304;&#25928;&#29575;&#21644;&#27169;&#22411;&#27491;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#35745;&#31639;&#26426;&#35270;&#35273;&#39046;&#22495;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#25552;&#39640;&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#30340;&#27491;&#30830;&#24615;&#21644;&#25512;&#29702;&#26102;&#38388;&#24615;&#33021;&#19978;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#24456;&#23569;&#26377;&#20851;&#20110;&#35757;&#32451;DL&#27169;&#22411;&#24102;&#26469;&#24040;&#22823;&#30899;&#36275;&#36857;&#30340;&#30740;&#31350;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#20998;&#26512;&#27169;&#22411;&#26550;&#26500;&#21644;&#35757;&#32451;&#29615;&#22659;&#23545;&#35757;&#32451;&#26356;&#29615;&#20445;&#30340;&#35745;&#31639;&#26426;&#35270;&#35273;&#27169;&#22411;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#30446;&#26631;&#20998;&#20026;&#20004;&#20010;&#30740;&#31350;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20998;&#26512;&#27169;&#22411;&#26550;&#26500;&#23545;&#23454;&#29616;&#26356;&#29615;&#20445;&#27169;&#22411;&#21516;&#26102;&#20445;&#25345;&#27491;&#30830;&#24615;&#22312;&#26368;&#20339;&#27700;&#24179;&#30340;&#24433;&#21709;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#30740;&#31350;&#35757;&#32451;&#29615;&#22659;&#23545;&#29983;&#25104;&#26356;&#29615;&#20445;&#27169;&#22411;&#30340;&#24433;&#21709;&#12290;&#20026;&#20102;&#35843;&#26597;&#36825;&#20123;&#20851;&#31995;&#65292;&#25105;&#20204;&#22312;&#27169;&#22411;&#35757;&#32451;&#36807;&#31243;&#20013;&#25910;&#38598;&#20102;&#19982;&#33021;&#28304;&#25928;&#29575;&#21644;&#27169;&#22411;&#27491;&#30830;&#24615;&#30456;&#20851;&#30340;&#22810;&#20010;&#25351;&#26631;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#27169;&#22411;&#26550;&#26500;&#22312;&#27979;&#37327;&#33021;&#28304;&#25928;&#29575;&#21644;&#27169;&#22411;&#27491;&#30830;&#24615;&#26041;&#38754;&#30340;&#26435;&#34913;&#65292;&#20197;&#21450;&#23427;&#20204;&#19982;&#35757;&#32451;&#29615;&#22659;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#23454;&#39564;&#24179;&#21488;&#19978;&#36827;&#34892;&#20102;&#36825;&#39033;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Current research in the computer vision field mainly focuses on improving Deep Learning (DL) correctness and inference time performance. However, there is still little work on the huge carbon footprint that has training DL models. This study aims to analyze the impact of the model architecture and training environment when training greener computer vision models. We divide this goal into two research questions. First, we analyze the effects of model architecture on achieving greener models while keeping correctness at optimal levels. Second, we study the influence of the training environment on producing greener models. To investigate these relationships, we collect multiple metrics related to energy efficiency and model correctness during the models' training. Then, we outline the trade-offs between the measured energy efficiency and the models' correctness regarding model architecture, and their relationship with the training environment. We conduct this research in the context of a 
&lt;/p&gt;</description></item></channel></rss>