<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;BA-SGCL&#30340;&#40065;&#26834;SGNN&#26694;&#26550;&#65292;&#36890;&#36807;&#32467;&#21512;&#22270;&#23545;&#27604;&#23398;&#20064;&#21407;&#21017;&#21644;&#24179;&#34913;&#22686;&#24378;&#25216;&#26415;&#65292;&#35299;&#20915;&#20102;&#24102;&#31526;&#21495;&#22270;&#23545;&#25239;&#24615;&#25915;&#20987;&#20013;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#19981;&#21487;&#36870;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.10590</link><description>&lt;p&gt;
Adversarially Robust Signed Graph Contrastive Learning from Balance Augmentation&#65288;&#20174;&#24179;&#34913;&#22686;&#24378;&#20013;&#25552;&#21462;&#23545;&#25239;&#24615;&#40065;&#26834;&#30340;&#24102;&#31526;&#21495;&#22270;&#23545;&#27604;&#23398;&#20064;&#65289;
&lt;/p&gt;
&lt;p&gt;
Adversarially Robust Signed Graph Contrastive Learning from Balance Augmentation. (arXiv:2401.10590v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10590
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;BA-SGCL&#30340;&#40065;&#26834;SGNN&#26694;&#26550;&#65292;&#36890;&#36807;&#32467;&#21512;&#22270;&#23545;&#27604;&#23398;&#20064;&#21407;&#21017;&#21644;&#24179;&#34913;&#22686;&#24378;&#25216;&#26415;&#65292;&#35299;&#20915;&#20102;&#24102;&#31526;&#21495;&#22270;&#23545;&#25239;&#24615;&#25915;&#20987;&#20013;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#19981;&#21487;&#36870;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24102;&#31526;&#21495;&#22270;&#30001;&#36793;&#21644;&#31526;&#21495;&#32452;&#25104;&#65292;&#21487;&#20197;&#20998;&#20026;&#32467;&#26500;&#20449;&#24687;&#21644;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#12290;&#29616;&#26377;&#30340;&#24102;&#31526;&#21495;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;SGNN&#65289;&#36890;&#24120;&#20381;&#36182;&#20110;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#26469;&#29983;&#25104;&#23884;&#20837;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#23545;&#25239;&#24615;&#25915;&#20987;&#23545;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#20135;&#29983;&#20102;&#19981;&#21033;&#24433;&#21709;&#12290;&#31867;&#20284;&#20110;&#32467;&#26500;&#23398;&#20064;&#21487;&#20197;&#24674;&#22797;&#26080;&#31526;&#21495;&#22270;&#65292;&#36890;&#36807;&#25913;&#36827;&#34987;&#27745;&#26579;&#22270;&#30340;&#24179;&#34913;&#24230;&#65292;&#21487;&#20197;&#23558;&#24179;&#34913;&#23398;&#20064;&#24212;&#29992;&#20110;&#24102;&#31526;&#21495;&#22270;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#26041;&#27861;&#38754;&#20020;&#30528;&#8220;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#30340;&#19981;&#21487;&#36870;&#24615;&#8221;&#25361;&#25112;-&#23613;&#31649;&#24179;&#34913;&#24230;&#24471;&#21040;&#25913;&#21892;&#65292;&#20294;&#24674;&#22797;&#30340;&#36793;&#21487;&#33021;&#19981;&#26159;&#26368;&#21021;&#21463;&#21040;&#25915;&#20987;&#24433;&#21709;&#30340;&#36793;&#65292;&#23548;&#33268;&#38450;&#24481;&#25928;&#26524;&#24046;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#40065;&#26834;&#30340;SGNN&#26694;&#26550;&#65292;&#31216;&#20026;&#24179;&#34913;&#22686;&#24378;&#24102;&#31526;&#21495;&#22270;&#23545;&#27604;&#23398;&#20064;&#65288;BA-SGCL&#65289;&#65292;&#23427;&#23558;&#22270;&#23545;&#27604;&#23398;&#20064;&#21407;&#21017;&#19982;&#24179;&#34913;&#22686;&#24378;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Signed graphs consist of edges and signs, which can be separated into structural information and balance-related information, respectively. Existing signed graph neural networks (SGNNs) typically rely on balance-related information to generate embeddings. Nevertheless, the emergence of recent adversarial attacks has had a detrimental impact on the balance-related information. Similar to how structure learning can restore unsigned graphs, balance learning can be applied to signed graphs by improving the balance degree of the poisoned graph. However, this approach encounters the challenge "Irreversibility of Balance-related Information" - while the balance degree improves, the restored edges may not be the ones originally affected by attacks, resulting in poor defense effectiveness. To address this challenge, we propose a robust SGNN framework called Balance Augmented-Signed Graph Contrastive Learning (BA-SGCL), which combines Graph Contrastive Learning principles with balance augmentati
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#19981;&#35775;&#38382;&#30446;&#26631;DNN&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#39044;&#27979;3D&#28857;&#20113;&#20013;&#30340;&#23545;&#25239;&#28857;&#65292;&#25552;&#20379;&#20102;&#26080;&#30418;&#23376;&#25915;&#20987;&#30340;&#26032;&#35270;&#35282;&#12290;</title><link>http://arxiv.org/abs/2210.14164</link><description>&lt;p&gt;
3D&#28857;&#20113;&#20998;&#31867;&#30340;&#26080;&#30418;&#23376;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
No-Box Attacks on 3D Point Cloud Classification. (arXiv:2210.14164v3 [cs.CV] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.14164
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#19981;&#35775;&#38382;&#30446;&#26631;DNN&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#39044;&#27979;3D&#28857;&#20113;&#20013;&#30340;&#23545;&#25239;&#28857;&#65292;&#25552;&#20379;&#20102;&#26080;&#30418;&#23376;&#25915;&#20987;&#30340;&#26032;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#30340;&#21508;&#31181;&#36755;&#20837;&#20449;&#21495;&#30340;&#20998;&#26512;&#65292;&#23545;&#25239;&#25915;&#20987;&#26500;&#25104;&#20102;&#20005;&#37325;&#25361;&#25112;&#12290;&#22312;3D&#28857;&#20113;&#30340;&#24773;&#20917;&#19979;&#65292;&#24050;&#32463;&#24320;&#21457;&#20986;&#20102;&#19968;&#20123;&#26041;&#27861;&#26469;&#35782;&#21035;&#22312;&#32593;&#32476;&#20915;&#31574;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#28857;&#65292;&#32780;&#36825;&#20123;&#26041;&#27861;&#22312;&#29983;&#25104;&#29616;&#26377;&#30340;&#23545;&#25239;&#25915;&#20987;&#20013;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#20363;&#22914;&#65292;&#26174;&#33879;&#24615;&#22270;&#26041;&#27861;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#23545;&#25239;&#25915;&#20987;&#20250;&#26174;&#33879;&#24433;&#21709;&#32593;&#32476;&#20915;&#31574;&#30340;&#28857;&#12290;&#36890;&#24120;&#65292;&#35782;&#21035;&#23545;&#25239;&#28857;&#30340;&#26041;&#27861;&#20381;&#36182;&#20110;&#23545;&#30446;&#26631;DNN&#27169;&#22411;&#30340;&#35775;&#38382;&#65292;&#20197;&#30830;&#23450;&#21738;&#20123;&#28857;&#23545;&#27169;&#22411;&#30340;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#26088;&#22312;&#23545;&#36825;&#20010;&#38382;&#39064;&#25552;&#20379;&#19968;&#31181;&#26032;&#30340;&#35270;&#35282;&#65292;&#22312;&#19981;&#35775;&#38382;&#30446;&#26631;DNN&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#39044;&#27979;&#23545;&#25239;&#28857;&#65292;&#36825;&#34987;&#31216;&#20026;&#8220;&#26080;&#30418;&#23376;&#8221;&#25915;&#20987;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;14&#20010;&#28857;&#20113;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;&#22810;&#20803;&#32447;&#24615;&#22238;&#24402;&#26469;&#26816;&#26597;&#36825;&#20123;&#29305;&#24449;&#26159;&#21542;&#21487;&#20197;&#29992;&#20110;&#39044;&#27979;&#23545;&#25239;&#28857;&#65292;&#20197;&#21450;&#21738;&#20123;&#29305;&#24449;&#23545;&#39044;&#27979;&#26368;&#20026;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adversarial attacks pose serious challenges for deep neural network (DNN)-based analysis of various input signals. In the case of 3D point clouds, methods have been developed to identify points that play a key role in network decision, and these become crucial in generating existing adversarial attacks. For example, a saliency map approach is a popular method for identifying adversarial drop points, whose removal would significantly impact the network decision. Generally, methods for identifying adversarial points rely on the access to the DNN model itself to determine which points are critically important for the model's decision. This paper aims to provide a novel viewpoint on this problem, where adversarial points can be predicted without access to the target DNN model, which is referred to as a ``no-box'' attack. To this end, we define 14 point cloud features and use multiple linear regression to examine whether these features can be used for adversarial point prediction, and which
&lt;/p&gt;</description></item></channel></rss>