<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>SVGCraft&#24341;&#20837;&#20102;&#19968;&#31181;&#31471;&#21040;&#31471;&#26694;&#26550;&#65292;&#21487;&#20197;&#20174;&#25991;&#26412;&#25551;&#36848;&#20013;&#29983;&#25104;&#25551;&#32472;&#25972;&#20010;&#22330;&#26223;&#30340;&#30690;&#37327;&#22270;&#65292;&#20854;&#20013;&#21253;&#25324;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;LLM&#36827;&#34892;&#24067;&#23616;&#29983;&#25104;&#12289;&#20135;&#29983;&#36974;&#32617;&#28508;&#21464;&#37327;&#20197;&#36827;&#34892;&#20934;&#30830;&#23545;&#35937;&#25918;&#32622;&#12289;&#34701;&#21512;&#27880;&#24847;&#21147;&#22270;&#20197;&#21450;&#20351;&#29992;&#25193;&#25955;U-Net&#36827;&#34892;&#21512;&#25104;&#65292;&#21516;&#26102;&#36890;&#36807;&#39044;&#35757;&#32451;&#30340;&#32534;&#30721;&#22120;&#21644;LPIPS&#25439;&#22833;&#36827;&#34892;&#20248;&#21270;&#12290;</title><link>https://arxiv.org/abs/2404.00412</link><description>&lt;p&gt;
SVGCraft:&#36229;&#36234;&#21333;&#20010;&#30446;&#26631;&#25991;&#23383;&#21040;SVG&#32508;&#21512;&#30011;&#24067;&#24067;&#23616;
&lt;/p&gt;
&lt;p&gt;
SVGCraft: Beyond Single Object Text-to-SVG Synthesis with Comprehensive Canvas Layout
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00412
&lt;/p&gt;
&lt;p&gt;
SVGCraft&#24341;&#20837;&#20102;&#19968;&#31181;&#31471;&#21040;&#31471;&#26694;&#26550;&#65292;&#21487;&#20197;&#20174;&#25991;&#26412;&#25551;&#36848;&#20013;&#29983;&#25104;&#25551;&#32472;&#25972;&#20010;&#22330;&#26223;&#30340;&#30690;&#37327;&#22270;&#65292;&#20854;&#20013;&#21253;&#25324;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;LLM&#36827;&#34892;&#24067;&#23616;&#29983;&#25104;&#12289;&#20135;&#29983;&#36974;&#32617;&#28508;&#21464;&#37327;&#20197;&#36827;&#34892;&#20934;&#30830;&#23545;&#35937;&#25918;&#32622;&#12289;&#34701;&#21512;&#27880;&#24847;&#21147;&#22270;&#20197;&#21450;&#20351;&#29992;&#25193;&#25955;U-Net&#36827;&#34892;&#21512;&#25104;&#65292;&#21516;&#26102;&#36890;&#36807;&#39044;&#35757;&#32451;&#30340;&#32534;&#30721;&#22120;&#21644;LPIPS&#25439;&#22833;&#36827;&#34892;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20174;&#25991;&#26412;&#25552;&#31034;&#21040;&#30690;&#37327;&#22270;&#30340;VectorArt&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#35270;&#35273;&#20219;&#21153;&#65292;&#38656;&#35201;&#23545;&#24050;&#30693;&#21644;&#26410;&#30693;&#23454;&#20307;&#36827;&#34892;&#22810;&#26679;&#21270;&#32780;&#30495;&#23454;&#30340;&#25551;&#36848;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#23616;&#38480;&#20110;&#29983;&#25104;&#21333;&#20010;&#23545;&#35937;&#65292;&#32780;&#19981;&#26159;&#30001;&#22810;&#20010;&#20803;&#32032;&#32452;&#25104;&#30340;&#22330;&#26223;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;SVGCraft&#65292;&#36825;&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#31471;&#21040;&#31471;&#26694;&#26550;&#65292;&#29992;&#20110;&#20174;&#25991;&#26412;&#25551;&#36848;&#20013;&#29983;&#25104;&#25551;&#32472;&#25972;&#20010;&#22330;&#26223;&#30340;&#30690;&#37327;&#22270;&#12290;&#35813;&#26694;&#26550;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;LLM&#20174;&#25991;&#26412;&#25552;&#31034;&#29983;&#25104;&#24067;&#23616;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#25216;&#26415;&#65292;&#36890;&#36807;&#29983;&#20135;&#29305;&#23450;&#36793;&#30028;&#26694;&#20013;&#30340;&#25513;&#33180;&#28508;&#21464;&#37327;&#23454;&#29616;&#20934;&#30830;&#30340;&#23545;&#35937;&#25918;&#32622;&#12290;&#23427;&#24341;&#20837;&#20102;&#19968;&#20010;&#34701;&#21512;&#26426;&#21046;&#65292;&#29992;&#20110;&#38598;&#25104;&#27880;&#24847;&#21147;&#22270;&#65292;&#24182;&#20351;&#29992;&#25193;&#25955;U-Net&#36827;&#34892;&#36830;&#36143;&#30340;&#21512;&#25104;&#65292;&#21152;&#24555;&#32472;&#22270;&#36807;&#31243;&#12290;&#29983;&#25104;&#30340;SVG&#20351;&#29992;&#39044;&#35757;&#32451;&#30340;&#32534;&#30721;&#22120;&#21644;LPIPS&#25439;&#22833;&#36827;&#34892;&#20248;&#21270;&#65292;&#36890;&#36807;&#36879;&#26126;&#24230;&#35843;&#21046;&#26469;&#26368;&#22823;&#31243;&#24230;&#22320;&#22686;&#21152;&#30456;&#20284;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00412v1 Announce Type: cross  Abstract: Generating VectorArt from text prompts is a challenging vision task, requiring diverse yet realistic depictions of the seen as well as unseen entities. However, existing research has been mostly limited to the generation of single objects, rather than comprehensive scenes comprising multiple elements. In response, this work introduces SVGCraft, a novel end-to-end framework for the creation of vector graphics depicting entire scenes from textual descriptions. Utilizing a pre-trained LLM for layout generation from text prompts, this framework introduces a technique for producing masked latents in specified bounding boxes for accurate object placement. It introduces a fusion mechanism for integrating attention maps and employs a diffusion U-Net for coherent composition, speeding up the drawing process. The resulting SVG is optimized using a pre-trained encoder and LPIPS loss with opacity modulation to maximize similarity. Additionally, th
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#35299;&#20915;&#26080;&#30417;&#30563;&#39046;&#22495;&#36716;&#25442;&#20013;&#30340;&#21487;&#35782;&#21035;&#24615;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;&#19968;&#20010;MPA&#28040;&#38500;&#29702;&#35770;&#65292;&#35299;&#20915;&#20102;CycleGAN&#21450;&#20854;&#21464;&#20307;&#20135;&#29983;&#20869;&#23481;&#19981;&#23545;&#40784;&#30340;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2401.09671</link><description>&lt;p&gt;
&#36808;&#21521;&#21487;&#35782;&#21035;&#30340;&#26080;&#30417;&#30563;&#39046;&#22495;&#36716;&#25442;&#65306;&#19968;&#31181;&#22810;&#26679;&#21270;&#20998;&#24067;&#21305;&#37197;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Towards Identifiable Unsupervised Domain Translation: A Diversified Distribution Matching Approach. (arXiv:2401.09671v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09671
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#35299;&#20915;&#26080;&#30417;&#30563;&#39046;&#22495;&#36716;&#25442;&#20013;&#30340;&#21487;&#35782;&#21035;&#24615;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;&#19968;&#20010;MPA&#28040;&#38500;&#29702;&#35770;&#65292;&#35299;&#20915;&#20102;CycleGAN&#21450;&#20854;&#21464;&#20307;&#20135;&#29983;&#20869;&#23481;&#19981;&#23545;&#40784;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26080;&#30417;&#30563;&#39046;&#22495;&#36716;&#25442;&#65288;UDT&#65289;&#26088;&#22312;&#25214;&#21040;&#23558;&#19968;&#20010;&#39046;&#22495;&#30340;&#26679;&#26412;&#65288;&#20363;&#22914;&#32032;&#25551;&#65289;&#36716;&#25442;&#20026;&#21478;&#19968;&#20010;&#39046;&#22495;&#65288;&#20363;&#22914;&#29031;&#29255;&#65289;&#30340;&#20989;&#25968;&#65292;&#21516;&#26102;&#19981;&#25913;&#21464;&#39640;&#23618;&#35821;&#20041;&#24847;&#20041;&#65288;&#20063;&#31216;&#20026;&#8220;&#20869;&#23481;&#8221;&#65289;&#12290;&#36825;&#20123;&#36716;&#25442;&#20989;&#25968;&#36890;&#24120;&#36890;&#36807;&#36716;&#25442;&#28304;&#39046;&#22495;&#21644;&#30446;&#26631;&#39046;&#22495;&#30340;&#27010;&#29575;&#20998;&#24067;&#26469;&#23547;&#25214;&#12290;CycleGAN&#21487;&#20197;&#35828;&#26159;&#36825;&#19968;&#39046;&#22495;&#20013;&#26368;&#20855;&#20195;&#34920;&#24615;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#25991;&#29486;&#20013;&#25351;&#20986;CycleGAN&#21450;&#20854;&#21464;&#20307;&#21487;&#33021;&#26080;&#27861;&#35782;&#21035;&#25152;&#38656;&#30340;&#36716;&#25442;&#20989;&#25968;&#65292;&#24182;&#20135;&#29983;&#20869;&#23481;&#19981;&#23545;&#40784;&#30340;&#36716;&#25442;&#12290;&#36825;&#31181;&#23616;&#38480;&#24615;&#28304;&#20110;&#23398;&#20064;&#20934;&#21017;&#35299;&#31354;&#38388;&#20013;&#23384;&#22312;&#22810;&#20010;&#36716;&#25442;&#20989;&#25968;&#65292;&#31216;&#20026;&#8220;&#20445;&#24230;&#33258;&#21516;&#26500;&#65288;MPA&#65289;&#8221;&#12290;&#23613;&#31649;&#24847;&#35782;&#21040;&#20102;&#36825;&#31181;&#21487;&#35782;&#21035;&#24615;&#38382;&#39064;&#65292;&#20294;&#35299;&#20915;&#26041;&#26696;&#20173;&#28982;&#38590;&#20197;&#25214;&#21040;&#12290;&#26412;&#30740;&#31350;&#28145;&#20837;&#25506;&#31350;&#20102;&#26680;&#24515;&#30340;&#21487;&#35782;&#21035;&#24615;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;MPA&#28040;&#38500;&#29702;&#35770;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;...
&lt;/p&gt;
&lt;p&gt;
Unsupervised domain translation (UDT) aims to find functions that convert samples from one domain (e.g., sketches) to another domain (e.g., photos) without changing the high-level semantic meaning (also referred to as ``content''). The translation functions are often sought by probability distribution matching of the transformed source domain and target domain. CycleGAN stands as arguably the most representative approach among this line of work. However, it was noticed in the literature that CycleGAN and variants could fail to identify the desired translation functions and produce content-misaligned translations. This limitation arises due to the presence of multiple translation functions -- referred to as ``measure-preserving automorphism" (MPA) -- in the solution space of the learning criteria. Despite awareness of such identifiability issues, solutions have remained elusive. This study delves into the core identifiability inquiry and introduces an MPA elimination theory. Our analysi
&lt;/p&gt;</description></item></channel></rss>