<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#24555;&#36895;&#38598;&#25104;&#23398;&#20064;&#20248;&#21270;&#21270;&#23398;&#20256;&#24863;&#22120;&#38453;&#21015;&#30340;&#31574;&#30053;&#65292;&#24341;&#20837;&#20102;&#34013;&#33394;&#21644;&#32511;&#33394;&#20004;&#31181;&#24037;&#20316;&#27169;&#24335;&#65292;&#36890;&#36807;&#36873;&#25321;&#24615;&#28608;&#27963;&#20851;&#38190;&#20256;&#24863;&#22120;&#26174;&#33879;&#38477;&#20302;&#33021;&#32791;&#32780;&#19981;&#24433;&#21709;&#26816;&#27979;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.01642</link><description>&lt;p&gt;
&#36890;&#36807;&#24555;&#36895;&#38598;&#25104;&#23398;&#20064;&#23454;&#29616;&#30340;&#34013;&#32511;&#27169;&#24335;&#39640;&#33021;&#25928;&#21270;&#21270;&#23398;&#20256;&#24863;&#22120;&#38453;&#21015;
&lt;/p&gt;
&lt;p&gt;
Blue and Green-Mode Energy-Efficient Chemiresistive Sensor Array Realized by Rapid Ensemble Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01642
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#24555;&#36895;&#38598;&#25104;&#23398;&#20064;&#20248;&#21270;&#21270;&#23398;&#20256;&#24863;&#22120;&#38453;&#21015;&#30340;&#31574;&#30053;&#65292;&#24341;&#20837;&#20102;&#34013;&#33394;&#21644;&#32511;&#33394;&#20004;&#31181;&#24037;&#20316;&#27169;&#24335;&#65292;&#36890;&#36807;&#36873;&#25321;&#24615;&#28608;&#27963;&#20851;&#38190;&#20256;&#24863;&#22120;&#26174;&#33879;&#38477;&#20302;&#33021;&#32791;&#32780;&#19981;&#24433;&#21709;&#26816;&#27979;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01642v1 &#20844;&#21578;&#31867;&#22411;: &#26032;&#30340; &#25688;&#35201;: &#29289;&#32852;&#32593;&#30340;&#24555;&#36895;&#21457;&#23637;&#38656;&#35201;&#24320;&#21457;&#26082;&#39640;&#25928;&#21448;&#33021;&#32988;&#20219;&#30340;&#20248;&#21270;&#21270;&#23398;&#20256;&#24863;&#22120;&#38453;&#21015;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#19968;&#31181;&#26032;&#39062;&#30340;&#20248;&#21270;&#31574;&#30053;&#65292;&#37319;&#29992;&#24555;&#36895;&#38598;&#25104;&#23398;&#20064;&#27169;&#22411;&#22996;&#21592;&#20250;&#26041;&#27861;&#26469;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#12290;&#21033;&#29992;&#24377;&#24615;&#32593;&#22238;&#24402;&#12289;&#38543;&#26426;&#26862;&#26519;&#12289;XGBoost&#31561;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#35813;&#31574;&#30053;&#35782;&#21035;&#20986;&#22312;&#21270;&#23398;&#20256;&#24863;&#22120;&#38453;&#21015;&#20013;&#23545;&#20934;&#30830;&#20998;&#31867;&#26368;&#20855;&#24433;&#21709;&#21147;&#30340;&#20256;&#24863;&#22120;&#65306;&#24341;&#20837;&#21152;&#26435;&#25237;&#31080;&#26426;&#21046;&#26469;&#32858;&#21512;&#20256;&#24863;&#22120;&#36873;&#25321;&#20013;&#30340;&#27169;&#22411;&#24847;&#35265;&#65292;&#20174;&#32780;&#24314;&#31435;&#20102;&#20004;&#31181;&#19981;&#21516;&#30340;&#24037;&#20316;&#27169;&#24335;&#65292;&#31216;&#20026;&#8220;&#34013;&#33394;&#8221;&#21644;&#8220;&#32511;&#33394;&#8221;&#12290;&#34013;&#33394;&#27169;&#24335;&#21033;&#29992;&#25152;&#26377;&#20256;&#24863;&#22120;&#36827;&#34892;&#26368;&#22823;&#26816;&#27979;&#33021;&#21147;&#65292;&#32780;&#32511;&#33394;&#27169;&#24335;&#20165;&#36873;&#25321;&#24615;&#28608;&#27963;&#20851;&#38190;&#20256;&#24863;&#22120;&#65292;&#20174;&#32780;&#26174;&#33879;&#38477;&#20302;&#33021;&#32791;&#32780;&#19981;&#24433;&#21709;&#26816;&#27979;&#20934;&#30830;&#24615;&#12290;&#35813;&#31574;&#30053;&#36890;&#36807;&#29702;&#35770;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01642v1 Announce Type: new  Abstract: The rapid advancement of Internet of Things (IoT) necessitates the development of optimized Chemiresistive Sensor (CRS) arrays that are both energy-efficient and capable. This study introduces a novel optimization strategy that employs a rapid ensemble learning-based model committee approach to achieve these goals. Utilizing machine learning models such as Elastic Net Regression, Random Forests, and XGBoost, among others, the strategy identifies the most impactful sensors in a CRS array for accurate classification: A weighted voting mechanism is introduced to aggregate the models' opinions in sensor selection, thereby setting up wo distinct working modes, termed "Blue" and "Green". The Blue mode operates with all sensors for maximum detection capability, while the Green mode selectively activates only key sensors, significantly reducing energy consumption without compromising detection accuracy. The strategy is validated through theoreti
&lt;/p&gt;</description></item></channel></rss>