<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26426;&#22120;&#36951;&#24536;&#65288;MU&#65289;&#36890;&#36807;&#30693;&#35782;&#21435;&#38500;&#36807;&#31243;&#26469;&#35299;&#20915;&#35757;&#32451;&#25968;&#25454;&#30456;&#20851;&#30340;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#38382;&#39064;&#65292;&#25552;&#39640;&#20102;AI&#31995;&#32479;&#30340;&#23433;&#20840;&#21644;&#36127;&#36131;&#20219;&#20351;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.13682</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#23041;&#32961;&#12289;&#25915;&#20987;&#21644;&#38450;&#24481;&#65306;&#19968;&#39033;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Threats, Attacks, and Defenses in Machine Unlearning: A Survey
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13682
&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#36951;&#24536;&#65288;MU&#65289;&#36890;&#36807;&#30693;&#35782;&#21435;&#38500;&#36807;&#31243;&#26469;&#35299;&#20915;&#35757;&#32451;&#25968;&#25454;&#30456;&#20851;&#30340;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#38382;&#39064;&#65292;&#25552;&#39640;&#20102;AI&#31995;&#32479;&#30340;&#23433;&#20840;&#21644;&#36127;&#36131;&#20219;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#36951;&#24536;&#65288;MU&#65289;&#26368;&#36817;&#24341;&#36215;&#20102;&#30456;&#24403;&#22823;&#30340;&#20851;&#27880;&#65292;&#22240;&#20026;&#23427;&#26377;&#28508;&#21147;&#36890;&#36807;&#20174;&#35757;&#32451;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#28040;&#38500;&#29305;&#23450;&#25968;&#25454;&#30340;&#24433;&#21709;&#26469;&#23454;&#29616;&#23433;&#20840;&#20154;&#24037;&#26234;&#33021;&#12290;&#36825;&#20010;&#34987;&#31216;&#20026;&#30693;&#35782;&#21435;&#38500;&#30340;&#36807;&#31243;&#35299;&#20915;&#20102;&#19982;&#35757;&#32451;&#25968;&#25454;&#30456;&#20851;&#30340;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#38382;&#39064;&#65292;&#22914;&#25968;&#25454;&#36136;&#37327;&#12289;&#25935;&#24863;&#24615;&#12289;&#29256;&#26435;&#38480;&#21046;&#21644;&#36807;&#26102;&#24615;&#12290;&#36825;&#31181;&#33021;&#21147;&#23545;&#20110;&#30830;&#20445;&#36981;&#23432;&#35832;&#22914;&#34987;&#36951;&#24536;&#26435;&#31561;&#38544;&#31169;&#27861;&#35268;&#20063;&#33267;&#20851;&#37325;&#35201;&#12290;&#27492;&#22806;&#65292;&#26377;&#25928;&#30340;&#30693;&#35782;&#21435;&#38500;&#26377;&#21161;&#20110;&#20943;&#36731;&#26377;&#23475;&#32467;&#26524;&#30340;&#39118;&#38505;&#65292;&#38450;&#33539;&#20559;&#35265;&#12289;&#35823;&#23548;&#21644;&#26410;&#32463;&#25480;&#26435;&#30340;&#25968;&#25454;&#21033;&#29992;&#65292;&#20174;&#32780;&#22686;&#24378;&#20102;AI&#31995;&#32479;&#30340;&#23433;&#20840;&#21644;&#36127;&#36131;&#20219;&#20351;&#29992;&#12290;&#24050;&#32463;&#24320;&#23637;&#20102;&#35774;&#35745;&#39640;&#25928;&#30340;&#36951;&#24536;&#26041;&#27861;&#30340;&#24037;&#20316;&#65292;&#36890;&#36807;&#30740;&#31350;MU&#26381;&#21153;&#20197;&#19982;&#29616;&#26377;&#30340;&#26426;&#22120;&#23398;&#20064;&#20316;&#20026;&#26381;&#21153;&#38598;&#25104;&#65292;&#20351;&#29992;&#25143;&#33021;&#22815;&#25552;&#20132;&#35831;&#27714;&#20174;&#35757;&#32451;&#35821;&#26009;&#24211;&#20013;&#21024;&#38500;&#29305;&#23450;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13682v2 Announce Type: replace-cross  Abstract: Machine Unlearning (MU) has gained considerable attention recently for its potential to achieve Safe AI by removing the influence of specific data from trained machine learning models. This process, known as knowledge removal, addresses AI governance concerns of training data such as quality, sensitivity, copyright restrictions, and obsolescence. This capability is also crucial for ensuring compliance with privacy regulations such as the Right To Be Forgotten. Furthermore, effective knowledge removal mitigates the risk of harmful outcomes, safeguarding against biases, misinformation, and unauthorized data exploitation, thereby enhancing the safe and responsible use of AI systems. Efforts have been made to design efficient unlearning approaches, with MU services being examined for integration with existing machine learning as a service, allowing users to submit requests to remove specific data from the training corpus. However, 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;InjecAgent&#22522;&#20934;&#27979;&#35797;&#65292;&#29992;&#20110;&#35780;&#20272;&#24037;&#20855;&#38598;&#25104;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20195;&#29702;&#23545;&#38388;&#25509;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#30340;&#33030;&#24369;&#24615;&#65292;&#36890;&#36807;&#35780;&#20272;30&#31181;LLM&#20195;&#29702;&#65292;&#21457;&#29616;&#36825;&#20123;&#20195;&#29702;&#23384;&#22312;&#28431;&#27934;</title><link>https://arxiv.org/abs/2403.02691</link><description>&lt;p&gt;
InjecAgent&#65306;&#22522;&#20110;&#24037;&#20855;&#38598;&#25104;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;Agent&#20013;&#30340;&#38388;&#25509;&#25552;&#31034;&#27880;&#20837;&#22522;&#20934;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
InjecAgent: Benchmarking Indirect Prompt Injections in Tool-Integrated Large Language Model Agents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02691
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;InjecAgent&#22522;&#20934;&#27979;&#35797;&#65292;&#29992;&#20110;&#35780;&#20272;&#24037;&#20855;&#38598;&#25104;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20195;&#29702;&#23545;&#38388;&#25509;&#25552;&#31034;&#27880;&#20837;&#25915;&#20987;&#30340;&#33030;&#24369;&#24615;&#65292;&#36890;&#36807;&#35780;&#20272;30&#31181;LLM&#20195;&#29702;&#65292;&#21457;&#29616;&#36825;&#20123;&#20195;&#29702;&#23384;&#22312;&#28431;&#27934;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#24037;&#20316;&#23558;LLMs&#20316;&#20026;&#20195;&#29702;&#20307;&#29616;&#20986;&#26469;&#65292;&#20351;&#23427;&#20204;&#33021;&#22815;&#35775;&#38382;&#24037;&#20855;&#65292;&#25191;&#34892;&#25805;&#20316;&#65292;&#24182;&#19982;&#22806;&#37096;&#20869;&#23481;&#65288;&#20363;&#22914;&#65292;&#30005;&#23376;&#37038;&#20214;&#25110;&#32593;&#31449;&#65289;&#36827;&#34892;&#20132;&#20114;&#12290;&#28982;&#32780;&#65292;&#22806;&#37096;&#20869;&#23481;&#24341;&#20837;&#20102;&#38388;&#25509;&#25552;&#31034;&#27880;&#20837;&#65288;IPI&#65289;&#25915;&#20987;&#30340;&#39118;&#38505;&#65292;&#24694;&#24847;&#25351;&#20196;&#34987;&#23884;&#20837;LLMs&#22788;&#29702;&#30340;&#20869;&#23481;&#20013;&#65292;&#26088;&#22312;&#25805;&#32437;&#36825;&#20123;&#20195;&#29702;&#25191;&#34892;&#23545;&#29992;&#25143;&#26377;&#23475;&#30340;&#25805;&#20316;&#12290;&#32771;&#34385;&#21040;&#36825;&#31867;&#25915;&#20987;&#30340;&#28508;&#22312;&#20005;&#37325;&#21518;&#26524;&#65292;&#24314;&#31435;&#29992;&#20110;&#35780;&#20272;&#21644;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#30340;&#22522;&#20934;&#27979;&#35797;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;InjecAgent&#65292;&#36825;&#26159;&#19968;&#20010;&#26088;&#22312;&#35780;&#20272;&#24037;&#20855;&#38598;&#25104;&#30340;LLM&#20195;&#29702;&#23545;IPI&#25915;&#20987;&#30340;&#33030;&#24369;&#24615;&#30340;&#22522;&#20934;&#27979;&#35797;&#12290;InjecAgent&#21253;&#25324;1,054&#20010;&#27979;&#35797;&#29992;&#20363;&#65292;&#28085;&#30422;17&#31181;&#19981;&#21516;&#30340;&#29992;&#25143;&#24037;&#20855;&#21644;62&#31181;&#25915;&#20987;&#32773;&#24037;&#20855;&#12290;&#25105;&#20204;&#23558;&#25915;&#20987;&#24847;&#22270;&#20998;&#20026;&#20004;&#31181;&#20027;&#35201;&#31867;&#22411;&#65306;&#23545;&#29992;&#25143;&#36896;&#25104;&#30452;&#25509;&#20260;&#23475;&#21644;&#31363;&#21462;&#31169;&#20154;&#25968;&#25454;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;30&#31181;&#19981;&#21516;&#30340;LLM&#20195;&#29702;&#65292;&#24182;&#34920;&#26126;&#36825;&#20123;&#20195;&#29702;&#26159;&#33030;&#24369;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02691v1 Announce Type: new  Abstract: Recent work has embodied LLMs as agents, allowing them to access tools, perform actions, and interact with external content (e.g., emails or websites). However, external content introduces the risk of indirect prompt injection (IPI) attacks, where malicious instructions are embedded within the content processed by LLMs, aiming to manipulate these agents into executing detrimental actions against users. Given the potentially severe consequences of such attacks, establishing benchmarks to assess and mitigate these risks is imperative.   In this work, we introduce InjecAgent, a benchmark designed to assess the vulnerability of tool-integrated LLM agents to IPI attacks. InjecAgent comprises 1,054 test cases covering 17 different user tools and 62 attacker tools. We categorize attack intentions into two primary types: direct harm to users and exfiltration of private data. We evaluate 30 different LLM agents and show that agents are vulnerable
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#22270;&#23884;&#20837;&#26694;&#26550;&#65288;LDP-GE&#65289;&#65292;&#35813;&#26694;&#26550;&#37319;&#29992;LDP&#26426;&#21046;&#26469;&#20445;&#25252;&#33410;&#28857;&#25968;&#25454;&#30340;&#38544;&#31169;&#65292;&#24182;&#20351;&#29992;&#20010;&#24615;&#21270;PageRank&#20316;&#20026;&#36817;&#20284;&#24230;&#24230;&#37327;&#26469;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#12290;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;LDP-GE&#22312;&#38544;&#31169;&#21644;&#25928;&#29992;&#26041;&#38754;&#21462;&#24471;&#20102;&#26377;&#21033;&#30340;&#25240;&#34935;&#25928;&#26524;&#65292;&#24182;&#19988;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.11060</link><description>&lt;p&gt;
&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#22270;&#23884;&#20837;
&lt;/p&gt;
&lt;p&gt;
Locally Differentially Private Graph Embedding. (arXiv:2310.11060v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11060
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#22270;&#23884;&#20837;&#26694;&#26550;&#65288;LDP-GE&#65289;&#65292;&#35813;&#26694;&#26550;&#37319;&#29992;LDP&#26426;&#21046;&#26469;&#20445;&#25252;&#33410;&#28857;&#25968;&#25454;&#30340;&#38544;&#31169;&#65292;&#24182;&#20351;&#29992;&#20010;&#24615;&#21270;PageRank&#20316;&#20026;&#36817;&#20284;&#24230;&#24230;&#37327;&#26469;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#12290;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;LDP-GE&#22312;&#38544;&#31169;&#21644;&#25928;&#29992;&#26041;&#38754;&#21462;&#24471;&#20102;&#26377;&#21033;&#30340;&#25240;&#34935;&#25928;&#26524;&#65292;&#24182;&#19988;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#23884;&#20837;&#34987;&#35777;&#26126;&#26159;&#23398;&#20064;&#22270;&#20013;&#33410;&#28857;&#28508;&#22312;&#34920;&#31034;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#23613;&#31649;&#22312;&#21508;&#31181;&#22522;&#20110;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#21331;&#36234;&#24615;&#33021;&#65292;&#20294;&#22312;&#28041;&#21450;&#25935;&#24863;&#20449;&#24687;&#30340;&#22270;&#25968;&#25454;&#19978;&#36827;&#34892;&#23398;&#20064;&#21487;&#33021;&#24341;&#21457;&#37325;&#22823;&#30340;&#38544;&#31169;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#24320;&#21457;&#33021;&#28385;&#36275;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#65288;LDP&#65289;&#30340;&#22270;&#23884;&#20837;&#31639;&#27861;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38544;&#31169;&#20445;&#25252;&#22270;&#23884;&#20837;&#26694;&#26550;LDP-GE&#65292;&#29992;&#20110;&#20445;&#25252;&#33410;&#28857;&#25968;&#25454;&#30340;&#38544;&#31169;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;LDP&#26426;&#21046;&#26469;&#28151;&#28102;&#33410;&#28857;&#25968;&#25454;&#65292;&#24182;&#37319;&#29992;&#20010;&#24615;&#21270;PageRank&#20316;&#20026;&#36817;&#20284;&#24230;&#24230;&#37327;&#26469;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20174;&#29702;&#35770;&#19978;&#20998;&#26512;&#20102;LDP-GE&#26694;&#26550;&#30340;&#38544;&#31169;&#20445;&#35777;&#21644;&#25928;&#29992;&#12290;&#22312;&#20960;&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#22270;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#30340;&#22823;&#37327;&#23454;&#39564;&#34920;&#26126;&#65292;LDP-GE&#22312;&#38544;&#31169;-&#25928;&#29992;&#26435;&#34913;&#26041;&#38754;&#21462;&#24471;&#20102;&#26377;&#21033;&#30340;&#25928;&#26524;&#65292;&#24182;&#19988;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph embedding has been demonstrated to be a powerful tool for learning latent representations for nodes in a graph. However, despite its superior performance in various graph-based machine learning tasks, learning over graphs can raise significant privacy concerns when graph data involves sensitive information. To address this, in this paper, we investigate the problem of developing graph embedding algorithms that satisfy local differential privacy (LDP). We propose LDP-GE, a novel privacy-preserving graph embedding framework, to protect the privacy of node data. Specifically, we propose an LDP mechanism to obfuscate node data and adopt personalized PageRank as the proximity measure to learn node representations. Then, we theoretically analyze the privacy guarantees and utility of the LDP-GE framework. Extensive experiments conducted over several real-world graph datasets demonstrate that LDP-GE achieves favorable privacy-utility trade-offs and significantly outperforms existing appr
&lt;/p&gt;</description></item></channel></rss>