<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#20013;&#65292;&#20801;&#35768;&#20449;&#24687;&#27844;&#28431;&#21644;&#36817;&#20284;&#20056;&#27861;&#30340;&#24773;&#20917;&#19979;&#65292;&#24403;&#35802;&#23454;&#33410;&#28857;&#25968;&#37327;&#20026;&#23569;&#25968;&#26102;&#65292;&#24046;&#20998;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2309.16105</link><description>&lt;p&gt;
&#24046;&#20998;&#38544;&#31169;&#23433;&#20840;&#20056;&#27861;&#65306;&#22312;&#22122;&#22768;&#20013;&#38544;&#34255;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Differentially Private Secure Multiplication: Hiding Information in the Rubble of Noise. (arXiv:2309.16105v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16105
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#20013;&#65292;&#20801;&#35768;&#20449;&#24687;&#27844;&#28431;&#21644;&#36817;&#20284;&#20056;&#27861;&#30340;&#24773;&#20917;&#19979;&#65292;&#24403;&#35802;&#23454;&#33410;&#28857;&#25968;&#37327;&#20026;&#23569;&#25968;&#26102;&#65292;&#24046;&#20998;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#31169;&#23494;&#20998;&#24067;&#24335;&#22810;&#26041;&#20056;&#27861;&#30340;&#38382;&#39064;&#12290;&#24050;&#32463;&#30830;&#35748;&#65292;Shamir&#31192;&#23494;&#20849;&#20139;&#32534;&#30721;&#31574;&#30053;&#21487;&#20197;&#36890;&#36807;Ben Or&#65292;Goldwasser&#65292;Wigderson&#31639;&#27861;&#65288;&#8220;BGW&#31639;&#27861;&#8221;&#65289;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#20013;&#23454;&#29616;&#23436;&#32654;&#30340;&#20449;&#24687;&#29702;&#35770;&#38544;&#31169;&#12290;&#28982;&#32780;&#65292;&#23436;&#32654;&#30340;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#38656;&#35201;&#19968;&#20010;&#35802;&#23454;&#30340;&#22810;&#25968;&#65292;&#21363;&#38656;&#35201;$N \geq 2t+1$&#20010;&#35745;&#31639;&#33410;&#28857;&#20197;&#30830;&#20445;&#23545;&#25239;&#24615;&#33410;&#28857;&#30340;&#38544;&#31169;&#12290;&#25105;&#20204;&#36890;&#36807;&#20801;&#35768;&#19968;&#23450;&#37327;&#30340;&#20449;&#24687;&#27844;&#28431;&#21644;&#36817;&#20284;&#20056;&#27861;&#26469;&#30740;&#31350;&#22312;&#35802;&#23454;&#33410;&#28857;&#25968;&#37327;&#20026;&#23569;&#25968;&#26102;&#30340;&#32534;&#30721;&#26041;&#26696;&#65292;&#21363;$N&lt; 2t+1$&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#24046;&#20998;&#38544;&#31169;&#32780;&#19981;&#26159;&#23436;&#32654;&#38544;&#31169;&#26469;&#27979;&#37327;&#20449;&#24687;&#27844;&#28431;&#65292;&#24182;&#20351;&#29992;&#22343;&#26041;&#35823;&#24046;&#24230;&#37327;&#20934;&#30830;&#24615;&#65292;&#23545;$N &lt; 2t+1$&#30340;&#24773;&#20917;&#19979;&#30340;&#38544;&#31169;-&#20934;&#30830;&#24615;&#26435;&#34913;&#36827;&#34892;&#20102;&#32039;&#23494;&#30340;&#21051;&#30011;&#12290;&#19968;&#20010;&#26032;&#39062;&#30340;&#25216;&#26415;&#26041;&#38754;&#26159;&#22797;&#26434;&#22320;&#25511;&#21046;&#20449;&#24687;&#27844;&#28431;&#30340;&#32454;&#33410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of private distributed multi-party multiplication. It is well-established that Shamir secret-sharing coding strategies can enable perfect information-theoretic privacy in distributed computation via the celebrated algorithm of Ben Or, Goldwasser and Wigderson (the "BGW algorithm"). However, perfect privacy and accuracy require an honest majority, that is, $N \geq 2t+1$ compute nodes are required to ensure privacy against any $t$ colluding adversarial nodes. By allowing for some controlled amount of information leakage and approximate multiplication instead of exact multiplication, we study coding schemes for the setting where the number of honest nodes can be a minority, that is $N&lt; 2t+1.$ We develop a tight characterization privacy-accuracy trade-off for cases where $N &lt; 2t+1$ by measuring information leakage using {differential} privacy instead of perfect privacy, and using the mean squared error metric for accuracy. A novel technical aspect is an intricately 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;BERT&#30340;&#28966;&#28857;&#29228;&#34411;ThreatCrawl&#65292;&#20351;&#29992;&#20027;&#39064;&#24314;&#27169;&#21644;&#20851;&#38190;&#35789;&#25552;&#21462;&#25216;&#26415;&#26469;&#31579;&#36873;&#20986;&#26368;&#21487;&#33021;&#21253;&#21547;&#26377;&#20215;&#20540;CTI&#20449;&#24687;&#30340;&#32593;&#39029;&#12290;</title><link>http://arxiv.org/abs/2304.11960</link><description>&lt;p&gt;
ThreatCrawl&#65306;&#22522;&#20110;BERT&#30340;&#32593;&#32476;&#23433;&#20840;&#28966;&#28857;&#29228;&#34411;
&lt;/p&gt;
&lt;p&gt;
ThreatCrawl: A BERT-based Focused Crawler for the Cybersecurity Domain. (arXiv:2304.11960v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11960
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;BERT&#30340;&#28966;&#28857;&#29228;&#34411;ThreatCrawl&#65292;&#20351;&#29992;&#20027;&#39064;&#24314;&#27169;&#21644;&#20851;&#38190;&#35789;&#25552;&#21462;&#25216;&#26415;&#26469;&#31579;&#36873;&#20986;&#26368;&#21487;&#33021;&#21253;&#21547;&#26377;&#20215;&#20540;CTI&#20449;&#24687;&#30340;&#32593;&#39029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21487;&#20844;&#24320;&#33719;&#21462;&#30340;&#20449;&#24687;&#23545;&#20110;&#32593;&#32476;&#23041;&#32961;&#24773;&#25253;&#65288;CTI&#65289;&#26469;&#35828;&#21253;&#21547;&#26377;&#20215;&#20540;&#30340;&#20449;&#24687;&#12290;&#36825;&#21487;&#20197;&#29992;&#20110;&#39044;&#38450;&#24050;&#32463;&#22312;&#20854;&#20182;&#31995;&#32479;&#19978;&#21457;&#29983;&#30340;&#25915;&#20987;&#12290;&#20294;&#26159;&#65292;&#34429;&#28982;&#26377;&#19981;&#21516;&#30340;&#26631;&#20934;&#26469;&#20132;&#27969;&#36825;&#20123;&#20449;&#24687;&#65292;&#20294;&#24456;&#22810;&#20449;&#24687;&#26159;&#20197;&#38750;&#26631;&#20934;&#21270;&#30340;&#26041;&#24335;&#22312;&#25991;&#31456;&#25110;&#21338;&#23458;&#24086;&#23376;&#20013;&#20849;&#20139;&#30340;&#12290;&#25163;&#21160;&#27983;&#35272;&#22810;&#20010;&#22312;&#32447;&#38376;&#25143;&#21644;&#26032;&#38395;&#39029;&#38754;&#20197;&#21457;&#29616;&#26032;&#23041;&#32961;&#24182;&#25552;&#21462;&#23427;&#20204;&#26159;&#19968;&#39033;&#32791;&#26102;&#30340;&#20219;&#21153;&#12290;&#20026;&#20102;&#33258;&#21160;&#21270;&#36825;&#20010;&#25195;&#25551;&#36807;&#31243;&#30340;&#19968;&#37096;&#20998;&#65292;&#22810;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;NLP&#65289;&#20174;&#25991;&#26723;&#20013;&#25552;&#21462;&#23041;&#32961;&#25351;&#31034;&#22120;&#65288;IOCs&#65289;&#30340;&#25552;&#21462;&#22120;&#12290;&#28982;&#32780;&#65292;&#34429;&#28982;&#36825;&#24050;&#32463;&#35299;&#20915;&#20102;&#20174;&#25991;&#26723;&#20013;&#25552;&#21462;&#20449;&#24687;&#30340;&#38382;&#39064;&#65292;&#20294;&#24456;&#23569;&#32771;&#34385;&#25628;&#32034;&#36825;&#20123;&#25991;&#26723;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28966;&#28857;&#29228;&#34411;ThreatCrawl&#65292;&#23427;&#20351;&#29992;&#21452;&#21521;&#32534;&#30721;&#22120;&#34920;&#31034;&#65288;BERT&#65289;&#25628;&#32034;&#32593;&#32476;&#23433;&#20840;&#39046;&#22495;&#20013;&#30340;&#30456;&#20851;&#25991;&#26723;&#12290;ThreatCrawl&#20351;&#29992;&#20027;&#39064;&#24314;&#27169;&#21644;&#20851;&#38190;&#35789;&#25552;&#21462;&#25216;&#26415;&#26469;&#35782;&#21035;&#30456;&#20851;&#32593;&#31449;&#21644;&#32593;&#39029;&#65292;&#28982;&#21518;&#24212;&#29992;&#22522;&#20110;BERT&#30340;&#20998;&#31867;&#22120;&#26469;&#20248;&#20808;&#32771;&#34385;&#26368;&#21487;&#33021;&#21253;&#21547;&#26377;&#20215;&#20540;CTI&#20449;&#24687;&#30340;&#32593;&#39029;&#12290;
&lt;/p&gt;
&lt;p&gt;
Publicly available information contains valuable information for Cyber Threat Intelligence (CTI). This can be used to prevent attacks that have already taken place on other systems. Ideally, only the initial attack succeeds and all subsequent ones are detected and stopped. But while there are different standards to exchange this information, a lot of it is shared in articles or blog posts in non-standardized ways. Manually scanning through multiple online portals and news pages to discover new threats and extracting them is a time-consuming task. To automize parts of this scanning process, multiple papers propose extractors that use Natural Language Processing (NLP) to extract Indicators of Compromise (IOCs) from documents. However, while this already solves the problem of extracting the information out of documents, the search for these documents is rarely considered. In this paper, a new focused crawler is proposed called ThreatCrawl, which uses Bidirectional Encoder Representations 
&lt;/p&gt;</description></item></channel></rss>