<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>IG&#26159;&#19968;&#20010;&#21487;&#35299;&#37322;&#27867;&#21270;&#26426;&#21046;&#65292;&#33021;&#22815;&#20934;&#30830;&#21306;&#20998;&#27491;&#24120;&#21644;&#24322;&#24120;&#30340;&#32593;&#32476;&#27969;&#37327;&#65292;&#24182;&#25581;&#31034;&#22797;&#26434;&#30340;&#20837;&#20405;&#36335;&#24452;&#65292;&#20026;&#32593;&#32476;&#23433;&#20840;&#21462;&#35777;&#25552;&#20379;&#37325;&#35201;&#35265;&#35299;&#12290;</title><link>https://arxiv.org/abs/2403.07959</link><description>&lt;p&gt;
&#19968;&#20010;&#29992;&#20110;&#20934;&#30830;&#26816;&#27979;&#24322;&#24120;&#24182;&#35782;&#21035;&#32593;&#32476;&#20837;&#20405;&#25216;&#26415;&#30340;&#21487;&#35299;&#37322;&#27867;&#21270;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
An Interpretable Generalization Mechanism for Accurately Detecting Anomaly and Identifying Networking Intrusion Techniques
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07959
&lt;/p&gt;
&lt;p&gt;
IG&#26159;&#19968;&#20010;&#21487;&#35299;&#37322;&#27867;&#21270;&#26426;&#21046;&#65292;&#33021;&#22815;&#20934;&#30830;&#21306;&#20998;&#27491;&#24120;&#21644;&#24322;&#24120;&#30340;&#32593;&#32476;&#27969;&#37327;&#65292;&#24182;&#25581;&#31034;&#22797;&#26434;&#30340;&#20837;&#20405;&#36335;&#24452;&#65292;&#20026;&#32593;&#32476;&#23433;&#20840;&#21462;&#35777;&#25552;&#20379;&#37325;&#35201;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;&#65288;IDS&#65289;&#20013;&#25972;&#21512;&#21487;&#35299;&#37322;&#20154;&#24037;&#26234;&#33021;&#65288;XAI&#65289;&#26041;&#27861;&#30340;&#21457;&#23637;&#65292;&#36890;&#36807;&#31934;&#30830;&#30340;&#29305;&#24449;&#36873;&#25321;&#65292;&#26174;&#33879;&#25552;&#21319;&#20102;&#31995;&#32479;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#23545;&#32593;&#32476;&#25915;&#20987;&#30340;&#24443;&#24213;&#29702;&#35299;&#35201;&#27714;IDS&#20869;&#22312;&#21487;&#35299;&#37322;&#30340;&#20915;&#31574;&#36807;&#31243;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#8220;&#21487;&#35299;&#37322;&#27867;&#21270;&#26426;&#21046;&#8221;&#65288;IG&#65289;&#65292;&#26088;&#22312;&#24443;&#24213;&#25913;&#21464;IDS&#30340;&#33021;&#21147;&#12290;IG&#33021;&#22815;&#35782;&#21035;&#36830;&#36143;&#27169;&#24335;&#65292;&#20351;&#20854;&#33021;&#22815;&#35299;&#37322;&#21306;&#20998;&#27491;&#24120;&#21644;&#24322;&#24120;&#30340;&#32593;&#32476;&#27969;&#37327;&#12290;&#27492;&#22806;&#65292;&#36830;&#36143;&#27169;&#24335;&#30340;&#32508;&#21512;&#25581;&#31034;&#22797;&#26434;&#30340;&#20837;&#20405;&#36335;&#24452;&#65292;&#20026;&#32593;&#32476;&#23433;&#20840;&#21462;&#35777;&#25552;&#20379;&#20102;&#24517;&#35201;&#30340;&#35265;&#35299;&#12290;&#36890;&#36807;&#23545;&#30495;&#23454;&#25968;&#25454;&#38598;NSL-KDD&#12289;UNSW-NB15&#21644;UKM-IDS20&#30340;&#23454;&#39564;&#65292;IG&#21363;&#20351;&#22312;&#36739;&#20302;&#30340;&#35757;&#32451;-&#27979;&#35797;&#27604;&#29575;&#19979;&#20063;&#33021;&#20934;&#30830;&#12290;&#22312;NSL-KDD&#25968;&#25454;&#38598;&#20013;&#65292;&#24403;&#35757;&#32451;-&#27979;&#35797;&#27604;&#29575;&#20026;10%-90%&#26102;&#65292;IG&#23454;&#29616;&#30340;Precision&#65288;PRE&#65289;=0.93&#12289;Recall&#65288;REC&#65289;=0.94&#21644;Area Under Curve&#65288;AUC&#65289;=0.94&#65307;PRE=0.98...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07959v1 Announce Type: cross  Abstract: Recent advancements in Intrusion Detection Systems (IDS), integrating Explainable AI (XAI) methodologies, have led to notable improvements in system performance via precise feature selection. However, a thorough understanding of cyber-attacks requires inherently explainable decision-making processes within IDS. In this paper, we present the Interpretable Generalization Mechanism (IG), poised to revolutionize IDS capabilities. IG discerns coherent patterns, making it interpretable in distinguishing between normal and anomalous network traffic. Further, the synthesis of coherent patterns sheds light on intricate intrusion pathways, providing essential insights for cybersecurity forensics. By experiments with real-world datasets NSL-KDD, UNSW-NB15, and UKM-IDS20, IG is accurate even at a low ratio of training-to-test. With 10%-to-90%, IG achieves Precision (PRE)=0.93, Recall (REC)=0.94, and Area Under Curve (AUC)=0.94 in NSL-KDD; PRE=0.98
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#32508;&#36848;&#35770;&#25991;&#20171;&#32461;&#20102;&#32852;&#37030;&#36951;&#24536;&#30340;&#27010;&#24565;&#21644;&#25361;&#25112;&#65292;&#20197;&#21450;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#30340;&#26041;&#27861;&#21644;&#35774;&#35745;&#20934;&#21017;&#65292;&#26088;&#22312;&#20026;&#32852;&#37030;&#23398;&#20064;&#20013;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#21644;&#38450;&#27490;&#24694;&#24847;&#25915;&#20987;&#25552;&#20379;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.05146</link><description>&lt;p&gt;
&#32852;&#37030;&#36951;&#24536;&#65306;&#26041;&#27861;&#12289;&#35774;&#35745;&#20934;&#21017;&#21644;&#35780;&#20272;&#25351;&#26631;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Federated Unlearning: A Survey on Methods, Design Guidelines, and Evaluation Metrics. (arXiv:2401.05146v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05146
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#32508;&#36848;&#35770;&#25991;&#20171;&#32461;&#20102;&#32852;&#37030;&#36951;&#24536;&#30340;&#27010;&#24565;&#21644;&#25361;&#25112;&#65292;&#20197;&#21450;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#30340;&#26041;&#27861;&#21644;&#35774;&#35745;&#20934;&#21017;&#65292;&#26088;&#22312;&#20026;&#32852;&#37030;&#23398;&#20064;&#20013;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#21644;&#38450;&#27490;&#24694;&#24847;&#25915;&#20987;&#25552;&#20379;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#20351;&#24471;&#22810;&#20010;&#21442;&#19982;&#26041;&#33021;&#22815;&#21327;&#21516;&#35757;&#32451;&#19968;&#20010;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#20445;&#30041;&#25968;&#25454;&#22312;&#26412;&#22320;&#23384;&#20648;&#65292;&#20174;&#32780;&#32500;&#25252;&#20102;&#29992;&#25143;&#21644;&#26426;&#26500;&#30340;&#38544;&#31169;&#12290;&#19982;&#38598;&#20013;&#21270;&#21407;&#22987;&#25968;&#25454;&#19981;&#21516;&#65292;&#32852;&#37030;&#23398;&#20064;&#36890;&#36807;&#20132;&#25442;&#26412;&#22320;&#20248;&#21270;&#30340;&#27169;&#22411;&#21442;&#25968;&#26469;&#36880;&#27493;&#26500;&#24314;&#20840;&#23616;&#27169;&#22411;&#12290;&#23613;&#31649;&#32852;&#37030;&#23398;&#20064;&#26356;&#21152;&#31526;&#21512;&#26032;&#20852;&#35268;&#23450;&#65292;&#22914;&#27431;&#27954;&#36890;&#29992;&#25968;&#25454;&#20445;&#25252;&#26465;&#20363;&#65288;GDPR&#65289;&#65292;&#20294;&#22312;&#27492;&#32972;&#26223;&#19979;&#30830;&#20445;&#36951;&#24536;&#26435;&#8212;&#8212;&#20801;&#35768;&#32852;&#37030;&#23398;&#20064;&#21442;&#19982;&#26041;&#20174;&#23398;&#20064;&#30340;&#27169;&#22411;&#20013;&#21024;&#38500;&#20182;&#20204;&#30340;&#25968;&#25454;&#36129;&#29486;&#20173;&#28982;&#19981;&#26126;&#30830;&#12290;&#27492;&#22806;&#65292;&#20154;&#20204;&#35748;&#35782;&#21040;&#24694;&#24847;&#23458;&#25143;&#31471;&#21487;&#33021;&#36890;&#36807;&#26356;&#26032;&#23558;&#21518;&#38376;&#27880;&#20837;&#20840;&#23616;&#27169;&#22411;&#65292;&#20363;&#22914;&#23545;&#29305;&#21046;&#25968;&#25454;&#31034;&#20363;&#36827;&#34892;&#38169;&#35823;&#39044;&#27979;&#12290;&#22240;&#27492;&#65292;&#38656;&#35201;&#26426;&#21046;&#26469;&#30830;&#20445;&#20010;&#20154;&#26377;&#21487;&#33021;&#22312;&#32858;&#21512;&#21518;&#31227;&#38500;&#20182;&#20204;&#30340;&#25968;&#25454;&#24182;&#28165;&#38500;&#24694;&#24847;&#36129;&#29486;&#65292;&#32780;&#19981;&#25439;&#23475;&#24050;&#33719;&#24471;&#30340;"&#20840;
&lt;/p&gt;
&lt;p&gt;
Federated Learning (FL) enables collaborative training of a Machine Learning (ML) model across multiple parties, facilitating the preservation of users' and institutions' privacy by keeping data stored locally. Instead of centralizing raw data, FL exchanges locally refined model parameters to build a global model incrementally. While FL is more compliant with emerging regulations such as the European General Data Protection Regulation (GDPR), ensuring the right to be forgotten in this context - allowing FL participants to remove their data contributions from the learned model - remains unclear. In addition, it is recognized that malicious clients may inject backdoors into the global model through updates, e.g. to generate mispredictions on specially crafted data examples. Consequently, there is the need for mechanisms that can guarantee individuals the possibility to remove their data and erase malicious contributions even after aggregation, without compromising the already acquired "g
&lt;/p&gt;</description></item></channel></rss>