<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#36710;&#20869;&#20154;&#26426;&#20132;&#20114;&#30340;&#29616;&#29366;&#21644;&#26032;&#20852;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#20102;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#21253;&#23481;&#24615;HCI&#35774;&#35745;&#21407;&#21017;&#65292;&#26088;&#22312;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#12290;</title><link>http://arxiv.org/abs/2401.14571</link><description>&lt;p&gt;
&#21521;&#21253;&#23481;&#24615;&#39537;&#21160;&#65306;&#37325;&#26032;&#23457;&#35270;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#30340;&#36710;&#20869;&#20132;&#20114;
&lt;/p&gt;
&lt;p&gt;
Driving Towards Inclusion: Revisiting In-Vehicle Interaction in Autonomous Vehicles. (arXiv:2401.14571v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14571
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#36710;&#20869;&#20154;&#26426;&#20132;&#20114;&#30340;&#29616;&#29366;&#21644;&#26032;&#20852;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#20102;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#21253;&#23481;&#24615;HCI&#35774;&#35745;&#21407;&#21017;&#65292;&#26088;&#22312;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#30446;&#21069;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#36710;&#20869;&#20154;&#26426;&#20132;&#20114;&#65288;HCI&#65289;&#30340;&#29616;&#29366;&#65292;&#29305;&#21035;&#20851;&#27880;&#21253;&#23481;&#24615;&#21644;&#21487;&#35775;&#38382;&#24615;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#32771;&#23519;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#21253;&#23481;&#24615;HCI&#30340;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#35774;&#35745;&#21407;&#21017;&#65292;&#35780;&#20272;&#29616;&#26377;HCI&#31995;&#32479;&#65292;&#24182;&#30830;&#23450;&#21487;&#33021;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#30340;&#26032;&#20852;&#25216;&#26415;&#12290;&#26412;&#25991;&#39318;&#20808;&#27010;&#36848;&#20102;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#25216;&#26415;&#30340;&#29616;&#29366;&#65292;&#28982;&#21518;&#23545;&#36825;&#19968;&#32972;&#26223;&#19979;HCI&#30340;&#37325;&#35201;&#24615;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;&#25509;&#19979;&#26469;&#65292;&#26412;&#25991;&#32508;&#36848;&#20102;&#21253;&#23481;&#24615;HCI&#35774;&#35745;&#21407;&#21017;&#30340;&#29616;&#26377;&#25991;&#29486;&#65292;&#24182;&#35780;&#20272;&#20102;&#24403;&#21069;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;HCI&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#12290;&#26412;&#25991;&#36824;&#30830;&#23450;&#20102;&#21487;&#33021;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#30340;&#26032;&#20852;&#25216;&#26415;&#65292;&#22914;&#35821;&#38899;&#28608;&#27963;&#30028;&#38754;&#12289;&#35302;&#35273;&#21453;&#39304;&#31995;&#32479;&#21644;&#22686;&#24378;&#29616;&#23454;&#26174;&#31034;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#24635;&#32467;&#20102;&#30740;&#31350;&#30340;&#37325;&#35201;&#21457;&#29616;&#65292;&#24182;&#35752;&#35770;&#20102;&#26410;&#26469;&#30340;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a comprehensive literature review of the current state of in-vehicle human-computer interaction (HCI) in the context of self-driving vehicles, with a specific focus on inclusion and accessibility. This study's aim is to examine the user-centered design principles for inclusive HCI in self-driving vehicles, evaluate existing HCI systems, and identify emerging technologies that have the potential to enhance the passenger experience. The paper begins by providing an overview of the current state of self-driving vehicle technology, followed by an examination of the importance of HCI in this context. Next, the paper reviews the existing literature on inclusive HCI design principles and evaluates the effectiveness of current HCI systems in self-driving vehicles. The paper also identifies emerging technologies that have the potential to enhance the passenger experience, such as voice-activated interfaces, haptic feedback systems, and augmented reality displays. Finally, th
&lt;/p&gt;</description></item></channel></rss>