<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;PADS&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#25193;&#25955;&#21512;&#25104;&#36807;&#31243;&#23398;&#20064;&#23039;&#21183;&#20808;&#39564;&#65292;&#35299;&#20915;3D&#20154;&#20307;&#23039;&#21183;&#20998;&#26512;&#20013;&#30340;&#21508;&#31181;&#25361;&#25112;&#65292;&#23558;&#22810;&#20010;&#23039;&#21183;&#20998;&#26512;&#20219;&#21153;&#32479;&#19968;&#20026;&#36870;&#38382;&#39064;&#30340;&#23454;&#20363;&#65292;&#39564;&#35777;&#20102;&#20854;&#24615;&#33021;&#21644;&#36866;&#24212;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.08930</link><description>&lt;p&gt;
&#36890;&#36807;&#25193;&#25955;&#21512;&#25104;&#36827;&#34892;3D&#20154;&#20307;&#23039;&#21183;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
3D Human Pose Analysis via Diffusion Synthesis. (arXiv:2401.08930v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08930
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;PADS&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#25193;&#25955;&#21512;&#25104;&#36807;&#31243;&#23398;&#20064;&#23039;&#21183;&#20808;&#39564;&#65292;&#35299;&#20915;3D&#20154;&#20307;&#23039;&#21183;&#20998;&#26512;&#20013;&#30340;&#21508;&#31181;&#25361;&#25112;&#65292;&#23558;&#22810;&#20010;&#23039;&#21183;&#20998;&#26512;&#20219;&#21153;&#32479;&#19968;&#20026;&#36870;&#38382;&#39064;&#30340;&#23454;&#20363;&#65292;&#39564;&#35777;&#20102;&#20854;&#24615;&#33021;&#21644;&#36866;&#24212;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#22312;&#29983;&#25104;&#24314;&#27169;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25104;&#21151;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;PADS&#65288;&#36890;&#36807;&#25193;&#25955;&#21512;&#25104;&#36827;&#34892;&#23039;&#21183;&#20998;&#26512;&#65289;&#30340;&#26032;&#26694;&#26550;&#65292;&#26088;&#22312;&#36890;&#36807;&#19968;&#20010;&#32479;&#19968;&#30340;&#27969;&#31243;&#35299;&#20915;3D&#20154;&#20307;&#23039;&#21183;&#20998;&#26512;&#20013;&#30340;&#21508;&#31181;&#25361;&#25112;&#12290;PADS&#30340;&#26680;&#24515;&#26159;&#20004;&#20010;&#29420;&#29305;&#30340;&#31574;&#30053;&#65306;i&#65289;&#20351;&#29992;&#25193;&#25955;&#21512;&#25104;&#36807;&#31243;&#23398;&#20064;&#19968;&#20010;&#20219;&#21153;&#26080;&#20851;&#30340;&#23039;&#21183;&#20808;&#39564;&#65292;&#20174;&#32780;&#26377;&#25928;&#22320;&#25429;&#25417;&#20154;&#20307;&#23039;&#21183;&#25968;&#25454;&#20013;&#30340;&#36816;&#21160;&#32422;&#26463;&#65307;ii&#65289;&#23558;&#20272;&#35745;&#12289;&#34917;&#20840;&#12289;&#21435;&#22122;&#31561;&#22810;&#20010;&#23039;&#21183;&#20998;&#26512;&#20219;&#21153;&#32479;&#19968;&#20026;&#36870;&#38382;&#39064;&#30340;&#23454;&#20363;&#12290;&#23398;&#20064;&#21040;&#30340;&#23039;&#21183;&#20808;&#39564;&#23558;&#34987;&#35270;&#20026;&#23545;&#20219;&#21153;&#29305;&#23450;&#32422;&#26463;&#30340;&#27491;&#21017;&#21270;&#65292;&#36890;&#36807;&#19968;&#31995;&#21015;&#26465;&#20214;&#21435;&#22122;&#27493;&#39588;&#24341;&#23548;&#20248;&#21270;&#36807;&#31243;&#12290;PADS&#20195;&#34920;&#20102;&#39318;&#20010;&#22522;&#20110;&#25193;&#25955;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#35299;&#20915;&#36870;&#38382;&#39064;&#26694;&#26550;&#20869;&#30340;&#36890;&#29992;3D&#20154;&#20307;&#23039;&#21183;&#20998;&#26512;&#12290;&#20854;&#24615;&#33021;&#24050;&#22312;&#19981;&#21516;&#22522;&#20934;&#27979;&#35797;&#19978;&#24471;&#21040;&#20102;&#39564;&#35777;&#65292;&#26174;&#31034;&#20986;&#20854;&#36866;&#24212;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Diffusion models have demonstrated remarkable success in generative modeling. In this paper, we propose PADS (Pose Analysis by Diffusion Synthesis), a novel framework designed to address various challenges in 3D human pose analysis through a unified pipeline. Central to PADS are two distinctive strategies: i) learning a task-agnostic pose prior using a diffusion synthesis process to effectively capture the kinematic constraints in human pose data, and ii) unifying multiple pose analysis tasks like estimation, completion, denoising, etc, as instances of inverse problems. The learned pose prior will be treated as a regularization imposing on task-specific constraints, guiding the optimization process through a series of conditional denoising steps. PADS represents the first diffusion-based framework for tackling general 3D human pose analysis within the inverse problem framework. Its performance has been validated on different benchmarks, signaling the adaptability and robustness of this
&lt;/p&gt;</description></item></channel></rss>