<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#22238;&#39038;&#20102;&#20540;&#24471;&#20449;&#36182;&#30340;&#20154;&#24037;&#26234;&#33021;&#65288;TAI&#65289;&#21644;&#20854;&#21508;&#31181;&#23450;&#20041;&#65292;&#20027;&#24352;&#19981;&#24212;&#23558;&#8220;&#36127;&#36131;&#20219;&#30340;&#8221;&#25110;&#8220;&#36947;&#24503;&#30340;&#8221;&#20154;&#24037;&#26234;&#33021;&#31561;&#26415;&#35821;&#35270;&#20026;TAI&#30340;&#26367;&#20195;&#65292;&#32780;&#26159;&#25552;&#20513;&#20197;&#20844;&#24179;&#24615;&#12289;&#20559;&#35265;&#12289;&#39118;&#38505;&#12289;&#23433;&#20840;&#24615;&#12289;&#21487;&#35299;&#37322;&#24615;&#21644;&#21487;&#38752;&#24615;&#31561;&#20851;&#38190;&#23646;&#24615;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#35748;&#35782;&#21040;&#22320;&#32536;&#25919;&#27835;&#21644;&#22320;&#29702;&#21407;&#22240;&#23548;&#33268;&#30340;&#20154;&#24037;&#26234;&#33021;&#30417;&#31649;&#24046;&#24322;&#23545;&#36328;&#22269;&#20844;&#21496;&#26500;&#25104;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.15457</link><description>&lt;p&gt;
&#36208;&#21521;&#20540;&#24471;&#20449;&#36182;&#30340;&#20154;&#24037;&#26234;&#33021;&#20043;&#26053;-&#31532;&#19968;&#37096;&#20998;&#65306;&#36861;&#27714;&#21153;&#23454;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
The Journey to Trustworthy AI- Part 1: Pursuit of Pragmatic Frameworks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15457
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22238;&#39038;&#20102;&#20540;&#24471;&#20449;&#36182;&#30340;&#20154;&#24037;&#26234;&#33021;&#65288;TAI&#65289;&#21644;&#20854;&#21508;&#31181;&#23450;&#20041;&#65292;&#20027;&#24352;&#19981;&#24212;&#23558;&#8220;&#36127;&#36131;&#20219;&#30340;&#8221;&#25110;&#8220;&#36947;&#24503;&#30340;&#8221;&#20154;&#24037;&#26234;&#33021;&#31561;&#26415;&#35821;&#35270;&#20026;TAI&#30340;&#26367;&#20195;&#65292;&#32780;&#26159;&#25552;&#20513;&#20197;&#20844;&#24179;&#24615;&#12289;&#20559;&#35265;&#12289;&#39118;&#38505;&#12289;&#23433;&#20840;&#24615;&#12289;&#21487;&#35299;&#37322;&#24615;&#21644;&#21487;&#38752;&#24615;&#31561;&#20851;&#38190;&#23646;&#24615;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#35748;&#35782;&#21040;&#22320;&#32536;&#25919;&#27835;&#21644;&#22320;&#29702;&#21407;&#22240;&#23548;&#33268;&#30340;&#20154;&#24037;&#26234;&#33021;&#30417;&#31649;&#24046;&#24322;&#23545;&#36328;&#22269;&#20844;&#21496;&#26500;&#25104;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22238;&#39038;&#20102;&#20540;&#24471;&#20449;&#36182;&#30340;&#20154;&#24037;&#26234;&#33021;&#65288;TAI&#65289;&#21450;&#20854;&#21508;&#31181;&#23450;&#20041;&#12290;&#32771;&#34385;&#21040;&#20219;&#20309;&#31038;&#20250;&#20013;&#23562;&#37325;&#30340;&#21407;&#21017;&#65292;TAI&#36890;&#24120;&#34987;&#19968;&#20123;&#23646;&#24615;&#25152;&#29305;&#24449;&#65292;&#20854;&#20013;&#19968;&#20123;&#23646;&#24615;&#24050;&#23548;&#33268;&#30417;&#31649;&#25110;&#24037;&#31243;&#32972;&#26223;&#19979;&#30340;&#28151;&#28102;&#12290;&#25105;&#20204;&#21453;&#23545;&#20351;&#29992;&#35832;&#22914;&#8220;&#36127;&#36131;&#20219;&#30340;&#8221;&#25110;&#8220;&#36947;&#24503;&#30340;&#8221;&#20154;&#24037;&#26234;&#33021;&#31561;&#26415;&#35821;&#26469;&#26367;&#20195;TAI&#12290;&#20026;&#20102;&#24110;&#21161;&#28548;&#28165;&#20219;&#20309;&#28151;&#20081;&#65292;&#25105;&#20204;&#24314;&#35758;&#23558;&#23427;&#20204;&#25243;&#22312;&#33041;&#21518;&#12290;&#37492;&#20110;TAI&#22266;&#26377;&#30340;&#20027;&#35266;&#24615;&#21644;&#22797;&#26434;&#24615;&#65292;&#24320;&#21457;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#34987;&#35748;&#20026;&#26159;&#19981;&#21487;&#34892;&#30340;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#20027;&#24352;&#37319;&#21462;&#20197;&#20844;&#24179;&#24615;&#12289;&#20559;&#35265;&#12289;&#39118;&#38505;&#12289;&#23433;&#20840;&#24615;&#12289;&#21487;&#35299;&#37322;&#24615;&#21644;&#21487;&#38752;&#24615;&#31561;&#20851;&#38190;&#23646;&#24615;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#23457;&#35270;&#20102;&#27491;&#22312;&#36827;&#34892;&#30340;&#30417;&#31649;&#29615;&#22659;&#65292;&#37325;&#28857;&#20851;&#27880;&#27431;&#30431;&#12289;&#20013;&#22269;&#21644;&#32654;&#22269;&#30340;&#20513;&#35758;&#12290;&#25105;&#20204;&#35748;&#35782;&#21040;&#65292;&#22522;&#20110;&#22320;&#32536;&#25919;&#27835;&#21644;&#22320;&#29702;&#21407;&#22240;&#32780;&#19981;&#21516;&#30340;&#20154;&#24037;&#26234;&#33021;&#30417;&#31649;&#23545;&#36328;&#22269;&#20844;&#21496;&#26500;&#25104;&#39069;&#22806;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15457v1 Announce Type: cross  Abstract: This paper reviews Trustworthy Artificial Intelligence (TAI) and its various definitions. Considering the principles respected in any society, TAI is often characterized by a few attributes, some of which have led to confusion in regulatory or engineering contexts. We argue against using terms such as Responsible or Ethical AI as substitutes for TAI. And to help clarify any confusion, we suggest leaving them behind. Given the subjectivity and complexity inherent in TAI, developing a universal framework is deemed infeasible. Instead, we advocate for approaches centered on addressing key attributes and properties such as fairness, bias, risk, security, explainability, and reliability. We examine the ongoing regulatory landscape, with a focus on initiatives in the EU, China, and the USA. We recognize that differences in AI regulations based on geopolitical and geographical reasons pose an additional challenge for multinational companies. 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;ChatGPT&#22312;&#33521;&#25991;&#21644;&#20013;&#25991;&#30005;&#23376;&#37038;&#20214;&#25968;&#25454;&#38598;&#20013;&#29992;&#20110;&#22403;&#22334;&#37038;&#20214;&#26816;&#27979;&#30340;&#24615;&#33021;&#65292;&#24182;&#25506;&#35752;&#20102;&#20854;&#22312;&#36825;&#19968;&#39046;&#22495;&#30340;&#28508;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.15537</link><description>&lt;p&gt;
&#35780;&#20272;ChatGPT&#29992;&#20110;&#22403;&#22334;&#37038;&#20214;&#26816;&#27979;&#30340;&#24615;&#33021;
&lt;/p&gt;
&lt;p&gt;
Evaluating the Performance of ChatGPT for Spam Email Detection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15537
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;ChatGPT&#22312;&#33521;&#25991;&#21644;&#20013;&#25991;&#30005;&#23376;&#37038;&#20214;&#25968;&#25454;&#38598;&#20013;&#29992;&#20110;&#22403;&#22334;&#37038;&#20214;&#26816;&#27979;&#30340;&#24615;&#33021;&#65292;&#24182;&#25506;&#35752;&#20102;&#20854;&#22312;&#36825;&#19968;&#39046;&#22495;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#23376;&#37038;&#20214;&#32487;&#32493;&#26159;&#19987;&#19994;&#21644;&#21830;&#19994;&#39046;&#22495;&#20013;&#33267;&#20851;&#37325;&#35201;&#19988;&#24191;&#27867;&#20351;&#29992;&#30340;&#36890;&#20449;&#23186;&#20171;&#12290;&#28982;&#32780;&#65292;&#22403;&#22334;&#37038;&#20214;&#30340;&#26222;&#21450;&#32473;&#29992;&#25143;&#24102;&#26469;&#20102;&#37325;&#22823;&#25361;&#25112;&#65292;&#25200;&#20081;&#20102;&#20182;&#20204;&#30340;&#26085;&#24120;&#24037;&#20316;&#24182;&#38477;&#20302;&#20102;&#29983;&#20135;&#29575;&#12290;&#22240;&#27492;&#65292;&#22522;&#20110;&#20869;&#23481;&#20934;&#30830;&#22320;&#35782;&#21035;&#21644;&#36807;&#28388;&#22403;&#22334;&#37038;&#20214;&#23545;&#32593;&#32476;&#23433;&#20840;&#33267;&#20851;&#37325;&#35201;&#12290;&#26368;&#36817;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#39046;&#22495;&#30340;&#21457;&#23637;&#65292;&#29305;&#21035;&#26159;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22914;ChatGPT&#65292;&#22312;&#35832;&#22914;&#38382;&#31572;&#21644;&#25991;&#26412;&#29983;&#25104;&#31561;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#33394;&#12290;&#28982;&#32780;&#65292;&#20854;&#22312;&#22403;&#22334;&#37038;&#20214;&#35782;&#21035;&#26041;&#38754;&#30340;&#28508;&#21147;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#25506;&#32034;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#26412;&#30740;&#31350;&#23581;&#35797;&#35780;&#20272;ChatGPT&#22312;&#33521;&#25991;&#21644;&#20013;&#25991;&#30005;&#23376;&#37038;&#20214;&#25968;&#25454;&#38598;&#20013;&#29992;&#20110;&#22403;&#22334;&#37038;&#20214;&#35782;&#21035;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#21033;&#29992;ChatGPT&#36827;&#34892;&#22403;&#22334;&#37038;&#20214;&#26816;&#27979;&#65292;&#37319;&#29992;&#19978;&#19979;&#25991;&#23398;&#20064;&#65292;&#38656;&#35201;&#25552;&#31034;&#35828;&#26126;&#21644;&#23569;&#37327;&#31034;&#33539;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15537v1 Announce Type: cross  Abstract: Email continues to be a pivotal and extensively utilized communication medium within professional and commercial domains. Nonetheless, the prevalence of spam emails poses a significant challenge for users, disrupting their daily routines and diminishing productivity. Consequently, accurately identifying and filtering spam based on content has become crucial for cybersecurity. Recent advancements in natural language processing, particularly with large language models like ChatGPT, have shown remarkable performance in tasks such as question answering and text generation. However, its potential in spam identification remains underexplored. To fill in the gap, this study attempts to evaluate ChatGPT's capabilities for spam identification in both English and Chinese email datasets. We employ ChatGPT for spam email detection using in-context learning, which requires a prompt instruction and a few demonstrations. We also investigate how the t
&lt;/p&gt;</description></item></channel></rss>