<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21407;&#21017;&#24615;&#21644;&#31995;&#32479;&#21270;&#30340;&#35780;&#20272;&#26694;&#26550;&#26469;&#35780;&#20272;&#34920;&#26684;&#25968;&#25454;&#21512;&#25104;&#31639;&#27861;&#65292;&#21253;&#25324;&#20445;&#30495;&#24230;&#12289;&#38544;&#31169;&#24615;&#21644;&#23454;&#29992;&#24615;&#31561;&#26032;&#25351;&#26631;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#35780;&#20272;&#25351;&#26631;&#30340;&#38480;&#21046;&#12290;&#36890;&#36807;&#36825;&#20010;&#26694;&#26550;&#65292;&#23545;&#19981;&#21516;&#31639;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#21644;&#24635;&#32467;&#12290;</title><link>https://arxiv.org/abs/2402.06806</link><description>&lt;p&gt;
&#20851;&#20110;&#34920;&#26684;&#25968;&#25454;&#21512;&#25104;&#31639;&#27861;&#30340;&#21407;&#21017;&#24615;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Towards Principled Assessment of Tabular Data Synthesis Algorithms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21407;&#21017;&#24615;&#21644;&#31995;&#32479;&#21270;&#30340;&#35780;&#20272;&#26694;&#26550;&#26469;&#35780;&#20272;&#34920;&#26684;&#25968;&#25454;&#21512;&#25104;&#31639;&#27861;&#65292;&#21253;&#25324;&#20445;&#30495;&#24230;&#12289;&#38544;&#31169;&#24615;&#21644;&#23454;&#29992;&#24615;&#31561;&#26032;&#25351;&#26631;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#35780;&#20272;&#25351;&#26631;&#30340;&#38480;&#21046;&#12290;&#36890;&#36807;&#36825;&#20010;&#26694;&#26550;&#65292;&#23545;&#19981;&#21516;&#31639;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#21644;&#24635;&#32467;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#21512;&#25104;&#34987;&#35748;&#20026;&#26159;&#19968;&#31181;&#21033;&#29992;&#25968;&#25454;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#30340;&#37325;&#35201;&#26041;&#27861;&#12290;&#24050;&#32463;&#25552;&#20986;&#20102;&#22823;&#37327;&#30340;&#34920;&#26684;&#25968;&#25454;&#21512;&#25104;&#31639;&#27861;&#65288;&#25105;&#20204;&#31216;&#20043;&#20026;&#21512;&#25104;&#22120;&#65289;&#12290;&#19968;&#20123;&#21512;&#25104;&#22120;&#28385;&#36275;&#24046;&#20998;&#38544;&#31169;&#65292;&#32780;&#20854;&#20182;&#19968;&#20123;&#21017;&#26088;&#22312;&#20197;&#21551;&#21457;&#24335;&#30340;&#26041;&#24335;&#25552;&#20379;&#38544;&#31169;&#20445;&#25252;&#12290;&#30001;&#20110;&#32570;&#20047;&#21407;&#21017;&#24615;&#35780;&#20272;&#25351;&#26631;&#20197;&#21450;&#23545;&#21033;&#29992;&#25193;&#25955;&#27169;&#22411;&#21644;&#26368;&#26032;&#30340;&#22522;&#20110;&#36793;&#38469;&#30340;&#21512;&#25104;&#22120;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#38754;&#23545;&#38754;&#27604;&#36739;&#30340;&#26032;&#24320;&#21457;&#30340;&#21512;&#25104;&#22120;&#30340;&#29702;&#35299;&#23578;&#19981;&#20840;&#38754;&#65292;&#23545;&#36825;&#20123;&#21512;&#25104;&#22120;&#30340;&#20248;&#21183;&#21644;&#24369;&#28857;&#30340;&#20840;&#38754;&#20102;&#35299;&#20173;&#28982;&#38590;&#20197;&#23454;&#29616;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21407;&#21017;&#24615;&#21644;&#31995;&#32479;&#21270;&#30340;&#35780;&#20272;&#26694;&#26550;&#26469;&#35780;&#20272;&#34920;&#26684;&#25968;&#25454;&#21512;&#25104;&#31639;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#26816;&#26597;&#21644;&#25209;&#35780;&#29616;&#26377;&#30340;&#35780;&#20272;&#25351;&#26631;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#32452;&#26032;&#30340;&#25351;&#26631;&#65292;&#20197;&#35299;&#20915;&#20854;&#38480;&#21046;&#65292;&#21253;&#25324;&#20445;&#30495;&#24230;&#12289;&#38544;&#31169;&#24615;&#21644;&#23454;&#29992;&#24615;&#12290;&#22522;&#20110;&#25552;&#20986;&#30340;&#25351;&#26631;&#65292;&#25105;&#20204;&#36824;&#35774;&#35745;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#35780;&#20272;&#32452;&#32455;&#26694;&#26550;&#65292;&#20197;&#23545;&#19981;&#21516;&#31639;&#27861;&#36827;&#34892;&#35780;&#20272;&#24182;&#36827;&#34892;&#27604;&#36739;&#21644;&#24635;&#32467;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data synthesis has been advocated as an important approach for utilizing data while protecting data privacy. A large number of tabular data synthesis algorithms (which we call synthesizers) have been proposed. Some synthesizers satisfy Differential Privacy, while others aim to provide privacy in a heuristic fashion. A comprehensive understanding of the strengths and weaknesses of these synthesizers remains elusive due to lacking principled evaluation metrics and missing head-to-head comparisons of newly developed synthesizers that take advantage of diffusion models and large language models with state-of-the-art marginal-based synthesizers.   In this paper, we present a principled and systematic evaluation framework for assessing tabular data synthesis algorithms. Specifically, we examine and critique existing evaluation metrics, and introduce a set of new metrics in terms of fidelity, privacy, and utility to address their limitations. Based on the proposed metrics, we also devise a un
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#22312;&#25918;&#23485;&#26465;&#20214;&#19979;&#30340;&#20998;&#21306;&#20998;&#31867;&#26041;&#27861;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#25552;&#20986;&#20102;&#32477;&#23545;&#36830;&#32493;&#20998;&#37327;&#30340;&#26032;&#29305;&#24615;&#65292;&#35745;&#31639;&#20102;&#20998;&#31867;&#38169;&#35823;&#27010;&#29575;&#30340;&#31934;&#30830;&#25910;&#25947;&#29575;</title><link>https://arxiv.org/abs/2312.14889</link><description>&lt;p&gt;
&#35770;&#20174;&#21487;&#35266;&#27979;&#21644;&#31169;&#23494;&#25968;&#25454;&#20013;&#23454;&#29616;&#36895;&#29575;&#26368;&#20248;&#20998;&#21306;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
On Rate-Optimal Partitioning Classification from Observable and from Privatised Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.14889
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#25918;&#23485;&#26465;&#20214;&#19979;&#30340;&#20998;&#21306;&#20998;&#31867;&#26041;&#27861;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#25552;&#20986;&#20102;&#32477;&#23545;&#36830;&#32493;&#20998;&#37327;&#30340;&#26032;&#29305;&#24615;&#65292;&#35745;&#31639;&#20102;&#20998;&#31867;&#38169;&#35823;&#27010;&#29575;&#30340;&#31934;&#30830;&#25910;&#25947;&#29575;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#20998;&#21306;&#20998;&#31867;&#30340;&#32463;&#20856;&#26041;&#27861;&#65292;&#24182;&#30740;&#31350;&#20102;&#22312;&#25918;&#23485;&#26465;&#20214;&#19979;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#21253;&#25324;&#21487;&#35266;&#27979;&#65288;&#38750;&#31169;&#23494;&#65289;&#21644;&#31169;&#23494;&#25968;&#25454;&#12290;&#25105;&#20204;&#20551;&#35774;&#29305;&#24449;&#21521;&#37327;$X$&#21462;&#20540;&#20110;$\mathbb{R}^d$&#65292;&#20854;&#26631;&#31614;&#20026;$Y$&#12290;&#20043;&#21069;&#20851;&#20110;&#20998;&#21306;&#20998;&#31867;&#22120;&#30340;&#32467;&#26524;&#22522;&#20110;&#24378;&#23494;&#24230;&#20551;&#35774;&#65292;&#36825;&#31181;&#20551;&#35774;&#38480;&#21046;&#36739;&#22823;&#65292;&#25105;&#20204;&#36890;&#36807;&#31616;&#21333;&#30340;&#20363;&#23376;&#21152;&#20197;&#35777;&#26126;&#12290;&#25105;&#20204;&#20551;&#35774;$X$&#30340;&#20998;&#24067;&#26159;&#32477;&#23545;&#36830;&#32493;&#20998;&#24067;&#21644;&#31163;&#25955;&#20998;&#24067;&#30340;&#28151;&#21512;&#20307;&#65292;&#20854;&#20013;&#32477;&#23545;&#36830;&#32493;&#20998;&#37327;&#38598;&#20013;&#20110;&#19968;&#20010;$d_a$&#32500;&#23376;&#31354;&#38388;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#22312;&#26356;&#23485;&#26494;&#30340;&#26465;&#20214;&#19979;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#65306;&#38500;&#20102;&#26631;&#20934;&#30340;Lipschitz&#21644;&#36793;&#38469;&#26465;&#20214;&#22806;&#65292;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#32477;&#23545;&#36830;&#32493;&#20998;&#37327;&#30340;&#19968;&#20010;&#26032;&#29305;&#24615;&#65292;&#36890;&#36807;&#35813;&#29305;&#24615;&#35745;&#31639;&#20102;&#20998;&#31867;&#38169;&#35823;&#27010;&#29575;&#30340;&#31934;&#30830;&#25910;&#25947;&#29575;&#65292;&#23545;&#20110;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.14889v2 Announce Type: replace-cross  Abstract: In this paper we revisit the classical method of partitioning classification and study its convergence rate under relaxed conditions, both for observable (non-privatised) and for privatised data. Let the feature vector $X$ take values in $\mathbb{R}^d$ and denote its label by $Y$. Previous results on the partitioning classifier worked with the strong density assumption, which is restrictive, as we demonstrate through simple examples. We assume that the distribution of $X$ is a mixture of an absolutely continuous and a discrete distribution, such that the absolutely continuous component is concentrated to a $d_a$ dimensional subspace. Here, we study the problem under much milder assumptions: in addition to the standard Lipschitz and margin conditions, a novel characteristic of the absolutely continuous component is introduced, by which the exact convergence rate of the classification error probability is calculated, both for the
&lt;/p&gt;</description></item></channel></rss>