<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#35821;&#35328;&#27169;&#22411;&#20013;&#24207;&#21015;&#22270;&#30340;&#23454;&#29616;&#21644;&#27495;&#20041;&#38382;&#39064;&#65292;&#36890;&#36807;&#32452;&#21512;&#21644;&#35745;&#31639;&#30340;&#26041;&#27861;&#32771;&#34385;&#20102;&#22270;&#30340;&#31383;&#21475;&#22823;&#23567;&#12289;&#26041;&#21521;&#24615;&#21644;&#26435;&#37325;&#31561;&#22240;&#32032;&#65292;&#24182;&#25552;&#20379;&#20102;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#26469;&#35299;&#20915;&#23454;&#29616;&#21644;&#26522;&#20030;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.08830</link><description>&lt;p&gt;
&#24207;&#21015;&#22270;&#23454;&#29616;&#19982;&#35821;&#35328;&#27169;&#22411;&#20013;&#30340;&#27495;&#20041;
&lt;/p&gt;
&lt;p&gt;
Sequence graphs realizations and ambiguity in language models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08830
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#35821;&#35328;&#27169;&#22411;&#20013;&#24207;&#21015;&#22270;&#30340;&#23454;&#29616;&#21644;&#27495;&#20041;&#38382;&#39064;&#65292;&#36890;&#36807;&#32452;&#21512;&#21644;&#35745;&#31639;&#30340;&#26041;&#27861;&#32771;&#34385;&#20102;&#22270;&#30340;&#31383;&#21475;&#22823;&#23567;&#12289;&#26041;&#21521;&#24615;&#21644;&#26435;&#37325;&#31561;&#22240;&#32032;&#65292;&#24182;&#25552;&#20379;&#20102;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#26469;&#35299;&#20915;&#23454;&#29616;&#21644;&#26522;&#20030;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20960;&#31181;&#27969;&#34892;&#30340;&#35821;&#35328;&#27169;&#22411;&#23558;&#36755;&#20837;&#25991;&#26412;&#20013;&#30340;&#23616;&#37096;&#19978;&#19979;&#25991;&#34920;&#31034;&#20026;&#35789;&#34955;&#12290;&#36825;&#26679;&#30340;&#34920;&#31034;&#33258;&#28982;&#22320;&#36890;&#36807;&#19968;&#20010;&#24207;&#21015;&#22270;&#26469;&#32534;&#30721;&#65292;&#20854;&#20013;&#39030;&#28857;&#26159;&#20986;&#29616;&#22312;&#36755;&#20837;&#25991;&#26412;&#20013;&#30340;&#19981;&#21516;&#35789;&#65292;&#36793;&#34920;&#31034;&#22312;&#22823;&#23567;&#20026;w&#30340;&#28369;&#21160;&#31383;&#21475;&#20869;&#20004;&#20010;&#35789;&#30340;&#65288;&#26377;&#24207;&#65289;&#20849;&#29616;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#21387;&#32553;&#34920;&#31034;&#36890;&#24120;&#19981;&#26159;&#21452;&#23556;&#30340;&#65292;&#21487;&#33021;&#24341;&#20837;&#19968;&#23450;&#31243;&#24230;&#30340;&#27495;&#20041;&#12290;&#19968;&#20123;&#24207;&#21015;&#22270;&#21487;&#33021;&#20197;&#22810;&#31181;&#26041;&#24335;&#23454;&#29616;&#20026;&#19968;&#20010;&#24207;&#21015;&#65292;&#32780;&#20854;&#20182;&#19968;&#20123;&#21487;&#33021;&#26080;&#27861;&#23454;&#29616;&#20219;&#20309;&#24207;&#21015;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20174;&#32452;&#21512;&#21644;&#35745;&#31639;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#24207;&#21015;&#22270;&#30340;&#21487;&#23454;&#29616;&#24615;&#21644;&#27495;&#20041;&#12290;&#25105;&#20204;&#32771;&#34385;&#22312;&#22810;&#31181;&#35774;&#32622;&#19979;&#30340;&#24207;&#21015;&#22270;&#23454;&#29616;&#30340;&#23384;&#22312;&#21644;&#26522;&#20030;&#65306;&#31383;&#21475;&#22823;&#23567;w&#12289;&#22270;&#30340;&#26041;&#21521;&#24615;&#30340;&#23384;&#22312;/&#32570;&#22833;&#21644;&#26435;&#37325;&#65288;&#37325;&#22797;&#24615;&#65289;&#30340;&#23384;&#22312;/&#32570;&#22833;&#12290;&#24403;w = 2&#26102;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#26469;&#23454;&#29616;&#21644;&#26522;&#20030;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08830v1 Announce Type: cross Abstract: Several popular language models represent local contexts in an input text as bags of words. Such representations are naturally encoded by a sequence graph whose vertices are the distinct words occurring in x, with edges representing the (ordered) co-occurrence of two words within a sliding window of size w. However, this compressed representation is not generally bijective, and may introduce some degree of ambiguity. Some sequence graphs may admit several realizations as a sequence, while others may not admit any realization. In this paper, we study the realizability and ambiguity of sequence graphs from a combinatorial and computational point of view. We consider the existence and enumeration of realizations of a sequence graph under multiple settings: window size w, presence/absence of graph orientation, and presence/absence of weights (multiplicities). When w = 2, we provide polynomial time algorithms for realizability and enumeratio
&lt;/p&gt;</description></item></channel></rss>