<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#25991;&#36890;&#36807;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#21644;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#65292;&#22635;&#34917;&#20102;&#20379;&#24212;&#38142;&#39118;&#38505;&#35780;&#20272;&#20013;&#26032;&#20852;&#20154;&#24037;&#26234;&#33021;/&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30340;&#30740;&#31350;&#31354;&#30333;&#65292;&#20026;&#20102;&#35299;&#36825;&#20123;&#25216;&#26415;&#22312;&#23454;&#36341;&#20013;&#30340;&#23454;&#38469;&#24433;&#21709;&#25552;&#20379;&#20102;&#20851;&#38190;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2401.10895</link><description>&lt;p&gt;
&#20379;&#24212;&#38142;&#39118;&#38505;&#35780;&#20272;&#20013;&#30340;&#20154;&#24037;&#26234;&#33021;&#65306;&#19968;&#39033;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#21644;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
AI in Supply Chain Risk Assessment: A Systematic Literature Review and Bibliometric Analysis. (arXiv:2401.10895v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10895
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#21644;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#65292;&#22635;&#34917;&#20102;&#20379;&#24212;&#38142;&#39118;&#38505;&#35780;&#20272;&#20013;&#26032;&#20852;&#20154;&#24037;&#26234;&#33021;/&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30340;&#30740;&#31350;&#31354;&#30333;&#65292;&#20026;&#20102;&#35299;&#36825;&#20123;&#25216;&#26415;&#22312;&#23454;&#36341;&#20013;&#30340;&#23454;&#38469;&#24433;&#21709;&#25552;&#20379;&#20102;&#20851;&#38190;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25972;&#21512;&#20154;&#24037;&#26234;&#33021;&#21644;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#20379;&#24212;&#38142;&#39118;&#38505;&#35780;&#20272;(SCRA)&#32463;&#21382;&#20102;&#28145;&#21051;&#30340;&#28436;&#21464;&#65292;&#38761;&#26032;&#20102;&#39044;&#27979;&#33021;&#21147;&#21644;&#39118;&#38505;&#32531;&#35299;&#31574;&#30053;&#12290;&#36825;&#31181;&#28436;&#21464;&#30340;&#37325;&#35201;&#24615;&#22312;&#20110;&#22312;&#29616;&#20195;&#20379;&#24212;&#38142;&#20013;&#30830;&#20445;&#36816;&#33829;&#30340;&#38887;&#24615;&#21644;&#36830;&#32493;&#24615;&#65292;&#38656;&#35201;&#31283;&#20581;&#30340;&#39118;&#38505;&#31649;&#29702;&#31574;&#30053;&#12290;&#20197;&#24448;&#30340;&#32508;&#36848;&#24050;&#32463;&#27010;&#36848;&#20102;&#24050;&#24314;&#31435;&#30340;&#26041;&#27861;&#65292;&#20294;&#24573;&#35270;&#20102;&#26032;&#20852;&#30340;&#20154;&#24037;&#26234;&#33021;/&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#22312;&#29702;&#35299;&#20854;&#22312;SCRA&#20013;&#30340;&#23454;&#38469;&#24433;&#21709;&#26041;&#38754;&#23384;&#22312;&#26126;&#26174;&#30340;&#30740;&#31350;&#31354;&#30333;&#12290;&#26412;&#25991;&#36827;&#34892;&#20102;&#31995;&#32479;&#30340;&#25991;&#29486;&#32508;&#36848;&#65292;&#24182;&#32467;&#21512;&#20102;&#20840;&#38754;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#12290;&#25105;&#20204;&#20180;&#32454;&#30740;&#31350;&#20102;1717&#31687;&#35770;&#25991;&#65292;&#24182;&#20174;2014&#24180;&#33267;2023&#24180;&#20043;&#38388;&#21457;&#34920;&#30340;48&#31687;&#25991;&#31456;&#20013;&#33719;&#24471;&#20102;&#20851;&#38190;&#35265;&#35299;&#12290;&#35813;&#32508;&#36848;&#22635;&#34917;&#20102;&#36825;&#19968;&#30740;&#31350;&#31354;&#30333;&#65292;&#36890;&#36807;&#22238;&#31572;&#20851;&#38190;&#30740;&#31350;&#38382;&#39064;&#65292;&#25506;&#31350;&#20102;&#29616;&#26377;&#30340;&#20154;&#24037;&#26234;&#33021;/&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#12289;&#26041;&#27861;&#35770;&#12289;&#30740;&#31350;&#32467;&#26524;&#21644;&#26410;&#26469;&#21457;&#23637;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
Supply chain risk assessment (SCRA) has witnessed a profound evolution through the integration of artificial intelligence (AI) and machine learning (ML) techniques, revolutionizing predictive capabilities and risk mitigation strategies. The significance of this evolution stems from the critical role of robust risk management strategies in ensuring operational resilience and continuity within modern supply chains. Previous reviews have outlined established methodologies but have overlooked emerging AI/ML techniques, leaving a notable research gap in understanding their practical implications within SCRA. This paper conducts a systematic literature review combined with a comprehensive bibliometric analysis. We meticulously examined 1,717 papers and derived key insights from a select group of 48 articles published between 2014 and 2023. The review fills this research gap by addressing pivotal research questions, and exploring existing AI/ML techniques, methodologies, findings, and future 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#26102;&#35757;&#32451;&#22522;&#20110;&#29289;&#29702;&#20449;&#24687;&#30340;&#31070;&#32463;&#32593;&#32476;&#65288;PINN&#65289;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#35299;&#20915;Navier-Stokes&#26041;&#31243;&#65292;&#20197;&#23454;&#29616;&#36229;&#24555;&#36895;&#36229;&#22768;&#34880;&#27969;&#25104;&#20687;&#12290;&#35813;&#26694;&#26550;&#23558;Navier-Stokes&#26041;&#31243;&#31163;&#25955;&#21270;&#20026;&#31283;&#24577;&#65292;&#24182;&#36890;&#36807;&#36801;&#31227;&#23398;&#20064;&#39034;&#24207;&#27714;&#35299;&#31283;&#24577;&#26041;&#31243;&#12290;&#27492;&#22806;&#65292;&#37319;&#29992;&#24179;&#22343;&#24658;&#23450;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#20316;&#20026;&#21021;&#22987;&#21270;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#35757;&#32451;&#26041;&#26696;&#65292;&#36866;&#29992;&#20110;&#25152;&#26377;&#26102;&#38388;&#25139;&#12290;</title><link>http://arxiv.org/abs/2309.04755</link><description>&lt;p&gt;
&#23454;&#26102;&#35757;&#32451;&#22522;&#20110;&#29289;&#29702;&#20449;&#24687;&#30340;&#31070;&#32463;&#32593;&#32476;&#65306;&#36229;&#24555;&#36895;&#36229;&#22768;&#34880;&#27969;&#25104;&#20687;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Towards Real-time Training of Physics-informed Neural Networks: Applications in Ultrafast Ultrasound Blood Flow Imaging. (arXiv:2309.04755v1 [cs.CE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04755
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#26102;&#35757;&#32451;&#22522;&#20110;&#29289;&#29702;&#20449;&#24687;&#30340;&#31070;&#32463;&#32593;&#32476;&#65288;PINN&#65289;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#35299;&#20915;Navier-Stokes&#26041;&#31243;&#65292;&#20197;&#23454;&#29616;&#36229;&#24555;&#36895;&#36229;&#22768;&#34880;&#27969;&#25104;&#20687;&#12290;&#35813;&#26694;&#26550;&#23558;Navier-Stokes&#26041;&#31243;&#31163;&#25955;&#21270;&#20026;&#31283;&#24577;&#65292;&#24182;&#36890;&#36807;&#36801;&#31227;&#23398;&#20064;&#39034;&#24207;&#27714;&#35299;&#31283;&#24577;&#26041;&#31243;&#12290;&#27492;&#22806;&#65292;&#37319;&#29992;&#24179;&#22343;&#24658;&#23450;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#20316;&#20026;&#21021;&#22987;&#21270;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#35757;&#32451;&#26041;&#26696;&#65292;&#36866;&#29992;&#20110;&#25152;&#26377;&#26102;&#38388;&#25139;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#29289;&#29702;&#20449;&#24687;&#30340;&#31070;&#32463;&#32593;&#32476;&#65288;PINN&#65289;&#26159;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#26041;&#31243;&#30340;&#26368;&#26480;&#20986;&#27714;&#35299;&#22120;&#20043;&#19968;&#65292;&#32780;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#26041;&#31243;&#24191;&#27867;&#24212;&#29992;&#20110;&#34880;&#27969;&#30340;&#25511;&#21046;&#26041;&#31243;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#30340;&#26041;&#27861;&#20165;&#20381;&#36182;&#20110;&#23436;&#25972;&#30340;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#26041;&#31243;&#65292;&#23545;&#20110;&#36229;&#24555;&#36895;&#22810;&#26222;&#21202;&#36229;&#22768;&#65292;&#36825;&#19968;&#26368;&#26032;&#25216;&#26415;&#24212;&#29992;&#20110;\emph{&#20307;&#20869;}&#22797;&#26434;&#34880;&#27969;&#21160;&#21147;&#23398;&#30340;&#23637;&#31034;&#65292;&#27599;&#31186;&#33719;&#21462;&#25968;&#21315;&#24103;&#65288;&#25110;&#26102;&#38388;&#25139;&#65289;&#65292;&#36825;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#12290;&#26412;&#25991;&#39318;&#20808;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;PINN&#35757;&#32451;&#26694;&#26550;&#65292;&#36890;&#36807;&#23558;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#26041;&#31243;&#31163;&#25955;&#21270;&#20026;&#31283;&#24577;&#65292;&#24182;&#36890;&#36807;&#36801;&#31227;&#23398;&#20064;&#39034;&#24207;&#27714;&#35299;&#31283;&#24577;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#26041;&#31243;&#65292;&#20026;&#35299;&#20915;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#26041;&#31243;&#25552;&#20379;&#20102;&#26032;&#30340;&#35757;&#32451;&#26694;&#26550;&#65292;&#31216;&#20026;SeqPINN&#12290;&#22312;SeqPINN&#30340;&#25104;&#21151;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#24179;&#22343;&#24658;&#23450;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#65288;SGD&#65289;&#20316;&#20026;&#21021;&#22987;&#21270;&#30340;&#24605;&#24819;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#35757;&#32451;&#26041;&#26696;&#65292;&#36866;&#29992;&#20110;&#25152;&#26377;&#26102;&#38388;&#25139;&#12290;&#20026;&#20102;&#30830;&#20445;&#33391;&#22909;&#30340;&#27867;&#21270;&#21021;&#22987;&#21270;&#65292;&#25105;&#20204;&#20511;&#37492;&#20102;
&lt;/p&gt;
&lt;p&gt;
Physics-informed Neural Network (PINN) is one of the most preeminent solvers of Navier-Stokes equations, which are widely used as the governing equation of blood flow. However, current approaches, relying on full Navier-Stokes equations, are impractical for ultrafast Doppler ultrasound, the state-of-the-art technique for depiction of complex blood flow dynamics \emph{in vivo} through acquired thousands of frames (or, timestamps) per second. In this article, we first propose a novel training framework of PINN for solving Navier-Stokes equations by discretizing Navier-Stokes equations into steady state and sequentially solving steady-state Navier-Stokes equations with transfer learning. The novel training framework is coined as SeqPINN. Upon the success of SeqPINN, we adopt the idea of averaged constant stochastic gradient descent (SGD) as initialization and propose a parallel training scheme for all timestamps. To ensure an initialization that generalizes well, we borrow the concept of 
&lt;/p&gt;</description></item></channel></rss>