<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;BA-SGCL&#30340;&#40065;&#26834;SGNN&#26694;&#26550;&#65292;&#36890;&#36807;&#32467;&#21512;&#22270;&#23545;&#27604;&#23398;&#20064;&#21407;&#21017;&#21644;&#24179;&#34913;&#22686;&#24378;&#25216;&#26415;&#65292;&#35299;&#20915;&#20102;&#24102;&#31526;&#21495;&#22270;&#23545;&#25239;&#24615;&#25915;&#20987;&#20013;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#19981;&#21487;&#36870;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.10590</link><description>&lt;p&gt;
Adversarially Robust Signed Graph Contrastive Learning from Balance Augmentation&#65288;&#20174;&#24179;&#34913;&#22686;&#24378;&#20013;&#25552;&#21462;&#23545;&#25239;&#24615;&#40065;&#26834;&#30340;&#24102;&#31526;&#21495;&#22270;&#23545;&#27604;&#23398;&#20064;&#65289;
&lt;/p&gt;
&lt;p&gt;
Adversarially Robust Signed Graph Contrastive Learning from Balance Augmentation. (arXiv:2401.10590v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10590
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;BA-SGCL&#30340;&#40065;&#26834;SGNN&#26694;&#26550;&#65292;&#36890;&#36807;&#32467;&#21512;&#22270;&#23545;&#27604;&#23398;&#20064;&#21407;&#21017;&#21644;&#24179;&#34913;&#22686;&#24378;&#25216;&#26415;&#65292;&#35299;&#20915;&#20102;&#24102;&#31526;&#21495;&#22270;&#23545;&#25239;&#24615;&#25915;&#20987;&#20013;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#19981;&#21487;&#36870;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24102;&#31526;&#21495;&#22270;&#30001;&#36793;&#21644;&#31526;&#21495;&#32452;&#25104;&#65292;&#21487;&#20197;&#20998;&#20026;&#32467;&#26500;&#20449;&#24687;&#21644;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#12290;&#29616;&#26377;&#30340;&#24102;&#31526;&#21495;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;SGNN&#65289;&#36890;&#24120;&#20381;&#36182;&#20110;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#26469;&#29983;&#25104;&#23884;&#20837;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#23545;&#25239;&#24615;&#25915;&#20987;&#23545;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#20135;&#29983;&#20102;&#19981;&#21033;&#24433;&#21709;&#12290;&#31867;&#20284;&#20110;&#32467;&#26500;&#23398;&#20064;&#21487;&#20197;&#24674;&#22797;&#26080;&#31526;&#21495;&#22270;&#65292;&#36890;&#36807;&#25913;&#36827;&#34987;&#27745;&#26579;&#22270;&#30340;&#24179;&#34913;&#24230;&#65292;&#21487;&#20197;&#23558;&#24179;&#34913;&#23398;&#20064;&#24212;&#29992;&#20110;&#24102;&#31526;&#21495;&#22270;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#26041;&#27861;&#38754;&#20020;&#30528;&#8220;&#24179;&#34913;&#30456;&#20851;&#20449;&#24687;&#30340;&#19981;&#21487;&#36870;&#24615;&#8221;&#25361;&#25112;-&#23613;&#31649;&#24179;&#34913;&#24230;&#24471;&#21040;&#25913;&#21892;&#65292;&#20294;&#24674;&#22797;&#30340;&#36793;&#21487;&#33021;&#19981;&#26159;&#26368;&#21021;&#21463;&#21040;&#25915;&#20987;&#24433;&#21709;&#30340;&#36793;&#65292;&#23548;&#33268;&#38450;&#24481;&#25928;&#26524;&#24046;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#40065;&#26834;&#30340;SGNN&#26694;&#26550;&#65292;&#31216;&#20026;&#24179;&#34913;&#22686;&#24378;&#24102;&#31526;&#21495;&#22270;&#23545;&#27604;&#23398;&#20064;&#65288;BA-SGCL&#65289;&#65292;&#23427;&#23558;&#22270;&#23545;&#27604;&#23398;&#20064;&#21407;&#21017;&#19982;&#24179;&#34913;&#22686;&#24378;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Signed graphs consist of edges and signs, which can be separated into structural information and balance-related information, respectively. Existing signed graph neural networks (SGNNs) typically rely on balance-related information to generate embeddings. Nevertheless, the emergence of recent adversarial attacks has had a detrimental impact on the balance-related information. Similar to how structure learning can restore unsigned graphs, balance learning can be applied to signed graphs by improving the balance degree of the poisoned graph. However, this approach encounters the challenge "Irreversibility of Balance-related Information" - while the balance degree improves, the restored edges may not be the ones originally affected by attacks, resulting in poor defense effectiveness. To address this challenge, we propose a robust SGNN framework called Balance Augmented-Signed Graph Contrastive Learning (BA-SGCL), which combines Graph Contrastive Learning principles with balance augmentati
&lt;/p&gt;</description></item></channel></rss>