<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#26550;&#26500;&#20013;&#23454;&#29616;&#38544;&#31169;&#21644;&#40065;&#26834;&#24615;&#30340;&#25104;&#26412;&#65292;&#25351;&#20986;&#25972;&#21512;&#36825;&#20004;&#20010;&#30446;&#26631;&#20250;&#29306;&#29298;&#35745;&#31639;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2312.14712</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#40065;&#26834;&#24615;&#12289;&#25928;&#29575;&#25110;&#38544;&#31169;&#65306;&#21482;&#33021;&#36873;&#20004;&#26679;
&lt;/p&gt;
&lt;p&gt;
Robustness, Efficiency, or Privacy: Pick Two in Machine Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.14712
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#26550;&#26500;&#20013;&#23454;&#29616;&#38544;&#31169;&#21644;&#40065;&#26834;&#24615;&#30340;&#25104;&#26412;&#65292;&#25351;&#20986;&#25972;&#21512;&#36825;&#20004;&#20010;&#30446;&#26631;&#20250;&#29306;&#29298;&#35745;&#31639;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#24212;&#29992;&#30340;&#25104;&#21151;&#20381;&#36182;&#20110;&#24222;&#22823;&#30340;&#25968;&#25454;&#38598;&#21644;&#20998;&#24067;&#24335;&#26550;&#26500;&#65292;&#38543;&#30528;&#23427;&#20204;&#30340;&#22686;&#38271;&#65292;&#36825;&#20123;&#26550;&#26500;&#24102;&#26469;&#20102;&#37325;&#22823;&#25361;&#25112;&#12290;&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#22330;&#26223;&#20013;&#65292;&#25968;&#25454;&#36890;&#24120;&#21253;&#21547;&#25935;&#24863;&#20449;&#24687;&#65292;&#25968;&#25454;&#27745;&#26579;&#21644;&#30828;&#20214;&#25925;&#38556;&#31561;&#38382;&#39064;&#24456;&#24120;&#35265;&#12290;&#30830;&#20445;&#38544;&#31169;&#21644;&#40065;&#26834;&#24615;&#23545;&#20110;ML&#22312;&#20844;&#20849;&#29983;&#27963;&#20013;&#30340;&#24191;&#27867;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#35282;&#24230;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;ML&#26550;&#26500;&#20013;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#12290;&#25105;&#20204;&#27010;&#36848;&#20102;&#20998;&#24067;&#24335;ML&#20013;&#38544;&#31169;&#21644;&#40065;&#26834;&#24615;&#30340;&#21547;&#20041;&#65292;&#24182;&#38416;&#26126;&#20102;&#22914;&#20309;&#21333;&#29420;&#39640;&#25928;&#23454;&#29616;&#23427;&#20204;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#35748;&#20026;&#25972;&#21512;&#36825;&#20004;&#20010;&#30446;&#26631;&#20250;&#22312;&#35745;&#31639;&#25928;&#29575;&#19978;&#26377;&#26174;&#33879;&#30340;&#25240;&#34935;&#12290;&#31616;&#32780;&#35328;&#20043;&#65292;&#20256;&#32479;&#30340;&#22122;&#22768;&#27880;&#20837;&#36890;&#36807;&#38544;&#34255;&#27602;&#23475;&#36755;&#20837;&#26469;&#25439;&#23475;&#20934;&#30830;&#24615;&#65292;&#32780;&#21152;&#23494;&#26041;&#27861;&#19982;&#38450;&#27602;&#38450;&#24481;&#30456;&#20914;&#31361;&#65292;&#22240;&#20026;&#23427;&#20204;&#26159;&#38750;&#32447;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.14712v2 Announce Type: replace  Abstract: The success of machine learning (ML) applications relies on vast datasets and distributed architectures which, as they grow, present major challenges. In real-world scenarios, where data often contains sensitive information, issues like data poisoning and hardware failures are common. Ensuring privacy and robustness is vital for the broad adoption of ML in public life. This paper examines the costs associated with achieving these objectives in distributed ML architectures, from both theoretical and empirical perspectives. We overview the meanings of privacy and robustness in distributed ML, and clarify how they can be achieved efficiently in isolation. However, we contend that the integration of these two objectives entails a notable compromise in computational efficiency. In short, traditional noise injection hurts accuracy by concealing poisoned inputs, while cryptographic methods clash with poisoning defenses due to their non-line
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#24341;&#20837;&#20102;&#22522;&#20110;&#32852;&#37030;&#23398;&#20064;&#30340;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;(FL-IDS)&#65292;&#26088;&#22312;&#35299;&#20915;FANETs&#20013;&#38598;&#20013;&#24335;&#31995;&#32479;&#25152;&#36935;&#21040;&#30340;&#25361;&#25112;&#65292;&#38477;&#20302;&#20102;&#35745;&#31639;&#21644;&#23384;&#20648;&#25104;&#26412;&#65292;&#36866;&#21512;&#36164;&#28304;&#21463;&#38480;&#30340;&#26080;&#20154;&#26426;&#12290;</title><link>https://arxiv.org/abs/2312.04135</link><description>&lt;p&gt;
&#22522;&#20110;&#32852;&#37030;&#23398;&#20064;&#30340;&#29992;&#20110;&#22686;&#24378;&#26080;&#20154;&#26426;&#38544;&#31169;&#21644;&#23433;&#20840;&#30340;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
A Novel Federated Learning-Based IDS for Enhancing UAVs Privacy and Security
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.04135
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#24341;&#20837;&#20102;&#22522;&#20110;&#32852;&#37030;&#23398;&#20064;&#30340;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;(FL-IDS)&#65292;&#26088;&#22312;&#35299;&#20915;FANETs&#20013;&#38598;&#20013;&#24335;&#31995;&#32479;&#25152;&#36935;&#21040;&#30340;&#25361;&#25112;&#65292;&#38477;&#20302;&#20102;&#35745;&#31639;&#21644;&#23384;&#20648;&#25104;&#26412;&#65292;&#36866;&#21512;&#36164;&#28304;&#21463;&#38480;&#30340;&#26080;&#20154;&#26426;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26080;&#20154;&#26426;&#22312;&#39134;&#34892;&#33258;&#32452;&#32455;&#32593;&#32476;(FANETs)&#20013;&#36816;&#34892;&#26102;&#20250;&#36935;&#21040;&#23433;&#20840;&#25361;&#25112;&#65292;&#22240;&#20026;&#36825;&#20123;&#32593;&#32476;&#20855;&#26377;&#21160;&#24577;&#21644;&#20998;&#24067;&#24335;&#30340;&#29305;&#24615;&#12290;&#20808;&#21069;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#38598;&#20013;&#24335;&#20837;&#20405;&#26816;&#27979;&#19978;&#65292;&#20551;&#35774;&#19968;&#20010;&#20013;&#22830;&#23454;&#20307;&#36127;&#36131;&#23384;&#20648;&#21644;&#20998;&#26512;&#26469;&#33258;&#25152;&#26377;&#35774;&#22791;&#30340;&#25968;&#25454;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#38754;&#20020;&#35745;&#31639;&#21644;&#23384;&#20648;&#25104;&#26412;&#20197;&#21450;&#21333;&#28857;&#25925;&#38556;&#39118;&#38505;&#31561;&#25361;&#25112;&#65292;&#23041;&#32961;&#21040;&#25968;&#25454;&#38544;&#31169;&#21644;&#21487;&#29992;&#24615;&#12290;&#25968;&#25454;&#22312;&#20114;&#36830;&#35774;&#22791;&#20043;&#38388;&#24191;&#27867;&#20998;&#25955;&#30340;&#24773;&#20917;&#31361;&#26174;&#20102;&#21435;&#20013;&#24515;&#21270;&#26041;&#27861;&#30340;&#24517;&#35201;&#24615;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#32852;&#37030;&#23398;&#20064;&#30340;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;(FL-IDS)&#65292;&#35299;&#20915;&#20102;FANETs&#20013;&#38598;&#20013;&#24335;&#31995;&#32479;&#36935;&#21040;&#30340;&#25361;&#25112;&#12290;FL-IDS&#22312;&#21435;&#20013;&#24515;&#21270;&#26041;&#24335;&#19979;&#36816;&#34892;&#65292;&#38477;&#20302;&#20102;&#23458;&#25143;&#31471;&#21644;&#20013;&#22830;&#26381;&#21153;&#22120;&#30340;&#35745;&#31639;&#21644;&#23384;&#20648;&#25104;&#26412;&#65292;&#36825;&#23545;&#20110;&#36164;&#28304;&#21463;&#38480;&#30340;&#26080;&#20154;&#26426;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.04135v2 Announce Type: replace-cross  Abstract: Unmanned aerial vehicles (UAVs) operating within Flying Ad-hoc Networks (FANETs) encounter security challenges due to the dynamic and distributed nature of these networks. Previous studies predominantly focused on centralized intrusion detection, assuming a central entity responsible for storing and analyzing data from all devices.However, these approaches face challenges including computation and storage costs, along with a single point of failure risk, threatening data privacy and availability. The widespread dispersion of data across interconnected devices underscores the necessity for decentralized approaches. This paper introduces the Federated Learning-based Intrusion Detection System (FL-IDS), addressing challenges encountered by centralized systems in FANETs. FL-IDS reduces computation and storage costs for both clients and the central server, crucial for resource-constrained UAVs. Operating in a decentralized manner, F
&lt;/p&gt;</description></item><item><title>PuriDefense&#26159;&#19968;&#31181;&#39640;&#25928;&#30340;&#38450;&#24481;&#26426;&#21046;&#65292;&#36890;&#36807;&#20351;&#29992;&#36731;&#37327;&#32423;&#20928;&#21270;&#27169;&#22411;&#36827;&#34892;&#38543;&#26426;&#36335;&#24452;&#20928;&#21270;&#65292;&#20943;&#32531;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#26377;&#25928;&#38450;&#24481;&#40657;&#30418;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#12290;</title><link>http://arxiv.org/abs/2401.10586</link><description>&lt;p&gt;
PuriDefense&#65306;&#29992;&#20110;&#38450;&#24481;&#40657;&#30418;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#30340;&#38543;&#26426;&#23616;&#37096;&#38544;&#24335;&#23545;&#25239;&#20928;&#21270;
&lt;/p&gt;
&lt;p&gt;
PuriDefense: Randomized Local Implicit Adversarial Purification for Defending Black-box Query-based Attacks. (arXiv:2401.10586v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10586
&lt;/p&gt;
&lt;p&gt;
PuriDefense&#26159;&#19968;&#31181;&#39640;&#25928;&#30340;&#38450;&#24481;&#26426;&#21046;&#65292;&#36890;&#36807;&#20351;&#29992;&#36731;&#37327;&#32423;&#20928;&#21270;&#27169;&#22411;&#36827;&#34892;&#38543;&#26426;&#36335;&#24452;&#20928;&#21270;&#65292;&#20943;&#32531;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#26377;&#25928;&#38450;&#24481;&#40657;&#30418;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#40657;&#30418;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#23545;&#26426;&#22120;&#23398;&#20064;&#20316;&#20026;&#26381;&#21153;&#31995;&#32479;&#26500;&#25104;&#37325;&#22823;&#23041;&#32961;&#65292;&#22240;&#20026;&#23427;&#20204;&#21487;&#20197;&#29983;&#25104;&#23545;&#25239;&#26679;&#26412;&#32780;&#19981;&#38656;&#35201;&#35775;&#38382;&#30446;&#26631;&#27169;&#22411;&#30340;&#26550;&#26500;&#21644;&#21442;&#25968;&#12290;&#20256;&#32479;&#30340;&#38450;&#24481;&#26426;&#21046;&#65292;&#22914;&#23545;&#25239;&#35757;&#32451;&#12289;&#26799;&#24230;&#25513;&#30422;&#21644;&#36755;&#20837;&#36716;&#25442;&#65292;&#35201;&#20040;&#24102;&#26469;&#24040;&#22823;&#30340;&#35745;&#31639;&#25104;&#26412;&#65292;&#35201;&#20040;&#25439;&#23475;&#38750;&#23545;&#25239;&#36755;&#20837;&#30340;&#27979;&#35797;&#20934;&#30830;&#24615;&#12290;&#20026;&#20102;&#24212;&#23545;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#38450;&#24481;&#26426;&#21046;PuriDefense&#65292;&#22312;&#20302;&#25512;&#29702;&#25104;&#26412;&#30340;&#32423;&#21035;&#19978;&#20351;&#29992;&#36731;&#37327;&#32423;&#20928;&#21270;&#27169;&#22411;&#30340;&#38543;&#26426;&#36335;&#24452;&#20928;&#21270;&#12290;&#36825;&#20123;&#27169;&#22411;&#21033;&#29992;&#23616;&#37096;&#38544;&#24335;&#20989;&#25968;&#24182;&#37325;&#24314;&#33258;&#28982;&#22270;&#20687;&#27969;&#24418;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#36890;&#36807;&#23558;&#38543;&#26426;&#24615;&#32435;&#20837;&#20928;&#21270;&#36807;&#31243;&#26469;&#20943;&#32531;&#22522;&#20110;&#26597;&#35810;&#30340;&#25915;&#20987;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#23545;CIFAR-10&#21644;ImageNet&#30340;&#22823;&#37327;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20928;&#21270;&#22120;&#38450;&#24481;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Black-box query-based attacks constitute significant threats to Machine Learning as a Service (MLaaS) systems since they can generate adversarial examples without accessing the target model's architecture and parameters. Traditional defense mechanisms, such as adversarial training, gradient masking, and input transformations, either impose substantial computational costs or compromise the test accuracy of non-adversarial inputs. To address these challenges, we propose an efficient defense mechanism, PuriDefense, that employs random patch-wise purifications with an ensemble of lightweight purification models at a low level of inference cost. These models leverage the local implicit function and rebuild the natural image manifold. Our theoretical analysis suggests that this approach slows down the convergence of query-based attacks by incorporating randomness into purifications. Extensive experiments on CIFAR-10 and ImageNet validate the effectiveness of our proposed purifier-based defen
&lt;/p&gt;</description></item></channel></rss>