<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#65292;&#37327;&#21270;&#20102;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#27844;&#38706;&#65292;&#24182;&#35780;&#20272;&#20102;&#20004;&#31181;&#38544;&#31169;&#38450;&#24481;&#25514;&#26045;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.10065</link><description>&lt;p&gt;
&#27599;&#20010;&#25968;&#25454;&#28857;&#27844;&#38706;&#24744;&#38544;&#31169;&#30340;&#31243;&#24230;&#26377;&#22810;&#22823;&#65311;&#37327;&#21270;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#27844;&#38706;
&lt;/p&gt;
&lt;p&gt;
How Much Does Each Datapoint Leak Your Privacy? Quantifying the Per-datum Membership Leakage
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10065
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#65292;&#37327;&#21270;&#20102;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#27844;&#38706;&#65292;&#24182;&#35780;&#20272;&#20102;&#20004;&#31181;&#38544;&#31169;&#38450;&#24481;&#25514;&#26045;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#65288;MIAs&#65289;&#65292;&#20854;&#20013;&#25915;&#20987;&#32773;&#26088;&#22312;&#25512;&#26029;&#20986;&#19968;&#20010;&#22266;&#23450;&#30446;&#26631;&#25968;&#25454;&#26159;&#21542;&#24050;&#21253;&#21547;&#22312;&#31639;&#27861;&#30340;&#36755;&#20837;&#25968;&#25454;&#38598;&#20013;&#65292;&#20174;&#32780;&#20405;&#29359;&#38544;&#31169;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23450;&#20041;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#27844;&#38706;&#20026;&#26368;&#20248;&#23545;&#25163;&#36776;&#35782;&#23427;&#30340;&#20248;&#21183;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#32463;&#39564;&#22343;&#20540;&#30340;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#27844;&#38706;&#65292;&#24182;&#34920;&#26126;&#23427;&#21462;&#20915;&#20110;&#30446;&#26631;&#25968;&#25454;&#28857;&#21644;&#25968;&#25454;&#29983;&#25104;&#20998;&#24067;&#20043;&#38388;&#30340;&#39532;&#27663;&#36317;&#31163;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35780;&#20272;&#20102;&#20004;&#31181;&#38544;&#31169;&#38450;&#24481;&#25514;&#26045;&#30340;&#25928;&#26524;&#65292;&#21363;&#28155;&#21152;&#39640;&#26031;&#22122;&#22768;&#21644;&#23376;&#37319;&#26679;&#12290;&#25105;&#20204;&#20934;&#30830;&#22320;&#37327;&#21270;&#20102;&#23427;&#20204;&#37117;&#22914;&#20309;&#38477;&#20302;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#25104;&#21592;&#27844;&#38706;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#24314;&#31435;&#22312;&#19968;&#20010;&#32467;&#21512;&#20102;&#20284;&#28982;&#27604;&#26816;&#39564;&#30340;Edgeworth&#23637;&#24320;&#21644;Lindeberg-Feller&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#30340;&#26032;&#22411;&#35777;&#26126;&#25216;&#26415;&#19978;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#36830;&#25509;&#20102;&#29616;&#26377;&#30340;&#20284;&#28982;&#27604;&#21644;&#26631;&#37327;&#20056;&#31215;&#25915;&#20987;&#65292;&#24182;&#23545;&#36825;&#20123;&#25915;&#20987;&#36827;&#34892;&#20102;&#35770;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10065v1 Announce Type: new  Abstract: We study the per-datum Membership Inference Attacks (MIAs), where an attacker aims to infer whether a fixed target datum has been included in the input dataset of an algorithm and thus, violates privacy. First, we define the membership leakage of a datum as the advantage of the optimal adversary targeting to identify it. Then, we quantify the per-datum membership leakage for the empirical mean, and show that it depends on the Mahalanobis distance between the target datum and the data-generating distribution. We further assess the effect of two privacy defences, i.e. adding Gaussian noise and sub-sampling. We quantify exactly how both of them decrease the per-datum membership leakage. Our analysis builds on a novel proof technique that combines an Edgeworth expansion of the likelihood ratio test and a Lindeberg-Feller central limit theorem. Our analysis connects the existing likelihood ratio and scalar product attacks, and also justifies 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#26799;&#24230;&#30340;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#26041;&#27861;$\sigma$-zero&#65292;&#20854;&#21033;&#29992;&#20102;$\ell_0$&#33539;&#25968;&#30340;&#21487;&#24494;&#36817;&#20284;&#21644;&#33258;&#36866;&#24212;&#25237;&#24433;&#36816;&#31639;&#31526;&#65292;&#33021;&#22815;&#22312;&#38750;&#20984;&#21644;&#38750;&#21487;&#24494;&#30340;&#32422;&#26463;&#19979;&#20248;&#21270;&#65292;&#20174;&#32780;&#35780;&#20272;&#28145;&#24230;&#32593;&#32476;&#23545;&#31232;&#30095;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.01879</link><description>&lt;p&gt;
$\sigma$-zero: &#22522;&#20110;&#26799;&#24230;&#30340;$\ell_0$-&#33539;&#25968;&#23545;&#25239;&#26679;&#26412;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
$\sigma$-zero: Gradient-based Optimization of $\ell_0$-norm Adversarial Examples
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01879
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#26799;&#24230;&#30340;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#26041;&#27861;$\sigma$-zero&#65292;&#20854;&#21033;&#29992;&#20102;$\ell_0$&#33539;&#25968;&#30340;&#21487;&#24494;&#36817;&#20284;&#21644;&#33258;&#36866;&#24212;&#25237;&#24433;&#36816;&#31639;&#31526;&#65292;&#33021;&#22815;&#22312;&#38750;&#20984;&#21644;&#38750;&#21487;&#24494;&#30340;&#32422;&#26463;&#19979;&#20248;&#21270;&#65292;&#20174;&#32780;&#35780;&#20272;&#28145;&#24230;&#32593;&#32476;&#23545;&#31232;&#30095;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35780;&#20272;&#28145;&#24230;&#32593;&#32476;&#23545;&#22522;&#20110;&#26799;&#24230;&#25915;&#20987;&#30340;&#23545;&#25239;&#40065;&#26834;&#24615;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#34429;&#28982;&#22823;&#22810;&#25968;&#25915;&#20987;&#32771;&#34385;$\ell_2$&#21644;$\ell_\infty$&#33539;&#25968;&#32422;&#26463;&#26469;&#21046;&#36896;&#36755;&#20837;&#25200;&#21160;&#65292;&#20294;&#21482;&#26377;&#23569;&#25968;&#30740;&#31350;&#20102;&#31232;&#30095;&#30340;$\ell_1$&#21644;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#12290;&#29305;&#21035;&#26159;&#65292;&#30001;&#20110;&#22312;&#38750;&#20984;&#19988;&#38750;&#21487;&#24494;&#32422;&#26463;&#19978;&#36827;&#34892;&#20248;&#21270;&#30340;&#22266;&#26377;&#22797;&#26434;&#24615;&#65292;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#26159;&#30740;&#31350;&#26368;&#23569;&#30340;&#12290;&#28982;&#32780;&#65292;&#20351;&#29992;&#36825;&#20123;&#25915;&#20987;&#35780;&#20272;&#23545;&#25239;&#40065;&#26834;&#24615;&#21487;&#20197;&#25581;&#31034;&#22312;&#26356;&#20256;&#32479;&#30340;$\ell_2$&#21644;$\ell_\infty$&#33539;&#25968;&#25915;&#20987;&#20013;&#26410;&#33021;&#27979;&#35797;&#20986;&#30340;&#24369;&#28857;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;$\ell_0$&#33539;&#25968;&#25915;&#20987;&#65292;&#31216;&#20026;$\sigma$-zero&#65292;&#23427;&#21033;&#29992;&#20102;$\ell_0$&#33539;&#25968;&#30340;&#19968;&#20010;&#29305;&#27530;&#21487;&#24494;&#36817;&#20284;&#26469;&#20419;&#36827;&#22522;&#20110;&#26799;&#24230;&#30340;&#20248;&#21270;&#65292;&#24182;&#21033;&#29992;&#33258;&#36866;&#24212;&#25237;&#24433;&#36816;&#31639;&#31526;&#21160;&#24577;&#35843;&#25972;&#25439;&#22833;&#26368;&#23567;&#21270;&#21644;&#25200;&#21160;&#31232;&#30095;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36890;&#36807;&#22312;MNIST&#12289;CIFAR10&#21644;ImageNet&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#24191;&#27867;&#35780;&#20272;&#65292;&#21253;&#25324;...
&lt;/p&gt;
&lt;p&gt;
Evaluating the adversarial robustness of deep networks to gradient-based attacks is challenging. While most attacks consider $\ell_2$- and $\ell_\infty$-norm constraints to craft input perturbations, only a few investigate sparse $\ell_1$- and $\ell_0$-norm attacks. In particular, $\ell_0$-norm attacks remain the least studied due to the inherent complexity of optimizing over a non-convex and non-differentiable constraint. However, evaluating adversarial robustness under these attacks could reveal weaknesses otherwise left untested with more conventional $\ell_2$- and $\ell_\infty$-norm attacks. In this work, we propose a novel $\ell_0$-norm attack, called $\sigma$-zero, which leverages an ad hoc differentiable approximation of the $\ell_0$ norm to facilitate gradient-based optimization, and an adaptive projection operator to dynamically adjust the trade-off between loss minimization and perturbation sparsity. Extensive evaluations using MNIST, CIFAR10, and ImageNet datasets, involving
&lt;/p&gt;</description></item></channel></rss>