<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#20171;&#32461;&#20102;MaleficNet 2.0&#65292;&#19968;&#31181;&#22312;&#31070;&#32463;&#32593;&#32476;&#20013;&#23884;&#20837;&#24694;&#24847;&#36719;&#20214;&#30340;&#26032;&#25216;&#26415;&#65292;&#20854;&#27880;&#20837;&#25216;&#26415;&#20855;&#26377;&#38544;&#34109;&#24615;&#65292;&#19981;&#20250;&#38477;&#20302;&#27169;&#22411;&#24615;&#33021;&#65292;&#24182;&#19988;&#23545;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#20013;&#30340;&#24694;&#24847;&#26377;&#25928;&#36127;&#36733;&#36827;&#34892;&#27880;&#20837;</title><link>https://arxiv.org/abs/2403.03593</link><description>&lt;p&gt;
&#24744;&#20449;&#20219;&#24744;&#30340;&#27169;&#22411;&#21527;&#65311;&#28145;&#24230;&#23398;&#20064;&#29983;&#24577;&#31995;&#32479;&#20013;&#26032;&#20852;&#30340;&#24694;&#24847;&#36719;&#20214;&#23041;&#32961;
&lt;/p&gt;
&lt;p&gt;
Do You Trust Your Model? Emerging Malware Threats in the Deep Learning Ecosystem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03593
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;MaleficNet 2.0&#65292;&#19968;&#31181;&#22312;&#31070;&#32463;&#32593;&#32476;&#20013;&#23884;&#20837;&#24694;&#24847;&#36719;&#20214;&#30340;&#26032;&#25216;&#26415;&#65292;&#20854;&#27880;&#20837;&#25216;&#26415;&#20855;&#26377;&#38544;&#34109;&#24615;&#65292;&#19981;&#20250;&#38477;&#20302;&#27169;&#22411;&#24615;&#33021;&#65292;&#24182;&#19988;&#23545;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#20013;&#30340;&#24694;&#24847;&#26377;&#25928;&#36127;&#36733;&#36827;&#34892;&#27880;&#20837;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35757;&#32451;&#39640;&#36136;&#37327;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#65292;&#36825;&#26159;&#22240;&#20026;&#38656;&#35201;&#35745;&#31639;&#21644;&#25216;&#26415;&#35201;&#27714;&#12290;&#36234;&#26469;&#36234;&#22810;&#30340;&#20010;&#20154;&#12289;&#26426;&#26500;&#21644;&#20844;&#21496;&#36234;&#26469;&#36234;&#22810;&#22320;&#20381;&#36182;&#20110;&#22312;&#20844;&#20849;&#20195;&#30721;&#24211;&#20013;&#25552;&#20379;&#30340;&#39044;&#35757;&#32451;&#30340;&#31532;&#19977;&#26041;&#27169;&#22411;&#12290;&#36825;&#20123;&#27169;&#22411;&#36890;&#24120;&#30452;&#25509;&#20351;&#29992;&#25110;&#38598;&#25104;&#21040;&#20135;&#21697;&#31649;&#36947;&#20013;&#32780;&#27809;&#26377;&#29305;&#27530;&#30340;&#39044;&#38450;&#25514;&#26045;&#65292;&#22240;&#20026;&#23427;&#20204;&#23454;&#38469;&#19978;&#21482;&#26159;&#20197;&#24352;&#37327;&#24418;&#24335;&#30340;&#25968;&#25454;&#65292;&#34987;&#35748;&#20026;&#26159;&#23433;&#20840;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#20379;&#24212;&#38142;&#23041;&#32961;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;MaleficNet 2.0&#65292;&#19968;&#31181;&#22312;&#31070;&#32463;&#32593;&#32476;&#20013;&#23884;&#20837;&#33258;&#35299;&#21387;&#33258;&#25191;&#34892;&#24694;&#24847;&#36719;&#20214;&#30340;&#26032;&#25216;&#26415;&#12290;MaleficNet 2.0&#20351;&#29992;&#25193;&#39057;&#20449;&#36947;&#32534;&#30721;&#32467;&#21512;&#32416;&#38169;&#25216;&#26415;&#22312;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#21442;&#25968;&#20013;&#27880;&#20837;&#24694;&#24847;&#26377;&#25928;&#36733;&#33655;&#12290;MaleficNet 2.0&#27880;&#20837;&#25216;&#26415;&#20855;&#26377;&#38544;&#34109;&#24615;&#65292;&#19981;&#20250;&#38477;&#20302;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#23545;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03593v1 Announce Type: cross  Abstract: Training high-quality deep learning models is a challenging task due to computational and technical requirements. A growing number of individuals, institutions, and companies increasingly rely on pre-trained, third-party models made available in public repositories. These models are often used directly or integrated in product pipelines with no particular precautions, since they are effectively just data in tensor form and considered safe. In this paper, we raise awareness of a new machine learning supply chain threat targeting neural networks. We introduce MaleficNet 2.0, a novel technique to embed self-extracting, self-executing malware in neural networks. MaleficNet 2.0 uses spread-spectrum channel coding combined with error correction techniques to inject malicious payloads in the parameters of deep neural networks. MaleficNet 2.0 injection technique is stealthy, does not degrade the performance of the model, and is robust against 
&lt;/p&gt;</description></item><item><title>VGMShield&#25552;&#20986;&#20102;&#19977;&#39033;&#31616;&#21333;&#20294;&#24320;&#21019;&#24615;&#30340;&#25514;&#26045;&#65292;&#36890;&#36807;&#26816;&#27979;&#34394;&#20551;&#35270;&#39057;&#12289;&#28335;&#28304;&#38382;&#39064;&#21644;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;&#31354;&#38388;-&#26102;&#38388;&#21160;&#24577;&#27169;&#22411;&#65292;&#38450;&#33539;&#35270;&#39057;&#29983;&#25104;&#27169;&#22411;&#30340;&#35823;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.13126</link><description>&lt;p&gt;
VGMShield&#65306;&#32531;&#35299;&#35270;&#39057;&#29983;&#25104;&#27169;&#22411;&#30340;&#35823;&#29992;
&lt;/p&gt;
&lt;p&gt;
VGMShield: Mitigating Misuse of Video Generative Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13126
&lt;/p&gt;
&lt;p&gt;
VGMShield&#25552;&#20986;&#20102;&#19977;&#39033;&#31616;&#21333;&#20294;&#24320;&#21019;&#24615;&#30340;&#25514;&#26045;&#65292;&#36890;&#36807;&#26816;&#27979;&#34394;&#20551;&#35270;&#39057;&#12289;&#28335;&#28304;&#38382;&#39064;&#21644;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;&#31354;&#38388;-&#26102;&#38388;&#21160;&#24577;&#27169;&#22411;&#65292;&#38450;&#33539;&#35270;&#39057;&#29983;&#25104;&#27169;&#22411;&#30340;&#35823;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#35270;&#39057;&#29983;&#25104;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#20154;&#20204;&#21487;&#20197;&#26041;&#20415;&#22320;&#21033;&#29992;&#35270;&#39057;&#29983;&#25104;&#27169;&#22411;&#21019;&#24314;&#31526;&#21512;&#20854;&#29305;&#23450;&#38656;&#27714;&#30340;&#35270;&#39057;&#12290;&#28982;&#32780;&#65292;&#20154;&#20204;&#20063;&#36234;&#26469;&#36234;&#25285;&#24515;&#36825;&#20123;&#25216;&#26415;&#34987;&#29992;&#20110;&#21019;&#20316;&#21644;&#20256;&#25773;&#34394;&#20551;&#20449;&#24687;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;VGMShield&#65306;&#19968;&#22871;&#21253;&#21547;&#19977;&#39033;&#30452;&#25509;&#20294;&#24320;&#21019;&#24615;&#30340;&#25514;&#26045;&#65292;&#29992;&#20110;&#38450;&#33539;&#34394;&#20551;&#35270;&#39057;&#29983;&#25104;&#36807;&#31243;&#20013;&#21487;&#33021;&#20986;&#29616;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#39318;&#20808;&#20174;&#8220;&#34394;&#20551;&#35270;&#39057;&#26816;&#27979;&#8221;&#24320;&#22987;&#65292;&#23581;&#35797;&#29702;&#35299;&#29983;&#25104;&#30340;&#35270;&#39057;&#20013;&#26159;&#21542;&#23384;&#22312;&#29420;&#29305;&#24615;&#65292;&#20197;&#21450;&#25105;&#20204;&#26159;&#21542;&#33021;&#22815;&#21306;&#20998;&#23427;&#20204;&#19982;&#30495;&#23454;&#35270;&#39057;&#30340;&#19981;&#21516;&#65307;&#28982;&#21518;&#65292;&#25105;&#20204;&#25506;&#35752;&#8220;&#28335;&#28304;&#8221;&#38382;&#39064;&#65292;&#21363;&#23558;&#19968;&#27573;&#34394;&#20551;&#35270;&#39057;&#36861;&#28335;&#22238;&#29983;&#25104;&#23427;&#30340;&#27169;&#22411;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;&#20851;&#27880;&#8220;&#26102;&#31354;&#21160;&#24577;&#8221;&#30340;&#27169;&#22411;&#20316;&#20026;&#39592;&#24178;&#65292;&#20197;&#35782;&#21035;&#35270;&#39057;&#20013;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;&#36890;&#36807;&#23545;&#19971;&#20010;&#26368;&#20808;&#36827;&#30340;&#24320;&#28304;&#27169;&#22411;&#36827;&#34892;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13126v1 Announce Type: cross  Abstract: With the rapid advancement in video generation, people can conveniently utilize video generation models to create videos tailored to their specific desires. Nevertheless, there are also growing concerns about their potential misuse in creating and disseminating false information.   In this work, we introduce VGMShield: a set of three straightforward but pioneering mitigations through the lifecycle of fake video generation. We start from \textit{fake video detection} trying to understand whether there is uniqueness in generated videos and whether we can differentiate them from real videos; then, we investigate the \textit{tracing} problem, which maps a fake video back to a model that generates it. Towards these, we propose to leverage pre-trained models that focus on {\it spatial-temporal dynamics} as the backbone to identify inconsistencies in videos. Through experiments on seven state-of-the-art open-source models, we demonstrate that
&lt;/p&gt;</description></item></channel></rss>