<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#30740;&#31350;&#31639;&#27861;&#20013;&#31435;&#24615;&#20197;&#21450;&#19982;&#31639;&#27861;&#20559;&#35265;&#30340;&#20851;&#31995;&#65292;&#20197;&#25628;&#32034;&#24341;&#25806;&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#24471;&#20986;&#25628;&#32034;&#20013;&#31435;&#24615;&#26159;&#19981;&#21487;&#33021;&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2303.05103</link><description>&lt;p&gt;
&#31639;&#27861;&#20013;&#31435;&#24615;
&lt;/p&gt;
&lt;p&gt;
Algorithmic neutrality. (arXiv:2303.05103v2 [cs.CY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.05103
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#31639;&#27861;&#20013;&#31435;&#24615;&#20197;&#21450;&#19982;&#31639;&#27861;&#20559;&#35265;&#30340;&#20851;&#31995;&#65292;&#20197;&#25628;&#32034;&#24341;&#25806;&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#24471;&#20986;&#25628;&#32034;&#20013;&#31435;&#24615;&#26159;&#19981;&#21487;&#33021;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20559;&#35265;&#24433;&#21709;&#30528;&#36234;&#26469;&#36234;&#22810;&#25484;&#25511;&#25105;&#20204;&#29983;&#27963;&#30340;&#31639;&#27861;&#12290;&#39044;&#27979;&#24615;&#35686;&#21153;&#31995;&#32479;&#38169;&#35823;&#22320;&#39640;&#20272;&#26377;&#33394;&#20154;&#31181;&#31038;&#21306;&#30340;&#29359;&#32618;&#29575;&#65307;&#25307;&#32856;&#31639;&#27861;&#21066;&#24369;&#20102;&#21512;&#26684;&#30340;&#22899;&#24615;&#20505;&#36873;&#20154;&#30340;&#26426;&#20250;&#65307;&#20154;&#33080;&#35782;&#21035;&#36719;&#20214;&#38590;&#20197;&#35782;&#21035;&#40657;&#30382;&#32932;&#30340;&#38754;&#37096;&#12290;&#31639;&#27861;&#20559;&#35265;&#24050;&#32463;&#21463;&#21040;&#20102;&#37325;&#35270;&#65292;&#30456;&#27604;&#20043;&#19979;&#65292;&#31639;&#27861;&#20013;&#31435;&#24615;&#21364;&#22522;&#26412;&#34987;&#24573;&#35270;&#20102;&#12290;&#31639;&#27861;&#20013;&#31435;&#24615;&#26159;&#25105;&#30340;&#30740;&#31350;&#20027;&#39064;&#12290;&#25105;&#25552;&#20986;&#20102;&#19977;&#20010;&#38382;&#39064;&#12290;&#31639;&#27861;&#20013;&#31435;&#24615;&#26159;&#20160;&#20040;&#65311;&#31639;&#27861;&#20013;&#31435;&#24615;&#26159;&#21542;&#21487;&#33021;&#65311;&#24403;&#25105;&#20204;&#32771;&#34385;&#31639;&#27861;&#20013;&#31435;&#24615;&#26102;&#65292;&#25105;&#20204;&#21487;&#20197;&#20174;&#31639;&#27861;&#20559;&#35265;&#20013;&#23398;&#21040;&#20160;&#20040;&#65311;&#20026;&#20102;&#20855;&#20307;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#36873;&#25321;&#20102;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;&#65306;&#25628;&#32034;&#24341;&#25806;&#12290;&#20511;&#37492;&#20851;&#20110;&#31185;&#23398;&#20013;&#31435;&#24615;&#30340;&#30740;&#31350;&#65292;&#25105;&#35748;&#20026;&#21482;&#26377;&#24403;&#25628;&#32034;&#24341;&#25806;&#30340;&#25490;&#21517;&#19981;&#21463;&#26576;&#20123;&#20215;&#20540;&#35266;&#30340;&#24433;&#21709;&#26102;&#65292;&#25628;&#32034;&#24341;&#25806;&#25165;&#26159;&#20013;&#31435;&#30340;&#65292;&#27604;&#22914;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#25110;&#25628;&#32034;&#24341;&#25806;&#36816;&#33829;&#21830;&#30340;&#32463;&#27982;&#21033;&#30410;&#12290;&#25105;&#35748;&#20026;&#25628;&#32034;&#20013;&#31435;&#24615;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bias infects the algorithms that wield increasing control over our lives. Predictive policing systems overestimate crime in communities of color; hiring algorithms dock qualified female candidates; and facial recognition software struggles to recognize dark-skinned faces. Algorithmic bias has received significant attention. Algorithmic neutrality, in contrast, has been largely neglected. Algorithmic neutrality is my topic. I take up three questions. What is algorithmic neutrality? Is algorithmic neutrality possible? When we have algorithmic neutrality in mind, what can we learn about algorithmic bias? To answer these questions in concrete terms, I work with a case study: search engines. Drawing on work about neutrality in science, I say that a search engine is neutral only if certain values -- like political ideologies or the financial interests of the search engine operator -- play no role in how the search engine ranks pages. Search neutrality, I argue, is impossible. Its impossibili
&lt;/p&gt;</description></item></channel></rss>