<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#22810;&#35821;&#35328;&#25968;&#25454;&#38598;&#65292;&#21253;&#21547;&#32500;&#22522;&#30334;&#31185;&#32534;&#36753;&#35752;&#35770;&#21644;&#20915;&#31574;&#30340;&#25512;&#29702;&#36807;&#31243;&#65292;&#22312;&#35299;&#37322;&#20869;&#23481;&#31649;&#29702;&#20915;&#31574;&#26041;&#38754;&#22686;&#21152;&#20102;&#36879;&#26126;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.05779</link><description>&lt;p&gt;
&#20026;&#20160;&#20040;&#24212;&#35813;&#21024;&#38500;&#36825;&#31687;&#25991;&#31456;&#65311;&#22810;&#35821;&#35328;&#32500;&#22522;&#30334;&#31185;&#32534;&#36753;&#35752;&#35770;&#20013;&#30340;&#36879;&#26126;&#31435;&#22330;&#35782;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
Why Should This Article Be Deleted? Transparent Stance Detection in Multilingual Wikipedia Editor Discussions. (arXiv:2310.05779v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.05779
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#22810;&#35821;&#35328;&#25968;&#25454;&#38598;&#65292;&#21253;&#21547;&#32500;&#22522;&#30334;&#31185;&#32534;&#36753;&#35752;&#35770;&#21644;&#20915;&#31574;&#30340;&#25512;&#29702;&#36807;&#31243;&#65292;&#22312;&#35299;&#37322;&#20869;&#23481;&#31649;&#29702;&#20915;&#31574;&#26041;&#38754;&#22686;&#21152;&#20102;&#36879;&#26126;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#20869;&#23481;&#31649;&#29702;&#36890;&#24120;&#26159;&#38750;&#36879;&#26126;&#30340;&#12290;&#28982;&#32780;&#65292;&#22312;&#32500;&#22522;&#30334;&#31185;&#19978;&#65292;&#36825;&#31181;&#35752;&#35770;&#26159;&#20844;&#24320;&#36827;&#34892;&#30340;&#65292;&#32534;&#36753;&#34987;&#40723;&#21169;&#20351;&#29992;&#20869;&#23481;&#31649;&#29702;&#25919;&#31574;&#26469;&#35299;&#37322;&#20182;&#20204;&#30340;&#20915;&#31574;&#12290;&#30446;&#21069;&#65292;&#21482;&#26377;&#23569;&#25968;&#35780;&#35770;&#26126;&#30830;&#25552;&#21040;&#36825;&#20123;&#25919;&#31574;-&#33521;&#25991;&#35780;&#35770;20%&#65292;&#20294;&#24503;&#25991;&#21644;&#22303;&#32819;&#20854;&#35780;&#35770;&#21482;&#26377;2%&#12290;&#20026;&#20102;&#24110;&#21161;&#29702;&#35299;&#20869;&#23481;&#31649;&#29702;&#36807;&#31243;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#22810;&#35821;&#35328;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#21547;&#32500;&#22522;&#30334;&#31185;&#32534;&#36753;&#35752;&#35770;&#20197;&#21450;&#20182;&#20204;&#30340;&#25512;&#29702;&#36807;&#31243;&#12290;&#25968;&#25454;&#38598;&#21253;&#21547;&#32534;&#36753;&#30340;&#31435;&#22330;&#65288;&#20445;&#30041;&#12289;&#21024;&#38500;&#12289;&#21512;&#24182;&#12289;&#35780;&#35770;&#65289;&#65292;&#20197;&#21450;&#27599;&#20010;&#32534;&#36753;&#20915;&#31574;&#25152;&#38472;&#36848;&#30340;&#21407;&#22240;&#21644;&#20869;&#23481;&#31649;&#29702;&#25919;&#31574;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#31435;&#22330;&#21644;&#30456;&#24212;&#30340;&#21407;&#22240;&#65288;&#25919;&#31574;&#65289;&#21487;&#20197;&#34987;&#39640;&#24230;&#20934;&#30830;&#22320;&#32852;&#21512;&#39044;&#27979;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#20915;&#31574;&#36807;&#31243;&#30340;&#36879;&#26126;&#24230;&#12290;&#25105;&#20204;&#21457;&#24067;&#20102;&#32852;&#21512;&#39044;&#27979;&#27169;&#22411;&#21644;&#22810;&#35821;&#35328;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
The moderation of content on online platforms is usually non-transparent. On Wikipedia, however, this discussion is carried out publicly and the editors are encouraged to use the content moderation policies as explanations for making moderation decisions. Currently, only a few comments explicitly mention those policies -- 20% of the English ones, but as few as 2% of the German and Turkish comments. To aid in this process of understanding how content is moderated, we construct a novel multilingual dataset of Wikipedia editor discussions along with their reasoning in three languages. The dataset contains the stances of the editors (keep, delete, merge, comment), along with the stated reason, and a content moderation policy, for each edit decision. We demonstrate that stance and corresponding reason (policy) can be predicted jointly with a high degree of accuracy, adding transparency to the decision-making process. We release both our joint prediction models and the multilingual content m
&lt;/p&gt;</description></item></channel></rss>