<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#36890;&#36807;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#34920;&#36798;&#20154;&#31867;&#20010;&#24615;&#29305;&#24449;&#26041;&#38754;&#30340;&#21487;&#38752;&#24615;&#65292;&#30740;&#31350;&#35748;&#30693;&#19982;&#34892;&#20026;&#20043;&#38388;&#30340;&#19968;&#33268;&#24615;&#65292;&#20197;&#21450;&#25552;&#20986;&#23545;&#35266;&#23519;&#32467;&#26524;&#30340;&#24515;&#29702;&#29702;&#35770;&#21644;&#25351;&#26631;&#20551;&#35774;</title><link>https://arxiv.org/abs/2402.14679</link><description>&lt;p&gt;
&#35748;&#30693;&#19982;&#34892;&#20026;&#19968;&#33268;&#36824;&#26159;&#19981;&#19968;&#33268;&#65306;&#30740;&#31350;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20010;&#24615;
&lt;/p&gt;
&lt;p&gt;
Is Cognition and Action Consistent or Not: Investigating Large Language Model's Personality
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14679
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#34920;&#36798;&#20154;&#31867;&#20010;&#24615;&#29305;&#24449;&#26041;&#38754;&#30340;&#21487;&#38752;&#24615;&#65292;&#30740;&#31350;&#35748;&#30693;&#19982;&#34892;&#20026;&#20043;&#38388;&#30340;&#19968;&#33268;&#24615;&#65292;&#20197;&#21450;&#25552;&#20986;&#23545;&#35266;&#23519;&#32467;&#26524;&#30340;&#24515;&#29702;&#29702;&#35770;&#21644;&#25351;&#26631;&#20551;&#35774;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#22238;&#31572;&#20154;&#26684;&#38382;&#21367;&#35843;&#26597;&#26469;&#25506;&#35752;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#34920;&#36798;&#31867;&#20154;&#20010;&#24615;&#29305;&#24449;&#26041;&#38754;&#30340;&#21487;&#38752;&#24615;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#35780;&#20272;LLMs&#25152;&#34920;&#36798;&#30340;&#20010;&#24615;&#20542;&#21521;&#19982;&#23427;&#20204;&#23454;&#38469;&#8220;&#34892;&#20026;&#8221;&#20043;&#38388;&#30340;&#19968;&#33268;&#24615;&#65292;&#26816;&#39564;&#36825;&#20123;&#27169;&#22411;&#33021;&#22815;&#27169;&#25311;&#31867;&#20154;&#20010;&#24615;&#27169;&#24335;&#30340;&#31243;&#24230;&#12290;&#36890;&#36807;&#20840;&#38754;&#20998;&#26512;LLM&#36755;&#20986;&#19982;&#24050;&#24314;&#31435;&#30340;&#20154;&#31867;&#22522;&#20934;&#20043;&#38388;&#30340;&#23545;&#27604;&#65292;&#25105;&#20204;&#35797;&#22270;&#20102;&#35299;LLMs&#20013;&#35748;&#30693;&#19982;&#34892;&#20026;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#24182;&#26681;&#25454;&#24515;&#29702;&#29702;&#35770;&#21644;&#25351;&#26631;&#23545;&#35266;&#23519;&#32467;&#26524;&#25552;&#20986;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14679v1 Announce Type: new  Abstract: In this study, we investigate the reliability of Large Language Models (LLMs) in professing human-like personality traits through responses to personality questionnaires. Our goal is to evaluate the consistency between LLMs' professed personality inclinations and their actual "behavior", examining the extent to which these models can emulate human-like personality patterns. Through a comprehensive analysis of LLM outputs against established human benchmarks, we seek to understand the cognition-action divergence in LLMs and propose hypotheses for the observed results based on psychological theories and metrics.
&lt;/p&gt;</description></item></channel></rss>