<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#25512;&#33616;&#31995;&#32479;&#25216;&#26415;&#30340;&#25968;&#25454;&#39537;&#21160;&#20379;&#24212;&#38142;&#32039;&#24613;&#21709;&#24212;&#26694;&#26550;&#65292;&#33021;&#22815;&#20316;&#20026;&#20379;&#24212;&#38142;&#20013;&#26029;&#30340;&#26377;&#25928;&#25514;&#26045;&#65292;&#24182;&#24110;&#21161;&#21442;&#19982;&#32773;&#22312;&#21361;&#26426;&#21457;&#29983;&#21518;&#33719;&#24471;&#26356;&#22909;&#30340;&#21453;&#24212;&#34920;&#29616;&#12290;</title><link>https://arxiv.org/abs/2404.00306</link><description>&lt;p&gt;
&#21033;&#29992;&#26234;&#33021;&#25512;&#33616;&#31995;&#32479;&#20316;&#20026;&#31532;&#19968;&#27493;&#24377;&#24615;&#25514;&#26045; &#8212;&#8212; &#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#20379;&#24212;&#38142;&#32039;&#24613;&#21709;&#24212;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Leveraging Intelligent Recommender system as a first step resilience measure -- A data-driven supply chain disruption response framework
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00306
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#25512;&#33616;&#31995;&#32479;&#25216;&#26415;&#30340;&#25968;&#25454;&#39537;&#21160;&#20379;&#24212;&#38142;&#32039;&#24613;&#21709;&#24212;&#26694;&#26550;&#65292;&#33021;&#22815;&#20316;&#20026;&#20379;&#24212;&#38142;&#20013;&#26029;&#30340;&#26377;&#25928;&#25514;&#26045;&#65292;&#24182;&#24110;&#21161;&#21442;&#19982;&#32773;&#22312;&#21361;&#26426;&#21457;&#29983;&#21518;&#33719;&#24471;&#26356;&#22909;&#30340;&#21453;&#24212;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#25216;&#26415;&#22312;&#25552;&#39640;&#20379;&#24212;&#38142;&#24377;&#24615;&#26041;&#38754;&#30340;&#28508;&#22312;&#29992;&#36884;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#65292;&#23588;&#20854;&#26159;&#22312;&#24037;&#19994;4.0&#21644;&#20840;&#29699;&#22823;&#27969;&#34892;&#30149;&#32972;&#26223;&#19979;&#12290;&#23613;&#31649;&#25512;&#33616;&#31995;&#32479; (RS) &#20316;&#20026;&#19968;&#31181;&#33021;&#22815;&#25552;&#21319;&#20379;&#24212;&#38142;&#24377;&#24615;&#30340;&#24037;&#20855;&#34987;&#24573;&#35270;&#65292;&#20294;&#20174;&#24212;&#21464;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;RS &#26159;&#19968;&#31181;&#26377;&#25928;&#30340;&#24037;&#20855;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#25512;&#33616;&#31995;&#32479;&#25216;&#26415;&#30340;&#20840;&#26032;&#25968;&#25454;&#39537;&#21160;&#20379;&#24212;&#38142;&#32039;&#24613;&#21709;&#24212;&#26694;&#26550;&#65292;&#24182;&#36890;&#36807;&#19968;&#20010;&#23454;&#38469;&#26696;&#20363;&#39564;&#35777;&#20102;&#27010;&#24565;&#27169;&#22411;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#26377;&#25928;&#30340;&#20379;&#24212;&#38142;&#32039;&#24613;&#21709;&#24212;&#25514;&#26045;&#22312;&#31532;&#19968;&#38454;&#27573;&#24471;&#21040;&#23454;&#26045;&#65292;&#24182;&#24110;&#21161;&#20379;&#24212;&#38142;&#21442;&#19982;&#32773;&#22312;&#20379;&#24212;&#38142;&#20013;&#26029;&#20043;&#21518;&#33719;&#24471;&#26356;&#22909;&#30340;&#21453;&#24212;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00306v1 Announce Type: cross  Abstract: Interests in the value of digital technologies for its potential uses to increase supply chain resilience (SCRes) are increasing in light to the industry 4.0 and the global pandemic. Utilization of Recommender systems (RS) as a supply chain (SC) resilience measure is neglected although RS is a capable tool to enhance SC resilience from a reactive aspect. To address this problem, this research proposed a novel data-driven supply chain disruption response framework based on the intelligent recommender system techniques and validated the conceptual model through a practical use case. Results show that our framework can be implemented as an effective SC disruption mitigation measure in the very first response phrase and help SC participants get better reaction performance after the SC disruption.
&lt;/p&gt;</description></item></channel></rss>