<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#36890;&#36807;&#20302;&#27425;&#22810;&#39033;&#24335;&#35745;&#31639;&#22270;&#35770;&#20272;&#35745;&#23384;&#22312;&#35745;&#31639;&#38556;&#30861;&#65292;&#20256;&#32479;&#30340;&#20248;&#21270;&#20272;&#35745;&#26041;&#27861;&#20855;&#26377;&#25351;&#25968;&#32423;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#32780;&#26368;&#20248;&#22810;&#39033;&#24335;&#26102;&#38388;&#20272;&#35745;&#22120;&#21482;&#33021;&#36798;&#21040;&#36739;&#24930;&#30340;&#20272;&#35745;&#38169;&#35823;&#29575;&#12290;</title><link>http://arxiv.org/abs/2308.15728</link><description>&lt;p&gt;
&#36890;&#36807;&#20302;&#27425;&#22810;&#39033;&#24335;&#35745;&#31639;&#22270;&#35770;&#20272;&#35745;&#30340;&#19979;&#30028;
&lt;/p&gt;
&lt;p&gt;
Computational Lower Bounds for Graphon Estimation via Low-degree Polynomials. (arXiv:2308.15728v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15728
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20302;&#27425;&#22810;&#39033;&#24335;&#35745;&#31639;&#22270;&#35770;&#20272;&#35745;&#23384;&#22312;&#35745;&#31639;&#38556;&#30861;&#65292;&#20256;&#32479;&#30340;&#20248;&#21270;&#20272;&#35745;&#26041;&#27861;&#20855;&#26377;&#25351;&#25968;&#32423;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#32780;&#26368;&#20248;&#22810;&#39033;&#24335;&#26102;&#38388;&#20272;&#35745;&#22120;&#21482;&#33021;&#36798;&#21040;&#36739;&#24930;&#30340;&#20272;&#35745;&#38169;&#35823;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#35770;&#20272;&#35745;&#26159;&#32593;&#32476;&#20998;&#26512;&#20013;&#26368;&#22522;&#26412;&#30340;&#38382;&#39064;&#20043;&#19968;&#65292;&#22312;&#36807;&#21435;&#21313;&#24180;&#20013;&#21463;&#21040;&#20102;&#30456;&#24403;&#22823;&#30340;&#20851;&#27880;&#12290;&#20174;&#32479;&#35745;&#23398;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#39640;&#31561;&#25552;&#20986;&#20102;&#23545;&#20110;&#38543;&#26426;&#22359;&#27169;&#22411;&#65288;SBM&#65289;&#21644;&#38750;&#21442;&#25968;&#22270;&#35770;&#20272;&#35745;&#30340;&#22270;&#35770;&#20272;&#35745;&#30340;&#26497;&#23567;&#26497;&#24046;&#35823;&#24046;&#29575;&#12290;&#32479;&#35745;&#20248;&#21270;&#20272;&#35745;&#26159;&#22522;&#20110;&#32422;&#26463;&#26368;&#23567;&#20108;&#20056;&#27861;&#65292;&#24182;&#19988;&#22312;&#32500;&#24230;&#19978;&#20855;&#26377;&#25351;&#25968;&#32423;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#12290;&#20174;&#35745;&#31639;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#24050;&#30693;&#30340;&#26368;&#20248;&#22810;&#39033;&#24335;&#26102;&#38388;&#20272;&#35745;&#22120;&#26159;&#22522;&#20110;&#36890;&#29992;&#22855;&#24322;&#20540;&#38408;&#20540;&#65288;USVT&#65289;&#65292;&#20294;&#26159;&#23427;&#21482;&#33021;&#36798;&#21040;&#27604;&#26497;&#23567;&#26497;&#24046;&#38169;&#35823;&#29575;&#24930;&#24471;&#22810;&#30340;&#20272;&#35745;&#38169;&#35823;&#29575;&#12290;&#20154;&#20204;&#33258;&#28982;&#20250;&#24819;&#30693;&#36947;&#36825;&#26679;&#30340;&#24046;&#36317;&#26159;&#21542;&#26159;&#24517;&#35201;&#30340;&#12290;USVT&#30340;&#35745;&#31639;&#20248;&#21270;&#24615;&#25110;&#22270;&#35770;&#20272;&#35745;&#20013;&#30340;&#35745;&#31639;&#38556;&#30861;&#30340;&#23384;&#22312;&#19968;&#30452;&#26159;&#19968;&#20010;&#38271;&#26399;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23545;&#27492;&#36808;&#20986;&#20102;&#31532;&#19968;&#27493;&#65292;&#24182;&#20026;&#22270;&#35770;&#20272;&#35745;&#30340;&#35745;&#31639;&#38556;&#30861;&#25552;&#20379;&#20102;&#20005;&#26684;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graphon estimation has been one of the most fundamental problems in network analysis and has received considerable attention in the past decade. From the statistical perspective, the minimax error rate of graphon estimation has been established by Gao et al (2015) for both stochastic block model (SBM) and nonparametric graphon estimation. The statistical optimal estimators are based on constrained least squares and have computational complexity exponential in the dimension. From the computational perspective, the best-known polynomial-time estimator is based on universal singular value thresholding (USVT), but it can only achieve a much slower estimation error rate than the minimax one. It is natural to wonder if such a gap is essential. The computational optimality of the USVT or the existence of a computational barrier in graphon estimation has been a long-standing open problem. In this work, we take the first step towards it and provide rigorous evidence for the computational barrie
&lt;/p&gt;</description></item></channel></rss>