<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#36825;&#31687;&#35770;&#25991;&#35780;&#20272;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#24773;&#20917;&#12290;&#35780;&#20272;&#25581;&#31034;&#20102;&#20004;&#20010;&#37325;&#35201;&#21457;&#29616;&#65306;&#22810;&#26102;&#24207;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#26377;&#25928;&#24615;&#65292;&#22810;&#31354;&#38388;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#25928;&#26524;&#12290;&#36825;&#31687;&#35770;&#25991;&#36824;&#35780;&#20272;&#20102;&#20004;&#31181;&#38450;&#24481;&#26426;&#21046;&#30340;&#25928;&#29992;&#21644;&#38544;&#31169;&#26435;&#34913;&#12290;</title><link>https://arxiv.org/abs/2402.06289</link><description>&lt;p&gt;
&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35780;&#20272;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#21644;&#38450;&#24481;
&lt;/p&gt;
&lt;p&gt;
Evaluating Membership Inference Attacks and Defenses in Federated Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06289
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#35780;&#20272;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#24773;&#20917;&#12290;&#35780;&#20272;&#25581;&#31034;&#20102;&#20004;&#20010;&#37325;&#35201;&#21457;&#29616;&#65306;&#22810;&#26102;&#24207;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#26377;&#25928;&#24615;&#65292;&#22810;&#31354;&#38388;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#25928;&#26524;&#12290;&#36825;&#31687;&#35770;&#25991;&#36824;&#35780;&#20272;&#20102;&#20004;&#31181;&#38450;&#24481;&#26426;&#21046;&#30340;&#25928;&#29992;&#21644;&#38544;&#31169;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;(MIAs)&#23545;&#20110;&#38544;&#31169;&#20445;&#25252;&#30340;&#23041;&#32961;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#26085;&#30410;&#22686;&#38271;&#12290;&#21322;&#35802;&#23454;&#30340;&#25915;&#20987;&#32773;&#65292;&#20363;&#22914;&#26381;&#21153;&#22120;&#65292;&#21487;&#20197;&#26681;&#25454;&#35266;&#23519;&#21040;&#30340;&#27169;&#22411;&#20449;&#24687;&#30830;&#23450;&#19968;&#20010;&#29305;&#23450;&#26679;&#26412;&#26159;&#21542;&#23646;&#20110;&#30446;&#26631;&#23458;&#25143;&#31471;&#12290;&#26412;&#25991;&#23545;&#29616;&#26377;&#30340;MIAs&#21644;&#30456;&#24212;&#30340;&#38450;&#24481;&#31574;&#30053;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#25105;&#20204;&#23545;MIAs&#30340;&#35780;&#20272;&#25581;&#31034;&#20102;&#20004;&#20010;&#37325;&#35201;&#21457;&#29616;&#12290;&#39318;&#20808;&#65292;&#32467;&#21512;&#22810;&#20010;&#36890;&#20449;&#36718;&#27425;&#30340;&#27169;&#22411;&#20449;&#24687;(&#22810;&#26102;&#24207;)&#30456;&#27604;&#20110;&#21033;&#29992;&#21333;&#20010;&#26102;&#26399;&#30340;&#27169;&#22411;&#20449;&#24687;&#25552;&#39640;&#20102;MIAs&#30340;&#25972;&#20307;&#26377;&#25928;&#24615;&#12290;&#20854;&#27425;&#65292;&#22312;&#38750;&#30446;&#26631;&#23458;&#25143;&#31471;(Multi-spatial)&#20013;&#34701;&#20837;&#27169;&#22411;&#26174;&#33879;&#25552;&#39640;&#20102;MIAs&#30340;&#25928;&#26524;&#65292;&#29305;&#21035;&#26159;&#24403;&#23458;&#25143;&#31471;&#30340;&#25968;&#25454;&#26159;&#21516;&#36136;&#30340;&#26102;&#20505;&#12290;&#36825;&#20984;&#26174;&#20102;&#22312;MIAs&#20013;&#32771;&#34385;&#26102;&#24207;&#21644;&#31354;&#38388;&#27169;&#22411;&#20449;&#24687;&#30340;&#37325;&#35201;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36890;&#36807;&#38544;&#31169;-&#25928;&#29992;&#26435;&#34913;&#35780;&#20272;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#38450;&#24481;&#26426;&#21046;&#23545;MIAs&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Membership Inference Attacks (MIAs) pose a growing threat to privacy preservation in federated learning. The semi-honest attacker, e.g., the server, may determine whether a particular sample belongs to a target client according to the observed model information. This paper conducts an evaluation of existing MIAs and corresponding defense strategies. Our evaluation on MIAs reveals two important findings about the trend of MIAs. Firstly, combining model information from multiple communication rounds (Multi-temporal) enhances the overall effectiveness of MIAs compared to utilizing model information from a single epoch. Secondly, incorporating models from non-target clients (Multi-spatial) significantly improves the effectiveness of MIAs, particularly when the clients' data is homogeneous. This highlights the importance of considering the temporal and spatial model information in MIAs. Next, we assess the effectiveness via privacy-utility tradeoff for two type defense mechanisms against MI
&lt;/p&gt;</description></item></channel></rss>