<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#25968;&#23383;&#23402;&#29983;&#25216;&#26415;&#22312;&#22303;&#26408;&#24037;&#31243;&#39046;&#22495;&#30340;&#37319;&#29992;&#31574;&#30053;&#38656;&#35201;&#37325;&#26032;&#23450;&#20301;&#65292;&#20197;&#35299;&#20915;&#19981;&#21516;&#38454;&#27573;&#30340;&#25361;&#25112;&#21644;&#24212;&#29992;&#20998;&#25955;&#24615;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.02426</link><description>&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#21644;&#22303;&#26408;&#24037;&#31243;&#38454;&#27573;&#65306;&#37325;&#26032;&#23450;&#20301;&#37319;&#29992;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Digital Twins and Civil Engineering Phases: Reorienting Adoption Strategies
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02426
&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#25216;&#26415;&#22312;&#22303;&#26408;&#24037;&#31243;&#39046;&#22495;&#30340;&#37319;&#29992;&#31574;&#30053;&#38656;&#35201;&#37325;&#26032;&#23450;&#20301;&#65292;&#20197;&#35299;&#20915;&#19981;&#21516;&#38454;&#27573;&#30340;&#25361;&#25112;&#21644;&#24212;&#29992;&#20998;&#25955;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#65288;DT&#65289;&#25216;&#26415;&#22810;&#24180;&#26469;&#21463;&#21040;&#26497;&#22823;&#20851;&#27880;&#65292;&#22240;&#20026;&#23427;&#20026;&#31185;&#23398;&#21644;&#24037;&#31243;&#21508;&#21033;&#30410;&#30456;&#20851;&#32773;&#24102;&#26469;&#20102;&#35768;&#22810;&#25215;&#35834;&#12290;&#22240;&#27492;&#65292;&#20154;&#20204;&#25506;&#35752;&#20102;&#25968;&#23383;&#23402;&#29983;&#30340;&#19981;&#21516;&#20027;&#39064;&#39046;&#22495;&#12290;&#22303;&#26408;&#24037;&#31243;&#31561;&#29305;&#23450;&#39046;&#22495;&#20063;&#19981;&#20363;&#22806;&#65292;&#23548;&#33268;&#20102;&#38024;&#23545;&#29305;&#23450;&#39046;&#22495;&#24212;&#29992;&#30340;&#30862;&#29255;&#21270;&#26041;&#27861;&#12290;&#22303;&#26408;&#24037;&#31243;&#34892;&#19994;&#22312;&#36825;&#26041;&#38754;&#36827;&#19968;&#27493;&#22788;&#20110;&#19981;&#21033;&#22320;&#20301;&#65292;&#22240;&#20026;&#23427;&#20381;&#36182;&#20854;&#20182;&#24037;&#31243;&#39046;&#22495;&#30340;&#22806;&#37096;&#25216;&#26415;&#26469;&#36827;&#34892;&#25968;&#23383;&#23402;&#29983;&#30340;&#37319;&#29992;&#12290;&#36825;&#20123;&#25193;&#23637;&#30340;&#19968;&#20010;&#19981;&#26029;&#22686;&#21152;&#30340;&#21518;&#26524;&#26159;&#23558;&#25968;&#23383;&#23402;&#29983;&#38598;&#20013;&#24212;&#29992;&#20110;&#36816;&#33829;&#21644;&#32500;&#25252;&#38454;&#27573;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#24314;&#31569;&#20449;&#24687;&#24314;&#27169;&#65288;BIM&#65289;&#34987;&#24191;&#27867;&#29992;&#20110;&#35268;&#21010;/&#35774;&#35745;&#38454;&#27573;&#65292;&#32780;&#26045;&#24037;&#38454;&#27573;&#30340;&#30636;&#21464;&#24615;&#36136;&#23545;&#20110;&#25968;&#23383;&#23402;&#29983;&#30340;&#37319;&#29992;&#26500;&#25104;&#20102;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25968;&#23383;&#23402;&#29983;&#22312;&#24314;&#31569;&#35774;&#35745;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02426v1 Announce Type: cross  Abstract: Digital twin (DT) technology has received immense attention over the years due to the promises it presents to various stakeholders in science and engineering. As a result, different thematic areas of DT have been explored. This is no different in specific fields such as manufacturing, automation, oil and gas, and civil engineering, leading to fragmented approaches for field-specific applications. The civil engineering industry is further disadvantaged in this regard as it relies on external techniques by other engineering fields for its DT adoption. A rising consequence of these extensions is a concentrated application of DT to the operations and maintenance phase. On another spectrum, Building Information Modeling (BIM) are pervasively utilized in the planning/design phase, and the transient nature of the construction phase remains a challenge for its DT adoption. In this paper, we present a phase-based development of DT in the Archit
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25193;&#23637;&#20102;&#19968;&#20010;&#25968;&#20540;&#27169;&#25311;&#26041;&#27861;&#65292;&#29992;&#20110;&#30740;&#31350;&#35746;&#21333;&#31807;&#20013;&#37329;&#34701;&#24066;&#22330;&#35746;&#21333;&#30340;&#24322;&#24120;&#25193;&#25955;&#21644;&#20215;&#26684;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#36830;&#32493;&#21040;&#36798;&#12289;&#21462;&#28040;&#21644;&#25193;&#25955;&#30340;&#35746;&#21333;&#20197;&#21450;&#20449;&#24687;&#20914;&#20987;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#24773;&#20917;&#19979;&#30340;&#20914;&#20987;&#21709;&#24212;&#21644;&#39118;&#26684;&#29305;&#28857;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25968;&#20540;&#26041;&#27861;&#33021;&#29983;&#25104;&#27874;&#32441;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25193;&#25955;&#21160;&#21147;&#23398;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#38750;&#22343;&#21248;&#37319;&#26679;&#20316;&#20026;&#39318;&#36873;&#30340;&#27169;&#25311;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.06079</link><description>&lt;p&gt;
&#35746;&#21333;&#31807;&#27969;&#38480;&#26681;&#25454;&#38750;&#22343;&#21248;&#37319;&#26679;&#21644;&#38750;&#32447;&#24615;&#25193;&#25955;&#26465;&#20214;&#19979;&#30340;&#24322;&#24120;&#25193;&#25955;&#21644;&#20215;&#26684;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Anomalous diffusion and price impact in the fluid-limit of an order book. (arXiv:2310.06079v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06079
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25193;&#23637;&#20102;&#19968;&#20010;&#25968;&#20540;&#27169;&#25311;&#26041;&#27861;&#65292;&#29992;&#20110;&#30740;&#31350;&#35746;&#21333;&#31807;&#20013;&#37329;&#34701;&#24066;&#22330;&#35746;&#21333;&#30340;&#24322;&#24120;&#25193;&#25955;&#21644;&#20215;&#26684;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#36830;&#32493;&#21040;&#36798;&#12289;&#21462;&#28040;&#21644;&#25193;&#25955;&#30340;&#35746;&#21333;&#20197;&#21450;&#20449;&#24687;&#20914;&#20987;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#24773;&#20917;&#19979;&#30340;&#20914;&#20987;&#21709;&#24212;&#21644;&#39118;&#26684;&#29305;&#28857;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25968;&#20540;&#26041;&#27861;&#33021;&#29983;&#25104;&#27874;&#32441;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25193;&#25955;&#21160;&#21147;&#23398;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#38750;&#22343;&#21248;&#37319;&#26679;&#20316;&#20026;&#39318;&#36873;&#30340;&#27169;&#25311;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25193;&#23637;&#20102;&#19968;&#20010;&#31163;&#25955;&#26102;&#38388;&#38543;&#26426;&#28216;&#36208;&#65288;DTRW&#65289;&#30340;&#25968;&#20540;&#27169;&#25311;&#26041;&#27861;&#65292;&#29992;&#20110;&#27169;&#25311;&#27169;&#25311;&#35746;&#21333;&#31807;&#20013;&#37329;&#34701;&#24066;&#22330;&#35746;&#21333;&#30340;&#24322;&#24120;&#25193;&#25955;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20351;&#29992;Sibuya&#31561;&#24453;&#26102;&#38388;&#30340;&#38543;&#26426;&#28216;&#36208;&#26469;&#21253;&#25324;&#19968;&#20010;&#26102;&#38388;&#30456;&#20851;&#30340;&#38543;&#26426;&#24378;&#36843;&#20989;&#25968;&#65292;&#35813;&#20989;&#25968;&#20855;&#26377;&#38750;&#22343;&#21248;&#37319;&#26679;&#30340;&#35746;&#21333;&#31807;&#20107;&#20214;&#20043;&#38388;&#30340;&#26102;&#38388;&#12290;&#36825;&#20010;&#27169;&#22411;&#27169;&#25311;&#20102;&#35746;&#21333;&#31807;&#30340;&#27969;&#38480;&#65292;&#27169;&#25311;&#20102;&#35746;&#21333;&#30340;&#36830;&#32493;&#21040;&#36798;&#12289;&#21462;&#28040;&#21644;&#25193;&#25955;&#65292;&#20197;&#21450;&#20449;&#24687;&#20914;&#20987;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#24378;&#36843;&#20989;&#25968;&#21644;&#27169;&#22411;&#21442;&#25968;&#19979;&#32463;&#21382;&#24322;&#24120;&#25193;&#25955;&#30340;&#35746;&#21333;&#30340;&#20914;&#20987;&#21709;&#24212;&#21644;&#39118;&#26684;&#29305;&#28857;&#12290;&#20855;&#20307;&#22320;&#35828;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#38378;&#30005;&#38480;&#20215;&#21333;&#21644;&#24066;&#20215;&#21333;&#30340;&#20215;&#26684;&#24433;&#21709;&#65292;&#24182;&#23637;&#31034;&#20102;&#25968;&#20540;&#26041;&#27861;&#22914;&#20309;&#29983;&#25104;&#20215;&#26684;&#24433;&#21709;&#20013;&#30340;&#27874;&#32441;&#12290;&#25105;&#20204;&#20351;&#29992;&#19977;&#27425;&#26679;&#26465;&#25554;&#20540;&#29983;&#25104;&#24179;&#28369;&#30340;&#20215;&#26684;&#24433;&#21709;&#26354;&#32447;&#12290;&#36825;&#39033;&#24037;&#20316;&#25512;&#24191;&#20102;&#22312;&#25193;&#25955;&#21160;&#21147;&#23398;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#38750;&#22343;&#21248;&#37319;&#26679;&#20316;&#20026;&#39318;&#36873;&#30340;&#27169;&#25311;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We extend a Discrete Time Random Walk (DTRW) numerical scheme to simulate the anomalous diffusion of financial market orders in a simulated order book. Here using random walks with Sibuya waiting times to include a time-dependent stochastic forcing function with non-uniformly sampled times between order book events in the setting of fractional diffusion. This models the fluid limit of an order book by modelling the continuous arrival, cancellation and diffusion of orders in the presence of information shocks. We study the impulse response and stylised facts of orders undergoing anomalous diffusion for different forcing functions and model parameters. Concretely, we demonstrate the price impact for flash limit-orders and market orders and show how the numerical method generate kinks in the price impact. We use cubic spline interpolation to generate smoothed price impact curves. The work promotes the use of non-uniform sampling in the presence of diffusive dynamics as the preferred simul
&lt;/p&gt;</description></item></channel></rss>