<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#22522;&#20110;PROVEXPLAINER&#26694;&#26550;&#65292;&#36890;&#36807;&#22797;&#21046;GNN-based security models&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#21033;&#29992;&#20915;&#31574;&#26641;&#21644;&#22270;&#32467;&#26500;&#29305;&#24449;&#23558;&#25277;&#35937;GNN&#20915;&#31574;&#36793;&#30028;&#25237;&#24433;&#21040;&#21487;&#35299;&#37322;&#30340;&#29305;&#24449;&#31354;&#38388;&#65292;&#20197;&#22686;&#24378;GNN&#23433;&#20840;&#27169;&#22411;&#30340;&#36879;&#26126;&#24230;&#21644;&#35810;&#38382;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2306.00934</link><description>&lt;p&gt;
&#22522;&#20110;&#26435;&#23041;&#22270;&#32467;&#26500;&#29305;&#24449;&#23545;&#22522;&#20110;GNN&#30340;IDS&#26816;&#27979;&#36827;&#34892;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Interpreting GNN-based IDS Detections Using Provenance Graph Structural Features. (arXiv:2306.00934v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00934
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;PROVEXPLAINER&#26694;&#26550;&#65292;&#36890;&#36807;&#22797;&#21046;GNN-based security models&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#21033;&#29992;&#20915;&#31574;&#26641;&#21644;&#22270;&#32467;&#26500;&#29305;&#24449;&#23558;&#25277;&#35937;GNN&#20915;&#31574;&#36793;&#30028;&#25237;&#24433;&#21040;&#21487;&#35299;&#37322;&#30340;&#29305;&#24449;&#31354;&#38388;&#65292;&#20197;&#22686;&#24378;GNN&#23433;&#20840;&#27169;&#22411;&#30340;&#36879;&#26126;&#24230;&#21644;&#35810;&#38382;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22797;&#26434;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#40657;&#21283;&#23376;&#26412;&#36136;&#22952;&#30861;&#20102;&#23427;&#20204;&#22312;&#23433;&#20840;&#39046;&#22495;&#30340;&#26222;&#21450;&#65292;&#22240;&#20026;&#23427;&#20204;&#32570;&#20047;&#36923;&#36753;&#35299;&#37322;&#21644;&#21487;&#25191;&#34892;&#21518;&#32493;&#34892;&#21160;&#30340;&#39044;&#27979;&#12290;&#20026;&#20102;&#22686;&#24378;&#22312;&#31995;&#32479;&#26469;&#28304;&#20998;&#26512;&#20013;&#20351;&#29992;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#23433;&#20840;&#27169;&#22411;&#30340;&#36879;&#26126;&#24230;&#21644;&#38382;&#36131;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;PROVEXPLAINER&#65292;&#19968;&#31181;&#23558;&#25277;&#35937;GNN&#20915;&#31574;&#36793;&#30028;&#25237;&#24433;&#21040;&#21487;&#35299;&#37322;&#29305;&#24449;&#31354;&#38388;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#39318;&#20808;&#20351;&#29992;&#31616;&#21333;&#19988;&#21487;&#35299;&#37322;&#30340;&#27169;&#22411;&#65292;&#22914;&#20915;&#31574;&#26641;&#65288;DT&#65289;&#65292;&#22797;&#21046;&#22522;&#20110;GNN&#30340;&#23433;&#20840;&#27169;&#22411;&#30340;&#20915;&#31574;&#36807;&#31243;&#12290;&#20026;&#20102;&#26368;&#22823;&#21270;&#26367;&#20195;&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;&#21644;&#20445;&#30495;&#24230;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32463;&#20856;&#22270;&#35770;&#30340;&#22270;&#32467;&#26500;&#29305;&#24449;&#65292;&#24182;&#36890;&#36807;&#23433;&#20840;&#39046;&#22495;&#30693;&#35782;&#30340;&#24191;&#27867;&#25968;&#25454;&#30740;&#31350;&#23545;&#20854;&#36827;&#34892;&#20102;&#22686;&#24378;&#12290;&#25105;&#20204;&#30340;&#22270;&#32467;&#26500;&#29305;&#24449;&#19982;&#31995;&#32479;&#26469;&#28304;&#39046;&#22495;&#20013;&#30340;&#38382;&#39064;&#31354;&#38388;&#34892;&#21160;&#23494;&#20999;&#30456;&#20851;&#65292;&#36825;&#20351;&#26816;&#27979;&#32467;&#26524;&#21487;&#29992;&#20154;&#31867;&#35821;&#35328;&#25551;&#36848;&#21644;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
The black-box nature of complex Neural Network (NN)-based models has hindered their widespread adoption in security domains due to the lack of logical explanations and actionable follow-ups for their predictions. To enhance the transparency and accountability of Graph Neural Network (GNN) security models used in system provenance analysis, we propose PROVEXPLAINER, a framework for projecting abstract GNN decision boundaries onto interpretable feature spaces.  We first replicate the decision-making process of GNNbased security models using simpler and explainable models such as Decision Trees (DTs). To maximize the accuracy and fidelity of the surrogate models, we propose novel graph structural features founded on classical graph theory and enhanced by extensive data study with security domain knowledge. Our graph structural features are closely tied to problem-space actions in the system provenance domain, which allows the detection results to be explained in descriptive, human languag
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31867;&#26426;&#21046;&#65292;&#20197;&#23454;&#29616;&#26080;&#26465;&#20214;&#26368;&#20248;&#24615;&#20445;&#35777;&#30340;&#24046;&#20998;&#38544;&#31169;&#12290;&#35813;&#26426;&#21046;&#23558;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#21046;&#23450;&#20026;&#26080;&#38480;&#32500;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.12681</link><description>&lt;p&gt;
&#20998;&#24067;&#24335;&#40065;&#26834;&#20248;&#21270;&#23454;&#29616;&#24046;&#20998;&#38544;&#31169;&#20445;&#25252;
&lt;/p&gt;
&lt;p&gt;
Differential Privacy via Distributionally Robust Optimization. (arXiv:2304.12681v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.12681
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31867;&#26426;&#21046;&#65292;&#20197;&#23454;&#29616;&#26080;&#26465;&#20214;&#26368;&#20248;&#24615;&#20445;&#35777;&#30340;&#24046;&#20998;&#38544;&#31169;&#12290;&#35813;&#26426;&#21046;&#23558;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#21046;&#23450;&#20026;&#26080;&#38480;&#32500;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#24046;&#20998;&#38544;&#31169;&#24050;&#25104;&#20026;&#20849;&#20139;&#25968;&#25454;&#38598;&#32479;&#35745;&#20449;&#24687;&#24182;&#38480;&#21046;&#28041;&#21450;&#20010;&#20154;&#30340;&#31169;&#20154;&#20449;&#24687;&#25259;&#38706;&#30340;&#20107;&#23454;&#26631;&#20934;&#12290;&#36890;&#36807;&#23545;&#23558;&#35201;&#21457;&#24067;&#30340;&#32479;&#35745;&#25968;&#25454;&#36827;&#34892;&#38543;&#26426;&#25200;&#21160;&#26469;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#36825;&#21453;&#36807;&#26469;&#23548;&#33268;&#20102;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#65306;&#26356;&#22823;&#30340;&#25200;&#21160;&#25552;&#20379;&#26356;&#24378;&#30340;&#38544;&#31169;&#20445;&#35777;&#65292;&#20294;&#32467;&#26524;&#26159;&#25552;&#20379;&#36739;&#20302;&#23454;&#29992;&#24230;&#30340;&#32479;&#35745;&#25968;&#25454;&#21644;&#26356;&#20302;&#30340;&#20934;&#30830;&#24615;&#12290;&#22240;&#27492;&#65292;&#29305;&#21035;&#24863;&#20852;&#36259;&#30340;&#26159;&#22312;&#39044;&#36873;&#38544;&#31169;&#27700;&#24179;&#30340;&#24773;&#20917;&#19979;&#25552;&#20379;&#26368;&#39640;&#20934;&#30830;&#24615;&#30340;&#26368;&#20339;&#26426;&#21046;&#12290;&#36804;&#20170;&#20026;&#27490;&#65292;&#36825;&#19968;&#39046;&#22495;&#30340;&#24037;&#20316;&#38598;&#20013;&#22312;&#20107;&#20808;&#25351;&#23450;&#25200;&#21160;&#26063;&#24182;&#38543;&#21518;&#35777;&#26126;&#20854;&#28176;&#36817;&#21644;/&#25110;&#26368;&#20339;&#24615;&#19978;&#65292;&#26412;&#25991;&#21017;&#24320;&#21457;&#20102;&#19968;&#31867;&#26426;&#21046;&#65292;&#23427;&#20204;&#20855;&#26377;&#38750;&#28176;&#36817;&#21644;&#26080;&#26465;&#20214;&#30340;&#26368;&#20339;&#24615;&#20445;&#35777;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23558;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#21046;&#23450;&#20026;&#26080;&#38480;&#32500;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, differential privacy has emerged as the de facto standard for sharing statistics of datasets while limiting the disclosure of private information about the involved individuals. This is achieved by randomly perturbing the statistics to be published, which in turn leads to a privacy-accuracy trade-off: larger perturbations provide stronger privacy guarantees, but they result in less accurate statistics that offer lower utility to the recipients. Of particular interest are therefore optimal mechanisms that provide the highest accuracy for a pre-selected level of privacy. To date, work in this area has focused on specifying families of perturbations a priori and subsequently proving their asymptotic and/or best-in-class optimality. In this paper, we develop a class of mechanisms that enjoy non-asymptotic and unconditional optimality guarantees. To this end, we formulate the mechanism design problem as an infinite-dimensional distributionally robust optimization problem. W
&lt;/p&gt;</description></item></channel></rss>