<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;FedCEO&#30340;&#26032;&#22411;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#65292;&#22312;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#30340;&#21516;&#26102;&#65292;&#36890;&#36807;&#35753;&#23458;&#25143;&#31471;&#30456;&#20114;&#21327;&#20316;&#65292;&#23454;&#29616;&#20102;&#23545;&#27169;&#22411;&#25928;&#29992;&#21644;&#38544;&#31169;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36890;&#36807;&#39640;&#25928;&#30340;&#24352;&#37327;&#20302;&#31209;&#36817;&#31471;&#20248;&#21270;&#65292;&#35813;&#26694;&#26550;&#33021;&#22815;&#24674;&#22797;&#34987;&#25171;&#26029;&#30340;&#35821;&#20041;&#20449;&#24687;&#65292;&#24182;&#22312;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2402.07002</link><description>&lt;p&gt;
&#23458;&#25143;&#31471;&#21327;&#20316;&#65306;&#20855;&#26377;&#20445;&#35777;&#38544;&#31169;-&#25928;&#29992;&#26435;&#34913;&#25913;&#36827;&#30340;&#28789;&#27963;&#24046;&#20998;&#38544;&#31169;&#32852;&#37030;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Clients Collaborate: Flexible Differentially Private Federated Learning with Guaranteed Improvement of Utility-Privacy Trade-off
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07002
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;FedCEO&#30340;&#26032;&#22411;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#65292;&#22312;&#20445;&#25252;&#29992;&#25143;&#38544;&#31169;&#30340;&#21516;&#26102;&#65292;&#36890;&#36807;&#35753;&#23458;&#25143;&#31471;&#30456;&#20114;&#21327;&#20316;&#65292;&#23454;&#29616;&#20102;&#23545;&#27169;&#22411;&#25928;&#29992;&#21644;&#38544;&#31169;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36890;&#36807;&#39640;&#25928;&#30340;&#24352;&#37327;&#20302;&#31209;&#36817;&#31471;&#20248;&#21270;&#65292;&#35813;&#26694;&#26550;&#33021;&#22815;&#24674;&#22797;&#34987;&#25171;&#26029;&#30340;&#35821;&#20041;&#20449;&#24687;&#65292;&#24182;&#22312;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#38450;&#27490;&#29992;&#25143;&#25968;&#25454;&#30340;&#38544;&#31169;&#27844;&#28431;&#65292;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#24191;&#27867;&#20351;&#29992;&#24046;&#20998;&#38544;&#31169;&#65292;&#20294;&#23427;&#24182;&#19981;&#26159;&#20813;&#36153;&#30340;&#12290;&#22122;&#22768;&#30340;&#28155;&#21152;&#20250;&#38543;&#26426;&#24178;&#25200;&#27169;&#22411;&#30340;&#35821;&#20041;&#23436;&#25972;&#24615;&#65292;&#24182;&#19988;&#36825;&#31181;&#24178;&#25200;&#20250;&#38543;&#30528;&#36890;&#20449;&#36718;&#27425;&#30340;&#22686;&#21152;&#32780;&#32047;&#31215;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#20855;&#26377;&#20005;&#26684;&#38544;&#31169;&#20445;&#35777;&#30340;&#26032;&#22411;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#65292;&#21517;&#20026;FedCEO&#65292;&#36890;&#36807;&#35753;&#23458;&#25143;&#31471;"&#30456;&#20114;&#21327;&#20316;"&#65292;&#26088;&#22312;&#22312;&#27169;&#22411;&#25928;&#29992;&#21644;&#29992;&#25143;&#38544;&#31169;&#20043;&#38388;&#25214;&#21040;&#19968;&#31181;&#26435;&#34913;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#22312;&#26381;&#21153;&#22120;&#19978;&#23545;&#22534;&#21472;&#30340;&#26412;&#22320;&#27169;&#22411;&#21442;&#25968;&#36827;&#34892;&#20102;&#39640;&#25928;&#30340;&#24352;&#37327;&#20302;&#31209;&#36817;&#31471;&#20248;&#21270;&#65292;&#23637;&#31034;&#20102;&#23427;&#22312;&#20809;&#35889;&#31354;&#38388;&#20013;&#28789;&#27963;&#25130;&#26029;&#39640;&#39057;&#32452;&#20998;&#30340;&#33021;&#21147;&#12290;&#36825;&#24847;&#21619;&#30528;&#25105;&#20204;&#30340;FedCEO&#33021;&#22815;&#36890;&#36807;&#24179;&#28369;&#20840;&#23616;&#35821;&#20041;&#31354;&#38388;&#26469;&#26377;&#25928;&#24674;&#22797;&#34987;&#25171;&#26029;&#30340;&#35821;&#20041;&#20449;&#24687;&#65292;&#20197;&#36866;&#24212;&#19981;&#21516;&#38544;&#31169;&#35774;&#32622;&#21644;&#25345;&#32493;&#30340;&#35757;&#32451;&#36807;&#31243;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;SOTA&#30340;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#36793;&#30028;&#25552;&#39640;&#20102;&#19968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;
To defend against privacy leakage of user data, differential privacy is widely used in federated learning, but it is not free. The addition of noise randomly disrupts the semantic integrity of the model and this disturbance accumulates with increased communication rounds. In this paper, we introduce a novel federated learning framework with rigorous privacy guarantees, named FedCEO, designed to strike a trade-off between model utility and user privacy by letting clients ''Collaborate with Each Other''. Specifically, we perform efficient tensor low-rank proximal optimization on stacked local model parameters at the server, demonstrating its capability to flexibly truncate high-frequency components in spectral space. This implies that our FedCEO can effectively recover the disrupted semantic information by smoothing the global semantic space for different privacy settings and continuous training processes. Moreover, we improve the SOTA utility-privacy trade-off bound by an order of $\sqr
&lt;/p&gt;</description></item></channel></rss>