<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22312;&#37327;&#23376;&#32479;&#35745;&#26597;&#35810;&#27169;&#22411;&#20869;&#23398;&#20064;&#37327;&#23376;&#36807;&#31243;&#30340;&#26694;&#26550;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#39640;&#25928;&#30340;&#23398;&#20064;&#22120;&#21644;&#21487;&#35777;&#26126;&#30340;&#24615;&#33021;&#20445;&#35777;&#12290;&#36890;&#36807;&#22312;&#23494;&#30721;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#65292;&#25581;&#31034;&#20102;&#32463;&#20856;&#35835;&#20986;&#37327;&#23376;&#29289;&#29702;&#19981;&#21487;&#20811;&#38534;&#20989;&#25968;&#30340;&#33030;&#24369;&#24615;&#65292;&#36825;&#26159;&#37327;&#23376;&#30828;&#20214;&#23433;&#20840;&#39046;&#22495;&#19968;&#20010;&#37325;&#35201;&#30340;&#24320;&#25918;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.02075</link><description>&lt;p&gt;
&#20351;&#29992;&#37327;&#23376;&#32479;&#35745;&#26597;&#35810;&#23398;&#20064;&#37327;&#23376;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Learning Quantum Processes with Quantum Statistical Queries. (arXiv:2310.02075v1 [quant-ph] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02075
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22312;&#37327;&#23376;&#32479;&#35745;&#26597;&#35810;&#27169;&#22411;&#20869;&#23398;&#20064;&#37327;&#23376;&#36807;&#31243;&#30340;&#26694;&#26550;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#39640;&#25928;&#30340;&#23398;&#20064;&#22120;&#21644;&#21487;&#35777;&#26126;&#30340;&#24615;&#33021;&#20445;&#35777;&#12290;&#36890;&#36807;&#22312;&#23494;&#30721;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#65292;&#25581;&#31034;&#20102;&#32463;&#20856;&#35835;&#20986;&#37327;&#23376;&#29289;&#29702;&#19981;&#21487;&#20811;&#38534;&#20989;&#25968;&#30340;&#33030;&#24369;&#24615;&#65292;&#36825;&#26159;&#37327;&#23376;&#30828;&#20214;&#23433;&#20840;&#39046;&#22495;&#19968;&#20010;&#37325;&#35201;&#30340;&#24320;&#25918;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#22797;&#26434;&#30340;&#37327;&#23376;&#36807;&#31243;&#26159;&#37327;&#23376;&#35745;&#31639;&#21644;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#30340;&#35768;&#22810;&#39046;&#22495;&#30340;&#19968;&#20010;&#26680;&#24515;&#25361;&#25112;&#65292;&#24212;&#29992;&#20110;&#37327;&#23376;&#22522;&#20934;&#27979;&#35797;&#12289;&#23494;&#30721;&#20998;&#26512;&#21644;&#21464;&#20998;&#37327;&#23376;&#31639;&#27861;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#31532;&#19968;&#20010;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#37327;&#23376;&#32479;&#35745;&#26597;&#35810;&#65288;QSQ&#65289;&#27169;&#22411;&#20869;&#30740;&#31350;&#37327;&#23376;&#36807;&#31243;&#23398;&#20064;&#65292;&#25552;&#20379;&#20102;&#23545;&#37327;&#23376;&#36807;&#31243;&#65288;QPSQs&#65289;&#36827;&#34892;&#32479;&#35745;&#26597;&#35810;&#30340;&#31532;&#19968;&#20010;&#27491;&#24335;&#23450;&#20041;&#12290;&#35813;&#26694;&#26550;&#20351;&#25105;&#20204;&#33021;&#22815;&#25552;&#20986;&#19968;&#31181;&#39640;&#25928;&#30340;QPSQ&#23398;&#20064;&#22120;&#65292;&#36866;&#29992;&#20110;&#20219;&#24847;&#37327;&#23376;&#36807;&#31243;&#65292;&#24182;&#38468;&#24102;&#21487;&#35777;&#26126;&#30340;&#24615;&#33021;&#20445;&#35777;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#25968;&#20540;&#27169;&#25311;&#26469;&#23637;&#31034;&#35813;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#36890;&#36807;&#22312;&#23494;&#30721;&#20998;&#26512;&#20013;&#24212;&#29992;&#35813;&#26694;&#26550;&#65292;&#31361;&#20986;&#20102;&#32463;&#20856;&#35835;&#20986;&#37327;&#23376;&#29289;&#29702;&#19981;&#21487;&#20811;&#38534;&#20989;&#25968;&#65288;CR-QPUFs&#65289;&#30340;&#33030;&#24369;&#24615;&#65292;&#35299;&#20915;&#20102;&#37327;&#23376;&#30828;&#20214;&#23433;&#20840;&#39046;&#22495;&#20013;&#30340;&#19968;&#20010;&#37325;&#35201;&#24320;&#25918;&#38382;&#39064;&#12290;&#36825;&#39033;&#24037;&#20316;&#26159;&#26397;&#30528;&#28145;&#20837;&#29702;&#35299;&#37327;&#23376;&#36807;&#31243;&#23398;&#20064;&#36808;&#20986;&#30340;&#37325;&#35201;&#19968;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Learning complex quantum processes is a central challenge in many areas of quantum computing and quantum machine learning, with applications in quantum benchmarking, cryptanalysis, and variational quantum algorithms. This paper introduces the first learning framework for studying quantum process learning within the Quantum Statistical Query (QSQ) model, providing the first formal definition of statistical queries to quantum processes (QPSQs). The framework allows us to propose an efficient QPSQ learner for arbitrary quantum processes accompanied by a provable performance guarantee. We also provide numerical simulations to demonstrate the efficacy of this algorithm. The practical relevance of this framework is exemplified through application in cryptanalysis, highlighting vulnerabilities of Classical-Readout Quantum Physical Unclonable Functions (CR-QPUFs), addressing an important open question in the field of quantum hardware security. This work marks a significant step towards underst
&lt;/p&gt;</description></item></channel></rss>