<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#36817;&#37051;&#25628;&#32034;&#30340;&#26032;&#26041;&#27861;NNS-EMD&#26469;&#36924;&#36817;&#22320;&#29699;&#31227;&#21160;&#36317;&#31163;&#65288;EMD&#65289;&#65292;&#20197;&#23454;&#29616;&#39640;&#31934;&#24230;&#12289;&#20302;&#26102;&#38388;&#22797;&#26434;&#24230;&#21644;&#39640;&#20869;&#23384;&#25928;&#29575;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20943;&#23569;&#25968;&#25454;&#28857;&#30340;&#27604;&#36739;&#25968;&#37327;&#21644;&#24182;&#34892;&#22788;&#29702;&#25552;&#20379;&#20102;&#39640;&#25928;&#30340;&#36817;&#20284;&#35745;&#31639;&#65292;&#24182;&#36890;&#36807;&#22312;GPU&#19978;&#36827;&#34892;&#21521;&#37327;&#21270;&#21152;&#36895;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22823;&#22411;&#25968;&#25454;&#38598;&#12290;</title><link>http://arxiv.org/abs/2401.07378</link><description>&lt;p&gt;
&#22522;&#20110;&#26368;&#36817;&#37051;&#25628;&#32034;&#30340;&#22320;&#29699;&#31227;&#21160;&#36317;&#31163;&#30340;&#39640;&#25928;&#36924;&#36817;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Efficient approximation of Earth Mover's Distance Based on Nearest Neighbor Search. (arXiv:2401.07378v2 [cs.CV] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07378
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#36817;&#37051;&#25628;&#32034;&#30340;&#26032;&#26041;&#27861;NNS-EMD&#26469;&#36924;&#36817;&#22320;&#29699;&#31227;&#21160;&#36317;&#31163;&#65288;EMD&#65289;&#65292;&#20197;&#23454;&#29616;&#39640;&#31934;&#24230;&#12289;&#20302;&#26102;&#38388;&#22797;&#26434;&#24230;&#21644;&#39640;&#20869;&#23384;&#25928;&#29575;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20943;&#23569;&#25968;&#25454;&#28857;&#30340;&#27604;&#36739;&#25968;&#37327;&#21644;&#24182;&#34892;&#22788;&#29702;&#25552;&#20379;&#20102;&#39640;&#25928;&#30340;&#36817;&#20284;&#35745;&#31639;&#65292;&#24182;&#36890;&#36807;&#22312;GPU&#19978;&#36827;&#34892;&#21521;&#37327;&#21270;&#21152;&#36895;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22823;&#22411;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22320;&#29699;&#31227;&#21160;&#36317;&#31163;&#65288;EMD&#65289;&#26159;&#35745;&#31639;&#26426;&#35270;&#35273;&#21644;&#20854;&#20182;&#24212;&#29992;&#39046;&#22495;&#20013;&#30340;&#20004;&#20010;&#20998;&#24067;&#20043;&#38388;&#30340;&#37325;&#35201;&#30456;&#20284;&#24230;&#24230;&#37327;&#12290;&#28982;&#32780;&#65292;&#20854;&#31934;&#30830;&#35745;&#31639;&#30340;&#35745;&#31639;&#21644;&#20869;&#23384;&#28040;&#32791;&#36739;&#22823;&#65292;&#38480;&#21046;&#20102;&#20854;&#22312;&#22823;&#35268;&#27169;&#38382;&#39064;&#19978;&#30340;&#21487;&#25193;&#23637;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;&#20026;&#20102;&#38477;&#20302;&#35745;&#31639;&#25104;&#26412;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#36817;&#20284;EMD&#31639;&#27861;&#65292;&#20294;&#23427;&#20204;&#31934;&#24230;&#36739;&#20302;&#65292;&#21487;&#33021;&#38656;&#35201;&#39069;&#22806;&#30340;&#20869;&#23384;&#20351;&#29992;&#25110;&#25163;&#21160;&#21442;&#25968;&#35843;&#25972;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;NNS-EMD&#65292;&#20351;&#29992;&#26368;&#36817;&#37051;&#25628;&#32034;&#65288;NNS&#65289;&#26469;&#36924;&#36817;EMD&#65292;&#20197;&#23454;&#29616;&#39640;&#31934;&#24230;&#12289;&#20302;&#26102;&#38388;&#22797;&#26434;&#24230;&#21644;&#39640;&#20869;&#23384;&#25928;&#29575;&#12290;NNS&#25805;&#20316;&#20943;&#23569;&#20102;&#27599;&#27425;NNS&#36845;&#20195;&#20013;&#25152;&#27604;&#36739;&#30340;&#25968;&#25454;&#28857;&#30340;&#25968;&#37327;&#65292;&#24182;&#25552;&#20379;&#20102;&#24182;&#34892;&#22788;&#29702;&#30340;&#26426;&#20250;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#22312;GPU&#19978;&#36827;&#34892;&#21521;&#37327;&#21270;&#26469;&#21152;&#36895;NNS-EMD&#65292;&#36825;&#23545;&#20110;&#22823;&#22411;&#25968;&#25454;&#38598;&#23588;&#20026;&#26377;&#30410;&#12290;&#25105;&#20204;&#23558;NNS-EMD&#19982;&#31934;&#30830;EMD&#21644;&#26368;&#20808;&#36827;&#30340;&#36817;&#20284;EMD&#31639;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Earth Mover's Distance (EMD) is an important similarity measure between two distributions, used in computer vision and many other application domains. However, its exact calculation is computationally and memory intensive, which hinders its scalability and applicability for large-scale problems. Various approximate EMD algorithms have been proposed to reduce computational costs, but they suffer lower accuracy and may require additional memory usage or manual parameter tuning. In this paper, we present a novel approach, NNS-EMD, to approximate EMD using Nearest Neighbor Search (NNS), in order to achieve high accuracy, low time complexity, and high memory efficiency. The NNS operation reduces the number of data points compared in each NNS iteration and offers opportunities for parallel processing. We further accelerate NNS-EMD via vectorization on GPU, which is especially beneficial for large datasets. We compare NNS-EMD with both the exact EMD and state-of-the-art approximate EMD algori
&lt;/p&gt;</description></item></channel></rss>