<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#26041;&#27861;&#22312;&#31038;&#20132;&#23186;&#20307;&#20013;&#26816;&#27979;&#25233;&#37057;&#30151;&#30340;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21019;&#26032;&#22320;&#26816;&#27979;&#21644;&#35299;&#37322;&#25233;&#37057;&#30151;&#29366;&#21450;&#20854;&#25345;&#32493;&#26102;&#38388;&#65292;&#24182;&#36890;&#36807;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#30340;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#21457;&#29616;&#20102;&#26032;&#30340;&#26410;&#27880;&#24847;&#21040;&#30340;&#30151;&#29366;&#12290;</title><link>http://arxiv.org/abs/2305.13127</link><description>&lt;p&gt;
&#20160;&#20040;&#30151;&#29366;&#20197;&#21450;&#25345;&#32493;&#22810;&#20037;&#65311;&#19968;&#31181;&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#26041;&#27861;&#29992;&#20110;&#31038;&#20132;&#23186;&#20307;&#20013;&#30340;&#25233;&#37057;&#30151;&#26816;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
What Symptoms and How Long? An Interpretable AI Approach for Depression Detection in Social Media. (arXiv:2305.13127v2 [q-bio.QM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13127
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#26041;&#27861;&#22312;&#31038;&#20132;&#23186;&#20307;&#20013;&#26816;&#27979;&#25233;&#37057;&#30151;&#30340;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21019;&#26032;&#22320;&#26816;&#27979;&#21644;&#35299;&#37322;&#25233;&#37057;&#30151;&#29366;&#21450;&#20854;&#25345;&#32493;&#26102;&#38388;&#65292;&#24182;&#36890;&#36807;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#30340;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#21457;&#29616;&#20102;&#26032;&#30340;&#26410;&#27880;&#24847;&#21040;&#30340;&#30151;&#29366;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25233;&#37057;&#30151;&#26159;&#26368;&#24120;&#35265;&#21644;&#20005;&#37325;&#30340;&#31934;&#31070;&#30142;&#30149;&#65292;&#24341;&#21457;&#20102;&#20005;&#37325;&#30340;&#32463;&#27982;&#21644;&#31038;&#20250;&#24433;&#21709;&#12290;&#25233;&#37057;&#30151;&#30340;&#26816;&#27979;&#23545;&#20110;&#26089;&#26399;&#24178;&#39044;&#20197;&#20943;&#36731;&#36825;&#20123;&#21518;&#26524;&#33267;&#20851;&#37325;&#35201;&#12290;&#36825;&#31181;&#39640;&#39118;&#38505;&#30340;&#20915;&#31574;&#26412;&#36136;&#19978;&#38656;&#35201;&#21487;&#35299;&#37322;&#24615;&#12290;&#34429;&#28982;&#26377;&#19968;&#20123;&#25233;&#37057;&#30151;&#26816;&#27979;&#30740;&#31350;&#35797;&#22270;&#22522;&#20110;&#37325;&#35201;&#24615;&#20998;&#25968;&#25110;&#20851;&#27880;&#26435;&#37325;&#35299;&#37322;&#20915;&#31574;&#65292;&#20294;&#36825;&#20123;&#35299;&#37322;&#19982;&#20020;&#24202;&#25233;&#37057;&#30151;&#35786;&#26029;&#26631;&#20934;&#19981;&#19968;&#33268;&#65292;&#21518;&#32773;&#22522;&#20110;&#25233;&#37057;&#30151;&#29366;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#36981;&#24490;&#35745;&#31639;&#35774;&#35745;&#31185;&#23398;&#33539;&#24335;&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#23610;&#24230;&#26102;&#38388;&#21407;&#22411;&#32593;&#32476;(MSTPNet)&#12290;MSTPNet&#21019;&#26032;&#22320;&#26816;&#27979;&#21644;&#35299;&#37322;&#25233;&#37057;&#30151;&#29366;&#21450;&#20854;&#25345;&#32493;&#26102;&#38388;&#12290;&#20351;&#29992;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#36827;&#34892;&#28145;&#20837;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#65292;MSTPNet&#22312;F1&#20998;&#25968;0.851&#19978;&#20248;&#20110;&#26368;&#20808;&#36827;&#30340;&#25233;&#37057;&#30151;&#26816;&#27979;&#26041;&#27861;&#12290;&#36825;&#20010;&#32467;&#26524;&#36824;&#25581;&#31034;&#20102;&#26410;&#22312;&#35843;&#26597;&#26041;&#27861;&#20013;&#27880;&#24847;&#21040;&#30340;&#26032;&#30151;&#29366;&#65292;&#20363;&#22914;&#20998;&#20139;&#12290;
&lt;/p&gt;
&lt;p&gt;
Depression is the most prevalent and serious mental illness, which induces grave financial and societal ramifications. Depression detection is key for early intervention to mitigate those consequences. Such a high-stake decision inherently necessitates interpretability. Although a few depression detection studies attempt to explain the decision based on the importance score or attention weights, these explanations misalign with the clinical depression diagnosis criterion that is based on depressive symptoms. To fill this gap, we follow the computational design science paradigm to develop a novel Multi-Scale Temporal Prototype Network (MSTPNet). MSTPNet innovatively detects and interprets depressive symptoms as well as how long they last. Extensive empirical analyses using a large-scale dataset show that MSTPNet outperforms state-of-the-art depression detection methods with an F1-score of 0.851. This result also reveals new symptoms that are unnoted in the survey approach, such as shari
&lt;/p&gt;</description></item></channel></rss>