<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26041;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#37322;&#26041;&#27861;&#65292;&#29983;&#25104;&#22810;&#20010;&#21453;&#20107;&#23454;&#31034;&#20363;&#20197;&#25429;&#33719;&#24322;&#24120;&#30340;&#22810;&#26679;&#27010;&#24565;&#65292;&#20026;&#29992;&#25143;&#25552;&#20379;&#23545;&#35302;&#21457;&#24322;&#24120;&#26816;&#27979;&#22120;&#26426;&#21046;&#30340;&#39640;&#32423;&#35821;&#20041;&#35299;&#37322;&#65292;&#20801;&#35768;&#25506;&#32034;&#8220;&#20551;&#35774;&#24773;&#26223;&#8221;&#12290;</title><link>https://arxiv.org/abs/2402.14469</link><description>&lt;p&gt;
&#37325;&#26032;&#26500;&#24819;&#24322;&#24120;&#65306;&#22914;&#26524;&#24322;&#24120;&#26159;&#27491;&#24120;&#30340;&#21602;&#65311;
&lt;/p&gt;
&lt;p&gt;
Reimagining Anomalies: What If Anomalies Were Normal?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14469
&lt;/p&gt;
&lt;p&gt;
&#26041;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#37322;&#26041;&#27861;&#65292;&#29983;&#25104;&#22810;&#20010;&#21453;&#20107;&#23454;&#31034;&#20363;&#20197;&#25429;&#33719;&#24322;&#24120;&#30340;&#22810;&#26679;&#27010;&#24565;&#65292;&#20026;&#29992;&#25143;&#25552;&#20379;&#23545;&#35302;&#21457;&#24322;&#24120;&#26816;&#27979;&#22120;&#26426;&#21046;&#30340;&#39640;&#32423;&#35821;&#20041;&#35299;&#37322;&#65292;&#20801;&#35768;&#25506;&#32034;&#8220;&#20551;&#35774;&#24773;&#26223;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#22312;&#22270;&#20687;&#24322;&#24120;&#26816;&#27979;&#26041;&#38754;&#21462;&#24471;&#20102;&#31361;&#30772;&#65292;&#20294;&#20854;&#22797;&#26434;&#24615;&#32473;&#29702;&#35299;&#20026;&#20309;&#23454;&#20363;&#34987;&#39044;&#27979;&#20026;&#24322;&#24120;&#24102;&#26469;&#20102;&#30456;&#24403;&#22823;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#37322;&#26041;&#27861;&#65292;&#20026;&#27599;&#20010;&#24322;&#24120;&#29983;&#25104;&#22810;&#20010;&#21453;&#20107;&#23454;&#31034;&#20363;&#65292;&#25429;&#33719;&#24322;&#24120;&#30340;&#22810;&#26679;&#27010;&#24565;&#12290;&#21453;&#20107;&#23454;&#31034;&#20363;&#26159;&#23545;&#24322;&#24120;&#30340;&#20462;&#25913;&#65292;&#34987;&#24322;&#24120;&#26816;&#27979;&#22120;&#35270;&#20026;&#27491;&#24120;&#12290;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#35302;&#21457;&#24322;&#24120;&#26816;&#27979;&#22120;&#26426;&#21046;&#30340;&#39640;&#32423;&#35821;&#20041;&#35299;&#37322;&#65292;&#20801;&#35768;&#29992;&#25143;&#25506;&#32034;&#8220;&#20551;&#35774;&#24773;&#26223;&#8221;&#12290;&#23545;&#19981;&#21516;&#22270;&#20687;&#25968;&#25454;&#38598;&#36827;&#34892;&#30340;&#23450;&#24615;&#21644;&#23450;&#37327;&#20998;&#26512;&#26174;&#31034;&#65292;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#26368;&#20808;&#36827;&#30340;&#24322;&#24120;&#26816;&#27979;&#22120;&#21487;&#20197;&#23454;&#29616;&#23545;&#26816;&#27979;&#22120;&#30340;&#39640;&#36136;&#37327;&#35821;&#20041;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14469v1 Announce Type: cross  Abstract: Deep learning-based methods have achieved a breakthrough in image anomaly detection, but their complexity introduces a considerable challenge to understanding why an instance is predicted to be anomalous. We introduce a novel explanation method that generates multiple counterfactual examples for each anomaly, capturing diverse concepts of anomalousness. A counterfactual example is a modification of the anomaly that is perceived as normal by the anomaly detector. The method provides a high-level semantic explanation of the mechanism that triggered the anomaly detector, allowing users to explore "what-if scenarios." Qualitative and quantitative analyses across various image datasets show that the method applied to state-of-the-art anomaly detectors can achieve high-quality semantic explanations of detectors.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#22270;&#20687;&#20998;&#31867;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#26816;&#27979;&#29642;&#29786;&#30977;&#30340;&#25439;&#20260;&#12290;&#35813;&#27169;&#22411;&#21033;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#35782;&#21035;&#21644;&#21306;&#20998;&#20581;&#24247;&#29642;&#29786;&#21644;&#30333;&#21270;&#29642;&#29786;&#30340;&#35270;&#35273;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2308.04337</link><description>&lt;p&gt;
&#22522;&#20110;&#22270;&#20687;&#20998;&#31867;&#30340;&#29642;&#29786;&#30977;&#25439;&#20260;&#26816;&#27979;&#27169;&#22411;&#30340;&#24320;&#21457;
&lt;/p&gt;
&lt;p&gt;
Pengembangan Model untuk Mendeteksi Kerusakan pada Terumbu Karang dengan Klasifikasi Citra. (arXiv:2308.04337v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04337
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#22270;&#20687;&#20998;&#31867;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#26816;&#27979;&#29642;&#29786;&#30977;&#30340;&#25439;&#20260;&#12290;&#35813;&#27169;&#22411;&#21033;&#29992;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#35782;&#21035;&#21644;&#21306;&#20998;&#20581;&#24247;&#29642;&#29786;&#21644;&#30333;&#21270;&#29642;&#29786;&#30340;&#35270;&#35273;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21360;&#24230;&#23612;&#35199;&#20122;&#27700;&#22495;&#20016;&#23500;&#30340;&#29642;&#29786;&#30977;&#29983;&#29289;&#22810;&#26679;&#24615;&#26159;&#19968;&#39033;&#23453;&#36149;&#30340;&#36164;&#20135;&#65292;&#38656;&#35201;&#24471;&#21040;&#20445;&#25252;&#12290;&#24555;&#36895;&#30340;&#27668;&#20505;&#21464;&#21270;&#21644;&#19981;&#21463;&#25511;&#21046;&#30340;&#20154;&#31867;&#27963;&#21160;&#23548;&#33268;&#20102;&#29642;&#29786;&#30977;&#29983;&#24577;&#31995;&#32479;&#30340;&#36864;&#21270;&#65292;&#21253;&#25324;&#29642;&#29786;&#30333;&#21270;&#65292;&#36825;&#26159;&#29642;&#29786;&#20581;&#24247;&#29366;&#20917;&#30340;&#19968;&#20010;&#20851;&#38190;&#25351;&#26631;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#26088;&#22312;&#24320;&#21457;&#19968;&#20010;&#20934;&#30830;&#30340;&#20998;&#31867;&#27169;&#22411;&#65292;&#29992;&#20110;&#21306;&#20998;&#20581;&#24247;&#29642;&#29786;&#21644;&#32463;&#21382;&#30333;&#21270;&#30340;&#29642;&#29786;&#12290;&#26412;&#30740;&#31350;&#21033;&#29992;&#20102;&#19968;&#20010;&#19987;&#38376;&#30340;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#21547;&#20174;Flickr&#25910;&#38598;&#30340;923&#20010;&#22270;&#20687;&#65292;&#20351;&#29992;Flickr API&#36827;&#34892;&#26816;&#32034;&#12290;&#35813;&#25968;&#25454;&#38598;&#21253;&#21547;&#20004;&#20010;&#19981;&#21516;&#30340;&#31867;&#21035;&#65306;&#20581;&#24247;&#29642;&#29786;&#65288;438&#20010;&#22270;&#20687;&#65289;&#21644;&#30333;&#21270;&#29642;&#29786;&#65288;485&#20010;&#22270;&#20687;&#65289;&#12290;&#36825;&#20123;&#22270;&#20687;&#24050;&#34987;&#35843;&#25972;&#22823;&#23567;&#65292;&#23485;&#24230;&#25110;&#39640;&#24230;&#26368;&#22823;&#20026;300&#20687;&#32032;&#65292;&#20197;&#20445;&#25345;&#25968;&#25454;&#38598;&#20013;&#30340;&#19968;&#33268;&#23610;&#23544;&#12290;&#26412;&#30740;&#31350;&#37319;&#29992;&#30340;&#26041;&#27861;&#28041;&#21450;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#29305;&#21035;&#26159;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#65292;&#26469;&#35782;&#21035;&#21644;&#21306;&#20998;&#30456;&#20851;&#30340;&#35270;&#35273;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
The abundant biodiversity of coral reefs in Indonesian waters is a valuable asset that needs to be preserved. Rapid climate change and uncontrolled human activities have led to the degradation of coral reef ecosystems, including coral bleaching, which is a critical indicator of coral health conditions. Therefore, this research aims to develop an accurate classification model to distinguish between healthy corals and corals experiencing bleaching. This study utilizes a specialized dataset consisting of 923 images collected from Flickr using the Flickr API. The dataset comprises two distinct classes: healthy corals (438 images) and bleached corals (485 images). These images have been resized to a maximum of 300 pixels in width or height, whichever is larger, to maintain consistent sizes across the dataset.  The method employed in this research involves the use of machine learning models, particularly convolutional neural networks (CNN), to recognize and differentiate visual patterns asso
&lt;/p&gt;</description></item></channel></rss>