<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26426;&#22120;&#23398;&#20064;&#20256;&#24863;&#22120;&#30340;&#26631;&#20934;&#25968;&#25454;&#34920;&#27169;&#26495;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#20027;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#36825;&#20123;&#25968;&#25454;&#34920;&#21487;&#20197;&#20419;&#36827;&#23545;&#20256;&#24863;&#22120;&#25968;&#25454;&#22312;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#30340;&#29702;&#35299;&#21644;&#21033;&#29992;&#65292;&#24182;&#25552;&#20379;&#20102;&#23458;&#35266;&#30340;&#24615;&#33021;&#35780;&#20272;&#25351;&#26631;&#12290;</title><link>http://arxiv.org/abs/2306.08848</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#20256;&#24863;&#22120;&#30340;&#25968;&#25454;&#34920;
&lt;/p&gt;
&lt;p&gt;
Datasheets for Machine Learning Sensors. (arXiv:2306.08848v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08848
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26426;&#22120;&#23398;&#20064;&#20256;&#24863;&#22120;&#30340;&#26631;&#20934;&#25968;&#25454;&#34920;&#27169;&#26495;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#20027;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#36825;&#20123;&#25968;&#25454;&#34920;&#21487;&#20197;&#20419;&#36827;&#23545;&#20256;&#24863;&#22120;&#25968;&#25454;&#22312;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#30340;&#29702;&#35299;&#21644;&#21033;&#29992;&#65292;&#24182;&#25552;&#20379;&#20102;&#23458;&#35266;&#30340;&#24615;&#33021;&#35780;&#20272;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#20256;&#24863;&#22120;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#24863;&#30693;&#33539;&#24335;&#65292;&#33021;&#22815;&#22312;&#36793;&#32536;&#36827;&#34892;&#26234;&#33021;&#21270;&#65292;&#21516;&#26102;&#36171;&#20104;&#32456;&#31471;&#29992;&#25143;&#26356;&#22810;&#23545;&#20854;&#25968;&#25454;&#30340;&#25511;&#21046;&#26435;&#12290;&#30001;&#20110;&#36825;&#20123;ML&#20256;&#24863;&#22120;&#22312;&#26234;&#33021;&#35774;&#22791;&#30340;&#21457;&#23637;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#28165;&#26224;&#22320;&#35760;&#24405;&#20854;&#35268;&#26684;&#12289;&#21151;&#33021;&#21644;&#38480;&#21046;&#38750;&#24120;&#20851;&#38190;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;ML&#20256;&#24863;&#22120;&#30340;&#26631;&#20934;&#25968;&#25454;&#34920;&#27169;&#26495;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#20027;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#21253;&#25324;&#31995;&#32479;&#30340;&#30828;&#20214;&#12289;ML&#27169;&#22411;&#21644;&#25968;&#25454;&#38598;&#23646;&#24615;&#12289;&#31471;&#21040;&#31471;&#24615;&#33021;&#25351;&#26631;&#20197;&#21450;&#29615;&#22659;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#25105;&#20204;&#33258;&#24049;ML&#20256;&#24863;&#22120;&#30340;&#31034;&#20363;&#25968;&#25454;&#34920;&#65292;&#24182;&#35814;&#32454;&#35752;&#35770;&#20102;&#27599;&#20010;&#37096;&#20998;&#12290;&#25105;&#20204;&#24378;&#35843;&#36825;&#20123;&#25968;&#25454;&#34920;&#22914;&#20309;&#20419;&#36827;&#23545;ML&#24212;&#29992;&#20013;&#20256;&#24863;&#22120;&#25968;&#25454;&#30340;&#26356;&#22909;&#29702;&#35299;&#21644;&#21033;&#29992;&#65292;&#24182;&#25552;&#20379;&#20102;&#23458;&#35266;&#30340;&#34913;&#37327;&#31995;&#32479;&#24615;&#33021;&#30340;&#25351;&#26631;&#36827;&#34892;&#35780;&#20272;&#21644;&#27604;&#36739;&#12290;ML&#20256;&#24863;&#22120;&#21450;&#20854;&#25968;&#25454;&#34920;&#20849;&#21516;&#25552;&#20379;&#20102;&#26356;&#39640;&#30340;&#38544;&#31169;&#12289;&#23433;&#20840;&#24615;&#12289;&#36879;&#26126;&#24230;&#12289;&#21487;&#35299;&#37322;&#24615;&#12289;&#21487;&#23457;&#35745;&#24615;&#21644;
&lt;/p&gt;
&lt;p&gt;
Machine learning (ML) sensors offer a new paradigm for sensing that enables intelligence at the edge while empowering end-users with greater control of their data. As these ML sensors play a crucial role in the development of intelligent devices, clear documentation of their specifications, functionalities, and limitations is pivotal. This paper introduces a standard datasheet template for ML sensors and discusses its essential components including: the system's hardware, ML model and dataset attributes, end-to-end performance metrics, and environmental impact. We provide an example datasheet for our own ML sensor and discuss each section in detail. We highlight how these datasheets can facilitate better understanding and utilization of sensor data in ML applications, and we provide objective measures upon which system performance can be evaluated and compared. Together, ML sensors and their datasheets provide greater privacy, security, transparency, explainability, auditability, and u
&lt;/p&gt;</description></item></channel></rss>