<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#24341;&#20837;&#22522;&#20110;GPT-4&#30340;&#23450;&#21046;AI&#21161;&#25163;&#65292;&#26088;&#22312;&#20419;&#36827;&#20915;&#31574;&#32773;&#12289;&#26222;&#36890;&#20844;&#20247;&#21644;&#27946;&#27700;&#39044;&#25253;&#21592;&#20043;&#38388;&#30340;&#26377;&#25928;&#27807;&#36890;&#65292;&#25552;&#21319;&#21487;&#35299;&#37322;&#24615;&#21644;&#20844;&#20247;&#21442;&#19982;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.03188</link><description>&lt;p&gt;
&#36798;&#25104;&#27665;&#20027;&#21270;&#27946;&#27700;&#39118;&#38505;&#31649;&#29702;&#65306;&#22522;&#20110;GPT-4&#30340;&#20808;&#36827;AI&#21161;&#25163;&#23454;&#29616;&#22686;&#24378;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#20844;&#20247;&#21442;&#19982;&#24230;
&lt;/p&gt;
&lt;p&gt;
Towards Democratized Flood Risk Management: An Advanced AI Assistant Enabled by GPT-4 for Enhanced Interpretability and Public Engagement
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03188
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#22522;&#20110;GPT-4&#30340;&#23450;&#21046;AI&#21161;&#25163;&#65292;&#26088;&#22312;&#20419;&#36827;&#20915;&#31574;&#32773;&#12289;&#26222;&#36890;&#20844;&#20247;&#21644;&#27946;&#27700;&#39044;&#25253;&#21592;&#20043;&#38388;&#30340;&#26377;&#25928;&#27807;&#36890;&#65292;&#25552;&#21319;&#21487;&#35299;&#37322;&#24615;&#21644;&#20844;&#20247;&#21442;&#19982;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#26102;&#27946;&#27700;&#39044;&#27979;&#22312;&#20419;&#36827;&#21450;&#26102;&#26377;&#25928;&#30340;&#24212;&#24613;&#21709;&#24212;&#26041;&#38754;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#19968;&#20010;&#37325;&#22823;&#25361;&#25112;&#22312;&#20110;&#24357;&#21512;&#22797;&#26434;&#25968;&#23383;&#27946;&#27700;&#27169;&#22411;&#19982;&#23454;&#38469;&#20915;&#31574;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#20915;&#31574;&#32773;&#32463;&#24120;&#20381;&#36182;&#19987;&#23478;&#35299;&#37322;&#36825;&#20123;&#27169;&#22411;&#65292;&#20197;&#20248;&#21270;&#27946;&#27700;&#20943;&#28798;&#31574;&#30053;&#12290;&#20844;&#20247;&#38656;&#35201;&#22797;&#26434;&#30340;&#25216;&#26415;&#26469;&#35843;&#26597;&#21644;&#29702;&#35299;&#31038;&#20250;&#25991;&#21270;&#21644;&#21046;&#24230;&#22240;&#32032;&#65292;&#36825;&#32463;&#24120;&#38459;&#30861;&#20102;&#20844;&#20247;&#23545;&#27946;&#27700;&#39118;&#38505;&#30340;&#29702;&#35299;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#39033;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#65306;&#30001;GPT-4&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25903;&#25345;&#30340;&#23450;&#21046;AI&#21161;&#25163;&#12290;&#36825;&#20010;AI&#21161;&#25163;&#26088;&#22312;&#20419;&#36827;&#20915;&#31574;&#32773;&#12289;&#26222;&#36890;&#20844;&#20247;&#21644;&#27946;&#27700;&#39044;&#25253;&#21592;&#20043;&#38388;&#30340;&#26377;&#25928;&#27807;&#36890;&#65292;&#32780;&#26080;&#38656;&#19987;&#19994;&#30693;&#35782;&#12290;&#36825;&#19968;&#26032;&#26694;&#26550;&#21033;&#29992;&#20102;GPT-4&#20808;&#36827;&#30340;&#33258;&#28982;&#35821;&#35328;&#29702;&#35299;&#21644;&#20989;&#25968;&#35843;&#29992;&#33021;&#21147;&#26469;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03188v1 Announce Type: new  Abstract: Real-time flood forecasting plays a crucial role in enabling timely and effective emergency responses. However, a significant challenge lies in bridging the gap between complex numerical flood models and practical decision-making. Decision-makers often rely on experts to interpret these models for optimizing flood mitigation strategies. And the public requires complex techniques to inquiry and understand socio-cultural and institutional factors, often hinders the public's understanding of flood risks. To overcome these challenges, our study introduces an innovative solution: a customized AI Assistant powered by the GPT-4 Large Language Model. This AI Assistant is designed to facilitate effective communication between decision-makers, the general public, and flood forecasters, without the requirement of specialized knowledge. The new framework utilizes GPT-4's advanced natural language understanding and function calling capabilities to pr
&lt;/p&gt;</description></item></channel></rss>