<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#22522;&#20110;&#30690;&#37327;&#37327;&#21270;&#30340;&#26032;&#23545;&#25239;&#24615;&#38450;&#24481;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#39640;&#32500;&#31354;&#38388;&#20013;&#25552;&#20379;&#29702;&#35770;&#20445;&#35777;&#21644;&#23454;&#39564;&#19978;&#30340;&#34920;&#29616;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2305.13651</link><description>&lt;p&gt;
&#22522;&#20110;&#30690;&#37327;&#37327;&#21270;&#30340;&#23545;&#25239;&#38450;&#24481;
&lt;/p&gt;
&lt;p&gt;
Adversarial Defenses via Vector Quantization. (arXiv:2305.13651v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13651
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#22522;&#20110;&#30690;&#37327;&#37327;&#21270;&#30340;&#26032;&#23545;&#25239;&#24615;&#38450;&#24481;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#39640;&#32500;&#31354;&#38388;&#20013;&#25552;&#20379;&#29702;&#35770;&#20445;&#35777;&#21644;&#23454;&#39564;&#19978;&#30340;&#34920;&#29616;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38543;&#26426;&#31163;&#25955;&#21270;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#22312;&#39640;&#32500;&#31354;&#38388;&#20013;&#21033;&#29992;&#30690;&#37327;&#37327;&#21270;&#24320;&#21457;&#20102;&#20004;&#31181;&#26032;&#30340;&#23545;&#25239;&#24615;&#38450;&#24481;&#26041;&#27861;&#65292;&#20998;&#21035;&#31216;&#20026;pRD&#21644;swRD&#12290;&#36825;&#20123;&#26041;&#27861;&#19981;&#20165;&#22312;&#35777;&#26126;&#20934;&#30830;&#24230;&#26041;&#38754;&#25552;&#20379;&#20102;&#29702;&#35770;&#20445;&#35777;&#65292;&#32780;&#19988;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#34920;&#26126;&#65292;&#23427;&#20204;&#30340;&#34920;&#29616;&#19982;&#24403;&#21069;&#23545;&#25239;&#38450;&#24481;&#25216;&#26415;&#30456;&#24403;&#29978;&#33267;&#26356;&#20248;&#31168;&#12290;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#25193;&#23637;&#21040;&#19968;&#31181;&#29256;&#26412;&#65292;&#20801;&#35768;&#23545;&#30446;&#26631;&#20998;&#31867;&#22120;&#36827;&#34892;&#36827;&#19968;&#27493;&#35757;&#32451;&#65292;&#24182;&#23637;&#31034;&#20986;&#36827;&#19968;&#27493;&#25913;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Building upon Randomized Discretization, we develop two novel adversarial defenses against white-box PGD attacks, utilizing vector quantization in higher dimensional spaces. These methods, termed pRD and swRD, not only offer a theoretical guarantee in terms of certified accuracy, they are also shown, via abundant experiments, to perform comparably or even superior to the current art of adversarial defenses. These methods can be extended to a version that allows further training of the target classifier and demonstrates further improved performance.
&lt;/p&gt;</description></item></channel></rss>