<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26088;&#22312;&#35774;&#35745;&#20445;&#25252;&#38544;&#31169;&#30340;&#36712;&#36857;&#21457;&#24067;&#26041;&#27861;&#30340;&#26694;&#26550;&#65292;&#29305;&#21035;&#24378;&#35843;&#20102;&#36873;&#25321;&#36866;&#24403;&#38544;&#31169;&#21333;&#20301;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.07218</link><description>&lt;p&gt;
SoK&#65306;&#36712;&#36857;&#29983;&#25104;&#26159;&#21542;&#33021;&#22815;&#20860;&#39038;&#38544;&#31169;&#21644;&#23454;&#29992;&#24615;&#65311;
&lt;/p&gt;
&lt;p&gt;
SoK: Can Trajectory Generation Combine Privacy and Utility?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07218
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26088;&#22312;&#35774;&#35745;&#20445;&#25252;&#38544;&#31169;&#30340;&#36712;&#36857;&#21457;&#24067;&#26041;&#27861;&#30340;&#26694;&#26550;&#65292;&#29305;&#21035;&#24378;&#35843;&#20102;&#36873;&#25321;&#36866;&#24403;&#38544;&#31169;&#21333;&#20301;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#20301;&#32622;&#36712;&#36857;&#20195;&#34920;&#30528;&#20379;&#21508;&#31181;&#20998;&#26512;&#21644;&#22522;&#20110;&#20301;&#32622;&#30340;&#26381;&#21153;&#30340;&#23453;&#36149;&#25968;&#25454;&#26469;&#28304;&#65292;&#20294;&#23427;&#20204;&#21487;&#33021;&#27844;&#28431;&#25935;&#24863;&#20449;&#24687;&#65292;&#22914;&#25919;&#27835;&#21644;&#23447;&#25945;&#20559;&#22909;&#12290;&#24050;&#32463;&#25552;&#20986;&#20102;&#19981;&#21516;ially private&#21457;&#24067;&#26426;&#21046;&#65292;&#20801;&#35768;&#22312;&#20005;&#26684;&#30340;&#38544;&#31169;&#20445;&#35777;&#19979;&#36827;&#34892;&#20998;&#26512;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#30340;&#20445;&#25252;&#26041;&#26696;&#23384;&#22312;&#38544;&#31169;&#21644;&#23454;&#29992;&#24615;&#30340;&#26435;&#34913;&#38480;&#21046;&#65292;&#24182;&#23481;&#26131;&#21463;&#21040;&#30456;&#20851;&#24615;&#21644;&#37325;&#26500;&#25915;&#20987;&#30340;&#23041;&#32961;&#12290;&#21512;&#25104;&#36712;&#36857;&#25968;&#25454;&#29983;&#25104;&#21644;&#21457;&#24067;&#20195;&#34920;&#20102;&#20445;&#25252;&#31639;&#27861;&#30340;&#19968;&#20010;&#20855;&#26377;&#21069;&#26223;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#34429;&#28982;&#26368;&#21021;&#30340;&#25552;&#35758;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#23454;&#29992;&#24615;&#65292;&#20294;&#26410;&#33021;&#25552;&#20379;&#20005;&#26684;&#30340;&#38544;&#31169;&#20445;&#35777;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#36890;&#36807;&#23450;&#20041;&#20116;&#20010;&#35774;&#35745;&#30446;&#26631;&#65292;&#29305;&#21035;&#24378;&#35843;&#36873;&#25321;&#36866;&#24403;&#30340;&#38544;&#31169;&#21333;&#20301;&#30340;&#37325;&#35201;&#24615;&#65292;&#26469;&#35774;&#35745;&#19968;&#20010;&#20445;&#25252;&#38544;&#31169;&#30340;&#36712;&#36857;&#21457;&#24067;&#26041;&#27861;&#12290;&#22522;&#20110;&#36825;&#19968;&#26694;&#26550;&#65292;&#25105;&#20204;&#31616;&#35201;&#35752;&#35770;&#20102;&#29616;&#26377;&#30340;&#36712;&#36857;&#21457;&#24067;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07218v1 Announce Type: cross  Abstract: While location trajectories represent a valuable data source for analyses and location-based services, they can reveal sensitive information, such as political and religious preferences. Differentially private publication mechanisms have been proposed to allow for analyses under rigorous privacy guarantees. However, the traditional protection schemes suffer from a limiting privacy-utility trade-off and are vulnerable to correlation and reconstruction attacks. Synthetic trajectory data generation and release represent a promising alternative to protection algorithms. While initial proposals achieve remarkable utility, they fail to provide rigorous privacy guarantees. This paper proposes a framework for designing a privacy-preserving trajectory publication approach by defining five design goals, particularly stressing the importance of choosing an appropriate Unit of Privacy. Based on this framework, we briefly discuss the existing traje
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32852;&#21512;&#23398;&#20064;&#29615;&#22659;&#20013;&#30340;&#24378;&#21147;&#37325;&#26500;&#25915;&#20987;&#65292;&#21487;&#20197;&#37325;&#26500;&#20013;&#38388;&#29305;&#24449;&#65292;&#24182;&#19988;&#23545;&#22823;&#37096;&#20998;&#20808;&#21069;&#30340;&#26041;&#27861;&#34920;&#29616;&#26356;&#22909;&#12290;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#38450;&#24481;&#26426;&#21046;&#20013;&#65292;&#26799;&#24230;&#20462;&#21098;&#26159;&#23545;&#25239;&#26368;&#20808;&#36827;&#25915;&#20987;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2402.09478</link><description>&lt;p&gt;
&#25968;&#25454;&#37325;&#26500;&#25915;&#20987;&#19982;&#38450;&#24481;&#65306;&#19968;&#20010;&#31995;&#32479;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Data Reconstruction Attacks and Defenses: A Systematic Evaluation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09478
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32852;&#21512;&#23398;&#20064;&#29615;&#22659;&#20013;&#30340;&#24378;&#21147;&#37325;&#26500;&#25915;&#20987;&#65292;&#21487;&#20197;&#37325;&#26500;&#20013;&#38388;&#29305;&#24449;&#65292;&#24182;&#19988;&#23545;&#22823;&#37096;&#20998;&#20808;&#21069;&#30340;&#26041;&#27861;&#34920;&#29616;&#26356;&#22909;&#12290;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#38450;&#24481;&#26426;&#21046;&#20013;&#65292;&#26799;&#24230;&#20462;&#21098;&#26159;&#23545;&#25239;&#26368;&#20808;&#36827;&#25915;&#20987;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37325;&#26500;&#25915;&#20987;&#21644;&#38450;&#24481;&#23545;&#20110;&#29702;&#35299;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#25968;&#25454;&#27844;&#28431;&#38382;&#39064;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#20808;&#21069;&#30340;&#24037;&#20316;&#20027;&#35201;&#38598;&#20013;&#22312;&#26799;&#24230;&#21453;&#36716;&#25915;&#20987;&#30340;&#32463;&#39564;&#35266;&#23519;&#19978;&#65292;&#32570;&#20047;&#29702;&#35770;&#22522;&#30784;&#65292;&#24182;&#19988;&#26080;&#27861;&#21306;&#20998;&#38450;&#24481;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#19982;&#25915;&#20987;&#26041;&#27861;&#30340;&#35745;&#31639;&#38480;&#21046;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32852;&#21512;&#23398;&#20064;&#29615;&#22659;&#20013;&#30340;&#24378;&#21147;&#37325;&#26500;&#25915;&#20987;&#12290;&#35813;&#25915;&#20987;&#21487;&#20197;&#37325;&#26500;&#20013;&#38388;&#29305;&#24449;&#65292;&#24182;&#19982;&#22823;&#37096;&#20998;&#20808;&#21069;&#30340;&#26041;&#27861;&#30456;&#27604;&#34920;&#29616;&#26356;&#22909;&#12290;&#22312;&#36825;&#31181;&#26356;&#24378;&#30340;&#25915;&#20987;&#19979;&#65292;&#25105;&#20204;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#20004;&#26041;&#38754;&#20840;&#38754;&#35843;&#26597;&#20102;&#26368;&#24120;&#35265;&#30340;&#38450;&#24481;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#21508;&#31181;&#38450;&#24481;&#26426;&#21046;&#20013;&#65292;&#22914;&#26799;&#24230;&#21098;&#36753;&#12289;dropout&#12289;&#28155;&#21152;&#22122;&#38899;&#12289;&#23616;&#37096;&#32858;&#21512;&#31561;&#31561;&#65292;&#26799;&#24230;&#20462;&#21098;&#26159;&#23545;&#25239;&#26368;&#20808;&#36827;&#25915;&#20987;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09478v1 Announce Type: cross  Abstract: Reconstruction attacks and defenses are essential in understanding the data leakage problem in machine learning. However, prior work has centered around empirical observations of gradient inversion attacks, lacks theoretical groundings, and was unable to disentangle the usefulness of defending methods versus the computational limitation of attacking methods. In this work, we propose a strong reconstruction attack in the setting of federated learning. The attack reconstructs intermediate features and nicely integrates with and outperforms most of the previous methods. On this stronger attack, we thoroughly investigate both theoretically and empirically the effect of the most common defense methods. Our findings suggest that among various defense mechanisms, such as gradient clipping, dropout, additive noise, local aggregation, etc., gradient pruning emerges as the most effective strategy to defend against state-of-the-art attacks.
&lt;/p&gt;</description></item></channel></rss>