<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#36890;&#36807;&#24341;&#20837;Collage Prompting&#26041;&#27861;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#19982;GPT-4V&#21512;&#20316;&#30340;&#32463;&#27982;&#21487;&#34892;&#30340;&#35270;&#35273;&#35782;&#21035;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#22270;&#20687;&#25490;&#21015;&#39034;&#24207;&#33719;&#24471;&#26368;&#22823;&#30340;&#35782;&#21035;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.11468</link><description>&lt;p&gt;
Collage Prompting: &#19982;GPT-4V&#21512;&#20316;&#30340;&#32463;&#27982;&#21487;&#34892;&#30340;&#35270;&#35273;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Collage Prompting: Budget-Friendly Visual Recognition with GPT-4V
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11468
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#24341;&#20837;Collage Prompting&#26041;&#27861;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#19982;GPT-4V&#21512;&#20316;&#30340;&#32463;&#27982;&#21487;&#34892;&#30340;&#35270;&#35273;&#35782;&#21035;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#22270;&#20687;&#25490;&#21015;&#39034;&#24207;&#33719;&#24471;&#26368;&#22823;&#30340;&#35782;&#21035;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#36827;&#23637;&#34920;&#26126;&#65292;&#36890;&#36807;&#37319;&#29992;&#35270;&#35273;&#25552;&#31034;&#65292;GPT-4V&#21487;&#20197;&#22312;&#22270;&#20687;&#35782;&#21035;&#20219;&#21153;&#20013;&#23637;&#29616;&#20986;&#26174;&#33879;&#30340;&#29087;&#32451;&#24230;&#12290;&#23613;&#31649;&#20854;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#33021;&#21147;&#65292;&#20294;&#19982;GPT-4V&#30340;&#25512;&#26029;&#30456;&#20851;&#30340;&#36130;&#21153;&#25104;&#26412;&#26500;&#25104;&#20102;&#20854;&#24191;&#27867;&#24212;&#29992;&#30340;&#37325;&#22823;&#38556;&#30861;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#24341;&#20837;&#20102;Collage Prompting&#65292;&#36825;&#26159;&#19968;&#31181;&#32463;&#27982;&#23454;&#24800;&#30340;&#25552;&#31034;&#26041;&#27861;&#65292;&#23558;&#22810;&#20010;&#22270;&#20687;&#36830;&#25509;&#25104;&#21333;&#20010;&#35270;&#35273;&#36755;&#20837;&#12290;&#20511;&#21161;&#25340;&#36148;&#25552;&#31034;&#65292;GPT-4V&#21487;&#20197;&#21516;&#26102;&#22312;&#22810;&#24133;&#22270;&#20687;&#19978;&#25191;&#34892;&#22270;&#20687;&#35782;&#21035;&#12290;&#22522;&#20110;GPT-4V&#30340;&#22270;&#20687;&#35782;&#21035;&#20934;&#30830;&#24615;&#19982;&#25340;&#36148;&#25552;&#31034;&#20013;&#22270;&#20687;&#39034;&#24207;&#26126;&#26174;&#21464;&#21270;&#30340;&#35266;&#23519;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#36827;&#19968;&#27493;&#23398;&#20064;&#20248;&#21270;&#22270;&#20687;&#23433;&#25490;&#20197;&#33719;&#24471;&#26368;&#22823;&#30340;&#35782;&#21035;&#20934;&#30830;&#24615;&#12290;&#35757;&#32451;&#20102;&#19968;&#20010;&#22270;&#39044;&#27979;&#22120;&#26469;&#25351;&#31034;&#27599;&#20010;&#25340;&#36148;&#25552;&#31034;&#30340;&#20934;&#30830;&#24615;&#65292;&#28982;&#21518;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20248;&#21270;&#26041;&#27861;&#26469;&#23548;&#33322;&#25628;&#32034;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11468v1 Announce Type: cross  Abstract: Recent advancements in generative AI have suggested that by taking visual prompt, GPT-4V can demonstrate significant proficiency in image recognition task. Despite its impressive capabilities, the financial cost associated with GPT-4V's inference presents a substantial barrier for its wide use. To address this challenge, our work introduces Collage Prompting, a budget-friendly prompting approach that concatenates multiple images into a single visual input. With collage prompt, GPT-4V is able to perform image recognition on several images simultaneously. Based on the observation that the accuracy of GPT-4V's image recognition varies significantly with the order of images within the collage prompt, our method further learns to optimize the arrangement of images for maximum recognition accuracy. A graph predictor is trained to indicate the accuracy of each collage prompt, then we propose an optimization method to navigate the search space
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#24403;&#21069;&#22522;&#20110;3D&#39592;&#26550;&#30340;&#20154;&#21592;&#20877;&#35782;&#21035;&#26041;&#27861;&#12289;&#27169;&#22411;&#35774;&#35745;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#26041;&#21521;&#30340;&#31995;&#32479;&#35843;&#30740;&#65292;&#22635;&#34917;&#20102;&#30456;&#20851;&#30740;&#31350;&#24635;&#32467;&#30340;&#31354;&#30333;&#12290;</title><link>http://arxiv.org/abs/2401.15296</link><description>&lt;p&gt;
&#22522;&#20110;3D&#39592;&#26550;&#30340;&#20154;&#21592;&#20877;&#35782;&#21035;&#65306;&#26041;&#27861;&#12289;&#35774;&#35745;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#26041;&#21521;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
A Survey on 3D Skeleton Based Person Re-Identification: Approaches, Designs, Challenges, and Future Directions. (arXiv:2401.15296v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15296
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#24403;&#21069;&#22522;&#20110;3D&#39592;&#26550;&#30340;&#20154;&#21592;&#20877;&#35782;&#21035;&#26041;&#27861;&#12289;&#27169;&#22411;&#35774;&#35745;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#26041;&#21521;&#30340;&#31995;&#32479;&#35843;&#30740;&#65292;&#22635;&#34917;&#20102;&#30456;&#20851;&#30740;&#31350;&#24635;&#32467;&#30340;&#31354;&#30333;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;3D&#39592;&#26550;&#36827;&#34892;&#20154;&#21592;&#20877;&#35782;&#21035;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#26032;&#20852;&#30740;&#31350;&#39046;&#22495;&#65292;&#24341;&#36215;&#20102;&#27169;&#24335;&#35782;&#21035;&#31038;&#21306;&#30340;&#26497;&#22823;&#20852;&#36259;&#12290;&#36817;&#24180;&#26469;&#65292;&#38024;&#23545;&#39592;&#26550;&#24314;&#27169;&#21644;&#29305;&#24449;&#23398;&#20064;&#20013;&#31361;&#20986;&#38382;&#39064;&#65292;&#24050;&#32463;&#25552;&#20986;&#20102;&#35768;&#22810;&#20855;&#26377;&#29420;&#29305;&#20248;&#21183;&#30340;&#22522;&#20110;3D&#39592;&#26550;&#30340;&#20154;&#21592;&#20877;&#35782;&#21035;&#65288;SRID&#65289;&#26041;&#27861;&#12290;&#23613;&#31649;&#36817;&#24180;&#26469;&#21462;&#24471;&#20102;&#19968;&#20123;&#36827;&#23637;&#65292;&#20294;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#30446;&#21069;&#36824;&#27809;&#26377;&#23545;&#36825;&#20123;&#30740;&#31350;&#21450;&#20854;&#25361;&#25112;&#36827;&#34892;&#32508;&#21512;&#24635;&#32467;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#36890;&#36807;&#23545;&#24403;&#21069;SRID&#26041;&#27861;&#12289;&#27169;&#22411;&#35774;&#35745;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#26041;&#21521;&#30340;&#31995;&#32479;&#35843;&#30740;&#65292;&#35797;&#22270;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#39318;&#20808;&#23450;&#20041;&#20102;SRID&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;SRID&#30740;&#31350;&#30340;&#20998;&#31867;&#20307;&#31995;&#65292;&#24635;&#32467;&#20102;&#24120;&#29992;&#30340;&#22522;&#20934;&#25968;&#25454;&#38598;&#12289;&#24120;&#29992;&#30340;&#27169;&#22411;&#26550;&#26500;&#65292;&#24182;&#23545;&#19981;&#21516;&#26041;&#27861;&#30340;&#29305;&#28857;&#36827;&#34892;&#20102;&#20998;&#26512;&#35780;&#20215;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35814;&#32454;&#38416;&#36848;&#20102;SRID&#27169;&#22411;&#30340;&#35774;&#35745;&#21407;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
Person re-identification via 3D skeletons is an important emerging research area that triggers great interest in the pattern recognition community. With distinctive advantages for many application scenarios, a great diversity of 3D skeleton based person re-identification (SRID) methods have been proposed in recent years, effectively addressing prominent problems in skeleton modeling and feature learning. Despite recent advances, to the best of our knowledge, little effort has been made to comprehensively summarize these studies and their challenges. In this paper, we attempt to fill this gap by providing a systematic survey on current SRID approaches, model designs, challenges, and future directions. Specifically, we first formulate the SRID problem, and propose a taxonomy of SRID research with a summary of benchmark datasets, commonly-used model architectures, and an analytical review of different methods' characteristics. Then, we elaborate on the design principles of SRID models fro
&lt;/p&gt;</description></item></channel></rss>