<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#36825;&#39033;&#30740;&#31350;&#38024;&#23545;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20989;&#25968;&#36924;&#36817;&#30340;&#19968;&#33324;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#22870;&#21169;&#27745;&#26579;&#25915;&#20987;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#31574;&#30053;&#23545;&#27604;&#25915;&#20987;&#8221;&#30340;&#25915;&#20987;&#31574;&#30053;&#12290;&#36890;&#36807;&#20351;&#20302;&#24615;&#33021;&#31574;&#30053;&#30475;&#36215;&#26469;&#20687;&#26159;&#39640;&#24615;&#33021;&#30340;&#65292;&#21516;&#26102;&#20351;&#39640;&#24615;&#33021;&#31574;&#30053;&#30475;&#36215;&#26469;&#20687;&#26159;&#20302;&#24615;&#33021;&#30340;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#25915;&#20987;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09695</link><description>&lt;p&gt;
&#23545;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#22870;&#21169;&#27745;&#26579;&#25915;&#20987;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Reward Poisoning Attack Against Offline Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09695
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#38024;&#23545;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20989;&#25968;&#36924;&#36817;&#30340;&#19968;&#33324;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#22870;&#21169;&#27745;&#26579;&#25915;&#20987;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#31574;&#30053;&#23545;&#27604;&#25915;&#20987;&#8221;&#30340;&#25915;&#20987;&#31574;&#30053;&#12290;&#36890;&#36807;&#20351;&#20302;&#24615;&#33021;&#31574;&#30053;&#30475;&#36215;&#26469;&#20687;&#26159;&#39640;&#24615;&#33021;&#30340;&#65292;&#21516;&#26102;&#20351;&#39640;&#24615;&#33021;&#31574;&#30053;&#30475;&#36215;&#26469;&#20687;&#26159;&#20302;&#24615;&#33021;&#30340;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#25915;&#20987;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#38024;&#23545;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20989;&#25968;&#36924;&#36817;&#30340;&#19968;&#33324;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#22870;&#21169;&#27745;&#26579;&#25915;&#20987;&#38382;&#39064;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#40657;&#30418;&#23041;&#32961;&#27169;&#22411;&#65292;&#25915;&#20987;&#32773;&#23545;&#23398;&#20064;&#31639;&#27861;&#23436;&#20840;&#19981;&#20102;&#35299;&#65292;&#24182;&#19988;&#20854;&#39044;&#31639;&#21463;&#21040;&#38480;&#21046;&#65292;&#38480;&#21046;&#20102;&#27599;&#20010;&#25968;&#25454;&#28857;&#30340;&#27745;&#26579;&#37327;&#20197;&#21450;&#24635;&#25200;&#21160;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#31574;&#30053;&#23545;&#27604;&#25915;&#20987;&#8221;&#30340;&#25915;&#20987;&#31574;&#30053;&#12290;&#20854;&#39640;&#23618;&#24605;&#24819;&#26159;&#20351;&#19968;&#20123;&#20302;&#24615;&#33021;&#31574;&#30053;&#30475;&#36215;&#26469;&#20687;&#26159;&#39640;&#24615;&#33021;&#30340;&#65292;&#21516;&#26102;&#20351;&#39640;&#24615;&#33021;&#31574;&#30053;&#30475;&#36215;&#26469;&#20687;&#26159;&#20302;&#24615;&#33021;&#30340;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#25105;&#20204;&#39318;&#27425;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#19968;&#33324;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#22330;&#26223;&#30340;&#40657;&#30418;&#22870;&#21169;&#27745;&#26579;&#25915;&#20987;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#25915;&#20987;&#35774;&#35745;&#30340;&#29702;&#35770;&#27934;&#23519;&#65292;&#24182;&#22312;&#19981;&#21516;&#31867;&#22411;&#30340;&#23398;&#20064;&#25968;&#25454;&#38598;&#19978;&#32463;&#39564;&#35777;&#26126;&#25105;&#20204;&#30340;&#25915;&#20987;&#23545;&#24403;&#21069;&#26368;&#20808;&#36827;&#30340;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09695v1 Announce Type: cross  Abstract: We study the problem of reward poisoning attacks against general offline reinforcement learning with deep neural networks for function approximation. We consider a black-box threat model where the attacker is completely oblivious to the learning algorithm and its budget is limited by constraining both the amount of corruption at each data point, and the total perturbation. We propose an attack strategy called `policy contrast attack'. The high-level idea is to make some low-performing policies appear as high-performing while making high-performing policies appear as low-performing. To the best of our knowledge, we propose the first black-box reward poisoning attack in the general offline RL setting. We provide theoretical insights on the attack design and empirically show that our attack is efficient against current state-of-the-art offline RL algorithms in different kinds of learning datasets.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#24212;&#29992;&#20102;Cube-and-Conquer&#26041;&#27861;&#23558;MD4&#21644;MD5&#30340;&#27493;&#39588;&#32553;&#20943;&#29256;&#26412;&#36827;&#34892;&#21453;&#36716;&#12290;&#36890;&#36807;&#36880;&#27493;&#20462;&#25913;Dobbertin&#32422;&#26463;&#26469;&#29983;&#25104;MD4&#30340;&#21453;&#36716;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#31435;&#26041;&#38454;&#27573;&#30340;&#31435;&#26041;&#21644;&#24449;&#26381;&#26041;&#27861;&#36827;&#34892;&#21453;&#36716;&#12290;</title><link>http://arxiv.org/abs/2212.02405</link><description>&lt;p&gt;
&#36890;&#36807;&#31435;&#26041;&#21644;&#24449;&#26381;&#27861;&#21453;&#36716;&#23494;&#30721;&#21704;&#24076;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Inverting Cryptographic Hash Functions via Cube-and-Conquer. (arXiv:2212.02405v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.02405
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24212;&#29992;&#20102;Cube-and-Conquer&#26041;&#27861;&#23558;MD4&#21644;MD5&#30340;&#27493;&#39588;&#32553;&#20943;&#29256;&#26412;&#36827;&#34892;&#21453;&#36716;&#12290;&#36890;&#36807;&#36880;&#27493;&#20462;&#25913;Dobbertin&#32422;&#26463;&#26469;&#29983;&#25104;MD4&#30340;&#21453;&#36716;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#31435;&#26041;&#38454;&#27573;&#30340;&#31435;&#26041;&#21644;&#24449;&#26381;&#26041;&#27861;&#36827;&#34892;&#21453;&#36716;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
MD4&#21644;MD5&#26159;&#22312;1990&#24180;&#20195;&#21021;&#25552;&#20986;&#30340;&#20855;&#26377;&#37324;&#31243;&#30865;&#24847;&#20041;&#30340;&#23494;&#30721;&#21704;&#24076;&#20989;&#25968;&#12290;MD4&#30001;48&#20010;&#27493;&#39588;&#32452;&#25104;&#65292;&#32473;&#23450;&#20219;&#24847;&#26377;&#38480;&#22823;&#23567;&#30340;&#28040;&#24687;&#65292;&#23427;&#21487;&#20197;&#20135;&#29983;&#19968;&#20010;128&#20301;&#30340;&#21704;&#24076;&#20540;&#12290;MD5&#26159;MD4&#30340;&#26356;&#23433;&#20840;&#30340;64&#27493;&#25193;&#23637;&#12290;&#23613;&#31649;MD4&#21644;MD5&#37117;&#23481;&#26131;&#21463;&#21040;&#30896;&#25758;&#25915;&#20987;&#30340;&#24433;&#21709;&#65292;&#20294;&#26159;&#32763;&#36716;&#23427;&#20204;&#65292;&#21363;&#36890;&#36807;&#21704;&#24076;&#20540;&#25214;&#21040;&#21407;&#22987;&#28040;&#24687;&#20173;&#28982;&#19981;&#29616;&#23454;&#12290;&#22312;2007&#24180;&#65292;MD4&#30340;39&#27493;&#29256;&#26412;&#36890;&#36807;&#21270;&#31616;&#20026;SAT&#24182;&#24212;&#29992;CDCL&#27714;&#35299;&#22120;&#20197;&#21450;&#25152;&#35859;&#30340;Dobbertin&#32422;&#26463;&#34987;&#21453;&#36716;&#12290;&#33267;&#20110;MD5&#65292;&#22312;2012&#24180;&#65292;&#23427;&#30340;28&#27493;&#29256;&#26412;&#36890;&#36807;CDCL&#27714;&#35299;&#22120;&#20165;&#38024;&#23545;&#19968;&#20010;&#29305;&#23450;&#30340;&#21704;&#24076;&#20540;&#34987;&#21453;&#36716;&#65292;&#32780;&#19981;&#21152;&#20219;&#20309;&#39069;&#22806;&#30340;&#32422;&#26463;&#12290;&#26412;&#30740;&#31350;&#23558;&#31435;&#26041;&#21644;&#24449;&#26381;&#65288;CDCL&#19982;&#20808;&#34892;&#25628;&#32034;&#30340;&#32452;&#21512;&#65289;&#24212;&#29992;&#20110;&#27493;&#39588;&#32553;&#20943;&#29256;&#26412;&#30340;MD4&#21644;MD5&#30340;&#21453;&#36716;&#12290;&#20026;&#27492;&#65292;&#25552;&#20986;&#20102;&#20004;&#20010;&#31639;&#27861;&#12290;&#31532;&#19968;&#20010;&#31639;&#27861;&#36890;&#36807;&#36880;&#27493;&#20462;&#25913;Dobbertin&#32422;&#26463;&#26469;&#29983;&#25104;MD4&#30340;&#21453;&#36716;&#38382;&#39064;&#12290;&#31532;&#20108;&#20010;&#31639;&#27861;&#23581;&#35797;&#20351;&#29992;&#31435;&#26041;&#38454;&#27573;&#30340;&#31435;&#26041;&#21644;&#24449;&#26381;&#26041;&#27861;&#36827;&#34892;&#21453;&#36716;&#12290;
&lt;/p&gt;
&lt;p&gt;
MD4 and MD5 are seminal cryptographic hash functions proposed in early 1990s. MD4 consists of 48 steps and produces a 128-bit hash given a message of arbitrary finite size. MD5 is a more secure 64-step extension of MD4. Both MD4 and MD5 are vulnerable to practical collision attacks, yet it is still not realistic to invert them, i.e. to find a message given a hash. In 2007, the 39-step version of MD4 was inverted via reducing to SAT and applying a CDCL solver along with the so-called Dobbertin's constraints. As for MD5, in 2012 its 28-step version was inverted via a CDCL solver for one specified hash without adding any additional constraints. In this study, Cube-and-Conquer (a combination of CDCL and lookahead) is applied to invert step-reduced versions of MD4 and MD5. For this purpose, two algorithms are proposed. The first one generates inversion problems for MD4 by gradually modifying the Dobbertin's constraints. The second algorithm tries the cubing phase of Cube-and-Conquer with di
&lt;/p&gt;</description></item></channel></rss>