<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;AI&#30340;&#21305;&#37197;&#35774;&#35745;&#26041;&#27861;&#65292;&#36890;&#36807;&#19982;&#19987;&#19994;&#20107;&#23454;&#26680;&#26597;&#21592;&#30340;&#21512;&#20316;&#35774;&#35745;&#65292;&#21457;&#29616;&#24182;&#35299;&#20915;&#20107;&#23454;&#26680;&#26597;&#21592;&#19982;&#25216;&#26415;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#21512;&#20316;&#35774;&#35745;&#20250;&#35758;&#20135;&#29983;&#20102;11&#20010;&#26032;&#30340;&#35774;&#35745;&#24605;&#36335;&#65292;&#21253;&#25324;&#25552;&#39640;&#25928;&#29575;&#21644;&#20010;&#24615;&#21270;&#30340;&#20107;&#23454;&#26680;&#26597;&#24037;&#20855;&#65292;&#24110;&#21161;&#20107;&#23454;&#26680;&#26597;&#21592;&#20934;&#22791;&#26410;&#26469;&#30340;&#34394;&#20551;&#20449;&#24687;&#65292;&#30417;&#27979;&#20559;&#35265;&#65292;&#20197;&#21450;&#25903;&#25345;&#20869;&#37096;&#32452;&#32455;&#12290;</title><link>http://arxiv.org/abs/2308.07213</link><description>&lt;p&gt;
&#20154;&#26412;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20107;&#23454;&#26680;&#26597;&#65306;&#20351;&#29992;AI&#30340;&#21305;&#37197;&#35774;&#35745;&#19982;&#20107;&#23454;&#26680;&#26597;&#21592;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Human-centered NLP Fact-checking: Co-Designing with Fact-checkers using Matchmaking for AI. (arXiv:2308.07213v1 [cs.HC] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07213
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;AI&#30340;&#21305;&#37197;&#35774;&#35745;&#26041;&#27861;&#65292;&#36890;&#36807;&#19982;&#19987;&#19994;&#20107;&#23454;&#26680;&#26597;&#21592;&#30340;&#21512;&#20316;&#35774;&#35745;&#65292;&#21457;&#29616;&#24182;&#35299;&#20915;&#20107;&#23454;&#26680;&#26597;&#21592;&#19982;&#25216;&#26415;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#21512;&#20316;&#35774;&#35745;&#20250;&#35758;&#20135;&#29983;&#20102;11&#20010;&#26032;&#30340;&#35774;&#35745;&#24605;&#36335;&#65292;&#21253;&#25324;&#25552;&#39640;&#25928;&#29575;&#21644;&#20010;&#24615;&#21270;&#30340;&#20107;&#23454;&#26680;&#26597;&#24037;&#20855;&#65292;&#24110;&#21161;&#20107;&#23454;&#26680;&#26597;&#21592;&#20934;&#22791;&#26410;&#26469;&#30340;&#34394;&#20551;&#20449;&#24687;&#65292;&#30417;&#27979;&#20559;&#35265;&#65292;&#20197;&#21450;&#25903;&#25345;&#20869;&#37096;&#32452;&#32455;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19987;&#19994;&#20107;&#23454;&#26680;&#26597;&#22312;&#24212;&#23545;&#22823;&#37327;&#34394;&#20551;&#20449;&#24687;&#26041;&#38754;&#23384;&#22312;&#21487;&#25193;&#23637;&#24615;&#26377;&#38480;&#30340;&#25361;&#25112;&#12290;&#34429;&#28982;&#25552;&#20986;&#20102;&#35768;&#22810;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#24037;&#20855;&#26469;&#22686;&#24378;&#20107;&#23454;&#26680;&#26597;&#30340;&#25928;&#29575;&#21644;&#21487;&#25193;&#23637;&#24615;&#65292;&#20294;&#23398;&#26415;&#30740;&#31350;&#21644;&#20107;&#23454;&#26680;&#26597;&#32452;&#32455;&#22343;&#25253;&#21578;&#20102;&#23545;&#27492;&#31867;&#24037;&#20855;&#30340;&#26377;&#38480;&#37319;&#29992;&#65292;&#22240;&#20026;&#36825;&#20123;&#24037;&#20855;&#19981;&#36275;&#20197;&#19982;&#20107;&#23454;&#26680;&#26597;&#21592;&#30340;&#23454;&#36341;&#12289;&#20215;&#20540;&#35266;&#21644;&#38656;&#27714;&#20445;&#25345;&#19968;&#33268;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#21512;&#20316;&#35774;&#35745;&#26041;&#27861;&#65292;&#21363;AI&#30340;&#21305;&#37197;&#35774;&#35745;&#65292;&#35813;&#26041;&#27861;&#20419;&#36827;&#20107;&#23454;&#26680;&#26597;&#21592;&#12289;&#35774;&#35745;&#24072;&#21644;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30740;&#31350;&#20154;&#21592;&#20849;&#21516;&#21457;&#29616;&#24212;&#20197;&#20309;&#31181;&#26041;&#24335;&#35299;&#20915;&#20107;&#23454;&#26680;&#26597;&#21592;&#30340;&#38656;&#27714;&#12290;&#25105;&#20204;&#19982;22&#21517;&#19987;&#19994;&#20107;&#23454;&#26680;&#26597;&#21592;&#36827;&#34892;&#30340;&#21512;&#20316;&#35774;&#35745;&#20250;&#35758;&#20135;&#29983;&#20102;11&#20010;&#26032;&#30340;&#35774;&#35745;&#24605;&#36335;&#12290;&#36825;&#20123;&#24605;&#36335;&#26377;&#21161;&#20110;&#25552;&#39640;&#20449;&#24687;&#25628;&#32034;&#12289;&#22788;&#29702;&#21644;&#25776;&#20889;&#25928;&#29575;&#20197;&#21450;&#20010;&#24615;&#21270;&#30340;&#20107;&#23454;&#26680;&#26597;&#65307;&#24110;&#21161;&#20107;&#23454;&#26680;&#26597;&#21592;&#20027;&#21160;&#20934;&#22791;&#26410;&#26469;&#30340;&#34394;&#20551;&#20449;&#24687;&#65307;&#30417;&#27979;&#28508;&#22312;&#30340;&#20559;&#35265;&#65307;&#24182;&#25903;&#25345;&#20869;&#37096;&#32452;&#32455;&#12290;
&lt;/p&gt;
&lt;p&gt;
A key challenge in professional fact-checking is its limited scalability in relation to the magnitude of false information. While many Natural Language Processing (NLP) tools have been proposed to enhance fact-checking efficiency and scalability, both academic research and fact-checking organizations report limited adoption of such tooling due to insufficient alignment with fact-checker practices, values, and needs. To address this gap, we investigate a co-design method, Matchmaking for AI, which facilitates fact-checkers, designers, and NLP researchers to collaboratively discover what fact-checker needs should be addressed by technology and how. Our co-design sessions with 22 professional fact-checkers yielded a set of 11 novel design ideas. They assist in information searching, processing, and writing tasks for efficient and personalized fact-checking; help fact-checkers proactively prepare for future misinformation; monitor their potential biases; and support internal organization c
&lt;/p&gt;</description></item></channel></rss>