<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#23618;&#27425;&#21270;&#20219;&#21153;&#32593;&#32476;&#35268;&#21010;&#20013;&#19977;&#20010;&#32463;&#20856;&#38382;&#39064;&#30340;&#21487;&#35745;&#31639;&#36793;&#30028;&#65292;&#25552;&#20379;&#20102;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#23558;&#22810;&#39033;&#24335;&#26102;&#38388;&#21487;&#35299;&#24615;&#32467;&#26524;&#20174;&#21407;&#22987;&#20219;&#21153;&#32593;&#32476;&#25512;&#24191;&#21040;&#19968;&#33324;&#20219;&#21153;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#36825;&#19977;&#20010;&#38382;&#39064;&#30340;&#21442;&#25968;&#21270;&#22797;&#26434;&#24230;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2401.14174</link><description>&lt;p&gt;
&#21010;&#20998;&#22312;&#23618;&#27425;&#21270;&#20219;&#21153;&#32593;&#32476;&#35268;&#21010;&#20013;&#30340;&#21487;&#35745;&#31639;&#36793;&#30028;
&lt;/p&gt;
&lt;p&gt;
The Boundaries of Tractability in Hierarchical Task Network Planning. (arXiv:2401.14174v1 [cs.CC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14174
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#23618;&#27425;&#21270;&#20219;&#21153;&#32593;&#32476;&#35268;&#21010;&#20013;&#19977;&#20010;&#32463;&#20856;&#38382;&#39064;&#30340;&#21487;&#35745;&#31639;&#36793;&#30028;&#65292;&#25552;&#20379;&#20102;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#23558;&#22810;&#39033;&#24335;&#26102;&#38388;&#21487;&#35299;&#24615;&#32467;&#26524;&#20174;&#21407;&#22987;&#20219;&#21153;&#32593;&#32476;&#25512;&#24191;&#21040;&#19968;&#33324;&#20219;&#21153;&#32593;&#32476;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#36825;&#19977;&#20010;&#38382;&#39064;&#30340;&#21442;&#25968;&#21270;&#22797;&#26434;&#24230;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#23618;&#27425;&#21270;&#20219;&#21153;&#32593;&#32476;&#35268;&#21010;&#20013;&#19977;&#20010;&#32463;&#20856;&#38382;&#39064;&#30340;&#21487;&#35745;&#31639;&#36793;&#30028;&#65306;&#25552;&#20379;&#35745;&#21010;&#30340;&#39564;&#35777;&#65292;&#26159;&#21542;&#23384;&#22312;&#21487;&#25191;&#34892;&#35745;&#21010;&#20197;&#21450;&#26159;&#21542;&#21487;&#20197;&#36890;&#36807;&#26576;&#20010;&#35745;&#21010;&#36798;&#21040;&#32473;&#23450;&#29366;&#24577;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#24120;&#37327;&#20559;&#24207;&#23485;&#24230;&#30340;&#21407;&#22987;&#20219;&#21153;&#32593;&#32476;&#65288;&#20197;&#21450;&#20854;&#25512;&#24191;&#24418;&#24335;&#65289;&#19978;&#65292;&#36825;&#19977;&#20010;&#38382;&#39064;&#37117;&#21487;&#20197;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#35299;&#20915;&#65292;&#32780;&#23545;&#20110;&#21518;&#20004;&#20010;&#38382;&#39064;&#65292;&#36825;&#31181;&#24773;&#20917;&#20165;&#22312;&#23545;&#29366;&#24577;&#31354;&#38388;&#36827;&#34892;&#21487;&#35777;&#26126;&#30340;&#24517;&#35201;&#38480;&#21046;&#19979;&#25165;&#25104;&#31435;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#31639;&#27861;&#20803;&#23450;&#29702;&#21450;&#30456;&#24212;&#30340;&#19979;&#30028;&#65292;&#20197;&#30830;&#23450;&#20174;&#21407;&#22987;&#20219;&#21153;&#32593;&#32476;&#21040;&#19968;&#33324;&#20219;&#21153;&#32593;&#32476;&#30340;&#19968;&#33324;&#22810;&#39033;&#24335;&#26102;&#38388;&#21487;&#35299;&#24615;&#32467;&#26524;&#21487;&#20197;&#34987;&#25552;&#21319;&#30340;&#20005;&#26684;&#26465;&#20214;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#20998;&#26512;&#36825;&#19977;&#20010;&#38382;&#39064;&#30340;&#21442;&#25968;&#21270;&#22797;&#26434;&#24230;&#26469;&#20016;&#23500;&#25105;&#20204;&#30340;&#30740;&#31350;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;(1)&#36890;&#36807;&#23558;&#20559;&#24207;&#23485;&#24230;&#26367;&#25442;&#20026;t&#65292;&#21487;&#20197;&#23454;&#29616;&#36825;&#19977;&#20010;&#38382;&#39064;&#30340;&#22266;&#23450;&#21442;&#25968;&#21487;&#35745;&#31639;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the complexity-theoretic boundaries of tractability for three classical problems in the context of Hierarchical Task Network Planning: the validation of a provided plan, whether an executable plan exists, and whether a given state can be reached by some plan. We show that all three problems can be solved in polynomial time on primitive task networks of constant partial order width (and a generalization thereof), whereas for the latter two problems this holds only under a provably necessary restriction to the state space. Next, we obtain an algorithmic meta-theorem along with corresponding lower bounds to identify tight conditions under which general polynomial-time solvability results can be lifted from primitive to general task networks. Finally, we enrich our investigation by analyzing the parameterized complexity of the three considered problems, and show that (1) fixed-parameter tractability for all three problems can be achieved by replacing the partial order width with t
&lt;/p&gt;</description></item></channel></rss>