<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#30740;&#31350;&#20102;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#31616;&#21333;&#21270;&#25509;&#36817;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#27450;&#35784;&#34892;&#20026;&#23545;&#29992;&#25143;&#21644;&#31649;&#29702;&#32773;&#21487;&#33021;&#36896;&#25104;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.11209</link><description>&lt;p&gt;
&#24403;&#31616;&#21333;&#21270;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#25509;&#36817;&#26368;&#20248;
&lt;/p&gt;
&lt;p&gt;
When Simple in Near-Optimal in Security Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11209
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#31616;&#21333;&#21270;&#25509;&#36817;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#27450;&#35784;&#34892;&#20026;&#23545;&#29992;&#25143;&#21644;&#31649;&#29702;&#32773;&#21487;&#33021;&#36896;&#25104;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#24212;&#29992;&#31243;&#24207;&#20013;&#26222;&#36941;&#23384;&#22312;&#27450;&#35784;&#25110;&#38750;&#27861;&#27963;&#21160;&#65292;&#24182;&#28041;&#21450;&#29992;&#25143;&#32469;&#36807;&#27861;&#24459;&#65292;&#36890;&#24120;&#20197;&#33719;&#21462;&#19968;&#20123;&#22312;&#21512;&#27861;&#34892;&#20026;&#33539;&#22260;&#20869;&#26080;&#27861;&#33719;&#24471;&#30340;&#21033;&#30410;&#20026;&#25112;&#30053;&#30446;&#30340;&#12290;&#28982;&#32780;&#65292;&#29992;&#25143;&#27450;&#35784;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#65292;&#21487;&#33021;&#21361;&#23475;&#23433;&#20840;&#25110;&#23545;&#29305;&#23450;&#20154;&#32676;&#26045;&#21152;&#19981;&#25104;&#27604;&#20363;&#30340;&#36127;&#38754;&#22806;&#37096;&#24615;&#12290;&#20026;&#20943;&#36731;&#29992;&#25143;&#27450;&#35784;&#30340;&#28508;&#22312;&#21361;&#23475;&#65292;&#25105;&#20204;&#23558;&#27450;&#35784;&#34892;&#20026;&#30417;&#31649;&#38382;&#39064;&#35270;&#20026;&#31649;&#29702;&#21592;&#21644;&#29992;&#25143;&#20043;&#38388;&#30340;&#23433;&#20840;&#28216;&#25103;&#12290;&#22312;&#36825;&#20010;&#28216;&#25103;&#20013;&#65292;&#31649;&#29702;&#21592;&#36890;&#36807;$R$&#20010;&#23433;&#20840;&#36164;&#28304;&#65288;&#20363;&#22914;&#35686;&#23519;&#65289;&#22312;$L$&#20010;&#20301;&#32622;&#37096;&#32626;&#65292;&#24182;&#23545;&#22312;&#36825;&#20123;&#20301;&#32622;&#36827;&#34892;&#27450;&#35784;&#30340;&#29992;&#25143;&#24449;&#25910;&#32602;&#27454;&#12290;&#23545;&#20110;&#36825;&#20010;&#23433;&#20840;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#31649;&#29702;&#21592;&#30340;&#31119;&#21033;&#21644;&#25910;&#20837;&#26368;&#22823;&#21270;&#30446;&#26631;&#12290;&#22312;&#20004;&#31181;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35745;&#31639;&#26368;&#20248;&#31649;&#29702;&#21592;&#31574;&#30053;&#26159;NP&#38590;&#39064;&#65292;&#24182;&#20026;&#27492;&#24320;&#21457;&#20102;&#33258;&#28982;&#30340;&#36138;&#23146;&#31639;&#27861;&#21464;&#20307;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11209v1 Announce Type: cross  Abstract: Fraudulent or illegal activities are ubiquitous across applications and involve users bypassing the rule of law, often with the strategic aim of obtaining some benefit that would otherwise be unattainable within the bounds of lawful conduct. However, user fraud is detrimental, as it may compromise safety or impose disproportionate negative externalities on particular population groups.   To mitigate the potential harms of user fraud, we study the problem of policing such fraud as a security game between an administrator and users. In this game, an administrator deploys $R$ security resources (e.g., police officers) across $L$ locations and levies fines against users engaging in fraud at those locations. For this security game, we study both welfare and revenue maximization administrator objectives. In both settings, we show that computing the optimal administrator strategy is NP-hard and develop natural greedy algorithm variants for th
&lt;/p&gt;</description></item></channel></rss>