<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>ResidualPlanner&#26159;&#19968;&#31181;&#29992;&#20110;&#24102;&#26377;&#39640;&#26031;&#22122;&#22768;&#30340;&#36793;&#32536;&#30340;&#30697;&#38453;&#26426;&#21046;&#65292;&#26082;&#20248;&#21270;&#21448;&#21487;&#25193;&#23637;&#65292;&#21487;&#20197;&#20248;&#21270;&#35768;&#22810;&#21487;&#20197;&#20889;&#25104;&#36793;&#38469;&#26041;&#24046;&#30340;&#20984;&#20989;&#25968;&#30340;&#25439;&#22833;&#20989;&#25968;&#12290;</title><link>http://arxiv.org/abs/2305.08175</link><description>&lt;p&gt;
&#19968;&#31181;&#20248;&#21270;&#19988;&#21487;&#25193;&#23637;&#30340;&#30697;&#38453;&#26426;&#21046;&#29992;&#20110;&#25200;&#21160;&#36793;&#32536;&#25968;&#25454;&#19979;&#20984;&#25439;&#22833;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
An Optimal and Scalable Matrix Mechanism for Noisy Marginals under Convex Loss Functions. (arXiv:2305.08175v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08175
&lt;/p&gt;
&lt;p&gt;
ResidualPlanner&#26159;&#19968;&#31181;&#29992;&#20110;&#24102;&#26377;&#39640;&#26031;&#22122;&#22768;&#30340;&#36793;&#32536;&#30340;&#30697;&#38453;&#26426;&#21046;&#65292;&#26082;&#20248;&#21270;&#21448;&#21487;&#25193;&#23637;&#65292;&#21487;&#20197;&#20248;&#21270;&#35768;&#22810;&#21487;&#20197;&#20889;&#25104;&#36793;&#38469;&#26041;&#24046;&#30340;&#20984;&#20989;&#25968;&#30340;&#25439;&#22833;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25200;&#21160;&#30340;&#36793;&#32536;&#25968;&#25454;&#26159;&#19968;&#31181;&#24120;&#35265;&#30340;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#30340;&#24418;&#24335;&#65292;&#21487;&#29992;&#20110;&#35832;&#22914;&#21015;&#32852;&#34920;&#20998;&#26512;&#12289;&#36125;&#21494;&#26031;&#32593;&#32476;&#26500;&#24314;&#21644;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#31561;&#19979;&#28216;&#20219;&#21153;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;ResidualPlanner&#65292;&#36825;&#26159;&#19968;&#31181;&#29992;&#20110;&#24102;&#26377;&#39640;&#26031;&#22122;&#22768;&#30340;&#36793;&#32536;&#30340;&#30697;&#38453;&#26426;&#21046;&#65292;&#26082;&#20248;&#21270;&#21448;&#21487;&#25193;&#23637;&#12290;ResidualPlanner&#21487;&#20197;&#20248;&#21270;&#35768;&#22810;&#21487;&#20197;&#20889;&#25104;&#36793;&#38469;&#26041;&#24046;&#30340;&#20984;&#20989;&#25968;&#30340;&#25439;&#22833;&#20989;&#25968;&#12290;&#27492;&#22806;&#65292;ResidualPlanner&#21487;&#20197;&#22312;&#20960;&#31186;&#38047;&#20869;&#20248;&#21270;&#22823;&#35268;&#27169;&#35774;&#32622;&#20013;&#30340;&#36793;&#32536;&#20934;&#30830;&#24615;&#65292;&#21363;&#20351;&#20043;&#21069;&#30340;&#26368;&#20808;&#36827;&#25216;&#26415;&#65288;HDMM&#65289;&#20063;&#20250;&#21344;&#29992;&#36807;&#22810;&#30340;&#20869;&#23384;&#12290;&#29978;&#33267;&#22312;&#20855;&#26377;100&#20010;&#23646;&#24615;&#30340;&#25968;&#25454;&#38598;&#19978;&#20063;&#21487;&#20197;&#22312;&#20960;&#20998;&#38047;&#20869;&#36816;&#34892;&#12290;&#27492;&#22806;&#65292;ResidualPlanner&#36824;&#21487;&#20197;&#26377;&#25928;&#22320;&#35745;&#31639;&#27599;&#20010;&#36793;&#32536;&#30340;&#26041;&#24046;/&#21327;&#26041;&#24046;&#20540;&#65288;&#20043;&#21069;&#30340;&#26041;&#27861;&#20250;&#24456;&#24555;&#22833;&#36133;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Noisy marginals are a common form of confidentiality-protecting data release and are useful for many downstream tasks such as contingency table analysis, construction of Bayesian networks, and even synthetic data generation. Privacy mechanisms that provide unbiased noisy answers to linear queries (such as marginals) are known as matrix mechanisms.  We propose ResidualPlanner, a matrix mechanism for marginals with Gaussian noise that is both optimal and scalable. ResidualPlanner can optimize for many loss functions that can be written as a convex function of marginal variances (prior work was restricted to just one predefined objective function). ResidualPlanner can optimize the accuracy of marginals in large scale settings in seconds, even when the previous state of the art (HDMM) runs out of memory. It even runs on datasets with 100 attributes in a couple of minutes. Furthermore ResidualPlanner can efficiently compute variance/covariance values for each marginal (prior methods quickly
&lt;/p&gt;</description></item></channel></rss>