<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#22686;&#24378;&#30340;&#24515;&#30005;&#22270;&#21487;&#20197;&#26377;&#25928;&#22320;&#35782;&#21035;&#26032;&#21457;&#31958;&#23615;&#30149;&#25104;&#20154;&#24739;&#32773;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#30340;ADA&#39118;&#38505;&#26816;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#20934;&#30830;&#24615;&#21644;&#29305;&#24322;&#24615;&#12290;</title><link>http://arxiv.org/abs/2205.02900</link><description>&lt;p&gt;
&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#22686;&#24378;&#30340;&#24515;&#30005;&#22270;&#36827;&#34892;&#26032;&#21457;&#31958;&#23615;&#30149;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
New-Onset Diabetes Assessment Using Artificial Intelligence-Enhanced Electrocardiography. (arXiv:2205.02900v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.02900
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#22686;&#24378;&#30340;&#24515;&#30005;&#22270;&#21487;&#20197;&#26377;&#25928;&#22320;&#35782;&#21035;&#26032;&#21457;&#31958;&#23615;&#30149;&#25104;&#20154;&#24739;&#32773;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#30340;ADA&#39118;&#38505;&#26816;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#20934;&#30830;&#24615;&#21644;&#29305;&#24322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26410;&#35786;&#26029;&#30340;&#31958;&#23615;&#30149;&#22312;&#24739;&#32773;&#20013;&#21344;21.4&#65285;&#65292;&#30001;&#20110;&#31579;&#26597;&#29575;&#30340;&#38480;&#21046;&#65292;&#31958;&#23615;&#30149;&#21487;&#33021;&#28508;&#20239;&#26080;&#30151;&#29366;&#32780;&#26410;&#34987;&#26816;&#27979;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#22686;&#24378;&#30340;&#24515;&#30005;&#22270;&#65288;ECG&#65289;&#26469;&#30830;&#23450;&#26032;&#21457;&#31958;&#23615;&#30149;&#30340;&#25104;&#20154;&#24739;&#32773;&#12290; &#25105;&#20204;&#35757;&#32451;&#20102;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#65292;&#20351;&#29992;12&#23548;&#32852;&#24515;&#30005;&#22270;&#21644;&#21487;&#29992;&#30340;&#20154;&#21475;&#32479;&#35745;&#23398;&#25968;&#25454;&#26469;&#20272;&#35745;HbA1c&#12290; &#25105;&#20204;&#22238;&#39038;&#24615;&#22320;&#25910;&#38598;&#20102;&#19968;&#32452;&#21253;&#21547;&#26377;&#37197;&#23545;&#30340;ECG&#21644;HbA1c&#25968;&#25454;&#30340;&#30149;&#20154;&#25968;&#25454;&#38598;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#30340;ADA&#39118;&#38505;&#26816;&#27979;&#65292;&#22522;&#20110;ECG&#30340;&#35780;&#20272;&#25928;&#26524;&#26356;&#22909;&#12290;AI&#22686;&#24378;&#30340;ECG&#35780;&#20272;&#30340;&#20934;&#30830;&#24615;&#36798;&#21040;81&#65285;&#65292;&#28789;&#25935;&#24230;&#20026;80&#65285;&#65292;&#29305;&#24322;&#24615;&#20026;82&#65285;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20154;&#24037;&#26234;&#33021;&#22686;&#24378;&#30340;ECG&#21487;&#20197;&#25104;&#20026;&#26032;&#21457;&#31958;&#23615;&#30149;&#25104;&#20154;&#24739;&#32773;&#30340;&#19968;&#20010;&#26377;&#21069;&#26223;&#30340;&#24037;&#20855;&#65292;&#29305;&#21035;&#26159;&#22312;&#20256;&#32479;&#31579;&#26597;&#26041;&#27861;&#26377;&#38480;&#30340;&#20154;&#32676;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Undiagnosed diabetes is present in 21.4% of adults with diabetes. Diabetes can remain asymptomatic and undetected due to limitations in screening rates. To address this issue, questionnaires, such as the American Diabetes Association (ADA) Risk test, have been recommended for use by physicians and the public. Based on evidence that blood glucose concentration can affect cardiac electrophysiology, we hypothesized that an artificial intelligence (AI)-enhanced electrocardiogram (ECG) could identify adults with new-onset diabetes. We trained a neural network to estimate HbA1c using a 12-lead ECG and readily available demographics. We retrospectively assembled a dataset comprised of patients with paired ECG and HbA1c data. The population of patients who receive both an ECG and HbA1c may a biased sample of the complete outpatient population, so we adjusted the importance placed on each patient to generate a more representative pseudo-population. We found ECG-based assessment outperforms the 
&lt;/p&gt;</description></item></channel></rss>