<rss version="2.0"><channel><title>Chat Arxiv cs.CC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CC</description><item><title>&#26412;&#25991;&#34920;&#26126;&#65292;&#20174;&#39640;&#32500;&#24179;&#28369;&#30446;&#26631;&#20998;&#24067;&#37319;&#26679;&#26102;&#65292;Metropolized Hamiltonian Monte Carlo (HMC)&#27604;Metropolis-adjusted Langevin&#31639;&#27861;&#65288;MALA&#65289;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2304.04724</link><description>&lt;p&gt;
Metropolized Hamiltonian Monte Carlo&#20309;&#26102;&#33021;&#35777;&#26126;&#20248;&#20110;Metropolis-adjusted Langevin&#31639;&#27861;&#65311;
&lt;/p&gt;
&lt;p&gt;
When does Metropolized Hamiltonian Monte Carlo provably outperform Metropolis-adjusted Langevin algorithm?. (arXiv:2304.04724v1 [stat.CO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04724
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#34920;&#26126;&#65292;&#20174;&#39640;&#32500;&#24179;&#28369;&#30446;&#26631;&#20998;&#24067;&#37319;&#26679;&#26102;&#65292;Metropolized Hamiltonian Monte Carlo (HMC)&#27604;Metropolis-adjusted Langevin&#31639;&#27861;&#65288;MALA&#65289;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;Metropolized Hamiltonian Monte Carlo (HMC)&#30340;&#28151;&#21512;&#26102;&#38388;&#65292;&#20351;&#29992;leapfrog&#31215;&#20998;&#22120;&#20174;$\mathbb{R}^d$&#20998;&#24067;&#20013;&#37319;&#26679;&#65292;&#35813;&#20998;&#24067;&#30340;&#23545;&#25968;&#23494;&#24230;&#24179;&#28369;&#65292;&#20855;&#26377;Frobenius&#33539;&#25968;&#19978;&#30340;&#26446;&#26222;&#24076;&#33576;&#40657;&#22622;&#65292;&#24182;&#28385;&#36275;&#31561;&#21608;&#24615;&#12290;&#25105;&#20204;&#23558;&#26799;&#24230;&#22797;&#26434;&#24230;&#38480;&#21046;&#20026;&#20174;&#19968;&#20010;&#26262;&#21551;&#21160;&#36798;&#21040;$\epsilon$&#35823;&#24046;&#30340;&#24635;&#21464;&#24322;&#36317;&#31163;&#25152;&#38656;&#30340;$\tilde O(d^{1/4}\text{polylog}(1/\epsilon))$&#65292;&#24182;&#23637;&#31034;&#20102;&#36873;&#25321;&#27604;1&#26356;&#22823;&#30340;leapfrog&#27493;&#25968;&#30340;&#22909;&#22788;&#12290;&#20026;&#20102;&#36229;&#36234;Wu&#31561;&#20154;&#65288;2022&#65289;&#23545;Metropolis-adjusted Langevin algorithm (MALA)&#30340;&#20998;&#26512;&#65292;&#20854;&#22312;&#32500;&#24230;&#20381;&#36182;&#24615;&#19978;&#26159;$\tilde{O}(d^{1/2}\text{polylog}(1/\epsilon))$&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#35777;&#26126;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#29305;&#24449;&#65306;&#36830;&#32493;HMC&#21160;&#24577;&#30340;&#20301;&#32622;&#21644;&#36895;&#24230;&#21464;&#37327;&#30340;&#31163;&#25955;&#21270;&#30340;&#32852;&#21512;&#20998;&#24067;&#36817;&#20284;&#19981;&#21464;&#12290;&#24403;&#36890;&#36807;leapfrog&#27493;&#25968;&#30340;&#24402;&#32435;&#26469;&#23637;&#31034;&#36825;&#20010;&#20851;&#38190;&#29305;&#24449;&#26102;&#65292;&#25105;&#20204;&#33021;&#22815;&#33719;&#24471;&#21508;&#31181;&#37327;&#30340;&#30697;&#30340;&#20272;&#35745;&#65292;&#36825;&#20123;&#37327;&#22312;&#38480;&#21046;Metropolized HMC&#30340;&#28151;&#21512;&#26102;&#38388;&#26102;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#65292;&#32780;&#22312;MALA&#20013;&#24050;&#30693;&#30340;&#31867;&#20284;&#32467;&#26524;&#26159;&#38169;&#35823;&#30340;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#37319;&#26679;&#39640;&#32500;&#24179;&#28369;&#30446;&#26631;&#20998;&#24067;&#26102;&#65292;&#20351;&#29992;&#20855;&#26377;&#22823;&#37327;leapfrog&#27493;&#39588;&#30340;Metropolized HMC&#21487;&#33021;&#27604;&#20351;&#29992;MALA&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze the mixing time of Metropolized Hamiltonian Monte Carlo (HMC) with the leapfrog integrator to sample from a distribution on $\mathbb{R}^d$ whose log-density is smooth, has Lipschitz Hessian in Frobenius norm and satisfies isoperimetry. We bound the gradient complexity to reach $\epsilon$ error in total variation distance from a warm start by $\tilde O(d^{1/4}\text{polylog}(1/\epsilon))$ and demonstrate the benefit of choosing the number of leapfrog steps to be larger than 1. To surpass previous analysis on Metropolis-adjusted Langevin algorithm (MALA) that has $\tilde{O}(d^{1/2}\text{polylog}(1/\epsilon))$ dimension dependency in Wu et al. (2022), we reveal a key feature in our proof that the joint distribution of the location and velocity variables of the discretization of the continuous HMC dynamics stays approximately invariant. This key feature, when shown via induction over the number of leapfrog steps, enables us to obtain estimates on moments of various quantities tha
&lt;/p&gt;</description></item></channel></rss>