<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#36890;&#36807;&#20998;&#26512;&#32654;&#22269;&#21069;100&#21517;&#22823;&#23398;&#21046;&#23450;&#30340;&#23398;&#26415;&#25919;&#31574;&#21644;&#25351;&#21335;&#65292;&#25581;&#31034;&#20102;&#22823;&#22810;&#25968;&#22823;&#23398;&#23545;&#20110;&#22312;&#39640;&#31561;&#25945;&#32946;&#20013;&#25972;&#21512;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#24320;&#25918;&#20294;&#35880;&#24910;&#24577;&#24230;&#65292;&#20027;&#35201;&#20851;&#27880;&#28857;&#22312;&#20110;&#20262;&#29702;&#20351;&#29992;&#12289;&#20934;&#30830;&#24615;&#21644;&#25968;&#25454;&#38544;&#31169;&#12290;</title><link>https://arxiv.org/abs/2312.05235</link><description>&lt;p&gt;
&#39640;&#31561;&#25945;&#32946;&#20013;&#30340;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#65306;&#36890;&#36807;&#22823;&#23398;&#30340;&#25919;&#31574;&#12289;&#36164;&#28304;&#21644;&#25351;&#21335;&#20102;&#35299;ChatGPT
&lt;/p&gt;
&lt;p&gt;
Generative AI in Higher Education: Seeing ChatGPT Through Universities' Policies, Resources, and Guidelines
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.05235
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#26512;&#32654;&#22269;&#21069;100&#21517;&#22823;&#23398;&#21046;&#23450;&#30340;&#23398;&#26415;&#25919;&#31574;&#21644;&#25351;&#21335;&#65292;&#25581;&#31034;&#20102;&#22823;&#22810;&#25968;&#22823;&#23398;&#23545;&#20110;&#22312;&#39640;&#31561;&#25945;&#32946;&#20013;&#25972;&#21512;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#24320;&#25918;&#20294;&#35880;&#24910;&#24577;&#24230;&#65292;&#20027;&#35201;&#20851;&#27880;&#28857;&#22312;&#20110;&#20262;&#29702;&#20351;&#29992;&#12289;&#20934;&#30830;&#24615;&#21644;&#25968;&#25454;&#38544;&#31169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#65288;GenAI&#65289;&#25216;&#26415;&#30340;&#36827;&#27493;&#65288;&#22914;ChatGPT&#65289;&#20026;&#20016;&#23500;&#25945;&#32946;&#32463;&#39564;&#25552;&#20379;&#20102;&#26426;&#20250;&#65292;&#20294;&#22914;&#26524;&#34987;&#28389;&#29992;&#65292;&#20063;&#20250;&#24341;&#21457;&#26377;&#20851;&#23398;&#26415;&#35802;&#20449;&#30340;&#25285;&#24551;&#12290;&#35813;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#20998;&#26512;&#32654;&#22269;&#25490;&#21517;&#21069;100&#30340;&#22823;&#23398;&#21046;&#23450;&#30340;&#23398;&#26415;&#25919;&#31574;&#21644;&#25351;&#21335;&#26469;&#25506;&#35752;&#22823;&#23398;&#21644;&#25945;&#32946;&#32773;&#22914;&#20309;&#22312;&#20854;&#23398;&#26415;&#32972;&#26223;&#20013;&#23545;GenAI&#30340;&#21457;&#23637;&#20570;&#20986;&#21709;&#24212;&#21644;&#36866;&#24212;&#12290;&#25968;&#25454;&#26469;&#28304;&#21253;&#25324;&#36825;&#20123;&#22823;&#23398;&#21046;&#23450;&#30340;&#23398;&#26415;&#25919;&#31574;&#12289;&#22768;&#26126;&#12289;&#25351;&#21335;&#20197;&#21450;&#30456;&#20851;&#36164;&#28304;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22823;&#22810;&#25968;&#22823;&#23398;&#23545;&#20110;&#25972;&#21512;GenAI&#37319;&#21462;&#20102;&#24320;&#25918;&#20294;&#35880;&#24910;&#30340;&#24577;&#24230;&#12290;&#20027;&#35201;&#20851;&#27880;&#28857;&#22312;&#20110;&#20262;&#29702;&#20351;&#29992;&#12289;&#20934;&#30830;&#24615;&#21644;&#25968;&#25454;&#38544;&#31169;&#12290;&#22823;&#22810;&#25968;&#22823;&#23398;&#31215;&#26497;&#22238;&#24212;&#24182;&#25552;&#20379;&#22810;&#31181;&#36164;&#28304;&#65292;&#22914;&#35838;&#31243;&#22823;&#32434;&#27169;&#26495;/&#31034;&#20363;&#12289;&#30740;&#35752;&#20250;&#12289;&#20849;&#20139;&#25991;&#31456;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.05235v2 Announce Type: replace  Abstract: The advancements in Generative Artificial Intelligence (GenAI) technologies such as ChatGPT provide opportunities to enrich educational experiences, but also raise concerns about academic integrity if misused. This study aims to explore how universities and educators respond and adapt to the development of GenAI in their academic contexts by analyzing academic policies and guidelines established by top-ranked US universities regarding the use of ChatGPT in higher education. The data sources include academic policies, statements, guidelines as well as relevant resources provided by the top 100 universities in the US. Results show that the majority of these universities adopt an open but cautious approach towards the integration of GenAI. Primary concerns lie in ethical usage, accuracy, and data privacy. Most universities actively respond and provide diverse types of resources, such as syllabus templates/samples, workshops, shared arti
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20844;&#24179;&#25490;&#21517;&#26631;&#20934;Equal-Opportunity Ranking&#65288;EOR&#65289;&#65292;&#23558;&#24213;&#23618;&#30456;&#20851;&#24615;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#24046;&#24322;&#32771;&#34385;&#22312;&#20869;&#65292;&#36890;&#36807;&#32452;&#20869;&#20844;&#24179;&#25277;&#22870;&#23454;&#29616;&#20844;&#24179;&#25490;&#21517;&#12290;</title><link>https://arxiv.org/abs/2309.01610</link><description>&lt;p&gt;
&#19981;&#21516;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#20844;&#24179;&#25490;&#21517;
&lt;/p&gt;
&lt;p&gt;
Fair Ranking under Disparate Uncertainty
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2309.01610
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20844;&#24179;&#25490;&#21517;&#26631;&#20934;Equal-Opportunity Ranking&#65288;EOR&#65289;&#65292;&#23558;&#24213;&#23618;&#30456;&#20851;&#24615;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#24046;&#24322;&#32771;&#34385;&#22312;&#20869;&#65292;&#36890;&#36807;&#32452;&#20869;&#20844;&#24179;&#25277;&#22870;&#23454;&#29616;&#20844;&#24179;&#25490;&#21517;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25490;&#21517;&#26159;&#19968;&#31181;&#24191;&#27867;&#20351;&#29992;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#23558;&#20154;&#31867;&#35780;&#20272;&#32773;&#30340;&#27880;&#24847;&#21147;&#38598;&#20013;&#22312;&#21487;&#31649;&#29702;&#30340;&#36873;&#39033;&#23376;&#38598;&#19978;&#12290;&#23427;&#20316;&#20026;&#20154;&#31867;&#20915;&#31574;&#36807;&#31243;&#30340;&#19968;&#37096;&#20998;&#30340;&#20351;&#29992;&#33539;&#22260;&#20174;&#22312;&#30005;&#23376;&#21830;&#21153;&#32593;&#31449;&#19978;&#23637;&#31034;&#28508;&#22312;&#30456;&#20851;&#20135;&#21697;&#21040;&#20026;&#20154;&#24037;&#23457;&#26597;&#20248;&#20808;&#22788;&#29702;&#22823;&#23398;&#30003;&#35831;&#12290;&#34429;&#28982;&#25490;&#21517;&#21487;&#20197;&#36890;&#36807;&#23558;&#20851;&#27880;&#38598;&#20013;&#22312;&#26368;&#26377;&#21069;&#36884;&#30340;&#36873;&#39033;&#19978;&#20351;&#20154;&#31867;&#35780;&#20272;&#26356;&#21152;&#39640;&#25928;&#65292;&#20294;&#25105;&#20204;&#35748;&#20026;&#65292;&#22914;&#26524;&#24213;&#23618;&#30456;&#20851;&#24615;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#22312;&#19981;&#21516;&#32452;&#21035;&#30340;&#36873;&#39033;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#65292;&#25490;&#21517;&#21487;&#33021;&#20250;&#24341;&#20837;&#19981;&#20844;&#24179;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#36825;&#31181;&#19981;&#30830;&#23450;&#24615;&#24046;&#24322;&#20284;&#20046;&#26222;&#36941;&#23384;&#22312;&#65292;&#24120;&#24120;&#23545;&#23569;&#25968;&#32676;&#20307;&#36896;&#25104;&#25439;&#23475;&#65292;&#22240;&#20026;&#36825;&#20123;&#32676;&#20307;&#30340;&#30456;&#20851;&#24615;&#20272;&#35745;&#21487;&#33021;&#30001;&#20110;&#32570;&#20047;&#25968;&#25454;&#25110;&#21512;&#36866;&#30340;&#29305;&#24449;&#32780;&#20855;&#26377;&#26356;&#39640;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#20844;&#24179;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Equal-Opportunity Ranking&#65288;EOR&#65289;&#20316;&#20026;&#25490;&#21517;&#30340;&#26032;&#20844;&#24179;&#26631;&#20934;&#65292;&#24182;&#23637;&#31034;&#23427;&#23545;&#24212;&#20110;&#22312;&#30456;&#20851;&#36873;&#39033;&#20043;&#38388;&#36827;&#34892;&#32452;&#20869;&#20844;&#24179;&#25277;&#22870;
&lt;/p&gt;
&lt;p&gt;
arXiv:2309.01610v2 Announce Type: replace  Abstract: Ranking is a ubiquitous method for focusing the attention of human evaluators on a manageable subset of options. Its use as part of human decision-making processes ranges from surfacing potentially relevant products on an e-commerce site to prioritizing college applications for human review. While ranking can make human evaluation more effective by focusing attention on the most promising options, we argue that it can introduce unfairness if the uncertainty of the underlying relevance model differs between groups of options. Unfortunately, such disparity in uncertainty appears widespread, often to the detriment of minority groups for which relevance estimates can have higher uncertainty due to a lack of data or appropriate features. To address this fairness issue, we propose Equal-Opportunity Ranking (EOR) as a new fairness criterion for ranking and show that it corresponds to a group-wise fair lottery among the relevant options even
&lt;/p&gt;</description></item></channel></rss>