<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23384;&#22312;&#27861;&#24459;&#24187;&#35273;&#65292;&#19981;&#19968;&#33268;&#27861;&#24459;&#20107;&#23454;&#65292;&#24187;&#35273;&#26222;&#36941;&#23384;&#22312;&#39640;&#36798;69%&#33267;88%&#30340;&#24773;&#20917;&#65292;&#26080;&#27861;&#32416;&#27491;&#29992;&#25143;&#38169;&#35823;&#27861;&#24459;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2401.01301</link><description>&lt;p&gt;
&#22823;&#22411;&#27861;&#24459;&#34394;&#26500;&#65306;&#25581;&#31034;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20013;&#30340;&#27861;&#24459;&#24187;&#35273;
&lt;/p&gt;
&lt;p&gt;
Large Legal Fictions: Profiling Legal Hallucinations in Large Language Models. (arXiv:2401.01301v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01301
&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23384;&#22312;&#27861;&#24459;&#24187;&#35273;&#65292;&#19981;&#19968;&#33268;&#27861;&#24459;&#20107;&#23454;&#65292;&#24187;&#35273;&#26222;&#36941;&#23384;&#22312;&#39640;&#36798;69%&#33267;88%&#30340;&#24773;&#20917;&#65292;&#26080;&#27861;&#32416;&#27491;&#29992;&#25143;&#38169;&#35823;&#27861;&#24459;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#26377;&#21487;&#33021;&#25913;&#21464;&#27861;&#24459;&#23454;&#36341;&#65292;&#20294;&#20854;&#28508;&#21147;&#21463;&#21040;&#27861;&#24459;&#24187;&#35273;&#30340;&#23041;&#32961;&#65292;&#21363;&#36825;&#20123;&#27169;&#22411;&#20135;&#29983;&#19982;&#27861;&#24459;&#20107;&#23454;&#19981;&#19968;&#33268;&#30340;&#22238;&#31572;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#22871;&#21407;&#21019;&#30340;&#27861;&#24459;&#26597;&#35810;&#26469;&#35843;&#26597;&#36825;&#20123;&#24187;&#35273;&#30340;&#31243;&#24230;&#65292;&#23558;LLMs&#30340;&#22238;&#31572;&#19982;&#32467;&#26500;&#21270;&#30340;&#27861;&#24459;&#20803;&#25968;&#25454;&#36827;&#34892;&#23545;&#27604;&#65292;&#24182;&#26816;&#26597;&#20854;&#19968;&#33268;&#24615;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#26377;&#22235;&#20010;&#20851;&#38190;&#36129;&#29486;&#65306;&#65288;1&#65289;&#25105;&#20204;&#24314;&#31435;&#20102;&#27861;&#24459;&#24187;&#35273;&#30340;&#20998;&#31867;&#20307;&#31995;&#65292;&#20026;&#20170;&#21518;&#22312;&#36825;&#19968;&#39046;&#22495;&#36827;&#34892;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#27010;&#24565;&#26694;&#26550;&#12290;&#65288;2&#65289;&#25105;&#20204;&#21457;&#29616;&#65292;&#27861;&#24459;&#24187;&#35273;&#30340;&#26222;&#36941;&#24615;&#20196;&#20154;&#25285;&#24551;&#65292;&#22312;&#23545;&#38543;&#26426;&#32852;&#37030;&#27861;&#38498;&#26696;&#20363;&#36827;&#34892;&#20855;&#20307;&#12289;&#21487;&#39564;&#35777;&#30340;&#38382;&#39064;&#26102;&#65292;ChatGPT 3.5&#20135;&#29983;&#30340;&#24187;&#35273;&#21457;&#29983;&#29575;&#20026;69&#65285;&#65292;&#32780;Llama 2&#20026;88&#65285;&#12290;&#65288;3&#65289;&#25105;&#20204;&#23637;&#31034;&#20102;LLMs&#22312;&#36870;&#21521;&#38382;&#39064;&#35774;&#32622;&#20013;&#24448;&#24448;&#26080;&#27861;&#32416;&#27491;&#29992;&#25143;&#30340;&#38169;&#35823;&#27861;&#24459;&#20551;&#35774;&#12290;&#65288;4&#65289;&#25105;&#20204;&#25552;&#20379;&#20102;&#35777;&#25454;&#34920;&#26126;LLMs&#24182;&#19981;&#24635;&#33021;&#39044;&#27979;&#25110;&#24182;&#19981;&#24635;&#30693;&#36947;...
&lt;/p&gt;
&lt;p&gt;
Large language models (LLMs) have the potential to transform the practice of law, but this potential is threatened by the presence of legal hallucinations -- responses from these models that are not consistent with legal facts. We investigate the extent of these hallucinations using an original suite of legal queries, comparing LLMs' responses to structured legal metadata and examining their consistency. Our work makes four key contributions: (1) We develop a typology of legal hallucinations, providing a conceptual framework for future research in this area. (2) We find that legal hallucinations are alarmingly prevalent, occurring between 69% of the time with ChatGPT 3.5 and 88% with Llama 2, when these models are asked specific, verifiable questions about random federal court cases. (3) We illustrate that LLMs often fail to correct a user's incorrect legal assumptions in a contra-factual question setup. (4) We provide evidence that LLMs cannot always predict, or do not always know, wh
&lt;/p&gt;</description></item></channel></rss>