<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>ImageNot&#25968;&#25454;&#38598;&#19982;ImageNet&#24418;&#25104;&#23545;&#27604;&#65292;&#23637;&#31034;&#20102;&#20851;&#38190;&#27169;&#22411;&#22312;&#20004;&#20010;&#25968;&#25454;&#38598;&#19978;&#30340;&#25490;&#21517;&#19968;&#33268;&#24615;&#65292;&#20197;&#21450;&#23427;&#20204;&#30456;&#23545;&#20110;&#20808;&#21069;&#27169;&#22411;&#30340;&#25913;&#36827;&#22312;&#20004;&#20010;&#25968;&#25454;&#38598;&#20013;&#37117;&#20855;&#26377;&#24378;&#30456;&#20851;&#24615;&#65292;&#34920;&#26126;&#20102;ImageNot&#23545;&#20110;&#36801;&#31227;&#23398;&#20064;&#20855;&#26377;&#31867;&#20284;&#25928;&#29992;&#20110;ImageNet&#12290;</title><link>https://arxiv.org/abs/2404.02112</link><description>&lt;p&gt;
ImageNot&#65306;&#19982;ImageNet&#24418;&#25104;&#23545;&#27604;&#65292;&#20445;&#25345;&#27169;&#22411;&#25490;&#21517;
&lt;/p&gt;
&lt;p&gt;
ImageNot: A contrast with ImageNet preserves model rankings
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02112
&lt;/p&gt;
&lt;p&gt;
ImageNot&#25968;&#25454;&#38598;&#19982;ImageNet&#24418;&#25104;&#23545;&#27604;&#65292;&#23637;&#31034;&#20102;&#20851;&#38190;&#27169;&#22411;&#22312;&#20004;&#20010;&#25968;&#25454;&#38598;&#19978;&#30340;&#25490;&#21517;&#19968;&#33268;&#24615;&#65292;&#20197;&#21450;&#23427;&#20204;&#30456;&#23545;&#20110;&#20808;&#21069;&#27169;&#22411;&#30340;&#25913;&#36827;&#22312;&#20004;&#20010;&#25968;&#25454;&#38598;&#20013;&#37117;&#20855;&#26377;&#24378;&#30456;&#20851;&#24615;&#65292;&#34920;&#26126;&#20102;ImageNot&#23545;&#20110;&#36801;&#31227;&#23398;&#20064;&#20855;&#26377;&#31867;&#20284;&#25928;&#29992;&#20110;ImageNet&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;ImageNot&#65292;&#36825;&#26159;&#19968;&#20010;&#26088;&#22312;&#19982;ImageNet&#22312;&#35268;&#27169;&#19978;&#21305;&#37197;&#20294;&#22312;&#20854;&#20182;&#26041;&#38754;&#26377;&#30528;&#26174;&#33879;&#24046;&#24322;&#30340;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22810;&#24180;&#26469;&#20026;ImageNet&#24320;&#21457;&#30340;&#20851;&#38190;&#27169;&#22411;&#26550;&#26500;&#22312;ImageNot&#19978;&#35757;&#32451;&#21644;&#35780;&#20272;&#26102;&#65292;&#20854;&#25490;&#21517;&#19982;&#23427;&#20204;&#22312;ImageNet&#19978;&#30340;&#25490;&#21517;&#23436;&#20840;&#30456;&#21516;&#12290;&#26080;&#35770;&#26159;&#20174;&#22836;&#24320;&#22987;&#35757;&#32451;&#27169;&#22411;&#36824;&#26159;&#24494;&#35843;&#27169;&#22411;&#65292;&#36825;&#19968;&#28857;&#37117;&#25104;&#31435;&#12290;&#27492;&#22806;&#65292;&#27599;&#20010;&#27169;&#22411;&#30456;&#23545;&#20110;&#20808;&#21069;&#27169;&#22411;&#30340;&#25913;&#36827;&#22312;&#20004;&#20010;&#25968;&#25454;&#38598;&#20013;&#37117;&#26377;&#24456;&#24378;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#65292;ImageNot&#22312;&#36801;&#31227;&#23398;&#20064;&#30446;&#30340;&#19978;&#20855;&#26377;&#31867;&#20284;&#30340;&#25928;&#29992;&#20110;ImageNet&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#23637;&#31034;&#20102;&#22270;&#20687;&#20998;&#31867;&#27169;&#22411;&#30456;&#23545;&#24615;&#33021;&#30340;&#24778;&#20154;&#22806;&#37096;&#26377;&#25928;&#24615;&#12290;&#36825;&#19982;&#36890;&#24120;&#22312;&#25968;&#25454;&#38598;&#21457;&#29983;&#23567;&#21464;&#21270;&#26102;&#29978;&#33267;&#32454;&#24494;&#25913;&#21464;&#26102;&#32477;&#23545;&#20934;&#30830;&#24230;&#25968;&#23383;&#20250;&#24613;&#21095;&#19979;&#38477;&#24418;&#25104;&#23545;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02112v1 Announce Type: new  Abstract: We introduce ImageNot, a dataset designed to match the scale of ImageNet while differing drastically in other aspects. We show that key model architectures developed for ImageNet over the years rank identically when trained and evaluated on ImageNot to how they rank on ImageNet. This is true when training models from scratch or fine-tuning them. Moreover, the relative improvements of each model over earlier models strongly correlate in both datasets. We further give evidence that ImageNot has a similar utility as ImageNet for transfer learning purposes. Our work demonstrates a surprising degree of external validity in the relative performance of image classification models. This stands in contrast with absolute accuracy numbers that typically drop sharply even under small changes to a dataset.
&lt;/p&gt;</description></item></channel></rss>