<rss version="2.0"><channel><title>Chat Arxiv cs.CG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CG</description><item><title>&#20351;&#29992;&#30697;&#35282;&#22797;&#21512;&#20307;&#30340;&#21516;&#35843;&#27010;&#24565;&#23450;&#20041;&#20102;&#21452;&#20998;&#32423;&#25345;&#20037;&#24615;&#26465;&#30721;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#31283;&#23450;&#24615;&#23450;&#29702;</title><link>https://arxiv.org/abs/2303.14694</link><description>&lt;p&gt;
&#19968;&#20010;&#20851;&#20110;&#21452;&#20998;&#32423;&#25345;&#20037;&#24615;&#26465;&#30721;&#30340;&#31283;&#23450;&#24615;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
A stability theorem for bigraded persistence barcodes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2303.14694
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#30697;&#35282;&#22797;&#21512;&#20307;&#30340;&#21516;&#35843;&#27010;&#24565;&#23450;&#20041;&#20102;&#21452;&#20998;&#32423;&#25345;&#20037;&#24615;&#26465;&#30721;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#31283;&#23450;&#24615;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#36234;&#25176;&#37324;&#26031;-&#37324;&#26222;&#26031;&#28388;&#27874;&#30340;&#30697;&#35282;&#22797;&#21512;&#20307;&#30340;&#26222;&#36890;&#21644;&#21452;&#37325;&#21516;&#35843;&#23450;&#20041;&#20102;&#26377;&#38480;&#20266;&#24230;&#37327;&#31354;&#38388;X&#30340;&#21452;&#20998;&#32423;&#25345;&#20037;&#21516;&#35843;&#27169;&#21644;&#21452;&#20998;&#32423;&#26465;&#30721;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20851;&#20110;&#21452;&#20998;&#32423;&#25345;&#20037;&#24615;&#21452;&#21516;&#35843;&#27169;&#21644;&#26465;&#30721;&#30340;&#31283;&#23450;&#24615;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2303.14694v2 Announce Type: replace-cross  Abstract: We define bigraded persistent homology modules and bigraded barcodes of a finite pseudo-metric space X using the ordinary and double homology of the moment-angle complex associated with the Vietoris-Rips filtration of X. We prove a stability theorem for the bigraded persistent double homology modules and barcodes.
&lt;/p&gt;</description></item></channel></rss>