<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#30446;&#26631;&#26816;&#27979;&#27169;&#22411;&#30340;&#26032;&#39062;&#21306;&#38388;&#36793;&#30028;&#20256;&#25773;&#65288;IBP&#65289;&#26041;&#27861;&#65292;IBP IoU&#22312;&#30830;&#20445;&#20934;&#30830;&#24615;&#21644;&#31283;&#23450;&#24615;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#20026;&#26356;&#23433;&#20840;&#21644;&#26356;&#31283;&#20581;&#30340;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20570;&#20986;&#36129;&#29486;&#12290;</title><link>https://arxiv.org/abs/2403.08788</link><description>&lt;p&gt;
&#38024;&#23545;&#30446;&#26631;&#26816;&#27979;&#30340;&#39564;&#35777;--IBP IoU
&lt;/p&gt;
&lt;p&gt;
Verification for Object Detection -- IBP IoU
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08788
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#30446;&#26631;&#26816;&#27979;&#27169;&#22411;&#30340;&#26032;&#39062;&#21306;&#38388;&#36793;&#30028;&#20256;&#25773;&#65288;IBP&#65289;&#26041;&#27861;&#65292;IBP IoU&#22312;&#30830;&#20445;&#20934;&#30830;&#24615;&#21644;&#31283;&#23450;&#24615;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#20026;&#26356;&#23433;&#20840;&#21644;&#26356;&#31283;&#20581;&#30340;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20570;&#20986;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21306;&#38388;&#36793;&#30028;&#20256;&#25773;&#65288;IBP&#65289;&#26041;&#27861;&#65292;&#29992;&#20110;&#24418;&#24335;&#39564;&#35777;&#23545;&#35937;&#26816;&#27979;&#27169;&#22411;&#65292;&#29305;&#21035;&#38024;&#23545;&#20132;&#24182;&#27604;&#65288;IoU&#65289;&#24230;&#37327;&#12290;&#35813;&#26041;&#27861;&#24050;&#22312;&#19968;&#20010;&#21517;&#20026;IBP IoU&#30340;&#24320;&#28304;&#20195;&#30721;&#20013;&#23454;&#29616;&#65292;&#19982;&#27969;&#34892;&#30340;&#22522;&#20110;&#25277;&#35937;&#35299;&#37322;&#30340;&#39564;&#35777;&#24037;&#20855;&#20860;&#23481;&#12290;&#35813;&#39564;&#35777;&#22120;&#22312;&#30528;&#38470;&#36884;&#24452;&#36305;&#36947;&#26816;&#27979;&#21644;&#25163;&#20889;&#25968;&#23383;&#35782;&#21035;&#26696;&#20363;&#30740;&#31350;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#19982;&#22522;&#32447;&#65288;Vanilla IBP IoU&#65289;&#30340;&#27604;&#36739;&#31361;&#20986;&#20102;IBP IoU&#22312;&#30830;&#20445;&#20934;&#30830;&#24615;&#21644;&#31283;&#23450;&#24615;&#26041;&#38754;&#30340;&#20986;&#33394;&#24615;&#33021;&#65292;&#26377;&#21161;&#20110;&#23454;&#29616;&#26356;&#23433;&#20840;&#21644;&#26356;&#31283;&#20581;&#30340;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08788v1 Announce Type: cross  Abstract: We introduce a novel Interval Bound Propagation (IBP) approach for the formal verification of object detection models, specifically targeting the Intersection over Union (IoU) metric. The approach has been implemented in an open source code, named IBP IoU, compatible with popular abstract interpretation based verification tools. The resulting verifier is evaluated on landing approach runway detection and handwritten digit recognition case studies. Comparisons against a baseline (Vanilla IBP IoU) highlight the superior performance of IBP IoU in ensuring accuracy and stability, contributing to more secure and robust machine learning applications.
&lt;/p&gt;</description></item></channel></rss>