<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#35770;&#25991;&#25551;&#36848;&#20102;&#19968;&#20010;&#22810;&#27169;&#24577;&#12289;&#21487;&#35299;&#37322;&#30340;AI&#39537;&#21160;&#32842;&#22825;&#26426;&#22120;&#20154;&#36741;&#23548;&#31995;&#32479;&#65292;&#22312;&#35299;&#20915;&#39640;&#20013;&#23398;&#29983;&#21327;&#21516;&#35299;&#20915;&#39764;&#26041;&#38382;&#39064;&#26102;&#65292;&#35299;&#20915;&#20102;&#25968;&#25454;&#38544;&#31169;&#12289;&#20449;&#24687;&#27844;&#38706;&#12289;&#28389;&#29992;&#35821;&#35328;&#21644;&#20844;&#24179;&#24615;&#31561;&#20262;&#29702;&#21644;&#20449;&#20219;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.01760</link><description>&lt;p&gt;
&#19968;&#20010;&#22810;&#27169;&#24577;&#12289;&#21487;&#35299;&#37322;&#30340;AI&#39537;&#21160;&#32842;&#22825;&#26426;&#22120;&#20154;&#36741;&#23548;&#31995;&#32479;&#20013;&#30340;&#20449;&#20219;&#21644;&#20262;&#29702;&#32771;&#34385;&#65306;&#20197;&#21327;&#21516;&#35299;&#20915;&#39764;&#26041;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Trust and ethical considerations in a multi-modal, explainable AI-driven chatbot tutoring system: The case of collaboratively solving Rubik's Cube
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01760
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25551;&#36848;&#20102;&#19968;&#20010;&#22810;&#27169;&#24577;&#12289;&#21487;&#35299;&#37322;&#30340;AI&#39537;&#21160;&#32842;&#22825;&#26426;&#22120;&#20154;&#36741;&#23548;&#31995;&#32479;&#65292;&#22312;&#35299;&#20915;&#39640;&#20013;&#23398;&#29983;&#21327;&#21516;&#35299;&#20915;&#39764;&#26041;&#38382;&#39064;&#26102;&#65292;&#35299;&#20915;&#20102;&#25968;&#25454;&#38544;&#31169;&#12289;&#20449;&#24687;&#27844;&#38706;&#12289;&#28389;&#29992;&#35821;&#35328;&#21644;&#20844;&#24179;&#24615;&#31561;&#20262;&#29702;&#21644;&#20449;&#20219;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#20855;&#26377;&#20174;&#22823;&#37327;&#20851;&#20110;&#23398;&#29983;&#23398;&#20064;&#27169;&#24335;&#30340;&#25968;&#25454;&#20013;&#21457;&#29616;&#27934;&#23519;&#21147;&#30340;&#28508;&#21147;&#65292;&#26377;&#26395;&#25913;&#21464;&#25945;&#32946;&#12290;&#28982;&#32780;&#65292;&#20154;&#24037;&#26234;&#33021;&#30340;&#20262;&#29702;&#21644;&#20449;&#20219;&#38382;&#39064;&#24050;&#32463;&#24341;&#36215;&#20102;&#20851;&#27880;&#65292;&#20294;&#23578;&#26410;&#35299;&#20915;&#12290;&#22312;&#39640;&#20013;&#20154;&#24037;&#26234;&#33021;&#25945;&#32946;&#20013;&#65292;&#31361;&#20986;&#30340;&#20262;&#29702;&#38382;&#39064;&#21253;&#25324;&#25968;&#25454;&#38544;&#31169;&#12289;&#20449;&#24687;&#27844;&#38706;&#12289;&#28389;&#29992;&#35821;&#35328;&#21644;&#20844;&#24179;&#24615;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#20026;&#35299;&#20915;&#39640;&#20013;&#23398;&#29983;&#19982;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#35299;&#20915;&#39764;&#26041;&#30340;&#20262;&#29702;&#21644;&#20449;&#20219;&#38382;&#39064;&#32780;&#26500;&#24314;&#30340;&#25216;&#26415;&#32452;&#20214;&#65288;&#31216;&#20026;ALLURE chatbot&#65289;&#12290;&#22312;&#25968;&#25454;&#38544;&#31169;&#26041;&#38754;&#65292;&#25105;&#20204;&#24076;&#26395;&#30830;&#20445;&#20799;&#31461;&#12289;&#29238;&#27597;&#21644;&#25945;&#24072;&#30340;&#30693;&#24773;&#21516;&#24847;&#22788;&#20110;&#20219;&#20309;&#31649;&#29702;&#30340;&#25968;&#25454;&#30340;&#20013;&#24515;&#20301;&#32622;&#12290;&#30001;&#20110;&#28041;&#21450;&#20799;&#31461;&#65292;&#31995;&#32479;&#33021;&#22815;&#25509;&#21463;&#29992;&#25143;&#21644;&#20154;&#24037;&#26234;&#33021;&#25552;&#20379;&#30340;&#25991;&#26412;&#12289;&#38899;&#39057;&#25110;&#35270;&#35273;&#35821;&#35328;&#65292;&#24182;&#23558;&#20114;&#21160;&#24341;&#23548;&#36828;&#31163;&#21361;&#38505;&#24773;&#20917;&#12290;&#22312;&#20449;&#24687;&#31649;&#29702;&#26041;&#38754;&#65292;&#25105;&#20204;&#36824;&#24076;&#26395;&#30830;&#20445;&#31995;&#32479;&#21487;&#20197;&#21033;&#29992;&#26426;&#21046;&#38450;&#27490;&#20449;&#24687;&#27844;&#38706;&#30340;&#21361;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) has the potential to transform education with its power of uncovering insights from massive data about student learning patterns. However, ethical and trustworthy concerns of AI have been raised but are unsolved. Prominent ethical issues in high school AI education include data privacy, information leakage, abusive language, and fairness. This paper describes technological components that were built to address ethical and trustworthy concerns in a multi-modal collaborative platform (called ALLURE chatbot) for high school students to collaborate with AI to solve the Rubik's cube. In data privacy, we want to ensure that the informed consent of children, parents, and teachers, is at the center of any data that is managed. Since children are involved, language, whether textual, audio, or visual, is acceptable both from users and AI and the system can steer interaction away from dangerous situations. In information management, we also want to ensure that the sys
&lt;/p&gt;</description></item></channel></rss>