<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#24341;&#20837;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#40657;&#23458;&#39532;&#25289;&#26494;&#22312;&#36719;&#20214;&#34892;&#19994;&#20013;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#65292;&#24182;&#22312;&#25945;&#32946;&#39046;&#22495;&#24102;&#26469;&#20102;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2401.17434</link><description>&lt;p&gt;
&#22312;&#40657;&#23458;&#39532;&#25289;&#26494;&#20013;&#38598;&#25104;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;: &#26426;&#36935;&#65292;&#25361;&#25112;&#21644;&#25945;&#32946;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Integrating Generative AI in Hackathons: Opportunities, Challenges, and Educational Implications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17434
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#40657;&#23458;&#39532;&#25289;&#26494;&#22312;&#36719;&#20214;&#34892;&#19994;&#20013;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#65292;&#24182;&#22312;&#25945;&#32946;&#39046;&#22495;&#24102;&#26469;&#20102;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#40657;&#23458;&#39532;&#25289;&#26494;&#21644;&#36719;&#20214;&#31454;&#36187;&#22312;&#36719;&#20214;&#34892;&#19994;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#23427;&#20204;&#23545;&#32452;&#32455;&#21644;&#23398;&#29983;&#30340;&#21019;&#26032;&#21644;&#25216;&#33021;&#21457;&#23637;&#36215;&#21040;&#37325;&#35201;&#25512;&#21160;&#20316;&#29992;&#12290;&#36825;&#20123;&#24179;&#21488;&#20351;&#20844;&#21496;&#33021;&#22815;&#36805;&#36895;&#21407;&#22411;&#21270;&#24819;&#27861;&#65292;&#32780;&#23398;&#29983;&#21017;&#33719;&#24471;&#20016;&#23500;&#30340;&#23398;&#20064;&#32463;&#39564;&#65292;&#22686;&#24378;&#20182;&#20204;&#30340;&#23454;&#36341;&#25216;&#33021;&#12290;&#22810;&#24180;&#26469;&#65292;&#40657;&#23458;&#39532;&#25289;&#26494;&#24050;&#32463;&#20174;&#31616;&#21333;&#30340;&#31454;&#20105;&#27963;&#21160;&#36716;&#21464;&#20026;&#37325;&#35201;&#30340;&#25945;&#32946;&#24037;&#20855;&#65292;&#23558;&#29702;&#35770;&#30693;&#35782;&#19982;&#23454;&#38469;&#38382;&#39064;&#35299;&#20915;&#30456;&#32467;&#21512;&#12290;&#23558;&#40657;&#23458;&#39532;&#25289;&#26494;&#32435;&#20837;&#35745;&#31639;&#26426;&#31185;&#23398;&#21644;&#36719;&#20214;&#24037;&#31243;&#35838;&#31243;&#30340;&#25972;&#21512;&#26088;&#22312;&#22312;&#21512;&#20316;&#30340;&#29615;&#22659;&#20013;&#23545;&#40784;&#25945;&#32946;&#33021;&#21147;&#65292;&#36890;&#36807;&#20135;&#23398;&#21512;&#20316;&#20419;&#36827;&#21516;&#34892;&#20043;&#38388;&#30340;&#36830;&#25509;&#21644;&#20016;&#23500;&#23398;&#20064;&#12290;&#28982;&#32780;&#65292;&#39640;&#32423;&#25216;&#26415;&#65292;&#29305;&#21035;&#26159;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21644;&#26426;&#22120;&#23398;&#20064;&#30340;&#34701;&#21512;&#36827;&#40657;&#23458;&#39532;&#25289;&#26494;&#27491;&#22312;&#25913;&#21464;&#23427;&#20204;&#30340;&#32467;&#26500;&#21644;&#32467;&#26524;&#12290;&#36825;&#31181;&#28436;&#21464;&#24102;&#26469;&#20102;&#26426;&#36935;&#65292;&#22914;&#22686;&#24378;&#30340;&#23398;&#20064;&#20307;&#39564;&#65292;
&lt;/p&gt;
&lt;p&gt;
Hackathons and software competitions, increasingly pivotal in the software industry, serve as vital catalysts for innovation and skill development for both organizations and students. These platforms enable companies to prototype ideas swiftly, while students gain enriched learning experiences, enhancing their practical skills. Over the years, hackathons have transitioned from mere competitive events to significant educational tools, fusing theoretical knowledge with real-world problem-solving. The integration of hackathons into computer science and software engineering curricula aims to align educational proficiencies within a collaborative context, promoting peer connectivity and enriched learning via industry-academia collaborations. However, the infusion of advanced technologies, notably artificial intelligence (AI), and machine learning, into hackathons is revolutionizing their structure and outcomes. This evolution brings forth both opportunities, like enhanced learning experienc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21021;&#27493;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#20116;&#20010;&#20851;&#38190;&#20027;&#39064;&#30340;&#20998;&#26512;&#21644;&#32531;&#35299;&#31574;&#30053;&#26469;&#24314;&#31435;&#31185;&#23398;&#30740;&#31350;&#20013;&#29983;&#25104;AI&#30340;&#20262;&#29702;&#25351;&#21335;&#12290;&#20840;&#29699;&#20849;&#35782;&#12289;&#19987;&#19994;&#22521;&#35757;&#21644;&#21512;&#29702;&#30340;&#25191;&#34892;&#23545;&#20110;&#20419;&#36827;AI&#30340;&#30410;&#22788;&#21644;&#32500;&#25252;&#30740;&#31350;&#35802;&#20449;&#33267;&#20851;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2401.15284</link><description>&lt;p&gt;
&#22312;&#31185;&#23398;&#30740;&#31350;&#20013;&#24314;&#31435;&#29983;&#25104;AI&#30340;&#20262;&#29702;&#25351;&#21335;
&lt;/p&gt;
&lt;p&gt;
Building ethical guidelines for generative AI in scientific research. (arXiv:2401.15284v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21021;&#27493;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#20116;&#20010;&#20851;&#38190;&#20027;&#39064;&#30340;&#20998;&#26512;&#21644;&#32531;&#35299;&#31574;&#30053;&#26469;&#24314;&#31435;&#31185;&#23398;&#30740;&#31350;&#20013;&#29983;&#25104;AI&#30340;&#20262;&#29702;&#25351;&#21335;&#12290;&#20840;&#29699;&#20849;&#35782;&#12289;&#19987;&#19994;&#22521;&#35757;&#21644;&#21512;&#29702;&#30340;&#25191;&#34892;&#23545;&#20110;&#20419;&#36827;AI&#30340;&#30410;&#22788;&#21644;&#32500;&#25252;&#30740;&#31350;&#35802;&#20449;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#24037;&#20855;&#65288;&#22914;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65289;&#27491;&#22312;&#36805;&#36895;&#25913;&#21464;&#23398;&#26415;&#30740;&#31350;&#21644;&#23454;&#38469;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#31185;&#23398;&#20013;&#29983;&#25104;AI&#30340;&#20262;&#29702;&#25351;&#21335;&#30340;&#35752;&#35770;&#20173;&#28982;&#38646;&#25955;&#65292;&#24378;&#35843;&#20102;&#21327;&#21830;&#19968;&#33268;&#24615;&#26631;&#20934;&#30340;&#32039;&#36843;&#24615;&#12290;&#26412;&#25991;&#36890;&#36807;&#23545;&#20116;&#20010;&#20851;&#38190;&#20027;&#39064;&#30340;&#20998;&#26512;&#21644;&#32531;&#35299;&#31574;&#30053;&#30340;&#24320;&#21457;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#21021;&#27493;&#30340;&#26694;&#26550;&#65306;&#20102;&#35299;&#27169;&#22411;&#22312;&#30495;&#23454;&#24615;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#23616;&#38480;&#24615;&#65307;&#23562;&#37325;&#38544;&#31169;&#12289;&#26426;&#23494;&#21644;&#29256;&#26435;&#65307;&#22312;&#34701;&#20837;&#27169;&#22411;&#36755;&#20986;&#26102;&#36991;&#20813;&#25220;&#34989;&#21644;&#36829;&#21453;&#25919;&#31574;&#65307;&#30830;&#20445;&#24212;&#29992;&#24102;&#26469;&#24635;&#20307;&#21033;&#30410;&#65307;&#20197;&#21450;&#36879;&#26126;&#12289;&#21487;&#22797;&#21046;&#22320;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#12290;&#36890;&#36807;&#21015;&#20030;&#24120;&#35265;&#22330;&#26223;&#26469;&#23637;&#31034;&#28508;&#22312;&#30340;&#20262;&#29702;&#36829;&#35268;&#34892;&#20026;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#20840;&#29699;&#20849;&#35782;&#20197;&#21450;&#19987;&#19994;&#22521;&#35757;&#21644;&#21512;&#29702;&#30340;&#25191;&#34892;&#26159;&#20419;&#36827;AI&#30340;&#30410;&#22788;&#24182;&#32500;&#25252;&#30740;&#31350;&#35802;&#20449;&#30340;&#20851;&#38190;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative artificial intelligence tools like large language models are rapidly transforming academic research and real world applications. However, discussions on ethical guidelines for generative AI in science remain fragmented, underscoring the urgent need for consensus based standards. This paper offers an initial framework by developing analyses and mitigation strategies across five key themes: understanding model limitations regarding truthfulness and bias; respecting privacy, confidentiality, and copyright; avoiding plagiarism and policy violations when incorporating model output; ensuring applications provide overall benefit; and using AI transparently and reproducibly. Common scenarios are outlined to demonstrate potential ethical violations. We argue that global consensus coupled with professional training and reasonable enforcement are critical to promoting the benefits of AI while safeguarding research integrity.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;AI&#20215;&#20540;&#38142;&#30340;&#27010;&#24565;&#65292;&#20197;&#28385;&#36275;AI&#20262;&#29702;&#30740;&#31350;&#21644;&#24178;&#39044;&#30340;&#38656;&#27714;&#12290;&#36890;&#36807;&#32508;&#21512;&#35780;&#20272;AI&#20215;&#20540;&#38142;&#28041;&#21450;&#30340;&#20262;&#29702;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#20010;&#26410;&#26469;&#26041;&#21521;&#65292;&#26088;&#22312;&#25512;&#21160;&#26356;&#20855;&#20262;&#29702;&#30340;AI&#21457;&#23637;&#21644;&#20351;&#29992;&#12290;</title><link>http://arxiv.org/abs/2307.16787</link><description>&lt;p&gt;
AI&#20215;&#20540;&#38142;&#30340;&#20262;&#29702;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
The Ethics of AI Value Chains. (arXiv:2307.16787v2 [cs.CY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.16787
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;AI&#20215;&#20540;&#38142;&#30340;&#27010;&#24565;&#65292;&#20197;&#28385;&#36275;AI&#20262;&#29702;&#30740;&#31350;&#21644;&#24178;&#39044;&#30340;&#38656;&#27714;&#12290;&#36890;&#36807;&#32508;&#21512;&#35780;&#20272;AI&#20215;&#20540;&#38142;&#28041;&#21450;&#30340;&#20262;&#29702;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#20010;&#26410;&#26469;&#26041;&#21521;&#65292;&#26088;&#22312;&#25512;&#21160;&#26356;&#20855;&#20262;&#29702;&#30340;AI&#21457;&#23637;&#21644;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#23545;&#20154;&#24037;&#26234;&#33021;&#20262;&#29702;&#24863;&#20852;&#36259;&#30340;&#30740;&#31350;&#20154;&#21592;&#12289;&#20174;&#19994;&#20154;&#21592;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#65292;&#20182;&#20204;&#38656;&#35201;&#26356;&#22810;&#32508;&#21512;&#30340;&#26041;&#27861;&#26469;&#30740;&#31350;&#21644;&#24178;&#39044;&#22312;&#22810;&#31181;&#32972;&#26223;&#21644;&#27963;&#21160;&#35268;&#27169;&#19979;&#30340;AI&#31995;&#32479;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;AI&#20215;&#20540;&#38142;&#20316;&#20026;&#19968;&#20010;&#28385;&#36275;&#36825;&#19968;&#38656;&#27714;&#30340;&#32508;&#21512;&#27010;&#24565;&#12290;&#20026;&#20102;&#26356;&#28165;&#26224;&#22320;&#29702;&#35770;&#21270;AI&#20215;&#20540;&#38142;&#65292;&#24182;&#22312;&#27010;&#24565;&#19978;&#23558;&#20854;&#19982;&#20379;&#24212;&#38142;&#21306;&#20998;&#24320;&#26469;&#65292;&#25105;&#20204;&#22238;&#39038;&#20102;&#25112;&#30053;&#31649;&#29702;&#12289;&#26381;&#21153;&#31185;&#23398;&#12289;&#32463;&#27982;&#22320;&#29702;&#23398;&#12289;&#34892;&#19994;&#12289;&#25919;&#24220;&#21644;&#24212;&#29992;&#30740;&#31350;&#25991;&#29486;&#20013;&#20851;&#20110;&#20215;&#20540;&#38142;&#21644;AI&#20215;&#20540;&#38142;&#30340;&#29702;&#35770;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23545;&#28085;&#30422;AI&#20215;&#20540;&#38142;&#28041;&#21450;&#30340;&#20262;&#29702;&#38382;&#39064;&#30340;67&#20010;&#26469;&#28304;&#36827;&#34892;&#32508;&#21512;&#35780;&#20272;&#12290;&#26681;&#25454;&#25105;&#20204;&#32508;&#21512;&#35780;&#20272;&#30340;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#20010;&#26410;&#26469;&#26041;&#21521;&#65292;&#30740;&#31350;&#20154;&#21592;&#12289;&#20174;&#19994;&#20154;&#21592;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#21487;&#20197;&#37319;&#21462;&#36825;&#20123;&#26041;&#21521;&#26469;&#25512;&#21160;&#22312;AI&#20215;&#20540;&#38142;&#19978;&#23454;&#29616;&#26356;&#20855;&#20262;&#29702;&#30340;&#21457;&#23637;&#21644;&#20351;&#29992;&#12290;&#25105;&#20204;&#30340;&#32508;&#36848;&#21644;&#24314;&#35758;&#26377;&#21161;&#20110;&#25512;&#36827;&#30740;&#31350;&#35758;&#31243;&#30340;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
Researchers, practitioners, and policymakers with an interest in AI ethics need more integrative approaches for studying and intervening in AI systems across many contexts and scales of activity. This paper presents AI value chains as an integrative concept that satisfies that need. To more clearly theorize AI value chains and conceptually distinguish them from supply chains, we review theories of value chains and AI value chains from the strategic management, service science, economic geography, industry, government, and applied research literature. We then conduct an integrative review of a sample of 67 sources that cover the ethical concerns implicated in AI value chains. Building upon the findings of our integrative review, we recommend four future directions that researchers, practitioners, and policymakers can take to advance more ethical practices of AI development and use across AI value chains. Our review and recommendations contribute to the advancement of research agendas, i
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#21019;&#36896;&#24615;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#19982;&#20043;&#30456;&#20851;&#30340;&#26426;&#22120;&#21019;&#36896;&#24615;&#30340;&#38590;&#28857;&#21644;&#26131;&#28857;&#65292;&#24182;&#37325;&#28857;&#20998;&#26512;&#20102;&#36825;&#20123;&#25216;&#26415;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.00008</link><description>&lt;p&gt;
&#20851;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#21019;&#36896;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Creativity of Large Language Models. (arXiv:2304.00008v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00008
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#21019;&#36896;&#24615;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#19982;&#20043;&#30456;&#20851;&#30340;&#26426;&#22120;&#21019;&#36896;&#24615;&#30340;&#38590;&#28857;&#21644;&#26131;&#28857;&#65292;&#24182;&#37325;&#28857;&#20998;&#26512;&#20102;&#36825;&#20123;&#25216;&#26415;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;(LLMs)&#27491;&#22312;&#39072;&#35206;&#20154;&#24037;&#26234;&#33021;&#30340;&#22810;&#20010;&#39046;&#22495;&#12290;&#20854;&#20013;&#26368;&#26174;&#33879;&#30340;&#24212;&#29992;&#20043;&#19968;&#26159;&#21019;&#20316;&#65292;&#20363;&#22914;&#35799;&#27468;&#25110;&#25925;&#20107;&#65306;&#29983;&#25104;&#30340;&#36755;&#20986;&#36890;&#24120;&#20855;&#26377;&#24778;&#20154;&#30340;&#36136;&#37327;&#12290;&#20294;&#26159;&#65292;&#19968;&#20010;&#33258;&#28982;&#30340;&#38382;&#39064;&#26159;&#65306;LLMs&#30495;&#30340;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#21019;&#36896;&#24615;&#30340;&#21527;&#65311;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#21019;&#36896;&#24615;&#29702;&#35770;&#30340;&#35282;&#24230;&#20998;&#26512;&#20102;LLMs&#30340;&#21457;&#23637;&#65292;&#25506;&#35752;&#20102;&#20851;&#38190;&#30340;&#26410;&#35299;&#20915;&#38382;&#39064;&#21644;&#25361;&#25112;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#22312;&#19982;LLMs&#30456;&#20851;&#30340;&#26426;&#22120;&#21019;&#36896;&#24615;&#26041;&#38754;&#30830;&#23450;&#20102;&#19968;&#32452;&#8220;&#26131;&#8221;&#21644;&#8220;&#38590;&#8221;&#38382;&#39064;&#65292;&#24182;&#23545;&#20854;&#36827;&#34892;&#20102;&#35752;&#35770;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#36825;&#20123;&#25216;&#26415;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large Language Models (LLMs) are revolutionizing several areas of Artificial Intelligence. One of the most remarkable applications is creative writing, e.g., poetry or storytelling: the generated outputs are often of astonishing quality. However, a natural question arise: can LLMs really be considered creative? In this article we firstly analyze the development of LLMs under the lens of creativity theories, investigating the key open questions and challenges. Then, we identify a set of "easy" and "hard" problems in machine creativity, discussing them in relation to LLMs. Finally, we analyze the societal impact of these technologies with a particular focus on the creative industries.
&lt;/p&gt;</description></item></channel></rss>