<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#25991;&#23545;&#22270;&#28789;&#30340;&#32654;&#20029;&#30340;&#24605;&#32500;&#23454;&#39564;&#36827;&#34892;&#20102;&#21382;&#21490;&#37325;&#24314;&#65292;&#25552;&#20379;&#20102;&#22823;&#37327;&#35777;&#25454;&#21644;&#19968;&#20123;&#21407;&#21019;&#31572;&#26696;&#65292;&#21516;&#26102;&#22238;&#31572;&#20102;&#22270;&#28789;&#27979;&#35797;&#30340;&#26680;&#24515;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.00009</link><description>&lt;p&gt;
&#22270;&#28789;&#27979;&#35797;&#65292;&#19968;&#20010;&#32654;&#20029;&#30340;&#24605;&#32500;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Turing's Test, a Beautiful Thought Experiment. (arXiv:2401.00009v2 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.00009
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#22270;&#28789;&#30340;&#32654;&#20029;&#30340;&#24605;&#32500;&#23454;&#39564;&#36827;&#34892;&#20102;&#21382;&#21490;&#37325;&#24314;&#65292;&#25552;&#20379;&#20102;&#22823;&#37327;&#35777;&#25454;&#21644;&#19968;&#20123;&#21407;&#21019;&#31572;&#26696;&#65292;&#21516;&#26102;&#22238;&#31572;&#20102;&#22270;&#28789;&#27979;&#35797;&#30340;&#26680;&#24515;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#30340;&#28010;&#28526;&#20013;&#65292;&#20851;&#20110;&#22270;&#28789;&#27979;&#35797;&#21450;&#20854;&#23545;&#20154;&#24037;&#26234;&#33021;&#30340;&#20215;&#20540;&#30340;&#20105;&#35770;&#21644;&#38382;&#39064;&#37325;&#26032;&#20852;&#36215;&#65292;&#24182;&#24341;&#21457;&#20102;&#25968;&#21313;&#24180;&#26469;&#23454;&#38469;&#30340;&#8220;&#22270;&#28789;&#8221;&#27979;&#35797;&#12290;&#22914;&#26524;&#20154;&#24037;&#26234;&#33021;&#26159;&#37327;&#23376;&#29289;&#29702;&#23398;&#65292;&#29616;&#22312;&#21487;&#33021;&#24050;&#26377;&#20960;&#21482;&#8220;&#34203;&#23450;&#35860;&#30340;&#8221;&#29483;&#34987;&#26432;&#27515;&#20102;&#12290;&#36831;&#21040;&#24635;&#27604;&#19981;&#21040;&#22909;&#65292;&#29616;&#22312;&#26159;&#23545;&#22270;&#28789;&#32654;&#20029;&#30340;&#24605;&#32500;&#23454;&#39564;&#36827;&#34892;&#21382;&#21490;&#37325;&#24314;&#30340;&#26102;&#20505;&#20102;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#25552;&#20379;&#20102;&#22823;&#37327;&#35777;&#25454;&#65292;&#21253;&#25324;&#26032;&#30340;&#26723;&#26696;&#26469;&#28304;&#65292;&#38024;&#23545;&#22270;&#28789;1950&#24180;&#35770;&#25991;&#30340;&#20960;&#20010;&#26410;&#35299;&#20915;&#38382;&#39064;&#32473;&#20986;&#20102;&#21407;&#21019;&#31572;&#26696;&#65292;&#24182;&#22238;&#31572;&#20102;&#22270;&#28789;&#27979;&#35797;&#30340;&#26680;&#24515;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the wake of large language models, there has been a resurgence of claims and questions about the Turing test and its value for AI, which are reminiscent of decades of practical "Turing" tests. If AI were quantum physics, by now several "Schr\"odinger's" cats could have been killed. Better late than never, it is time for a historical reconstruction of Turing's beautiful thought experiment. In this paper I present a wealth of evidence, including new archival sources, give original answers to several open questions about Turing's 1950 paper, and address the core question of the value of Turing's test.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#28040;&#36153;&#32773;&#30340;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#21382;&#21490;&#26159;&#30740;&#31350;&#20998;&#20139;&#34394;&#20551;&#26032;&#38395;&#21160;&#26426;&#30340;&#19968;&#31181;&#34987;&#20302;&#20272;&#30340;&#25968;&#25454;&#26469;&#28304;&#12290;&#36890;&#36807;&#23545;&#24086;&#23376;&#21382;&#21490;&#25552;&#21462;&#30340;&#25991;&#26412;&#32447;&#32034;&#65292;&#25105;&#20204;&#21457;&#29616;&#34394;&#20551;&#26032;&#38395;&#20998;&#20139;&#32773;&#22312;&#35328;&#36766;&#19978;&#26356;&#22810;&#28041;&#21450;&#24868;&#24594;&#12289;&#23447;&#25945;&#21644;&#26435;&#21147;&#12290;&#24182;&#19988;&#65292;&#36890;&#36807;&#23558;&#24086;&#23376;&#21382;&#21490;&#20013;&#30340;&#25991;&#26412;&#32447;&#32034;&#21152;&#20837;&#27169;&#22411;&#65292;&#21487;&#20197;&#25552;&#39640;&#39044;&#27979;&#20998;&#20139;&#34394;&#20551;&#26032;&#38395;&#30340;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#28608;&#27963;&#23447;&#25945;&#20215;&#20540;&#35266;&#21644;&#20943;&#23569;&#24868;&#24594;&#65292;&#21487;&#20197;&#20943;&#23569;&#34394;&#20551;&#26032;&#38395;&#30340;&#20998;&#20139;&#21644;&#26356;&#24191;&#27867;&#30340;&#20998;&#20139;&#12290;</title><link>http://arxiv.org/abs/2203.10560</link><description>&lt;p&gt;
&#25552;&#21319;&#34394;&#20551;&#26032;&#38395;&#32531;&#35299;&#65306;&#26469;&#33258;&#20998;&#20139;&#32773;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#21382;&#21490;&#30340;&#27934;&#23519;&#21147;
&lt;/p&gt;
&lt;p&gt;
Empowering Fake-News Mitigation: Insights from Sharers' Social Media Post-Histories. (arXiv:2203.10560v2 [cs.CY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.10560
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#28040;&#36153;&#32773;&#30340;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#21382;&#21490;&#26159;&#30740;&#31350;&#20998;&#20139;&#34394;&#20551;&#26032;&#38395;&#21160;&#26426;&#30340;&#19968;&#31181;&#34987;&#20302;&#20272;&#30340;&#25968;&#25454;&#26469;&#28304;&#12290;&#36890;&#36807;&#23545;&#24086;&#23376;&#21382;&#21490;&#25552;&#21462;&#30340;&#25991;&#26412;&#32447;&#32034;&#65292;&#25105;&#20204;&#21457;&#29616;&#34394;&#20551;&#26032;&#38395;&#20998;&#20139;&#32773;&#22312;&#35328;&#36766;&#19978;&#26356;&#22810;&#28041;&#21450;&#24868;&#24594;&#12289;&#23447;&#25945;&#21644;&#26435;&#21147;&#12290;&#24182;&#19988;&#65292;&#36890;&#36807;&#23558;&#24086;&#23376;&#21382;&#21490;&#20013;&#30340;&#25991;&#26412;&#32447;&#32034;&#21152;&#20837;&#27169;&#22411;&#65292;&#21487;&#20197;&#25552;&#39640;&#39044;&#27979;&#20998;&#20139;&#34394;&#20551;&#26032;&#38395;&#30340;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#28608;&#27963;&#23447;&#25945;&#20215;&#20540;&#35266;&#21644;&#20943;&#23569;&#24868;&#24594;&#65292;&#21487;&#20197;&#20943;&#23569;&#34394;&#20551;&#26032;&#38395;&#30340;&#20998;&#20139;&#21644;&#26356;&#24191;&#27867;&#30340;&#20998;&#20139;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34394;&#20551;&#20449;&#24687;&#26159;&#19968;&#20010;&#20840;&#29699;&#24615;&#38382;&#39064;&#65292;&#38480;&#21046;&#20854;&#20256;&#25773;&#23545;&#20445;&#25252;&#27665;&#20027;&#12289;&#20844;&#20849;&#21355;&#29983;&#21644;&#28040;&#36153;&#32773;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#35748;&#20026;&#28040;&#36153;&#32773;&#33258;&#24049;&#30340;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#21382;&#21490;&#26159;&#19968;&#20010;&#34987;&#20302;&#20272;&#30340;&#25968;&#25454;&#26469;&#28304;&#65292;&#29992;&#20110;&#30740;&#31350;&#26159;&#20160;&#20040;&#23548;&#33268;&#20182;&#20204;&#20998;&#20139;&#34394;&#20551;&#26032;&#38395;&#38142;&#25509;&#12290;&#22312;&#31532;&#19968;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#20174;&#24086;&#23376;&#21382;&#21490;&#20013;&#25552;&#21462;&#30340;&#25991;&#26412;&#32447;&#32034;&#22914;&#20309;&#21306;&#20998;&#34394;&#20551;&#26032;&#38395;&#30340;&#20998;&#20139;&#32773;&#21644;&#38543;&#26426;&#31038;&#20132;&#23186;&#20307;&#29992;&#25143;&#20197;&#21450;&#20854;&#20182;&#22312;&#35823;&#23548;&#20449;&#24687;&#29983;&#24577;&#31995;&#32479;&#20013;&#30340;&#20154;&#12290;&#22312;&#20004;&#20010;&#25968;&#25454;&#38598;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#34394;&#20551;&#26032;&#38395;&#30340;&#20998;&#20139;&#32773;&#20351;&#29992;&#26356;&#22810;&#19982;&#24868;&#24594;&#12289;&#23447;&#25945;&#21644;&#26435;&#21147;&#30456;&#20851;&#30340;&#35789;&#27719;&#12290;&#22312;&#31532;&#20108;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20174;&#24086;&#23376;&#21382;&#21490;&#20013;&#28155;&#21152;&#25991;&#26412;&#32447;&#32034;&#22914;&#20309;&#25552;&#39640;&#27169;&#22411;&#39044;&#27979;&#35841;&#26377;&#21487;&#33021;&#20998;&#20139;&#34394;&#20551;&#26032;&#38395;&#30340;&#20934;&#30830;&#24615;&#12290;&#22312;&#31532;&#19977;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23545;&#20174;&#31532;&#19968;&#39033;&#30740;&#31350;&#20013;&#25512;&#23548;&#20986;&#30340;&#20004;&#31181;&#32531;&#35299;&#31574;&#30053;&#36827;&#34892;&#20102;&#21021;&#27493;&#27979;&#35797;&#65292;&#21363;&#28608;&#27963;&#23447;&#25945;&#20215;&#20540;&#35266;&#21644;&#20943;&#23569;&#24868;&#24594;&#65292;&#21457;&#29616;&#23427;&#20204;&#21487;&#20197;&#20943;&#23569;&#34394;&#20551;&#26032;&#38395;&#30340;&#20998;&#20139;&#21644;&#26356;&#24191;&#27867;&#30340;&#20998;&#20139;&#12290;&#22312;&#31532;&#22235;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23558;&#35843;&#26597;&#32467;&#26524;&#19982;&#29992;&#25143;&#30340;&#39564;&#35777;&#25512;&#29305;&#32080;&#21512;&#22312;&#19968;&#36215;&#12290;
&lt;/p&gt;
&lt;p&gt;
Misinformation is a global concern and limiting its spread is critical for protecting democracy, public health, and consumers. We propose that consumers' own social media post-histories are an underutilized data source to study what leads them to share links to fake-news. In Study 1, we explore how textual cues extracted from post-histories distinguish fake-news sharers from random social media users and others in the misinformation ecosystem. Among other results, we find across two datasets that fake-news sharers use more words related to anger, religion and power. In Study 2, we show that adding textual cues from post-histories improves the accuracy of models to predict who is likely to share fake-news. In Study 3, we provide a preliminary test of two mitigation strategies deduced from Study 1 - activating religious values and reducing anger - and find that they reduce fake-news sharing and sharing more generally. In Study 4, we combine survey responses with users' verified Twitter p
&lt;/p&gt;</description></item></channel></rss>