<rss version="2.0"><channel><title>Chat Arxiv cs.CG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CG</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#25289;&#29305;&#24449;&#25216;&#26415;&#22312;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#65292;&#21033;&#29992;&#28857;&#36816;&#31639;&#27431;&#25289;&#29305;&#24449;&#24471;&#21040;&#27431;&#25289;&#29305;&#24449;&#36718;&#24275;&#65292;&#22312;&#30417;&#30563;&#21644;&#26080;&#30417;&#30563;&#20219;&#21153;&#20013;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#27431;&#25289;&#36718;&#24275;&#21450;&#20854;&#28151;&#21512;&#21464;&#25442;&#25429;&#25417;&#20449;&#24687;&#30340;&#21551;&#21457;&#24335;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2303.14040</link><description>&lt;p&gt;
&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#27431;&#25289;&#29305;&#24449;&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;
Euler Characteristic Tools For Topological Data Analysis. (arXiv:2303.14040v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14040
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#25289;&#29305;&#24449;&#25216;&#26415;&#22312;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#65292;&#21033;&#29992;&#28857;&#36816;&#31639;&#27431;&#25289;&#29305;&#24449;&#24471;&#21040;&#27431;&#25289;&#29305;&#24449;&#36718;&#24275;&#65292;&#22312;&#30417;&#30563;&#21644;&#26080;&#30417;&#30563;&#20219;&#21153;&#20013;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#27431;&#25289;&#36718;&#24275;&#21450;&#20854;&#28151;&#21512;&#21464;&#25442;&#25429;&#25417;&#20449;&#24687;&#30340;&#21551;&#21457;&#24335;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#27431;&#25289;&#29305;&#24449;&#25216;&#26415;&#12290;&#20174;&#25968;&#25454;&#26500;&#24314;&#30340;&#19968;&#26063;&#21333;&#32431;&#22797;&#21512;&#20307;&#30340;&#28857;&#36816;&#31639;&#27431;&#25289;&#29305;&#24449;&#65292;&#24471;&#21040;&#25152;&#35859;&#30340;&#27431;&#25289;&#29305;&#24449;&#36718;&#24275;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#31616;&#21333;&#25551;&#36848;&#31526;&#20197;&#26497;&#20302;&#30340;&#35745;&#31639;&#25104;&#26412;&#22312;&#30417;&#30563;&#20219;&#21153;&#20013;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#24615;&#33021;&#12290;&#21463;&#20449;&#21495;&#20998;&#26512;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#35745;&#31639;&#27431;&#25289;&#29305;&#24449;&#36718;&#24275;&#30340;&#28151;&#21512;&#21464;&#25442;&#12290;&#36825;&#20123;&#31215;&#20998;&#21464;&#25442;&#23558;&#27431;&#25289;&#29305;&#24449;&#25216;&#26415;&#19982;&#21202;&#36125;&#26684;&#31215;&#20998;&#28151;&#21512;&#65292;&#25552;&#20379;&#39640;&#25928;&#21387;&#32553;&#25299;&#25169;&#20449;&#21495;&#12290;&#22240;&#27492;&#65292;&#23427;&#20204;&#22312;&#26080;&#30417;&#30563;&#35774;&#32622;&#20013;&#34920;&#29616;&#20986;&#21331;&#36234;&#30340;&#24615;&#33021;&#12290;&#22312;&#23450;&#24615;&#26041;&#38754;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#27431;&#25289;&#36718;&#24275;&#21450;&#20854;&#28151;&#21512;&#21464;&#25442;&#25152;&#25429;&#25417;&#30340;&#25299;&#25169;&#21644;&#20960;&#20309;&#20449;&#24687;&#30340;&#20247;&#22810;&#21551;&#21457;&#24335;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20123;&#25551;&#36848;&#31526;&#30340;&#31283;&#23450;&#24615;&#32467;&#26524;&#20197;&#21450;&#22312;&#38543;&#26426;&#35774;&#32622;&#19979;&#30340;&#28176;&#36817;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this article, we study Euler characteristic techniques in topological data analysis. Pointwise computing the Euler characteristic of a family of simplicial complexes built from data gives rise to the so-called Euler characteristic profile. We show that this simple descriptor achieve state-of-the-art performance in supervised tasks at a very low computational cost. Inspired by signal analysis, we compute hybrid transforms of Euler characteristic profiles. These integral transforms mix Euler characteristic techniques with Lebesgue integration to provide highly efficient compressors of topological signals. As a consequence, they show remarkable performances in unsupervised settings. On the qualitative side, we provide numerous heuristics on the topological and geometric information captured by Euler profiles and their hybrid transforms. Finally, we prove stability results for these descriptors as well as asymptotic guarantees in random settings.
&lt;/p&gt;</description></item></channel></rss>