<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65292;&#20026;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#21644;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#25552;&#20379;&#25351;&#23548;&#12290;</title><link>https://arxiv.org/abs/2402.07926</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#21019;&#24314;&#32773;&#21040;&#25968;&#25454;&#37325;&#29992;&#32773;&#65306;&#36317;&#31163;&#30340;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;
From Data Creator to Data Reuser: Distance Matters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07926
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65292;&#20026;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#21644;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#25552;&#20379;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#20139;&#30740;&#31350;&#25968;&#25454;&#26159;&#22797;&#26434;&#12289;&#21171;&#21160;&#23494;&#38598;&#12289;&#26114;&#36149;&#30340;&#65292;&#38656;&#35201;&#22810;&#20010;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#22522;&#30784;&#35774;&#26045;&#25237;&#36164;&#12290;&#24320;&#25918;&#31185;&#23398;&#25919;&#31574;&#20391;&#37325;&#20110;&#25968;&#25454;&#21457;&#24067;&#32780;&#19981;&#26159;&#25968;&#25454;&#37325;&#29992;&#65292;&#28982;&#32780;&#37325;&#29992;&#20063;&#26159;&#22256;&#38590;&#12289;&#26114;&#36149;&#30340;&#65292;&#21487;&#33021;&#27704;&#36828;&#19981;&#20250;&#21457;&#29983;&#12290;&#36890;&#36807;&#32771;&#34385;&#35841;&#21487;&#33021;&#37325;&#29992;&#25968;&#25454;&#65292;&#22914;&#20309;&#37325;&#29992;&#25968;&#25454;&#65292;&#20026;&#20309;&#37325;&#29992;&#25968;&#25454;&#65292;&#20197;&#21450;&#20309;&#26102;&#37325;&#29992;&#25968;&#25454;&#31561;&#22240;&#32032;&#65292;&#21487;&#20197;&#26356;&#26126;&#26234;&#22320;&#36827;&#34892;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#12290;&#25968;&#25454;&#21019;&#36896;&#32773;&#26080;&#27861;&#39044;&#35265;&#25152;&#26377;&#21487;&#33021;&#30340;&#37325;&#29992;&#25110;&#37325;&#29992;&#32773;&#65307;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#30830;&#23450;&#21487;&#33021;&#26377;&#21161;&#20110;&#21033;&#30410;&#30456;&#20851;&#32773;&#20915;&#23450;&#22914;&#20309;&#25237;&#36164;&#30740;&#31350;&#25968;&#25454;&#65292;&#22914;&#20309;&#30830;&#23450;&#28508;&#22312;&#30340;&#37325;&#29992;&#21644;&#37325;&#29992;&#32773;&#65292;&#20197;&#21450;&#22914;&#20309;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#30340;&#22240;&#32032;&#12290;&#22522;&#20110;&#25968;&#25454;&#20849;&#20139;&#21644;&#37325;&#29992;&#30340;&#23454;&#35777;&#30740;&#31350;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65306;&#39046;&#22495;&#12289;&#26041;&#27861;&#12289;&#21512;&#20316;&#12289;&#31574;&#21010;&#12289;&#30446;&#30340;&#21644;&#26102;&#38388;&#24615;&#12290;&#36825;&#20123;&#32500;&#24230;&#20027;&#35201;&#26159;
&lt;/p&gt;
&lt;p&gt;
Sharing research data is complex, labor-intensive, expensive, and requires infrastructure investments by multiple stakeholders. Open science policies focus on data release rather than on data reuse, yet reuse is also difficult, expensive, and may never occur. Investments in data management could be made more wisely by considering who might reuse data, how, why, for what purposes, and when. Data creators cannot anticipate all possible reuses or reusers; our goal is to identify factors that may aid stakeholders in deciding how to invest in research data, how to identify potential reuses and reusers, and how to improve data exchange processes. Drawing upon empirical studies of data sharing and reuse, we develop the theoretical construct of distance between data creator and data reuser, identifying six distance dimensions that influence the ability to transfer knowledge effectively: domain, methods, collaboration, curation, purposes, and time and temporality. These dimensions are primarily
&lt;/p&gt;</description></item><item><title>DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#23545;&#27431;&#30431;&#20843;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#21069;100&#22825;&#25552;&#20132;&#30340;&#23457;&#26680;&#34892;&#21160;&#25968;&#25454;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#36825;&#20123;&#24179;&#21488;&#22312;&#23457;&#26680;&#34892;&#21160;&#26041;&#38754;&#30340;&#37096;&#20998;&#36981;&#24490;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2312.10269</link><description>&lt;p&gt;
DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#65306;&#31038;&#20132;&#23186;&#20307;&#33258;&#25105;&#25253;&#21578;&#30340;&#23457;&#26680;&#34892;&#21160;
&lt;/p&gt;
&lt;p&gt;
The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media. (arXiv:2312.10269v2 [cs.SI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.10269
&lt;/p&gt;
&lt;p&gt;
DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#23545;&#27431;&#30431;&#20843;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#21069;100&#22825;&#25552;&#20132;&#30340;&#23457;&#26680;&#34892;&#21160;&#25968;&#25454;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#36825;&#20123;&#24179;&#21488;&#22312;&#23457;&#26680;&#34892;&#21160;&#26041;&#38754;&#30340;&#37096;&#20998;&#36981;&#24490;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;2023&#24180;9&#26376;&#24320;&#22987;&#65292;&#25968;&#23383;&#26381;&#21153;&#27861;&#26696;(DSA)&#35201;&#27714;&#22823;&#22411;&#22312;&#32447;&#24179;&#21488;&#21521;DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#25552;&#20132;&#20851;&#20110;&#20182;&#20204;&#22312;&#27431;&#30431;&#20869;&#37319;&#21462;&#30340;&#27599;&#20010;&#23457;&#26680;&#34892;&#21160;&#30340;&#35814;&#32454;&#25968;&#25454;&#12290;&#20174;&#19968;&#24320;&#22987;&#65292;&#36825;&#20010;&#38598;&#20013;&#24335;&#25968;&#25454;&#24211;&#23601;&#24341;&#36215;&#20102;&#23398;&#26415;&#30028;&#30340;&#20852;&#36259;&#65292;&#22240;&#20026;&#23427;&#26159;&#29616;&#23454;&#19990;&#30028;&#22312;&#32447;&#23457;&#26680;&#25968;&#25454;&#30340;&#19968;&#20010;&#21069;&#25152;&#26410;&#26377;&#30340;&#12289;&#21487;&#33021;&#26159;&#29420;&#29305;&#30340;&#23453;&#24211;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#28145;&#20837;&#20998;&#26512;&#20102;&#27431;&#30431;&#20843;&#20010;&#26368;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#25968;&#25454;&#24211;&#30340;&#21069;100&#22825;&#25552;&#20132;&#30340;&#25152;&#26377;3.53&#20159;&#26465;&#35760;&#24405;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23545;&#24179;&#21488;&#20043;&#38388;&#36827;&#34892;&#20102;&#27604;&#36739;&#30740;&#31350;&#65292;&#21253;&#25324;&#65306;&#23457;&#26680;&#34892;&#21160;&#30340;&#25968;&#37327;&#12289;&#20915;&#31574;&#20381;&#25454;&#12289;&#24212;&#29992;&#30340;&#38480;&#21046;&#31867;&#22411;&#12289;&#23457;&#26680;&#20869;&#23481;&#31867;&#22411;&#12289;&#23457;&#26680;&#34892;&#21160;&#30340;&#21450;&#26102;&#24615;&#21644;&#25552;&#20132;&#24773;&#20917;&#65292;&#20197;&#21450;&#20351;&#29992;&#30340;&#33258;&#21160;&#21270;&#31243;&#24230;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#31995;&#32479;&#22320;&#19982;&#24179;&#21488;&#33258;&#24049;&#30340;&#36879;&#26126;&#25253;&#21578;&#36827;&#34892;&#20102;&#20869;&#23481;&#20132;&#21449;&#26816;&#26597;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20197;&#19979;&#32467;&#26524;&#12290;(i)&#24179;&#21488;&#21482;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#36981;&#24490;&#20102;&#23457;&#26680;&#34892;&#21160;&#30340;&#21746;&#23398;&#21644;&#26041;&#27861;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since September 2023, the Digital Services Act (DSA) obliges large online platforms to submit detailed data on each moderation action they take within the European Union (EU) to the DSA Transparency Database. From its inception, this centralized database has sparked scholarly interest as an unprecedented and potentially unique trove of data on real-world online moderation. Here, we thoroughly analyze all 353.12M records submitted by the eight largest social media platforms in the EU during the first 100 days of the database. Specifically, we conduct a platform-wise comparative study of their: volume of moderation actions, grounds for decision, types of applied restrictions, types of moderated content, timeliness in undertaking and submitting moderation actions, and use of automation. Furthermore, we systematically cross-check the contents of the database with the platforms' own transparency reports. Our analyses reveal that (i) the platforms adhered only in part to the philosophy and s
&lt;/p&gt;</description></item></channel></rss>