<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#30740;&#31350;&#26088;&#22312;&#35843;&#26597;&#19981;&#23433;&#20840;&#29992;&#25143;&#29983;&#25104;&#20869;&#23481;&#28216;&#25103;&#20013;&#30340;&#36829;&#27861;&#25512;&#24191;&#23041;&#32961;&#65292;&#25910;&#38598;&#20102;&#19968;&#32452;&#21253;&#21547;&#24615;&#26292;&#21147;&#21644;&#26292;&#21147;&#20869;&#23481;&#30340;&#30495;&#23454;&#22270;&#20687;&#25968;&#25454;&#38598;&#12290;</title><link>https://arxiv.org/abs/2403.18957</link><description>&lt;p&gt;
&#21033;&#29992;&#22823;&#35268;&#27169;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#35843;&#33410;&#19981;&#23433;&#20840;&#29992;&#25143;&#29983;&#25104;&#20869;&#23481;&#28216;&#25103;&#20013;&#30340;&#36829;&#27861;&#22312;&#32447;&#22270;&#29255;&#25512;&#24191;
&lt;/p&gt;
&lt;p&gt;
Moderating Illicit Online Image Promotion for Unsafe User-Generated Content Games Using Large Vision-Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18957
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26088;&#22312;&#35843;&#26597;&#19981;&#23433;&#20840;&#29992;&#25143;&#29983;&#25104;&#20869;&#23481;&#28216;&#25103;&#20013;&#30340;&#36829;&#27861;&#25512;&#24191;&#23041;&#32961;&#65292;&#25910;&#38598;&#20102;&#19968;&#32452;&#21253;&#21547;&#24615;&#26292;&#21147;&#21644;&#26292;&#21147;&#20869;&#23481;&#30340;&#30495;&#23454;&#22270;&#20687;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#29992;&#25143;&#29983;&#25104;&#20869;&#23481;&#28216;&#25103;&#65288;UGCGs&#65289;&#22312;&#20799;&#31461;&#21644;&#38738;&#23569;&#24180;&#20013;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#65292;&#29992;&#20110;&#31038;&#20132;&#20114;&#21160;&#21644;&#26356;&#26377;&#21019;&#24847;&#30340;&#22312;&#32447;&#23089;&#20048;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#23384;&#22312;&#30528;&#26356;&#39640;&#30340;&#26292;&#38706;&#19981;&#33391;&#20869;&#23481;&#30340;&#39118;&#38505;&#65292;&#24341;&#21457;&#20102;&#20154;&#20204;&#23545;&#20799;&#31461;&#21644;&#38738;&#23569;&#24180;&#22312;&#32447;&#23433;&#20840;&#30340;&#26085;&#30410;&#20851;&#27880;&#12290;&#25105;&#20204;&#37319;&#21462;&#20102;&#31532;&#19968;&#27493;&#30740;&#31350;&#23545;&#19981;&#23433;&#20840;UGCGs&#30340;&#36829;&#27861;&#25512;&#24191;&#36827;&#34892;&#23041;&#32961;&#24615;&#20998;&#26512;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;&#19968;&#32452;&#29616;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;2,924&#24352;&#23637;&#31034;&#19981;&#21516;&#24615;&#26292;&#21147;&#21644;&#26292;&#21147;&#20869;&#23481;&#30340;&#22270;&#20687;&#65292;&#36825;&#20123;&#20869;&#23481;&#34987;&#28216;&#25103;&#21019;&#24314;&#32773;&#29992;&#20110;&#25512;&#24191;UGCGs&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18957v1 Announce Type: cross  Abstract: Online user-generated content games (UGCGs) are increasingly popular among children and adolescents for social interaction and more creative online entertainment. However, they pose a heightened risk of exposure to explicit content, raising growing concerns for the online safety of children and adolescents. Despite these concerns, few studies have addressed the issue of illicit image-based promotions of unsafe UGCGs on social media, which can inadvertently attract young users. This challenge arises from the difficulty of obtaining comprehensive training data for UGCG images and the unique nature of these images, which differ from traditional unsafe content. In this work, we take the first step towards studying the threat of illicit promotions of unsafe UGCGs. We collect a real-world dataset comprising 2,924 images that display diverse sexually explicit and violent content used to promote UGCGs by their game creators. Our in-depth studi
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#31639;&#27861;&#20934;&#30830;&#24615;&#20316;&#20026;&#22312;&#20020;&#24202;&#35797;&#39564;&#20013;&#37096;&#32626;&#22312;&#32447;RL&#31639;&#27861;&#30340;&#20851;&#38190;&#35201;&#27714;&#65292;&#24378;&#35843;&#20102;&#23545;&#21442;&#19982;&#32773;&#20445;&#25252;&#21644;&#25968;&#25454;&#31185;&#23398;&#25928;&#29992;&#30340;&#20445;&#30041;&#36131;&#20219;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#36827;&#34892;&#39044;&#37096;&#32626;&#35268;&#21010;&#21644;&#23454;&#26102;&#30417;&#27979;&#20197;&#30830;&#20445;&#31639;&#27861;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.17003</link><description>&lt;p&gt;
&#22312;&#20020;&#24202;&#35797;&#39564;&#20013;&#30417;&#27979;&#22312;&#32447;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#30340;&#20934;&#30830;&#24615;
&lt;/p&gt;
&lt;p&gt;
Monitoring Fidelity of Online Reinforcement Learning Algorithms in Clinical Trials
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17003
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#31639;&#27861;&#20934;&#30830;&#24615;&#20316;&#20026;&#22312;&#20020;&#24202;&#35797;&#39564;&#20013;&#37096;&#32626;&#22312;&#32447;RL&#31639;&#27861;&#30340;&#20851;&#38190;&#35201;&#27714;&#65292;&#24378;&#35843;&#20102;&#23545;&#21442;&#19982;&#32773;&#20445;&#25252;&#21644;&#25968;&#25454;&#31185;&#23398;&#25928;&#29992;&#30340;&#20445;&#30041;&#36131;&#20219;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#36827;&#34892;&#39044;&#37096;&#32626;&#35268;&#21010;&#21644;&#23454;&#26102;&#30417;&#27979;&#20197;&#30830;&#20445;&#31639;&#27861;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#31639;&#27861;&#20026;&#20010;&#24615;&#21270;&#20020;&#24202;&#35797;&#39564;&#20013;&#21442;&#19982;&#32773;&#30340;&#27835;&#30103;&#25552;&#20379;&#20102;&#24040;&#22823;&#28508;&#21147;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#39118;&#38505;&#21307;&#30103;&#39046;&#22495;&#37096;&#32626;&#22312;&#32447;&#33258;&#20027;&#31639;&#27861;&#20351;&#24471;&#36136;&#37327;&#25511;&#21046;&#21644;&#25968;&#25454;&#36136;&#37327;&#29305;&#21035;&#38590;&#20197;&#23454;&#29616;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#20316;&#20026;&#22312;&#20020;&#24202;&#35797;&#39564;&#20013;&#37096;&#32626;&#22312;&#32447;RL&#31639;&#27861;&#30340;&#20851;&#38190;&#35201;&#27714;&#30340;&#31639;&#27861;&#20934;&#30830;&#24615;&#12290;&#23427;&#24378;&#35843;&#20102;&#31639;&#27861;&#23545;&#65288;1&#65289;&#20445;&#25252;&#21442;&#19982;&#32773;&#21644;&#65288;2&#65289;&#20445;&#30041;&#25968;&#25454;&#22312;&#35797;&#39564;&#21518;&#20998;&#26512;&#20013;&#30340;&#31185;&#23398;&#25928;&#29992;&#30340;&#36131;&#20219;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#37096;&#32626;&#21069;&#35268;&#21010;&#21644;&#23454;&#26102;&#30417;&#27979;&#30340;&#26694;&#26550;&#65292;&#20197;&#21327;&#21161;&#31639;&#27861;&#24320;&#21457;&#32773;&#21644;&#20020;&#24202;&#30740;&#31350;&#20154;&#21592;&#30830;&#20445;&#31639;&#27861;&#30340;&#20934;&#30830;&#24615;&#12290;&#20026;&#20102;&#35828;&#26126;&#25105;&#20204;&#26694;&#26550;&#30340;&#23454;&#38469;&#24212;&#29992;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#26469;&#33258;Oralytics&#20020;&#24202;&#35797;&#39564;&#30340;&#30495;&#23454;&#26696;&#20363;&#12290;&#33258;2023&#24180;&#26149;&#23395;&#20197;&#26469;&#65292;&#36825;&#39033;&#35797;&#39564;&#25104;&#21151;&#22320;&#37096;&#32626;&#20102;&#19968;&#31181;&#33258;&#20027;&#30340;&#22312;&#32447;RL&#31639;&#27861;&#26469;&#36827;&#34892;&#20010;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17003v1 Announce Type: cross  Abstract: Online reinforcement learning (RL) algorithms offer great potential for personalizing treatment for participants in clinical trials. However, deploying an online, autonomous algorithm in the high-stakes healthcare setting makes quality control and data quality especially difficult to achieve. This paper proposes algorithm fidelity as a critical requirement for deploying online RL algorithms in clinical trials. It emphasizes the responsibility of the algorithm to (1) safeguard participants and (2) preserve the scientific utility of the data for post-trial analyses. We also present a framework for pre-deployment planning and real-time monitoring to help algorithm developers and clinical researchers ensure algorithm fidelity. To illustrate our framework's practical application, we present real-world examples from the Oralytics clinical trial. Since Spring 2023, this trial successfully deployed an autonomous, online RL algorithm to persona
&lt;/p&gt;</description></item></channel></rss>