<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#22312;&#32416;&#27491;&#20154;&#31867;&#38169;&#35823;&#26041;&#38754;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#65292;&#20294;&#27492;&#20030;&#20063;&#28508;&#22312;&#23548;&#33268;&#24515;&#29702;&#25104;&#26412;&#65292;&#24182;&#24433;&#21709;&#20154;&#30340;&#20915;&#31574;&#12290;&#36890;&#36807;&#30740;&#31350;&#32593;&#29699;&#27604;&#36187;&#20013;&#30340;Hawk-Eye&#23457;&#26597;&#31995;&#32479;&#65292;&#25105;&#20204;&#21457;&#29616;&#24341;&#20837;AI&#30417;&#30563;&#21518;&#65292;&#35009;&#21028;&#21592;&#30340;&#38169;&#35823;&#29575;&#19979;&#38477;&#65292;&#24515;&#29702;&#25104;&#26412;&#23548;&#33268;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#23558;&#29699;&#21028;&#20026;&#36827;&#30028;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#31867;&#22411;&#38169;&#21028;&#30340;&#36716;&#21464;&#12290;</title><link>http://arxiv.org/abs/2401.16754</link><description>&lt;p&gt;
AI&#30417;&#30563;&#21644;&#20154;&#31867;&#38169;&#35823;&#65306;&#26469;&#33258;&#20013;&#24515;&#27861;&#24237;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
AI Oversight and Human Mistakes: Evidence from Centre Court. (arXiv:2401.16754v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16754
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#22312;&#32416;&#27491;&#20154;&#31867;&#38169;&#35823;&#26041;&#38754;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#65292;&#20294;&#27492;&#20030;&#20063;&#28508;&#22312;&#23548;&#33268;&#24515;&#29702;&#25104;&#26412;&#65292;&#24182;&#24433;&#21709;&#20154;&#30340;&#20915;&#31574;&#12290;&#36890;&#36807;&#30740;&#31350;&#32593;&#29699;&#27604;&#36187;&#20013;&#30340;Hawk-Eye&#23457;&#26597;&#31995;&#32479;&#65292;&#25105;&#20204;&#21457;&#29616;&#24341;&#20837;AI&#30417;&#30563;&#21518;&#65292;&#35009;&#21028;&#21592;&#30340;&#38169;&#35823;&#29575;&#19979;&#38477;&#65292;&#24515;&#29702;&#25104;&#26412;&#23548;&#33268;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#23558;&#29699;&#21028;&#20026;&#36827;&#30028;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#31867;&#22411;&#38169;&#21028;&#30340;&#36716;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#19981;&#26029;&#25552;&#21319;&#30340;&#39537;&#21160;&#19979;&#65292;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#31995;&#32479;&#24050;&#32463;&#24320;&#22987;&#22312;&#35768;&#22810;&#22330;&#21512;&#29992;&#20110;&#32416;&#27491;&#20154;&#31867;&#38169;&#35823;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#39318;&#20010;&#23454;&#22320;&#35777;&#25454;&#65292;&#35777;&#26126;&#36825;&#31181;AI&#30417;&#30563;&#20250;&#20135;&#29983;&#24515;&#29702;&#25104;&#26412;&#65292;&#24433;&#21709;&#20154;&#30340;&#20915;&#31574;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;AI&#30417;&#30563;&#21457;&#29983;&#30340;&#26368;&#39640;&#21487;&#35265;&#24615;&#22330;&#26223;&#20043;&#19968;&#65306;&#39030;&#32423;&#32593;&#29699;&#27604;&#36187;&#20013;&#35009;&#21028;&#30340;Hawk-Eye&#23457;&#26597;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24341;&#20837;Hawk-Eye&#23457;&#26597;&#21518;&#65292;&#35009;&#21028;&#30340;&#25972;&#20307;&#38169;&#35823;&#29575;&#38477;&#20302;&#65292;&#31526;&#21512;&#24515;&#29702;&#25104;&#26412;&#34987;AI&#21542;&#23450;&#30340;&#21512;&#29702;&#24573;&#35270;&#29616;&#35937;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#35009;&#21028;&#22686;&#21152;&#20102;&#23545;&#29699;&#20837;&#20869;&#30340;&#21028;&#23450;&#29575;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#20174;II&#31867;&#38169;&#35823;&#65288;&#23558;&#29699;&#21028;&#20026;&#20986;&#30028;&#65292;&#23454;&#38469;&#19978;&#26159;&#36827;&#30028;&#65289;&#21040;I&#31867;&#38169;&#35823;&#65288;&#23558;&#29699;&#21028;&#20026;&#36827;&#30028;&#65292;&#23454;&#38469;&#19978;&#26159;&#20986;&#30028;&#65289;&#30340;&#36716;&#21464;&#12290;&#36890;&#36807;&#23545;&#29702;&#24615;&#19981;&#27880;&#24847;&#30340;&#35009;&#21028;&#27169;&#22411;&#36827;&#34892;&#24515;&#29702;&#25104;&#26412;&#30340;&#32467;&#26500;&#20272;&#35745;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#30001;&#20110;AI&#21542;&#23450;&#30340;&#24515;&#29702;&#25104;&#26412;&#65292;&#35009;&#21028;&#21592;&#38477;&#20302;&#20102;&#38169;&#35823;&#21028;&#23450;&#30340;&#39118;&#38505;&#24182;&#25552;&#39640;&#20102;&#29699;&#20837;&#20869;&#30340;&#21028;&#23450;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Powered by the increasing predictive capabilities of machine learning algorithms, artificial intelligence (AI) systems have begun to be used to overrule human mistakes in many settings. We provide the first field evidence this AI oversight carries psychological costs that can impact human decision-making. We investigate one of the highest visibility settings in which AI oversight has occurred: the Hawk-Eye review of umpires in top tennis tournaments. We find that umpires lowered their overall mistake rate after the introduction of Hawk-Eye review, in line with rational inattention given psychological costs of being overruled by AI. We also find that umpires increased the rate at which they called balls in, which produced a shift from making Type II errors (calling a ball out when in) to Type I errors (calling a ball in when out). We structurally estimate the psychological costs of being overruled by AI using a model of rational inattentive umpires, and our results suggest that because 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#21033;&#29992;&#20998;&#31867;&#22120;&#26469;&#24555;&#36895;&#36873;&#25321;&#26368;&#20339;&#30340;&#30456;&#20851;&#25991;&#26723;&#35821;&#26009;&#24211;&#36827;&#34892;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#25506;&#32034;&#20102;&#36807;&#28388;&#25481;&#19981;&#30456;&#20851;&#30340;&#25512;&#25991;&#30340;&#26041;&#27861;&#65292;&#20197;&#36827;&#34892;&#22312;&#32447;&#28165;&#27905;&#33021;&#28304;&#24773;&#24863;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2305.03092</link><description>&lt;p&gt;
&#21033;&#29992;&#20998;&#31867;&#22120;&#26469;&#31579;&#36873;&#35821;&#26009;&#24211;&#65306;&#20197;&#22312;&#32447;&#28165;&#27905;&#33021;&#28304;&#24773;&#24863;&#20998;&#26512;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Curating corpora with classifiers: A case study of clean energy sentiment online. (arXiv:2305.03092v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03092
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#21033;&#29992;&#20998;&#31867;&#22120;&#26469;&#24555;&#36895;&#36873;&#25321;&#26368;&#20339;&#30340;&#30456;&#20851;&#25991;&#26723;&#35821;&#26009;&#24211;&#36827;&#34892;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#25506;&#32034;&#20102;&#36807;&#28388;&#25481;&#19981;&#30456;&#20851;&#30340;&#25512;&#25991;&#30340;&#26041;&#27861;&#65292;&#20197;&#36827;&#34892;&#22312;&#32447;&#28165;&#27905;&#33021;&#28304;&#24773;&#24863;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31934;&#24515;&#31574;&#21010;&#30340;&#12289;&#22823;&#35268;&#27169;&#30340;&#31038;&#20132;&#23186;&#20307;&#24086;&#23376;&#35821;&#26009;&#24211;&#26159;&#34917;&#20805;&#20256;&#32479;&#35843;&#26597;&#30340;&#26367;&#20195;&#25968;&#25454;&#26469;&#28304;&#65292;&#21487;&#20197;&#25552;&#20379;&#24191;&#27867;&#30340;&#20844;&#20247;&#24847;&#35265;&#12290;&#34429;&#28982;&#35843;&#26597;&#22312;&#25910;&#38598;&#20195;&#34920;&#24615;&#26679;&#26412;&#21644;&#23454;&#29616;&#39640;&#20934;&#30830;&#29575;&#26041;&#38754;&#24456;&#26377;&#25928;&#65292;&#20294;&#36816;&#34892;&#25104;&#26412;&#24456;&#39640;&#65292;&#32780;&#19988;&#20250;&#28382;&#21518;&#20110;&#20844;&#20247;&#24847;&#35265;&#25968;&#22825;&#25110;&#25968;&#21608;&#12290;&#36825;&#20004;&#20010;&#32570;&#28857;&#21487;&#20197;&#36890;&#36807;&#23454;&#26102;&#12289;&#39640;&#23481;&#37327;&#30340;&#25968;&#25454;&#27969;&#21644;&#24555;&#36895;&#30340;&#20998;&#26512;&#31649;&#36947;&#20811;&#26381;&#12290;&#22312;&#32452;&#32455;&#36825;&#26679;&#30340;&#25968;&#25454;&#31649;&#36947;&#26041;&#38754;&#30340;&#19968;&#20010;&#26680;&#24515;&#25361;&#25112;&#26159;&#35774;&#35745;&#19968;&#31181;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#24555;&#36895;&#36873;&#25321;&#26368;&#20339;&#30340;&#30456;&#20851;&#25991;&#26723;&#35821;&#26009;&#24211;&#36827;&#34892;&#20998;&#26512;&#12290;&#20165;&#20165;&#36890;&#36807;&#20851;&#38190;&#35789;&#26597;&#35810;&#24448;&#24448;&#20250;&#21253;&#25324;&#19981;&#30456;&#20851;&#30340;&#25991;&#26723;&#65292;&#32780;&#36825;&#20123;&#25991;&#26723;&#24456;&#38590;&#29992;&#35789;&#34955;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26041;&#27861;&#28040;&#27495;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20351;&#29992;&#39044;&#20808;&#35757;&#32451;&#30340;&#22522;&#20110;&#36716;&#25442;&#22120;&#30340;&#27169;&#22411;&#65292;&#36890;&#36807;&#22312;&#25163;&#21160;&#26631;&#27880;&#30340;&#25512;&#25991;&#19978;&#23545;&#20854;&#36827;&#34892;&#24494;&#35843;&#65292;&#25506;&#32034;&#20102;&#35821;&#26009;&#24211;&#31574;&#21010;&#30340;&#26041;&#27861;&#65292;&#20197;&#36807;&#28388;&#25481;&#19981;&#30456;&#20851;&#30340;&#25512;&#25991;&#12290;&#25105;&#20204;&#33021;&#22815;&#23454;&#29616;&#39640;&#36798;0.8&#20197;&#19978;&#30340;F1&#24471;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
Well curated, large-scale corpora of social media posts containing broad public opinion offer an alternative data source to complement traditional surveys. While surveys are effective at collecting representative samples and are capable of achieving high accuracy, they can be both expensive to run and lag public opinion by days or weeks. Both of these drawbacks could be overcome with a real-time, high volume data stream and fast analysis pipeline. A central challenge in orchestrating such a data pipeline is devising an effective method for rapidly selecting the best corpus of relevant documents for analysis. Querying with keywords alone often includes irrelevant documents that are not easily disambiguated with bag-of-words natural language processing methods. Here, we explore methods of corpus curation to filter irrelevant tweets using pre-trained transformer-based models, fine-tuned for our binary classification task on hand-labeled tweets. We are able to achieve F1 scores of up to 0.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#21019;&#36896;&#24615;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#19982;&#20043;&#30456;&#20851;&#30340;&#26426;&#22120;&#21019;&#36896;&#24615;&#30340;&#38590;&#28857;&#21644;&#26131;&#28857;&#65292;&#24182;&#37325;&#28857;&#20998;&#26512;&#20102;&#36825;&#20123;&#25216;&#26415;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.00008</link><description>&lt;p&gt;
&#20851;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#21019;&#36896;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Creativity of Large Language Models. (arXiv:2304.00008v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00008
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#21019;&#36896;&#24615;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#19982;&#20043;&#30456;&#20851;&#30340;&#26426;&#22120;&#21019;&#36896;&#24615;&#30340;&#38590;&#28857;&#21644;&#26131;&#28857;&#65292;&#24182;&#37325;&#28857;&#20998;&#26512;&#20102;&#36825;&#20123;&#25216;&#26415;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;(LLMs)&#27491;&#22312;&#39072;&#35206;&#20154;&#24037;&#26234;&#33021;&#30340;&#22810;&#20010;&#39046;&#22495;&#12290;&#20854;&#20013;&#26368;&#26174;&#33879;&#30340;&#24212;&#29992;&#20043;&#19968;&#26159;&#21019;&#20316;&#65292;&#20363;&#22914;&#35799;&#27468;&#25110;&#25925;&#20107;&#65306;&#29983;&#25104;&#30340;&#36755;&#20986;&#36890;&#24120;&#20855;&#26377;&#24778;&#20154;&#30340;&#36136;&#37327;&#12290;&#20294;&#26159;&#65292;&#19968;&#20010;&#33258;&#28982;&#30340;&#38382;&#39064;&#26159;&#65306;LLMs&#30495;&#30340;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#21019;&#36896;&#24615;&#30340;&#21527;&#65311;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#21019;&#36896;&#24615;&#29702;&#35770;&#30340;&#35282;&#24230;&#20998;&#26512;&#20102;LLMs&#30340;&#21457;&#23637;&#65292;&#25506;&#35752;&#20102;&#20851;&#38190;&#30340;&#26410;&#35299;&#20915;&#38382;&#39064;&#21644;&#25361;&#25112;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#22312;&#19982;LLMs&#30456;&#20851;&#30340;&#26426;&#22120;&#21019;&#36896;&#24615;&#26041;&#38754;&#30830;&#23450;&#20102;&#19968;&#32452;&#8220;&#26131;&#8221;&#21644;&#8220;&#38590;&#8221;&#38382;&#39064;&#65292;&#24182;&#23545;&#20854;&#36827;&#34892;&#20102;&#35752;&#35770;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#36825;&#20123;&#25216;&#26415;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large Language Models (LLMs) are revolutionizing several areas of Artificial Intelligence. One of the most remarkable applications is creative writing, e.g., poetry or storytelling: the generated outputs are often of astonishing quality. However, a natural question arise: can LLMs really be considered creative? In this article we firstly analyze the development of LLMs under the lens of creativity theories, investigating the key open questions and challenges. Then, we identify a set of "easy" and "hard" problems in machine creativity, discussing them in relation to LLMs. Finally, we analyze the societal impact of these technologies with a particular focus on the creative industries.
&lt;/p&gt;</description></item></channel></rss>