<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#36890;&#36807;&#30740;&#31350;&#24191;&#20041;&#36870;&#29702;&#35770;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20840;&#33394;&#22686;&#24378;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#22522;&#20110;&#31616;&#21333;&#30697;&#38453;&#26041;&#31243;&#25551;&#36848;&#20840;&#33394;&#22686;&#24378;&#38382;&#39064;&#65292;&#24182;&#25506;&#35752;&#35299;&#30340;&#26465;&#20214;&#21644;&#20809;&#35889;&#12289;&#31354;&#38388;&#20998;&#36776;&#29575;&#30340;&#33719;&#21462;&#12290;&#36890;&#36807;&#24341;&#20837;&#38477;&#37319;&#26679;&#22686;&#24378;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19982;&#20998;&#37327;&#26367;&#20195;&#21644;&#22810;&#20998;&#36776;&#29575;&#20998;&#26512;&#26041;&#27861;&#30456;&#23545;&#24212;&#30340;&#24191;&#20041;&#36870;&#30697;&#38453;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#20808;&#39564;&#26469;&#35299;&#20915;&#20840;&#33394;&#22686;&#24378;&#20013;&#30340;&#29702;&#35770;&#35823;&#24046;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2310.02718</link><description>&lt;p&gt;
&#36890;&#36807;&#24191;&#20041;&#36870;&#29702;&#35299;&#20840;&#33394;&#22686;&#24378;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Understanding Pan-Sharpening via Generalized Inverse. (arXiv:2310.02718v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02718
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#24191;&#20041;&#36870;&#29702;&#35770;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20840;&#33394;&#22686;&#24378;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#22522;&#20110;&#31616;&#21333;&#30697;&#38453;&#26041;&#31243;&#25551;&#36848;&#20840;&#33394;&#22686;&#24378;&#38382;&#39064;&#65292;&#24182;&#25506;&#35752;&#35299;&#30340;&#26465;&#20214;&#21644;&#20809;&#35889;&#12289;&#31354;&#38388;&#20998;&#36776;&#29575;&#30340;&#33719;&#21462;&#12290;&#36890;&#36807;&#24341;&#20837;&#38477;&#37319;&#26679;&#22686;&#24378;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19982;&#20998;&#37327;&#26367;&#20195;&#21644;&#22810;&#20998;&#36776;&#29575;&#20998;&#26512;&#26041;&#27861;&#30456;&#23545;&#24212;&#30340;&#24191;&#20041;&#36870;&#30697;&#38453;&#34920;&#36798;&#24335;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#20808;&#39564;&#26469;&#35299;&#20915;&#20840;&#33394;&#22686;&#24378;&#20013;&#30340;&#29702;&#35770;&#35823;&#24046;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#33394;&#22686;&#24378;&#31639;&#27861;&#21033;&#29992;&#20840;&#33394;&#22270;&#20687;&#21644;&#22810;&#20809;&#35889;&#22270;&#20687;&#33719;&#21462;&#20855;&#26377;&#39640;&#31354;&#38388;&#21644;&#39640;&#20809;&#35889;&#30340;&#22270;&#20687;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#31639;&#27861;&#30340;&#20248;&#21270;&#26159;&#26681;&#25454;&#19981;&#21516;&#30340;&#26631;&#20934;&#35774;&#35745;&#30340;&#12290;&#25105;&#20204;&#37319;&#29992;&#31616;&#21333;&#30340;&#30697;&#38453;&#26041;&#31243;&#26469;&#25551;&#36848;&#20840;&#33394;&#22686;&#24378;&#38382;&#39064;&#65292;&#24182;&#35752;&#35770;&#35299;&#30340;&#23384;&#22312;&#26465;&#20214;&#20197;&#21450;&#20809;&#35889;&#21644;&#31354;&#38388;&#20998;&#36776;&#29575;&#30340;&#33719;&#21462;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#38477;&#37319;&#26679;&#22686;&#24378;&#26041;&#27861;&#65292;&#20197;&#26356;&#22909;&#22320;&#33719;&#21462;&#31354;&#38388;&#21644;&#20809;&#35889;&#38477;&#37319;&#26679;&#30697;&#38453;&#12290;&#36890;&#36807;&#24191;&#20041;&#36870;&#29702;&#35770;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#20004;&#31181;&#24418;&#24335;&#30340;&#24191;&#20041;&#36870;&#30697;&#38453;&#34920;&#36798;&#24335;&#65292;&#21487;&#20197;&#23545;&#24212;&#20110;&#20004;&#20010;&#20027;&#35201;&#30340;&#20840;&#33394;&#22686;&#24378;&#26041;&#27861;&#65306;&#20998;&#37327;&#26367;&#20195;&#21644;&#22810;&#20998;&#36776;&#29575;&#20998;&#26512;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;Gram Schmidt&#33258;&#36866;&#24212;(GSA)&#26041;&#27861;&#36981;&#24490;&#20998;&#37327;&#26367;&#20195;&#30340;&#24191;&#20041;&#36870;&#30697;&#38453;&#34920;&#36798;&#24335;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22312;&#20809;&#35889;&#20989;&#25968;&#30340;&#24191;&#20041;&#36870;&#30697;&#38453;&#20043;&#21069;&#30340;&#27169;&#22411;&#20808;&#39564;&#12290;&#25105;&#20204;&#23545;&#29702;&#35770;&#35823;&#24046;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pan-sharpening algorithm utilizes panchromatic image and multispectral image to obtain a high spatial and high spectral image. However, the optimizations of the algorithms are designed with different standards. We adopt the simple matrix equation to describe the Pan-sharpening problem. The solution existence condition and the acquirement of spectral and spatial resolution are discussed. A down-sampling enhancement method was introduced for better acquiring the spatial and spectral down-sample matrices. By the generalized inverse theory, we derived two forms of general inverse matrix formulations that can correspond to the two prominent classes of Pan-sharpening methods, that is, component substitution and multi-resolution analysis methods. Specifically, the Gram Schmidt Adaptive(GSA) was proved to follow the general inverse matrix formulation of component substitution. A model prior to the general inverse matrix of the spectral function was rendered. The theoretical errors are analyzed
&lt;/p&gt;</description></item></channel></rss>