<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20351;&#29992;&#38750;&#20405;&#20837;&#24335;&#31185;&#23398;&#26426;&#22120;&#23398;&#20064;&#65288;SciML&#65289;&#20013;&#30340;operator inference&#65288;OpInf&#65289;&#26041;&#27861;&#65292;&#20174;&#25968;&#25454;&#20013;&#26500;&#24314;&#22522;&#20110;&#29289;&#29702;&#30340;&#20302;&#25104;&#26412;&#31616;&#21270;&#27169;&#22411;&#65288;ROMs&#65289;&#65292;&#29992;&#20110;&#38750;&#32447;&#24615;&#31561;&#31163;&#23376;&#20307;&#28237;&#27969;&#27169;&#25311;&#30340;Hasegawa-Wakatani&#26041;&#31243;&#12290;&#23454;&#39564;&#35777;&#26126;&#35813;&#26041;&#27861;&#22312;&#22788;&#29702;&#22797;&#26434;&#12289;&#38750;&#32447;&#24615;&#21644;&#33258;&#39537;&#21160;&#21160;&#21147;&#23398;&#27169;&#22411;&#26102;&#20855;&#26377;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2401.05972</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#20013;&#23398;&#20064;&#22522;&#20110;&#29289;&#29702;&#30340;&#31616;&#21270;&#27169;&#22411;&#65292;&#29992;&#20110;Hasegawa-Wakatani&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Learning physics-based reduced models from data for the Hasegawa-Wakatani equations. (arXiv:2401.05972v1 [physics.comp-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05972
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20351;&#29992;&#38750;&#20405;&#20837;&#24335;&#31185;&#23398;&#26426;&#22120;&#23398;&#20064;&#65288;SciML&#65289;&#20013;&#30340;operator inference&#65288;OpInf&#65289;&#26041;&#27861;&#65292;&#20174;&#25968;&#25454;&#20013;&#26500;&#24314;&#22522;&#20110;&#29289;&#29702;&#30340;&#20302;&#25104;&#26412;&#31616;&#21270;&#27169;&#22411;&#65288;ROMs&#65289;&#65292;&#29992;&#20110;&#38750;&#32447;&#24615;&#31561;&#31163;&#23376;&#20307;&#28237;&#27969;&#27169;&#25311;&#30340;Hasegawa-Wakatani&#26041;&#31243;&#12290;&#23454;&#39564;&#35777;&#26126;&#35813;&#26041;&#27861;&#22312;&#22788;&#29702;&#22797;&#26434;&#12289;&#38750;&#32447;&#24615;&#21644;&#33258;&#39537;&#21160;&#21160;&#21147;&#23398;&#27169;&#22411;&#26102;&#20855;&#26377;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#38750;&#20405;&#20837;&#24335;&#31185;&#23398;&#26426;&#22120;&#23398;&#20064;&#65288;SciML&#65289;&#30340;&#32422;&#20943;&#27169;&#22411;&#65288;ROMs&#65289;&#26500;&#24314;&#65292;&#29992;&#20110;&#38750;&#32447;&#24615;&#12289;&#28151;&#27788;&#31561;&#31163;&#23376;&#20307;&#28237;&#27969;&#27169;&#25311;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;operator inference&#65288;OpInf&#65289;&#20174;&#25968;&#25454;&#20013;&#26500;&#24314;&#22522;&#20110;&#29289;&#29702;&#30340;&#20302;&#25104;&#26412;ROMs&#29992;&#20110;&#36825;&#31181;&#27169;&#25311;&#12290;&#20197;Hasegawa-Wakatani&#65288;HW&#65289;&#26041;&#31243;&#20026;&#20195;&#34920;&#65292;&#22312;&#24418;&#25104;&#22797;&#26434;&#12289;&#38750;&#32447;&#24615;&#21644;&#33258;&#39537;&#21160;&#21160;&#21147;&#23398;&#30340;&#24773;&#20917;&#19979;&#32771;&#23519;&#20102;OpInf&#26500;&#24314;&#20934;&#30830;ROMs&#30340;&#28508;&#21147;&#65292;&#24182;&#36827;&#34892;&#20102;&#20004;&#32452;&#23454;&#39564;&#12290;&#31532;&#19968;&#32452;&#23454;&#39564;&#21033;&#29992;&#36890;&#36807;&#30452;&#25509;&#25968;&#20540;&#27169;&#25311;&#20174;&#29305;&#23450;&#21021;&#20540;&#26465;&#20214;&#24320;&#22987;&#30340;HW&#26041;&#31243;&#33719;&#24471;&#30340;&#25968;&#25454;&#65292;&#36827;&#34892;OpInf ROMs&#30340;&#35757;&#32451;&#20197;&#23454;&#29616;&#36229;&#36234;&#35757;&#32451;&#26102;&#38388;&#33539;&#22260;&#30340;&#39044;&#27979;&#12290;&#22312;&#26356;&#20855;&#25361;&#25112;&#24615;&#30340;&#31532;&#20108;&#32452;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#30456;&#21516;&#30340;&#25968;&#25454;&#38598;&#23545;ROMs&#36827;&#34892;&#35757;&#32451;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper focuses on the construction of non-intrusive Scientific Machine Learning (SciML) Reduced-Order Models (ROMs) for nonlinear, chaotic plasma turbulence simulations. In particular, we propose using Operator Inference (OpInf) to build low-cost physics-based ROMs from data for such simulations. As a representative example, we focus on the Hasegawa-Wakatani (HW) equations used for modeling two-dimensional electrostatic drift-wave plasma turbulence. For a comprehensive perspective of the potential of OpInf to construct accurate ROMs for this model, we consider a setup for the HW equations that leads to the formation of complex, nonlinear, and self-driven dynamics, and perform two sets of experiments. We first use the data obtained via a direct numerical simulation of the HW equations starting from a specific initial condition and train OpInf ROMs for predictions beyond the training time horizon. In the second, more challenging set of experiments, we train ROMs using the same datase
&lt;/p&gt;</description></item></channel></rss>