<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#26412;&#35770;&#25991;&#23545;&#29615;&#22659;&#21487;&#25345;&#32493;&#20154;&#24037;&#26234;&#33021;&#25552;&#20986;&#20102;&#25209;&#21028;&#24615;&#35270;&#35282;&#65292;&#35748;&#20026;&#20165;&#20165;&#25552;&#39640;&#25928;&#29575;&#36824;&#19981;&#36275;&#20197;&#20351;&#26426;&#22120;&#23398;&#20064;&#25104;&#20026;&#19968;&#31181;&#29615;&#22659;&#21487;&#25345;&#32493;&#30340;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2309.02065</link><description>&lt;p&gt;
&#25928;&#29575;&#19981;&#26159;&#21807;&#19968;&#26631;&#20934;&#65306;&#23545;&#29615;&#22659;&#21487;&#25345;&#32493;&#20154;&#24037;&#26234;&#33021;&#30340;&#25209;&#21028;&#24615;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Efficiency is Not Enough: A Critical Perspective of Environmentally Sustainable AI. (arXiv:2309.02065v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02065
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#23545;&#29615;&#22659;&#21487;&#25345;&#32493;&#20154;&#24037;&#26234;&#33021;&#25552;&#20986;&#20102;&#25209;&#21028;&#24615;&#35270;&#35282;&#65292;&#35748;&#20026;&#20165;&#20165;&#25552;&#39640;&#25928;&#29575;&#36824;&#19981;&#36275;&#20197;&#20351;&#26426;&#22120;&#23398;&#20064;&#25104;&#20026;&#19968;&#31181;&#29615;&#22659;&#21487;&#25345;&#32493;&#30340;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30446;&#21069;&#30001;&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#31561;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#26041;&#27861;&#25512;&#21160;&#65292;&#36825;&#20123;&#26041;&#27861;&#21152;&#36895;&#20102;&#22312;&#35768;&#22810;&#21407;&#26412;&#34987;&#35748;&#20026;&#36229;&#20986;AI&#33539;&#22260;&#30340;&#20219;&#21153;&#19978;&#30340;&#36827;&#23637;&#12290;&#36825;&#20123;ML&#26041;&#27861;&#36890;&#24120;&#38656;&#35201;&#22823;&#37327;&#35745;&#31639;&#36164;&#28304;&#12289;&#33021;&#28304;&#28040;&#32791;&#22823;&#65292;&#24182;&#23548;&#33268;&#22823;&#37327;&#30340;&#30899;&#25490;&#25918;&#65292;&#36825;&#26159;&#20154;&#20026;&#27668;&#20505;&#21464;&#21270;&#30340;&#19968;&#20010;&#24050;&#30693;&#39537;&#21160;&#22240;&#32032;&#12290;&#27492;&#22806;&#65292;ML&#31995;&#32479;&#36816;&#34892;&#30340;&#24179;&#21488;&#19982;&#29615;&#22659;&#24433;&#21709;&#26377;&#20851;&#65292;&#21253;&#25324;&#30899;&#25490;&#25918;&#20043;&#22806;&#30340;&#20854;&#20182;&#26041;&#38754;&#12290;&#24037;&#19994;&#30028;&#21644;ML&#31038;&#21306;&#24191;&#27867;&#25512;&#23815;&#30340;&#25552;&#39640;ML&#31995;&#32479;&#22312;&#35745;&#31639;&#21644;&#33021;&#28304;&#28040;&#32791;&#26041;&#38754;&#30340;&#25928;&#29575;&#26469;&#25913;&#21892;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#25105;&#20204;&#35748;&#20026;&#20165;&#20165;&#20381;&#38752;&#25928;&#29575;&#36824;&#19981;&#36275;&#20197;&#20351;ML&#20316;&#20026;&#19968;&#31181;&#29615;&#22659;&#21487;&#25345;&#32493;&#30340;&#25216;&#26415;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19977;&#20010;&#39640;&#23618;&#27425;&#30340;&#24046;&#24322;&#26469;&#38416;&#36848;&#32771;&#34385;&#20247;&#22810;&#21464;&#37327;&#23545;ML&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#24433;&#21709;&#26102;&#65292;&#20165;&#20381;&#38752;&#25928;&#29575;&#26159;&#19981;&#22815;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence (AI) is currently spearheaded by machine learning (ML) methods such as deep learning (DL) which have accelerated progress on many tasks thought to be out of reach of AI. These ML methods can often be compute hungry, energy intensive, and result in significant carbon emissions, a known driver of anthropogenic climate change. Additionally, the platforms on which ML systems run are associated with environmental impacts including and beyond carbon emissions. The solution lionized by both industry and the ML community to improve the environmental sustainability of ML is to increase the efficiency with which ML systems operate in terms of both compute and energy consumption. In this perspective, we argue that efficiency alone is not enough to make ML as a technology environmentally sustainable. We do so by presenting three high level discrepancies between the effect of efficiency on the environmental sustainability of ML when considering the many variables which it in
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#28548;&#28165;&#20102;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#34920;&#24449;&#29366;&#24577;&#12290;&#23613;&#31649;&#36890;&#24120;&#31216;&#20026;&#8220;&#34920;&#24449;&#8221;&#65292;&#20294;&#23454;&#38469;&#19978;&#23427;&#20204;&#26356;&#36866;&#21512;&#29702;&#35299;&#20026;&#39640;&#24230;&#29702;&#24819;&#21270;&#30340;&#27169;&#22411;&#65292;&#36825;&#19968;&#32467;&#26524;&#23545;&#21487;&#35299;&#37322;&#30340;AI&#26377;&#30528;&#30452;&#25509;&#24433;&#21709;&#65292;&#20063;&#24341;&#36215;&#20102;&#21746;&#23398;&#23478;&#23545;&#20854;&#22312;&#26410;&#26469;&#31185;&#23398;&#30740;&#31350;&#20013;&#30340;&#20316;&#29992;&#30340;&#20851;&#27880;&#12290;</title><link>http://arxiv.org/abs/2303.12032</link><description>&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#34920;&#24449;&#29366;&#24577;
&lt;/p&gt;
&lt;p&gt;
The Representational Status of Deep Learning Models. (arXiv:2303.12032v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12032
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#28548;&#28165;&#20102;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#34920;&#24449;&#29366;&#24577;&#12290;&#23613;&#31649;&#36890;&#24120;&#31216;&#20026;&#8220;&#34920;&#24449;&#8221;&#65292;&#20294;&#23454;&#38469;&#19978;&#23427;&#20204;&#26356;&#36866;&#21512;&#29702;&#35299;&#20026;&#39640;&#24230;&#29702;&#24819;&#21270;&#30340;&#27169;&#22411;&#65292;&#36825;&#19968;&#32467;&#26524;&#23545;&#21487;&#35299;&#37322;&#30340;AI&#26377;&#30528;&#30452;&#25509;&#24433;&#21709;&#65292;&#20063;&#24341;&#36215;&#20102;&#21746;&#23398;&#23478;&#23545;&#20854;&#22312;&#26410;&#26469;&#31185;&#23398;&#30740;&#31350;&#20013;&#30340;&#20316;&#29992;&#30340;&#20851;&#27880;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#28548;&#28165;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65288;DLMs&#65289;&#30340;&#34920;&#24449;&#29366;&#24577;&#12290;&#30001;&#20110;&#21151;&#33021;&#21644;&#20851;&#31995;&#27010;&#24565;&#30340;&#28151;&#28102;&#65292;&#23613;&#31649;&#36890;&#24120;&#31216;&#20026;&#8220;&#34920;&#24449;&#8221;&#65292;&#20294;&#36825;&#24847;&#21619;&#30528;&#21547;&#31946;&#19981;&#28165;&#12290;&#26412;&#25991;&#35748;&#20026;&#65292;&#34429;&#28982;DLM&#20197;&#20851;&#31995;&#24847;&#20041;&#19978;&#30340;&#34920;&#24449;&#20854;&#30446;&#26631;&#65292;&#20294;&#26368;&#22909;&#29702;&#35299;&#20026;&#39640;&#24230;&#29702;&#24819;&#21270;&#30340;&#27169;&#22411;&#12290;&#36825;&#20010;&#32467;&#26524;&#23545;&#21487;&#35299;&#37322;&#30340;AI&#65288;XAI&#65289;&#26377;&#30452;&#25509;&#24433;&#21709;&#65292;&#24182;&#24341;&#23548;&#21746;&#23398;&#20851;&#27880;DLM&#34920;&#24449;&#30340;&#29702;&#24819;&#21270;&#24615;&#36136;&#21450;&#20854;&#22312;&#26410;&#26469;&#31185;&#23398;&#30740;&#31350;&#20013;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to clarify the representational status of Deep Learning Models (DLMs). While commonly referred to as 'representations', what this entails is ambiguous due to a conflation of functional and relational conceptions of representation. This paper argues that while DLMs represent their targets in a relational sense, they are best understood as highly idealized models. This result has immediate implications for explainable AI (XAI) and directs philosophical attention toward examining the idealized nature of DLM representations and their role in future scientific investigation.
&lt;/p&gt;</description></item></channel></rss>