<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;Spotify&#29992;&#25143;&#23646;&#24615;&#19982;&#20182;&#20204;&#20844;&#24320;&#25773;&#25918;&#21015;&#34920;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#29305;&#21035;&#20851;&#27880;&#35782;&#21035;&#19982;&#29992;&#25143;&#20010;&#20154;&#23646;&#24615;&#30456;&#20851;&#30340;&#38899;&#20048;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2401.14296</link><description>&lt;p&gt;
"All of Me": &#20174;&#20844;&#24320;&#30340;Spotify&#25773;&#25918;&#21015;&#34920;&#20013;&#25366;&#25496;&#29992;&#25143;&#23646;&#24615;
&lt;/p&gt;
&lt;p&gt;
"All of Me": Mining Users' Attributes from their Public Spotify Playlists. (arXiv:2401.14296v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14296
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;Spotify&#29992;&#25143;&#23646;&#24615;&#19982;&#20182;&#20204;&#20844;&#24320;&#25773;&#25918;&#21015;&#34920;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#29305;&#21035;&#20851;&#27880;&#35782;&#21035;&#19982;&#29992;&#25143;&#20010;&#20154;&#23646;&#24615;&#30456;&#20851;&#30340;&#38899;&#20048;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25968;&#23383;&#38899;&#20048;&#27969;&#23186;&#20307;&#26102;&#20195;&#65292;&#20687;Spotify&#36825;&#26679;&#30340;&#24179;&#21488;&#19978;&#30340;&#25773;&#25918;&#21015;&#34920;&#24050;&#32463;&#25104;&#20026;&#20010;&#20154;&#38899;&#20048;&#20307;&#39564;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#20154;&#20204;&#21019;&#24314;&#24182;&#20844;&#24320;&#20998;&#20139;&#33258;&#24049;&#30340;&#25773;&#25918;&#21015;&#34920;&#65292;&#20197;&#34920;&#36798;&#20182;&#20204;&#30340;&#38899;&#20048;&#21697;&#21619;&#65292;&#25512;&#24191;&#20182;&#20204;&#26368;&#21916;&#29233;&#30340;&#33402;&#26415;&#23478;&#30340;&#21457;&#29616;&#65292;&#24182;&#20419;&#36827;&#31038;&#20132;&#32852;&#31995;&#12290;&#36825;&#20123;&#21487;&#20197;&#20844;&#24320;&#35775;&#38382;&#30340;&#25773;&#25918;&#21015;&#34920;&#36229;&#36234;&#20102;&#20165;&#20165;&#38899;&#20048;&#20559;&#22909;&#30340;&#30028;&#38480;&#65306;&#23427;&#20204;&#26159;&#20016;&#23500;&#27934;&#23519;&#29992;&#25143;&#23646;&#24615;&#21644;&#36523;&#20221;&#30340;&#26469;&#28304;&#12290;&#20363;&#22914;&#65292;&#32769;&#24180;&#20154;&#30340;&#38899;&#20048;&#20559;&#22909;&#21487;&#33021;&#26356;&#20559;&#21521;&#20110;&#24343;&#20848;&#20811;&#183;&#36763;&#32435;&#23624;&#65292;&#32780;&#27604;&#33673;&#183;&#33406;&#21033;&#20160;&#20173;&#28982;&#26159;&#21313;&#20960;&#23681;&#38738;&#23569;&#24180;&#30340;&#39318;&#36873;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#25773;&#25918;&#21015;&#34920;&#25104;&#20026;&#20102;&#19968;&#25159;&#20102;&#35299;&#38899;&#20048;&#36523;&#20221;&#22810;&#26679;&#32780;&#19981;&#26029;&#28436;&#21464;&#30340;&#31383;&#21475;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;Spotify&#29992;&#25143;&#23646;&#24615;&#21644;&#20182;&#20204;&#30340;&#20844;&#24320;&#25773;&#25918;&#21015;&#34920;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#35782;&#21035;&#19982;&#29992;&#25143;&#20010;&#20154;&#23646;&#24615;&#30456;&#20851;&#30340;&#32463;&#24120;&#20986;&#29616;&#30340;&#38899;&#20048;&#29305;&#24449;&#65292;&#20363;&#22914;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#65292;&#20064;&#24815;&#25110;&#20010;&#24615;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the age of digital music streaming, playlists on platforms like Spotify have become an integral part of individuals' musical experiences. People create and publicly share their own playlists to express their musical tastes, promote the discovery of their favorite artists, and foster social connections. These publicly accessible playlists transcend the boundaries of mere musical preferences: they serve as sources of rich insights into users' attributes and identities. For example, the musical preferences of elderly individuals may lean more towards Frank Sinatra, while Billie Eilish remains a favored choice among teenagers. These playlists thus become windows into the diverse and evolving facets of one's musical identity.  In this work, we investigate the relationship between Spotify users' attributes and their public playlists. In particular, we focus on identifying recurring musical characteristics associated with users' individual attributes, such as demographics, habits, or perso
&lt;/p&gt;</description></item></channel></rss>