<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>ICE-PIXIU&#27169;&#22411;&#23558;&#20013;&#25991;&#21644;&#33521;&#25991;&#37329;&#34701;&#20998;&#26512;&#32479;&#19968;&#65292;&#36890;&#36807;&#25972;&#21512;&#22810;&#31181;&#20219;&#21153;&#21644;&#25968;&#25454;&#38598;&#25552;&#21319;&#21452;&#35821;&#37329;&#34701;&#24314;&#27169;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.06249</link><description>&lt;p&gt;
&#27809;&#26377;&#23396;&#23707;&#35821;&#35328;:&#32479;&#19968;&#20013;&#33521;&#25991;&#37329;&#34701;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12289;&#25351;&#23548;&#25968;&#25454;&#21644;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
No Language is an Island: Unifying Chinese and English in Financial Large Language Models, Instruction Data, and Benchmarks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06249
&lt;/p&gt;
&lt;p&gt;
ICE-PIXIU&#27169;&#22411;&#23558;&#20013;&#25991;&#21644;&#33521;&#25991;&#37329;&#34701;&#20998;&#26512;&#32479;&#19968;&#65292;&#36890;&#36807;&#25972;&#21512;&#22810;&#31181;&#20219;&#21153;&#21644;&#25968;&#25454;&#38598;&#25552;&#21319;&#21452;&#35821;&#37329;&#34701;&#24314;&#27169;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30340;&#21457;&#23637;&#26174;&#33879;&#25512;&#21160;&#20102;&#37329;&#34701;&#20998;&#26512;&#65292;&#20294;&#23427;&#20204;&#30340;&#24212;&#29992;&#20027;&#35201;&#23616;&#38480;&#22312;&#21333;&#19968;&#35821;&#35328;&#39046;&#22495;&#65292;&#26410;&#20805;&#20998;&#24320;&#21457;&#20013;&#33521;&#25991;&#21452;&#35821;&#33021;&#21147;&#30340;&#28508;&#21147;&#12290;&#20026;&#24357;&#21512;&#36825;&#19968;&#40511;&#27807;&#65292;&#25105;&#20204;&#24341;&#20837; ICE-PIXIU&#65292;&#26080;&#32541;&#34701;&#21512; ICE-INTENT &#27169;&#22411;&#21644; ICE-FLARE &#21452;&#35821;&#37329;&#34701;&#20998;&#26512;&#22522;&#20934;&#12290;ICE-PIXIU &#29420;&#29305;&#22320;&#25972;&#21512;&#20102;&#19968;&#31995;&#21015;&#20013;&#25991;&#20219;&#21153;&#65292;&#20197;&#21450;&#32763;&#35793;&#21644;&#21407;&#22987;&#33521;&#25991;&#25968;&#25454;&#38598;&#65292;&#20016;&#23500;&#20102;&#21452;&#35821;&#37329;&#34701;&#24314;&#27169;&#30340;&#24191;&#24230;&#21644;&#28145;&#24230;&#12290;&#23427;&#25552;&#20379;&#20102;&#23545;&#22810;&#31181;&#27169;&#22411;&#21464;&#20307;&#30340;&#26080;&#38480;&#35775;&#38382;&#26435;&#38480;&#65292;&#19968;&#20010;&#21253;&#21547;&#22810;&#31181;&#36328;&#35821;&#35328;&#21644;&#22810;&#27169;&#24577;&#25351;&#23548;&#25968;&#25454;&#30340;&#22823;&#37327;&#32534;&#35793;&#65292;&#20197;&#21450;&#19968;&#20010;&#20855;&#26377;&#19987;&#23478;&#27880;&#37322;&#30340;&#35780;&#20272;&#22522;&#20934;&#65292;&#21253;&#25324; 10 &#20010; NLP &#20219;&#21153;&#65292;20 &#20010;&#21452;&#35821;&#19987;&#29992;&#20219;&#21153;&#65292;&#20849;&#35745;1,185k &#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#30340;&#24443;&#24213;&#35780;&#20272;&#24378;&#35843;&#20102;&#23558;&#36825;&#20123;&#21452;&#35821;&#25968;&#25454;&#38598;&#32435;&#20837;&#30340;&#20248;&#21183;&#65292;&#23588;&#20854;&#22312;t
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06249v1 Announce Type: cross  Abstract: While the progression of Large Language Models (LLMs) has notably propelled financial analysis, their application has largely been confined to singular language realms, leaving untapped the potential of bilingual Chinese-English capacity. To bridge this chasm, we introduce ICE-PIXIU, seamlessly amalgamating the ICE-INTENT model and ICE-FLARE benchmark for bilingual financial analysis. ICE-PIXIU uniquely integrates a spectrum of Chinese tasks, alongside translated and original English datasets, enriching the breadth and depth of bilingual financial modeling. It provides unrestricted access to diverse model variants, a substantial compilation of diverse cross-lingual and multi-modal instruction data, and an evaluation benchmark with expert annotations, comprising 10 NLP tasks, 20 bilingual specific tasks, totaling 1,185k datasets. Our thorough evaluation emphasizes the advantages of incorporating these bilingual datasets, especially in t
&lt;/p&gt;</description></item></channel></rss>