<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>FDINet&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#38450;&#24481;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#21033;&#29992;&#29305;&#24449;&#22833;&#30495;&#25351;&#25968;&#26469;&#20445;&#25252;DNN&#27169;&#22411;&#20813;&#21463;&#27169;&#22411;&#25552;&#21462;&#25915;&#20987;&#65292;&#24182;&#21033;&#29992;FDI&#30456;&#20284;&#24615;&#26469;&#35782;&#21035;&#20998;&#24067;&#24335;&#25552;&#21462;&#25915;&#20987;&#20013;&#30340;&#21246;&#32467;&#25932;&#20154;&#12290;</title><link>http://arxiv.org/abs/2306.11338</link><description>&lt;p&gt;
FDINet&#65306;&#21033;&#29992;&#29305;&#24449;&#22833;&#30495;&#25351;&#25968;&#20445;&#25252; DNN &#27169;&#22411;&#20813;&#21463;&#27169;&#22411;&#25552;&#21462;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
FDINet: Protecting against DNN Model Extraction via Feature Distortion Index. (arXiv:2306.11338v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11338
&lt;/p&gt;
&lt;p&gt;
FDINet&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#38450;&#24481;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#21033;&#29992;&#29305;&#24449;&#22833;&#30495;&#25351;&#25968;&#26469;&#20445;&#25252;DNN&#27169;&#22411;&#20813;&#21463;&#27169;&#22411;&#25552;&#21462;&#25915;&#20987;&#65292;&#24182;&#21033;&#29992;FDI&#30456;&#20284;&#24615;&#26469;&#35782;&#21035;&#20998;&#24067;&#24335;&#25552;&#21462;&#25915;&#20987;&#20013;&#30340;&#21246;&#32467;&#25932;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#21363;&#26381;&#21153;&#65288;MLaaS&#65289;&#24179;&#21488;&#30001;&#20110;&#20854;&#26131;&#29992;&#24615;&#12289;&#25104;&#26412;&#25928;&#30410;&#12289;&#21487;&#25193;&#23637;&#24615;&#21644;&#24555;&#36895;&#24320;&#21457;&#33021;&#21147;&#32780;&#21464;&#24471;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#24378;&#35843;&#20102; MLaaS &#20013;&#22522;&#20110;&#20113;&#30340;&#27169;&#22411;&#23545;&#27169;&#22411;&#25552;&#21462;&#25915;&#20987;&#30340;&#33030;&#24369;&#24615;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102; FDINET&#65292;&#19968;&#31181;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#27169;&#22411;&#29305;&#24449;&#20998;&#24067;&#30340;&#26032;&#39062;&#38450;&#24481;&#26426;&#21046;&#12290;&#20855;&#20307;&#22320;&#65292;&#36890;&#36807;&#20998;&#26512;&#23545;&#25163;&#30340;&#26597;&#35810;&#30340;&#29305;&#24449;&#20998;&#24067;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#36825;&#20123;&#26597;&#35810;&#30340;&#29305;&#24449;&#20998;&#24067;&#19982;&#27169;&#22411;&#30340;&#35757;&#32451;&#38598;&#19981;&#21516;&#12290;&#22522;&#20110;&#36825;&#20010;&#20851;&#38190;&#35266;&#23519;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#29305;&#24449;&#22833;&#30495;&#25351;&#25968;&#65288;FDI&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#24230;&#37327;&#35774;&#35745;&#65292;&#29992;&#20110;&#23450;&#37327;&#27979;&#37327;&#25509;&#25910;&#21040;&#30340;&#26597;&#35810;&#30340;&#29305;&#24449;&#20998;&#24067;&#20559;&#24046;&#12290;&#25152;&#25552;&#20986;&#30340; FDINET &#21033;&#29992; FDI &#35757;&#32451;&#19968;&#20010;&#20108;&#36827;&#21046;&#26816;&#27979;&#22120;&#65292;&#24182;&#21033;&#29992; FDI &#30456;&#20284;&#24615;&#35782;&#21035;&#20998;&#24067;&#24335;&#25552;&#21462;&#25915;&#20987;&#20013;&#30340;&#21246;&#32467;&#25932;&#20154;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#39564;&#26469;&#35780;&#20272; FDINET &#23545;&#25239;&#27169;&#22411;&#25552;&#21462;&#25915;&#20987;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine Learning as a Service (MLaaS) platforms have gained popularity due to their accessibility, cost-efficiency, scalability, and rapid development capabilities. However, recent research has highlighted the vulnerability of cloud-based models in MLaaS to model extraction attacks. In this paper, we introduce FDINET, a novel defense mechanism that leverages the feature distribution of deep neural network (DNN) models. Concretely, by analyzing the feature distribution from the adversary's queries, we reveal that the feature distribution of these queries deviates from that of the model's training set. Based on this key observation, we propose Feature Distortion Index (FDI), a metric designed to quantitatively measure the feature distribution deviation of received queries. The proposed FDINET utilizes FDI to train a binary detector and exploits FDI similarity to identify colluding adversaries from distributed extraction attacks. We conduct extensive experiments to evaluate FDINET against
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;PROVEXPLAINER&#26694;&#26550;&#65292;&#36890;&#36807;&#22797;&#21046;GNN-based security models&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#21033;&#29992;&#20915;&#31574;&#26641;&#21644;&#22270;&#32467;&#26500;&#29305;&#24449;&#23558;&#25277;&#35937;GNN&#20915;&#31574;&#36793;&#30028;&#25237;&#24433;&#21040;&#21487;&#35299;&#37322;&#30340;&#29305;&#24449;&#31354;&#38388;&#65292;&#20197;&#22686;&#24378;GNN&#23433;&#20840;&#27169;&#22411;&#30340;&#36879;&#26126;&#24230;&#21644;&#35810;&#38382;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2306.00934</link><description>&lt;p&gt;
&#22522;&#20110;&#26435;&#23041;&#22270;&#32467;&#26500;&#29305;&#24449;&#23545;&#22522;&#20110;GNN&#30340;IDS&#26816;&#27979;&#36827;&#34892;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Interpreting GNN-based IDS Detections Using Provenance Graph Structural Features. (arXiv:2306.00934v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00934
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;PROVEXPLAINER&#26694;&#26550;&#65292;&#36890;&#36807;&#22797;&#21046;GNN-based security models&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#21033;&#29992;&#20915;&#31574;&#26641;&#21644;&#22270;&#32467;&#26500;&#29305;&#24449;&#23558;&#25277;&#35937;GNN&#20915;&#31574;&#36793;&#30028;&#25237;&#24433;&#21040;&#21487;&#35299;&#37322;&#30340;&#29305;&#24449;&#31354;&#38388;&#65292;&#20197;&#22686;&#24378;GNN&#23433;&#20840;&#27169;&#22411;&#30340;&#36879;&#26126;&#24230;&#21644;&#35810;&#38382;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22797;&#26434;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#40657;&#21283;&#23376;&#26412;&#36136;&#22952;&#30861;&#20102;&#23427;&#20204;&#22312;&#23433;&#20840;&#39046;&#22495;&#30340;&#26222;&#21450;&#65292;&#22240;&#20026;&#23427;&#20204;&#32570;&#20047;&#36923;&#36753;&#35299;&#37322;&#21644;&#21487;&#25191;&#34892;&#21518;&#32493;&#34892;&#21160;&#30340;&#39044;&#27979;&#12290;&#20026;&#20102;&#22686;&#24378;&#22312;&#31995;&#32479;&#26469;&#28304;&#20998;&#26512;&#20013;&#20351;&#29992;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#23433;&#20840;&#27169;&#22411;&#30340;&#36879;&#26126;&#24230;&#21644;&#38382;&#36131;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;PROVEXPLAINER&#65292;&#19968;&#31181;&#23558;&#25277;&#35937;GNN&#20915;&#31574;&#36793;&#30028;&#25237;&#24433;&#21040;&#21487;&#35299;&#37322;&#29305;&#24449;&#31354;&#38388;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#39318;&#20808;&#20351;&#29992;&#31616;&#21333;&#19988;&#21487;&#35299;&#37322;&#30340;&#27169;&#22411;&#65292;&#22914;&#20915;&#31574;&#26641;&#65288;DT&#65289;&#65292;&#22797;&#21046;&#22522;&#20110;GNN&#30340;&#23433;&#20840;&#27169;&#22411;&#30340;&#20915;&#31574;&#36807;&#31243;&#12290;&#20026;&#20102;&#26368;&#22823;&#21270;&#26367;&#20195;&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;&#21644;&#20445;&#30495;&#24230;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32463;&#20856;&#22270;&#35770;&#30340;&#22270;&#32467;&#26500;&#29305;&#24449;&#65292;&#24182;&#36890;&#36807;&#23433;&#20840;&#39046;&#22495;&#30693;&#35782;&#30340;&#24191;&#27867;&#25968;&#25454;&#30740;&#31350;&#23545;&#20854;&#36827;&#34892;&#20102;&#22686;&#24378;&#12290;&#25105;&#20204;&#30340;&#22270;&#32467;&#26500;&#29305;&#24449;&#19982;&#31995;&#32479;&#26469;&#28304;&#39046;&#22495;&#20013;&#30340;&#38382;&#39064;&#31354;&#38388;&#34892;&#21160;&#23494;&#20999;&#30456;&#20851;&#65292;&#36825;&#20351;&#26816;&#27979;&#32467;&#26524;&#21487;&#29992;&#20154;&#31867;&#35821;&#35328;&#25551;&#36848;&#21644;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
The black-box nature of complex Neural Network (NN)-based models has hindered their widespread adoption in security domains due to the lack of logical explanations and actionable follow-ups for their predictions. To enhance the transparency and accountability of Graph Neural Network (GNN) security models used in system provenance analysis, we propose PROVEXPLAINER, a framework for projecting abstract GNN decision boundaries onto interpretable feature spaces.  We first replicate the decision-making process of GNNbased security models using simpler and explainable models such as Decision Trees (DTs). To maximize the accuracy and fidelity of the surrogate models, we propose novel graph structural features founded on classical graph theory and enhanced by extensive data study with security domain knowledge. Our graph structural features are closely tied to problem-space actions in the system provenance domain, which allows the detection results to be explained in descriptive, human languag
&lt;/p&gt;</description></item></channel></rss>