<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#36890;&#36807;&#32467;&#21512;&#36755;&#20837;&#20984;&#24615;&#21644;Lipschitz&#36830;&#32493;&#24615;&#30340;&#20248;&#21183;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21517;&#20026;&#36755;&#20837;&#20984;&#24615;Lipschitz&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#30340;&#26032;&#22411;&#32593;&#32476;&#32467;&#26500;&#65292;&#22312;&#35745;&#31639;&#25928;&#29575;&#21644;&#23545;&#25239;&#40065;&#26834;&#24615;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#24490;&#29615;&#21333;&#20803;&#65292;&#24182;&#36866;&#29992;&#20110;&#22810;&#31181;&#24037;&#31243;&#20219;&#21153;&#12290;</title><link>http://arxiv.org/abs/2401.07494</link><description>&lt;p&gt;
&#36755;&#20837;&#20984;&#24615;Lipschitz RNN: &#19968;&#31181;&#29992;&#20110;&#24037;&#31243;&#20219;&#21153;&#30340;&#24555;&#36895;&#21644;&#40065;&#26834;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Input Convex Lipschitz RNN: A Fast and Robust Approach for Engineering Tasks. (arXiv:2401.07494v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07494
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#32467;&#21512;&#36755;&#20837;&#20984;&#24615;&#21644;Lipschitz&#36830;&#32493;&#24615;&#30340;&#20248;&#21183;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21517;&#20026;&#36755;&#20837;&#20984;&#24615;Lipschitz&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#30340;&#26032;&#22411;&#32593;&#32476;&#32467;&#26500;&#65292;&#22312;&#35745;&#31639;&#25928;&#29575;&#21644;&#23545;&#25239;&#40065;&#26834;&#24615;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#24490;&#29615;&#21333;&#20803;&#65292;&#24182;&#36866;&#29992;&#20110;&#22810;&#31181;&#24037;&#31243;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#31639;&#25928;&#29575;&#21644;&#23545;&#25239;&#40065;&#26834;&#24615;&#26159;&#30495;&#23454;&#19990;&#30028;&#24037;&#31243;&#24212;&#29992;&#20013;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#30340;&#31070;&#32463;&#32593;&#32476;&#24448;&#24448;&#22312;&#21516;&#26102;&#25110;&#20998;&#21035;&#35299;&#20915;&#36825;&#20004;&#20010;&#38382;&#39064;&#26041;&#38754;&#23384;&#22312;&#19981;&#36275;&#12290;&#36890;&#36807;&#20174;&#33258;&#28982;&#29289;&#29702;&#31995;&#32479;&#21644;&#29616;&#26377;&#25991;&#29486;&#20013;&#33719;&#21462;&#30340;&#35265;&#35299;&#65292;&#24050;&#30693;&#36755;&#20837;&#20984;&#24615;&#32467;&#26500;&#22686;&#24378;&#20102;&#35745;&#31639;&#25928;&#29575;&#65292;&#32780;Lipschitz&#32422;&#26463;&#32467;&#26500;&#22686;&#24378;&#20102;&#23545;&#25239;&#40065;&#26834;&#24615;&#12290;&#36890;&#36807;&#21033;&#29992;&#20984;&#24615;&#21644;Lipschitz&#36830;&#32493;&#24615;&#30340;&#20248;&#28857;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#32593;&#32476;&#32467;&#26500;&#65292;&#31216;&#20026;&#36755;&#20837;&#20984;&#24615;Lipschitz&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#12290;&#35813;&#27169;&#22411;&#22312;&#35745;&#31639;&#25928;&#29575;&#21644;&#23545;&#25239;&#40065;&#26834;&#24615;&#26041;&#38754;&#34920;&#29616;&#20248;&#20110;&#29616;&#26377;&#30340;&#24490;&#29615;&#21333;&#20803;&#65292;&#36866;&#29992;&#20110;&#19968;&#31995;&#21015;&#24037;&#31243;&#20219;&#21153;&#65292;&#21253;&#25324;&#22522;&#20934;MNIST&#22270;&#20687;&#20998;&#31867;&#12289;&#26032;&#21152;&#22369;LHT Holdings&#20844;&#21496;&#30340;&#23454;&#38469;&#22826;&#38451;&#33021;&#20809;&#20239;&#31995;&#32479;&#35268;&#21010;&#20013;&#30340;&#23454;&#26102;&#22826;&#38451;&#36752;&#23556;&#39044;&#27979;&#65292;&#20197;&#21450;&#21270;&#23398;&#21453;&#24212;&#22120;&#30340;&#23454;&#26102;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#20248;&#21270;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
Computational efficiency and adversarial robustness are critical factors in real-world engineering applications. Yet, conventional neural networks often fall short in addressing both simultaneously, or even separately. Drawing insights from natural physical systems and existing literature, it is known that an input convex architecture enhances computational efficiency, while a Lipschitz-constrained architecture bolsters adversarial robustness. By leveraging the strengths of convexity and Lipschitz continuity, we develop a novel network architecture, termed Input Convex Lipschitz Recurrent Neural Networks. This model outperforms existing recurrent units across a spectrum of engineering tasks in terms of computational efficiency and adversarial robustness. These tasks encompass a benchmark MNIST image classification, real-world solar irradiance prediction for Solar PV system planning at LHT Holdings in Singapore, and real-time Model Predictive Control optimization for a chemical reactor.
&lt;/p&gt;</description></item></channel></rss>