<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#19968;&#31181;&#22522;&#20110;&#29983;&#25104;AI&#30340;&#33258;&#21160;&#23398;&#29983;&#21453;&#39304;&#26694;&#26550;&#21487;&#20197;&#25552;&#20379;&#20016;&#23500;&#30340;&#21453;&#39304;&#65292;&#20294;&#24341;&#20837;&#20102;&#20262;&#29702;&#38382;&#39064;&#65292;&#24182;&#38656;&#35201;&#35299;&#20915;&#8220;&#22810;&#25968;&#20154;&#30340;&#26292;&#25919;&#8221;&#21644;&#24573;&#35270;&#38271;&#23614;&#20013;&#23569;&#25968;&#32676;&#20307;&#38656;&#27714;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2308.15334</link><description>&lt;p&gt;
&#19968;&#31181;&#36127;&#36131;&#20219;&#24320;&#21457;&#22522;&#20110;&#29983;&#25104;AI&#30340;&#33258;&#21160;&#23398;&#29983;&#21453;&#39304;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Framework for Responsible Development of Automated Student Feedback with Generative AI. (arXiv:2308.15334v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15334
&lt;/p&gt;
&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#29983;&#25104;AI&#30340;&#33258;&#21160;&#23398;&#29983;&#21453;&#39304;&#26694;&#26550;&#21487;&#20197;&#25552;&#20379;&#20016;&#23500;&#30340;&#21453;&#39304;&#65292;&#20294;&#24341;&#20837;&#20102;&#20262;&#29702;&#38382;&#39064;&#65292;&#24182;&#38656;&#35201;&#35299;&#20915;&#8220;&#22810;&#25968;&#20154;&#30340;&#26292;&#25919;&#8221;&#21644;&#24573;&#35270;&#38271;&#23614;&#20013;&#23569;&#25968;&#32676;&#20307;&#38656;&#27714;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20379;&#20016;&#23500;&#30340;&#21453;&#39304;&#23545;&#20110;&#25903;&#25345;&#23398;&#29983;&#23398;&#20064;&#33267;&#20851;&#37325;&#35201;&#12290;&#26368;&#36817;&#29983;&#25104;AI&#23588;&#20854;&#26159;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#30340;&#36827;&#23637;&#65292;&#20026;&#21521;&#23398;&#29983;&#25552;&#20379;&#21487;&#37325;&#22797;&#12289;&#21487;&#25193;&#23637;&#21644;&#21363;&#26102;&#29983;&#25104;&#30340;&#33258;&#21160;&#21453;&#39304;&#25552;&#20379;&#20102;&#26426;&#20250;&#65292;&#20351;&#24471;&#20043;&#21069;&#31232;&#32570;&#19988;&#26114;&#36149;&#30340;&#23398;&#20064;&#36164;&#28304;&#21464;&#24471;&#20016;&#23500;&#36215;&#26469;&#12290;&#20174;&#25216;&#26415;&#35282;&#24230;&#32780;&#35328;&#65292;&#36825;&#31181;&#26041;&#27861;&#26159;&#21487;&#34892;&#30340;&#65292;&#24471;&#30410;&#20110;&#26368;&#36817;&#20154;&#24037;&#26234;&#33021;&#21644;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#36827;&#27493;&#65307;&#28982;&#32780;&#65292;&#37319;&#29992;&#36825;&#20123;&#25216;&#26415;&#20063;&#24341;&#20837;&#20102;&#19968;&#31995;&#21015;&#28508;&#22312;&#30340;&#20262;&#29702;&#38382;&#39064;&#65292;&#38656;&#35201;&#35748;&#30495;&#32771;&#34385;&#12290;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#30340;&#21560;&#24341;&#21147;&#22312;&#20110;&#23427;&#20204;&#21487;&#20197;&#26377;&#25928;&#22320;&#33258;&#21160;&#21270;&#26368;&#20047;&#21619;&#30340;&#20219;&#21153;&#65307;&#20294;&#26159;&#36825;&#20063;&#21487;&#33021;&#23548;&#33268;&#8220;&#22810;&#25968;&#20154;&#30340;&#26292;&#25919;&#8221;&#65292;&#21363;&#24573;&#35270;&#20102;&#38271;&#23614;&#20013;&#23569;&#25968;&#32676;&#20307;&#30340;&#38656;&#27714;&#65292;&#22240;&#20026;&#36825;&#20123;&#38656;&#27714;&#24456;&#38590;&#33258;&#21160;&#21270;&#12290;&#22240;&#27492;&#65292;&#24320;&#21457;&#33021;&#22815;&#20135;&#29983;&#26377;&#20215;&#20540;&#21644;&#30495;&#23454;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
Providing rich feedback to students is essential for supporting student learning. Recent advances in generative AI, particularly within large language modelling (LLM), provide the opportunity to deliver repeatable, scalable and instant automatically generated feedback to students, making abundant a previously scarce and expensive learning resource. Such an approach is feasible from a technical perspective due to these recent advances in Artificial Intelligence (AI) and Natural Language Processing (NLP); while the potential upside is a strong motivator, doing so introduces a range of potential ethical issues that must be considered as we apply these technologies. The attractiveness of AI systems is that they can effectively automate the most mundane tasks; but this risks introducing a "tyranny of the majority", where the needs of minorities in the long tail are overlooked because they are difficult to automate.  Developing machine learning models that can generate valuable and authentic
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#22320;&#25253;&#32440;&#30340;&#20869;&#23481;&#20250;&#22240;&#20026;&#24403;&#22320; FNC &#35266;&#20247;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#36235;&#21521;&#20110; FNC &#30340;&#20542;&#21521;&#65292;&#24182;&#19988;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#20250;&#26497;&#21270;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;</title><link>http://arxiv.org/abs/2202.07269</link><description>&lt;p&gt;
&#23186;&#20307;&#20542;&#21521;&#26159;&#20855;&#26377;&#20256;&#26579;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Media Slant is Contagious. (arXiv:2202.07269v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07269
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#22320;&#25253;&#32440;&#30340;&#20869;&#23481;&#20250;&#22240;&#20026;&#24403;&#22320; FNC &#35266;&#20247;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#36235;&#21521;&#20110; FNC &#30340;&#20542;&#21521;&#65292;&#24182;&#19988;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#20250;&#26497;&#21270;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#23519;&#20102;&#23186;&#20307;&#20542;&#21521;&#30340;&#20256;&#25773;&#65292;&#20855;&#20307;&#26469;&#35828;&#26159;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#65288;2005-2008&#65289;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110; Fox News Channel&#65288;FNC&#65289;&#12289;CNN &#21644; MSNBC &#20869;&#23481;&#30340;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#25991;&#26412;&#24230;&#37327;&#26041;&#27861;&#65292;&#20998;&#26512;&#22320;&#26041;&#25253;&#32440;&#22914;&#20309;&#37319;&#29992; FNC &#30340;&#20542;&#21521;&#32780;&#19981;&#26159; CNN/MSNBC &#30340;&#20542;&#21521;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22320;&#26041;&#26032;&#38395;&#38543;&#30528;&#24403;&#22320; FNC &#35266;&#20247;&#20154;&#25968;&#30340;&#22806;&#37096;&#22686;&#38271;&#32780;&#21464;&#24471;&#26356;&#21152;&#31867;&#20284;&#20110; FNC &#30340;&#20869;&#23481;&#12290;&#36825;&#31181;&#36716;&#21464;&#19981;&#20165;&#38480;&#20110;&#20174;&#26377;&#32447;&#30005;&#35270;&#20511;&#37492;&#65292;&#32780;&#26159;&#22320;&#26041;&#25253;&#32440;&#33258;&#36523;&#20869;&#23481;&#30340;&#25913;&#21464;&#12290;&#27492;&#22806;&#65292;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#26497;&#21270;&#20102;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine the diffusion of media slant, specifically how partisan content from national cable news affects local newspapers in the U.S., 2005-2008. We use a text-based measure of cable news slant trained on content from Fox News Channel (FNC), CNN, and MSNBC to analyze how local newspapers adopt FNC's slant over CNN/MSNBC's. Our findings show that local news becomes more similar to FNC content in response to an exogenous increase in local FNC viewership. This shift is not limited to borrowing from cable news, but rather, local newspapers' own content changes. Further, cable TV slant polarizes local news content.
&lt;/p&gt;</description></item></channel></rss>