<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;AI&#35780;&#20272;&#37327;&#34920;&#65288;AIAS&#65289;&#30340;&#23454;&#36341;&#24212;&#29992;&#65292;&#36890;&#36807;&#28789;&#27963;&#26694;&#26550;&#23558;GenAI&#25216;&#26415;&#32435;&#20837;&#25945;&#32946;&#35780;&#20272;&#20013;&#65292;&#26174;&#33879;&#38477;&#20302;&#20102;&#19982;GenAI&#30456;&#20851;&#30340;&#23398;&#26415;&#19981;&#31471;&#26696;&#20214;&#65292;&#25552;&#39640;&#20102;&#23398;&#29983;&#30340;&#23398;&#19994;&#25104;&#32489;&#12290;</title><link>https://arxiv.org/abs/2403.14692</link><description>&lt;p&gt;
AI &#35780;&#20272;&#37327;&#34920;&#65288;AIAS&#65289;&#30340;&#23454;&#36341;&#65306;GenAI &#25903;&#25345;&#35780;&#20272;&#30340;&#35797;&#28857;&#23454;&#26045;
&lt;/p&gt;
&lt;p&gt;
The AI Assessment Scale (AIAS) in action: A pilot implementation of GenAI supported assessment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14692
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;AI&#35780;&#20272;&#37327;&#34920;&#65288;AIAS&#65289;&#30340;&#23454;&#36341;&#24212;&#29992;&#65292;&#36890;&#36807;&#28789;&#27963;&#26694;&#26550;&#23558;GenAI&#25216;&#26415;&#32435;&#20837;&#25945;&#32946;&#35780;&#20272;&#20013;&#65292;&#26174;&#33879;&#38477;&#20302;&#20102;&#19982;GenAI&#30456;&#20851;&#30340;&#23398;&#26415;&#19981;&#31471;&#26696;&#20214;&#65292;&#25552;&#39640;&#20102;&#23398;&#29983;&#30340;&#23398;&#19994;&#25104;&#32489;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#39640;&#31561;&#25945;&#32946;&#20013;&#24555;&#36895;&#37319;&#29992;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#65288;GenAI&#65289;&#25216;&#26415;&#24341;&#21457;&#20102;&#23545;&#23398;&#26415;&#35802;&#20449;&#12289;&#35780;&#20272;&#23454;&#36341;&#21644;&#23398;&#29983;&#23398;&#20064;&#30340;&#20851;&#27880;&#12290;&#31105;&#27490;&#25110;&#38459;&#27490;GenAI&#24037;&#20855;&#24050;&#34987;&#35777;&#26126;&#26159;&#26080;&#25928;&#30340;&#65292;&#24809;&#32602;&#24615;&#26041;&#27861;&#24573;&#30053;&#20102;&#36825;&#20123;&#25216;&#26415;&#30340;&#28508;&#22312;&#22909;&#22788;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#33521;&#22269;&#36234;&#21335;&#22823;&#23398;&#65288;BUV&#65289;&#36827;&#34892;&#30340;&#35797;&#28857;&#30740;&#31350;&#30340;&#32467;&#26524;&#65292;&#25506;&#35752;&#20102;&#20154;&#24037;&#26234;&#33021;&#35780;&#20272;&#37327;&#34920;&#65288;AIAS&#65289;&#30340;&#23454;&#26045;&#65292;&#36825;&#26159;&#19968;&#20010;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#23558;GenAI&#32435;&#20837;&#25945;&#32946;&#35780;&#20272;&#20013;&#12290;AIAS&#30001;&#20116;&#20010;&#32423;&#21035;&#32452;&#25104;&#65292;&#20174;&#8220;&#26080;AI&#8221;&#21040;&#8220;&#23436;&#20840;AI&#8221;&#65292;&#20351;&#25945;&#32946;&#24037;&#20316;&#32773;&#33021;&#22815;&#35774;&#35745;&#20391;&#37325;&#20110;&#38656;&#35201;&#20154;&#31867;&#36755;&#20837;&#21644;&#25209;&#21028;&#24615;&#24605;&#32500;&#30340;&#35780;&#20272;&#12290;&#22312;&#23454;&#26045;AIAS&#21518;&#65292;&#35797;&#28857;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#19982;GenAI&#30456;&#20851;&#30340;&#23398;&#26415;&#19981;&#31471;&#26696;&#20214;&#26174;&#30528;&#20943;&#23569;&#65292;&#23398;&#29983;&#25104;&#32489;&#25552;&#39640;&#20102;5.9%&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14692v1 Announce Type: cross  Abstract: The rapid adoption of Generative Artificial Intelligence (GenAI) technologies in higher education has raised concerns about academic integrity, assessment practices, and student learning. Banning or blocking GenAI tools has proven ineffective, and punitive approaches ignore the potential benefits of these technologies. This paper presents the findings of a pilot study conducted at British University Vietnam (BUV) exploring the implementation of the Artificial Intelligence Assessment Scale (AIAS), a flexible framework for incorporating GenAI into educational assessments. The AIAS consists of five levels, ranging from 'No AI' to 'Full AI', enabling educators to design assessments that focus on areas requiring human input and critical thinking.   Following the implementation of the AIAS, the pilot study results indicate a significant reduction in academic misconduct cases related to GenAI, a 5.9% increase in student attainment across the 
&lt;/p&gt;</description></item></channel></rss>