<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>FairTargetSim&#25552;&#20379;&#20102;&#19968;&#20010;&#20132;&#20114;&#24335;&#27169;&#25311;&#22120;&#65292;&#23637;&#31034;&#20102;&#30446;&#26631;&#21464;&#37327;&#23450;&#20041;&#23545;&#20844;&#24179;&#24615;&#30340;&#24433;&#21709;&#65292;&#36866;&#29992;&#20110;&#31639;&#27861;&#24320;&#21457;&#32773;&#12289;&#30740;&#31350;&#20154;&#21592;&#21644;&#38750;&#25216;&#26415;&#21033;&#30410;&#30456;&#20851;&#32773;&#12290;</title><link>https://arxiv.org/abs/2403.06031</link><description>&lt;p&gt;
FairTargetSim&#65306;&#29992;&#20110;&#29702;&#35299;&#21644;&#35299;&#37322;&#30446;&#26631;&#21464;&#37327;&#23450;&#20041;&#20844;&#24179;&#24615;&#24433;&#21709;&#30340;&#20132;&#20114;&#24335;&#27169;&#25311;&#22120;
&lt;/p&gt;
&lt;p&gt;
FairTargetSim: An Interactive Simulator for Understanding and Explaining the Fairness Effects of Target Variable Definition
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06031
&lt;/p&gt;
&lt;p&gt;
FairTargetSim&#25552;&#20379;&#20102;&#19968;&#20010;&#20132;&#20114;&#24335;&#27169;&#25311;&#22120;&#65292;&#23637;&#31034;&#20102;&#30446;&#26631;&#21464;&#37327;&#23450;&#20041;&#23545;&#20844;&#24179;&#24615;&#30340;&#24433;&#21709;&#65292;&#36866;&#29992;&#20110;&#31639;&#27861;&#24320;&#21457;&#32773;&#12289;&#30740;&#31350;&#20154;&#21592;&#21644;&#38750;&#25216;&#26415;&#21033;&#30410;&#30456;&#20851;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#38656;&#35201;&#20026;&#39044;&#27979;&#25110;&#20915;&#31574;&#23450;&#20041;&#30446;&#26631;&#21464;&#37327;&#65292;&#36825;&#20010;&#36807;&#31243;&#21487;&#33021;&#23545;&#20844;&#24179;&#24615;&#20135;&#29983;&#28145;&#36828;&#24433;&#21709;&#65306;&#20559;&#35265;&#36890;&#24120;&#24050;&#32463;&#34987;&#32534;&#30721;&#22312;&#30446;&#26631;&#21464;&#37327;&#23450;&#20041;&#26412;&#36523;&#20013;&#65292;&#32780;&#19981;&#26159;&#22312;&#20219;&#20309;&#25968;&#25454;&#25910;&#38598;&#25110;&#35757;&#32451;&#20043;&#21069;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20132;&#20114;&#24335;&#27169;&#25311;&#22120;&#65292;FairTargetSim (FTS)&#65292;&#23637;&#31034;&#20102;&#30446;&#26631;&#21464;&#37327;&#23450;&#20041;&#22914;&#20309;&#24433;&#21709;&#20844;&#24179;&#24615;&#12290;FTS&#26159;&#19968;&#20010;&#26377;&#20215;&#20540;&#30340;&#24037;&#20855;&#65292;&#36866;&#29992;&#20110;&#31639;&#27861;&#24320;&#21457;&#32773;&#12289;&#30740;&#31350;&#20154;&#21592;&#21644;&#38750;&#25216;&#26415;&#21033;&#30410;&#30456;&#20851;&#32773;&#12290;FTS&#20351;&#29992;&#20102;&#31639;&#27861;&#25307;&#32856;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#20351;&#29992;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#21644;&#29992;&#25143;&#23450;&#20041;&#30340;&#30446;&#26631;&#21464;&#37327;&#12290;FTS&#26159;&#24320;&#28304;&#30340;&#65292;&#21487;&#22312;&#20197;&#19979;&#32593;&#22336;&#25214;&#21040;&#65306;http://tinyurl.com/ftsinterface&#12290;&#26412;&#25991;&#38468;&#24102;&#30340;&#35270;&#39057;&#32593;&#22336;&#20026;&#65306;http://tinyurl.com/ijcaifts&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06031v1 Announce Type: cross  Abstract: Machine learning requires defining one's target variable for predictions or decisions, a process that can have profound implications on fairness: biases are often encoded in target variable definition itself, before any data collection or training. We present an interactive simulator, FairTargetSim (FTS), that illustrates how target variable definition impacts fairness. FTS is a valuable tool for algorithm developers, researchers, and non-technical stakeholders. FTS uses a case study of algorithmic hiring, using real-world data and user-defined target variables. FTS is open-source and available at: http://tinyurl.com/ftsinterface. The video accompanying this paper is here: http://tinyurl.com/ijcaifts.
&lt;/p&gt;</description></item></channel></rss>