<rss version="2.0"><channel><title>Chat Arxiv cs.CE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#25193;&#23637;&#25628;&#32034;&#31354;&#38388;&#21644;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;&#20844;&#24335;&#21270;alpha&#38598;&#26469;&#29983;&#25104;&#21327;&#21516;&#20844;&#24335;&#21270;alpha&#22240;&#23376;&#65292;&#20174;&#32780;&#25552;&#39640;&#37327;&#21270;&#20132;&#26131;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.02710</link><description>&lt;p&gt;
&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#37327;&#21270;&#20132;&#26131;&#20013;&#21327;&#21516;&#20844;&#24335;Alpha&#29983;&#25104;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Synergistic Formulaic Alpha Generation for Quantitative Trading based on Reinforcement Learning. (arXiv:2401.02710v1 [cs.CE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.02710
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#25193;&#23637;&#25628;&#32034;&#31354;&#38388;&#21644;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;&#20844;&#24335;&#21270;alpha&#38598;&#26469;&#29983;&#25104;&#21327;&#21516;&#20844;&#24335;&#21270;alpha&#22240;&#23376;&#65292;&#20174;&#32780;&#25552;&#39640;&#37327;&#21270;&#20132;&#26131;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#24335;&#21270;alpha&#22240;&#23376;&#30340;&#25366;&#25496;&#26159;&#25351;&#22312;&#32929;&#31080;&#24066;&#22330;&#20013;&#21457;&#29616;&#21644;&#24320;&#21457;&#29305;&#23450;&#30340;&#22240;&#23376;&#25110;&#25351;&#26631;&#65288;&#31216;&#20026;alpha&#22240;&#23376;&#65289;&#20197;&#29992;&#20110;&#37327;&#21270;&#20132;&#26131;&#30340;&#36807;&#31243;&#12290;&#20026;&#20102;&#22312;&#24222;&#22823;&#30340;&#25628;&#32034;&#31354;&#38388;&#20013;&#39640;&#25928;&#22320;&#21457;&#29616;alpha&#22240;&#23376;&#65292;&#24120;&#24120;&#37319;&#29992;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#26041;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#25193;&#23637;&#25628;&#32034;&#31354;&#38388;&#24182;&#21033;&#29992;&#39044;&#35757;&#32451;&#30340;&#20844;&#24335;&#21270;alpha&#38598;&#20316;&#20026;&#21021;&#22987;&#31181;&#23376;&#20540;&#26469;&#29983;&#25104;&#21327;&#21516;&#20844;&#24335;&#21270;alpha&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#20449;&#24687;&#31995;&#25968;&#65288;IC&#65289;&#21644;&#25490;&#21517;&#20449;&#24687;&#31995;&#25968;&#65288;Rank IC&#65289;&#20316;&#20026;&#27169;&#22411;&#30340;&#24615;&#33021;&#35780;&#20272;&#25351;&#26631;&#12290;&#36890;&#36807;&#20351;&#29992;CSI300&#24066;&#22330;&#25968;&#25454;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#23454;&#38469;&#25237;&#36164;&#27169;&#25311;&#65292;&#24182;&#35266;&#23519;&#21040;&#19982;&#29616;&#26377;&#25216;&#26415;&#30456;&#27604;&#30340;&#26174;&#33879;&#24615;&#33021;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mining of formulaic alpha factors refers to the process of discovering and developing specific factors or indicators (referred to as alpha factors) for quantitative trading in stock market. To efficiently discover alpha factors in vast search space, reinforcement learning (RL) is commonly employed. This paper proposes a method to enhance existing alpha factor mining approaches by expanding a search space and utilizing pretrained formulaic alpha set as initial seed values to generate synergistic formulaic alpha. We employ information coefficient (IC) and rank information coefficient (Rank IC) as performance evaluation metrics for the model. Using CSI300 market data, we conducted real investment simulations and observed significant performance improvement compared to existing techniques.
&lt;/p&gt;</description></item></channel></rss>