<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20844;&#24179;&#26694;&#26550;&#8212;&#8212;&#32771;&#34385;&#25919;&#31574;&#20248;&#21270;&#21738;&#20010;&#25928;&#29992;&#65292;&#23450;&#20041;&#20102;&#20449;&#24687;&#20215;&#20540;&#20844;&#24179;&#65292;&#25552;&#20986;&#19981;&#24212;&#20351;&#29992;&#19981;&#28385;&#36275;&#36825;&#19968;&#26631;&#20934;&#30340;&#23454;&#29992;&#31243;&#24207;&#65292;&#24182;&#25506;&#35752;&#20102;&#20462;&#25913;&#23454;&#29992;&#31243;&#24207;&#20197;&#28385;&#36275;&#27492;&#20844;&#24179;&#26631;&#20934;&#21487;&#33021;&#23545;&#26368;&#20248;&#25919;&#31574;&#20135;&#29983;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.00636</link><description>&lt;p&gt;
&#19981;&#20844;&#24179;&#30340;&#23454;&#29992;&#31243;&#24207;&#21450;&#20854;&#25913;&#36827;&#30340;&#31532;&#19968;&#27493;
&lt;/p&gt;
&lt;p&gt;
Unfair Utilities and First Steps Towards Improving Them. (arXiv:2306.00636v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00636
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20844;&#24179;&#26694;&#26550;&#8212;&#8212;&#32771;&#34385;&#25919;&#31574;&#20248;&#21270;&#21738;&#20010;&#25928;&#29992;&#65292;&#23450;&#20041;&#20102;&#20449;&#24687;&#20215;&#20540;&#20844;&#24179;&#65292;&#25552;&#20986;&#19981;&#24212;&#20351;&#29992;&#19981;&#28385;&#36275;&#36825;&#19968;&#26631;&#20934;&#30340;&#23454;&#29992;&#31243;&#24207;&#65292;&#24182;&#25506;&#35752;&#20102;&#20462;&#25913;&#23454;&#29992;&#31243;&#24207;&#20197;&#28385;&#36275;&#27492;&#20844;&#24179;&#26631;&#20934;&#21487;&#33021;&#23545;&#26368;&#20248;&#25919;&#31574;&#20135;&#29983;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20844;&#24179;&#26631;&#20934;&#23545;&#25919;&#31574;&#25110;&#39044;&#27979;&#22120;&#30340;&#36873;&#25321;&#36827;&#34892;&#38480;&#21046;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#21516;&#30340;&#24605;&#32771;&#20844;&#24179;&#30340;&#26694;&#26550;&#65306;&#25105;&#20204;&#32771;&#34385;&#25919;&#31574;&#27491;&#22312;&#20248;&#21270;&#21738;&#20010;&#25928;&#29992;&#65292;&#32780;&#19981;&#26159;&#38480;&#21046;&#25919;&#31574;&#25110;&#39044;&#27979;&#22120;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#20449;&#24687;&#20215;&#20540;&#20844;&#24179;&#65292;&#24182;&#24314;&#35758;&#19981;&#20351;&#29992;&#19981;&#28385;&#36275;&#27492;&#26631;&#20934;&#30340;&#23454;&#29992;&#31243;&#24207;&#12290;&#25105;&#20204;&#25551;&#36848;&#20102;&#22914;&#20309;&#20462;&#25913;&#23454;&#29992;&#31243;&#24207;&#20197;&#28385;&#36275;&#36825;&#31181;&#20844;&#24179;&#26631;&#20934;&#65292;&#24182;&#35752;&#35770;&#20102;&#36825;&#21487;&#33021;&#23545;&#30456;&#24212;&#30340;&#26368;&#20248;&#25919;&#31574;&#20135;&#29983;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many fairness criteria constrain the policy or choice of predictors. In this work, we propose a different framework for thinking about fairness: Instead of constraining the policy or choice of predictors, we consider which utility a policy is optimizing for. We define value of information fairness and propose to not use utilities that do not satisfy this criterion. We describe how to modify a utility to satisfy this fairness criterion and discuss the consequences this might have on the corresponding optimal policies.
&lt;/p&gt;</description></item></channel></rss>