<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#23558;&#34920;&#24449;&#31354;&#38388;&#30340;&#21453;&#20107;&#23454;&#36716;&#21270;&#20026;&#33258;&#28982;&#35821;&#35328;&#65292;&#20197;&#20998;&#26512;&#21644;&#35299;&#37322;&#27169;&#22411;&#24178;&#39044;&#25152;&#24341;&#36215;&#30340;&#35821;&#35328;&#21464;&#21270;&#65292;&#24182;&#20943;&#36731;&#20998;&#31867;&#20013;&#30340;&#20559;&#35265;&#12290;</title><link>https://arxiv.org/abs/2402.11355</link><description>&lt;p&gt;
&#25913;&#21464;&#20102;&#20160;&#20040;&#65311;&#23558;&#34920;&#24449;&#24178;&#39044;&#36716;&#21270;&#20026;&#33258;&#28982;&#35821;&#35328;
&lt;/p&gt;
&lt;p&gt;
What Changed? Converting Representational Interventions to Natural Language
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11355
&lt;/p&gt;
&lt;p&gt;
&#23558;&#34920;&#24449;&#31354;&#38388;&#30340;&#21453;&#20107;&#23454;&#36716;&#21270;&#20026;&#33258;&#28982;&#35821;&#35328;&#65292;&#20197;&#20998;&#26512;&#21644;&#35299;&#37322;&#27169;&#22411;&#24178;&#39044;&#25152;&#24341;&#36215;&#30340;&#35821;&#35328;&#21464;&#21270;&#65292;&#24182;&#20943;&#36731;&#20998;&#31867;&#20013;&#30340;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#35821;&#35328;&#27169;&#22411;&#65288;LMs&#65289;&#34920;&#24449;&#31354;&#38388;&#30340;&#24178;&#39044;&#26041;&#27861;&#24050;&#32463;&#34987;&#35777;&#26126;&#26159;&#24433;&#21709;&#27169;&#22411;&#34892;&#20026;&#30340;&#26377;&#25928;&#25163;&#27573;&#12290;&#36825;&#20123;&#26041;&#27861;&#34987;&#29992;&#26469;&#28040;&#38500;&#25110;&#25913;&#21464;&#27169;&#22411;&#34920;&#31034;&#20013;&#30340;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#65288;&#22914;&#24615;&#21035;&#65289;&#30340;&#32534;&#30721;&#65292;&#21019;&#24314;&#19968;&#20010;&#21453;&#20107;&#23454;&#30340;&#34920;&#31034;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#24178;&#39044;&#25805;&#20316;&#22312;&#34920;&#31034;&#31354;&#38388;&#20869;&#65292;&#20934;&#30830;&#29702;&#35299;&#23427;&#20462;&#25913;&#20102;&#21738;&#20123;&#29305;&#24449;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#34920;&#24449;&#31354;&#38388;&#30340;&#21453;&#20107;&#23454;&#21487;&#20197;&#36716;&#21270;&#20026;&#33258;&#28982;&#35821;&#35328;&#30340;&#21453;&#20107;&#23454;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#20998;&#26512;&#23545;&#24212;&#20110;&#32473;&#23450;&#34920;&#31034;&#31354;&#38388;&#24178;&#39044;&#30340;&#35821;&#35328;&#21464;&#21270;&#65292;&#24182;&#35299;&#37322;&#29992;&#20110;&#32534;&#30721;&#29305;&#23450;&#27010;&#24565;&#30340;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#30001;&#27492;&#20135;&#29983;&#30340;&#21453;&#20107;&#23454;&#21487;&#20197;&#29992;&#20110;&#20943;&#36731;&#20998;&#31867;&#20013;&#30340;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11355v1 Announce Type: new  Abstract: Interventions targeting the representation space of language models (LMs) have emerged as effective means to influence model behavior. These methods are employed, for example, to eliminate or alter the encoding of demographic information such as gender within the model's representations, creating a counterfactual representation. However, since the intervention operates within the representation space, understanding precisely which features it modifies poses a challenge. We show that representation-space counterfactuals can be converted into natural language counterfactuals. We demonstrate that this approach enables us to analyze the linguistic alterations corresponding to a given representation-space intervention and to interpret the features utilized for encoding a specific concept. Moreover, the resulting counterfactuals can be used to mitigate bias in classification.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#22120;&#36741;&#21161;&#30340;&#28151;&#21512;&#26041;&#27861;&#26694;&#26550;&#65292;&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#22312;&#20154;&#25991;&#31038;&#31185;&#39046;&#22495;&#30340;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#28508;&#21147;&#65292;&#23637;&#31034;&#20102;16&#20010;&#26696;&#20363;&#30740;&#31350;&#65292;&#24182;&#28085;&#30422;&#20102;&#22810;&#31181;&#20219;&#21153;&#65292;&#21253;&#25324;&#35821;&#35328;&#20998;&#26512;&#12289;&#25991;&#26412;&#25366;&#25496;&#12289;&#31038;&#20132;&#32593;&#32476;&#25512;&#26029;&#31561;&#12290;</title><link>http://arxiv.org/abs/2309.14379</link><description>&lt;p&gt;
&#26426;&#22120;&#36741;&#21161;&#30340;&#28151;&#21512;&#26041;&#27861;&#65306;&#29992;&#20154;&#24037;&#26234;&#33021;&#22686;&#24378;&#20154;&#25991;&#31038;&#31185;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Machine-assisted mixed methods: augmenting humanities and social sciences with artificial intelligence. (arXiv:2309.14379v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14379
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#22120;&#36741;&#21161;&#30340;&#28151;&#21512;&#26041;&#27861;&#26694;&#26550;&#65292;&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#22312;&#20154;&#25991;&#31038;&#31185;&#39046;&#22495;&#30340;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;&#28508;&#21147;&#65292;&#23637;&#31034;&#20102;16&#20010;&#26696;&#20363;&#30740;&#31350;&#65292;&#24182;&#28085;&#30422;&#20102;&#22810;&#31181;&#20219;&#21153;&#65292;&#21253;&#25324;&#35821;&#35328;&#20998;&#26512;&#12289;&#25991;&#26412;&#25366;&#25496;&#12289;&#31038;&#20132;&#32593;&#32476;&#25512;&#26029;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30340;&#19981;&#26029;&#36827;&#21270;&#20026;&#20154;&#25991;&#31038;&#31185;&#39046;&#22495;&#30340;&#25968;&#25454;&#20998;&#26512;&#25552;&#20379;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#26426;&#20250;&#65292;&#33021;&#22815;&#22312;&#20197;&#21069;&#36890;&#24120;&#30001;&#20154;&#21147;&#23436;&#25104;&#30340;&#23450;&#24615;&#20998;&#26512;&#20219;&#21153;&#20013;&#23454;&#29616;&#35268;&#27169;&#21270;&#12289;&#33258;&#21160;&#21270;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31995;&#32479;&#30340;&#28151;&#21512;&#26041;&#27861;&#26694;&#26550;&#65292;&#20197;&#21033;&#29992;&#23450;&#24615;&#20998;&#26512;&#19987;&#19994;&#30693;&#35782;&#12289;&#26426;&#22120;&#30340;&#21487;&#25193;&#23637;&#24615;&#21644;&#20005;&#35880;&#30340;&#37327;&#21270;&#26041;&#27861;&#65292;&#21516;&#26102;&#27880;&#37325;&#36879;&#26126;&#24230;&#21644;&#21487;&#22797;&#21046;&#24615;&#12290;&#30740;&#31350;&#23637;&#31034;&#20102;16&#20010;&#26426;&#22120;&#36741;&#21161;&#30340;&#26696;&#20363;&#30740;&#31350;&#20316;&#20026;&#27010;&#24565;&#39564;&#35777;&#12290;&#20219;&#21153;&#21253;&#25324;&#35821;&#35328;&#21644;&#35805;&#35821;&#20998;&#26512;&#12289;&#35789;&#27719;&#35821;&#20041;&#21464;&#21270;&#26816;&#27979;&#12289;&#37319;&#35775;&#20998;&#26512;&#12289;&#21382;&#21490;&#20107;&#20214;&#22240;&#26524;&#25512;&#26029;&#21644;&#25991;&#26412;&#25366;&#25496;&#12289;&#25919;&#27835;&#31435;&#22330;&#26816;&#27979;&#12289;&#25991;&#26412;&#21644;&#24605;&#24819;&#37325;&#22797;&#20351;&#29992;&#12289;&#25991;&#23398;&#21644;&#30005;&#24433;&#20013;&#30340;&#25991;&#31867;&#26500;&#25104;&#12289;&#31038;&#20132;&#32593;&#32476;&#25512;&#26029;&#12289;&#33258;&#21160;&#35789;&#20856;&#32534;&#32386;&#12289;&#20803;&#25968;&#25454;&#34917;&#20805;&#21644;&#22810;&#27169;&#24577;&#35270;&#35273;&#25991;&#21270;&#20998;&#26512;&#12290;&#19982;&#29616;&#26377;LLM&#24212;&#29992;&#25991;&#29486;&#20013;&#23545;&#33521;&#25991;&#30340;&#20851;&#27880;&#19981;&#21516;&#65292;&#26412;&#30740;&#31350;&#28085;&#30422;&#22810;&#31181;&#35821;&#35328;&#12290;
&lt;/p&gt;
&lt;p&gt;
The increasing capacities of large language models (LLMs) present an unprecedented opportunity to scale up data analytics in the humanities and social sciences, augmenting and automating qualitative analytic tasks previously typically allocated to human labor. This contribution proposes a systematic mixed methods framework to harness qualitative analytic expertise, machine scalability, and rigorous quantification, with attention to transparency and replicability. 16 machine-assisted case studies are showcased as proof of concept. Tasks include linguistic and discourse analysis, lexical semantic change detection, interview analysis, historical event cause inference and text mining, detection of political stance, text and idea reuse, genre composition in literature and film; social network inference, automated lexicography, missing metadata augmentation, and multimodal visual cultural analytics. In contrast to the focus on English in the emerging LLM applicability literature, many exampl
&lt;/p&gt;</description></item></channel></rss>