<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MMP-Attack&#30340;&#26377;&#38024;&#23545;&#24615;&#25915;&#20987;&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#25991;&#26412;&#21644;&#22270;&#20687;&#29305;&#24449;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26377;&#25928;&#22320;&#25915;&#20987;&#21830;&#19994;&#25991;&#26412;&#21040;&#22270;&#20687;&#27169;&#22411;&#65292;&#24182;&#19988;&#20855;&#26377;&#26356;&#39640;&#30340;&#26222;&#36866;&#24615;&#21644;&#21487;&#36716;&#31227;&#24615;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01369</link><description>&lt;p&gt;
&#20351;&#29992;&#22810;&#27169;&#24335;&#20808;&#39564;&#30340;&#26377;&#38024;&#23545;&#24615;&#25915;&#20987;&#25991;&#26412;&#21040;&#22270;&#20687;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Cheating Suffix: Targeted Attack to Text-To-Image Diffusion Models with Multi-Modal Priors
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01369
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MMP-Attack&#30340;&#26377;&#38024;&#23545;&#24615;&#25915;&#20987;&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#25991;&#26412;&#21644;&#22270;&#20687;&#29305;&#24449;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26377;&#25928;&#22320;&#25915;&#20987;&#21830;&#19994;&#25991;&#26412;&#21040;&#22270;&#20687;&#27169;&#22411;&#65292;&#24182;&#19988;&#20855;&#26377;&#26356;&#39640;&#30340;&#26222;&#36866;&#24615;&#21644;&#21487;&#36716;&#31227;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#24050;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#31181;&#22270;&#20687;&#29983;&#25104;&#20219;&#21153;&#20013;&#65292;&#23637;&#29616;&#20102;&#22270;&#20687;&#21644;&#25991;&#26412;&#27169;&#24577;&#20043;&#38388;&#30340;&#21331;&#36234;&#32852;&#31995;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#38754;&#20020;&#30528;&#34987;&#24694;&#24847;&#21033;&#29992;&#30340;&#25361;&#25112;&#65292;&#36890;&#36807;&#22312;&#21407;&#22987;&#25552;&#31034;&#21518;&#38468;&#21152;&#29305;&#23450;&#21518;&#32512;&#26469;&#29983;&#25104;&#26377;&#23475;&#25110;&#25935;&#24863;&#22270;&#20687;&#12290;&#29616;&#26377;&#20316;&#21697;&#20027;&#35201;&#20851;&#27880;&#20351;&#29992;&#21333;&#27169;&#24577;&#20449;&#24687;&#36827;&#34892;&#25915;&#20987;&#65292;&#26410;&#33021;&#21033;&#29992;&#22810;&#27169;&#24577;&#29305;&#24449;&#65292;&#23548;&#33268;&#24615;&#33021;&#19981;&#23613;&#22914;&#20154;&#24847;&#12290;&#22312;&#26412;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MMP-Attack&#30340;&#26377;&#38024;&#23545;&#24615;&#25915;&#20987;&#26041;&#27861;&#65292;&#23427;&#23558;&#22810;&#27169;&#24577;&#20808;&#39564;&#65288;MMP&#65289;&#21363;&#25991;&#26412;&#21644;&#22270;&#20687;&#29305;&#24449;&#36827;&#34892;&#25972;&#21512;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;MMP-Attack&#30340;&#30446;&#26631;&#26159;&#22312;&#22270;&#20687;&#20869;&#23481;&#20013;&#28155;&#21152;&#30446;&#26631;&#23545;&#35937;&#30340;&#21516;&#26102;&#65292;&#21516;&#26102;&#31227;&#38500;&#21407;&#22987;&#23545;&#35937;&#12290;&#19982;&#29616;&#26377;&#20316;&#21697;&#30456;&#27604;&#65292;MMP-Attack&#20855;&#26377;&#26356;&#39640;&#30340;&#26222;&#36866;&#24615;&#21644;&#21487;&#36716;&#31227;&#24615;&#65292;&#22312;&#25915;&#20987;&#21830;&#19994;&#25991;&#26412;&#21040;&#22270;&#20687;&#65288;T2I&#65289;&#27169;&#22411;&#65288;&#22914;DALL-E 3&#65289;&#26041;&#38754;&#34920;&#29616;&#20986;&#26126;&#26174;&#20248;&#21183;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#36825;&#26631;&#24535;&#30528;&#24403;&#21069;&#26368;&#20339;&#30340;&#25216;&#26415;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
Diffusion models have been widely deployed in various image generation tasks, demonstrating an extraordinary connection between image and text modalities. However, they face challenges of being maliciously exploited to generate harmful or sensitive images by appending a specific suffix to the original prompt. Existing works mainly focus on using single-modal information to conduct attacks, which fails to utilize multi-modal features and results in less than satisfactory performance. Integrating multi-modal priors (MMP), i.e. both text and image features, we propose a targeted attack method named MMP-Attack in this work. Specifically, the goal of MMP-Attack is to add a target object into the image content while simultaneously removing the original object. The MMP-Attack shows a notable advantage over existing works with superior universality and transferability, which can effectively attack commercial text-to-image (T2I) models such as DALL-E 3. To the best of our knowledge, this marks 
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#35780;&#20272;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#24773;&#20917;&#12290;&#35780;&#20272;&#25581;&#31034;&#20102;&#20004;&#20010;&#37325;&#35201;&#21457;&#29616;&#65306;&#22810;&#26102;&#24207;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#26377;&#25928;&#24615;&#65292;&#22810;&#31354;&#38388;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#25928;&#26524;&#12290;&#36825;&#31687;&#35770;&#25991;&#36824;&#35780;&#20272;&#20102;&#20004;&#31181;&#38450;&#24481;&#26426;&#21046;&#30340;&#25928;&#29992;&#21644;&#38544;&#31169;&#26435;&#34913;&#12290;</title><link>https://arxiv.org/abs/2402.06289</link><description>&lt;p&gt;
&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35780;&#20272;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#21644;&#38450;&#24481;
&lt;/p&gt;
&lt;p&gt;
Evaluating Membership Inference Attacks and Defenses in Federated Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06289
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#35780;&#20272;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#21644;&#38450;&#24481;&#30340;&#24773;&#20917;&#12290;&#35780;&#20272;&#25581;&#31034;&#20102;&#20004;&#20010;&#37325;&#35201;&#21457;&#29616;&#65306;&#22810;&#26102;&#24207;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#26377;&#25928;&#24615;&#65292;&#22810;&#31354;&#38388;&#30340;&#27169;&#22411;&#20449;&#24687;&#26377;&#21161;&#20110;&#25552;&#39640;&#25915;&#20987;&#30340;&#25928;&#26524;&#12290;&#36825;&#31687;&#35770;&#25991;&#36824;&#35780;&#20272;&#20102;&#20004;&#31181;&#38450;&#24481;&#26426;&#21046;&#30340;&#25928;&#29992;&#21644;&#38544;&#31169;&#26435;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;(MIAs)&#23545;&#20110;&#38544;&#31169;&#20445;&#25252;&#30340;&#23041;&#32961;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#26085;&#30410;&#22686;&#38271;&#12290;&#21322;&#35802;&#23454;&#30340;&#25915;&#20987;&#32773;&#65292;&#20363;&#22914;&#26381;&#21153;&#22120;&#65292;&#21487;&#20197;&#26681;&#25454;&#35266;&#23519;&#21040;&#30340;&#27169;&#22411;&#20449;&#24687;&#30830;&#23450;&#19968;&#20010;&#29305;&#23450;&#26679;&#26412;&#26159;&#21542;&#23646;&#20110;&#30446;&#26631;&#23458;&#25143;&#31471;&#12290;&#26412;&#25991;&#23545;&#29616;&#26377;&#30340;MIAs&#21644;&#30456;&#24212;&#30340;&#38450;&#24481;&#31574;&#30053;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#25105;&#20204;&#23545;MIAs&#30340;&#35780;&#20272;&#25581;&#31034;&#20102;&#20004;&#20010;&#37325;&#35201;&#21457;&#29616;&#12290;&#39318;&#20808;&#65292;&#32467;&#21512;&#22810;&#20010;&#36890;&#20449;&#36718;&#27425;&#30340;&#27169;&#22411;&#20449;&#24687;(&#22810;&#26102;&#24207;)&#30456;&#27604;&#20110;&#21033;&#29992;&#21333;&#20010;&#26102;&#26399;&#30340;&#27169;&#22411;&#20449;&#24687;&#25552;&#39640;&#20102;MIAs&#30340;&#25972;&#20307;&#26377;&#25928;&#24615;&#12290;&#20854;&#27425;&#65292;&#22312;&#38750;&#30446;&#26631;&#23458;&#25143;&#31471;(Multi-spatial)&#20013;&#34701;&#20837;&#27169;&#22411;&#26174;&#33879;&#25552;&#39640;&#20102;MIAs&#30340;&#25928;&#26524;&#65292;&#29305;&#21035;&#26159;&#24403;&#23458;&#25143;&#31471;&#30340;&#25968;&#25454;&#26159;&#21516;&#36136;&#30340;&#26102;&#20505;&#12290;&#36825;&#20984;&#26174;&#20102;&#22312;MIAs&#20013;&#32771;&#34385;&#26102;&#24207;&#21644;&#31354;&#38388;&#27169;&#22411;&#20449;&#24687;&#30340;&#37325;&#35201;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36890;&#36807;&#38544;&#31169;-&#25928;&#29992;&#26435;&#34913;&#35780;&#20272;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#38450;&#24481;&#26426;&#21046;&#23545;MIAs&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Membership Inference Attacks (MIAs) pose a growing threat to privacy preservation in federated learning. The semi-honest attacker, e.g., the server, may determine whether a particular sample belongs to a target client according to the observed model information. This paper conducts an evaluation of existing MIAs and corresponding defense strategies. Our evaluation on MIAs reveals two important findings about the trend of MIAs. Firstly, combining model information from multiple communication rounds (Multi-temporal) enhances the overall effectiveness of MIAs compared to utilizing model information from a single epoch. Secondly, incorporating models from non-target clients (Multi-spatial) significantly improves the effectiveness of MIAs, particularly when the clients' data is homogeneous. This highlights the importance of considering the temporal and spatial model information in MIAs. Next, we assess the effectiveness via privacy-utility tradeoff for two type defense mechanisms against MI
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#35780;&#20272;&#20102;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#33258;&#36866;&#24212;&#24033;&#33322;&#25511;&#21046;&#31995;&#32479;&#22312;&#38544;&#34109;&#24863;&#30693;&#25915;&#20987;&#19979;&#30340;&#23433;&#20840;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19978;&#19979;&#25991;&#24863;&#30693;&#31574;&#30053;&#21644;&#22522;&#20110;&#20248;&#21270;&#30340;&#22270;&#20687;&#25200;&#21160;&#29983;&#25104;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.08939</link><description>&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#33258;&#36866;&#24212;&#24033;&#33322;&#25511;&#21046;&#22312;&#19978;&#19979;&#25991;&#24863;&#30693;&#25915;&#20987;&#19979;&#30340;&#23433;&#20840;&#24615;&#23454;&#39564;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Experimental Security Analysis of DNN-based Adaptive Cruise Control under Context-Aware Perception Attacks. (arXiv:2307.08939v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08939
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#35780;&#20272;&#20102;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#33258;&#36866;&#24212;&#24033;&#33322;&#25511;&#21046;&#31995;&#32479;&#22312;&#38544;&#34109;&#24863;&#30693;&#25915;&#20987;&#19979;&#30340;&#23433;&#20840;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19978;&#19979;&#25991;&#24863;&#30693;&#31574;&#30053;&#21644;&#22522;&#20110;&#20248;&#21270;&#30340;&#22270;&#20687;&#25200;&#21160;&#29983;&#25104;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#36866;&#24212;&#24033;&#33322;&#25511;&#21046;&#65288;ACC&#65289;&#26159;&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#30340;&#39550;&#39542;&#21592;&#36741;&#21161;&#21151;&#33021;&#65292;&#29992;&#20110;&#20445;&#25345;&#26399;&#26395;&#36895;&#24230;&#21644;&#19982;&#21069;&#26041;&#36710;&#36742;&#30340;&#23433;&#20840;&#36317;&#31163;&#12290;&#26412;&#25991;&#35780;&#20272;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#30340;ACC&#31995;&#32479;&#22312;&#38544;&#34109;&#24863;&#30693;&#25915;&#20987;&#19979;&#30340;&#23433;&#20840;&#24615;&#65292;&#35813;&#25915;&#20987;&#20250;&#23545;&#25668;&#20687;&#26426;&#25968;&#25454;&#36827;&#34892;&#26377;&#38024;&#23545;&#24615;&#30340;&#25200;&#21160;&#65292;&#20197;&#23548;&#33268;&#21069;&#26041;&#30896;&#25758;&#20107;&#25925;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#30693;&#35782;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#65292;&#35774;&#35745;&#20102;&#19968;&#31181;&#19978;&#19979;&#25991;&#24863;&#30693;&#31574;&#30053;&#65292;&#29992;&#20110;&#36873;&#25321;&#35302;&#21457;&#25915;&#20987;&#26368;&#20851;&#38190;&#30340;&#26102;&#38388;&#28857;&#65292;&#24182;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#22312;&#36816;&#34892;&#26102;&#29983;&#25104;&#36866;&#24212;&#24615;&#22270;&#20687;&#25200;&#21160;&#12290;&#25105;&#20204;&#20351;&#29992;&#23454;&#38469;&#39550;&#39542;&#25968;&#25454;&#38598;&#21644;&#36924;&#30495;&#30340;&#20223;&#30495;&#24179;&#21488;&#35780;&#20272;&#20102;&#25152;&#25552;&#20986;&#25915;&#20987;&#30340;&#26377;&#25928;&#24615;&#65292;&#35813;&#20223;&#30495;&#24179;&#21488;&#20351;&#29992;&#20102;&#26469;&#33258;&#29983;&#20135;ACC&#31995;&#32479;&#30340;&#25511;&#21046;&#36719;&#20214;&#21644;&#29289;&#29702;&#19990;&#30028;&#39550;&#39542;&#27169;&#25311;&#22120;&#65292;&#24182;&#32771;&#34385;&#20102;&#39550;&#39542;&#21592;&#30340;&#24178;&#39044;&#20197;&#21450;&#33258;&#21160;&#32039;&#24613;&#21046;&#21160;&#65288;AEB&#65289;&#21644;&#21069;&#21521;&#30896;&#25758;&#35686;&#31034;&#65288;FCW&#65289;&#31561;&#23433;&#20840;&#21151;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adaptive Cruise Control (ACC) is a widely used driver assistance feature for maintaining desired speed and safe distance to the leading vehicles. This paper evaluates the security of the deep neural network (DNN) based ACC systems under stealthy perception attacks that strategically inject perturbations into camera data to cause forward collisions. We present a combined knowledge-and-data-driven approach to design a context-aware strategy for the selection of the most critical times for triggering the attacks and a novel optimization-based method for the adaptive generation of image perturbations at run-time. We evaluate the effectiveness of the proposed attack using an actual driving dataset and a realistic simulation platform with the control software from a production ACC system and a physical-world driving simulator while considering interventions by the driver and safety features such as Automatic Emergency Braking (AEB) and Forward Collision Warning (FCW). Experimental results sh
&lt;/p&gt;</description></item></channel></rss>