<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#26412;&#25991;&#25552;&#20986;TESSERACT&#26041;&#27861;&#65292;&#28040;&#38500;&#20102;&#24694;&#24847;&#36719;&#20214;&#20998;&#31867;&#20013;&#30340;&#23454;&#39564;&#20559;&#24046;&#65292;&#35299;&#20915;&#20102;&#24120;&#35265;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#20559;&#24046;&#38382;&#39064;&#12290;&#36890;&#36807;&#20844;&#24179;&#23454;&#39564;&#35774;&#35745;&#32422;&#26463;&#21644;&#26032;&#25351;&#26631;AUT&#23454;&#29616;&#20102;&#26356;&#20934;&#30830;&#21644;&#31283;&#23450;&#30340;&#20998;&#31867;&#22120;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01359</link><description>&lt;p&gt;
TESSERACT: &#28040;&#38500;&#24694;&#24847;&#36719;&#20214;&#20998;&#31867;&#20013;&#30340;&#23454;&#39564;&#20559;&#24046;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#26041;&#27861;&#65288;&#25193;&#23637;&#29256;&#65289;
&lt;/p&gt;
&lt;p&gt;
TESSERACT: Eliminating Experimental Bias in Malware Classification across Space and Time (Extended Version)
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01359
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;TESSERACT&#26041;&#27861;&#65292;&#28040;&#38500;&#20102;&#24694;&#24847;&#36719;&#20214;&#20998;&#31867;&#20013;&#30340;&#23454;&#39564;&#20559;&#24046;&#65292;&#35299;&#20915;&#20102;&#24120;&#35265;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#20559;&#24046;&#38382;&#39064;&#12290;&#36890;&#36807;&#20844;&#24179;&#23454;&#39564;&#35774;&#35745;&#32422;&#26463;&#21644;&#26032;&#25351;&#26631;AUT&#23454;&#29616;&#20102;&#26356;&#20934;&#30830;&#21644;&#31283;&#23450;&#30340;&#20998;&#31867;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#26816;&#27979;&#24694;&#24847;&#36719;&#20214;&#26041;&#38754;&#25198;&#28436;&#30528;&#20851;&#38190;&#35282;&#33394;&#12290;&#23613;&#31649;&#35768;&#22810;&#30740;&#31350;&#25253;&#21578;&#30340;F1&#20998;&#25968;&#39640;&#36798;0.99&#65292;&#20294;&#38382;&#39064;&#20173;&#26410;&#23436;&#20840;&#35299;&#20915;&#12290;&#24694;&#24847;&#36719;&#20214;&#26816;&#27979;&#22120;&#24120;&#24120;&#22312;&#25805;&#20316;&#31995;&#32479;&#21644;&#25915;&#20987;&#26041;&#27861;&#19981;&#26029;&#28436;&#21270;&#26102;&#20986;&#29616;&#24615;&#33021;&#19979;&#38477;&#65292;&#36825;&#20250;&#23548;&#33268;&#20043;&#21069;&#23398;&#20064;&#21040;&#30340;&#30693;&#35782;&#23545;&#20110;&#26032;&#36755;&#20837;&#30340;&#20934;&#30830;&#20915;&#31574;&#21464;&#24471;&#19981;&#36275;&#22815;&#12290;&#26412;&#25991;&#35748;&#20026;&#24120;&#35265;&#30340;&#30740;&#31350;&#32467;&#26524;&#30001;&#20110;&#26816;&#27979;&#20219;&#21153;&#20013;&#30340;&#20004;&#31181;&#26222;&#36941;&#30340;&#23454;&#39564;&#20559;&#24046;&#32780;&#34987;&#22840;&#22823;&#65306;&#31354;&#38388;&#20559;&#24046;&#26159;&#30001;&#25968;&#25454;&#20998;&#24067;&#19981;&#20195;&#34920;&#30495;&#23454;&#37096;&#32626;&#30340;&#24773;&#20917;&#24341;&#36215;&#30340;&#65307;&#26102;&#38388;&#20559;&#24046;&#26159;&#30001;&#20110;&#25968;&#25454;&#30340;&#19981;&#27491;&#30830;&#26102;&#38388;&#20998;&#21106;&#24341;&#36215;&#30340;&#65292;&#23548;&#33268;&#20102;&#19981;&#29616;&#23454;&#30340;&#37197;&#32622;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#20559;&#24046;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#32452;&#20844;&#24179;&#23454;&#39564;&#35774;&#35745;&#30340;&#32422;&#26463;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#22312;&#30495;&#23454;&#29615;&#22659;&#20013;&#35780;&#20272;&#20998;&#31867;&#22120;&#31283;&#23450;&#24615;&#30340;&#26032;&#25351;&#26631;AUT&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35843;&#25972;&#35757;&#32451;&#25968;&#25454;&#20197;&#25552;&#39640;&#20998;&#31867;&#22120;&#40065;&#26834;&#24615;&#30340;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning (ML) plays a pivotal role in detecting malicious software. Despite the high F1-scores reported in numerous studies reaching upwards of 0.99, the issue is not completely solved. Malware detectors often experience performance decay due to constantly evolving operating systems and attack methods, which can render previously learned knowledge insufficient for accurate decision-making on new inputs. This paper argues that commonly reported results are inflated due to two pervasive sources of experimental bias in the detection task: spatial bias caused by data distributions that are not representative of a real-world deployment; and temporal bias caused by incorrect time splits of data, leading to unrealistic configurations. To address these biases, we introduce a set of constraints for fair experiment design, and propose a new metric, AUT, for classifier robustness in real-world settings. We additionally propose an algorithm designed to tune training data to enhance classif
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#29992;&#20110;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#32593;&#32476;&#23433;&#20840;&#20219;&#21153;&#30340;&#28304;&#20195;&#30721;&#34920;&#31034;&#26041;&#27861;&#65292;&#21457;&#29616;&#22522;&#20110;&#22270;&#30340;&#34920;&#31034;&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#65292;&#32780;&#20998;&#35789;&#22120;&#21644;&#25277;&#35937;&#35821;&#27861;&#26641;&#26159;&#26368;&#27969;&#34892;&#30340;&#20004;&#31181;&#34920;&#31034;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.10646</link><description>&lt;p&gt;
&#29992;&#20110;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#32593;&#32476;&#23433;&#20840;&#20219;&#21153;&#30340;&#28304;&#20195;&#30721;&#34920;&#31034;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
A Survey of Source Code Representations for Machine Learning-Based Cybersecurity Tasks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10646
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#29992;&#20110;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#32593;&#32476;&#23433;&#20840;&#20219;&#21153;&#30340;&#28304;&#20195;&#30721;&#34920;&#31034;&#26041;&#27861;&#65292;&#21457;&#29616;&#22522;&#20110;&#22270;&#30340;&#34920;&#31034;&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#65292;&#32780;&#20998;&#35789;&#22120;&#21644;&#25277;&#35937;&#35821;&#27861;&#26641;&#26159;&#26368;&#27969;&#34892;&#30340;&#20004;&#31181;&#34920;&#31034;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10646v1 &#20844;&#21578;&#31867;&#22411;: &#26032;&#30340; &#25688;&#35201;: &#29992;&#20110;&#32593;&#32476;&#23433;&#20840;&#30456;&#20851;&#36719;&#20214;&#24037;&#31243;&#20219;&#21153;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#12290;&#28304;&#20195;&#30721;&#30340;&#34920;&#31034;&#26159;&#35813;&#25216;&#26415;&#30340;&#20851;&#38190;&#37096;&#20998;&#65292;&#21487;&#20197;&#24433;&#21709;&#27169;&#22411;&#23398;&#20064;&#28304;&#20195;&#30721;&#29305;&#24449;&#30340;&#26041;&#24335;&#12290;&#38543;&#30528;&#36234;&#26469;&#36234;&#22810;&#30340;&#36825;&#20123;&#25216;&#26415;&#34987;&#24320;&#21457;&#65292;&#20102;&#35299;&#35813;&#39046;&#22495;&#30340;&#24403;&#21069;&#29366;&#24577;&#23545;&#20110;&#26356;&#22909;&#22320;&#29702;&#35299;&#24050;&#26377;&#20869;&#23481;&#21644;&#23578;&#26410;&#23384;&#22312;&#30340;&#20869;&#23481;&#26159;&#26377;&#20215;&#20540;&#30340;&#12290;&#26412;&#25991;&#23545;&#36825;&#20123;&#29616;&#26377;&#30340;&#22522;&#20110;ML&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;&#19981;&#21516;&#32593;&#32476;&#23433;&#20840;&#20219;&#21153;&#21644;&#32534;&#31243;&#35821;&#35328;&#25152;&#20351;&#29992;&#30340;&#34920;&#31034;&#31867;&#22411;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#34920;&#31034;&#25152;&#20351;&#29992;&#30340;&#27169;&#22411;&#31867;&#22411;&#12290;&#25105;&#20204;&#21457;&#29616;&#22522;&#20110;&#22270;&#30340;&#34920;&#31034;&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#34920;&#31034;&#31867;&#21035;&#65292;&#32780;&#20998;&#35789;&#22120;&#21644;&#25277;&#35937;&#35821;&#27861;&#26641;&#65288;ASTs&#65289;&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#34920;&#31034;&#26041;&#27861;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#32593;&#32476;&#23433;&#20840;&#39046;&#22495;&#26368;&#21463;&#27426;&#36814;&#30340;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10646v1 Announce Type: new  Abstract: Machine learning techniques for cybersecurity-related software engineering tasks are becoming increasingly popular. The representation of source code is a key portion of the technique that can impact the way the model is able to learn the features of the source code. With an increasing number of these techniques being developed, it is valuable to see the current state of the field to better understand what exists and what's not there yet. This paper presents a study of these existing ML-based approaches and demonstrates what type of representations were used for different cybersecurity tasks and programming languages. Additionally, we study what types of models are used with different representations. We have found that graph-based representations are the most popular category of representation, and Tokenizers and Abstract Syntax Trees (ASTs) are the two most popular representations overall. We also found that the most popular cybersecur
&lt;/p&gt;</description></item></channel></rss>