<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#25913;&#36827;&#30340;&#28145;&#24230;&#21367;&#31215;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;(mDCGAN)&#65292;&#38024;&#23545;&#39640;&#36136;&#37327;&#33402;&#26415;&#21697;&#29983;&#25104;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#35299;&#20915;&#20102;&#26222;&#36941;&#35757;&#32451;&#38382;&#39064;&#65292;&#26377;&#25928;&#25506;&#32034;&#25277;&#35937;&#32472;&#30011;&#20013;&#30340;&#39068;&#33394;&#21644;&#31508;&#35302;&#27169;&#24335;&#12290;</title><link>https://arxiv.org/abs/2403.18397</link><description>&lt;p&gt;
&#20351;&#29992;&#25913;&#36827;&#30340;&#28145;&#24230;&#21367;&#31215;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#22312;&#25277;&#35937;&#33402;&#26415;&#20013;&#36827;&#34892;&#39068;&#33394;&#21644;&#31508;&#35302;&#27169;&#24335;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Colour and Brush Stroke Pattern Recognition in Abstract Art using Modified Deep Convolutional Generative Adversarial Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18397
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#25913;&#36827;&#30340;&#28145;&#24230;&#21367;&#31215;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;(mDCGAN)&#65292;&#38024;&#23545;&#39640;&#36136;&#37327;&#33402;&#26415;&#21697;&#29983;&#25104;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#35299;&#20915;&#20102;&#26222;&#36941;&#35757;&#32451;&#38382;&#39064;&#65292;&#26377;&#25928;&#25506;&#32034;&#25277;&#35937;&#32472;&#30011;&#20013;&#30340;&#39068;&#33394;&#21644;&#31508;&#35302;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25277;&#35937;&#33402;&#26415;&#26159;&#19968;&#31181;&#24191;&#21463;&#27426;&#36814;&#12289;&#34987;&#24191;&#27867;&#35752;&#35770;&#30340;&#33402;&#26415;&#24418;&#24335;&#65292;&#36890;&#24120;&#33021;&#22815;&#25551;&#32472;&#20986;&#33402;&#26415;&#23478;&#30340;&#24773;&#24863;&#12290;&#35768;&#22810;&#30740;&#31350;&#20154;&#21592;&#23581;&#35797;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#21644;&#28145;&#24230;&#23398;&#20064;&#30340;&#36793;&#32536;&#26816;&#27979;&#12289;&#31508;&#35302;&#21644;&#24773;&#24863;&#35782;&#21035;&#31639;&#27861;&#26469;&#30740;&#31350;&#25277;&#35937;&#33402;&#26415;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#20351;&#29992;&#29983;&#25104;&#23545;&#25239;&#31070;&#32463;&#32593;&#32476;(GAN)&#23545;&#24191;&#27867;&#20998;&#24067;&#30340;&#25277;&#35937;&#32472;&#30011;&#36827;&#34892;&#30740;&#31350;&#12290; GAN&#20855;&#26377;&#23398;&#20064;&#21644;&#20877;&#29616;&#20998;&#24067;&#30340;&#33021;&#21147;&#65292;&#20351;&#30740;&#31350;&#20154;&#21592;&#33021;&#22815;&#26377;&#25928;&#22320;&#25506;&#32034;&#21644;&#30740;&#31350;&#29983;&#25104;&#30340;&#22270;&#20687;&#31354;&#38388;&#12290;&#28982;&#32780;&#65292;&#25361;&#25112;&#22312;&#20110;&#24320;&#21457;&#19968;&#31181;&#33021;&#22815;&#20811;&#26381;&#24120;&#35265;&#35757;&#32451;&#38382;&#39064;&#30340;&#39640;&#25928;GAN&#26550;&#26500;&#12290;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#19987;&#38376;&#35774;&#35745;&#29992;&#20110;&#39640;&#36136;&#37327;&#33402;&#26415;&#21697;&#29983;&#25104;&#30340;&#25913;&#36827;DCGAN(mDCGAN)&#26469;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#28041;&#21450;&#23545;&#25152;&#20570;&#20462;&#25913;&#30340;&#28145;&#20837;&#25506;&#35752;&#65292;&#28145;&#20837;&#30740;&#31350;DCGAN&#30340;&#22797;&#26434;&#24037;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18397v1 Announce Type: cross  Abstract: Abstract Art is an immensely popular, discussed form of art that often has the ability to depict the emotions of an artist. Many researchers have made attempts to study abstract art in the form of edge detection, brush stroke and emotion recognition algorithms using machine and deep learning. This papers describes the study of a wide distribution of abstract paintings using Generative Adversarial Neural Networks(GAN). GANs have the ability to learn and reproduce a distribution enabling researchers and scientists to effectively explore and study the generated image space. However, the challenge lies in developing an efficient GAN architecture that overcomes common training pitfalls. This paper addresses this challenge by introducing a modified-DCGAN (mDCGAN) specifically designed for high-quality artwork generation. The approach involves a thorough exploration of the modifications made, delving into the intricate workings of DCGANs, opt
&lt;/p&gt;</description></item></channel></rss>