<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#25193;&#25955;&#27169;&#22411;&#23481;&#26131;&#21463;&#21040;&#21518;&#38376;&#25915;&#20987;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#29992;&#20110;&#36755;&#20837;&#32423;&#21518;&#38376;&#26816;&#27979;&#65292;&#24357;&#34917;&#20102;&#35813;&#39046;&#22495;&#30340;&#31354;&#30333;&#65292;&#24182;&#19981;&#38656;&#35201;&#35775;&#38382;&#27169;&#22411;&#30340;&#30333;&#30418;&#20449;&#24687;&#12290;</title><link>https://arxiv.org/abs/2404.01101</link><description>&lt;p&gt;
UFID: &#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#29992;&#20110;&#25193;&#25955;&#27169;&#22411;&#19978;&#30340;&#36755;&#20837;&#32423;&#21518;&#38376;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
UFID: A Unified Framework for Input-level Backdoor Detection on Diffusion Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01101
&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#23481;&#26131;&#21463;&#21040;&#21518;&#38376;&#25915;&#20987;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#29992;&#20110;&#36755;&#20837;&#32423;&#21518;&#38376;&#26816;&#27979;&#65292;&#24357;&#34917;&#20102;&#35813;&#39046;&#22495;&#30340;&#31354;&#30333;&#65292;&#24182;&#19981;&#38656;&#35201;&#35775;&#38382;&#27169;&#22411;&#30340;&#30333;&#30418;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#23481;&#26131;&#21463;&#21040;&#21518;&#38376;&#25915;&#20987;&#65292;&#21363;&#24694;&#24847;&#25915;&#20987;&#32773;&#22312;&#35757;&#32451;&#38454;&#27573;&#36890;&#36807;&#23545;&#37096;&#20998;&#35757;&#32451;&#26679;&#26412;&#36827;&#34892;&#27602;&#21270;&#26469;&#27880;&#20837;&#21518;&#38376;&#12290;&#20026;&#20102;&#20943;&#36731;&#21518;&#38376;&#25915;&#20987;&#30340;&#23041;&#32961;&#65292;&#23545;&#21518;&#38376;&#26816;&#27979;&#36827;&#34892;&#20102;&#22823;&#37327;&#30740;&#31350;&#12290;&#28982;&#32780;&#65292;&#27809;&#26377;&#20154;&#20026;&#25193;&#25955;&#27169;&#22411;&#35774;&#35745;&#20102;&#19987;&#38376;&#30340;&#21518;&#38376;&#26816;&#27979;&#26041;&#27861;&#65292;&#20351;&#24471;&#36825;&#19968;&#39046;&#22495;&#36739;&#23569;&#34987;&#25506;&#32034;&#12290;&#27492;&#22806;&#65292;&#22823;&#22810;&#25968;&#20808;&#21069;&#30340;&#26041;&#27861;&#20027;&#35201;&#38598;&#20013;&#22312;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#30340;&#20998;&#31867;&#20219;&#21153;&#19978;&#65292;&#24456;&#38590;&#36731;&#26494;&#22320;&#23558;&#20854;&#36866;&#24212;&#29983;&#25104;&#20219;&#21153;&#19978;&#30340;&#21518;&#38376;&#26816;&#27979;&#12290;&#27492;&#22806;&#65292;&#22823;&#22810;&#25968;&#20808;&#21069;&#30340;&#26041;&#27861;&#38656;&#35201;&#35775;&#38382;&#27169;&#22411;&#26435;&#37325;&#21644;&#26550;&#26500;&#30340;&#30333;&#30418;&#35775;&#38382;&#65292;&#25110;&#27010;&#29575;logits&#20316;&#20026;&#39069;&#22806;&#20449;&#24687;&#65292;&#36825;&#24182;&#19981;&#24635;&#26159;&#20999;&#23454;&#21487;&#34892;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01101v1 Announce Type: cross  Abstract: Diffusion Models are vulnerable to backdoor attacks, where malicious attackers inject backdoors by poisoning some parts of the training samples during the training stage. This poses a serious threat to the downstream users, who query the diffusion models through the API or directly download them from the internet. To mitigate the threat of backdoor attacks, there have been a plethora of investigations on backdoor detections. However, none of them designed a specialized backdoor detection method for diffusion models, rendering the area much under-explored. Moreover, these prior methods mainly focus on the traditional neural networks in the classification task, which cannot be adapted to the backdoor detections on the generative task easily. Additionally, most of the prior methods require white-box access to model weights and architectures, or the probability logits as additional information, which are not always practical. In this paper
&lt;/p&gt;</description></item></channel></rss>