<rss version="2.0"><channel><title>Chat Arxiv cs.CV</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CV</description><item><title>RealKIE&#25552;&#20379;&#20102;&#20116;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20225;&#19994;&#20851;&#38190;&#20449;&#24687;&#25552;&#21462;&#25968;&#25454;&#38598;&#65292;&#20026;&#25237;&#36164;&#20998;&#26512;&#21644;&#27861;&#24459;&#25968;&#25454;&#22788;&#29702;&#31561;&#20219;&#21153;&#25552;&#20379;&#20102;&#29616;&#23454;&#30340;&#27979;&#35797;&#22522;&#22320;&#65292;&#24182;&#20026;NLP&#27169;&#22411;&#30340;&#21457;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;</title><link>https://arxiv.org/abs/2403.20101</link><description>&lt;p&gt;
RealKIE: &#20116;&#20010;&#26032;&#39062;&#30340;&#20225;&#19994;&#20851;&#38190;&#20449;&#24687;&#25552;&#21462;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
RealKIE: Five Novel Datasets for Enterprise Key Information Extraction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.20101
&lt;/p&gt;
&lt;p&gt;
RealKIE&#25552;&#20379;&#20102;&#20116;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20225;&#19994;&#20851;&#38190;&#20449;&#24687;&#25552;&#21462;&#25968;&#25454;&#38598;&#65292;&#20026;&#25237;&#36164;&#20998;&#26512;&#21644;&#27861;&#24459;&#25968;&#25454;&#22788;&#29702;&#31561;&#20219;&#21153;&#25552;&#20379;&#20102;&#29616;&#23454;&#30340;&#27979;&#35797;&#22522;&#22320;&#65292;&#24182;&#20026;NLP&#27169;&#22411;&#30340;&#21457;&#23637;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;RealKIE&#65292;&#36825;&#26159;&#19968;&#20010;&#26088;&#22312;&#25512;&#21160;&#20851;&#38190;&#20449;&#24687;&#25552;&#21462;&#26041;&#27861;&#21457;&#23637;&#30340;&#20116;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#25968;&#25454;&#38598;&#22522;&#20934;&#65292;&#37325;&#28857;&#26159;&#20225;&#19994;&#24212;&#29992;&#12290;&#36825;&#20123;&#25968;&#25454;&#38598;&#21253;&#25324;&#32654;&#22269;SEC S1&#25991;&#20214;&#12289;&#32654;&#22269;&#20445;&#23494;&#21327;&#35758;&#12289;&#33521;&#22269;&#24904;&#21892;&#25253;&#21578;&#12289;FCC&#21457;&#31080;&#21644;&#36164;&#28304;&#21512;&#21516;&#31561;&#21508;&#31181;&#31867;&#22411;&#30340;&#25991;&#26723;&#12290;&#27599;&#20010;&#25968;&#25454;&#38598;&#37117;&#20855;&#26377;&#29420;&#29305;&#30340;&#25361;&#25112;&#65306;&#25991;&#26412;&#24207;&#21015;&#21270;&#19981;&#20339;&#12289;&#38271;&#25991;&#26723;&#20013;&#31232;&#30095;&#30340;&#27880;&#37322;&#21644;&#22797;&#26434;&#30340;&#34920;&#26684;&#24067;&#23616;&#12290;&#36825;&#20123;&#25968;&#25454;&#38598;&#20026;&#20851;&#38190;&#20449;&#24687;&#25552;&#21462;&#20219;&#21153;&#65288;&#22914;&#25237;&#36164;&#20998;&#26512;&#21644;&#27861;&#24459;&#25968;&#25454;&#22788;&#29702;&#65289;&#25552;&#20379;&#20102;&#19968;&#20010;&#29616;&#23454;&#30340;&#27979;&#35797;&#22522;&#22320;&#12290;&#38500;&#20102;&#20171;&#32461;&#36825;&#20123;&#25968;&#25454;&#38598;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#23545;&#27880;&#37322;&#36807;&#31243;&#12289;&#25991;&#26723;&#22788;&#29702;&#25216;&#26415;&#21644;&#22522;&#32447;&#24314;&#27169;&#26041;&#27861;&#30340;&#28145;&#20837;&#25551;&#36848;&#12290;&#36825;&#19968;&#36129;&#29486;&#20419;&#36827;&#20102;&#33021;&#22815;&#22788;&#29702;&#23454;&#38469;&#25361;&#25112;&#30340;NLP&#27169;&#22411;&#30340;&#21457;&#23637;&#65292;&#24182;&#25903;&#25345;&#36827;&#19968;&#27493;&#30740;&#31350;&#21487;&#24212;&#29992;&#20110;&#24037;&#19994;&#30340;&#20449;&#24687;&#25552;&#21462;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.20101v1 Announce Type: new  Abstract: We introduce RealKIE, a benchmark of five challenging datasets aimed at advancing key information extraction methods, with an emphasis on enterprise applications. The datasets include a diverse range of documents including SEC S1 Filings, US Non-disclosure Agreements, UK Charity Reports, FCC Invoices, and Resource Contracts. Each presents unique challenges: poor text serialization, sparse annotations in long documents, and complex tabular layouts. These datasets provide a realistic testing ground for key information extraction tasks like investment analysis and legal data processing.   In addition to presenting these datasets, we offer an in-depth description of the annotation process, document processing techniques, and baseline modeling approaches. This contribution facilitates the development of NLP models capable of handling practical challenges and supports further research into information extraction technologies applicable to indu
&lt;/p&gt;</description></item></channel></rss>