<rss version="2.0"><channel><title>Chat Arxiv cs.CY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CY</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#23545;&#25239;&#20107;&#23454;&#29983;&#25104;&#26041;&#27861;&#65292;&#21033;&#29992;&#38381;&#24335;&#35299;&#20915;&#26041;&#26696;&#22312;&#34920;&#31034;&#31354;&#38388;&#20013;&#29983;&#25104;&#23500;&#26377;&#34920;&#36798;&#21147;&#30340;&#23545;&#25239;&#20107;&#23454;&#65292;&#20197;&#20943;&#36731;&#35821;&#35328;&#27169;&#22411;&#20013;&#30340;&#19981;&#33391;&#34892;&#20026;&#65292;&#35813;&#26041;&#27861;&#22312;&#22320;&#29699;&#31227;&#21160;&#38382;&#39064;&#26041;&#38754;&#25552;&#20379;&#29702;&#35770;&#19978;&#30340;&#20445;&#35777;&#65292;&#24182;&#23545;&#34920;&#31034;&#31354;&#38388;&#30340;&#20960;&#20309;&#32452;&#32455;&#36827;&#34892;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2402.09631</link><description>&lt;p&gt;
MiMiC&#65306;&#34920;&#31034;&#31354;&#38388;&#20013;&#26368;&#23567;&#20462;&#25913;&#30340;&#23545;&#25239;&#20107;&#23454;
&lt;/p&gt;
&lt;p&gt;
MiMiC: Minimally Modified Counterfactuals in the Representation Space
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09631
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#23545;&#25239;&#20107;&#23454;&#29983;&#25104;&#26041;&#27861;&#65292;&#21033;&#29992;&#38381;&#24335;&#35299;&#20915;&#26041;&#26696;&#22312;&#34920;&#31034;&#31354;&#38388;&#20013;&#29983;&#25104;&#23500;&#26377;&#34920;&#36798;&#21147;&#30340;&#23545;&#25239;&#20107;&#23454;&#65292;&#20197;&#20943;&#36731;&#35821;&#35328;&#27169;&#22411;&#20013;&#30340;&#19981;&#33391;&#34892;&#20026;&#65292;&#35813;&#26041;&#27861;&#22312;&#22320;&#29699;&#31227;&#21160;&#38382;&#39064;&#26041;&#38754;&#25552;&#20379;&#29702;&#35770;&#19978;&#30340;&#20445;&#35777;&#65292;&#24182;&#23545;&#34920;&#31034;&#31354;&#38388;&#30340;&#20960;&#20309;&#32452;&#32455;&#36827;&#34892;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09631v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449;&#23398;&#31185; &#31616;&#20171;&#65306;&#35821;&#35328;&#27169;&#22411;&#32463;&#24120;&#34920;&#29616;&#20986;&#19981;&#33391;&#34892;&#20026;&#65292;&#22914;&#24615;&#21035;&#20559;&#35265;&#25110;&#26377;&#27602;&#35821;&#35328;&#12290;&#36890;&#36807;&#23545;&#34920;&#31034;&#31354;&#38388;&#36827;&#34892;&#24178;&#39044;&#65292;&#21487;&#20197;&#26377;&#25928;&#20943;&#36731;&#36825;&#20123;&#38382;&#39064;&#65292;&#20294;&#20004;&#31181;&#24120;&#35265;&#30340;&#24178;&#39044;&#25216;&#26415;&#65292;&#21363;&#32447;&#24615;&#25830;&#38500;&#21644;&#23450;&#21521;&#21521;&#37327;&#65292;&#24182;&#19981;&#33021;&#25552;&#20379;&#39640;&#24230;&#21487;&#25511;&#21644;&#34920;&#36798;&#20016;&#23500;&#24230;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#24178;&#39044;&#26041;&#27861;&#65292;&#26088;&#22312;&#22312;&#34920;&#31034;&#31354;&#38388;&#20013;&#29983;&#25104;&#23500;&#26377;&#34920;&#36798;&#21147;&#30340;&#23545;&#25239;&#20107;&#23454;&#65292;&#20351;&#28304;&#31867;&#21035;&#65288;&#20363;&#22914;&#8220;&#26377;&#27602;&#8221;&#65289;&#30340;&#34920;&#31034;&#19982;&#30446;&#26631;&#31867;&#21035;&#65288;&#20363;&#22914;&#8220;&#38750;&#26377;&#27602;&#8221;&#65289;&#30340;&#34920;&#31034;&#30456;&#20284;&#12290;&#36825;&#31181;&#26041;&#27861;&#21033;&#29992;&#39640;&#26031;&#20551;&#35774;&#19979;&#30340;&#38381;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#22312;&#22320;&#29699;&#31227;&#21160;&#38382;&#39064;&#26041;&#38754;&#25552;&#20379;&#20102;&#29702;&#35770;&#19978;&#30340;&#20445;&#35777;&#65292;&#24182;&#23545;&#34920;&#31034;&#31354;&#38388;&#30340;&#20960;&#20309;&#32452;&#32455;&#25552;&#20379;&#20102;&#36827;&#19968;&#27493;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09631v1 Announce Type: cross  Abstract: Language models often exhibit undesirable behaviors, such as gender bias or toxic language. Interventions in the representation space were shown effective in mitigating such issues by altering the LM behavior. We first show that two prominent intervention techniques, Linear Erasure and Steering Vectors, do not enable a high degree of control and are limited in expressivity.   We then propose a novel intervention methodology for generating expressive counterfactuals in the representation space, aiming to make representations of a source class (e.g., ``toxic'') resemble those of a target class (e.g., ``non-toxic''). This approach, generalizing previous linear intervention techniques, utilizes a closed-form solution for the Earth Mover's problem under Gaussian assumptions and provides theoretical guarantees on the representation space's geometric organization. We further build on this technique and derive a nonlinear intervention that ena
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#30340;&#20998;&#31867;&#27861;&#65292;&#23545;&#24403;&#21069;&#21457;&#23637;&#29366;&#24577;&#19979;&#30340;&#20851;&#38190;&#38480;&#21046;&#36827;&#34892;&#20102;&#23457;&#26597;&#65292;&#24182;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;</title><link>https://arxiv.org/abs/2402.05355</link><description>&lt;p&gt;
&#23433;&#20840;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#35843;&#30740;
&lt;/p&gt;
&lt;p&gt;
A Survey on Safe Multi-Modal Learning System
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05355
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#30340;&#20998;&#31867;&#27861;&#65292;&#23545;&#24403;&#21069;&#21457;&#23637;&#29366;&#24577;&#19979;&#30340;&#20851;&#38190;&#38480;&#21046;&#36827;&#34892;&#20102;&#23457;&#26597;&#65292;&#24182;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#22312;&#29616;&#23454;&#22330;&#26223;&#20013;&#30340;&#24191;&#27867;&#24212;&#29992;&#65292;&#23433;&#20840;&#38382;&#39064;&#21464;&#24471;&#36234;&#26469;&#36234;&#31361;&#20986;&#12290;&#23545;&#20110;&#36825;&#19968;&#39046;&#22495;&#30340;&#23433;&#20840;&#38382;&#39064;&#32570;&#20047;&#31995;&#32479;&#24615;&#30740;&#31350;&#24050;&#25104;&#20026;&#19968;&#20010;&#37325;&#35201;&#30340;&#38556;&#30861;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#30340;&#20998;&#31867;&#27861;&#65292;&#30830;&#23450;&#20102;&#36825;&#20123;&#38382;&#39064;&#30340;&#22235;&#20010;&#20851;&#38190;&#25903;&#26609;&#12290;&#20511;&#21161;&#36825;&#19968;&#20998;&#31867;&#27861;&#65292;&#25105;&#20204;&#23545;&#27599;&#20010;&#25903;&#26609;&#36827;&#34892;&#20102;&#28145;&#20837;&#23457;&#26597;&#65292;&#31361;&#20986;&#20102;&#24403;&#21069;&#21457;&#23637;&#29366;&#24577;&#30340;&#20851;&#38190;&#38480;&#21046;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25351;&#20986;&#20102;&#22810;&#27169;&#24577;&#23398;&#20064;&#31995;&#32479;&#23433;&#20840;&#38754;&#20020;&#30340;&#29420;&#29305;&#25361;&#25112;&#65292;&#24182;&#25552;&#20379;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the wide deployment of multimodal learning systems (MMLS) in real-world scenarios, safety concerns have become increasingly prominent. The absence of systematic research into their safety is a significant barrier to progress in this field. To bridge the gap, we present the first taxonomy for MMLS safety, identifying four essential pillars of these concerns. Leveraging this taxonomy, we conduct in-depth reviews for each pillar, highlighting key limitations based on the current state of development. Finally, we pinpoint unique challenges in MMLS safety and provide potential directions for future research.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25259;&#38706;&#20351;&#29992;AI&#21019;&#20316;&#21019;&#24847;&#20869;&#23481;&#22914;&#20309;&#24433;&#21709;&#20154;&#31867;&#23545;&#27492;&#31867;&#20869;&#23481;&#30340;&#35780;&#20215;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;AI&#25259;&#38706;&#23545;&#20110;&#21019;&#24847;&#25110;&#25551;&#36848;&#24615;&#30701;&#31687;&#23567;&#35828;&#30340;&#35780;&#20215;&#27809;&#26377;&#23454;&#36136;&#24615;&#24433;&#21709;&#65292;&#20294;&#26159;&#23545;&#20110;&#20197;&#31532;&#19968;&#20154;&#31216;&#20889;&#25104;&#30340;&#24773;&#24863;&#35825;&#21457;&#35799;&#27468;&#30340;&#35780;&#20215;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#36825;&#34920;&#26126;&#65292;&#24403;&#20869;&#23481;&#34987;&#35270;&#20026;&#26126;&#26174;&#8220;&#20154;&#31867;&#8221;&#26102;&#65292;&#23545;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#21453;&#24212;&#21487;&#33021;&#26159;&#36127;&#38754;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.06217</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#23545;&#21019;&#24847;&#20869;&#23481;&#35780;&#20215;&#30340;&#24433;&#21709;&#65306;AI&#25259;&#38706;&#23545;&#21019;&#24847;&#20869;&#23481;&#35780;&#20215;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Art-ificial Intelligence: The Effect of AI Disclosure on Evaluations of Creative Content. (arXiv:2303.06217v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06217
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#25259;&#38706;&#20351;&#29992;AI&#21019;&#20316;&#21019;&#24847;&#20869;&#23481;&#22914;&#20309;&#24433;&#21709;&#20154;&#31867;&#23545;&#27492;&#31867;&#20869;&#23481;&#30340;&#35780;&#20215;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;AI&#25259;&#38706;&#23545;&#20110;&#21019;&#24847;&#25110;&#25551;&#36848;&#24615;&#30701;&#31687;&#23567;&#35828;&#30340;&#35780;&#20215;&#27809;&#26377;&#23454;&#36136;&#24615;&#24433;&#21709;&#65292;&#20294;&#26159;&#23545;&#20110;&#20197;&#31532;&#19968;&#20154;&#31216;&#20889;&#25104;&#30340;&#24773;&#24863;&#35825;&#21457;&#35799;&#27468;&#30340;&#35780;&#20215;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#36825;&#34920;&#26126;&#65292;&#24403;&#20869;&#23481;&#34987;&#35270;&#20026;&#26126;&#26174;&#8220;&#20154;&#31867;&#8221;&#26102;&#65292;&#23545;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#21453;&#24212;&#21487;&#33021;&#26159;&#36127;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study explores how disclosure regarding the use of AI in the creation of creative content affects human evaluation of such content. The results show that AI disclosure has no meaningful effect on evaluation either for creative or descriptive short stories, but has a negative effect on evaluations for emotionally evocative poems written in the first person. This suggests that reactions to AI-generated content may be negative when the content is viewed as distinctly "human."
&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#20986;&#29616;&#65292;&#22914;OpenAI&#30340;ChatGPT&#32842;&#22825;&#26426;&#22120;&#20154;&#65292;&#25193;&#22823;&#20102;AI&#24037;&#20855;&#21487;&#20197;&#23436;&#25104;&#30340;&#20219;&#21153;&#33539;&#22260;&#65292;&#24182;&#23454;&#29616;&#20102;AI&#29983;&#25104;&#30340;&#21019;&#24847;&#20869;&#23481;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#20851;&#20110;&#25259;&#38706;&#20351;&#29992;AI&#21019;&#20316;&#21019;&#24847;&#20869;&#23481;&#22914;&#20309;&#24433;&#21709;&#20154;&#31867;&#23545;&#27492;&#31867;&#20869;&#23481;&#30340;&#35780;&#20215;&#12290;&#22312;&#19968;&#31995;&#21015;&#39044;&#20808;&#27880;&#20876;&#30340;&#23454;&#39564;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;AI&#25259;&#38706;&#23545;&#20110;&#21019;&#24847;&#25110;&#25551;&#36848;&#24615;&#30701;&#31687;&#23567;&#35828;&#30340;&#35780;&#20215;&#27809;&#26377;&#23454;&#36136;&#24615;&#24433;&#21709;&#65292;&#20294;&#26159;AI&#25259;&#38706;&#23545;&#20110;&#20197;&#31532;&#19968;&#20154;&#31216;&#20889;&#25104;&#30340;&#24773;&#24863;&#35825;&#21457;&#35799;&#27468;&#30340;&#35780;&#20215;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#25105;&#20204;&#35299;&#37322;&#36825;&#20010;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#20869;&#23481;&#34987;&#35270;&#20026;&#26126;&#26174;&#8220;&#20154;&#31867;&#8221;&#26102;&#65292;&#23545;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#21453;&#24212;&#21487;&#33021;&#26159;&#36127;&#38754;&#30340;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#36825;&#39033;&#24037;&#20316;&#30340;&#24433;&#21709;&#65292;&#24182;&#27010;&#36848;&#20102;&#35745;&#21010;&#30740;&#31350;&#30340;&#36884;&#24452;&#65292;&#20197;&#26356;&#22909;&#22320;&#20102;&#35299;AI&#25259;&#38706;&#26159;&#21542;&#20250;&#24433;&#21709;&#21019;&#24847;&#20869;&#23481;&#30340;&#35780;&#20215;&#20197;&#21450;&#20309;&#26102;&#20250;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
The emergence of generative AI technologies, such as OpenAI's ChatGPT chatbot, has expanded the scope of tasks that AI tools can accomplish and enabled AI-generated creative content. In this study, we explore how disclosure regarding the use of AI in the creation of creative content affects human evaluation of such content. In a series of pre-registered experimental studies, we show that AI disclosure has no meaningful effect on evaluation either for creative or descriptive short stories, but that AI disclosure has a negative effect on evaluations for emotionally evocative poems written in the first person. We interpret this result to suggest that reactions to AI-generated content may be negative when the content is viewed as distinctly "human." We discuss the implications of this work and outline planned pathways of research to better understand whether and when AI disclosure may affect the evaluation of creative content.
&lt;/p&gt;</description></item></channel></rss>