<rss version="2.0"><channel><title>Chat Arxiv cs.CR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35774;&#35745;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#21644;&#26816;&#27979;&#35268;&#21017;&#65292;&#36890;&#36807;&#20851;&#38190;&#32479;&#35745;&#37327;&#21644;&#31192;&#23494;&#23494;&#38053;&#25511;&#21046;&#35823;&#25253;&#29575;&#65292;&#21516;&#26102;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2404.01245</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#26694;&#26550;: &#26530;&#36724;&#12289;&#26816;&#27979;&#25928;&#29575;&#21644;&#26368;&#20248;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
A Statistical Framework of Watermarks for Large Language Models: Pivot, Detection Efficiency and Optimal Rules
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01245
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35774;&#35745;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#21644;&#26816;&#27979;&#35268;&#21017;&#65292;&#36890;&#36807;&#20851;&#38190;&#32479;&#35745;&#37327;&#21644;&#31192;&#23494;&#23494;&#38053;&#25511;&#21046;&#35823;&#25253;&#29575;&#65292;&#21516;&#26102;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;ChatGPT&#20110;2022&#24180;11&#26376;&#25512;&#20986;&#20197;&#26469;&#65292;&#23558;&#20960;&#20046;&#19981;&#21487;&#23519;&#35273;&#30340;&#32479;&#35745;&#20449;&#21495;&#23884;&#20837;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#29983;&#25104;&#30340;&#25991;&#26412;&#20013;&#65292;&#20063;&#34987;&#31216;&#20026;&#27700;&#21360;&#65292;&#24050;&#34987;&#29992;&#20316;&#20174;&#20854;&#20154;&#31867;&#25776;&#20889;&#23545;&#24212;&#29289;&#19978;&#21487;&#35777;&#26816;&#27979;LLM&#29983;&#25104;&#25991;&#26412;&#30340;&#21407;&#21017;&#24615;&#26041;&#27861;&#12290; &#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#36890;&#29992;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#25512;&#29702;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#24182;&#35774;&#35745;&#24378;&#22823;&#30340;&#26816;&#27979;&#35268;&#21017;&#12290;&#21463;&#27700;&#21360;&#26816;&#27979;&#30340;&#20551;&#35774;&#26816;&#39564;&#20844;&#24335;&#21551;&#21457;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#39318;&#20808;&#36873;&#25321;&#25991;&#26412;&#30340;&#26530;&#36724;&#32479;&#35745;&#37327;&#21644;&#30001;LLM&#25552;&#20379;&#32473;&#39564;&#35777;&#22120;&#30340;&#31192;&#23494;&#23494;&#38053;&#65292;&#20197;&#23454;&#29616;&#25511;&#21046;&#35823;&#25253;&#29575;&#65288;&#23558;&#20154;&#31867;&#25776;&#20889;&#30340;&#25991;&#26412;&#38169;&#35823;&#22320;&#26816;&#27979;&#20026;LLM&#29983;&#25104;&#30340;&#38169;&#35823;&#65289;&#12290; &#25509;&#19979;&#26469;&#65292;&#35813;&#26694;&#26550;&#20801;&#35768;&#36890;&#36807;&#33719;&#21462;&#28176;&#36817;&#38169;&#35823;&#36127;&#29575;&#65288;&#23558;LLM&#29983;&#25104;&#25991;&#26412;&#38169;&#35823;&#22320;&#26816;&#27979;&#20026;&#20154;&#31867;&#25776;&#20889;&#30340;&#38169;&#35823;&#65289;&#30340;&#23553;&#38381;&#24418;&#24335;&#34920;&#36798;&#24335;&#26469;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01245v1 Announce Type: cross  Abstract: Since ChatGPT was introduced in November 2022, embedding (nearly) unnoticeable statistical signals into text generated by large language models (LLMs), also known as watermarking, has been used as a principled approach to provable detection of LLM-generated text from its human-written counterpart. In this paper, we introduce a general and flexible framework for reasoning about the statistical efficiency of watermarks and designing powerful detection rules. Inspired by the hypothesis testing formulation of watermark detection, our framework starts by selecting a pivotal statistic of the text and a secret key -- provided by the LLM to the verifier -- to enable controlling the false positive rate (the error of mistakenly detecting human-written text as LLM-generated). Next, this framework allows one to evaluate the power of watermark detection rules by obtaining a closed-form expression of the asymptotic false negative rate (the error of 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;5G&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#20013;&#20849;&#20139;&#25968;&#25454;&#24211;&#22330;&#26223;&#19979;&#30340;&#25968;&#25454;&#38544;&#31169;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27927;&#29260;&#30340;&#21487;&#23398;&#20064;&#21152;&#23494;&#25216;&#26415;&#26469;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#25968;&#25454;&#38544;&#31169;&#12290;</title><link>https://arxiv.org/abs/2402.09710</link><description>&lt;p&gt;
&#22312;&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#20013;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#39537;&#21160;&#30340;&#24212;&#29992;&#30340;&#25968;&#25454;&#38544;&#31169;
&lt;/p&gt;
&lt;p&gt;
Preserving Data Privacy for ML-driven Applications in Open Radio Access Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09710
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;5G&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#20013;&#20849;&#20139;&#25968;&#25454;&#24211;&#22330;&#26223;&#19979;&#30340;&#25968;&#25454;&#38544;&#31169;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27927;&#29260;&#30340;&#21487;&#23398;&#20064;&#21152;&#23494;&#25216;&#26415;&#26469;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#25968;&#25454;&#38544;&#31169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#25552;&#20379;&#20102;&#19968;&#31181;&#25913;&#36827;&#39057;&#35889;&#35775;&#38382;&#25216;&#26415;&#30340;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#36890;&#36807;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#26469;&#31649;&#29702;&#21644;&#20849;&#20139;&#26377;&#38480;&#30340;&#39057;&#35889;&#36164;&#28304;&#65292;&#29992;&#20110;&#26032;&#20852;&#24212;&#29992;&#12290;&#23545;&#20110;&#20854;&#20013;&#20960;&#31181;&#24212;&#29992;&#65292;&#25935;&#24863;&#30340;&#26080;&#32447;&#25968;&#25454;&#65288;&#22914;&#39057;&#35889;&#22270;&#65289;&#23384;&#20648;&#22312;&#20849;&#20139;&#25968;&#25454;&#24211;&#25110;&#22810;&#26041;&#21033;&#30410;&#30456;&#20851;&#32773;&#20113;&#29615;&#22659;&#20013;&#65292;&#22240;&#27492;&#23481;&#26131;&#36896;&#25104;&#38544;&#31169;&#27844;&#28431;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#30740;&#31350;5G&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#20013;&#20849;&#20139;&#25968;&#25454;&#24211;&#22330;&#26223;&#30340;&#20856;&#22411;&#26696;&#20363;&#26469;&#35299;&#20915;&#27492;&#31867;&#38544;&#31169;&#38382;&#39064;&#65292;&#22312;&#36825;&#20123;&#22330;&#26223;&#20013;&#65292;&#25105;&#20204;&#22312;&#36817;&#23454;&#26102;&#65288;near-RT&#65289;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#26234;&#33021;&#25511;&#21046;&#22120;&#20013;&#26377;&#19968;&#20010;&#20849;&#20139;&#25968;&#25454;&#24211;&#12290;&#25105;&#20204;&#30528;&#37325;&#35752;&#35770;&#20102;&#22914;&#20309;&#20445;&#25252;&#29992;&#20110;&#39057;&#35889;&#20849;&#20139;&#21644;&#24178;&#25200;&#32531;&#35299;&#24212;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#27169;&#22411;&#25152;&#20351;&#29992;&#30340;&#25968;&#25454;&#65292;&#21516;&#26102;&#19981;&#24433;&#21709;&#27169;&#22411;&#21644;&#32593;&#32476;&#30340;&#24615;&#33021;&#12290;&#20854;&#20013;&#30340;&#22522;&#26412;&#24819;&#27861;&#26159;&#21033;&#29992;&#22522;&#20110;&#27927;&#29260;&#30340;&#21487;&#23398;&#20064;&#21152;&#23494;&#25216;&#26415;&#26469;&#21152;&#23494;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09710v1 Announce Type: cross  Abstract: Deep learning offers a promising solution to improve spectrum access techniques by utilizing data-driven approaches to manage and share limited spectrum resources for emerging applications. For several of these applications, the sensitive wireless data (such as spectrograms) are stored in a shared database or multistakeholder cloud environment and are therefore prone to privacy leaks. This paper aims to address such privacy concerns by examining the representative case study of shared database scenarios in 5G Open Radio Access Network (O-RAN) networks where we have a shared database within the near-real-time (near-RT) RAN intelligent controller. We focus on securing the data that can be used by machine learning (ML) models for spectrum sharing and interference mitigation applications without compromising the model and network performances. The underlying idea is to leverage a (i) Shuffling-based learnable encryption technique to encryp
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21435;&#20013;&#24515;&#21270;&#23398;&#20064;&#20013;&#65292;&#34987;&#21160;&#30340;&#22909;&#22855;&#25932;&#25163;&#21487;&#20197;&#22312;&#20960;&#27425;&#20445;&#25252;&#38544;&#31169;&#30340;&#27714;&#21644;&#25805;&#20316;&#21518;&#25512;&#26029;&#20986;&#20854;&#20182;&#29992;&#25143;&#30340;&#31169;&#20154;&#25968;&#25454;&#12290;</title><link>https://arxiv.org/abs/2312.05248</link><description>&lt;p&gt;
&#22522;&#20110;&#25299;&#25169;&#30340;&#21435;&#37325;&#24314;&#38450;&#25252;&#22312;&#21435;&#20013;&#24515;&#21270;&#23398;&#20064;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Topology-Based Reconstruction Prevention for Decentralised Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.05248
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21435;&#20013;&#24515;&#21270;&#23398;&#20064;&#20013;&#65292;&#34987;&#21160;&#30340;&#22909;&#22855;&#25932;&#25163;&#21487;&#20197;&#22312;&#20960;&#27425;&#20445;&#25252;&#38544;&#31169;&#30340;&#27714;&#21644;&#25805;&#20316;&#21518;&#25512;&#26029;&#20986;&#20854;&#20182;&#29992;&#25143;&#30340;&#31169;&#20154;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#21435;&#20013;&#24515;&#21270;&#23398;&#20064;&#20316;&#20026;&#19968;&#31181;&#26367;&#20195;&#32852;&#37030;&#23398;&#20064;&#30340;&#26041;&#24335;&#65292;&#33719;&#24471;&#20102;&#20154;&#20204;&#30340;&#20851;&#27880;&#65292;&#20854;&#20013;&#25968;&#25454;&#21644;&#21327;&#35843;&#37117;&#20998;&#24067;&#22312;&#29992;&#25143;&#20043;&#38388;&#12290;&#20026;&#20102;&#20445;&#25252;&#25968;&#25454;&#30340;&#26426;&#23494;&#24615;&#65292;&#21435;&#20013;&#24515;&#21270;&#23398;&#20064;&#20381;&#36182;&#20110;&#24046;&#20998;&#38544;&#31169;&#12289;&#22810;&#26041;&#35745;&#31639;&#65292;&#25110;&#32773;&#20108;&#32773;&#30340;&#32467;&#21512;&#12290;&#28982;&#32780;&#65292;&#36830;&#32493;&#36816;&#34892;&#22810;&#20010;&#20445;&#25252;&#38544;&#31169;&#30340;&#27714;&#21644;&#25805;&#20316;&#21487;&#33021;&#20250;&#20351;&#23545;&#25163;&#36827;&#34892;&#37325;&#24314;&#25915;&#20987;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#24403;&#21069;&#30340;&#37325;&#24314;&#23545;&#31574;&#35201;&#20040;&#26080;&#27861;&#31616;&#21333;&#22320;&#36866;&#24212;&#20998;&#24067;&#24335;&#29615;&#22659;&#65292;&#35201;&#20040;&#20250;&#28155;&#21152;&#36807;&#22810;&#30340;&#22122;&#38899;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#34920;&#26126;&#65292;&#34987;&#21160;&#30340;&#22909;&#22855;&#25932;&#25163;&#21487;&#20197;&#22312;&#20960;&#27425;&#20445;&#25252;&#38544;&#31169;&#30340;&#27714;&#21644;&#20043;&#21518;&#25512;&#26029;&#20986;&#20854;&#20182;&#29992;&#25143;&#30340;&#31169;&#20154;&#25968;&#25454;&#12290;&#20363;&#22914;&#65292;&#22312;&#25299;&#25169;&#20013;&#26377;18&#20010;&#29992;&#25143;&#30340;&#23376;&#22270;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#21482;&#26377;&#19977;&#20010;&#34987;&#21160;&#30340;&#22909;&#22855;&#25932;&#25163;&#25104;&#21151;&#37325;&#24314;&#31169;&#20154;&#25968;&#25454;&#30340;&#27010;&#29575;&#20026;11.0%&#65292;&#24179;&#22343;&#27599;&#20010;&#23545;&#25163;&#38656;&#35201;8.8&#27425;&#27714;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.05248v2 Announce Type: replace-cross  Abstract: Decentralised learning has recently gained traction as an alternative to federated learning in which both data and coordination are distributed over its users. To preserve data confidentiality, decentralised learning relies on differential privacy, multi-party computation, or a combination thereof. However, running multiple privacy-preserving summations in sequence may allow adversaries to perform reconstruction attacks. Unfortunately, current reconstruction countermeasures either cannot trivially be adapted to the distributed setting, or add excessive amounts of noise.   In this work, we first show that passive honest-but-curious adversaries can infer other users' private data after several privacy-preserving summations. For example, in subgraphs with 18 users, we show that only three passive honest-but-curious adversaries succeed at reconstructing private data 11.0% of the time, requiring an average of 8.8 summations per adve
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#20027;&#21160;&#24615;&#30340;&#21452;&#37325;&#38450;&#25252;&#26426;&#21046;&#65292;&#36890;&#36807;&#24341;&#20837;&#20154;&#31867;&#26080;&#27861;&#23519;&#35273;&#30340;&#25200;&#21160;&#65292;&#24178;&#25200;&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;&#30340;&#29983;&#25104;&#36807;&#31243;&#65292;&#38450;&#27490;&#26410;&#32463;&#25480;&#26435;&#30340;&#22522;&#20110;&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;&#30340;&#38750;&#27861;&#27468;&#26354;&#32763;&#21809;&#12290;&#35813;&#26426;&#21046;&#26082;&#25200;&#20081;&#20102;&#27468;&#25163;&#36523;&#20221;&#65292;&#21448;&#25200;&#20081;&#20102;&#27468;&#35789;&#65292;&#20351;&#24471;&#27468;&#21809;&#22768;&#38899;&#26082;&#19981;&#27169;&#20223;&#30446;&#26631;&#27468;&#25163;&#65292;&#20063;&#19981;&#20445;&#30041;&#21407;&#22987;&#27468;&#35789;&#12290;</title><link>http://arxiv.org/abs/2401.17133</link><description>&lt;p&gt;
&#19968;&#31181;&#38024;&#23545;&#38750;&#27861;&#27468;&#26354;&#32763;&#21809;&#30340;&#20027;&#21160;&#24615;&#21452;&#37325;&#38450;&#25252;&#26426;&#21046;&#65306;&#22522;&#20110;&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;&#30340;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
A Proactive and Dual Prevention Mechanism against Illegal Song Covers empowered by Singing Voice Conversion. (arXiv:2401.17133v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.17133
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#20027;&#21160;&#24615;&#30340;&#21452;&#37325;&#38450;&#25252;&#26426;&#21046;&#65292;&#36890;&#36807;&#24341;&#20837;&#20154;&#31867;&#26080;&#27861;&#23519;&#35273;&#30340;&#25200;&#21160;&#65292;&#24178;&#25200;&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;&#30340;&#29983;&#25104;&#36807;&#31243;&#65292;&#38450;&#27490;&#26410;&#32463;&#25480;&#26435;&#30340;&#22522;&#20110;&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;&#30340;&#38750;&#27861;&#27468;&#26354;&#32763;&#21809;&#12290;&#35813;&#26426;&#21046;&#26082;&#25200;&#20081;&#20102;&#27468;&#25163;&#36523;&#20221;&#65292;&#21448;&#25200;&#20081;&#20102;&#27468;&#35789;&#65292;&#20351;&#24471;&#27468;&#21809;&#22768;&#38899;&#26082;&#19981;&#27169;&#20223;&#30446;&#26631;&#27468;&#25163;&#65292;&#20063;&#19981;&#20445;&#30041;&#21407;&#22987;&#27468;&#35789;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;(SVC)&#36890;&#36807;&#23558;&#19968;&#20010;&#27468;&#25163;&#30340;&#27468;&#21809;&#22768;&#38899;&#36716;&#25442;&#25104;&#21478;&#19968;&#20010;&#30446;&#26631;&#27468;&#25163;&#30340;&#27468;&#21809;&#22768;&#38899;&#65292;&#24182;&#20351;&#29992;&#21407;&#22987;&#27468;&#35789;&#21644;&#26059;&#24459;&#65292;&#33258;&#21160;&#21270;&#20102;&#27468;&#26354;&#32763;&#21809;&#12290;&#28982;&#32780;&#65292;&#36825;&#24341;&#21457;&#20102;&#23545;&#29256;&#26435;&#21644;&#20844;&#27665;&#26435;&#21033;&#30340;&#20005;&#37325;&#25285;&#24551;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102; SongBsAb&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#20027;&#21160;&#24615;&#26041;&#27861;&#65292;&#29992;&#20110;&#20943;&#36731;&#26410;&#32463;&#25480;&#26435;&#30340;&#22522;&#20110; SVC &#30340;&#38750;&#27861;&#27468;&#26354;&#32763;&#21809;&#12290;SongBsAb &#22312;&#21457;&#24067;&#27468;&#21809;&#22768;&#38899;&#20043;&#21069;&#24341;&#20837;&#20102;&#20154;&#31867;&#26080;&#27861;&#23519;&#35273;&#30340;&#25200;&#21160;&#65292;&#36825;&#26679;&#24403;&#23427;&#20204;&#34987;&#20351;&#29992;&#26102;&#65292;SVC &#30340;&#29983;&#25104;&#36807;&#31243;&#23558;&#34987;&#24178;&#25200;&#65292;&#23548;&#33268;&#24847;&#22806;&#30340;&#27468;&#21809;&#22768;&#38899;&#12290; SongBsAb &#20855;&#26377;&#21452;&#37325;&#39044;&#38450;&#25928;&#26524;&#65292;&#24341;&#36215;&#27468;&#25163;&#36523;&#20221;&#21644;&#27468;&#35789;&#30340;&#28151;&#20081;&#65292;&#21363; SVC &#35206;&#30422;&#30340;&#27468;&#21809;&#22768;&#38899;&#26082;&#19981;&#27169;&#20223;&#30446;&#26631;&#27468;&#25163;&#65292;&#20063;&#19981;&#20445;&#30041;&#21407;&#22987;&#27468;&#35789;&#12290;&#20026;&#20102;&#25552;&#39640;&#25200;&#21160;&#30340;&#19981;&#21487;&#23519;&#35273;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#20010;&#20197;&#20276;&#22863;&#26354;&#20316;&#20026;&#39069;&#22806;&#25513;&#34109;&#32773;&#30340;&#22522;&#20110;&#24515;&#29702;&#22768;&#23398;&#27169;&#22411;&#30340;&#25439;&#22833;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Singing voice conversion (SVC) automates song covers by converting one singer's singing voice into another target singer's singing voice with the original lyrics and melody. However, it raises serious concerns about copyright and civil right infringements to multiple entities. This work proposes SongBsAb, the first proactive approach to mitigate unauthorized SVC-based illegal song covers. SongBsAb introduces human-imperceptible perturbations to singing voices before releasing them, so that when they are used, the generation process of SVC will be interfered, resulting in unexpected singing voices. SongBsAb features a dual prevention effect by causing both (singer) identity disruption and lyric disruption, namely, the SVC-covered singing voice neither imitates the target singer nor preserves the original lyrics. To improve the imperceptibility of perturbations, we refine a psychoacoustic model-based loss with the backing track as an additional masker, a unique accompanying element for s
&lt;/p&gt;</description></item><item><title>&#26657;&#20934;&#25915;&#20987;&#26159;&#19968;&#31181;&#26032;&#30340;&#23545;&#25239;&#25915;&#20987;&#26694;&#26550;&#65292;&#36890;&#36807;&#29983;&#25104;&#21644;&#32452;&#32455;&#25915;&#20987;&#26469;&#20351;&#21463;&#23475;&#27169;&#22411;&#22833;&#21435;&#20934;&#30830;&#26657;&#20934;&#65292;&#32780;&#19981;&#24433;&#21709;&#20854;&#21407;&#22987;&#20934;&#30830;&#24615;&#12290;&#36825;&#23545;&#27169;&#22411;&#30340;&#21487;&#20449;&#24230;&#21644;&#22522;&#20110;&#32622;&#20449;&#20998;&#25968;&#30340;&#20915;&#31574;&#26500;&#25104;&#20005;&#37325;&#23041;&#32961;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#31181;&#26657;&#20934;&#25915;&#20987;&#24418;&#24335;&#65292;&#24182;&#23545;&#24120;&#29992;&#30340;&#23545;&#25239;&#38450;&#24481;&#21644;&#26657;&#20934;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2401.02718</link><description>&lt;p&gt;
&#35770;&#25991;&#26631;&#39064;&#65306;&#26657;&#20934;&#25915;&#20987;&#65306;&#38024;&#23545;&#26657;&#20934;&#24615;&#30340;&#23545;&#25239;&#25915;&#20987;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Calibration Attack: A Framework For Adversarial Attacks Targeting Calibration. (arXiv:2401.02718v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.02718
&lt;/p&gt;
&lt;p&gt;
&#26657;&#20934;&#25915;&#20987;&#26159;&#19968;&#31181;&#26032;&#30340;&#23545;&#25239;&#25915;&#20987;&#26694;&#26550;&#65292;&#36890;&#36807;&#29983;&#25104;&#21644;&#32452;&#32455;&#25915;&#20987;&#26469;&#20351;&#21463;&#23475;&#27169;&#22411;&#22833;&#21435;&#20934;&#30830;&#26657;&#20934;&#65292;&#32780;&#19981;&#24433;&#21709;&#20854;&#21407;&#22987;&#20934;&#30830;&#24615;&#12290;&#36825;&#23545;&#27169;&#22411;&#30340;&#21487;&#20449;&#24230;&#21644;&#22522;&#20110;&#32622;&#20449;&#20998;&#25968;&#30340;&#20915;&#31574;&#26500;&#25104;&#20005;&#37325;&#23041;&#32961;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#31181;&#26657;&#20934;&#25915;&#20987;&#24418;&#24335;&#65292;&#24182;&#23545;&#24120;&#29992;&#30340;&#23545;&#25239;&#38450;&#24481;&#21644;&#26657;&#20934;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;&#26657;&#20934;&#25915;&#20987;&#30340;&#26032;&#23545;&#25239;&#25915;&#20987;&#26694;&#26550;&#65292;&#20854;&#20013;&#25915;&#20987;&#34987;&#29983;&#25104;&#21644;&#32452;&#32455;&#20197;&#20351;&#21463;&#23475;&#27169;&#22411;&#22833;&#21435;&#20934;&#30830;&#26657;&#20934;&#65292;&#21516;&#26102;&#19981;&#25913;&#21464;&#20854;&#21407;&#22987;&#20934;&#30830;&#24615;&#65292;&#20174;&#32780;&#20005;&#37325;&#21361;&#21450;&#27169;&#22411;&#30340;&#21487;&#20449;&#24230;&#21644;&#22522;&#20110;&#20854;&#32622;&#20449;&#20998;&#25968;&#30340;&#20219;&#20309;&#20915;&#31574;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#22235;&#31181;&#26032;&#22411;&#26657;&#20934;&#25915;&#20987;&#24418;&#24335;&#65306;&#20302;&#32622;&#20449;&#25915;&#20987;&#12289;&#39640;&#32622;&#20449;&#25915;&#20987;&#12289;&#26368;&#22823;&#22833;&#30495;&#25915;&#20987;&#21644;&#38543;&#26426;&#32622;&#20449;&#25915;&#20987;&#65292;&#36866;&#29992;&#20110;&#30333;&#30418;&#21644;&#40657;&#30418;&#35774;&#32622;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#20840;&#38754;&#30340;&#25968;&#25454;&#38598;&#23545;&#20856;&#22411;&#30340;&#21463;&#23475;&#27169;&#22411;&#36827;&#34892;&#20102;&#36825;&#20123;&#26032;&#22411;&#25915;&#20987;&#30340;&#27979;&#35797;&#65292;&#35777;&#26126;&#21363;&#20351;&#21482;&#36827;&#34892;&#30456;&#23545;&#36739;&#23569;&#30340;&#26597;&#35810;&#65292;&#25915;&#20987;&#20063;&#33021;&#36896;&#25104;&#37325;&#22823;&#30340;&#26657;&#20934;&#38169;&#35823;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#35814;&#32454;&#30340;&#20998;&#26512;&#20197;&#20102;&#35299;&#26657;&#20934;&#25915;&#20987;&#30340;&#19981;&#21516;&#26041;&#38754;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#24191;&#27867;&#20351;&#29992;&#30340;&#23545;&#25239;&#38450;&#24481;&#21644;&#26657;&#20934;&#26041;&#27861;&#23545;&#36825;&#20123;&#25915;&#20987;&#31867;&#22411;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a new framework of adversarial attacks, named calibration attacks, in which the attacks are generated and organized to trap victim models to be miscalibrated without altering their original accuracy, hence seriously endangering the trustworthiness of the models and any decision-making based on their confidence scores. Specifically, we identify four novel forms of calibration attacks: underconfidence attacks, overconfidence attacks, maximum miscalibration attacks, and random confidence attacks, in both the black-box and white-box setups. We then test these new attacks on typical victim models with comprehensive datasets, demonstrating that even with a relatively low number of queries, the attacks can create significant calibration mistakes. We further provide detailed analyses to understand different aspects of calibration attacks. Building on that, we investigate the effectiveness of widely used adversarial defences and calibration methods against these types of attacks, w
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#32508;&#36848;&#65292;&#20197;&#35299;&#20915;&#21307;&#23398;&#39046;&#22495;&#20013;&#25968;&#25454;&#20351;&#29992;&#21644;&#38544;&#31169;&#20445;&#25252;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.12380</link><description>&lt;p&gt;
&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#65306;&#19968;&#39033;&#31995;&#32479;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Methods for generating and evaluating synthetic longitudinal patient data: a systematic review. (arXiv:2309.12380v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12380
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#32508;&#36848;&#65292;&#20197;&#35299;&#20915;&#21307;&#23398;&#39046;&#22495;&#20013;&#25968;&#25454;&#20351;&#29992;&#21644;&#38544;&#31169;&#20445;&#25252;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#25968;&#25454;&#30340;&#36805;&#29467;&#22686;&#38271;&#20419;&#36827;&#20102;&#21508;&#31181;&#32479;&#35745;&#21644;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#30340;&#21457;&#23637;&#21644;&#24212;&#29992;&#65292;&#21152;&#24555;&#20102;&#30740;&#31350;&#21644;&#24320;&#21457;&#27963;&#21160;&#12290;&#28982;&#32780;&#65292;&#24182;&#38750;&#25152;&#26377;&#34892;&#19994;&#37117;&#33021;&#20174;&#25968;&#25454;&#30340;&#22686;&#21152;&#20013;&#21516;&#31561;&#21463;&#30410;&#65292;&#37096;&#20998;&#21407;&#22240;&#26159;&#30001;&#20110;&#25968;&#25454;&#20351;&#29992;&#21644;&#38544;&#31169;&#35268;&#23450;&#30340;&#27861;&#24459;&#38480;&#21046;&#65292;&#20363;&#22914;&#21307;&#23398;&#39046;&#22495;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#32479;&#35745;&#25259;&#38706;&#21644;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#65292;&#21253;&#25324;&#20351;&#29992;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#12290;&#21512;&#25104;&#25968;&#25454;&#26159;&#22522;&#20110;&#19968;&#20123;&#29616;&#26377;&#25968;&#25454;&#29983;&#25104;&#30340;&#65292;&#30446;&#30340;&#26159;&#23613;&#21487;&#33021;&#22320;&#22797;&#21046;&#23427;&#20204;&#65292;&#24182;&#20805;&#24403;&#30495;&#23454;&#25935;&#24863;&#25968;&#25454;&#30340;&#20195;&#29702;&#12290;&#26412;&#25991;&#23545;&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#32508;&#36848;&#65292;&#36825;&#26159;&#21307;&#23398;&#39046;&#22495;&#20013;&#19968;&#31181;&#24120;&#35265;&#30340;&#25968;&#25454;&#31867;&#22411;&#12290;&#35813;&#32508;&#36848;&#36981;&#24490;PRISMA&#25351;&#21335;&#65292;&#24182;&#28085;&#30422;&#20102;&#33258;2022&#24180;&#24213;&#20197;&#26469;&#30340;&#20116;&#20010;&#25968;&#25454;&#24211;&#30340;&#25991;&#29486;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;17&#31181;&#26041;&#27861;&#65292;&#20174;&#20256;&#32479;&#26041;&#27861;&#21040;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The proliferation of data in recent years has led to the advancement and utilization of various statistical and deep learning techniques, thus expediting research and development activities. However, not all industries have benefited equally from the surge in data availability, partly due to legal restrictions on data usage and privacy regulations, such as in medicine. To address this issue, various statistical disclosure and privacy-preserving methods have been proposed, including the use of synthetic data generation. Synthetic data are generated based on some existing data, with the aim of replicating them as closely as possible and acting as a proxy for real sensitive data. This paper presents a systematic review of methods for generating and evaluating synthetic longitudinal patient data, a prevalent data type in medicine. The review adheres to the PRISMA guidelines and covers literature from five databases until the end of 2022. The paper describes 17 methods, ranging from traditi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;FLANDERS&#65292;&#19968;&#31181;&#22522;&#20110;&#30697;&#38453;&#33258;&#22238;&#24402;&#30340;&#32852;&#37030;&#23398;&#20064;&#32858;&#21512;&#26041;&#26696;&#65292;&#21487;&#20197;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#31471;&#65292;&#24182;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#25308;&#21344;&#24237;&#25915;&#20987;&#38450;&#24481;&#12290;</title><link>http://arxiv.org/abs/2303.16668</link><description>&lt;p&gt;
&#22522;&#20110;&#30697;&#38453;&#33258;&#22238;&#24402;&#30340;&#32852;&#37030;&#23398;&#20064;&#25308;&#21344;&#24237;&#23481;&#38169;&#32858;&#21512;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
A Byzantine-Resilient Aggregation Scheme for Federated Learning via Matrix Autoregression on Client Updates. (arXiv:2303.16668v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16668
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;FLANDERS&#65292;&#19968;&#31181;&#22522;&#20110;&#30697;&#38453;&#33258;&#22238;&#24402;&#30340;&#32852;&#37030;&#23398;&#20064;&#32858;&#21512;&#26041;&#26696;&#65292;&#21487;&#20197;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#31471;&#65292;&#24182;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#25308;&#21344;&#24237;&#25915;&#20987;&#38450;&#24481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;FLANDERS&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#32858;&#21512;&#26041;&#26696;&#65292;&#21487;&#20197;&#25269;&#24481;&#25308;&#21344;&#24237;&#25915;&#20987;&#12290;FLANDERS&#23558;&#27599;&#20010;FL&#36718;&#27425;&#20013;&#30001;&#23458;&#25143;&#31471;&#21457;&#36865;&#30340;&#26412;&#22320;&#27169;&#22411;&#26356;&#26032;&#35270;&#20026;&#30697;&#38453;&#20540;&#26102;&#38388;&#24207;&#21015;&#12290;&#28982;&#21518;&#65292;&#36890;&#36807;&#23558;&#23454;&#38469;&#35266;&#27979;&#19982;&#30001;&#30697;&#38453;&#33258;&#22238;&#24402;&#39044;&#27979;&#27169;&#22411;&#20272;&#35745;&#30340;&#35266;&#27979;&#36827;&#34892;&#27604;&#36739;&#65292;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#31471;&#20316;&#20026;&#36825;&#20010;&#26102;&#38388;&#24207;&#21015;&#30340;&#24322;&#24120;&#20540;&#12290;&#22312;&#19981;&#21516;FL&#35774;&#32622;&#19979;&#23545;&#22810;&#20010;&#25968;&#25454;&#38598;&#36827;&#34892;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;FLANDERS&#22312;&#25269;&#24481;&#25308;&#21344;&#24237;&#25915;&#20987;&#26041;&#38754;&#19982;&#26368;&#24378;&#22823;&#30340;&#22522;&#32447;&#30456;&#21305;&#37197;&#12290;&#27492;&#22806;&#65292;&#19982;&#29616;&#26377;&#30340;&#38450;&#24481;&#31574;&#30053;&#30456;&#27604;&#65292; FLANDERS&#21363;&#20351;&#22312;&#26497;&#20854;&#20005;&#37325;&#30340;&#25915;&#20987;&#22330;&#26223;&#19979;&#20173;&#28982;&#38750;&#24120;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we propose FLANDERS, a novel federated learning (FL) aggregation scheme robust to Byzantine attacks. FLANDERS considers the local model updates sent by clients at each FL round as a matrix-valued time series. Then, it identifies malicious clients as outliers of this time series by comparing actual observations with those estimated by a matrix autoregressive forecasting model. Experiments conducted on several datasets under different FL settings demonstrate that FLANDERS matches the robustness of the most powerful baselines against Byzantine clients. Furthermore, FLANDERS remains highly effective even under extremely severe attack scenarios, as opposed to existing defense strategies.
&lt;/p&gt;</description></item></channel></rss>