<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21322;&#20998;&#25955;&#32593;&#32476;&#30340;&#36890;&#20449;&#39640;&#25928;&#31639;&#27861;PISCO, &#36890;&#36807;&#27010;&#29575;&#24615;&#30340;&#20195;&#29702;&#38388;&#21644;&#20195;&#29702;&#19982;&#26381;&#21153;&#22120;&#20043;&#38388;&#30340;&#36890;&#20449;&#65292;&#23454;&#29616;&#20102;&#36890;&#20449;&#25928;&#29575;&#19982;&#25910;&#25947;&#36895;&#24230;&#30340;&#25240;&#34935;&#12290;</title><link>http://arxiv.org/abs/2311.18787</link><description>&lt;p&gt;
&#36890;&#20449;&#39640;&#25928;&#30340;&#21322;&#20998;&#25955;&#32593;&#32476;&#32852;&#37030;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Communication-Efficient Federated Optimization over Semi-Decentralized Networks. (arXiv:2311.18787v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.18787
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21322;&#20998;&#25955;&#32593;&#32476;&#30340;&#36890;&#20449;&#39640;&#25928;&#31639;&#27861;PISCO, &#36890;&#36807;&#27010;&#29575;&#24615;&#30340;&#20195;&#29702;&#38388;&#21644;&#20195;&#29702;&#19982;&#26381;&#21153;&#22120;&#20043;&#38388;&#30340;&#36890;&#20449;&#65292;&#23454;&#29616;&#20102;&#36890;&#20449;&#25928;&#29575;&#19982;&#25910;&#25947;&#36895;&#24230;&#30340;&#25240;&#34935;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#30340;&#32852;&#37030;&#21644;&#20998;&#25955;&#24335;&#23398;&#20064;&#20013;&#65292;&#36890;&#20449;&#25928;&#29575;&#26159;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#29942;&#39048;&#20043;&#19968;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#20998;&#25955;&#36890;&#20449;&#21327;&#35758;&#19979;&#30340;&#36890;&#20449;&#39640;&#25928;&#31639;&#27861;PISCO&#65292;&#36890;&#36807;&#27010;&#29575;&#24615;&#30340;&#20195;&#29702;&#38388;&#21644;&#20195;&#29702;&#19982;&#26381;&#21153;&#22120;&#20043;&#38388;&#30340;&#36890;&#20449;&#65292;&#23454;&#29616;&#20102;&#36890;&#20449;&#25928;&#29575;&#19982;&#25910;&#25947;&#36895;&#24230;&#30340;&#25240;&#34935;&#12290;PISCO&#31639;&#27861;&#36890;&#36807;&#26799;&#24230;&#36861;&#36394;&#21644;&#22810;&#20010;&#26412;&#22320;&#26356;&#26032;&#20445;&#35777;&#20102;&#23545;&#25968;&#25454;&#24322;&#36136;&#24615;&#30340;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;PISCO&#31639;&#27861;&#22312;&#38750;&#20984;&#38382;&#39064;&#19978;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#25968;&#37327;&#26041;&#38754;&#65292;PISCO&#31639;&#27861;&#20855;&#26377;&#32447;&#24615;&#21152;&#36895;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In large-scale federated and decentralized learning, communication efficiency is one of the most challenging bottlenecks. While gossip communication -- where agents can exchange information with their connected neighbors -- is more cost-effective than communicating with the remote server, it often requires a greater number of communication rounds, especially for large and sparse networks. To tackle the trade-off, we examine the communication efficiency under a semi-decentralized communication protocol, in which agents can perform both agent-to-agent and agent-to-server communication in a probabilistic manner. We design a tailored communication-efficient algorithm over semi-decentralized networks, referred to as PISCO, which inherits the robustness to data heterogeneity thanks to gradient tracking and allows multiple local updates for saving communication. We establish the convergence rate of PISCO for nonconvex problems and show that PISCO enjoys a linear speedup in terms of the number
&lt;/p&gt;</description></item></channel></rss>