<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#36825;&#31181;&#25216;&#26415;&#21487;&#20197;&#31616;&#21270;&#20998;&#26512;&#20381;&#36182;&#36731;&#23614;&#38543;&#26426;&#28304;&#30340;&#31639;&#27861;&#65292;&#36890;&#36807;&#23545;&#36739;&#31616;&#21333;&#30340;&#31639;&#27861;&#21464;&#20307;&#36827;&#34892;&#20998;&#26512;&#65292;&#36991;&#20813;&#20351;&#29992;&#19987;&#38376;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#65292;&#24182;&#19988;&#36866;&#29992;&#20110;&#25351;&#25968;&#12289;&#20122;&#39640;&#26031;&#21644;&#26356;&#19968;&#33324;&#30340;&#24555;&#36895;&#34928;&#20943;&#20998;&#24067;&#12290;</title><link>https://arxiv.org/abs/2403.02873</link><description>&lt;p&gt;
&#20851;&#20110;&#20855;&#26377;&#25351;&#25968;&#12289;&#20122;&#39640;&#26031;&#21644;&#19968;&#33324;&#36731;&#23614;&#30340;&#39640;&#27010;&#29575;&#20998;&#26512;&#31639;&#27861;&#30340;&#27880;&#35299;
&lt;/p&gt;
&lt;p&gt;
A Note on High-Probability Analysis of Algorithms with Exponential, Sub-Gaussian, and General Light Tails
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02873
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31181;&#25216;&#26415;&#21487;&#20197;&#31616;&#21270;&#20998;&#26512;&#20381;&#36182;&#36731;&#23614;&#38543;&#26426;&#28304;&#30340;&#31639;&#27861;&#65292;&#36890;&#36807;&#23545;&#36739;&#31616;&#21333;&#30340;&#31639;&#27861;&#21464;&#20307;&#36827;&#34892;&#20998;&#26512;&#65292;&#36991;&#20813;&#20351;&#29992;&#19987;&#38376;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#65292;&#24182;&#19988;&#36866;&#29992;&#20110;&#25351;&#25968;&#12289;&#20122;&#39640;&#26031;&#21644;&#26356;&#19968;&#33324;&#30340;&#24555;&#36895;&#34928;&#20943;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#31616;&#30701;&#30340;&#27880;&#35299;&#25551;&#36848;&#20102;&#19968;&#31181;&#20998;&#26512;&#27010;&#29575;&#31639;&#27861;&#30340;&#31616;&#21333;&#25216;&#26415;&#65292;&#35813;&#31639;&#27861;&#20381;&#36182;&#20110;&#19968;&#20010;&#36731;&#23614;&#65288;&#20294;&#19981;&#19968;&#23450;&#26377;&#30028;&#65289;&#30340;&#38543;&#26426;&#21270;&#26469;&#28304;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#26679;&#19968;&#20010;&#31639;&#27861;&#30340;&#20998;&#26512;&#21487;&#20197;&#36890;&#36807;&#40657;&#30418;&#26041;&#24335;&#20943;&#23569;&#65292;&#21482;&#22312;&#23545;&#25968;&#22240;&#23376;&#20013;&#26377;&#23567;&#37327;&#25439;&#22833;&#65292;&#36716;&#21270;&#20026;&#20998;&#26512;&#21516;&#19968;&#31639;&#27861;&#30340;&#19968;&#20010;&#26356;&#31616;&#21333;&#21464;&#20307;&#65292;&#35813;&#21464;&#20307;&#20351;&#29992;&#26377;&#30028;&#38543;&#26426;&#21464;&#37327;&#65292;&#36890;&#24120;&#26356;&#23481;&#26131;&#20998;&#26512;&#12290;&#36825;&#31181;&#26041;&#27861;&#21516;&#26102;&#36866;&#29992;&#20110;&#20219;&#20309;&#36731;&#23614;&#38543;&#26426;&#21270;&#65292;&#21253;&#25324;&#25351;&#25968;&#12289;&#20122;&#39640;&#26031;&#21644;&#26356;&#19968;&#33324;&#30340;&#24555;&#36895;&#34928;&#20943;&#20998;&#24067;&#65292;&#32780;&#19981;&#38656;&#35201;&#35843;&#29992;&#19987;&#38376;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#12290;&#25552;&#20379;&#20102;&#23545;&#19968;&#33324;&#21270;Azuma&#19981;&#31561;&#24335;&#21644;&#20855;&#26377;&#19968;&#33324;&#36731;&#23614;&#22122;&#22768;&#30340;&#38543;&#26426;&#20248;&#21270;&#30340;&#20998;&#26512;&#65292;&#20197;&#35828;&#26126;&#35813;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02873v1 Announce Type: new  Abstract: This short note describes a simple technique for analyzing probabilistic algorithms that rely on a light-tailed (but not necessarily bounded) source of randomization. We show that the analysis of such an algorithm can be reduced, in a black-box manner and with only a small loss in logarithmic factors, to an analysis of a simpler variant of the same algorithm that uses bounded random variables and often easier to analyze. This approach simultaneously applies to any light-tailed randomization, including exponential, sub-Gaussian, and more general fast-decaying distributions, without needing to appeal to specialized concentration inequalities. Analyses of a generalized Azuma inequality and stochastic optimization with general light-tailed noise are provided to illustrate the technique.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35752;&#35770;&#20102;&#22810;&#26679;&#24615;&#24863;&#30693;&#32858;&#31867;&#38382;&#39064;&#65292;&#22312;&#36873;&#25321;&#32858;&#31867;&#20013;&#24515;&#26102;&#35201;&#32771;&#34385;&#22810;&#20010;&#23646;&#24615;&#65292;&#21516;&#26102;&#26368;&#23567;&#21270;&#32858;&#31867;&#30446;&#26631;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#38024;&#23545;&#19981;&#21516;&#32858;&#31867;&#30446;&#26631;&#30340;&#21442;&#25968;&#21270;&#36817;&#20284;&#31639;&#27861;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#20445;&#35777;&#32858;&#31867;&#36136;&#37327;&#30340;&#21516;&#26102;&#65292;&#20855;&#26377;&#32039;&#30830;&#30340;&#36817;&#20284;&#27604;&#12290;</title><link>http://arxiv.org/abs/2401.05502</link><description>&lt;p&gt;
&#22810;&#26679;&#24615;&#24863;&#30693;&#32858;&#31867;&#65306;&#35745;&#31639;&#22797;&#26434;&#24615;&#21644;&#36817;&#20284;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Diversity-aware clustering: Computational Complexity and Approximation Algorithms. (arXiv:2401.05502v1 [cs.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05502
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35752;&#35770;&#20102;&#22810;&#26679;&#24615;&#24863;&#30693;&#32858;&#31867;&#38382;&#39064;&#65292;&#22312;&#36873;&#25321;&#32858;&#31867;&#20013;&#24515;&#26102;&#35201;&#32771;&#34385;&#22810;&#20010;&#23646;&#24615;&#65292;&#21516;&#26102;&#26368;&#23567;&#21270;&#32858;&#31867;&#30446;&#26631;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#38024;&#23545;&#19981;&#21516;&#32858;&#31867;&#30446;&#26631;&#30340;&#21442;&#25968;&#21270;&#36817;&#20284;&#31639;&#27861;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#20445;&#35777;&#32858;&#31867;&#36136;&#37327;&#30340;&#21516;&#26102;&#65292;&#20855;&#26377;&#32039;&#30830;&#30340;&#36817;&#20284;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22810;&#26679;&#24615;&#24863;&#30693;&#32858;&#31867;&#38382;&#39064;&#65292;&#20854;&#20013;&#25968;&#25454;&#28857;&#19982;&#22810;&#20010;&#23646;&#24615;&#30456;&#20851;&#32852;&#65292;&#24418;&#25104;&#20132;&#21449;&#30340;&#32452;&#12290;&#32858;&#31867;&#35299;&#20915;&#26041;&#26696;&#38656;&#35201;&#30830;&#20445;&#20174;&#27599;&#20010;&#32452;&#20013;&#36873;&#25321;&#26368;&#23569;&#25968;&#37327;&#30340;&#32858;&#31867;&#20013;&#24515;&#65292;&#21516;&#26102;&#26368;&#23567;&#21270;&#32858;&#31867;&#30446;&#26631;&#65292;&#21487;&#20197;&#26159;$k$-&#20013;&#20301;&#25968;&#65292;$k$-&#22343;&#20540;&#25110;$k$-&#20379;&#24212;&#21830;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#21442;&#25968;&#21270;&#36817;&#20284;&#31639;&#27861;&#65292;&#36817;&#20284;&#27604;&#20998;&#21035;&#20026;$1+\frac{2}{e}$&#65292;$1+\frac{8}{e}$&#21644;$3$&#65292;&#29992;&#20110;&#22810;&#26679;&#24615;&#24863;&#30693;$k$-&#20013;&#20301;&#25968;&#65292;&#22810;&#26679;&#24615;&#24863;&#30693;$k$-&#22343;&#20540;&#21644;&#22810;&#26679;&#24615;&#24863;&#30693;$k$-&#20379;&#24212;&#21830;&#12290;&#36825;&#20123;&#36817;&#20284;&#27604;&#22312;&#20551;&#35774;Gap-ETH&#21644;FPT $\neq$ W[2]&#30340;&#24773;&#20917;&#19979;&#26159;&#32039;&#30830;&#30340;&#12290;&#23545;&#20110;&#20844;&#24179;$k$-&#20013;&#20301;&#25968;&#21644;&#20844;&#24179;$k$-&#22343;&#20540;&#30340;&#19981;&#30456;&#20132;&#24037;&#21378;&#32452;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21442;&#25968;&#21270;&#36817;&#20284;&#31639;&#27861;&#65292;&#36817;&#20284;&#27604;&#20998;&#21035;&#20026;$1+\frac{2}{e}$&#21644;$1+\frac{8}{e}$&#12290;&#23545;&#20110;&#20855;&#26377;&#19981;&#30456;&#20132;&#24037;&#21378;&#32452;&#30340;&#20844;&#24179;$k$-&#20379;&#24212;&#21830;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#36817;&#20284;&#31639;&#27861;&#65292;&#22240;&#23376;&#20026;$3$&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we study diversity-aware clustering problems where the data points are associated with multiple attributes resulting in intersecting groups. A clustering solution need to ensure that a minimum number of cluster centers are chosen from each group while simultaneously minimizing the clustering objective, which can be either $k$-median, $k$-means or $k$-supplier. We present parameterized approximation algorithms with approximation ratios $1+ \frac{2}{e}$, $1+\frac{8}{e}$ and $3$ for diversity-aware $k$-median, diversity-aware $k$-means and diversity-aware $k$-supplier, respectively. The approximation ratios are tight assuming Gap-ETH and FPT $\neq$ W[2]. For fair $k$-median and fair $k$-means with disjoint faicility groups, we present parameterized approximation algorithm with approximation ratios $1+\frac{2}{e}$ and $1+\frac{8}{e}$, respectively. For fair $k$-supplier with disjoint facility groups, we present a polynomial-time approximation algorithm with factor $3$, improv
&lt;/p&gt;</description></item></channel></rss>