<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>FeDEQ&#26159;&#19968;&#20010;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#65292;&#37319;&#29992;&#28145;&#24230;&#24179;&#34913;&#23398;&#20064;&#21644;&#20849;&#35782;&#20248;&#21270;&#65292;&#36890;&#36807;&#32039;&#20945;&#30340;&#20849;&#20139;&#25968;&#25454;&#34920;&#31034;&#22312;&#36793;&#32536;&#33410;&#28857;&#20043;&#38388;&#20849;&#20139;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#28145;&#24230;&#32852;&#37030;&#23398;&#20064;&#22312;&#36793;&#32536;&#29615;&#22659;&#20013;&#30340;&#36890;&#20449;&#29942;&#39048;&#21644;&#25968;&#25454;&#24322;&#26500;&#24615;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.15659</link><description>&lt;p&gt;
&#32852;&#37030;&#28145;&#24230;&#24179;&#34913;&#23398;&#20064;&#65306;&#36793;&#32536;&#36890;&#20449;&#25928;&#29575;&#30340;&#32039;&#20945;&#20849;&#20139;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Federated Deep Equilibrium Learning: A Compact Shared Representation for Edge Communication Efficiency. (arXiv:2309.15659v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15659
&lt;/p&gt;
&lt;p&gt;
FeDEQ&#26159;&#19968;&#20010;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#65292;&#37319;&#29992;&#28145;&#24230;&#24179;&#34913;&#23398;&#20064;&#21644;&#20849;&#35782;&#20248;&#21270;&#65292;&#36890;&#36807;&#32039;&#20945;&#30340;&#20849;&#20139;&#25968;&#25454;&#34920;&#31034;&#22312;&#36793;&#32536;&#33410;&#28857;&#20043;&#38388;&#20849;&#20139;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#28145;&#24230;&#32852;&#37030;&#23398;&#20064;&#22312;&#36793;&#32536;&#29615;&#22659;&#20013;&#30340;&#36890;&#20449;&#29942;&#39048;&#21644;&#25968;&#25454;&#24322;&#26500;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#26159;&#19968;&#31181;&#21331;&#36234;&#30340;&#20998;&#24067;&#24335;&#23398;&#20064;&#33539;&#24335;&#65292;&#20419;&#36827;&#20102;&#36793;&#32536;&#32593;&#32476;&#33410;&#28857;&#20043;&#38388;&#30340;&#21327;&#20316;&#65292;&#20197;&#22312;&#19981;&#38598;&#20013;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#20849;&#21516;&#35757;&#32451;&#20840;&#23616;&#27169;&#22411;&#12290;&#36890;&#36807;&#23558;&#35745;&#31639;&#36716;&#31227;&#21040;&#32593;&#32476;&#36793;&#32536;&#65292;&#32852;&#37030;&#23398;&#20064;&#25552;&#20379;&#20102;&#40065;&#26834;&#21644;&#21709;&#24212;&#36805;&#36895;&#30340;&#36793;&#32536;&#20154;&#24037;&#26234;&#33021;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#22686;&#24378;&#20102;&#38544;&#31169;&#20445;&#25252;&#12290;&#28982;&#32780;&#65292;&#22312;&#36793;&#32536;&#29615;&#22659;&#20013;&#37096;&#32626;&#28145;&#24230;&#32852;&#37030;&#23398;&#20064;&#27169;&#22411;&#36890;&#24120;&#21463;&#21040;&#36890;&#20449;&#29942;&#39048;&#12289;&#25968;&#25454;&#24322;&#26500;&#24615;&#21644;&#20869;&#23384;&#38480;&#21046;&#30340;&#38459;&#30861;&#12290;&#20026;&#20102;&#20849;&#21516;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;FeDEQ&#65292;&#36825;&#26159;&#19968;&#20010;&#24320;&#21019;&#24615;&#30340;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#65292;&#23427;&#26377;&#25928;&#22320;&#37319;&#29992;&#28145;&#24230;&#24179;&#34913;&#23398;&#20064;&#21644;&#20849;&#35782;&#20248;&#21270;&#65292;&#22312;&#36793;&#32536;&#33410;&#28857;&#20043;&#38388;&#21033;&#29992;&#32039;&#20945;&#30340;&#20849;&#20139;&#25968;&#25454;&#34920;&#31034;&#65292;&#20801;&#35768;&#27966;&#29983;&#20986;&#38024;&#23545;&#27599;&#20010;&#33410;&#28857;&#29305;&#23450;&#30340;&#20010;&#24615;&#21270;&#27169;&#22411;&#12290;&#25105;&#20204;&#28145;&#20837;&#25506;&#35752;&#20102;&#19968;&#20010;&#29420;&#29305;&#30340;&#27169;&#22411;&#32467;&#26500;&#65292;&#30001;&#19968;&#20010;&#24179;&#34913;&#23618;&#21644;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#23618;&#32452;&#25104;&#12290;&#22312;&#36825;&#37324;&#65292;&#24179;&#34913;&#23618;&#20805;&#24403;&#20840;&#23616;&#29305;&#24449;&#34920;&#31034;&#65292;&#36793;&#32536;&#33410;&#28857;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#38656;&#27714;&#36827;&#34892;&#20010;&#24615;&#21270;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated Learning (FL) is a prominent distributed learning paradigm facilitating collaboration among nodes within an edge network to co-train a global model without centralizing data. By shifting computation to the network edge, FL offers robust and responsive edge-AI solutions and enhance privacy-preservation. However, deploying deep FL models within edge environments is often hindered by communication bottlenecks, data heterogeneity, and memory limitations. To address these challenges jointly, we introduce FeDEQ, a pioneering FL framework that effectively employs deep equilibrium learning and consensus optimization to exploit a compact shared data representation across edge nodes, allowing the derivation of personalized models specific to each node. We delve into a unique model structure composed of an equilibrium layer followed by traditional neural network layers. Here, the equilibrium layer functions as a global feature representation that edge nodes can adapt to personalize thei
&lt;/p&gt;</description></item></channel></rss>