<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24322;&#26500;&#25968;&#25454;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#21512;&#20316;&#38382;&#39064;&#12290;&#36890;&#36807;&#25512;&#23548;&#20986;&#27599;&#20010;&#23458;&#25143;&#31471;&#30340;&#27867;&#21270;&#30028;&#38480;&#65292;&#21457;&#29616;&#21482;&#26377;&#19982;&#25317;&#26377;&#26356;&#22810;&#35757;&#32451;&#25968;&#25454;&#21644;&#30456;&#20284;&#25968;&#25454;&#20998;&#24067;&#30340;&#23458;&#25143;&#31471;&#21512;&#20316;&#65292;&#25165;&#33021;&#25913;&#21892;&#27169;&#22411;&#30340;&#27867;&#21270;&#24615;&#33021;&#12290;&#26681;&#25454;&#36825;&#19968;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#23618;&#27425;&#32858;&#31867;&#30340;&#21512;&#20316;&#35757;&#32451;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.13236</link><description>&lt;p&gt;
&#22914;&#20309;&#21512;&#20316;&#65306;&#26397;&#30528;&#26368;&#22823;&#21270;&#24322;&#26500;&#25968;&#25454;&#32852;&#37030;&#23398;&#20064;&#30340;&#27867;&#21270;&#24615;&#33021;&#36808;&#36827;
&lt;/p&gt;
&lt;p&gt;
How to Collaborate: Towards Maximizing the Generalization Performance in Cross-Silo Federated Learning. (arXiv:2401.13236v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13236
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24322;&#26500;&#25968;&#25454;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#21512;&#20316;&#38382;&#39064;&#12290;&#36890;&#36807;&#25512;&#23548;&#20986;&#27599;&#20010;&#23458;&#25143;&#31471;&#30340;&#27867;&#21270;&#30028;&#38480;&#65292;&#21457;&#29616;&#21482;&#26377;&#19982;&#25317;&#26377;&#26356;&#22810;&#35757;&#32451;&#25968;&#25454;&#21644;&#30456;&#20284;&#25968;&#25454;&#20998;&#24067;&#30340;&#23458;&#25143;&#31471;&#21512;&#20316;&#65292;&#25165;&#33021;&#25913;&#21892;&#27169;&#22411;&#30340;&#27867;&#21270;&#24615;&#33021;&#12290;&#26681;&#25454;&#36825;&#19968;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#23618;&#27425;&#32858;&#31867;&#30340;&#21512;&#20316;&#35757;&#32451;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#20316;&#20026;&#19968;&#31181;&#20445;&#25252;&#38544;&#31169;&#30340;&#20998;&#24067;&#24335;&#23398;&#20064;&#26694;&#26550;&#65292;&#21560;&#24341;&#20102;&#24191;&#27867;&#30340;&#20851;&#27880;&#12290;&#26412;&#25991;&#20851;&#27880;&#20132;&#21449;&#25968;&#25454;&#28304;&#30340;FL&#65292;&#20854;&#20013;&#23458;&#25143;&#31471;&#22312;&#35757;&#32451;&#21518;&#25104;&#20026;&#27169;&#22411;&#25152;&#26377;&#32773;&#65292;&#24182;&#19988;&#21482;&#20851;&#24515;&#27169;&#22411;&#22312;&#26412;&#22320;&#25968;&#25454;&#19978;&#30340;&#27867;&#21270;&#24615;&#33021;&#12290;&#30001;&#20110;&#25968;&#25454;&#24322;&#36136;&#24615;&#38382;&#39064;&#65292;&#35201;&#27714;&#25152;&#26377;&#23458;&#25143;&#31471;&#21442;&#21152;&#21333;&#19968;&#30340;FL&#35757;&#32451;&#36807;&#31243;&#21487;&#33021;&#20250;&#23548;&#33268;&#27169;&#22411;&#24615;&#33021;&#19979;&#38477;&#12290;&#20026;&#20102;&#35843;&#26597;&#21512;&#20316;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#39318;&#20808;&#25512;&#23548;&#20102;&#27599;&#20010;&#23458;&#25143;&#31471;&#22312;&#19982;&#20854;&#20182;&#23458;&#25143;&#31471;&#21512;&#20316;&#25110;&#29420;&#31435;&#35757;&#32451;&#26102;&#30340;&#27867;&#21270;&#30028;&#38480;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20165;&#36890;&#36807;&#19982;&#20855;&#26377;&#26356;&#22810;&#35757;&#32451;&#25968;&#25454;&#21644;&#30456;&#20284;&#25968;&#25454;&#20998;&#24067;&#30340;&#20854;&#20182;&#23458;&#25143;&#31471;&#21512;&#20316;&#65292;&#21487;&#20197;&#25913;&#21892;&#23458;&#25143;&#31471;&#30340;&#27867;&#21270;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#20351;&#25105;&#20204;&#33021;&#22815;&#36890;&#36807;&#23558;&#23458;&#25143;&#31471;&#20998;&#25104;&#22810;&#20010;&#21512;&#20316;&#32452;&#26469;&#21046;&#23450;&#23458;&#25143;&#31471;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#12290;&#28982;&#21518;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#23618;&#27425;&#32858;&#31867;&#30340;&#21512;&#20316;&#35757;&#32451;&#65288;HCCT&#65289;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated learning (FL) has attracted vivid attention as a privacy-preserving distributed learning framework. In this work, we focus on cross-silo FL, where clients become the model owners after training and are only concerned about the model's generalization performance on their local data. Due to the data heterogeneity issue, asking all the clients to join a single FL training process may result in model performance degradation. To investigate the effectiveness of collaboration, we first derive a generalization bound for each client when collaborating with others or when training independently. We show that the generalization performance of a client can be improved only by collaborating with other clients that have more training data and similar data distribution. Our analysis allows us to formulate a client utility maximization problem by partitioning clients into multiple collaborating groups. A hierarchical clustering-based collaborative training (HCCT) scheme is then proposed, wh
&lt;/p&gt;</description></item></channel></rss>