<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22810;&#39033;&#24335;&#22522;&#25968;2&#25351;&#25968;&#38598;&#21512;&#30340;&#24555;&#36895;&#20056;&#27861;&#26041;&#27861;&#65292;&#22312;&#29305;&#23450;&#20301;&#25968;&#33539;&#22260;&#20869;&#27604;&#20256;&#32479;&#26041;&#27861;&#26356;&#24555;&#12290;&#35813;&#26041;&#27861;&#25226;&#25968;&#23383;&#34920;&#31034;&#20026;&#25972;&#25968;&#32034;&#24341;&#21015;&#34920;&#65292;&#24182;&#23454;&#29616;&#20102;&#20998;&#24067;&#24335;&#35745;&#31639;&#12290;</title><link>https://arxiv.org/abs/2311.09922</link><description>&lt;p&gt;
&#36890;&#36807;&#37319;&#29992;&#25972;&#25968;&#21015;&#34920;&#20316;&#20026;&#22810;&#39033;&#24335;&#22522;&#25968;2&#25351;&#25968;&#30340;&#38598;&#21512;&#26469;&#23454;&#29616;&#24555;&#36895;&#20056;&#27861;
&lt;/p&gt;
&lt;p&gt;
Fast multiplication by two's complement addition of numbers represented as a set of polynomial radix 2 indexes, stored as an integer list for massively parallel computation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.09922
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22810;&#39033;&#24335;&#22522;&#25968;2&#25351;&#25968;&#38598;&#21512;&#30340;&#24555;&#36895;&#20056;&#27861;&#26041;&#27861;&#65292;&#22312;&#29305;&#23450;&#20301;&#25968;&#33539;&#22260;&#20869;&#27604;&#20256;&#32479;&#26041;&#27861;&#26356;&#24555;&#12290;&#35813;&#26041;&#27861;&#25226;&#25968;&#23383;&#34920;&#31034;&#20026;&#25972;&#25968;&#32034;&#24341;&#21015;&#34920;&#65292;&#24182;&#23454;&#29616;&#20102;&#20998;&#24067;&#24335;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#28436;&#31034;&#20102;&#19968;&#31181;&#22522;&#20110;&#29992;&#25972;&#25968;&#21015;&#34920;&#34920;&#31034;&#30340;&#22810;&#39033;&#24335;&#22522;&#25968;2&#25351;&#25968;&#38598;&#21512;&#30340;&#20056;&#27861;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#37319;&#29992;python&#20195;&#30721;&#23454;&#29616;&#20102;&#19968;&#32452;&#31639;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#22312;&#26576;&#19968;&#20301;&#25968;&#33539;&#22260;&#20869;&#27604;&#25968;&#35770;&#21464;&#25442;(NTT)&#21644;&#21345;&#25289;&#33576;&#24052;(Karatsuba)&#20056;&#27861;&#26356;&#24555;&#12290;&#25105;&#20204;&#36824;&#23454;&#29616;&#20102;&#29992;python&#20195;&#30721;&#36827;&#34892;&#27604;&#36739;&#65292;&#19982;&#22810;&#39033;&#24335;&#22522;&#25968;2&#25972;&#25968;&#26041;&#27861;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20219;&#20309;&#25972;&#25968;&#25110;&#23454;&#25968;&#37117;&#21487;&#20197;&#34920;&#31034;&#20026;&#25972;&#25968;&#32034;&#24341;&#21015;&#34920;&#65292;&#34920;&#31034;&#20108;&#36827;&#21046;&#20013;&#30340;&#26377;&#38480;&#32423;&#25968;&#12290;&#35813;&#25968;&#23383;&#30340;&#25972;&#25968;&#32034;&#24341;&#26377;&#38480;&#32423;&#25968;&#21487;&#20197;&#23384;&#20648;&#21644;&#20998;&#24067;&#22312;&#22810;&#20010;CPU / GPU&#19978;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21152;&#27861;&#21644;&#20056;&#27861;&#36816;&#31639;&#21487;&#20197;&#24212;&#29992;&#20110;&#20316;&#20026;&#32034;&#24341;&#25972;&#25968;&#34920;&#31034;&#30340;&#20004;&#20010;&#34917;&#30721;&#21152;&#27861;&#65292;&#24182;&#21487;&#20197;&#23436;&#20840;&#20998;&#24067;&#22312;&#32473;&#23450;&#30340;CPU / GPU&#26550;&#26500;&#19978;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#23436;&#20840;&#30340;&#20998;&#24067;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We demonstrate a multiplication method based on numbers represented as set of polynomial radix 2 indices stored as an integer list. The 'polynomial integer index multiplication' method is a set of algorithms implemented in python code. We demonstrate the method to be faster than both the Number Theoretic Transform (NTT) and Karatsuba for multiplication within a certain bit range. Also implemented in python code for comparison purposes with the polynomial radix 2 integer method. We demonstrate that it is possible to express any integer or real number as a list of integer indices, representing a finite series in base two. The finite series of integer index representation of a number can then be stored and distributed across multiple CPUs / GPUs. We show that operations of addition and multiplication can be applied as two's complement additions operating on the index integer representations and can be fully distributed across a given CPU / GPU architecture. We demonstrate fully distribute
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25509;&#25910;&#26041;&#23548;&#21521;&#30340;&#24265;&#20215;&#35848;&#35805;&#35774;&#35745;&#65292;&#25552;&#20986;&#20102;&#36879;&#26126;&#21160;&#26426;&#21644;&#36807;&#28388;&#20449;&#24687;&#20004;&#31181;&#27169;&#22411;&#65292;&#24182;&#35777;&#26126;&#22312;&#36879;&#26126;&#21160;&#26426;&#19979;&#25509;&#25910;&#26041;&#19981;&#20250;&#20174;&#36807;&#28388;&#20449;&#24687;&#20013;&#33719;&#30410;&#12290;&#28982;&#32780;&#65292;&#19968;&#33324;&#24773;&#20917;&#19979;&#25509;&#25910;&#26041;&#21487;&#20197;&#36890;&#36807;&#36807;&#28388;&#33719;&#24471;&#20005;&#26684;&#30340;&#22909;&#22788;&#65292;&#24182;&#25552;&#20379;&#20102;&#35745;&#31639;&#26368;&#20248;&#22343;&#34913;&#30340;&#26377;&#25928;&#31639;&#27861;&#12290;&#36825;&#23545;&#20110;&#29992;&#25143;&#25511;&#21046;&#20449;&#24687;&#30340;&#24179;&#21488;&#20855;&#26377;&#21019;&#26032;&#24615;&#65292;&#25581;&#31034;&#20102;&#36890;&#20449;&#21160;&#24577;&#24182;&#25552;&#20379;&#20102;&#31574;&#30053;&#24615;&#20114;&#21160;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2401.03671</link><description>&lt;p&gt;
&#25509;&#25910;&#26041;&#23548;&#21521;&#30340;&#24265;&#20215;&#35848;&#35805;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Receiver-Oriented Cheap Talk Design. (arXiv:2401.03671v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03671
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25509;&#25910;&#26041;&#23548;&#21521;&#30340;&#24265;&#20215;&#35848;&#35805;&#35774;&#35745;&#65292;&#25552;&#20986;&#20102;&#36879;&#26126;&#21160;&#26426;&#21644;&#36807;&#28388;&#20449;&#24687;&#20004;&#31181;&#27169;&#22411;&#65292;&#24182;&#35777;&#26126;&#22312;&#36879;&#26126;&#21160;&#26426;&#19979;&#25509;&#25910;&#26041;&#19981;&#20250;&#20174;&#36807;&#28388;&#20449;&#24687;&#20013;&#33719;&#30410;&#12290;&#28982;&#32780;&#65292;&#19968;&#33324;&#24773;&#20917;&#19979;&#25509;&#25910;&#26041;&#21487;&#20197;&#36890;&#36807;&#36807;&#28388;&#33719;&#24471;&#20005;&#26684;&#30340;&#22909;&#22788;&#65292;&#24182;&#25552;&#20379;&#20102;&#35745;&#31639;&#26368;&#20248;&#22343;&#34913;&#30340;&#26377;&#25928;&#31639;&#27861;&#12290;&#36825;&#23545;&#20110;&#29992;&#25143;&#25511;&#21046;&#20449;&#24687;&#30340;&#24179;&#21488;&#20855;&#26377;&#21019;&#26032;&#24615;&#65292;&#25581;&#31034;&#20102;&#36890;&#20449;&#21160;&#24577;&#24182;&#25552;&#20379;&#20102;&#31574;&#30053;&#24615;&#20114;&#21160;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#21457;&#36865;&#26041;&#21644;&#25509;&#25910;&#26041;&#20043;&#38388;&#24265;&#20215;&#35848;&#35805;&#20132;&#20114;&#30340;&#21160;&#24577;&#65292;&#19982;&#20256;&#32479;&#27169;&#22411;&#30340;&#19981;&#21516;&#20043;&#22788;&#22312;&#20110;&#20391;&#37325;&#20110;&#25509;&#25910;&#26041;&#30340;&#35282;&#24230;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#31181;&#27169;&#22411;&#65292;&#19968;&#31181;&#26377;&#36879;&#26126;&#30340;&#21160;&#26426;&#65292;&#21478;&#19968;&#31181;&#26159;&#25509;&#25910;&#26041;&#21487;&#20197;\emph{&#36807;&#28388;}&#21457;&#36865;&#26041;&#21487;&#20197;&#35775;&#38382;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#22312;&#36879;&#26126;&#21160;&#26426;&#19979;&#26368;&#20339;&#25509;&#25910;&#26041;&#22343;&#34913;&#30340;&#20960;&#20309;&#29305;&#24449;&#65292;&#24182;&#35777;&#26126;&#25509;&#25910;&#26041;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#19981;&#20250;&#20174;&#36807;&#28388;&#20449;&#24687;&#20013;&#33719;&#30410;&#12290;&#28982;&#32780;&#65292;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#26174;&#31034;&#25509;&#25910;&#26041;&#21487;&#20197;&#36890;&#36807;&#36807;&#28388;&#33719;&#24471;&#20005;&#26684;&#30340;&#22909;&#22788;&#65292;&#24182;&#25552;&#20379;&#35745;&#31639;&#26368;&#20248;&#22343;&#34913;&#30340;&#26377;&#25928;&#31639;&#27861;&#12290;&#36825;&#31181;&#21019;&#26032;&#24615;&#30340;&#20998;&#26512;&#19982;&#29992;&#25143;&#23548;&#21521;&#30340;&#24179;&#21488;&#19968;&#33268;&#65292;&#22312;&#36825;&#20123;&#24179;&#21488;&#19978;&#65292;&#25509;&#25910;&#26041;&#65288;&#29992;&#25143;&#65289;&#25511;&#21046;&#21457;&#36865;&#26041;&#65288;&#21334;&#23478;&#65289;&#21487;&#20197;&#35775;&#38382;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#25581;&#31034;&#20102;&#36890;&#20449;&#21160;&#24577;&#65292;&#24357;&#24179;&#20102;&#21457;&#36865;&#26041;&#22266;&#26377;&#30340;&#20248;&#21183;&#65292;&#24182;&#25552;&#20379;&#20102;&#31574;&#30053;&#24615;&#20114;&#21160;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers the dynamics of cheap talk interactions between a sender and receiver, departing from conventional models by focusing on the receiver's perspective. We study two models, one with transparent motives and another one in which the receiver can \emph{filter} the information that is accessible by the sender. We give a geometric characterization of the best receiver equilibrium under transparent motives and prove that the receiver does not benefit from filtering information in this case. However, in general, we show that the receiver can strictly benefit from filtering and provide efficient algorithms for computing optimal equilibria. This innovative analysis aligns with user-based platforms where receivers (users) control information accessible to senders (sellers). Our findings provide insights into communication dynamics, leveling the sender's inherent advantage, and offering strategic interaction predictions.
&lt;/p&gt;</description></item></channel></rss>