<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>LaDe&#26159;&#31532;&#19968;&#20010;&#20844;&#24320;&#21487;&#29992;&#30340;&#26411;&#31471;&#37197;&#36865;&#25968;&#25454;&#38598;&#65292;&#21253;&#21547;&#20102;&#25968;&#30334;&#19975;&#20010;&#26469;&#33258;&#20135;&#19994;&#30028;&#30340;&#21253;&#35065;&#65292;&#20855;&#26377;&#22823;&#35268;&#27169;&#12289;&#20840;&#38754;&#30340;&#20449;&#24687;&#21644;&#22810;&#26679;&#24615;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2306.10675</link><description>&lt;p&gt;
LaDe: &#20135;&#19994;&#30028;&#31532;&#19968;&#20010;&#20840;&#38754;&#30340;&#26411;&#31471;&#37197;&#36865;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
LaDe: The First Comprehensive Last-mile Delivery Dataset from Industry. (arXiv:2306.10675v2 [cs.DB] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10675
&lt;/p&gt;
&lt;p&gt;
LaDe&#26159;&#31532;&#19968;&#20010;&#20844;&#24320;&#21487;&#29992;&#30340;&#26411;&#31471;&#37197;&#36865;&#25968;&#25454;&#38598;&#65292;&#21253;&#21547;&#20102;&#25968;&#30334;&#19975;&#20010;&#26469;&#33258;&#20135;&#19994;&#30028;&#30340;&#21253;&#35065;&#65292;&#20855;&#26377;&#22823;&#35268;&#27169;&#12289;&#20840;&#38754;&#30340;&#20449;&#24687;&#21644;&#22810;&#26679;&#24615;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#26411;&#31471;&#37197;&#36865;&#25968;&#25454;&#38598;&#23545;&#20110;&#29289;&#27969;&#12289;&#20379;&#24212;&#38142;&#31649;&#29702;&#21644;&#26102;&#31354;&#25968;&#25454;&#25366;&#25496;&#30340;&#30740;&#31350;&#33267;&#20851;&#37325;&#35201;&#12290;&#23613;&#31649;&#36804;&#20170;&#24050;&#32463;&#24320;&#21457;&#20102;&#22823;&#37327;&#31639;&#27861;&#65292;&#20294;&#23578;&#26080;&#20844;&#35748;&#30340;&#12289;&#20844;&#24320;&#21487;&#29992;&#30340;&#26411;&#31471;&#37197;&#36865;&#25968;&#25454;&#38598;&#26469;&#25903;&#25345;&#36825;&#20010;&#39046;&#22495;&#30340;&#30740;&#31350;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;LaDe&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#20844;&#24320;&#21487;&#29992;&#30340;&#26411;&#31471;&#37197;&#36865;&#25968;&#25454;&#38598;&#65292;&#21253;&#21547;&#20102;&#25968;&#30334;&#19975;&#20010;&#26469;&#33258;&#20135;&#19994;&#30028;&#30340;&#21253;&#35065;&#12290;LaDe&#20855;&#26377;&#19977;&#20010;&#29420;&#29305;&#30340;&#29305;&#28857;&#65306;(1)&#22823;&#35268;&#27169;&#12290;&#23427;&#28041;&#21450;&#21040;6&#20010;&#26376;&#30340;&#30495;&#23454;&#36816;&#33829;&#20013;&#30340;10,677k&#20010;&#21253;&#35065;&#21644;21k&#20010;&#24555;&#36882;&#21592;&#12290;(2)&#20840;&#38754;&#30340;&#20449;&#24687;&#12290;&#23427;&#25552;&#20379;&#21407;&#22987;&#21253;&#35065;&#20449;&#24687;&#65292;&#22914;&#20301;&#32622;&#21644;&#26102;&#38388;&#35201;&#27714;&#65292;&#20197;&#21450;&#20219;&#21153;&#20107;&#20214;&#20449;&#24687;&#65292;&#35760;&#24405;&#20102;&#24555;&#36882;&#21592;&#20309;&#26102;&#20309;&#22320;&#36827;&#34892;&#20219;&#21153;&#25509;&#21463;&#21644;&#23436;&#25104;&#12290;(3)&#22810;&#26679;&#24615;&#12290;&#35813;&#25968;&#25454;&#38598;&#21253;&#25324;&#26469;&#33258;&#21508;&#31181;&#22330;&#26223;&#30340;&#25968;&#25454;&#65292;&#21253;&#25324;&#21253;&#35065;&#30340;&#21462;&#36865;&#21644;&#26469;&#33258;&#22810;&#20010;&#22478;&#24066;&#30340;&#25968;&#25454;&#65292;&#27599;&#20010;&#22478;&#24066;&#37117;&#26377;&#20854;&#29420;&#29305;&#30340;&#26102;&#31354;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Real-world last-mile delivery datasets are crucial for research in logistics, supply chain management, and spatio-temporal data mining. Despite a plethora of algorithms developed to date, no widely accepted, publicly available last-mile delivery dataset exists to support research in this field. In this paper, we introduce \texttt{LaDe}, the first publicly available last-mile delivery dataset with millions of packages from the industry. LaDe has three unique characteristics: (1) Large-scale. It involves 10,677k packages of 21k couriers over 6 months of real-world operation. (2) Comprehensive information. It offers original package information, such as its location and time requirements, as well as task-event information, which records when and where the courier is while events such as task-accept and task-finish events happen. (3) Diversity. The dataset includes data from various scenarios, including package pick-up and delivery, and from multiple cities, each with its unique spatio-tem
&lt;/p&gt;</description></item></channel></rss>