<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#24182;&#30740;&#31350;&#20102;&#22312;&#32447;&#36716;&#25442;&#21450;&#20854;&#24102;&#26377;&#20999;&#25442;&#25104;&#26412;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20855;&#26377;&#31454;&#20105;&#21147;&#30340;&#38408;&#20540;&#31639;&#27861;&#20197;&#21450;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#26368;&#23567;&#21270;&#21644;&#26368;&#22823;&#21270;&#21464;&#20307;&#20013;&#37117;&#34920;&#29616;&#20986;&#20248;&#36234;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.20598</link><description>&lt;p&gt;
&#22312;&#32447;&#36716;&#25442;&#21450;&#20854;&#24102;&#26377;&#20999;&#25442;&#25104;&#26412;&#65306;&#31283;&#20581;&#21644;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Online Conversion with Switching Costs: Robust and Learning-Augmented Algorithms. (arXiv:2310.20598v2 [cs.DS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.20598
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#24182;&#30740;&#31350;&#20102;&#22312;&#32447;&#36716;&#25442;&#21450;&#20854;&#24102;&#26377;&#20999;&#25442;&#25104;&#26412;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20855;&#26377;&#31454;&#20105;&#21147;&#30340;&#38408;&#20540;&#31639;&#27861;&#20197;&#21450;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#26368;&#23567;&#21270;&#21644;&#26368;&#22823;&#21270;&#21464;&#20307;&#20013;&#37117;&#34920;&#29616;&#20986;&#20248;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#24182;&#30740;&#31350;&#22312;&#32447;&#36716;&#25442;&#21450;&#20854;&#24102;&#26377;&#20999;&#25442;&#25104;&#26412;&#30340;&#38382;&#39064;&#12290;&#36825;&#20010;&#38382;&#39064;&#28085;&#30422;&#20102;&#33021;&#28304;&#21644;&#21487;&#25345;&#32493;&#24615;&#20132;&#21449;&#39046;&#22495;&#20013;&#20986;&#29616;&#30340;&#19968;&#31995;&#21015;&#26032;&#38382;&#39064;&#12290;&#22312;&#36825;&#20010;&#38382;&#39064;&#20013;&#65292;&#22312;&#32447;&#29609;&#23478;&#35797;&#22270;&#22312;&#22266;&#23450;&#30340;&#26102;&#38388;&#27573;&#20869;&#36141;&#20080;&#65288;&#25110;&#38144;&#21806;&#65289;&#36164;&#20135;&#30340;&#20998;&#25968;&#20221;&#39069;&#65292;&#27599;&#20010;&#26102;&#38388;&#27493;&#39588;&#37117;&#20250;&#20844;&#24067;&#25104;&#26412;&#65288;&#25110;&#20215;&#26684;&#65289;&#20989;&#25968;&#65292;&#24182;&#19988;&#29609;&#23478;&#24517;&#39035;&#20570;&#20986;&#19981;&#21487;&#25764;&#28040;&#30340;&#20915;&#31574;&#65292;&#20915;&#23450;&#36716;&#25442;&#30340;&#36164;&#20135;&#25968;&#37327;&#12290;&#24403;&#29609;&#23478;&#36830;&#32493;&#26102;&#38388;&#27493;&#39588;&#20013;&#25913;&#21464;&#20915;&#31574;&#26102;&#65292;&#20063;&#20250;&#20135;&#29983;&#20999;&#25442;&#25104;&#26412;&#65292;&#21363;&#22312;&#36141;&#20080;&#37327;&#22686;&#21152;&#25110;&#20943;&#23569;&#26102;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#22312;&#36825;&#20010;&#38382;&#39064;&#30340;&#26368;&#23567;&#21270;&#21644;&#26368;&#22823;&#21270;&#21464;&#20307;&#20013;&#20855;&#26377;&#31454;&#20105;&#21147;&#65288;&#31283;&#20581;&#65289;&#30340;&#22522;&#20110;&#38408;&#20540;&#30340;&#31639;&#27861;&#65292;&#24182;&#19988;&#35777;&#26126;&#23427;&#20204;&#26159;&#30830;&#23450;&#24615;&#22312;&#32447;&#31639;&#27861;&#20013;&#30340;&#26368;&#20248;&#31639;&#27861;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;&#65292;&#21033;&#29992;&#19981;&#21487;&#20449;&#30340;&#40657;&#30418;&#24314;&#35758;&#65288;&#20363;&#22914;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#39044;&#27979;&#65289;&#26469;&#26174;&#33879;&#25913;&#21892;&#31639;&#27861;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce and study online conversion with switching costs, a family of online problems that capture emerging problems at the intersection of energy and sustainability. In this problem, an online player attempts to purchase (alternatively, sell) fractional shares of an asset during a fixed time horizon with length $T$. At each time step, a cost function (alternatively, price function) is revealed, and the player must irrevocably decide an amount of asset to convert. The player also incurs a switching cost whenever their decision changes in consecutive time steps, i.e., when they increase or decrease their purchasing amount. We introduce competitive (robust) threshold-based algorithms for both the minimization and maximization variants of this problem, and show they are optimal among deterministic online algorithms. We then propose learning-augmented algorithms that take advantage of untrusted black-box advice (such as predictions from a machine learning model) to achieve significant
&lt;/p&gt;</description></item></channel></rss>