<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#20351;&#29992;ChatGPT&#23545;&#25968;&#25454;&#36827;&#34892;&#28165;&#27927;&#30340;&#21487;&#33021;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#25968;&#25454;&#28246;&#30340;&#22522;&#20110;&#26816;&#32034;&#30340;&#28165;&#27927;&#26041;&#27861;&#65292;&#21516;&#26102;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#22312;&#26412;&#22320;&#37096;&#32626;&#30340;RoBERTa&#27169;&#22411;&#26469;&#35299;&#20915;&#38544;&#31169;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.16909</link><description>&lt;p&gt;
RetClean: &#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#19982;&#25968;&#25454;&#28246;&#30340;&#26816;&#32034;&#24335;&#25968;&#25454;&#28165;&#27927;
&lt;/p&gt;
&lt;p&gt;
RetClean: Retrieval-Based Data Cleaning Using Foundation Models and Data Lakes. (arXiv:2303.16909v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16909
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#20351;&#29992;ChatGPT&#23545;&#25968;&#25454;&#36827;&#34892;&#28165;&#27927;&#30340;&#21487;&#33021;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#25968;&#25454;&#28246;&#30340;&#22522;&#20110;&#26816;&#32034;&#30340;&#28165;&#27927;&#26041;&#27861;&#65292;&#21516;&#26102;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#22312;&#26412;&#22320;&#37096;&#32626;&#30340;RoBERTa&#27169;&#22411;&#26469;&#35299;&#20915;&#38544;&#31169;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#20351;&#29992;&#22522;&#30784;&#27169;&#22411;ChatGPT&#26469;&#25552;&#20379;&#25968;&#25454;&#28165;&#27927;&#24314;&#35758;&#30340;&#21487;&#33021;&#24615;&#12290;&#20294;&#22312;&#22788;&#29702;&#20225;&#19994;&#25968;&#25454;&#25110;&#38656;&#35201;&#35299;&#37322;&#24314;&#35758;&#26469;&#28304;&#26102;&#65292;ChatGPT&#21487;&#33021;&#26080;&#27861;&#32988;&#20219;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#26816;&#32034;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#37197;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#25968;&#25454;&#28246;&#65292;&#23558;&#25968;&#25454;&#28246;&#30340;&#25968;&#25454;&#19982;ChatGPT&#30340;&#33021;&#21147;&#32467;&#21512;&#20351;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;RoBERTa&#30340;&#23450;&#21046;&#21270;&#27169;&#22411;&#65292;&#29992;&#25143;&#21487;&#20197;&#22312;&#26412;&#22320;&#36827;&#34892;&#37096;&#32626;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can foundation models (such as ChatGPT) clean your data? In this proposal, we demonstrate that indeed ChatGPT can assist in data cleaning by suggesting corrections for specific cells in a data table (scenario 1). However, ChatGPT may struggle with datasets it has never encountered before (e.g., local enterprise data) or when the user requires an explanation of the source of the suggested clean values. To address these issues, we developed a retrieval-based method that complements ChatGPT's power with a user-provided data lake. The data lake is first indexed, we then retrieve the top-k relevant tuples to the user's query tuple and finally leverage ChatGPT to infer the correct value (scenario 2). Nevertheless, sharing enterprise data with ChatGPT, an externally hosted model, might not be feasible for privacy reasons. To assist with this scenario, we developed a custom RoBERTa-based foundation model that can be locally deployed. By fine-tuning it on a small number of examples, it can effe
&lt;/p&gt;</description></item></channel></rss>