<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#26032;&#30340;SAT&#32534;&#30721;&#30340;&#20559;&#24207;&#27169;&#22411;&#29992;&#20110;&#22270;&#30528;&#33394;&#38382;&#39064;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#65292;&#24182;&#23545;&#24102;&#23485;&#30528;&#33394;&#38382;&#39064;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#12290;</title><link>https://arxiv.org/abs/2403.15961</link><description>&lt;p&gt;
SAT&#32534;&#30721;&#30340;&#20559;&#24207;&#27169;&#22411;&#29992;&#20110;&#22270;&#30528;&#33394;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
SAT Encoding of Partial Ordering Models for Graph Coloring Problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15961
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#26032;&#30340;SAT&#32534;&#30721;&#30340;&#20559;&#24207;&#27169;&#22411;&#29992;&#20110;&#22270;&#30528;&#33394;&#38382;&#39064;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#65292;&#24182;&#23545;&#24102;&#23485;&#30528;&#33394;&#38382;&#39064;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#20559;&#24207;&#30340;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#65288;ILP&#65289;&#27169;&#22411;&#30340;&#22270;&#30528;&#33394;&#38382;&#39064;&#65288;GCP&#65289;&#21644;&#24102;&#23485;&#30528;&#33394;&#38382;&#39064;&#65288;BCP&#65289;&#30340;&#26032;SAT&#32534;&#30721;&#12290; GCP&#35201;&#27714;&#32473;&#23450;&#22270;&#30340;&#39030;&#28857;&#20998;&#37197;&#26368;&#23569;&#25968;&#37327;&#30340;&#39068;&#33394;&#65292;&#20197;&#20415;&#27599;&#20004;&#20010;&#30456;&#37051;&#30340;&#39030;&#28857;&#24471;&#21040;&#19981;&#21516;&#30340;&#39068;&#33394;&#12290; BCP&#26159;&#19968;&#20010;&#27867;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#27599;&#26465;&#36793;&#37117;&#26377;&#19968;&#20010;&#26435;&#37325;&#65292;&#35201;&#27714;&#20998;&#37197;&#30340;&#39068;&#33394;&#20043;&#38388;&#26377;&#26368;&#23567;&#30340;&#8220;&#36317;&#31163;&#8221;&#65292;&#30446;&#26631;&#26159;&#26368;&#23567;&#21270;&#20351;&#29992;&#30340;&#8220;&#26368;&#22823;&#8221;&#39068;&#33394;&#12290; &#23545;&#20110;&#34987;&#24191;&#27867;&#30740;&#31350;&#30340;GCP&#65292;&#25105;&#20204;&#22312;DIMACS&#22522;&#20934;&#38598;&#19978;&#23454;&#39564;&#27604;&#36739;&#20102;&#25105;&#20204;&#26032;&#30340;SAT&#32534;&#30721;&#19982;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290; &#25105;&#20204;&#30340;&#35780;&#20272;&#35777;&#23454;&#65292;&#36825;&#31181;SAT&#32534;&#30721;&#23545;&#20110;&#31232;&#30095;&#22270;&#26159;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#29978;&#33267;&#22312;&#19968;&#20123;DIMACS&#31034;&#20363;&#19978;&#32988;&#36807;&#20102;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290; &#23545;&#20110;BCP&#65292;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;&#22522;&#20110;&#20559;&#24207;&#30340;SAT&#21644;ILP&#20844;&#24335;&#30340;&#22823;&#23567;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#23567;&#20110;&#32463;&#20856;&#30340;&#35299;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15961v1 Announce Type: new  Abstract: In this paper, we suggest new SAT encodings of the partial-ordering based ILP model for the graph coloring problem (GCP) and the bandwidth coloring problem (BCP). The GCP asks for the minimum number of colors that can be assigned to the vertices of a given graph such that each two adjacent vertices get different colors. The BCP is a generalization, where each edge has a weight that enforces a minimal "distance" between the assigned colors, and the goal is to minimize the "largest" color used. For the widely studied GCP, we experimentally compare our new SAT encoding to the state-of-the-art approaches on the DIMACS benchmark set. Our evaluation confirms that this SAT encoding is effective for sparse graphs and even outperforms the state-of-the-art on some DIMACS instances. For the BCP, our theoretical analysis shows that the partial-ordering based SAT and ILP formulations have an asymptotically smaller size than that of the classical assi
&lt;/p&gt;</description></item></channel></rss>