<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#36825;&#39033;&#35843;&#30740;&#28145;&#20837;&#25506;&#35752;&#20102;&#36793;&#32536;&#23398;&#20064;(EL)&#20013;&#20248;&#21270;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#35757;&#32451;&#30340;&#21508;&#31181;&#26041;&#27861;&#21644;&#26041;&#27861;&#35770;&#65292;&#26088;&#22312;&#32508;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#35782;&#21035;&#25361;&#25112;&#65292;&#24182;&#31361;&#20986;&#26410;&#26469;&#36235;&#21183;&#12290;</title><link>https://arxiv.org/abs/2403.02619</link><description>&lt;p&gt;
&#22312;&#36793;&#32536;&#36827;&#34892;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#35757;&#32451;&#65306;&#19968;&#39033;&#35843;&#30740;
&lt;/p&gt;
&lt;p&gt;
Training Machine Learning models at the Edge: A Survey
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02619
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#35843;&#30740;&#28145;&#20837;&#25506;&#35752;&#20102;&#36793;&#32536;&#23398;&#20064;(EL)&#20013;&#20248;&#21270;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#35757;&#32451;&#30340;&#21508;&#31181;&#26041;&#27861;&#21644;&#26041;&#27861;&#35770;&#65292;&#26088;&#22312;&#32508;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#35782;&#21035;&#25361;&#25112;&#65292;&#24182;&#31361;&#20986;&#26410;&#26469;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36793;&#32536;&#35745;&#31639;(EC)&#36817;&#24180;&#26469;&#33719;&#24471;&#20102;&#26174;&#33879;&#20851;&#27880;&#65292;&#36890;&#36807;&#22312;&#36793;&#32536;&#38598;&#25104;&#20154;&#24037;&#26234;&#33021;(AI)&#33021;&#21147;&#65292;&#25215;&#35834;&#25552;&#39640;&#25928;&#29575;&#12290;&#34429;&#28982;&#20027;&#35201;&#20851;&#27880;&#28857;&#22312;&#36793;&#32536;&#37096;&#32626;&#21644;&#25512;&#26029;&#26426;&#22120;&#23398;&#20064;(ML)&#27169;&#22411;&#65292;&#20294;&#35757;&#32451;&#26041;&#38754;&#20173;&#28982;&#36739;&#23569;&#34987;&#25506;&#35752;&#12290;&#36825;&#39033;&#35843;&#30740;&#28145;&#20837;&#25506;&#35752;&#20102;&#36793;&#32536;&#23398;&#20064;(EL)&#65292;&#29305;&#21035;&#26159;&#22312;&#36793;&#32536;&#20248;&#21270;ML&#27169;&#22411;&#35757;&#32451;&#30340;&#26041;&#38754;&#12290;&#20854;&#30446;&#26631;&#26159;&#20840;&#38754;&#25506;&#35752;EL&#20013;&#30340;&#19981;&#21516;&#26041;&#27861;&#21644;&#26041;&#27861;&#35770;&#65292;&#32508;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#35782;&#21035;&#25361;&#25112;&#65292;&#24182;&#31361;&#20986;&#26410;&#26469;&#36235;&#21183;&#12290;&#21033;&#29992;Scopus&#30340;&#39640;&#32423;&#25628;&#32034;&#65292;&#30830;&#23450;&#20102;&#20851;&#20110;EL&#30340;&#30456;&#20851;&#25991;&#29486;&#65292;&#26174;&#31034;&#20102;&#30740;&#31350;&#24037;&#20316;&#22312;&#20998;&#24067;&#24335;&#23398;&#20064;&#26041;&#27861;&#26041;&#38754;&#30340;&#32858;&#28966;&#65292;&#29305;&#21035;&#26159;&#32852;&#37030;&#23398;&#20064;(FL)&#12290;&#27492;&#35843;&#30740;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#27604;&#36739;&#29992;&#20110;&#20248;&#21270;&#36793;&#32536;&#23398;&#20064;&#30340;ML&#30340;&#25216;&#26415;&#30340;&#25351;&#21335;&#65292;&#20197;&#21450;&#23545;&#19981;&#21516;&#26694;&#26550;&#30340;&#25506;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02619v1 Announce Type: new  Abstract: Edge Computing (EC) has gained significant traction in recent years, promising enhanced efficiency by integrating Artificial Intelligence (AI) capabilities at the edge. While the focus has primarily been on the deployment and inference of Machine Learning (ML) models at the edge, the training aspect remains less explored. This survey delves into Edge Learning (EL), specifically the optimization of ML model training at the edge. The objective is to comprehensively explore diverse approaches and methodologies in EL, synthesize existing knowledge, identify challenges, and highlight future trends. Utilizing Scopus' advanced search, relevant literature on EL was identified, revealing a concentration of research efforts in distributed learning methods, particularly Federated Learning (FL). This survey further provides a guideline for comparing techniques used to optimize ML for edge learning, along with an exploration of different frameworks, 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24322;&#26500;&#25968;&#25454;&#28304;&#30340;&#32852;&#37030;&#25919;&#31574;&#23398;&#20064;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#22522;&#20110;&#26412;&#22320;&#31574;&#30053;&#32858;&#21512;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#21452;&#37325;&#31283;&#20581;&#32447;&#19979;&#31574;&#30053;&#35780;&#20272;&#21644;&#23398;&#20064;&#31574;&#30053;&#36827;&#34892;&#35757;&#32451;&#65292;&#21487;&#20197;&#22312;&#19981;&#20132;&#25442;&#21407;&#22987;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#23398;&#20064;&#20010;&#24615;&#21270;&#20915;&#31574;&#25919;&#31574;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#20840;&#23616;&#21644;&#23616;&#37096;&#21518;&#24724;&#19978;&#38480;&#30340;&#29702;&#35770;&#27169;&#22411;&#65292;&#24182;&#29992;&#23454;&#39564;&#32467;&#26524;&#25903;&#25345;&#20102;&#29702;&#35770;&#21457;&#29616;&#12290;</title><link>http://arxiv.org/abs/2305.12407</link><description>&lt;p&gt;
&#24322;&#26500;&#35266;&#27979;&#25968;&#25454;&#19979;&#30340;&#32852;&#37030;&#24369;&#21270;&#25919;&#31574;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Federated Offline Policy Learning with Heterogeneous Observational Data. (arXiv:2305.12407v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12407
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24322;&#26500;&#25968;&#25454;&#28304;&#30340;&#32852;&#37030;&#25919;&#31574;&#23398;&#20064;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#22522;&#20110;&#26412;&#22320;&#31574;&#30053;&#32858;&#21512;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#21452;&#37325;&#31283;&#20581;&#32447;&#19979;&#31574;&#30053;&#35780;&#20272;&#21644;&#23398;&#20064;&#31574;&#30053;&#36827;&#34892;&#35757;&#32451;&#65292;&#21487;&#20197;&#22312;&#19981;&#20132;&#25442;&#21407;&#22987;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#23398;&#20064;&#20010;&#24615;&#21270;&#20915;&#31574;&#25919;&#31574;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#20840;&#23616;&#21644;&#23616;&#37096;&#21518;&#24724;&#19978;&#38480;&#30340;&#29702;&#35770;&#27169;&#22411;&#65292;&#24182;&#29992;&#23454;&#39564;&#32467;&#26524;&#25903;&#25345;&#20102;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22522;&#20110;&#24322;&#26500;&#25968;&#25454;&#28304;&#30340;&#35266;&#27979;&#25968;&#25454;&#23398;&#20064;&#20010;&#24615;&#21270;&#20915;&#31574;&#25919;&#31574;&#30340;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#22312;&#32852;&#37030;&#35774;&#32622;&#20013;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#20854;&#20013;&#20013;&#22830;&#26381;&#21153;&#22120;&#26088;&#22312;&#22312;&#20998;&#24067;&#22312;&#24322;&#26500;&#28304;&#19978;&#30340;&#25968;&#25454;&#19978;&#23398;&#20064;&#19968;&#20010;&#25919;&#31574;&#65292;&#32780;&#19981;&#20132;&#25442;&#23427;&#20204;&#30340;&#21407;&#22987;&#25968;&#25454;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32852;&#37030;&#25919;&#31574;&#23398;&#20064;&#31639;&#27861;&#65292;&#23427;&#22522;&#20110;&#20351;&#29992;&#21452;&#37325;&#31283;&#20581;&#32447;&#19979;&#31574;&#30053;&#35780;&#20272;&#21644;&#23398;&#20064;&#31574;&#30053;&#35757;&#32451;&#30340;&#26412;&#22320;&#31574;&#30053;&#32858;&#21512;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#21518;&#24724;&#20998;&#26512;&#26041;&#27861;&#26469;&#30830;&#31435;&#23545;&#20840;&#23616;&#21518;&#24724;&#27010;&#24565;&#30340;&#26377;&#38480;&#26679;&#26412;&#19978;&#30028;&#65292;&#36825;&#20010;&#20840;&#23616;&#21518;&#24724;&#27010;&#24565;&#36328;&#36234;&#20102;&#23458;&#25143;&#31471;&#30340;&#20998;&#24067;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#38024;&#23545;&#27599;&#20010;&#21333;&#29420;&#30340;&#23458;&#25143;&#31471;&#24314;&#31435;&#20102;&#30456;&#24212;&#30340;&#23616;&#37096;&#21518;&#24724;&#19978;&#30028;&#65292;&#35813;&#19978;&#30028;&#30001;&#30456;&#23545;&#20110;&#25152;&#26377;&#20854;&#20182;&#23458;&#25143;&#31471;&#30340;&#20998;&#24067;&#21464;&#21270;&#29305;&#24449;&#24615;&#22320;&#25551;&#36848;&#12290;&#25105;&#20204;&#29992;&#23454;&#39564;&#32467;&#26524;&#25903;&#25345;&#25105;&#20204;&#30340;&#29702;&#35770;&#21457;&#29616;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#21644;&#23454;&#39564;&#25552;&#20379;&#20102;&#24322;&#26500;&#23458;&#25143;&#31471;&#21442;&#19982;&#32852;&#37030;&#23398;&#20064;&#30340;&#20215;&#20540;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of learning personalized decision policies on observational data from heterogeneous data sources. Moreover, we examine this problem in the federated setting where a central server aims to learn a policy on the data distributed across the heterogeneous sources without exchanging their raw data. We present a federated policy learning algorithm based on aggregation of local policies trained with doubly robust offline policy evaluation and learning strategies. We provide a novel regret analysis for our approach that establishes a finite-sample upper bound on a notion of global regret across a distribution of clients. In addition, for any individual client, we establish a corresponding local regret upper bound characterized by the presence of distribution shift relative to all other clients. We support our theoretical findings with experimental results. Our analysis and experiments provide insights into the value of heterogeneous client participation in federation fo
&lt;/p&gt;</description></item></channel></rss>