<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#35843;&#30740;&#20102;&#32467;&#26500;&#21270;&#25968;&#25454;&#20998;&#23618;&#23616;&#37096;&#25935;&#24863;&#21704;&#24076;&#65288;LSH&#65289;&#30340;&#30740;&#31350;&#29616;&#29366;&#65292;&#38024;&#23545;&#26080;&#27861;&#20445;&#30041;&#32467;&#26500;&#20449;&#24687;&#30340;&#20256;&#32479;LSH&#31639;&#27861;&#65292;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2204.11209</link><description>&lt;p&gt;
&#32467;&#26500;&#21270;&#25968;&#25454;&#30340;&#20998;&#23618;&#23616;&#37096;&#25935;&#24863;&#21704;&#24076;&#65306;&#19968;&#39033;&#35843;&#30740;
&lt;/p&gt;
&lt;p&gt;
Hierarchical Locality Sensitive Hashing for Structured Data: A Survey. (arXiv:2204.11209v3 [cs.DS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.11209
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35843;&#30740;&#20102;&#32467;&#26500;&#21270;&#25968;&#25454;&#20998;&#23618;&#23616;&#37096;&#25935;&#24863;&#21704;&#24076;&#65288;LSH&#65289;&#30340;&#30740;&#31350;&#29616;&#29366;&#65292;&#38024;&#23545;&#26080;&#27861;&#20445;&#30041;&#32467;&#26500;&#20449;&#24687;&#30340;&#20256;&#32479;LSH&#31639;&#27861;&#65292;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#30456;&#20284;&#24615;&#65288;&#25110;&#36317;&#31163;&#65289;&#35745;&#31639;&#26159;&#19968;&#20010;&#22522;&#30784;&#30340;&#30740;&#31350;&#35838;&#39064;&#65292;&#20419;&#36827;&#20102;&#35768;&#22810;&#22522;&#20110;&#30456;&#20284;&#24615;&#30340;&#26426;&#22120;&#23398;&#20064;&#21644;&#25968;&#25454;&#25366;&#25496;&#24212;&#29992;&#12290;&#22312;&#22823;&#25968;&#25454;&#20998;&#26512;&#20013;&#65292;&#30001;&#20110;&#35745;&#31639;&#25104;&#26412;&#39640;&#26114;&#65292;&#35745;&#31639;&#25968;&#25454;&#23454;&#20363;&#30340;&#31934;&#30830;&#30456;&#20284;&#24615;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#12290;&#20026;&#27492;&#65292;&#23616;&#37096;&#25935;&#24863;&#21704;&#24076;&#65288;LSH&#65289;&#25216;&#26415;&#24050;&#34987;&#25552;&#20986;&#65292;&#20197;&#22312;&#27809;&#26377;&#23398;&#20064;&#36807;&#31243;&#30340;&#24773;&#20917;&#19979;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#25552;&#20379;&#21508;&#31181;&#38598;&#21512;&#25110;&#21521;&#37327;&#20043;&#38388;&#30340;&#21508;&#31181;&#30456;&#20284;&#24230;&#20272;&#35745;&#22120;&#12290;&#32467;&#26500;&#21270;&#25968;&#25454;&#65288;&#20363;&#22914;&#24207;&#21015;&#12289;&#26641;&#21644;&#22270;&#65289;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#24456;&#24120;&#35265;&#65292;&#20294;&#20256;&#32479;&#30340;LSH&#31639;&#27861;&#26080;&#27861;&#20445;&#30041;&#34920;&#31034;&#20803;&#32032;&#20043;&#38388;&#20851;&#31995;&#30340;&#32467;&#26500;&#20449;&#24687;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#30740;&#31350;&#20154;&#21592;&#19968;&#30452;&#33268;&#21147;&#20110;&#20998;&#23618;LSH&#31639;&#27861;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#20998;&#23618;LSH&#30740;&#31350;&#30340;&#29616;&#26377;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data similarity (or distance) computation is a fundamental research topic which fosters a variety of similarity-based machine learning and data mining applications. In big data analytics, it is impractical to compute the exact similarity of data instances due to high computational cost. To this end, the Locality Sensitive Hashing (LSH) technique has been proposed to provide accurate estimators for various similarity measures between sets or vectors in an efficient manner without the learning process. Structured data (e.g., sequences, trees and graphs), which are composed of elements and relations between the elements, are commonly seen in the real world, but the traditional LSH algorithms cannot preserve the structure information represented as relations between elements. In order to conquer the issue, researchers have been devoted to the family of the hierarchical LSH algorithms. In this paper, we explore the present progress of the research into hierarchical LSH from the following pe
&lt;/p&gt;</description></item></channel></rss>