<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#35299;&#37322;&#19988;&#21487;&#25805;&#20316;&#30340;&#36873;&#21306;&#21010;&#20998;&#22270;&#36317;&#31163;&#27979;&#37327;&#26041;&#27861;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#8220;&#26368;&#20856;&#22411;&#8221;&#30340;&#20013;&#24515;&#22270;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#28145;&#20837;&#30740;&#31350;&#19968;&#31995;&#21015;&#32422;&#26463;&#26465;&#20214;&#19979;&#36873;&#21306;&#21010;&#20998;&#22270;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2203.00872</link><description>&lt;p&gt;
&#36317;&#31163;&#23545;&#36873;&#21306;&#21010;&#20998;&#22270;&#30340;&#24433;&#21709;&#65306;&#20013;&#24515;&#21644;&#24322;&#24120;&#22320;&#22270;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Implications of Distance over Redistricting Maps: Central and Outlier Maps. (arXiv:2203.00872v4 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.00872
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#35299;&#37322;&#19988;&#21487;&#25805;&#20316;&#30340;&#36873;&#21306;&#21010;&#20998;&#22270;&#36317;&#31163;&#27979;&#37327;&#26041;&#27861;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#8220;&#26368;&#20856;&#22411;&#8221;&#30340;&#20013;&#24515;&#22270;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#28145;&#20837;&#30740;&#31350;&#19968;&#31995;&#21015;&#32422;&#26463;&#26465;&#20214;&#19979;&#36873;&#21306;&#21010;&#20998;&#22270;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20195;&#35758;&#21046;&#27665;&#20027;&#20013;&#65292;&#36873;&#21306;&#21010;&#20998;&#22270;&#29992;&#20110;&#23558;&#36873;&#27665;&#21010;&#20998;&#20026;&#19968;&#32452;&#36873;&#21306;&#65292;&#27599;&#20010;&#21306;&#36873;&#20986;&#19968;&#20010;&#20195;&#34920;&#12290;&#26377;&#25928;&#30340;&#21010;&#20998;&#22270;&#24517;&#39035;&#28385;&#36275;&#19968;&#31995;&#21015;&#32422;&#26463;&#26465;&#20214;&#65292;&#20363;&#22914;&#32039;&#20945;&#24615;&#12289;&#36830;&#32493;&#24615;&#12289;&#20197;&#21450;&#20960;&#20046;&#30456;&#31561;&#30340;&#20154;&#21475;&#20998;&#24067;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#21152;&#24378;&#30340;&#38480;&#21046;&#26465;&#20214;&#20173;&#28982;&#19981;&#36275;&#20197;&#38480;&#21046;&#26377;&#25928;&#36873;&#21306;&#21010;&#20998;&#22270;&#30340;&#25968;&#37327;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#35299;&#37322;&#19988;&#21487;&#25805;&#20316;&#30340;&#36317;&#31163;&#27979;&#37327;&#26041;&#27861;&#65292;&#20197;&#27492;&#30740;&#31350;&#22312;&#19968;&#31995;&#21015;&#32422;&#26463;&#26465;&#20214;&#19979;&#36873;&#21306;&#21010;&#20998;&#22270;&#30340;&#24212;&#29992;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#34987;&#35748;&#20026;&#26159;&#8220;&#26368;&#20856;&#22411;&#8221;&#30340;&#20013;&#24515;&#22270;&#65292;&#24182;&#36890;&#36807;&#23637;&#31034;&#23427;&#22312;&#19968;&#20010;&#22996;&#21592;&#20250;&#22330;&#26223;&#20013;&#21453;&#26144;&#20102;Kemeny&#65288;&#20975;&#38376;&#32822;&#65289;&#25490;&#21517;&#30340;&#33391;&#22909;&#24615;&#26469;&#32473;&#20986;&#20102;&#20005;&#26684;&#30340;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
In representative democracy, a redistricting map is chosen to partition an electorate into a collection of districts each of which elects a representative. A valid redistricting map must satisfy a collection of constraints such as being compact, contiguous, and of almost equal population. However, these imposed constraints are still loose enough to enable an enormous ensemble of valid redistricting maps. This fact introduces a difficulty in drawing redistricting maps and it also enables a partisan legislature to possibly gerrymander by choosing a map which unfairly favors it. In this paper, we introduce an interpretable and tractable distance measure over redistricting maps which does not use election results and study its implications over the ensemble of redistricting maps. Specifically, we define a central map which may be considered as being "most typical" and give a rigorous justification for it by showing that it mirrors the Kemeny ranking in a scenario where we have a committee 
&lt;/p&gt;</description></item></channel></rss>