<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#25552;&#20986;&#20102;SQL-CRAFT&#26694;&#26550;&#65292;&#36890;&#36807;&#20132;&#20114;&#24335;&#25913;&#36827;&#21644;&#22686;&#24378;&#25512;&#29702;&#65292;&#25552;&#21319;&#20102;&#22823;&#35821;&#35328;&#27169;&#22411;&#22312;&#25991;&#26412;&#21040;SQL&#36716;&#25442;&#20219;&#21153;&#20013;&#30340;&#24615;&#33021;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#24615;&#33021;&#25552;&#21319;&#39640;&#36798;5.7%&#65292;&#24182;&#22312;Spider&#27036;&#21333;&#19978;&#36229;&#36234;&#20102;&#24403;&#21069;&#26368;&#20808;&#36827;&#25216;&#26415;&#12290;</title><link>https://arxiv.org/abs/2402.14851</link><description>&lt;p&gt;
SQL-CRAFT: &#36890;&#36807;&#20132;&#20114;&#24335;&#25913;&#36827;&#21644;&#22686;&#24378;&#25512;&#29702;&#23454;&#29616;&#25991;&#26412;&#21040;SQL&#36716;&#25442;
&lt;/p&gt;
&lt;p&gt;
SQL-CRAFT: Text-to-SQL through Interactive Refinement and Enhanced Reasoning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14851
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;SQL-CRAFT&#26694;&#26550;&#65292;&#36890;&#36807;&#20132;&#20114;&#24335;&#25913;&#36827;&#21644;&#22686;&#24378;&#25512;&#29702;&#65292;&#25552;&#21319;&#20102;&#22823;&#35821;&#35328;&#27169;&#22411;&#22312;&#25991;&#26412;&#21040;SQL&#36716;&#25442;&#20219;&#21153;&#20013;&#30340;&#24615;&#33021;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#24615;&#33021;&#25552;&#21319;&#39640;&#36798;5.7%&#65292;&#24182;&#22312;Spider&#27036;&#21333;&#19978;&#36229;&#36234;&#20102;&#24403;&#21069;&#26368;&#20808;&#36827;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#22823;&#35821;&#35328;&#27169;&#22411;&#24050;&#32463;&#21464;&#24471;&#36234;&#26469;&#36234;&#24378;&#22823;&#65292;&#20294;&#22312;&#19987;&#38376;&#20219;&#21153;&#65288;&#22914;&#25991;&#26412;&#21040;SQL&#65289;&#26041;&#38754;&#20173;&#38754;&#20020;&#25361;&#25112;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;SQL-CRAFT&#65292;&#19968;&#20010;&#36890;&#36807;&#20132;&#20114;&#24335;&#25913;&#36827;&#21644;&#22686;&#24378;&#25512;&#29702;&#26469;&#25552;&#21319;&#22823;&#35821;&#35328;&#27169;&#22411;SQL&#29983;&#25104;&#33021;&#21147;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#21033;&#29992;&#20132;&#20114;&#24335;&#32416;&#38169;&#24490;&#29615;&#65288;IC-Loop&#65289;&#20351;&#22823;&#35821;&#35328;&#27169;&#22411;&#19982;&#25968;&#25454;&#24211;&#33258;&#21160;&#20132;&#20114;&#65292;&#21516;&#26102;&#37319;&#29992;&#22686;&#24378;&#25512;&#29702;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#20004;&#20010;&#25991;&#26412;&#21040;SQL&#25968;&#25454;&#38598;Spider&#21644;Bird&#19978;&#36827;&#34892;&#23454;&#39564;&#65292;&#24615;&#33021;&#27604;&#26420;&#32032;&#25552;&#31034;&#26041;&#27861;&#25552;&#39640;&#20102;&#39640;&#36798;5.7%&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;Spider&#27036;&#21333;&#19978;&#36229;&#36807;&#20102;&#24403;&#21069;&#26368;&#20808;&#36827;&#25216;&#26415;&#65292;&#23637;&#31034;&#20102;&#25105;&#20204;&#26694;&#26550;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14851v1 Announce Type: cross  Abstract: Modern LLMs have become increasingly powerful, but they are still facing challenges in specialized tasks such as Text-to-SQL. We propose SQL-CRAFT, a framework to advance LLMs' SQL generation Capabilities through inteRActive reFinemenT and enhanced reasoning. We leverage an Interactive Correction Loop (IC-Loop) for LLMs to interact with databases automatically, as well as Python-enhanced reasoning. We conduct experiments on two Text-to-SQL datasets, Spider and Bird, with performance improvements of up to 5.7% compared to the naive prompting method. Moreover, our method surpasses the current state-of-the-art on the Spider Leaderboard, demonstrating the effectiveness of our framework.
&lt;/p&gt;</description></item></channel></rss>