<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#25552;&#20986;&#20102;&#27169;&#22411;&#28246;&#30340;&#27010;&#24565;&#65292;&#22312;&#35299;&#20915;&#22823;&#22411;&#27169;&#22411;&#31649;&#29702;&#20013;&#30340;&#22522;&#30784;&#30740;&#31350;&#25361;&#25112;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>https://arxiv.org/abs/2403.02327</link><description>&lt;p&gt;
&#27169;&#22411;&#28246;
&lt;/p&gt;
&lt;p&gt;
Model Lakes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02327
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#27169;&#22411;&#28246;&#30340;&#27010;&#24565;&#65292;&#22312;&#35299;&#20915;&#22823;&#22411;&#27169;&#22411;&#31649;&#29702;&#20013;&#30340;&#22522;&#30784;&#30740;&#31350;&#25361;&#25112;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32473;&#23450;&#19968;&#32452;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#23547;&#25214;&#36866;&#21512;&#29305;&#23450;&#20219;&#21153;&#30340;&#27169;&#22411;&#12289;&#29702;&#35299;&#36825;&#20123;&#27169;&#22411;&#24182;&#21306;&#20998;&#23427;&#20204;&#20043;&#38388;&#30340;&#24046;&#24322;&#21487;&#33021;&#26159;&#22256;&#38590;&#30340;&#12290;&#30446;&#21069;&#65292;&#20174;&#19994;&#32773;&#20381;&#38752;&#25163;&#24037;&#32534;&#20889;&#30340;&#25991;&#26723;&#26469;&#29702;&#35299;&#21644;&#36873;&#25321;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#24182;&#38750;&#25152;&#26377;&#27169;&#22411;&#37117;&#26377;&#23436;&#25972;&#21487;&#38752;&#30340;&#25991;&#26723;&#12290;&#38543;&#30528;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#25968;&#37327;&#30340;&#22686;&#21152;&#65292;&#21457;&#29616;&#12289;&#21306;&#20998;&#21644;&#29702;&#35299;&#36825;&#20123;&#27169;&#22411;&#30340;&#38382;&#39064;&#21464;&#24471;&#26356;&#20026;&#37325;&#35201;&#12290;&#21463;&#25968;&#25454;&#28246;&#30740;&#31350;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#23450;&#20041;&#20102;&#27169;&#22411;&#28246;&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;&#22823;&#22411;&#27169;&#22411;&#31649;&#29702;&#20013;&#30340;&#22522;&#26412;&#30740;&#31350;&#25361;&#25112;&#65292;&#24182;&#25506;&#35752;&#20102;&#21738;&#20123;&#22522;&#26412;&#30340;&#25968;&#25454;&#31649;&#29702;&#25216;&#26415;&#21487;&#20197;&#24212;&#29992;&#20110;&#22823;&#22411;&#27169;&#22411;&#31649;&#29702;&#30340;&#30740;&#31350;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02327v1 Announce Type: cross  Abstract: Given a set of deep learning models, it can be hard to find models appropriate to a task, understand the models, and characterize how models are different one from another. Currently, practitioners rely on manually-written documentation to understand and choose models. However, not all models have complete and reliable documentation. As the number of machine learning models increases, this issue of finding, differentiating, and understanding models is becoming more crucial. Inspired from research on data lakes, we introduce and define the concept of model lakes. We discuss fundamental research challenges in the management of large models. And we discuss what principled data management techniques can be brought to bear on the study of large model management.
&lt;/p&gt;</description></item></channel></rss>