<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32534;&#30721;&#35745;&#31639;&#21644;&#21521;&#37327;&#25215;&#35834;&#30340;&#25308;&#21344;&#24237;&#25269;&#25239;&#23433;&#20840;&#32858;&#21512;&#26041;&#26696;&#65292;&#29992;&#20110;&#32852;&#37030;&#23398;&#20064;&#12290;&#35813;&#26041;&#26696;&#36890;&#36807;RAM&#31192;&#23494;&#20849;&#20139;&#23558;&#26412;&#22320;&#26356;&#26032;&#20998;&#21106;&#25104;&#36739;&#23567;&#23376;&#21521;&#37327;&#65292;&#24182;&#20351;&#29992;&#21452;&#37325;RAMP&#20849;&#20139;&#25216;&#26415;&#23454;&#29616;&#25104;&#23545;&#36317;&#31163;&#30340;&#23433;&#20840;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2302.09913</link><description>&lt;p&gt;
&#22522;&#20110;&#32534;&#30721;&#35745;&#31639;&#21644;&#21521;&#37327;&#25215;&#35834;&#30340;&#25308;&#21344;&#24237;&#25269;&#25239;&#23433;&#20840;&#32858;&#21512;&#26041;&#26696;&#65292;&#29992;&#20110;&#32852;&#37030;&#23398;&#20064; (arXiv:2302.09913v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
ByzSecAgg: A Byzantine-Resistant Secure Aggregation Scheme for Federated Learning Based on Coded Computing and Vector Commitment. (arXiv:2302.09913v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09913
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32534;&#30721;&#35745;&#31639;&#21644;&#21521;&#37327;&#25215;&#35834;&#30340;&#25308;&#21344;&#24237;&#25269;&#25239;&#23433;&#20840;&#32858;&#21512;&#26041;&#26696;&#65292;&#29992;&#20110;&#32852;&#37030;&#23398;&#20064;&#12290;&#35813;&#26041;&#26696;&#36890;&#36807;RAM&#31192;&#23494;&#20849;&#20139;&#23558;&#26412;&#22320;&#26356;&#26032;&#20998;&#21106;&#25104;&#36739;&#23567;&#23376;&#21521;&#37327;&#65292;&#24182;&#20351;&#29992;&#21452;&#37325;RAMP&#20849;&#20139;&#25216;&#26415;&#23454;&#29616;&#25104;&#23545;&#36317;&#31163;&#30340;&#23433;&#20840;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#32852;&#37030;&#23398;&#20064;&#20445;&#25252;&#26041;&#26696;&#65292;&#21487;&#20197;&#25269;&#24481;&#25308;&#21344;&#24237;&#25915;&#20987;&#21644;&#38544;&#31169;&#27844;&#38706;&#12290;&#36825;&#31181;&#26041;&#26696;&#36890;&#36807;&#22788;&#29702;&#21333;&#20010;&#26356;&#26032;&#26469;&#31649;&#29702;&#23545;&#25239;&#34892;&#20026;&#65292;&#24182;&#22312;&#25269;&#24481;&#20018;&#36890;&#33410;&#28857;&#30340;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;&#28982;&#32780;&#65292;&#29992;&#20110;&#23545;&#26356;&#26032;&#21521;&#37327;&#36827;&#34892;&#23433;&#20840;&#31192;&#23494;&#20849;&#20139;&#30340;&#36890;&#20449;&#36127;&#36733;&#21487;&#33021;&#38750;&#24120;&#39640;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#26412;&#22320;&#26356;&#26032;&#20998;&#21106;&#25104;&#36739;&#23567;&#23376;&#21521;&#37327;&#24182;&#20351;&#29992;RAM&#31192;&#23494;&#20849;&#20139;&#30340;&#26041;&#26696;&#12290;&#20294;&#26159;&#65292;&#36825;&#31181;&#20849;&#20139;&#26041;&#27861;&#26080;&#27861;&#36827;&#34892;&#21452;&#32447;&#24615;&#35745;&#31639;&#65292;&#20363;&#22914;&#38656;&#35201;&#24322;&#24120;&#26816;&#27979;&#31639;&#27861;&#30340;&#25104;&#23545;&#36317;&#31163;&#35745;&#31639;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38382;&#39064;&#65292;&#27599;&#20010;&#29992;&#25143;&#37117;&#20250;&#36816;&#34892;&#21478;&#19968;&#36718;RAMP&#20849;&#20139;&#65292;&#35813;&#20849;&#20139;&#20855;&#26377;&#19981;&#21516;&#30340;&#25968;&#25454;&#23884;&#20837;&#20854;&#20013;&#12290;&#36825;&#31181;&#21463;&#32534;&#30721;&#35745;&#31639;&#24605;&#24819;&#21551;&#21457;&#30340;&#25216;&#26415;&#23454;&#29616;&#20102;&#25104;&#23545;&#36317;&#31163;&#30340;&#23433;&#20840;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we propose an efficient secure aggregation scheme for federated learning that is protected against Byzantine attacks and privacy leakages. Processing individual updates to manage adversarial behavior, while preserving privacy of data against colluding nodes, requires some sort of secure secret sharing. However, communication load for secret sharing of long vectors of updates can be very high. To resolve this issue, in the proposed scheme, local updates are partitioned into smaller sub-vectors and shared using ramp secret sharing. However, this sharing method does not admit bi-linear computations, such as pairwise distance calculations, needed by outlier-detection algorithms. To overcome this issue, each user runs another round of ramp sharing, with different embedding of data in the sharing polynomial. This technique, motivated by ideas from coded computing, enables secure computation of pairwise distance. In addition, to maintain the integrity and privacy of the local u
&lt;/p&gt;</description></item></channel></rss>