<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#38543;&#26426;&#27425;&#27169;&#25910;&#30410;&#21644;&#20840;&#36172;&#24466;&#24310;&#36831;&#21453;&#39304;&#30340;&#32452;&#21512;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#65292;&#30740;&#31350;&#20102;&#19977;&#31181;&#24310;&#36831;&#21453;&#39304;&#27169;&#22411;&#24182;&#23548;&#20986;&#20102;&#21518;&#24724;&#19978;&#38480;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#31639;&#27861;&#33021;&#22815;&#22312;&#32771;&#34385;&#24310;&#36831;&#32452;&#21512;&#21311;&#21517;&#21453;&#39304;&#26102;&#32988;&#36807;&#20854;&#20182;&#20840;&#36172;&#24466;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2303.13604</link><description>&lt;p&gt;
&#24102;&#26377;&#24310;&#36831;&#32452;&#21512;&#21311;&#21517;&#36172;&#24466;&#21453;&#39304;&#30340;&#38543;&#26426;&#27425;&#27169;&#36172;&#21338;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Stochastic Submodular Bandits with Delayed Composite Anonymous Bandit Feedback. (arXiv:2303.13604v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13604
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#38543;&#26426;&#27425;&#27169;&#25910;&#30410;&#21644;&#20840;&#36172;&#24466;&#24310;&#36831;&#21453;&#39304;&#30340;&#32452;&#21512;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#65292;&#30740;&#31350;&#20102;&#19977;&#31181;&#24310;&#36831;&#21453;&#39304;&#27169;&#22411;&#24182;&#23548;&#20986;&#20102;&#21518;&#24724;&#19978;&#38480;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#31639;&#27861;&#33021;&#22815;&#22312;&#32771;&#34385;&#24310;&#36831;&#32452;&#21512;&#21311;&#21517;&#21453;&#39304;&#26102;&#32988;&#36807;&#20854;&#20182;&#20840;&#36172;&#24466;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32452;&#21512;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#65292;&#20854;&#20013;&#21253;&#21547;&#20102;&#26399;&#26395;&#19979;&#30340;&#38543;&#26426;&#27425;&#27169;&#25910;&#30410;&#21644;&#20840;&#36172;&#24466;&#24310;&#36831;&#21453;&#39304;&#65292;&#24310;&#36831;&#21453;&#39304;&#34987;&#20551;&#23450;&#20026;&#32452;&#21512;&#21644;&#21311;&#21517;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#24310;&#36831;&#21453;&#39304;&#26159;&#30001;&#36807;&#21435;&#34892;&#21160;&#30340;&#22870;&#21169;&#32452;&#25104;&#30340;&#65292;&#36825;&#20123;&#22870;&#21169;&#30001;&#23376;&#32452;&#20214;&#26500;&#25104;&#65292;&#20854;&#26410;&#30693;&#30340;&#20998;&#37197;&#26041;&#24335;&#12290;&#30740;&#31350;&#20102;&#19977;&#31181;&#24310;&#36831;&#21453;&#39304;&#27169;&#22411;&#65306;&#26377;&#30028;&#23545;&#25239;&#27169;&#22411;&#12289;&#38543;&#26426;&#29420;&#31435;&#27169;&#22411;&#21644;&#38543;&#26426;&#26465;&#20214;&#29420;&#31435;&#27169;&#22411;&#65292;&#24182;&#38024;&#23545;&#27599;&#31181;&#24310;&#36831;&#27169;&#22411;&#23548;&#20986;&#20102;&#21518;&#24724;&#30028;&#12290;&#24573;&#30053;&#38382;&#39064;&#30456;&#20851;&#21442;&#25968;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#26377;&#24310;&#36831;&#27169;&#22411;&#30340;&#21518;&#24724;&#30028;&#20026; $\tilde{O}(T^{2/3} + T^{1/3} \nu)$&#65292;&#20854;&#20013; $T$ &#26159;&#26102;&#38388;&#33539;&#22260;&#65292;$\nu$ &#26159;&#19977;&#31181;&#24773;&#20917;&#19979;&#19981;&#21516;&#23450;&#20041;&#30340;&#24310;&#36831;&#21442;&#25968;&#65292;&#22240;&#27492;&#23637;&#31034;&#20102;&#24102;&#26377;&#24310;&#36831;&#30340;&#34917;&#20607;&#39033;&#12290;&#25152;&#32771;&#34385;&#30340;&#31639;&#27861;&#34987;&#35777;&#26126;&#33021;&#22815;&#32988;&#36807;&#20854;&#20182;&#32771;&#34385;&#20102;&#24310;&#36831;&#32452;&#21512;&#21311;&#21517;&#21453;&#39304;&#30340;&#20840;&#36172;&#24466;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the problem of combinatorial multiarmed bandits with stochastic submodular (in expectation) rewards and full-bandit delayed feedback, where the delayed feedback is assumed to be composite and anonymous. In other words, the delayed feedback is composed of components of rewards from past actions, with unknown division among the sub-components. Three models of delayed feedback: bounded adversarial, stochastic independent, and stochastic conditionally independent are studied, and regret bounds are derived for each of the delay models. Ignoring the problem dependent parameters, we show that regret bound for all the delay models is $\tilde{O}(T^{2/3} + T^{1/3} \nu)$ for time horizon $T$, where $\nu$ is a delay parameter defined differently in the three cases, thus demonstrating an additive term in regret with delay in all the three delay models. The considered algorithm is demonstrated to outperform other full-bandit approaches with delayed composite anonymous feedbac
&lt;/p&gt;</description></item></channel></rss>