<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>KIF&#26694;&#26550;&#21033;&#29992;Wikidata&#20316;&#20026;&#36890;&#29992;&#35821;&#35328;&#65292;&#32467;&#21512;&#29992;&#25143;&#23450;&#20041;&#30340;&#26144;&#23556;&#65292;&#23454;&#29616;&#20102;&#24322;&#26500;&#30693;&#35782;&#24211;&#30340;&#34394;&#25311;&#38598;&#25104;&#65292;&#24418;&#25104;&#31867;&#20284;&#20110;&#25193;&#23637;Wikidata&#30340;&#34394;&#25311;&#30693;&#35782;&#24211;&#65292;&#21487;&#36890;&#36807;&#36807;&#28388;&#25509;&#21475;&#25110;SPARQL&#36827;&#34892;&#26597;&#35810;&#12290;</title><link>https://arxiv.org/abs/2403.10304</link><description>&lt;p&gt;
KIF&#65306;&#20351;&#29992;Wikidata&#36827;&#34892;&#24322;&#26500;&#30693;&#35782;&#24211;&#34394;&#25311;&#38598;&#25104;&#30340;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
KIF: A Framework for Virtual Integration of Heterogeneous Knowledge Bases using Wikidata
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10304
&lt;/p&gt;
&lt;p&gt;
KIF&#26694;&#26550;&#21033;&#29992;Wikidata&#20316;&#20026;&#36890;&#29992;&#35821;&#35328;&#65292;&#32467;&#21512;&#29992;&#25143;&#23450;&#20041;&#30340;&#26144;&#23556;&#65292;&#23454;&#29616;&#20102;&#24322;&#26500;&#30693;&#35782;&#24211;&#30340;&#34394;&#25311;&#38598;&#25104;&#65292;&#24418;&#25104;&#31867;&#20284;&#20110;&#25193;&#23637;Wikidata&#30340;&#34394;&#25311;&#30693;&#35782;&#24211;&#65292;&#21487;&#36890;&#36807;&#36807;&#28388;&#25509;&#21475;&#25110;SPARQL&#36827;&#34892;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#30693;&#35782;&#38598;&#25104;&#26694;&#26550;&#65288;&#31216;&#20026;KIF&#65289;&#65292;&#35813;&#26694;&#26550;&#20351;&#29992;Wikidata&#20316;&#20026;&#36890;&#29992;&#35821;&#35328;&#26469;&#38598;&#25104;&#24322;&#26500;&#30693;&#35782;&#24211;&#12290;&#36825;&#20123;&#30693;&#35782;&#24211;&#21487;&#20197;&#26159;&#19977;&#20803;&#32452;&#23384;&#20648;&#12289;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#12289;CSV&#25991;&#20214;&#31561;&#65292;&#21487;&#20197;&#25110;&#19981;&#21487;&#20197;&#20351;&#29992;RDF&#30340;Wikidata&#26041;&#35328;&#12290;KIF&#21033;&#29992;Wikidata&#30340;&#25968;&#25454;&#27169;&#22411;&#21644;&#35789;&#27719;&#20197;&#21450;&#29992;&#25143;&#23450;&#20041;&#30340;&#26144;&#23556;&#26469;&#23637;&#31034;&#38598;&#25104;&#24211;&#30340;&#32479;&#19968;&#35270;&#22270;&#65292;&#21516;&#26102;&#36319;&#36394;&#20854;&#38472;&#36848;&#30340;&#19978;&#19979;&#25991;&#21644;&#20986;&#22788;&#12290;&#32467;&#26524;&#26159;&#19968;&#20010;&#34892;&#20026;&#31867;&#20284;&#20110;&#8220;&#25193;&#23637;Wikidata&#8221;&#30340;&#34394;&#25311;&#30693;&#35782;&#24211;&#65292;&#21487;&#20197;&#36890;&#36807;&#39640;&#25928;&#36807;&#28388;&#25509;&#21475;&#25110;&#20351;&#29992;SPARQL&#36827;&#34892;&#26597;&#35810;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;KIF&#30340;&#35774;&#35745;&#21644;&#23454;&#29616;&#65292;&#35752;&#35770;&#20102;&#25105;&#20204;&#22914;&#20309;&#22312;&#21270;&#23398;&#39046;&#22495;&#65288;&#28041;&#21450;Wikidata&#12289;PubChem&#21644;IBM CIRCA&#65289;&#20013;&#20351;&#29992;&#23427;&#35299;&#20915;&#23454;&#38469;&#38598;&#25104;&#38382;&#39064;&#65292;&#24182;&#20171;&#32461;&#20102;KIF&#30340;&#24615;&#33021;&#21644;&#24320;&#38144;&#30340;&#23454;&#39564;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10304v1 Announce Type: new  Abstract: We present a knowledge integration framework (called KIF) that uses Wikidata as a lingua franca to integrate heterogeneous knowledge bases. These can be triplestores, relational databases, CSV files, etc., which may or may not use the Wikidata dialect of RDF. KIF leverages Wikidata's data model and vocabulary plus user-defined mappings to expose a unified view of the integrated bases while keeping track of the context and provenance of their statements. The result is a virtual knowledge base which behaves like an "extended Wikidata" and which can be queried either through an efficient filter interface or using SPARQL. We present the design and implementation of KIF, discuss how we have used it to solve a real integration problem in the domain of chemistry (involving Wikidata, PubChem, and IBM CIRCA), and present experimental results on the performance and overhead of KIF.
&lt;/p&gt;</description></item></channel></rss>