<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31216;&#20026;CEFL&#30340;&#30899;&#39640;&#25928;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#33258;&#36866;&#24212;&#30340;&#25104;&#26412;&#24863;&#30693;&#31574;&#30053;&#26469;&#20248;&#21270;FL&#27169;&#22411;&#35757;&#32451;&#30340;&#20219;&#24847;&#25104;&#26412;&#24230;&#37327;&#65292;&#24182;&#25104;&#21151;&#23454;&#29616;&#20102;&#30899;&#25490;&#25918;&#20943;&#23569;93&#65285;&#21644;&#35757;&#32451;&#26102;&#38388;&#20943;&#23569;50&#65285;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2310.17972</link><description>&lt;p&gt;
CEFL&#65306;&#30899;&#39640;&#25928;&#30340;&#32852;&#37030;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
CEFL: Carbon-Efficient Federated Learning. (arXiv:2310.17972v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17972
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31216;&#20026;CEFL&#30340;&#30899;&#39640;&#25928;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#33258;&#36866;&#24212;&#30340;&#25104;&#26412;&#24863;&#30693;&#31574;&#30053;&#26469;&#20248;&#21270;FL&#27169;&#22411;&#35757;&#32451;&#30340;&#20219;&#24847;&#25104;&#26412;&#24230;&#37327;&#65292;&#24182;&#25104;&#21151;&#23454;&#29616;&#20102;&#30899;&#25490;&#25918;&#20943;&#23569;93&#65285;&#21644;&#35757;&#32451;&#26102;&#38388;&#20943;&#23569;50&#65285;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#36890;&#36807;&#23558;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#35757;&#32451;&#20998;&#24067;&#22312;&#35768;&#22810;&#36793;&#32536;&#35774;&#22791;&#19978;&#65292;&#20197;&#20943;&#23569;&#25968;&#25454;&#20256;&#36755;&#24320;&#38144;&#21644;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;&#30001;&#20110;FL&#27169;&#22411;&#35757;&#32451;&#21487;&#33021;&#28041;&#21450;&#25968;&#30334;&#19975;&#20010;&#35774;&#22791;&#65292;&#22240;&#27492;&#38656;&#35201;&#22823;&#37327;&#36164;&#28304;&#65292;&#22240;&#27492;&#20043;&#21069;&#30340;&#24037;&#20316;&#19968;&#30452;&#33268;&#21147;&#20110;&#25552;&#39640;&#20854;&#36164;&#28304;&#25928;&#29575;&#20197;&#20248;&#21270;&#26102;&#38388;&#33267;&#20934;&#30830;&#24615;&#12290;&#28982;&#32780;&#65292;&#20043;&#21069;&#30340;&#24037;&#20316;&#36890;&#24120;&#23558;&#25152;&#26377;&#36164;&#28304;&#35270;&#20026;&#30456;&#21516;&#65292;&#32780;&#23454;&#38469;&#19978;&#23427;&#20204;&#21487;&#33021;&#20135;&#29983;&#22823;&#19981;&#30456;&#21516;&#30340;&#25104;&#26412;&#65292;&#36825;&#21453;&#32780;&#28608;&#21457;&#20102;&#20248;&#21270;&#25104;&#26412;&#33267;&#20934;&#30830;&#24615;&#30340;&#21160;&#26426;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;CEFL&#65292;&#23427;&#20351;&#29992;&#33258;&#36866;&#24212;&#30340;&#25104;&#26412;&#24863;&#30693;&#23458;&#25143;&#36873;&#25321;&#31574;&#30053;&#65292;&#22312;&#35757;&#32451;FL&#27169;&#22411;&#26102;&#20248;&#21270;&#20219;&#24847;&#25104;&#26412;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#31574;&#30053;&#25193;&#23637;&#24182;&#32467;&#21512;&#20102;&#22522;&#20110;&#25928;&#29992;&#30340;&#23458;&#25143;&#36873;&#25321;&#21644;&#20851;&#38190;&#23398;&#20064;&#26399;&#30340;&#20808;&#21069;&#24037;&#20316;&#65292;&#20351;&#20854;&#20855;&#26377;&#25104;&#26412;&#24863;&#30693;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#35774;&#35745;&#30899;&#39640;&#25928;&#30340;FL&#26469;&#28436;&#31034;CEFL&#65292;&#22312;&#36825;&#37324;&#33021;&#28304;&#30340;&#30899;&#24378;&#24230;&#26159;&#25104;&#26412;&#65292;&#24182;&#19988;&#26174;&#31034;&#23427;&#21487;&#20197;&#23558;&#30899;&#25490;&#25918;&#20943;&#23569;93&#65285;&#65292;&#24182;&#23558;&#35757;&#32451;&#26102;&#38388;&#20943;&#23569;50&#65285;&#65292;&#19982;&#38543;&#26426;&#23458;&#25143;&#30456;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated Learning (FL) distributes machine learning (ML) training across many edge devices to reduce data transfer overhead and protect data privacy. Since FL model training may span millions of devices and is thus resource-intensive, prior work has focused on improving its resource efficiency to optimize time-to-accuracy. However, prior work generally treats all resources the same, while, in practice, they may incur widely different costs, which instead motivates optimizing cost-to-accuracy. To address the problem, we design CEFL, which uses adaptive cost-aware client selection policies to optimize an arbitrary cost metric when training FL models. Our policies extend and combine prior work on utility-based client selection and critical learning periods by making them cost-aware. We demonstrate CEFL by designing carbon-efficient FL, where energy's carbon-intensity is the cost, and show that it i) reduces carbon emissions by 93\% and reduces training time by 50% compared to random clie
&lt;/p&gt;</description></item></channel></rss>