<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#35821;&#38899;&#35299;&#26512;&#22120;&#35780;&#20272;&#38382;&#39064;&#21551;&#21457;&#30340;&#32467;&#26500;&#21270;&#21477;&#27861;&#20998;&#26512;&#26641;&#30456;&#20284;&#24615;&#24230;&#37327;&#25351;&#26631;STRUCT-IOU&#65292;&#26377;&#25928;&#22320;&#27604;&#36739;&#20102;&#21475;&#35821;&#35789;&#36793;&#30028;&#19978;&#30340;&#32452;&#22359;&#20998;&#26512;&#26641;&#19982;&#20070;&#38754;&#35789;&#19978;&#22522;&#20934;&#35299;&#26512;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#25991;&#26412;&#32452;&#22359;&#20998;&#26512;&#35780;&#20272;&#20013;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.13433</link><description>&lt;p&gt;
&#32467;&#26500;&#21270;&#26641;&#23545;&#40784;&#29992;&#20110;&#65288;&#35821;&#38899;&#65289;&#32452;&#22359;&#20998;&#26512;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Structured Tree Alignment for Evaluation of (Speech) Constituency Parsing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13433
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#35821;&#38899;&#35299;&#26512;&#22120;&#35780;&#20272;&#38382;&#39064;&#21551;&#21457;&#30340;&#32467;&#26500;&#21270;&#21477;&#27861;&#20998;&#26512;&#26641;&#30456;&#20284;&#24615;&#24230;&#37327;&#25351;&#26631;STRUCT-IOU&#65292;&#26377;&#25928;&#22320;&#27604;&#36739;&#20102;&#21475;&#35821;&#35789;&#36793;&#30028;&#19978;&#30340;&#32452;&#22359;&#20998;&#26512;&#26641;&#19982;&#20070;&#38754;&#35789;&#19978;&#22522;&#20934;&#35299;&#26512;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#25991;&#26412;&#32452;&#22359;&#20998;&#26512;&#35780;&#20272;&#20013;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#32467;&#26500;&#21270;&#24179;&#22343;&#20132;&#38598;-&#32852;&#30431;&#27604;&#65288;STRUCT-IOU&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#21477;&#27861;&#20998;&#26512;&#26641;&#20043;&#38388;&#30340;&#30456;&#20284;&#24615;&#24230;&#37327;&#25351;&#26631;&#65292;&#21463;&#21040;&#20102;&#35780;&#20272;&#35821;&#38899;&#35299;&#26512;&#22120;&#38382;&#39064;&#30340;&#21551;&#21457;&#12290;STRUCT-IOU&#20351;&#24471;&#21487;&#20197;&#27604;&#36739;&#22312;&#33258;&#21160;&#35782;&#21035;&#30340;&#21475;&#35821;&#35789;&#36793;&#30028;&#19978;&#30340;&#32452;&#22359;&#20998;&#26512;&#26641;&#19982;&#22522;&#20934;&#35299;&#26512;&#65288;&#22312;&#20070;&#38754;&#35789;&#19978;&#65289;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#20026;&#20102;&#35745;&#31639;&#36825;&#20010;&#25351;&#26631;&#65292;&#25105;&#20204;&#36890;&#36807;&#24378;&#21046;&#23545;&#40784;&#23558;&#22522;&#20934;&#35299;&#26512;&#26641;&#25237;&#24433;&#21040;&#35821;&#38899;&#39046;&#22495;&#65292;&#23558;&#25237;&#24433;&#30340;&#22522;&#20934;&#25104;&#20998;&#19982;&#39044;&#27979;&#30340;&#25104;&#20998;&#22312;&#19968;&#23450;&#30340;&#32467;&#26500;&#32422;&#26463;&#19979;&#23545;&#40784;&#65292;&#28982;&#21518;&#35745;&#31639;&#25152;&#26377;&#23545;&#40784;&#25104;&#20998;&#23545;&#20043;&#38388;&#30340;&#24179;&#22343;IOU&#20998;&#25968;&#12290;STRUCT-IOU&#32771;&#34385;&#20102;&#35789;&#36793;&#30028;&#65292;&#24182;&#20811;&#26381;&#20102;&#39044;&#27979;&#30340;&#35789;&#21644;&#22522;&#20934;&#20107;&#23454;&#21487;&#33021;&#27809;&#26377;&#23436;&#32654;&#19968;&#19968;&#23545;&#24212;&#30340;&#25361;&#25112;&#12290;&#25193;&#23637;&#21040;&#25991;&#26412;&#32452;&#22359;&#20998;&#26512;&#30340;&#35780;&#20272;&#65292;&#25105;&#20204;&#23637;&#31034;STRUCT-IOU&#34920;&#29616;&#20986;&#26356;&#39640;&#30340;&#23545;&#21477;&#27861;&#21512;&#29702;&#35299;&#26512;&#30340;&#23481;&#24525;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13433v1 Announce Type: new  Abstract: We present the structured average intersection-over-union ratio (STRUCT-IOU), a similarity metric between constituency parse trees motivated by the problem of evaluating speech parsers. STRUCT-IOU enables comparison between a constituency parse tree (over automatically recognized spoken word boundaries) with the ground-truth parse (over written words). To compute the metric, we project the ground-truth parse tree to the speech domain by forced alignment, align the projected ground-truth constituents with the predicted ones under certain structured constraints, and calculate the average IOU score across all aligned constituent pairs. STRUCT-IOU takes word boundaries into account and overcomes the challenge that the predicted words and ground truth may not have perfect one-to-one correspondence. Extending to the evaluation of text constituency parsing, we demonstrate that STRUCT-IOU shows higher tolerance to syntactically plausible parses 
&lt;/p&gt;</description></item></channel></rss>