<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#20998;&#26512;&#30340;&#35282;&#24230;&#28145;&#20837;&#30740;&#31350;&#20102;&#32500;&#24230;&#35781;&#21650;&#30340;&#20004;&#20010;&#20027;&#35201;&#21407;&#22240;&#8212;&#8212;&#36317;&#31163;&#38598;&#20013;&#21644;&#27969;&#24418;&#25928;&#24212;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#20351;&#29992;Minkowski&#36317;&#31163;&#36827;&#34892;&#26368;&#36817;&#37051;&#25628;&#32034;&#65288;NNS&#65289;&#22312;&#39640;&#32500;&#25968;&#25454;&#20013;&#21462;&#24471;&#20102;&#26368;&#20339;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.00422</link><description>&lt;p&gt;
&#20174;&#36317;&#31163;&#38598;&#20013;&#21644;&#27969;&#24418;&#25928;&#24212;&#35299;&#35835;&#32500;&#24230;&#35781;&#21650;
&lt;/p&gt;
&lt;p&gt;
Interpreting the Curse of Dimensionality from Distance Concentration and Manifold Effect. (arXiv:2401.00422v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.00422
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#20998;&#26512;&#30340;&#35282;&#24230;&#28145;&#20837;&#30740;&#31350;&#20102;&#32500;&#24230;&#35781;&#21650;&#30340;&#20004;&#20010;&#20027;&#35201;&#21407;&#22240;&#8212;&#8212;&#36317;&#31163;&#38598;&#20013;&#21644;&#27969;&#24418;&#25928;&#24212;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#20351;&#29992;Minkowski&#36317;&#31163;&#36827;&#34892;&#26368;&#36817;&#37051;&#25628;&#32034;&#65288;NNS&#65289;&#22312;&#39640;&#32500;&#25968;&#25454;&#20013;&#21462;&#24471;&#20102;&#26368;&#20339;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#32500;&#24230;&#30340;&#22686;&#21152;&#65292;&#25968;&#25454;&#30340;&#29305;&#24449;&#22914;&#20998;&#24067;&#21644;&#24322;&#36136;&#24615;&#21464;&#24471;&#36234;&#26469;&#36234;&#22797;&#26434;&#21644;&#36829;&#21453;&#30452;&#35273;&#12290;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#32500;&#24230;&#35781;&#21650;&#65292;&#20302;&#32500;&#31354;&#38388;&#20013;&#25104;&#31435;&#30340;&#24120;&#35265;&#27169;&#24335;&#21644;&#20851;&#31995;&#65288;&#20363;&#22914;&#20869;&#37096;&#21644;&#36793;&#30028;&#27169;&#24335;&#65289;&#22312;&#39640;&#32500;&#31354;&#38388;&#20013;&#21487;&#33021;&#26080;&#25928;&#12290;&#36825;&#23548;&#33268;&#22238;&#24402;&#12289;&#20998;&#31867;&#25110;&#32858;&#31867;&#27169;&#22411;&#25110;&#31639;&#27861;&#30340;&#24615;&#33021;&#38477;&#20302;&#12290;&#32500;&#24230;&#35781;&#21650;&#21487;&#20197;&#24402;&#22240;&#20110;&#35768;&#22810;&#21407;&#22240;&#12290;&#26412;&#25991;&#39318;&#20808;&#24635;&#32467;&#20102;&#19982;&#22788;&#29702;&#39640;&#32500;&#25968;&#25454;&#30456;&#20851;&#30340;&#20116;&#20010;&#25361;&#25112;&#65292;&#24182;&#35299;&#37322;&#20102;&#22238;&#24402;&#12289;&#20998;&#31867;&#25110;&#32858;&#31867;&#20219;&#21153;&#22833;&#36133;&#30340;&#28508;&#22312;&#21407;&#22240;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#29702;&#35770;&#21644;&#23454;&#35777;&#20998;&#26512;&#28145;&#20837;&#30740;&#31350;&#20102;&#32500;&#24230;&#35781;&#21650;&#30340;&#20004;&#20010;&#20027;&#35201;&#21407;&#22240;&#65292;&#21363;&#36317;&#31163;&#38598;&#20013;&#21644;&#27969;&#24418;&#25928;&#24212;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#29992;&#19977;&#31181;&#20856;&#22411;&#30340;&#36317;&#31163;&#27979;&#37327;&#36827;&#34892;&#26368;&#36817;&#37051;&#25628;&#32034;&#65288;NNS&#65289;&#26102;&#65292;Minkowski&#36317;&#31163;&#30340;&#24615;&#33021;&#26368;&#20339;&#12290;
&lt;/p&gt;
&lt;p&gt;
The characteristics of data like distribution and heterogeneity, become more complex and counterintuitive as the dimensionality increases. This phenomenon is known as curse of dimensionality, where common patterns and relationships (e.g., internal and boundary pattern) that hold in low-dimensional space may be invalid in higher-dimensional space. It leads to a decreasing performance for the regression, classification or clustering models or algorithms. Curse of dimensionality can be attributed to many causes. In this paper, we first summarize five challenges associated with manipulating high-dimensional data, and explains the potential causes for the failure of regression, classification or clustering tasks. Subsequently, we delve into two major causes of the curse of dimensionality, distance concentration and manifold effect, by performing theoretical and empirical analyses. The results demonstrate that nearest neighbor search (NNS) using three typical distance measurements, Minkowski
&lt;/p&gt;</description></item></channel></rss>