<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20840;&#38754;&#33258;&#21160;&#21270;&#25193;&#23637;&#65288;FSA&#65289;&#26426;&#21046;&#26469;&#25913;&#21892;&#25968;&#25454;&#20013;&#24515;&#30340;&#33021;&#28304;&#21033;&#29992;&#25928;&#29575;&#65292;&#35813;&#26426;&#21046;&#21033;&#29992;&#28145;&#24230;&#34920;&#24449;&#23398;&#20064;&#26469;&#39044;&#27979;&#27599;&#20010;&#26381;&#21153;&#30340;&#26410;&#26469;&#36127;&#36733;&#24182;&#33258;&#21160;&#31283;&#23450;&#30456;&#24212;&#30340;&#30446;&#26631;CPU&#20351;&#29992;&#29575;&#27700;&#24179;&#12290;</title><link>http://arxiv.org/abs/2305.00706</link><description>&lt;p&gt;
&#21487;&#25345;&#32493;&#21457;&#23637;&#32511;&#33394;&#25968;&#25454;&#20013;&#24515;&#30340;&#20840;&#38754;&#33258;&#21160;&#21270;&#25193;&#23637;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Full Scaling Automation for Sustainable Development of Green Data Centers. (arXiv:2305.00706v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00706
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20840;&#38754;&#33258;&#21160;&#21270;&#25193;&#23637;&#65288;FSA&#65289;&#26426;&#21046;&#26469;&#25913;&#21892;&#25968;&#25454;&#20013;&#24515;&#30340;&#33021;&#28304;&#21033;&#29992;&#25928;&#29575;&#65292;&#35813;&#26426;&#21046;&#21033;&#29992;&#28145;&#24230;&#34920;&#24449;&#23398;&#20064;&#26469;&#39044;&#27979;&#27599;&#20010;&#26381;&#21153;&#30340;&#26410;&#26469;&#36127;&#36733;&#24182;&#33258;&#21160;&#31283;&#23450;&#30456;&#24212;&#30340;&#30446;&#26631;CPU&#20351;&#29992;&#29575;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20113;&#35745;&#31639;&#30340;&#24555;&#36895;&#23835;&#36215;&#23548;&#33268;&#25968;&#25454;&#20013;&#24515;&#30899;&#25490;&#25918;&#37327;&#24778;&#20154;&#22320;&#22686;&#21152;&#65292;&#29616;&#22312;&#21344;&#20840;&#29699;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&gt;3&#65285;&#65292;&#24517;&#39035;&#31435;&#21363;&#37319;&#21462;&#25514;&#26045;&#24212;&#23545;&#23427;&#20204;&#23545;&#20840;&#29699;&#27668;&#20505;&#26085;&#30410;&#22686;&#38271;&#30340;&#36127;&#25285;&#12290;&#36825;&#19968;&#21162;&#21147;&#30340;&#37325;&#28857;&#26159;&#25552;&#39640;&#36164;&#28304;&#21033;&#29992;&#29575;&#20197;&#33410;&#30465;&#30005;&#21147;&#28040;&#32791;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#20840;&#38754;&#33258;&#21160;&#21270;&#25193;&#23637;&#65288;FSA&#65289;&#26426;&#21046;&#26159;&#19968;&#31181;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#22823;&#35268;&#27169;&#20113;&#35745;&#31639;&#38598;&#32676;&#20013;&#21160;&#24577;&#22320;&#36866;&#24212;&#19981;&#26029;&#21464;&#21270;&#30340;&#24037;&#20316;&#36127;&#36733;&#65292;&#20351;&#25968;&#25454;&#20013;&#24515;&#20013;&#30340;&#38598;&#32676;&#20445;&#25345;&#20854;&#25152;&#38656;&#30340;CPU&#21033;&#29992;&#29575;&#30446;&#26631;&#65292;&#20174;&#32780;&#25913;&#21892;&#33021;&#28304;&#25928;&#29575;&#12290;FSA&#21033;&#29992;&#28145;&#24230;&#34920;&#24449;&#23398;&#20064;&#30340;&#23041;&#21147;&#26469;&#20934;&#30830;&#39044;&#27979;&#27599;&#20010;&#26381;&#21153;&#30340;&#26410;&#26469;&#24037;&#20316;&#36127;&#36733;&#65292;&#24182;&#33258;&#21160;&#31283;&#23450;&#30456;&#24212;&#30340;&#30446;&#26631;CPU&#20351;&#29992;&#29575;&#27700;&#24179;&#65292;&#19981;&#20687;&#20043;&#21069;&#30340;&#33258;&#21160;&#25193;&#23637;&#26041;&#27861;&#65292;&#22914;Autopilot&#25110;FIRM&#65292;&#38656;&#35201;&#20351;&#29992;&#32479;&#35745;&#27169;&#22411;&#21644;&#19987;&#23478;&#30693;&#35782;&#26469;&#35843;&#25972;&#35745;&#31639;&#36164;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rapid rise in cloud computing has resulted in an alarming increase in data centers' carbon emissions, which now accounts for &gt;3% of global greenhouse gas emissions, necessitating immediate steps to combat their mounting strain on the global climate. An important focus of this effort is to improve resource utilization in order to save electricity usage. Our proposed Full Scaling Automation (FSA) mechanism is an effective method of dynamically adapting resources to accommodate changing workloads in large-scale cloud computing clusters, enabling the clusters in data centers to maintain their desired CPU utilization target and thus improve energy efficiency. FSA harnesses the power of deep representation learning to accurately predict the future workload of each service and automatically stabilize the corresponding target CPU usage level, unlike the previous autoscaling methods, such as Autopilot or FIRM, that need to adjust computing resources with statistical models and expert knowle
&lt;/p&gt;</description></item></channel></rss>