<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>MaRDI&#24320;&#21457;&#20102;&#19968;&#20010;FAIR&#21644;&#21487;&#26426;&#22120;&#35299;&#37322;&#30340;&#27169;&#26495;&#65292;&#29992;&#20110;&#20840;&#38754;&#25991;&#26723;&#21270;&#24212;&#29992;&#25968;&#23398;&#20013;&#30340;&#24314;&#27169;-&#20223;&#30495;-&#20248;&#21270;&#24037;&#20316;&#27969;&#31243;&#65292;&#24182;&#23637;&#31034;&#20102;MaRDMO&#21644;MathModDB&#30693;&#35782;&#22270;&#20043;&#38388;&#30340;&#20132;&#20114;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.17778</link><description>&lt;p&gt;
&#36808;&#21521;&#24212;&#29992;&#25968;&#23398;&#20013;&#24037;&#20316;&#27969;&#31243;&#21644;&#27169;&#22411;&#30340;FAIR&#25991;&#26723;&#21270;
&lt;/p&gt;
&lt;p&gt;
Towards a FAIR Documentation of Workflows and Models in Applied Mathematics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17778
&lt;/p&gt;
&lt;p&gt;
MaRDI&#24320;&#21457;&#20102;&#19968;&#20010;FAIR&#21644;&#21487;&#26426;&#22120;&#35299;&#37322;&#30340;&#27169;&#26495;&#65292;&#29992;&#20110;&#20840;&#38754;&#25991;&#26723;&#21270;&#24212;&#29992;&#25968;&#23398;&#20013;&#30340;&#24314;&#27169;-&#20223;&#30495;-&#20248;&#21270;&#24037;&#20316;&#27969;&#31243;&#65292;&#24182;&#23637;&#31034;&#20102;MaRDMO&#21644;MathModDB&#30693;&#35782;&#22270;&#20043;&#38388;&#30340;&#20132;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17778v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#25688;&#35201;&#65306;&#24314;&#27169;-&#20223;&#30495;-&#20248;&#21270;&#24037;&#20316;&#27969;&#22312;&#24212;&#29992;&#25968;&#23398;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#12290;&#25968;&#23398;&#30740;&#31350;&#25968;&#25454;&#20513;&#35758;MaRDI&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;FAIR&#21644;&#21487;&#26426;&#22120;&#35299;&#37322;&#30340;&#27169;&#26495;&#65292;&#23545;&#36825;&#20123;&#24037;&#20316;&#27969;&#30340;&#20840;&#38754;&#25991;&#26723;&#21270;&#20570;&#20986;&#20102;&#22238;&#24212;&#12290;&#30740;&#31350;&#25968;&#25454;&#31649;&#29702;&#32452;&#32455;&#32773;&#30340;&#25554;&#20214;MaRDMO&#20351;&#26469;&#33258;&#19981;&#21516;&#39046;&#22495;&#30340;&#31185;&#23398;&#23478;&#21487;&#20197;&#21033;&#29992;MaRDI&#27169;&#26495;&#22312;MaRDI&#38376;&#25143;&#19978;&#26080;&#32541;&#22320;&#35760;&#24405;&#21644;&#21457;&#24067;&#20182;&#20204;&#30340;&#24037;&#20316;&#27969;&#12290;&#36825;&#20123;&#24037;&#20316;&#27969;&#30340;&#26680;&#24515;&#26159;&#25968;&#23398;&#27169;&#22411;&#12290;MaRDI&#36890;&#36807;MathModDB&#26412;&#20307;&#35770;&#35299;&#20915;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#32467;&#26500;&#21270;&#30340;&#24418;&#24335;&#27169;&#22411;&#25551;&#36848;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#26469;&#33258;&#25968;&#23383;&#20154;&#25991;&#23398;&#31185;&#30340;&#20195;&#25968;&#24314;&#27169;&#24037;&#20316;&#27969;&#31243;&#20013;MaRDMO&#21644;MathModDB&#30693;&#35782;&#22270;&#20043;&#38388;&#30340;&#20132;&#20114;&#20316;&#29992;&#12290;&#36825;&#20010;&#28436;&#31034;&#31361;&#26174;&#20102;&#36825;&#20004;&#39033;&#26381;&#21153;&#22312;&#21407;&#22987;&#25968;&#20540;&#39046;&#22495;&#20043;&#22806;&#30340;&#22810;&#21151;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17778v1 Announce Type: new  Abstract: Modeling-Simulation-Optimization workflows play a fundamental role in applied mathematics. The Mathematical Research Data Initiative, MaRDI, responded to this by developing a FAIR and machine-interpretable template for a comprehensive documentation of such workflows. MaRDMO, a Plugin for the Research Data Management Organiser, enables scientists from diverse fields to document and publish their workflows on the MaRDI Portal seamlessly using the MaRDI template. Central to these workflows are mathematical models. MaRDI addresses them with the MathModDB ontology, offering a structured formal model description. Here, we showcase the interaction between MaRDMO and the MathModDB Knowledge Graph through an algebraic modeling workflow from the Digital Humanities. This demonstration underscores the versatility of both services beyond their original numerical domain.
&lt;/p&gt;</description></item></channel></rss>