<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>Roq&#26159;&#19968;&#20010;&#22522;&#20110;&#39118;&#38505;&#24863;&#30693;&#23398;&#20064;&#26041;&#27861;&#30340;&#32508;&#21512;&#26694;&#26550;&#65292;&#29992;&#20110;&#23454;&#29616;&#40065;&#26834;&#30340;&#26597;&#35810;&#20248;&#21270;&#12290;</title><link>http://arxiv.org/abs/2401.15210</link><description>&lt;p&gt;
Roq&#65306;&#22522;&#20110;&#39118;&#38505;&#24863;&#30693;&#23398;&#20064;&#25104;&#26412;&#27169;&#22411;&#30340;&#40065;&#26834;&#26597;&#35810;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Roq: Robust Query Optimization Based on a Risk-aware Learned Cost Model. (arXiv:2401.15210v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15210
&lt;/p&gt;
&lt;p&gt;
Roq&#26159;&#19968;&#20010;&#22522;&#20110;&#39118;&#38505;&#24863;&#30693;&#23398;&#20064;&#26041;&#27861;&#30340;&#32508;&#21512;&#26694;&#26550;&#65292;&#29992;&#20110;&#23454;&#29616;&#40065;&#26834;&#30340;&#26597;&#35810;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20851;&#31995;&#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;(RDBMS)&#20013;&#30340;&#26597;&#35810;&#20248;&#21270;&#22120;&#25628;&#32034;&#39044;&#26399;&#23545;&#20110;&#32473;&#23450;&#26597;&#35810;&#26368;&#20248;&#30340;&#25191;&#34892;&#35745;&#21010;&#12290;&#23427;&#20204;&#20351;&#29992;&#21442;&#25968;&#20272;&#35745;&#65292;&#36890;&#24120;&#26159;&#19981;&#20934;&#30830;&#30340;&#65292;&#24182;&#19988;&#20570;&#20986;&#30340;&#20551;&#35774;&#22312;&#23454;&#36341;&#20013;&#21487;&#33021;&#19981;&#25104;&#31435;&#12290;&#22240;&#27492;&#65292;&#22312;&#36825;&#20123;&#20272;&#35745;&#21644;&#20551;&#35774;&#26080;&#25928;&#26102;&#65292;&#23427;&#20204;&#21487;&#33021;&#36873;&#25321;&#22312;&#36816;&#34892;&#26102;&#26159;&#27425;&#20248;&#30340;&#25191;&#34892;&#35745;&#21010;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#26597;&#35810;&#24615;&#33021;&#19981;&#20339;&#12290;&#22240;&#27492;&#65292;&#26597;&#35810;&#20248;&#21270;&#22120;&#19981;&#36275;&#20197;&#25903;&#25345;&#40065;&#26834;&#30340;&#26597;&#35810;&#20248;&#21270;&#12290;&#36817;&#24180;&#26469;&#65292;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;(ML)&#26469;&#25552;&#39640;&#25968;&#25454;&#31995;&#32479;&#30340;&#25928;&#29575;&#24182;&#20943;&#23569;&#20854;&#32500;&#25252;&#24320;&#38144;&#30340;&#20852;&#36259;&#26085;&#30410;&#39640;&#28072;&#65292;&#22312;&#26597;&#35810;&#20248;&#21270;&#39046;&#22495;&#21462;&#24471;&#20102;&#26377;&#24076;&#26395;&#30340;&#32467;&#26524;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#21463;&#21040;&#36825;&#20123;&#36827;&#23637;&#30340;&#21551;&#21457;&#65292;&#24182;&#22522;&#20110;IBM Db2&#22810;&#24180;&#30340;&#32463;&#39564;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Roq: &#19968;&#31181;&#22522;&#20110;&#39118;&#38505;&#24863;&#30693;&#23398;&#20064;&#26041;&#27861;&#30340;&#32508;&#21512;&#26694;&#26550;&#65292;&#23427;&#23454;&#29616;&#20102;&#40065;&#26834;&#30340;&#26597;&#35810;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
Query optimizers in relational database management systems (RDBMSs) search for execution plans expected to be optimal for a given queries. They use parameter estimates, often inaccurate, and make assumptions that may not hold in practice. Consequently, they may select execution plans that are suboptimal at runtime, when these estimates and assumptions are not valid, which may result in poor query performance. Therefore, query optimizers do not sufficiently support robust query optimization. Recent years have seen a surge of interest in using machine learning (ML) to improve efficiency of data systems and reduce their maintenance overheads, with promising results obtained in the area of query optimization in particular. In this paper, inspired by these advancements, and based on several years of experience of IBM Db2 in this journey, we propose Robust Optimization of Queries, (Roq), a holistic framework that enables robust query optimization based on a risk-aware learning approach. Roq 
&lt;/p&gt;</description></item></channel></rss>