<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#22270;&#24418;&#25688;&#35201;&#26469;&#25628;&#32034;COVID-19&#20020;&#24202;&#30740;&#31350;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#23558;&#25688;&#35201;&#21644;&#22270;&#24418;&#25688;&#35201;&#34920;&#31034;&#20026;&#26412;&#20307;&#26415;&#35821;&#22270;&#24182;&#22312;&#32593;&#32476;&#20013;&#21305;&#37197;&#65292;&#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23545;&#29616;&#26377;&#25991;&#29486;&#36827;&#34892;&#25628;&#32034;&#12290;</title><link>http://arxiv.org/abs/2310.04094</link><description>&lt;p&gt;
&#20351;&#29992;&#22270;&#24418;&#25688;&#35201;&#25628;&#32034;COVID-19&#20020;&#24202;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Searching COVID-19 clinical research using graphical abstracts. (arXiv:2310.04094v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04094
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#22270;&#24418;&#25688;&#35201;&#26469;&#25628;&#32034;COVID-19&#20020;&#24202;&#30740;&#31350;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#23558;&#25688;&#35201;&#21644;&#22270;&#24418;&#25688;&#35201;&#34920;&#31034;&#20026;&#26412;&#20307;&#26415;&#35821;&#22270;&#24182;&#22312;&#32593;&#32476;&#20013;&#21305;&#37197;&#65292;&#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23545;&#29616;&#26377;&#25991;&#29486;&#36827;&#34892;&#25628;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#26631;&#65306;&#22270;&#24418;&#25688;&#35201;&#26159;&#23545;&#31185;&#23398;&#25991;&#31456;&#20027;&#35201;&#21457;&#29616;&#36827;&#34892;&#35270;&#35273;&#24635;&#32467;&#30340;&#27010;&#24565;&#22270;&#12290;&#34429;&#28982;&#22270;&#24418;&#25688;&#35201;&#36890;&#24120;&#29992;&#20110;&#31185;&#23398;&#20986;&#29256;&#29289;&#20013;&#39044;&#27979;&#21644;&#24635;&#32467;&#20027;&#35201;&#32467;&#26524;&#65292;&#20294;&#25105;&#20204;&#23558;&#20854;&#20316;&#20026;&#34920;&#36798;&#23545;&#29616;&#26377;&#25991;&#29486;&#36827;&#34892;&#22270;&#24418;&#25628;&#32034;&#30340;&#25163;&#27573;&#12290;&#26448;&#26009;&#21644;&#26041;&#27861;&#65306;&#25105;&#20204;&#32771;&#34385;COVID-19&#24320;&#25918;&#30740;&#31350;&#25968;&#25454;&#38598;&#65288;CORD-19&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#21253;&#21547;&#36229;&#36807;&#19968;&#30334;&#19975;&#20010;&#25688;&#35201;&#30340;&#35821;&#26009;&#24211;&#65307;&#27599;&#20010;&#25688;&#35201;&#34987;&#25551;&#36848;&#20026;&#20849;&#29616;&#26412;&#20307;&#26415;&#35821;&#22270;&#65292;&#36825;&#20123;&#26415;&#35821;&#20174;&#32479;&#19968;&#21307;&#23398;&#35821;&#35328;&#31995;&#32479;&#65288;UMLS&#65289;&#21644;&#20896;&#29366;&#30149;&#27602;&#20256;&#26579;&#30149;&#26412;&#20307;&#65288;CIDO&#65289;&#20013;&#36873;&#25321;&#12290;&#22270;&#24418;&#25688;&#35201;&#20063;&#34987;&#34920;&#31034;&#20026;&#26412;&#20307;&#26415;&#35821;&#22270;&#65292;&#21487;&#33021;&#36824;&#21253;&#25324;&#25551;&#36848;&#20854;&#30456;&#20114;&#20316;&#29992;&#30340;&#23454;&#29992;&#26415;&#35821;&#65288;&#20363;&#22914;&#65292;&#8220;&#30456;&#20851;&#8221;&#65292;&#8220;&#22686;&#21152;&#8221;&#65292;&#8220;&#24341;&#21457;&#8221;&#65289;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#21253;&#21547;&#35821;&#26009;&#24211;&#20013;&#25552;&#21450;&#30340;&#27010;&#24565;&#30340;&#20849;&#29616;&#32593;&#32476;&#65307;&#28982;&#21518;&#25105;&#20204;&#22312;&#32593;&#32476;&#19978;&#35782;&#21035;&#20986;&#22270;&#24418;&#25688;&#35201;&#30340;&#26368;&#20339;&#21305;&#37197;&#39033;&#12290;&#25105;&#20204;&#21033;&#29992;&#22270;&#24418;&#25968;&#25454;&#24211;...
&lt;/p&gt;
&lt;p&gt;
Objective. Graphical abstracts are small graphs of concepts that visually summarize the main findings of scientific articles. While graphical abstracts are customarily used in scientific publications to anticipate and summarize their main results, we propose them as a means for expressing graph searches over existing literature. Materials and methods. We consider the COVID-19 Open Research Dataset (CORD-19), a corpus of more than one million abstracts; each of them is described as a graph of co-occurring ontological terms, selected from the Unified Medical Language System (UMLS) and the Ontology of Coronavirus Infectious Disease (CIDO). Graphical abstracts are also expressed as graphs of ontological terms, possibly augmented by utility terms describing their interactions (e.g., "associated with", "increases", "induces"). We build a co-occurrence network of concepts mentioned in the corpus; we then identify the best matches of graphical abstracts on the network. We exploit graph databas
&lt;/p&gt;</description></item></channel></rss>