<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#23398;&#20064;&#30340;&#22768;&#26126;&#24615;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;Differentially-Private Stochastic Gradient Descent&#65288;DP-SGD&#65289;&#31639;&#27861;&#35757;&#32451;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#26367;&#20195;&#37096;&#20998;&#23454;&#38469;&#25968;&#25454;&#26469;&#22238;&#31572;&#26597;&#35810;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#25351;&#23450;&#35201;&#20445;&#25252;&#30340;&#31169;&#20154;&#20449;&#24687;&#12290;&#27492;&#26694;&#26550;&#36824;&#21487;&#20197;&#33258;&#21160;&#36873;&#25321;&#36716;&#25442;&#35745;&#21010;&#21644;&#36229;&#21442;&#25968;&#65292;&#24182;&#20801;&#35768;&#20154;&#24037;&#19987;&#23478;&#23457;&#26680;&#21644;&#35843;&#25972;&#38544;&#31169;&#20445;&#25252;&#26426;&#21046;&#12290;</title><link>http://arxiv.org/abs/2401.12393</link><description>&lt;p&gt;
&#22522;&#20110;&#23398;&#20064;&#30340;&#22768;&#26126;&#24615;&#38544;&#31169;&#20445;&#25252;&#25968;&#25454;&#32852;&#37030;&#31649;&#29702;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Learning-based Declarative Privacy-Preserving Framework for Federated Data Management. (arXiv:2401.12393v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#23398;&#20064;&#30340;&#22768;&#26126;&#24615;&#38544;&#31169;&#20445;&#25252;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;Differentially-Private Stochastic Gradient Descent&#65288;DP-SGD&#65289;&#31639;&#27861;&#35757;&#32451;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#26367;&#20195;&#37096;&#20998;&#23454;&#38469;&#25968;&#25454;&#26469;&#22238;&#31572;&#26597;&#35810;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#25351;&#23450;&#35201;&#20445;&#25252;&#30340;&#31169;&#20154;&#20449;&#24687;&#12290;&#27492;&#26694;&#26550;&#36824;&#21487;&#20197;&#33258;&#21160;&#36873;&#25321;&#36716;&#25442;&#35745;&#21010;&#21644;&#36229;&#21442;&#25968;&#65292;&#24182;&#20801;&#35768;&#20154;&#24037;&#19987;&#23478;&#23457;&#26680;&#21644;&#35843;&#25972;&#38544;&#31169;&#20445;&#25252;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20010;&#31169;&#26377;&#25968;&#25454;&#23396;&#23707;&#19978;&#36827;&#34892;&#32852;&#37030;&#26597;&#35810;&#22788;&#29702;&#26102;&#65292;&#24179;&#34913;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23558;&#28436;&#31034;&#19968;&#31181;&#33258;&#21160;&#21270;&#26032;&#20852;&#38544;&#31169;&#20445;&#25252;&#25216;&#26415;&#30340;&#31471;&#21040;&#31471;&#24037;&#20316;&#27969;&#65292;&#35813;&#25216;&#26415;&#20351;&#29992;&#20351;&#29992;&#24046;&#20998;&#38544;&#31169;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#65288;DP-SGD&#65289;&#31639;&#27861;&#35757;&#32451;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#26367;&#25442;&#23454;&#38469;&#25968;&#25454;&#30340;&#37096;&#20998;&#26469;&#22238;&#31572;&#26597;&#35810;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26032;&#39062;&#22768;&#26126;&#24615;&#38544;&#31169;&#20445;&#25252;&#24037;&#20316;&#27969;&#20801;&#35768;&#29992;&#25143;&#25351;&#23450;&#8220;&#35201;&#20445;&#25252;&#30340;&#31169;&#20154;&#20449;&#24687;&#8221;&#32780;&#19981;&#26159;&#8220;&#22914;&#20309;&#20445;&#25252;&#8221;&#12290;&#22312;&#24213;&#23618;&#65292;&#31995;&#32479;&#33258;&#21160;&#36873;&#25321;&#26597;&#35810;-&#27169;&#22411;&#36716;&#25442;&#35745;&#21010;&#20197;&#21450;&#36229;&#21442;&#25968;&#12290;&#21516;&#26102;&#65292;&#25152;&#25552;&#20986;&#30340;&#24037;&#20316;&#27969;&#36824;&#20801;&#35768;&#20154;&#24037;&#19987;&#23478;&#23457;&#26680;&#21644;&#35843;&#25972;&#36873;&#25321;&#30340;&#38544;&#31169;&#20445;&#25252;&#26426;&#21046;&#65292;&#29992;&#20110;&#23457;&#35745;/&#21512;&#35268;&#21644;&#20248;&#21270;&#30446;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
It is challenging to balance the privacy and accuracy for federated query processing over multiple private data silos. In this work, we will demonstrate an end-to-end workflow for automating an emerging privacy-preserving technique that uses a deep learning model trained using the Differentially-Private Stochastic Gradient Descent (DP-SGD) algorithm to replace portions of actual data to answer a query. Our proposed novel declarative privacy-preserving workflow allows users to specify "what private information to protect" rather than "how to protect". Under the hood, the system automatically chooses query-model transformation plans as well as hyper-parameters. At the same time, the proposed workflow also allows human experts to review and tune the selected privacy-preserving mechanism for audit/compliance, and optimization purposes.
&lt;/p&gt;</description></item></channel></rss>