<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#24102;&#22827;&#22971;&#30340;&#21307;&#38498;/&#23621;&#27665;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20102;&#31639;&#27861;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#21487;&#35299;&#24615;&#20197;&#21450;&#23545;&#31283;&#23450;B&#21305;&#37197;&#38382;&#39064;&#30340;&#24212;&#29992;&#12290;&#31639;&#27861;&#33021;&#22815;&#25214;&#21040;&#19968;&#20010;&#25509;&#36817;&#21487;&#34892;&#30340;&#31283;&#23450;&#21305;&#37197;&#65292;&#24182;&#24212;&#29992;&#20110;&#19981;&#21516;&#31867;&#22411;&#30340;&#23454;&#20363;&#12290;</title><link>http://arxiv.org/abs/2311.00405</link><description>&lt;p&gt;
&#22827;&#22971;&#21487;&#20197;&#34987;&#35299;&#20915;&#65306;&#26032;&#30340;&#31639;&#27861;&#21644;&#23545;&#24102;&#22827;&#22971;&#30340;&#21307;&#38498;/&#23621;&#27665;&#38382;&#39064;&#30340;&#38590;&#24230;&#32467;&#26524;
&lt;/p&gt;
&lt;p&gt;
Couples can be tractable: New algorithms and hardness results for the Hospitals / Residents problem with Couples. (arXiv:2311.00405v1 [cs.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#24102;&#22827;&#22971;&#30340;&#21307;&#38498;/&#23621;&#27665;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20102;&#31639;&#27861;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#21487;&#35299;&#24615;&#20197;&#21450;&#23545;&#31283;&#23450;B&#21305;&#37197;&#38382;&#39064;&#30340;&#24212;&#29992;&#12290;&#31639;&#27861;&#33021;&#22815;&#25214;&#21040;&#19968;&#20010;&#25509;&#36817;&#21487;&#34892;&#30340;&#31283;&#23450;&#21305;&#37197;&#65292;&#24182;&#24212;&#29992;&#20110;&#19981;&#21516;&#31867;&#22411;&#30340;&#23454;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#24102;&#22827;&#22971;&#30340;&#21307;&#38498;/&#23621;&#27665;&#38382;&#39064;&#65288;Hospitals / Residents problem with Couples&#65292;&#31616;&#31216;HRC&#65289;&#65292;&#20854;&#20013;&#35299;&#30340;&#19968;&#31181;&#26159;&#31283;&#23450;&#21305;&#37197;&#65292;&#25110;&#32773;&#25253;&#21578;&#19981;&#23384;&#22312;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#65292;&#21487;&#20197;&#22312;&#24102;&#22827;&#22971;&#30340;HRC&#23454;&#20363;&#20013;&#25214;&#21040;&#19968;&#20010;&#25509;&#36817;&#21487;&#34892;&#30340;&#31283;&#23450;&#21305;&#37197;&#65288;&#36890;&#36807;&#26368;&#22810;&#35843;&#25972;&#21307;&#38498;&#30340;&#23481;&#37327;1&#20010;&#21333;&#20301;&#65289;&#65292;&#20854;&#20013;&#22827;&#22971;&#30340;&#20559;&#22909;&#26159;&#23376;&#21709;&#24212;&#24615;&#30340;&#65288;&#21363;&#65292;&#22914;&#26524;&#19968;&#20010;&#25104;&#21592;&#36716;&#31227;&#21040;&#19968;&#20010;&#26356;&#22909;&#30340;&#21307;&#38498;&#65292;&#37027;&#20040;&#22827;&#22971;&#20063;&#20250;&#21464;&#24471;&#26356;&#22909;&#65289;&#21644;&#23376;&#23436;&#22791;&#24615;&#30340;&#65288;&#21363;&#65292;&#23545;&#20110;&#27599;&#23545;&#20010;&#21035;&#21487;&#25509;&#21463;&#30340;&#21307;&#38498;&#37117;&#26159;&#22827;&#22971;&#19968;&#36215;&#21487;&#25509;&#21463;&#30340;&#65289;&#65292;&#36890;&#36807;&#23558;&#20854;&#35268;&#32422;&#21040;&#31283;&#23450;&#22266;&#23450;&#38382;&#39064;&#30340;&#23454;&#20363;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;HRC&#23376;&#21709;&#24212;&#24615;&#12289;&#23376;&#23436;&#22791;&#23454;&#20363;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#65292;&#35813;&#23454;&#20363;&#26159;&#19968;&#20010;&#21452;&#37325;&#24066;&#22330;&#65292;&#25110;&#32773;&#25152;&#26377;&#22827;&#22971;&#23646;&#20110;&#20960;&#31181;&#21487;&#33021;&#31867;&#22411;&#20043;&#19968;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#20063;&#24847;&#21619;&#30528;&#31283;&#23450;B&#21305;&#37197;&#38382;&#39064;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#21487;&#35299;&#24615;&#65292;&#20854;&#20013;&#24213;&#23618;&#22270;&#26159;&#24102;&#26377;&#29615;&#30340;&#22810;&#37325;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we study the {\sc Hospitals / Residents problem with Couples} ({\sc hrc}), where a solution is a stable matching or a report that none exists. We present a novel polynomial-time algorithm that can find a near-feasible stable matching (adjusting the hospitals' capacities by at most 1) in an {\sc hrc} instance where the couples' preferences are sub-responsive (i.e., if one member switches to a better hospital, than the couple also improves) and sub-complete (i.e., each pair of hospitals that are individually acceptable to both members are jointly acceptable for the couple) by reducing it to an instance of the {\sc Stable Fixtures} problem. We also present a polynomial-time algorithm for {\sc hrc} in a sub-responsive, sub-complete instance that is a Dual Market, or where all couples are one of several possible types. We show that our algorithm also implies the polynomial-time solvability of a stable b-matching problem, where the underlying graph is a multigraph with loops.  
&lt;/p&gt;</description></item></channel></rss>