<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;SplitFC&#30340;&#36890;&#20449;&#39640;&#25928;&#30340;&#20998;&#21106;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#20004;&#31181;&#33258;&#36866;&#24212;&#21387;&#32553;&#31574;&#30053;&#26469;&#20943;&#23569;&#20013;&#38388;&#29305;&#24449;&#21644;&#26799;&#24230;&#21521;&#37327;&#30340;&#36890;&#20449;&#24320;&#38144;&#65292;&#36825;&#20123;&#31574;&#30053;&#20998;&#21035;&#26159;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#25481;&#33853;&#21644;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#37327;&#21270;&#12290;</title><link>http://arxiv.org/abs/2307.10805</link><description>&lt;p&gt;
&#36890;&#36807;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#21387;&#32553;&#23454;&#29616;&#39640;&#25928;&#30340;&#20998;&#21106;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Communication-Efficient Split Learning via Adaptive Feature-Wise Compression. (arXiv:2307.10805v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10805
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;SplitFC&#30340;&#36890;&#20449;&#39640;&#25928;&#30340;&#20998;&#21106;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#20004;&#31181;&#33258;&#36866;&#24212;&#21387;&#32553;&#31574;&#30053;&#26469;&#20943;&#23569;&#20013;&#38388;&#29305;&#24449;&#21644;&#26799;&#24230;&#21521;&#37327;&#30340;&#36890;&#20449;&#24320;&#38144;&#65292;&#36825;&#20123;&#31574;&#30053;&#20998;&#21035;&#26159;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#25481;&#33853;&#21644;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#37327;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;SplitFC&#30340;&#26032;&#39062;&#30340;&#36890;&#20449;&#39640;&#25928;&#30340;&#20998;&#21106;&#23398;&#20064;&#65288;SL&#65289;&#26694;&#26550;&#65292;&#23427;&#20943;&#23569;&#20102;&#22312;SL&#22521;&#35757;&#36807;&#31243;&#20013;&#20256;&#36755;&#20013;&#38388;&#29305;&#24449;&#21644;&#26799;&#24230;&#21521;&#37327;&#25152;&#38656;&#30340;&#36890;&#20449;&#24320;&#38144;&#12290;SplitFC&#30340;&#20851;&#38190;&#24605;&#24819;&#26159;&#21033;&#29992;&#30697;&#38453;&#30340;&#21015;&#25152;&#23637;&#31034;&#30340;&#19981;&#21516;&#30340;&#31163;&#25955;&#31243;&#24230;&#12290;SplitFC&#25972;&#21512;&#20102;&#20004;&#31181;&#21387;&#32553;&#31574;&#30053;&#65306;&#65288;i&#65289;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#25481;&#33853;&#21644;&#65288;ii&#65289;&#33258;&#36866;&#24212;&#29305;&#24449;&#36880;&#28176;&#37327;&#21270;&#12290;&#22312;&#31532;&#19968;&#31181;&#31574;&#30053;&#20013;&#65292;&#20013;&#38388;&#29305;&#24449;&#21521;&#37327;&#26681;&#25454;&#36825;&#20123;&#21521;&#37327;&#30340;&#26631;&#20934;&#20559;&#24046;&#30830;&#23450;&#33258;&#36866;&#24212;&#25481;&#33853;&#27010;&#29575;&#36827;&#34892;&#25481;&#33853;&#12290;&#28982;&#21518;&#65292;&#30001;&#20110;&#38142;&#24335;&#35268;&#21017;&#65292;&#19982;&#34987;&#20002;&#24323;&#30340;&#29305;&#24449;&#21521;&#37327;&#30456;&#20851;&#32852;&#30340;&#20013;&#38388;&#26799;&#24230;&#21521;&#37327;&#20063;&#20250;&#34987;&#20002;&#24323;&#12290;&#22312;&#31532;&#20108;&#31181;&#31574;&#30053;&#20013;&#65292;&#38750;&#20002;&#24323;&#30340;&#20013;&#38388;&#29305;&#24449;&#21644;&#26799;&#24230;&#21521;&#37327;&#20351;&#29992;&#22522;&#20110;&#21521;&#37327;&#33539;&#22260;&#30830;&#23450;&#30340;&#33258;&#36866;&#24212;&#37327;&#21270;&#32423;&#21035;&#36827;&#34892;&#37327;&#21270;&#12290;&#20026;&#20102;&#23613;&#37327;&#20943;&#23567;&#37327;&#21270;&#35823;&#24046;&#65292;&#26368;&#20248;&#37327;&#21270;&#26159;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a novel communication-efficient split learning (SL) framework, named SplitFC, which reduces the communication overhead required for transmitting intermediate feature and gradient vectors during the SL training process. The key idea of SplitFC is to leverage different dispersion degrees exhibited in the columns of the matrices. SplitFC incorporates two compression strategies: (i) adaptive feature-wise dropout and (ii) adaptive feature-wise quantization. In the first strategy, the intermediate feature vectors are dropped with adaptive dropout probabilities determined based on the standard deviation of these vectors. Then, by the chain rule, the intermediate gradient vectors associated with the dropped feature vectors are also dropped. In the second strategy, the non-dropped intermediate feature and gradient vectors are quantized using adaptive quantization levels determined based on the ranges of the vectors. To minimize the quantization error, the optimal quantizatio
&lt;/p&gt;</description></item></channel></rss>