<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25277;&#26679;&#30340;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#22823;&#23646;&#24615;&#22270;&#20013;&#22788;&#29702;&#33410;&#28857;&#12289;&#36793;&#21644;&#36335;&#24452;&#20551;&#35774;&#65292;&#36890;&#36807;&#25552;&#20986;&#36335;&#24452;&#20551;&#35774;&#24863;&#30693;&#37319;&#26679;&#22120; PHASE &#20197;&#21450; PHASEopt&#65292;&#23454;&#29616;&#20102;&#20934;&#30830;&#19988;&#39640;&#25928;&#30340;&#25277;&#26679;&#65292;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#22312;&#20551;&#35774;&#26816;&#39564;&#19978;&#30340;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2403.13286</link><description>&lt;p&gt;
&#22522;&#20110;&#25277;&#26679;&#30340;&#22823;&#23646;&#24615;&#22270;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Sampling-based Framework for Hypothesis Testing on Large Attributed Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13286
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25277;&#26679;&#30340;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#22823;&#23646;&#24615;&#22270;&#20013;&#22788;&#29702;&#33410;&#28857;&#12289;&#36793;&#21644;&#36335;&#24452;&#20551;&#35774;&#65292;&#36890;&#36807;&#25552;&#20986;&#36335;&#24452;&#20551;&#35774;&#24863;&#30693;&#37319;&#26679;&#22120; PHASE &#20197;&#21450; PHASEopt&#65292;&#23454;&#29616;&#20102;&#20934;&#30830;&#19988;&#39640;&#25928;&#30340;&#25277;&#26679;&#65292;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#22312;&#20551;&#35774;&#26816;&#39564;&#19978;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20551;&#35774;&#26816;&#39564;&#26159;&#19968;&#31181;&#29992;&#20110;&#20174;&#26679;&#26412;&#25968;&#25454;&#20013;&#24471;&#20986;&#20851;&#20110;&#24635;&#20307;&#30340;&#32467;&#35770;&#30340;&#32479;&#35745;&#26041;&#27861;&#65292;&#36890;&#24120;&#29992;&#34920;&#26684;&#34920;&#31034;&#12290;&#38543;&#30528;&#29616;&#23454;&#24212;&#29992;&#20013;&#22270;&#34920;&#31034;&#30340;&#26222;&#21450;&#65292;&#22270;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#26412;&#25991;&#23545;&#23646;&#24615;&#22270;&#20013;&#30340;&#33410;&#28857;&#12289;&#36793;&#21644;&#36335;&#24452;&#20551;&#35774;&#36827;&#34892;&#20102;&#24418;&#24335;&#21270;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#25277;&#26679;&#30340;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#21487;&#20197;&#23481;&#32435;&#29616;&#26377;&#30340;&#20551;&#35774;&#19981;&#21487;&#30693;&#30340;&#22270;&#25277;&#26679;&#26041;&#27861;&#12290;&#20026;&#20102;&#23454;&#29616;&#20934;&#30830;&#21644;&#39640;&#25928;&#30340;&#25277;&#26679;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36335;&#24452;&#20551;&#35774;&#24863;&#30693;&#37319;&#26679;&#22120; PHASE&#65292;&#23427;&#26159;&#19968;&#31181;&#32771;&#34385;&#20551;&#35774;&#20013;&#25351;&#23450;&#36335;&#24452;&#30340; m-&#32500;&#38543;&#26426;&#28216;&#36208;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#20248;&#21270;&#20102;&#20854;&#26102;&#38388;&#25928;&#29575;&#24182;&#25552;&#20986;&#20102; PHASEopt&#12290;&#23545;&#30495;&#23454;&#25968;&#25454;&#38598;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#33021;&#22815;&#21033;&#29992;&#24120;&#35265;&#30340;&#22270;&#25277;&#26679;&#26041;&#27861;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#24182;&#19988;&#22312;&#20934;&#30830;&#24615;&#21644;&#26102;&#38388;&#25928;&#29575;&#26041;&#38754;&#20551;&#35774;&#24863;&#30693;&#25277;&#26679;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13286v1 Announce Type: cross  Abstract: Hypothesis testing is a statistical method used to draw conclusions about populations from sample data, typically represented in tables. With the prevalence of graph representations in real-life applications, hypothesis testing in graphs is gaining importance. In this work, we formalize node, edge, and path hypotheses in attributed graphs. We develop a sampling-based hypothesis testing framework, which can accommodate existing hypothesis-agnostic graph sampling methods. To achieve accurate and efficient sampling, we then propose a Path-Hypothesis-Aware SamplEr, PHASE, an m- dimensional random walk that accounts for the paths specified in a hypothesis. We further optimize its time efficiency and propose PHASEopt. Experiments on real datasets demonstrate the ability of our framework to leverage common graph sampling methods for hypothesis testing, and the superiority of hypothesis-aware sampling in terms of accuracy and time efficiency.
&lt;/p&gt;</description></item></channel></rss>