<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>TurboSVM-FL&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#32852;&#37030;&#32858;&#21512;&#31574;&#30053;&#65292;&#36890;&#36807;SVM&#32858;&#21512;&#20026;&#25042;&#24816;&#23458;&#25143;&#31471;&#22686;&#24378;&#32852;&#37030;&#23398;&#20064;&#12290;&#36825;&#31181;&#31574;&#30053;&#22312;&#19981;&#22686;&#21152;&#23458;&#25143;&#31471;&#35745;&#31639;&#36127;&#25285;&#30340;&#24773;&#20917;&#19979;&#35299;&#20915;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#25910;&#25947;&#36895;&#24230;&#24930;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.12012</link><description>&lt;p&gt;
TurboSVM-FL: &#36890;&#36807;SVM&#32858;&#21512;&#20026;&#25042;&#24816;&#23458;&#25143;&#31471;&#22686;&#24378;&#32852;&#37030;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
TurboSVM-FL: Boosting Federated Learning through SVM Aggregation for Lazy Clients. (arXiv:2401.12012v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12012
&lt;/p&gt;
&lt;p&gt;
TurboSVM-FL&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#32852;&#37030;&#32858;&#21512;&#31574;&#30053;&#65292;&#36890;&#36807;SVM&#32858;&#21512;&#20026;&#25042;&#24816;&#23458;&#25143;&#31471;&#22686;&#24378;&#32852;&#37030;&#23398;&#20064;&#12290;&#36825;&#31181;&#31574;&#30053;&#22312;&#19981;&#22686;&#21152;&#23458;&#25143;&#31471;&#35745;&#31639;&#36127;&#25285;&#30340;&#24773;&#20917;&#19979;&#35299;&#20915;&#20102;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#25910;&#25947;&#36895;&#24230;&#24930;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#26159;&#19968;&#31181;&#20998;&#24067;&#24335;&#21327;&#20316;&#26426;&#22120;&#23398;&#20064;&#33539;&#20363;&#65292;&#22312;&#36817;&#24180;&#26469;&#33719;&#24471;&#20102;&#24378;&#28872;&#30340;&#25512;&#21160;&#21147;&#12290;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#65292;&#20013;&#22830;&#26381;&#21153;&#22120;&#23450;&#26399;&#36890;&#36807;&#23458;&#25143;&#31471;&#21327;&#35843;&#27169;&#22411;&#65292;&#24182;&#32858;&#21512;&#30001;&#23458;&#25143;&#31471;&#22312;&#26412;&#22320;&#35757;&#32451;&#30340;&#27169;&#22411;&#65292;&#32780;&#26080;&#38656;&#35775;&#38382;&#26412;&#22320;&#25968;&#25454;&#12290;&#23613;&#31649;&#20855;&#26377;&#28508;&#21147;&#65292;&#20294;&#32852;&#37030;&#23398;&#20064;&#30340;&#23454;&#26045;&#20173;&#28982;&#38754;&#20020;&#19968;&#20123;&#25361;&#25112;&#65292;&#20027;&#35201;&#26159;&#30001;&#20110;&#25968;&#25454;&#24322;&#36136;&#24615;&#23548;&#33268;&#30340;&#25910;&#25947;&#36895;&#24230;&#24930;&#12290;&#25910;&#25947;&#36895;&#24230;&#24930;&#22312;&#36328;&#35774;&#22791;&#32852;&#37030;&#23398;&#20064;&#22330;&#26223;&#20013;&#23588;&#20026;&#38382;&#39064;&#65292;&#20854;&#20013;&#23458;&#25143;&#31471;&#21487;&#33021;&#21463;&#21040;&#35745;&#31639;&#33021;&#21147;&#21644;&#23384;&#20648;&#31354;&#38388;&#30340;&#20005;&#37325;&#38480;&#21046;&#65292;&#22240;&#27492;&#23545;&#23458;&#25143;&#31471;&#20135;&#29983;&#39069;&#22806;&#35745;&#31639;&#25110;&#20869;&#23384;&#36127;&#25285;&#30340;&#26041;&#27861;&#65292;&#22914;&#36741;&#21161;&#30446;&#26631;&#39033;&#21644;&#26356;&#22823;&#30340;&#35757;&#32451;&#36845;&#20195;&#27425;&#25968;&#65292;&#21487;&#33021;&#19981;&#23454;&#38469;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#32852;&#37030;&#32858;&#21512;&#31574;&#30053;TurboSVM-FL&#65292;&#23427;&#19981;&#20250;&#32473;&#23458;&#25143;&#31471;&#22686;&#21152;&#39069;&#22806;&#30340;&#35745;&#31639;&#36127;&#25285;
&lt;/p&gt;
&lt;p&gt;
Federated learning is a distributed collaborative machine learning paradigm that has gained strong momentum in recent years. In federated learning, a central server periodically coordinates models with clients and aggregates the models trained locally by clients without necessitating access to local data. Despite its potential, the implementation of federated learning continues to encounter several challenges, predominantly the slow convergence that is largely due to data heterogeneity. The slow convergence becomes particularly problematic in cross-device federated learning scenarios where clients may be strongly limited by computing power and storage space, and hence counteracting methods that induce additional computation or memory cost on the client side such as auxiliary objective terms and larger training iterations can be impractical. In this paper, we propose a novel federated aggregation strategy, TurboSVM-FL, that poses no additional computation burden on the client side and c
&lt;/p&gt;</description></item></channel></rss>