<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;OCD-FL&#30340;&#26032;&#26041;&#26696;&#65292;&#36890;&#36807;&#31995;&#32479;&#21270;&#30340;FL&#23545;&#31561;&#36873;&#25321;&#36827;&#34892;&#21327;&#20316;&#65292;&#26088;&#22312;&#22312;&#20943;&#23569;&#33021;&#32791;&#30340;&#21516;&#26102;&#23454;&#29616;&#26368;&#22823;&#30340;FL&#30693;&#35782;&#22686;&#30410;</title><link>https://arxiv.org/abs/2403.04037</link><description>&lt;p&gt;
OCD-FL: &#19968;&#31181;&#22522;&#20110;&#28857;&#23545;&#28857;&#36873;&#25321;&#30340;&#36890;&#20449;&#39640;&#25928;&#21435;&#20013;&#24515;&#21270;&#32852;&#37030;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
OCD-FL: A Novel Communication-Efficient Peer Selection-based Decentralized Federated Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04037
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;OCD-FL&#30340;&#26032;&#26041;&#26696;&#65292;&#36890;&#36807;&#31995;&#32479;&#21270;&#30340;FL&#23545;&#31561;&#36873;&#25321;&#36827;&#34892;&#21327;&#20316;&#65292;&#26088;&#22312;&#22312;&#20943;&#23569;&#33021;&#32791;&#30340;&#21516;&#26102;&#23454;&#29616;&#26368;&#22823;&#30340;FL&#30693;&#35782;&#22686;&#30410;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36793;&#32536;&#26234;&#33021;&#21644;&#19981;&#26029;&#22686;&#38271;&#30340;&#29289;&#32852;&#32593;&#32593;&#32476;&#30340;&#32467;&#21512;&#24320;&#21019;&#20102;&#21327;&#20316;&#26426;&#22120;&#23398;&#20064;&#30340;&#26032;&#26102;&#20195;&#65292;&#32852;&#37030;&#23398;&#20064;(FL)&#20316;&#20026;&#26368;&#31361;&#20986;&#30340;&#33539;&#24335;&#20986;&#29616;&#12290;&#38543;&#30528;&#20154;&#20204;&#23545;&#36825;&#20123;&#23398;&#20064;&#26041;&#26696;&#36234;&#26469;&#36234;&#24863;&#20852;&#36259;&#65292;&#30740;&#31350;&#20154;&#21592;&#24320;&#22987;&#35299;&#20915;&#23427;&#20204;&#26368;&#22522;&#26412;&#30340;&#19968;&#20123;&#38480;&#21046;&#12290;&#20107;&#23454;&#19978;&#65292;&#20855;&#26377;&#20013;&#24515;&#32858;&#21512;&#22120;&#30340;&#20256;&#32479;FL&#23384;&#22312;&#21333;&#28857;&#25925;&#38556;&#21644;&#32593;&#32476;&#29942;&#39048;&#12290;&#20026;&#20102;&#35268;&#36991;&#36825;&#20010;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#33410;&#28857;&#22312;&#28857;&#23545;&#28857;&#32593;&#32476;&#20013;&#21327;&#20316;&#30340;&#21435;&#20013;&#24515;&#21270;FL&#12290;&#23613;&#31649;&#21518;&#32773;&#25928;&#29575;&#39640;&#65292;&#20294;&#22312;&#21435;&#20013;&#24515;&#21270;FL&#20013;&#65292;&#36890;&#20449;&#25104;&#26412;&#21644;&#25968;&#25454;&#24322;&#36136;&#24615;&#20173;&#28982;&#26159;&#20851;&#38190;&#25361;&#25112;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#26426;&#20250;&#20027;&#20041;&#36890;&#20449;&#39640;&#25928;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#37030;&#23398;&#20064;(OCD-FL)&#30340;&#26032;&#26041;&#26696;&#65292;&#20854;&#20013;&#21253;&#25324;&#31995;&#32479;&#21270;&#30340;FL&#23545;&#31561;&#36873;&#25321;&#20197;&#36827;&#34892;&#21327;&#20316;&#65292;&#26088;&#22312;&#23454;&#29616;&#26368;&#22823;&#30340;FL&#30693;&#35782;&#22686;&#30410;&#21516;&#26102;&#20943;&#23569;&#33021;&#32791;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04037v1 Announce Type: new  Abstract: The conjunction of edge intelligence and the ever-growing Internet-of-Things (IoT) network heralds a new era of collaborative machine learning, with federated learning (FL) emerging as the most prominent paradigm. With the growing interest in these learning schemes, researchers started addressing some of their most fundamental limitations. Indeed, conventional FL with a central aggregator presents a single point of failure and a network bottleneck. To bypass this issue, decentralized FL where nodes collaborate in a peer-to-peer network has been proposed. Despite the latter's efficiency, communication costs and data heterogeneity remain key challenges in decentralized FL. In this context, we propose a novel scheme, called opportunistic communication-efficient decentralized federated learning, a.k.a., OCD-FL, consisting of a systematic FL peer selection for collaboration, aiming to achieve maximum FL knowledge gain while reducing energy co
&lt;/p&gt;</description></item></channel></rss>