<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20851;&#31995;&#25968;&#25454;&#24211;&#20013;&#20026;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25552;&#20379;&#26381;&#21153;&#30340;&#26550;&#26500;&#65292;&#24182;&#24378;&#35843;&#20102;&#19977;&#20010;&#20851;&#38190;&#33539;&#24335;&#65306;&#28145;&#24230;&#23398;&#20064;&#20013;&#24515;&#26550;&#26500;&#12289;UDF&#20013;&#24515;&#26550;&#26500;&#21644;&#20851;&#31995;&#20013;&#24515;&#26550;&#26500;&#12290;&#23613;&#31649;&#27599;&#20010;&#26550;&#26500;&#37117;&#22312;&#29305;&#23450;&#30340;&#20351;&#29992;&#22330;&#26223;&#20013;&#26377;&#28508;&#21147;&#65292;&#20294;&#36824;&#38656;&#35201;&#35299;&#20915;&#23427;&#20204;&#20043;&#38388;&#30340;&#38598;&#25104;&#38382;&#39064;&#21644;&#20013;&#38388;&#22320;&#24102;&#12290;</title><link>http://arxiv.org/abs/2310.04696</link><description>&lt;p&gt;
&#22312;&#20851;&#31995;&#25968;&#25454;&#24211;&#20013;&#20026;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25552;&#20379;&#26381;&#21153;
&lt;/p&gt;
&lt;p&gt;
Serving Deep Learning Model in Relational Databases. (arXiv:2310.04696v2 [cs.DB] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04696
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20851;&#31995;&#25968;&#25454;&#24211;&#20013;&#20026;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25552;&#20379;&#26381;&#21153;&#30340;&#26550;&#26500;&#65292;&#24182;&#24378;&#35843;&#20102;&#19977;&#20010;&#20851;&#38190;&#33539;&#24335;&#65306;&#28145;&#24230;&#23398;&#20064;&#20013;&#24515;&#26550;&#26500;&#12289;UDF&#20013;&#24515;&#26550;&#26500;&#21644;&#20851;&#31995;&#20013;&#24515;&#26550;&#26500;&#12290;&#23613;&#31649;&#27599;&#20010;&#26550;&#26500;&#37117;&#22312;&#29305;&#23450;&#30340;&#20351;&#29992;&#22330;&#26223;&#20013;&#26377;&#28508;&#21147;&#65292;&#20294;&#36824;&#38656;&#35201;&#35299;&#20915;&#23427;&#20204;&#20043;&#38388;&#30340;&#38598;&#25104;&#38382;&#39064;&#21644;&#20013;&#38388;&#22320;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19981;&#21516;&#21830;&#19994;&#21644;&#31185;&#23398;&#39046;&#22495;&#20013;&#65292;&#22312;&#20851;&#31995;&#25968;&#25454;&#19978;&#20026;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#25552;&#20379;&#26381;&#21153;&#24050;&#32463;&#25104;&#20026;&#19968;&#20010;&#37325;&#35201;&#38656;&#27714;&#65292;&#24182;&#24341;&#21457;&#20102;&#26368;&#36817;&#26085;&#30410;&#22686;&#38271;&#30340;&#20852;&#36259;&#12290;&#26412;&#25991;&#36890;&#36807;&#20840;&#38754;&#25506;&#32034;&#20195;&#34920;&#24615;&#26550;&#26500;&#26469;&#28385;&#36275;&#36825;&#20010;&#38656;&#27714;&#12290;&#25105;&#20204;&#24378;&#35843;&#20102;&#19977;&#20010;&#20851;&#38190;&#33539;&#24335;&#65306;&#23574;&#31471;&#30340;&#28145;&#24230;&#23398;&#20064;&#20013;&#24515;&#26550;&#26500;&#23558;&#28145;&#24230;&#23398;&#20064;&#35745;&#31639;&#36716;&#31227;&#21040;&#19987;&#29992;&#30340;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#19978;&#12290;&#28508;&#22312;&#30340;UDF&#20013;&#24515;&#26550;&#26500;&#23558;&#19968;&#20010;&#25110;&#22810;&#20010;&#24352;&#37327;&#35745;&#31639;&#23553;&#35013;&#21040;&#25968;&#25454;&#24211;&#31995;&#32479;&#20013;&#30340;&#29992;&#25143;&#23450;&#20041;&#20989;&#25968;(UDFs)&#20013;&#12290;&#28508;&#22312;&#30340;&#20851;&#31995;&#20013;&#24515;&#26550;&#26500;&#26088;&#22312;&#36890;&#36807;&#20851;&#31995;&#36816;&#31639;&#26469;&#34920;&#31034;&#22823;&#35268;&#27169;&#30340;&#24352;&#37327;&#35745;&#31639;&#12290;&#34429;&#28982;&#27599;&#20010;&#26550;&#26500;&#22312;&#29305;&#23450;&#30340;&#20351;&#29992;&#22330;&#26223;&#20013;&#37117;&#26174;&#31034;&#20986;&#20102;&#28508;&#21147;&#65292;&#20294;&#25105;&#20204;&#30830;&#23450;&#20102;&#36825;&#20123;&#26550;&#26500;&#20043;&#38388;&#30340;&#26080;&#32541;&#38598;&#25104;&#21644;&#20013;&#38388;&#22320;&#24102;&#20043;&#38388;&#30340;&#32039;&#24613;&#38656;&#27714;&#12290;&#25105;&#20204;&#28145;&#20837;&#30740;&#31350;&#20102;&#22952;&#30861;&#38598;&#25104;&#30340;&#24046;&#36317;&#65292;&#24182;&#25506;&#32034;&#20102;&#21019;&#26032;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
Serving deep learning (DL) models on relational data has become a critical requirement across diverse commercial and scientific domains, sparking growing interest recently. In this visionary paper, we embark on a comprehensive exploration of representative architectures to address the requirement. We highlight three pivotal paradigms: The state-of-the-artDL-Centricarchitecture offloadsDL computations to dedicated DL frameworks. The potential UDF-Centric architecture encapsulates one or more tensor computations into User Defined Functions (UDFs) within the database system. The potentialRelation-Centricarchitecture aims to represent a large-scale tensor computation through relational operators. While each of these architectures demonstrates promise in specific use scenarios, we identify urgent requirements for seamless integration of these architectures and the middle ground between these architectures. We delve into the gaps that impede the integration and explore innovative strategies 
&lt;/p&gt;</description></item></channel></rss>