<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#20915;&#27491;&#20132;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#20102;&#22522;&#20110;&#26368;&#22823;&#29109;&#21407;&#21017;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#20445;&#35777;&#20102;&#30697;&#38453;&#30340;&#27491;&#20132;&#24615;&#21644;&#31232;&#30095;&#24615;&#20197;&#21450;&#38750;&#36127;&#24615;&#12290;&#35813;&#26041;&#27861;&#22312;&#19981;&#24433;&#21709;&#36817;&#20284;&#36136;&#37327;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#33021;&#36895;&#24230;&#21644;&#20248;&#20110;&#25991;&#29486;&#20013;&#31867;&#20284;&#26041;&#27861;&#30340;&#31232;&#30095;&#24615;&#12289;&#27491;&#20132;&#24615;&#12290;</title><link>http://arxiv.org/abs/2210.02672</link><description>&lt;p&gt;
&#27491;&#20132;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;:&#26368;&#22823;&#29109;&#21407;&#21017;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Orthogonal Non-negative Matrix Factorization: a Maximum-Entropy-Principle Approach. (arXiv:2210.02672v2 [cs.DS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.02672
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#20915;&#27491;&#20132;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;&#20102;&#22522;&#20110;&#26368;&#22823;&#29109;&#21407;&#21017;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#20445;&#35777;&#20102;&#30697;&#38453;&#30340;&#27491;&#20132;&#24615;&#21644;&#31232;&#30095;&#24615;&#20197;&#21450;&#38750;&#36127;&#24615;&#12290;&#35813;&#26041;&#27861;&#22312;&#19981;&#24433;&#21709;&#36817;&#20284;&#36136;&#37327;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#33021;&#36895;&#24230;&#21644;&#20248;&#20110;&#25991;&#29486;&#20013;&#31867;&#20284;&#26041;&#27861;&#30340;&#31232;&#30095;&#24615;&#12289;&#27491;&#20132;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#27491;&#20132;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#65288;ONMF&#65289;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#38382;&#39064;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;&#20004;&#20010;&#38750;&#36127;&#30697;&#38453;&#65288;&#29305;&#24449;&#30697;&#38453;&#21644;&#28151;&#21512;&#30697;&#38453;&#65289;&#30340;&#20056;&#31215;&#26469;&#36817;&#20284;&#36755;&#20837;&#25968;&#25454;&#30697;&#38453;&#65292;&#20854;&#20013;&#19968;&#20010;&#30697;&#38453;&#26159;&#27491;&#20132;&#30340;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;ONMF&#35299;&#37322;&#20026;&#29305;&#23450;&#30340;&#35774;&#26045;&#23450;&#20301;&#38382;&#39064;&#65292;&#24182;&#38024;&#23545;ONMF&#38382;&#39064;&#37319;&#29992;&#22522;&#20110;&#26368;&#22823;&#29109;&#21407;&#21017;&#30340;FLP&#35299;&#20915;&#26041;&#26696;&#36827;&#34892;&#20102;&#35843;&#25972;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20445;&#35777;&#20102;&#29305;&#24449;&#30697;&#38453;&#25110;&#28151;&#21512;&#30697;&#38453;&#30340;&#27491;&#20132;&#24615;&#21644;&#31232;&#30095;&#24615;&#65292;&#21516;&#26102;&#30830;&#20445;&#20102;&#20004;&#32773;&#30340;&#38750;&#36127;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#23450;&#37327;&#30340;&#8220;&#30495;&#23454;&#8221;&#28508;&#22312;&#29305;&#24449;&#25968;&#37327;&#30340;&#29305;&#24449;-&#36229;&#21442;&#25968;&#29992;&#20110;ONMF&#12290;&#38024;&#23545;&#21512;&#25104;&#25968;&#25454;&#38598;&#20197;&#21450;&#26631;&#20934;&#30340;&#22522;&#22240;&#33455;&#29255;&#25968;&#32452;&#25968;&#25454;&#38598;&#36827;&#34892;&#30340;&#35780;&#20272;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#22312;&#19981;&#24433;&#21709;&#36817;&#20284;&#36136;&#37327;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377;&#36739;&#22909;&#30340;&#31232;&#30095;&#24615;&#12289;&#27491;&#20132;&#24615;&#21644;&#24615;&#33021;&#36895;&#24230;&#65292;&#30456;&#23545;&#20110;&#25991;&#29486;&#20013;&#31867;&#20284;&#26041;&#27861;&#26377;&#26174;&#33879;&#30340;&#25913;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we introduce a new methodology to solve the orthogonal nonnegative matrix factorization (ONMF) problem, where the objective is to approximate an input data matrix by a product of two nonnegative matrices, the features matrix and the mixing matrix, where one of them is orthogonal. We show how the ONMF can be interpreted as a specific facility-location problem (FLP), and adapt a maximum-entropy-principle based solution for FLP to the ONMF problem. The proposed approach guarantees orthogonality and sparsity of the features or the mixing matrix, while ensuring nonnegativity of both. Additionally, our methodology develops a quantitative characterization of ``true" number of underlying features - a hyperparameter required for the ONMF. An evaluation of the proposed method conducted on synthetic datasets, as well as a standard genetic microarray dataset indicates significantly better sparsity, orthogonality, and performance speed compared to similar methods in the literature, w
&lt;/p&gt;</description></item></channel></rss>