<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#20449;&#39640;&#25928;&#30340;&#20998;&#25955;&#24335;&#20132;&#26367;&#26799;&#24230;&#27861;&#35299;&#20915;&#21452;&#23618;&#35268;&#21010;&#38382;&#39064;&#65292;&#30456;&#36739;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#35813;&#31639;&#27861;&#20855;&#26377;&#26356;&#20302;&#30340;&#36890;&#20449;&#25104;&#26412;&#21644;&#26356;&#39640;&#30340;&#38544;&#31169;&#24615;&#12290;</title><link>http://arxiv.org/abs/2211.04088</link><description>&lt;p&gt;
&#19968;&#31181;&#36890;&#20449;&#39640;&#25928;&#30340;&#20998;&#25955;&#24335;&#20132;&#26367;&#26799;&#24230;&#27861;&#29992;&#20110;&#21452;&#23618;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
A Decentralized Alternating Gradient Method for Communication-Efficient Bilevel Programming. (arXiv:2211.04088v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.04088
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#20449;&#39640;&#25928;&#30340;&#20998;&#25955;&#24335;&#20132;&#26367;&#26799;&#24230;&#27861;&#35299;&#20915;&#21452;&#23618;&#35268;&#21010;&#38382;&#39064;&#65292;&#30456;&#36739;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#35813;&#31639;&#27861;&#20855;&#26377;&#26356;&#20302;&#30340;&#36890;&#20449;&#25104;&#26412;&#21644;&#26356;&#39640;&#30340;&#38544;&#31169;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21452;&#23618;&#35268;&#21010;&#36817;&#26399;&#24341;&#36215;&#20102;&#23398;&#26415;&#30028;&#30340;&#24191;&#27867;&#20851;&#27880;&#65292;&#22240;&#20026;&#23427;&#26377;&#35768;&#22810;&#24212;&#29992;&#65292;&#21253;&#25324;&#24378;&#21270;&#23398;&#20064;&#21644;&#36229;&#21442;&#25968;&#20248;&#21270;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#35299;&#20915;&#26041;&#26696;&#36890;&#24120;&#37319;&#29992;&#21333;&#26426;&#25110;&#32852;&#37030;&#23398;&#20064;&#30340;&#26041;&#24335;&#65292;&#24182;&#23384;&#22312;&#36890;&#20449;&#25104;&#26412;&#39640;&#21644;&#38544;&#31169;&#27844;&#38706;&#39118;&#38505;&#31561;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24809;&#32602;&#20989;&#25968;&#30340;&#20998;&#25955;&#24335;&#31639;&#27861;&#26469;&#35299;&#20915;&#36825;&#31867;&#20248;&#21270;&#38382;&#39064;&#65292;&#25913;&#36827;&#20102;&#29616;&#26377;&#30340;&#26041;&#27861;&#24182;&#19988;&#22312;&#29702;&#35770;&#19978;&#24471;&#21040;&#20102;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bilevel programming has recently received attention in the literature, due to a wide range of applications, including reinforcement learning and hyper-parameter optimization. However, it is widely assumed that the underlying bilevel optimization problem is solved either by a single machine or in the case of multiple machines connected in a star-shaped network, i.e., federated learning setting. The latter approach suffers from a high communication cost on the central node (e.g., parameter server) and exhibits privacy vulnerabilities. Hence, it is of interest to develop methods that solve bilevel optimization problems in a communication-efficient decentralized manner. To that end, this paper introduces a penalty function based decentralized algorithm with theoretical guarantees for this class of optimization problems. Specifically, a distributed alternating gradient-type algorithm for solving consensus bilevel programming over a decentralized network is developed. A key feature of the pr
&lt;/p&gt;</description></item></channel></rss>