<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#32852;&#37030;&#23398;&#20064;&#27169;&#22411;&#27602;&#21270;&#25915;&#20987;&#31574;&#30053;&#65292;&#26082;&#21487;&#20197;&#23454;&#29616;&#25298;&#32477;&#26381;&#21153;(Dos)&#30446;&#26631;&#65292;&#20063;&#21487;&#20197;&#31934;&#30830;&#25511;&#21046;&#20840;&#23616;&#20934;&#30830;&#24615;&#65292;&#20855;&#26377;&#39640;&#25928;&#21644;&#38544;&#24418;&#30340;&#29305;&#28857;&#12290;</title><link>http://arxiv.org/abs/2304.10783</link><description>&lt;p&gt;
&#25298;&#32477;&#26381;&#21153;&#25110;&#32454;&#31890;&#24230;&#25511;&#21046;&#65306;&#38754;&#21521;&#32852;&#37030;&#23398;&#20064;&#30340;&#28789;&#27963;&#27169;&#22411;&#27602;&#21270;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Denial-of-Service or Fine-Grained Control: Towards Flexible Model Poisoning Attacks on Federated Learning. (arXiv:2304.10783v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10783
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#32852;&#37030;&#23398;&#20064;&#27169;&#22411;&#27602;&#21270;&#25915;&#20987;&#31574;&#30053;&#65292;&#26082;&#21487;&#20197;&#23454;&#29616;&#25298;&#32477;&#26381;&#21153;(Dos)&#30446;&#26631;&#65292;&#20063;&#21487;&#20197;&#31934;&#30830;&#25511;&#21046;&#20840;&#23616;&#20934;&#30830;&#24615;&#65292;&#20855;&#26377;&#39640;&#25928;&#21644;&#38544;&#24418;&#30340;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#23481;&#26131;&#21463;&#21040;&#27602;&#21270;&#25915;&#20987;&#65292;&#25932;&#23545;&#26041;&#20250;&#30772;&#22351;&#20840;&#23616;&#32858;&#21512;&#32467;&#26524;&#24182;&#36896;&#25104;&#25298;&#32477;&#26381;&#21153;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#27169;&#22411;&#27602;&#21270;&#25915;&#20987;(FMPA)&#65292;&#26088;&#22312;&#23454;&#29616;&#22810;&#21151;&#33021;&#25915;&#20987;&#30446;&#26631;&#12290;&#26412;&#25991;&#32771;&#34385;&#22914;&#19979;&#23454;&#38469;&#24773;&#26223;&#65306;&#25932;&#23545;&#26041;&#27809;&#26377;&#20851;&#20110;FL&#31995;&#32479;&#30340;&#39069;&#22806;&#20449;&#24687;&#65288;&#20363;&#22914;&#65292;&#32858;&#21512;&#35268;&#21017;&#25110;&#33391;&#24615;&#35774;&#22791;&#19978;&#30340;&#26356;&#26032;&#65289;&#12290;FMPA&#21033;&#29992;&#20840;&#23616;&#21382;&#21490;&#20449;&#24687;&#26500;&#24314;&#20272;&#35745;&#22120;&#65292;&#23558;&#19979;&#19968;&#36718;&#20840;&#23616;&#27169;&#22411;&#39044;&#27979;&#20026;&#33391;&#24615;&#21442;&#32771;&#27169;&#22411;&#65292;&#24182;&#24494;&#35843;&#21442;&#32771;&#27169;&#22411;&#20197;&#33719;&#24471;&#25152;&#38656;&#30340;&#31934;&#24230;&#20302;&#21644;&#25200;&#21160;&#23567;&#30340;&#27602;&#21270;&#27169;&#22411;&#12290;FMPA&#19981;&#20165;&#21487;&#20197;&#36798;&#21040;DoS&#30340;&#30446;&#26631;&#65292;&#36824;&#21487;&#20197;&#33258;&#28982;&#22320;&#25193;&#23637;&#21040;&#21551;&#21160;&#32454;&#31890;&#24230;&#21487;&#25511;&#25915;&#20987;&#65292;&#20174;&#32780;&#31934;&#30830;&#38477;&#20302;&#20840;&#23616;&#20934;&#30830;&#24615;&#12290;&#26412;&#25991;&#36827;&#19968;&#27493;&#25506;&#32034;&#20102;FMPA&#22312;&#20960;&#31181;FL&#22330;&#26223;&#19979;&#30340;&#25915;&#20987;&#24615;&#33021;&#65292;&#21253;&#25324;&#20108;&#20803;&#20998;&#31867;&#21644;&#22270;&#20687;&#20998;&#31867;&#65292;&#22312;&#19981;&#21516;&#30340;&#25915;&#20987;&#30446;&#26631;&#21644;&#25915;&#20987;&#30693;&#35782;&#27700;&#24179;&#19979;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;FMPA&#21487;&#20197;&#26377;&#25928;&#32780;&#39640;&#25928;&#22320;&#23454;&#29616;&#25152;&#38656;&#30340;&#25915;&#20987;&#30446;&#26631;&#65292;&#21516;&#26102;&#20445;&#25345;&#38544;&#24418;&#21644;&#19981;&#21487;&#24863;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated learning (FL) is vulnerable to poisoning attacks, where adversaries corrupt the global aggregation results and cause denial-of-service (DoS). Unlike recent model poisoning attacks that optimize the amplitude of malicious perturbations along certain prescribed directions to cause DoS, we propose a Flexible Model Poisoning Attack (FMPA) that can achieve versatile attack goals. We consider a practical threat scenario where no extra knowledge about the FL system (e.g., aggregation rules or updates on benign devices) is available to adversaries. FMPA exploits the global historical information to construct an estimator that predicts the next round of the global model as a benign reference. It then fine-tunes the reference model to obtain the desired poisoned model with low accuracy and small perturbations. Besides the goal of causing DoS, FMPA can be naturally extended to launch a fine-grained controllable attack, making it possible to precisely reduce the global accuracy. Armed wi
&lt;/p&gt;</description></item></channel></rss>