<rss version="2.0"><channel><title>Chat Arxiv cs.DM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DM</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#27169;&#22411;&#29702;&#35770;&#20013;&#26377;&#20851;&#29702;&#35770;&#31283;&#23450;&#24615;&#21644;&#23398;&#20064;&#20013;&#31639;&#27861;&#31283;&#23450;&#24615;&#30340;&#20132;&#20114;&#65292;&#36890;&#36807;&#31639;&#27861;&#24615;&#36136;&#21462;&#20195;&#20102;&#26080;&#38480;&#65292;&#37325;&#35775;&#20102;Shelah&#38395;&#21517;&#30340;&#19981;&#31283;&#23450;&#20844;&#24335;&#23450;&#29702;&#65292;&#24182;&#24341;&#20837;&#20102;&#21487;&#33021;&#26368;&#32456;&#27491;&#30830;&#23398;&#20064;&#27169;&#22411;&#65292;&#34920;&#24449;&#20102;Littlestone&#65288;&#31283;&#23450;&#65289;&#31867;&#65292;&#36879;&#36807;&#27169;&#22411;&#35770;&#20013;&#31867;&#22411;&#30340;&#21487;&#23450;&#20041;&#24615;&#24418;&#24335;&#21270;&#20102;Littlestone&#31867;&#30340;&#36924;&#36817;&#12290;</title><link>http://arxiv.org/abs/2212.05050</link><description>&lt;p&gt;
&#36890;&#36807;&#31639;&#27861;&#37325;&#35775;&#19981;&#31283;&#23450;&#20844;&#24335;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
The unstable formula theorem revisited via algorithms. (arXiv:2212.05050v2 [math.LO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.05050
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#27169;&#22411;&#29702;&#35770;&#20013;&#26377;&#20851;&#29702;&#35770;&#31283;&#23450;&#24615;&#21644;&#23398;&#20064;&#20013;&#31639;&#27861;&#31283;&#23450;&#24615;&#30340;&#20132;&#20114;&#65292;&#36890;&#36807;&#31639;&#27861;&#24615;&#36136;&#21462;&#20195;&#20102;&#26080;&#38480;&#65292;&#37325;&#35775;&#20102;Shelah&#38395;&#21517;&#30340;&#19981;&#31283;&#23450;&#20844;&#24335;&#23450;&#29702;&#65292;&#24182;&#24341;&#20837;&#20102;&#21487;&#33021;&#26368;&#32456;&#27491;&#30830;&#23398;&#20064;&#27169;&#22411;&#65292;&#34920;&#24449;&#20102;Littlestone&#65288;&#31283;&#23450;&#65289;&#31867;&#65292;&#36879;&#36807;&#27169;&#22411;&#35770;&#20013;&#31867;&#22411;&#30340;&#21487;&#23450;&#20041;&#24615;&#24418;&#24335;&#21270;&#20102;Littlestone&#31867;&#30340;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#26377;&#20851;&#27169;&#22411;&#29702;&#35770;&#20013;&#20851;&#20110;&#29702;&#35770;&#31283;&#23450;&#24615;&#30340;&#22522;&#30784;&#32467;&#26524;&#19982;&#23398;&#20064;&#20013;&#31639;&#27861;&#31283;&#23450;&#24615;&#20043;&#38388;&#24778;&#20154;&#30340;&#20132;&#20114;&#65292;&#29305;&#21035;&#26159;&#36890;&#36807;&#31639;&#27861;&#24615;&#36136;&#21462;&#20195;&#26080;&#38480;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;Shelah&#38395;&#21517;&#30340;&#19981;&#31283;&#23450;&#20844;&#24335;&#23450;&#29702;&#30340;&#23436;&#25972;&#31639;&#27861;&#31867;&#27604;&#12290;&#36825;&#20854;&#20013;&#28041;&#21450;&#20102;&#20960;&#20010;&#26032;&#23450;&#29702;&#20197;&#21450;&#26368;&#36817;&#30340;&#30740;&#31350;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#30340;&#8220;&#21487;&#33021;&#26368;&#32456;&#27491;&#30830;&#8221;&#30340;&#23398;&#20064;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#36825;&#20010;&#27169;&#22411;&#34920;&#24449;&#20102;Littlestone&#65288;&#31283;&#23450;&#65289;&#31867;&#65307;&#24182;&#36890;&#36807;&#27169;&#22411;&#35770;&#20013;&#31867;&#22411;&#30340;&#21487;&#23450;&#20041;&#24615;&#31867;&#27604;&#25551;&#36848;&#20102;Littlestone&#31867;&#30340;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is about the surprising interaction of a foundational result from model theory about stability of theories, which seems to be inherently about the infinite, with algorithmic stability in learning. Specifically, we develop a complete algorithmic analogue of Shelah's celebrated Unstable Formula Theorem, with algorithmic properties taking the place of the infinite. This draws on several new theorems as well as much recent work. In particular we introduce a new ``Probably Eventually Correct'' learning model, of independent interest, and characterize Littlestone (stable) classes in terms of this model; and we describe Littlestone classes via approximations, by analogy to definability of types in model theory.
&lt;/p&gt;</description></item></channel></rss>