<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#31038;&#20250;&#36873;&#25321;&#20013;&#30340;&#24230;&#37327;&#25197;&#26354;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25237;&#31080;&#35268;&#21017;&#65292;&#35813;&#35268;&#21017;&#21487;&#20197;&#36873;&#25321;&#36317;&#31163;&#36873;&#27665;&#24179;&#22343;&#36317;&#31163;&#36739;&#23567;&#30340;&#20505;&#36873;&#20154;&#12290;&#20043;&#21069;&#30340;&#30740;&#31350;&#21457;&#29616;&#30830;&#23450;&#24615;&#25237;&#31080;&#35268;&#21017;&#30340;&#24230;&#37327;&#25197;&#26354;&#38480;&#21046;&#20026;3&#65292;&#20294;&#22312;&#26080;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#23545;&#35813;&#38382;&#39064;&#20173;&#28982;&#20102;&#35299;&#26377;&#38480;&#12290;</title><link>http://arxiv.org/abs/2306.17838</link><description>&lt;p&gt;
&#25171;&#30772;&#24230;&#37327;&#25237;&#31080;&#25197;&#26354;&#30340;&#38556;&#30861;
&lt;/p&gt;
&lt;p&gt;
Breaking the Metric Voting Distortion Barrier. (arXiv:2306.17838v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17838
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#31038;&#20250;&#36873;&#25321;&#20013;&#30340;&#24230;&#37327;&#25197;&#26354;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#25237;&#31080;&#35268;&#21017;&#65292;&#35813;&#35268;&#21017;&#21487;&#20197;&#36873;&#25321;&#36317;&#31163;&#36873;&#27665;&#24179;&#22343;&#36317;&#31163;&#36739;&#23567;&#30340;&#20505;&#36873;&#20154;&#12290;&#20043;&#21069;&#30340;&#30740;&#31350;&#21457;&#29616;&#30830;&#23450;&#24615;&#25237;&#31080;&#35268;&#21017;&#30340;&#24230;&#37327;&#25197;&#26354;&#38480;&#21046;&#20026;3&#65292;&#20294;&#22312;&#26080;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#23545;&#35813;&#38382;&#39064;&#20173;&#28982;&#20102;&#35299;&#26377;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#31038;&#20250;&#36873;&#25321;&#20013;&#24230;&#37327;&#25197;&#26354;&#30340;&#32463;&#20856;&#38382;&#39064;&#12290;&#20551;&#35774;&#25105;&#20204;&#26377;&#19968;&#20010;&#36873;&#20030;&#65292;&#26377;n&#21517;&#36873;&#27665;&#21644;m&#21517;&#20505;&#36873;&#20154;&#65292;&#20182;&#20204;&#20301;&#20110;&#19968;&#20010;&#20849;&#20139;&#30340;&#24230;&#37327;&#31354;&#38388;&#20013;&#12290;&#25105;&#20204;&#24076;&#26395;&#35774;&#35745;&#19968;&#20010;&#25237;&#31080;&#35268;&#21017;&#65292;&#36873;&#25321;&#19968;&#20010;&#24179;&#22343;&#36317;&#31163;&#36873;&#27665;&#36739;&#23567;&#30340;&#20505;&#36873;&#20154;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#19981;&#33021;&#30452;&#25509;&#33719;&#24471;&#24230;&#37327;&#31354;&#38388;&#20013;&#30340;&#36317;&#31163;&#20449;&#24687;&#65292;&#27599;&#20010;&#36873;&#27665;&#21482;&#33021;&#32473;&#20986;&#20505;&#36873;&#20154;&#30340;&#25490;&#24207;&#21015;&#34920;&#12290;&#25105;&#20204;&#33021;&#21542;&#35774;&#35745;&#19968;&#26465;&#35268;&#21017;&#65292;&#26080;&#35770;&#36873;&#20030;&#23454;&#20363;&#21644;&#24213;&#23618;&#24230;&#37327;&#31354;&#38388;&#22914;&#20309;&#65292;&#37117;&#33021;&#36873;&#25321;&#20986;&#19968;&#20010;&#19982;&#30495;&#27491;&#26368;&#20248;&#35299;&#30340;&#20195;&#20215;&#21482;&#30456;&#24046;&#19968;&#20010;&#23567;&#22240;&#23376;&#65288;&#31216;&#20026;&#25197;&#26354;&#24230;&#65289;&#30340;&#20505;&#36873;&#20154;&#65311;&#35768;&#22810;&#30740;&#31350;&#30340;&#25104;&#26524;&#23558;&#30830;&#23450;&#24615;&#25237;&#31080;&#35268;&#21017;&#30340;&#24230;&#37327;&#25197;&#26354;&#38480;&#21046;&#20026;3&#65292;&#36825;&#26159;&#30830;&#23450;&#24615;&#35268;&#21017;&#21644;&#35768;&#22810;&#20854;&#20182;&#25237;&#31080;&#35268;&#21017;&#31867;&#21035;&#30340;&#26368;&#20339;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#22312;&#27809;&#26377;&#20219;&#20309;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#23545;&#35813;&#38382;&#39064;&#20173;&#28982;&#20102;&#35299;&#26377;&#38480;&#65306;&#23613;&#31649;&#26368;&#20339;&#19979;&#30028;&#24050;&#32463;&#38477;&#20302;&#21040;2.112&#65292;&#20294;&#29616;&#26377;&#35268;&#21017;&#30340;&#25197;&#26354;&#24230;&#20173;&#28982;&#30456;&#23545;&#36739;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the following well studied problem of metric distortion in social choice. Suppose we have an election with $n$ voters and $m$ candidates who lie in a shared metric space. We would like to design a voting rule that chooses a candidate whose average distance to the voters is small. However, instead of having direct access to the distances in the metric space, each voter gives us a ranked list of the candidates in order of distance. Can we design a rule that regardless of the election instance and underlying metric space, chooses a candidate whose cost differs from the true optimum by only a small factor (known as the distortion)?  A long line of work culminated in finding deterministic voting rules with metric distortion $3$, which is the best possible for deterministic rules and many other classes of voting rules. However, without any restrictions, there is still a significant gap in our understanding: Even though the best lower bound is substantially lower at $2.112$, the b
&lt;/p&gt;</description></item></channel></rss>