<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#36716;&#22411;&#21327;&#35758;&#22914;&#8220;&#21457;&#24067;&#21644;&#38405;&#35835;&#8221;&#26041;&#26696;&#23558;&#20026;&#26399;&#21002;&#20986;&#29256;&#21830;&#24102;&#26469;&#22909;&#22788;&#65292;&#26080;&#35770;&#20854;&#26399;&#21002;&#20013;&#30340;&#21457;&#34920;&#25968;&#37327;&#22686;&#38271;&#36824;&#26159;&#19979;&#38477;&#65292;&#21487;&#33021;&#20250;&#25552;&#39640;&#26032;&#21442;&#19982;&#32773;&#30340;&#20934;&#20837;&#22721;&#22430;&#12290;</title><link>https://arxiv.org/abs/2403.03597</link><description>&lt;p&gt;
&#23398;&#26415;&#20986;&#29256;&#20013;&#30340;&#8220;&#24517;&#22791;&#23384;&#36135;&#8221;&#25361;&#25112;&#65306;&#36716;&#22411;&#21327;&#35758;&#30340;&#23450;&#20215;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The 'Must Stock' Challenge in Academic Publishing: Pricing Implications of Transformative Agreements
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03597
&lt;/p&gt;
&lt;p&gt;
&#36716;&#22411;&#21327;&#35758;&#22914;&#8220;&#21457;&#24067;&#21644;&#38405;&#35835;&#8221;&#26041;&#26696;&#23558;&#20026;&#26399;&#21002;&#20986;&#29256;&#21830;&#24102;&#26469;&#22909;&#22788;&#65292;&#26080;&#35770;&#20854;&#26399;&#21002;&#20013;&#30340;&#21457;&#34920;&#25968;&#37327;&#22686;&#38271;&#36824;&#26159;&#19979;&#38477;&#65292;&#21487;&#33021;&#20250;&#25552;&#39640;&#26032;&#21442;&#19982;&#32773;&#30340;&#20934;&#20837;&#22721;&#22430;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39030;&#23574;&#23398;&#26415;&#26399;&#21002;&#30340;&#39640;&#24230;&#30456;&#20851;&#24615;&#20351;&#23427;&#20204;&#25104;&#20026;&#8220;&#24517;&#22791;&#23384;&#36135;&#8221;&#20135;&#21697;&#65292;&#36171;&#20104;&#20854;&#36890;&#24120;&#26159;&#21830;&#19994;&#25152;&#26377;&#32773;&#30340;&#38750;&#20961;&#24066;&#22330;&#21147;&#37327;&#12290; &#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#20840;&#29699;&#21508;&#22320;&#30340;&#22823;&#23398;&#32852;&#30431;&#19982;&#35768;&#22810;&#20986;&#29256;&#31038;&#35848;&#21028;&#25152;&#35859;&#30340;&#8220;&#36716;&#22411;&#21327;&#35758;&#8221;&#12290; &#36825;&#23558;&#20026;&#26631;&#20934;&#24320;&#25918;&#33719;&#21462;&#20986;&#29256;&#25171;&#24320;&#36947;&#36335;&#12290; &#23613;&#31649;&#23384;&#22312;&#20960;&#31181;&#21512;&#21516;&#35774;&#35745;&#65292;&#20294;&#8220;&#21457;&#24067;&#21644;&#38405;&#35835;&#8221;&#65288;PAR&#65289;&#26041;&#26696;&#26159;&#26368;&#25509;&#36817;&#23436;&#20840;&#24320;&#25918;&#33719;&#21462;&#29615;&#22659;&#29702;&#24819;&#30340;&#26041;&#26696;&#65306;&#20986;&#29256;&#21830;&#20250;&#20026;&#27599;&#31687;&#21457;&#34920;&#25903;&#20184;&#22266;&#23450;&#30340;&#25353;&#26696;&#20363;&#25910;&#36153;&#65292;&#20854;&#20013;&#21253;&#25324;&#23545;&#20854;&#20016;&#23500;&#30340;&#22270;&#20070;&#39302;&#25910;&#36153;&#12290; &#21453;&#36807;&#26469;&#65292;&#25152;&#26377;&#35746;&#38405;&#36153;&#29992;&#37117;&#23558;&#34987;&#20813;&#38500;&#12290; &#25105;&#20174;&#29702;&#35770;&#19978;&#25512;&#23548;&#20986;&#65292;&#26080;&#35770;&#36825;&#20123;&#20986;&#29256;&#21830;&#30340;&#26399;&#21002;&#20013;&#30340;&#21457;&#34920;&#25968;&#37327;&#22686;&#38271;&#36824;&#26159;&#19979;&#38477;&#65292;&#36825;&#31181;&#21512;&#21516;&#35774;&#35745;&#37117;&#26377;&#21033;&#20110;&#21253;&#25324;&#30340;&#20986;&#29256;&#21830;&#12290; &#22240;&#27492;&#65292;&#24191;&#27867;&#20351;&#29992;PAR&#21512;&#21516;&#24456;&#21487;&#33021;&#20250;&#25552;&#39640;&#26032;&#21442;&#19982;&#32773;&#30340;&#20934;&#20837;&#22721;&#22418;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03597v1 Announce Type: new  Abstract: The high relevance of top-notch academic journals turns them into 'must stock' products that assign its often commercial owners with extraordinary market power. Intended to tackle this, university consortia around the globe negotiate so-called 'transformative agreements' with many publishing houses. It shall pave the way towards standard open-access publishing. While several contract designs exist, the 'publish-and-read' (PAR) scheme is the one that comes closest to the ideal of an entirely open access environment: Publishers are paid a fixed case-by-case rate for each publication, which includes a fee for their extensive libraries. In turn, all subscription payments are waived. I theoretically derive that this contract design benefits the included publishers regardless of whether the number of publications in these publishers' journals grows or declines. Consequently, widespread PAR contracts are likely to raise entry barriers for new (
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.05024</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#26159;&#21542;&#26377;&#21161;&#20110;&#26356;&#22823;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05024
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#25968;&#25454;&#38598;&#22312;&#24403;&#20195;&#25968;&#25454;&#39537;&#21160;&#30740;&#31350;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#23427;&#20204;&#36890;&#36807;&#20419;&#36827;&#26032;&#27169;&#24335;&#21644;&#29616;&#35937;&#30340;&#21457;&#29616;&#65292;&#25512;&#21160;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;&#36825;&#31181;&#23545;&#23454;&#35777;&#30740;&#31350;&#30340;&#19981;&#26029;&#38656;&#27714;&#24341;&#21457;&#20102;&#20851;&#20110;&#22914;&#20309;&#22312;&#30740;&#31350;&#39033;&#30446;&#20013;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#25968;&#25454;&#20197;&#20419;&#36827;&#31185;&#23398;&#36827;&#27493;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#37325;&#32452;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#21019;&#26032;&#24615;&#22320;&#32452;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#21253;&#25324;&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#65292;&#21487;&#20197;&#23548;&#33268;&#39640;&#24433;&#21709;&#30340;&#21457;&#29616;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36229;&#36807;30,000&#31687;&#25991;&#31456;&#20013;&#20351;&#29992;&#20102;&#36229;&#36807;6,000&#20010;&#25968;&#25454;&#38598;&#30340;&#31038;&#20250;&#31185;&#23398;&#25968;&#25454;&#24211;ICPSR&#20013;&#36825;&#31181;&#38750;&#20856;&#22411;&#25968;&#25454;&#32452;&#21512;&#30340;&#31185;&#23398;&#25104;&#26524;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22235;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#32452;&#21512;&#25968;&#25454;&#38598;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#19981;&#24120;&#35265;&#30340;&#32452;&#21512;&#65292;&#23545;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#21521;&#19968;&#33324;&#20844;&#20247;&#20256;&#25773;&#65289;&#37117;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera
&lt;/p&gt;</description></item></channel></rss>