<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;LLM&#26159;&#21542;&#33021;&#22815;&#30830;&#23450;&#20004;&#20010;SQL&#26597;&#35810;&#30340;&#31561;&#20215;&#20851;&#31995;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#25552;&#31034;&#25216;&#26415;&#26469;&#24110;&#21161;LLM&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#21709;&#24212;&#12290;</title><link>http://arxiv.org/abs/2312.10321</link><description>&lt;p&gt;
LLM-SQL-Solver: LLM&#33021;&#22815;&#30830;&#23450;SQL&#31561;&#20215;&#20851;&#31995;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
LLM-SQL-Solver: Can LLMs Determine SQL Equivalence?. (arXiv:2312.10321v2 [cs.DB] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.10321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;LLM&#26159;&#21542;&#33021;&#22815;&#30830;&#23450;&#20004;&#20010;SQL&#26597;&#35810;&#30340;&#31561;&#20215;&#20851;&#31995;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#25552;&#31034;&#25216;&#26415;&#26469;&#24110;&#21161;LLM&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21028;&#26029;&#20004;&#20010;SQL&#26597;&#35810;&#20043;&#38388;&#30340;&#31561;&#20215;&#20851;&#31995;&#26159;&#25968;&#25454;&#31649;&#29702;&#21644;SQL&#29983;&#25104;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#65292;&#20855;&#26377;&#35768;&#22810;&#23454;&#38469;&#24212;&#29992;&#65288;&#21363;&#65292;&#22312;&#25991;&#26412;&#21040;SQL&#20219;&#21153;&#20013;&#35780;&#20272;&#29983;&#25104;&#30340;SQL&#26597;&#35810;&#30340;&#36136;&#37327;&#65289;&#12290;&#34429;&#28982;&#30740;&#31350;&#30028;&#22810;&#24180;&#26469;&#19968;&#30452;&#22312;&#32771;&#34385;SQL&#30340;&#31561;&#20215;&#24615;&#65292;&#20294;&#23427;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#22256;&#38590;&#65292;&#24182;&#19988;&#27809;&#26377;&#23436;&#25972;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26368;&#36817;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#23545;&#35805;&#12289;&#38382;&#31572;&#21644;&#35299;&#20915;&#25968;&#23398;&#38382;&#39064;&#26041;&#38754;&#23637;&#29616;&#20986;&#24378;&#22823;&#30340;&#25512;&#29702;&#33021;&#21147;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;LLMs&#26159;&#21542;&#21487;&#20197;&#29992;&#20110;&#30830;&#23450;&#20004;&#20010;SQL&#26597;&#35810;&#30340;&#31561;&#20215;&#24615;&#65288;&#35821;&#20041;&#31561;&#20215;&#21644;&#23485;&#26494;&#31561;&#20215;&#65289;&#12290;&#20026;&#20102;&#24110;&#21161;LLMs&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#21709;&#24212;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#25552;&#31034;&#25216;&#26415;&#65306;Miniature &amp; Mull&#21644;Explain &amp; Compare&#12290;&#21069;&#19968;&#31181;&#25216;&#26415;&#34987;&#29992;&#20110;&#35780;&#20272;&#35821;&#20041;&#31561;&#20215;&#24615;&#65292;&#23427;&#35201;&#27714;LLMs&#22312;&#31616;&#21333;&#30340;&#25968;&#25454;&#24211;&#23454;&#20363;&#19978;&#25191;&#34892;&#26597;&#35810;&#65292;&#28982;&#21518;&#25506;&#32034;&#26159;&#21542;&#23384;&#22312;&#21453;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
Judging the equivalence between two SQL queries is a fundamental problem with many practical applications in data management and SQL generation (i.e., evaluating the quality of generated SQL queries in text-to-SQL task). While the research community has reasoned about SQL equivalence for decades, it poses considerable difficulties and no complete solutions exist. Recently, Large Language Models (LLMs) have shown strong reasoning capability in conversation, question answering and solving mathematics challenges. In this paper, we study if LLMs can be used to determine the equivalence between SQL queries under two notions of SQL equivalence (semantic equivalence and relaxed equivalence). To assist LLMs in generating high quality responses, we present two prompting techniques: Miniature &amp; Mull and Explain &amp; Compare. The former technique is used to evaluate the semantic equivalence in which it asks LLMs to execute a query on a simple database instance and then explore if a counterexample ex
&lt;/p&gt;</description></item></channel></rss>