<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#35813;&#30740;&#31350;&#24341;&#20837;&#20102;&#37327;&#23376;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#65288;QLD&#65289;&#26469;&#35299;&#20915;&#38750;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#20984;&#26223;&#35266;&#20013; QLD &#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#33021;&#37327;&#32791;&#25955;&#33021;&#21147;&#21644;&#20302;&#28201;&#26497;&#38480;&#19979;&#25351;&#25968;&#34928;&#20943;&#36895;&#29575;&#12290;</title><link>https://arxiv.org/abs/2311.15587</link><description>&lt;p&gt;
&#37327;&#23376;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#29992;&#20110;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Quantum Langevin Dynamics for Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.15587
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24341;&#20837;&#20102;&#37327;&#23376;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#65288;QLD&#65289;&#26469;&#35299;&#20915;&#38750;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#20984;&#26223;&#35266;&#20013; QLD &#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#33021;&#37327;&#32791;&#25955;&#33021;&#21147;&#21644;&#20302;&#28201;&#26497;&#38480;&#19979;&#25351;&#25968;&#34928;&#20943;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#22987;&#30740;&#31350;&#21033;&#29992;&#37327;&#23376;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#65288;QLD&#65289;&#26469;&#35299;&#20915;&#20248;&#21270;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#23545;&#20256;&#32479;&#26799;&#24230;&#19979;&#38477;&#31639;&#27861;&#20135;&#29983;&#37325;&#22823;&#38556;&#30861;&#30340;&#38750;&#20984;&#30446;&#26631;&#20989;&#25968;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19982;&#26080;&#38480;&#28909;&#28020;&#32806;&#21512;&#30340;&#31995;&#32479;&#21160;&#21147;&#23398;&#12290;&#35813;&#30456;&#20114;&#20316;&#29992;&#26082;&#24341;&#36215;&#20102;&#38543;&#26426;&#37327;&#23376;&#22122;&#22768;&#65292;&#21448;&#24341;&#36215;&#20102;&#23545;&#31995;&#32479;&#30340;&#30830;&#23450;&#24615;&#38459;&#23612;&#25928;&#24212;&#65292;&#20174;&#32780;&#23558;&#31995;&#32479;&#25512;&#21521;&#25509;&#36817;&#30446;&#26631;&#20989;&#25968;&#20840;&#23616;&#26368;&#23567;&#20540;&#30340;&#31283;&#23450;&#29366;&#24577;&#12290;&#25105;&#20204;&#22312;&#20984;&#26223;&#35266;&#20013;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102; QLD &#30340;&#25910;&#25947;&#24615;&#65292;&#35777;&#26126;&#20102;&#31995;&#32479;&#30340;&#24179;&#22343;&#33021;&#37327;&#21487;&#20197;&#22312;&#20302;&#28201;&#26497;&#38480;&#19979;&#25509;&#36817;&#38646;&#65292;&#24182;&#19988;&#20855;&#26377;&#19982;&#28436;&#21270;&#26102;&#38388;&#30456;&#20851;&#30340;&#25351;&#25968;&#34928;&#20943;&#36895;&#29575;&#12290;&#22312;&#25968;&#20540;&#19978;&#65292;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#23558;&#20854;&#36215;&#28304;&#36861;&#28335;&#21040;&#33258;&#21457;&#36752;&#23556;&#26469;&#23637;&#31034; QLD &#30340;&#33021;&#37327;&#32791;&#25955;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23545;&#27599;&#20010; p &#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#35814;&#32454;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.15587v2 Announce Type: replace-cross  Abstract: We initiate the study of utilizing Quantum Langevin Dynamics (QLD) to solve optimization problems, particularly those non-convex objective functions that present substantial obstacles for traditional gradient descent algorithms. Specifically, we examine the dynamics of a system coupled with an infinite heat bath. This interaction induces both random quantum noise and a deterministic damping effect to the system, which nudge the system towards a steady state that hovers near the global minimum of objective functions. We theoretically prove the convergence of QLD in convex landscapes, demonstrating that the average energy of the system can approach zero in the low temperature limit with an exponential decay rate correlated with the evolution time. Numerically, we first show the energy dissipation capability of QLD by retracing its origins to spontaneous emission. Furthermore, we conduct detailed discussion of the impact of each p
&lt;/p&gt;</description></item></channel></rss>