<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#26469;&#38477;&#20302;&#26080;&#26381;&#21153;&#22120;&#35745;&#31639;&#20013;&#30340;&#20919;&#21551;&#21160;&#39057;&#29575;&#12290;&#36890;&#36807;&#20351;&#29992;Q&#23398;&#20064;&#21644;&#32771;&#34385;&#22810;&#31181;&#25351;&#26631;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312;&#39044;&#26399;&#38656;&#27714;&#30340;&#22522;&#30784;&#19978;&#25552;&#21069;&#21021;&#22987;&#21270;&#20989;&#25968;&#65292;&#20174;&#32780;&#20943;&#23569;&#20919;&#21551;&#21160;&#27425;&#25968;&#12290;</title><link>http://arxiv.org/abs/2308.07541</link><description>&lt;p&gt;
&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26080;&#26381;&#21153;&#22120;&#35745;&#31639;&#20013;&#20919;&#21551;&#21160;&#39057;&#29575;&#38477;&#20302;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Reinforcement Learning (RL) Augmented Cold Start Frequency Reduction in Serverless Computing. (arXiv:2308.07541v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07541
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#26469;&#38477;&#20302;&#26080;&#26381;&#21153;&#22120;&#35745;&#31639;&#20013;&#30340;&#20919;&#21551;&#21160;&#39057;&#29575;&#12290;&#36890;&#36807;&#20351;&#29992;Q&#23398;&#20064;&#21644;&#32771;&#34385;&#22810;&#31181;&#25351;&#26631;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312;&#39044;&#26399;&#38656;&#27714;&#30340;&#22522;&#30784;&#19978;&#25552;&#21069;&#21021;&#22987;&#21270;&#20989;&#25968;&#65292;&#20174;&#32780;&#20943;&#23569;&#20919;&#21551;&#21160;&#27425;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20989;&#25968;&#21363;&#26381;&#21153;&#26159;&#19968;&#31181;&#20113;&#35745;&#31639;&#33539;&#20363;&#65292;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;&#20107;&#20214;&#39537;&#21160;&#25191;&#34892;&#27169;&#22411;&#12290;&#23427;&#36890;&#36807;&#20174;&#24320;&#21457;&#32773;&#37027;&#37324;&#28040;&#38500;&#36164;&#28304;&#31649;&#29702;&#36131;&#20219;&#65292;&#25552;&#20379;&#36879;&#26126;&#21644;&#25353;&#38656;&#21487;&#25193;&#23637;&#24615;&#26469;&#23454;&#29616;&#26080;&#26381;&#21153;&#22120;&#29305;&#24615;&#12290;&#20856;&#22411;&#30340;&#26080;&#26381;&#21153;&#22120;&#24212;&#29992;&#31243;&#24207;&#23545;&#21709;&#24212;&#26102;&#38388;&#21644;&#21487;&#25193;&#23637;&#24615;&#26377;&#20005;&#26684;&#35201;&#27714;&#65292;&#22240;&#27492;&#20381;&#36182;&#20110;&#37096;&#32626;&#30340;&#26381;&#21153;&#20026;&#23458;&#25143;&#25552;&#20379;&#24555;&#36895;&#21644;&#23481;&#38169;&#30340;&#21453;&#39304;&#12290;&#28982;&#32780;&#65292;&#20989;&#25968;&#21363;&#26381;&#21153;&#33539;&#20363;&#22312;&#38656;&#35201;&#25353;&#38656;&#21021;&#22987;&#21270;&#20989;&#25968;&#26102;&#23384;&#22312;&#38750;&#24120;&#21487;&#35266;&#30340;&#24310;&#36831;&#65292;&#21363;&#20919;&#21551;&#21160;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#26469;&#20943;&#23569;&#24179;&#21488;&#19978;&#30340;&#20919;&#21551;&#21160;&#39057;&#29575;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;Q&#23398;&#20064;&#65292;&#24182;&#32771;&#34385;&#20989;&#25968;&#30340;CPU&#21033;&#29992;&#29575;&#12289;&#24050;&#26377;&#20989;&#25968;&#23454;&#20363;&#21644;&#21709;&#24212;&#22833;&#36133;&#29575;&#31561;&#25351;&#26631;&#65292;&#26681;&#25454;&#39044;&#26399;&#38656;&#27714;&#25552;&#21069;&#20027;&#21160;&#21021;&#22987;&#21270;&#20989;&#25968;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#35299;&#20915;&#26041;&#26696;&#22312;Kubeless&#19978;&#23454;&#29616;&#24182;&#36827;&#34892;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
Function-as-a-Service is a cloud computing paradigm offering an event-driven execution model to applications. It features serverless attributes by eliminating resource management responsibilities from developers and offers transparent and on-demand scalability of applications. Typical serverless applications have stringent response time and scalability requirements and therefore rely on deployed services to provide quick and fault-tolerant feedback to clients. However, the FaaS paradigm suffers from cold starts as there is a non-negligible delay associated with on-demand function initialization. This work focuses on reducing the frequency of cold starts on the platform by using Reinforcement Learning. Our approach uses Q-learning and considers metrics such as function CPU utilization, existing function instances, and response failure rate to proactively initialize functions in advance based on the expected demand. The proposed solution was implemented on Kubeless and was evaluated usin
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#31995;&#32479;&#20013;&#30340;&#23545;&#25239;&#24615;&#20027;&#23548;&#36755;&#20837;&#65288;ADIs&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#22312;&#20856;&#22411;VFL&#31995;&#32479;&#20013;&#30340;&#23384;&#22312;&#12290;&#35813;&#30740;&#31350;&#20026;&#38450;&#27490;ADIs&#30340;&#20351;&#29992;&#25552;&#20379;&#20102;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2201.02775</link><description>&lt;p&gt;
ADI: &#22312;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#31995;&#32479;&#20013;&#30340;&#23545;&#25239;&#24615;&#20027;&#23548;&#36755;&#20837;
&lt;/p&gt;
&lt;p&gt;
ADI: Adversarial Dominating Inputs in Vertical Federated Learning Systems. (arXiv:2201.02775v3 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.02775
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#31995;&#32479;&#20013;&#30340;&#23545;&#25239;&#24615;&#20027;&#23548;&#36755;&#20837;&#65288;ADIs&#65289;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#22312;&#20856;&#22411;VFL&#31995;&#32479;&#20013;&#30340;&#23384;&#22312;&#12290;&#35813;&#30740;&#31350;&#20026;&#38450;&#27490;ADIs&#30340;&#20351;&#29992;&#25552;&#20379;&#20102;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#22402;&#30452;&#32852;&#37030;&#23398;&#20064;&#65288;VFL&#65289;&#31995;&#32479;&#20316;&#20026;&#22788;&#29702;&#20998;&#25955;&#22312;&#35768;&#22810;&#20010;&#20307;&#26469;&#28304;&#20013;&#30340;&#25968;&#25454;&#30340;&#27010;&#24565;&#32780;&#21464;&#24471;&#31361;&#20986;&#65292;&#26080;&#38656;&#23558;&#20854;&#38598;&#20013;&#21270;&#12290;&#22810;&#20010;&#21442;&#19982;&#32773;&#20197;&#38544;&#31169;&#24847;&#35782;&#30340;&#26041;&#24335;&#21327;&#20316;&#35757;&#32451;&#22522;&#20110;&#20854;&#26412;&#22320;&#25968;&#25454;&#30340;&#27169;&#22411;&#12290;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;VFL&#24050;&#25104;&#20026;&#22312;&#32452;&#32455;&#20043;&#38388;&#23433;&#20840;&#23398;&#20064;&#27169;&#22411;&#30340;&#20107;&#23454;&#35299;&#20915;&#26041;&#26696;&#65292;&#20801;&#35768;&#20849;&#20139;&#30693;&#35782;&#32780;&#19981;&#24433;&#21709;&#20219;&#20309;&#20010;&#20154;&#30340;&#38544;&#31169;&#12290;&#23613;&#31649;VFL&#31995;&#32479;&#30340;&#21457;&#23637;&#26124;&#30427;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#26576;&#20123;&#21442;&#19982;&#32773;&#30340;&#36755;&#20837;&#65292;&#31216;&#20026;&#23545;&#25239;&#24615;&#20027;&#23548;&#36755;&#20837;&#65288;ADIs&#65289;&#65292;&#21487;&#20197;&#25903;&#37197;&#20849;&#21516;&#25512;&#26029;&#26397;&#30528;&#23545;&#25163;&#30340;&#24847;&#24895;&#26041;&#21521;&#24182;&#36843;&#20351;&#20854;&#20182;&#65288;&#21463;&#23475;&#32773;&#65289;&#21442;&#19982;&#32773;&#20570;&#20986;&#24494;&#19981;&#36275;&#36947;&#30340;&#36129;&#29486;&#65292;&#22833;&#21435;&#36890;&#24120;&#22312;&#32852;&#37030;&#23398;&#20064;&#22330;&#26223;&#20013;&#25552;&#20379;&#30340;&#23545;&#20854;&#36129;&#29486;&#37325;&#35201;&#24615;&#30340;&#22870;&#21169;&#12290;&#25105;&#20204;&#23545;ADIs&#36827;&#34892;&#20102;&#31995;&#32479;&#30740;&#31350;&#65292;&#39318;&#20808;&#35777;&#26126;&#20102;&#23427;&#20204;&#22312;&#20856;&#22411;&#30340;VFL&#31995;&#32479;&#20013;&#30340;&#23384;&#22312;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#26799;&#24230;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Vertical federated learning (VFL) system has recently become prominent as a concept to process data distributed across many individual sources without the need to centralize it. Multiple participants collaboratively train models based on their local data in a privacy-aware manner. To date, VFL has become a de facto solution to securely learn a model among organizations, allowing knowledge to be shared without compromising privacy of any individuals. Despite the prosperous development of VFL systems, we find that certain inputs of a participant, named adversarial dominating inputs (ADIs), can dominate the joint inference towards the direction of the adversary's will and force other (victim) participants to make negligible contributions, losing rewards that are usually offered regarding the importance of their contributions in federated learning scenarios. We conduct a systematic study on ADIs by first proving their existence in typical VFL systems. We then propose gradient-based methods
&lt;/p&gt;</description></item></channel></rss>