<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#26159;&#32435;&#20160;&#22343;&#34913;&#30340;&#19968;&#20010;&#26494;&#24347;&#21464;&#31181;&#65292;&#21487;&#20197;&#36890;&#36807;&#23454;&#29616;&#19982;&#26368;&#20339;&#20809;&#28369;&#31574;&#30053;&#30340;&#20559;&#31163;&#30456;&#21516;&#30340;&#25928;&#29992;&#26469;&#36798;&#21040;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#24378;&#21644;&#24369;&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#30340;&#27010;&#24565;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#22312;&#35745;&#31639;&#24615;&#36136;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2309.12226</link><description>&lt;p&gt;
&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#65306;&#31639;&#27861;&#21644;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Smooth Nash Equilibria: Algorithms and Complexity. (arXiv:2309.12226v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12226
&lt;/p&gt;
&lt;p&gt;
&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#26159;&#32435;&#20160;&#22343;&#34913;&#30340;&#19968;&#20010;&#26494;&#24347;&#21464;&#31181;&#65292;&#21487;&#20197;&#36890;&#36807;&#23454;&#29616;&#19982;&#26368;&#20339;&#20809;&#28369;&#31574;&#30053;&#30340;&#20559;&#31163;&#30456;&#21516;&#30340;&#25928;&#29992;&#26469;&#36798;&#21040;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#24378;&#21644;&#24369;&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#30340;&#27010;&#24565;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#22312;&#35745;&#31639;&#24615;&#36136;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#32435;&#20160;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32435;&#20160;&#22343;&#34913;&#30340;&#19968;&#20010;&#22522;&#26412;&#32570;&#28857;&#26159;&#20854;&#35745;&#31639;&#22797;&#26434;&#24615;&#65306;&#22312;&#27491;&#21017;&#24418;&#24335;&#30340;&#21338;&#24328;&#20013;&#65292;&#36817;&#20284;&#32435;&#20160;&#22343;&#34913;&#26159;PPAD&#38590;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#21463;&#21040;&#24179;&#28369;&#20998;&#26512;&#24605;&#24819;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#34987;&#31216;&#20026;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#30340;&#26494;&#24347;&#21464;&#31181;&#65292;&#20854;&#20013;$\sigma$&#26159;&#20809;&#28369;&#24615;&#21442;&#25968;&#12290;&#22312;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#20013;&#65292;&#29609;&#23478;&#20204;&#21482;&#38656;&#35201;&#23454;&#29616;&#33267;&#23569;&#19982;&#20182;&#20204;&#26368;&#20339;$\sigma$-&#20809;&#28369;&#31574;&#30053;&#30340;&#20559;&#31163;&#30456;&#21516;&#30340;&#25928;&#29992;&#65292;&#32780;&#36825;&#20010;$\sigma$-&#20809;&#28369;&#31574;&#30053;&#26159;&#19981;&#20250;&#23545;&#20219;&#20309;&#22266;&#23450;&#21160;&#20316;&#20135;&#29983;&#36807;&#22810;&#36136;&#37327;&#65288;&#26681;&#25454;$\sigma$&#21442;&#25968;&#21270;&#65289;&#12290;&#25105;&#20204;&#21306;&#20998;&#20102;&#20004;&#31181;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#30340;&#21464;&#31181;&#65306;&#24378;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#29609;&#23478;&#20204;&#38656;&#35201;&#22312;&#22343;&#34913;&#20013;&#37319;&#29992;$\sigma$-&#20809;&#28369;&#31574;&#30053;&#36827;&#34892;&#28216;&#25103;&#65307;&#24369;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#20013;&#65292;&#27809;&#26377;&#36825;&#26679;&#30340;&#35201;&#27714;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#26080;&#35770;&#26159;&#24369;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#36824;&#26159;&#24378;$\sigma$-&#20809;&#28369;&#32435;&#20160;&#22343;&#34913;&#65292;&#37117;&#27604;&#32435;&#20160;&#22343;&#34913;&#20855;&#26377;&#26356;&#22909;&#30340;&#35745;&#31639;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
A fundamental shortcoming of the concept of Nash equilibrium is its computational intractability: approximating Nash equilibria in normal-form games is PPAD-hard. In this paper, inspired by the ideas of smoothed analysis, we introduce a relaxed variant of Nash equilibrium called $\sigma$-smooth Nash equilibrium, for a smoothness parameter $\sigma$. In a $\sigma$-smooth Nash equilibrium, players only need to achieve utility at least as high as their best deviation to a $\sigma$-smooth strategy, which is a distribution that does not put too much mass (as parametrized by $\sigma$) on any fixed action. We distinguish two variants of $\sigma$-smooth Nash equilibria: strong $\sigma$-smooth Nash equilibria, in which players are required to play $\sigma$-smooth strategies under equilibrium play, and weak $\sigma$-smooth Nash equilibria, where there is no such requirement.  We show that both weak and strong $\sigma$-smooth Nash equilibria have superior computational properties to Nash equilibri
&lt;/p&gt;</description></item></channel></rss>