<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24182;&#34892;&#23567;&#25209;&#37327;&#35757;&#32451;&#26041;&#27861;&#65292;&#21363;&#20998;&#35010;&#24182;&#34892;&#65292;&#24212;&#29992;&#22312;&#22270;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#19978;&#65292;&#33021;&#26377;&#25928;&#32531;&#35299;&#25968;&#25454;&#24182;&#34892;&#26041;&#27861;&#30340;&#24615;&#33021;&#29942;&#39048;&#65292;&#21516;&#26102;&#22312;&#22823;&#35268;&#27169;&#22270;&#19978;&#30340;&#24615;&#33021;&#34920;&#29616;&#20248;&#36234;&#12290;</title><link>http://arxiv.org/abs/2303.13775</link><description>&lt;p&gt;
GSplit: &#36890;&#36807;&#20998;&#35010;&#24182;&#34892;&#23454;&#29616;&#22823;&#35268;&#27169;&#22270;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#30340;&#25193;&#23637;
&lt;/p&gt;
&lt;p&gt;
GSplit: Scaling Graph Neural Network Training on Large Graphs via Split-Parallelism. (arXiv:2303.13775v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13775
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24182;&#34892;&#23567;&#25209;&#37327;&#35757;&#32451;&#26041;&#27861;&#65292;&#21363;&#20998;&#35010;&#24182;&#34892;&#65292;&#24212;&#29992;&#22312;&#22270;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#19978;&#65292;&#33021;&#26377;&#25928;&#32531;&#35299;&#25968;&#25454;&#24182;&#34892;&#26041;&#27861;&#30340;&#24615;&#33021;&#29942;&#39048;&#65292;&#21516;&#26102;&#22312;&#22823;&#35268;&#27169;&#22270;&#19978;&#30340;&#24615;&#33021;&#34920;&#29616;&#20248;&#36234;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#34892;&#19994;&#12289;&#31185;&#23398;&#21644;&#24037;&#31243;&#39046;&#22495;&#65288;&#22914;&#25512;&#33616;&#31995;&#32479;&#12289;&#31038;&#20132;&#22270;&#20998;&#26512;&#12289;&#30693;&#35782;&#24211;&#12289;&#26448;&#26009;&#31185;&#23398;&#21644;&#29983;&#29289;&#23398;&#65289;&#20013;&#65292;&#25317;&#26377;&#25968;&#21313;&#20159;&#20010;&#36793;&#30340;&#22823;&#35268;&#27169;&#22270;&#24418;&#26159;&#26222;&#36941;&#23384;&#22312;&#30340;&#12290;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#20316;&#20026;&#19968;&#31181;&#26032;&#20852;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#30001;&#20110;&#22312;&#21508;&#31181;&#22270;&#20998;&#26512;&#20219;&#21153;&#20013;&#20855;&#26377;&#21331;&#36234;&#30340;&#24615;&#33021;&#65292;&#22240;&#27492;&#36234;&#26469;&#36234;&#22810;&#22320;&#34987;&#37319;&#29992;&#26469;&#23398;&#20064;&#36825;&#20123;&#22270;&#24418;&#12290;&#22312;&#22823;&#22411;&#22270;&#24418;&#19978;&#35757;&#32451;&#36890;&#24120;&#37319;&#29992;&#23567;&#25209;&#37327;&#35757;&#32451;&#65292;&#24182;&#19988;&#25968;&#25454;&#24182;&#34892;&#26159;&#23558;&#23567;&#25209;&#37327;&#35757;&#32451;&#25193;&#23637;&#21040;&#22810;&#20010; GPU &#30340;&#26631;&#20934;&#26041;&#27861;&#12290;&#26412;&#25991;&#35748;&#20026;&#65292;GNN &#35757;&#32451;&#31995;&#32479;&#30340;&#20960;&#20010;&#22522;&#26412;&#24615;&#33021;&#29942;&#39048;&#19982;&#25968;&#25454;&#24182;&#34892;&#26041;&#27861;&#30340;&#22266;&#26377;&#38480;&#21046;&#26377;&#20851;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24182;&#34892;&#23567;&#25209;&#37327;&#35757;&#32451;&#33539;&#24335;- &#20998;&#35010;&#24182;&#34892;&#65292;&#24182;&#23558;&#20854;&#23454;&#29616;&#22312;&#19968;&#20010;&#21517;&#20026;gsplit&#30340;&#26032;&#31995;&#32479;&#20013;&#12290;&#23454;&#39564;&#34920;&#26126;&#65292;gsplit &#30340;&#24615;&#33021;&#20248;&#20110;DGL&#12289;Quiver&#21644;PaGraph&#31561;&#29616;&#26377;&#30340;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large-scale graphs with billions of edges are ubiquitous in many industries, science, and engineering fields such as recommendation systems, social graph analysis, knowledge base, material science, and biology. Graph neural networks (GNN), an emerging class of machine learning models, are increasingly adopted to learn on these graphs due to their superior performance in various graph analytics tasks. Mini-batch training is commonly adopted to train on large graphs, and data parallelism is the standard approach to scale mini-batch training to multiple GPUs. In this paper, we argue that several fundamental performance bottlenecks of GNN training systems have to do with inherent limitations of the data parallel approach. We then propose split parallelism, a novel parallel mini-batch training paradigm. We implement split parallelism in a novel system called gsplit and show that it outperforms state-of-the-art systems such as DGL, Quiver, and PaGraph.
&lt;/p&gt;</description></item></channel></rss>