<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26234;&#33021;&#20445;&#30041;&#31995;&#32479;&#65292;&#20351;&#29992;&#38408;&#20540;&#27169;&#22411;&#20801;&#35768;&#29420;&#31435;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#21644;&#20219;&#24847;&#30340;&#21463;&#30410;&#20154;&#21644;&#36164;&#26684;&#38408;&#20540;&#65292;&#20197;&#23454;&#29616;&#20248;&#21270;&#20998;&#37197;&#21333;&#20803;&#25968;&#30340;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2309.13766</link><description>&lt;p&gt;
&#38408;&#20540;&#20445;&#30041;&#21305;&#37197;
&lt;/p&gt;
&lt;p&gt;
Reserve Matching with Thresholds. (arXiv:2309.13766v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.13766
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26234;&#33021;&#20445;&#30041;&#31995;&#32479;&#65292;&#20351;&#29992;&#38408;&#20540;&#27169;&#22411;&#20801;&#35768;&#29420;&#31435;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#21644;&#20219;&#24847;&#30340;&#21463;&#30410;&#20154;&#21644;&#36164;&#26684;&#38408;&#20540;&#65292;&#20197;&#23454;&#29616;&#20248;&#21270;&#20998;&#37197;&#21333;&#20803;&#25968;&#30340;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20445;&#30041;&#31995;&#32479;&#36890;&#36807;&#21019;&#24314;&#20248;&#20808;&#32771;&#34385;&#21508;&#33258;&#21463;&#30410;&#20154;&#30340;&#31867;&#21035;&#65292;&#20197;&#36866;&#24212;&#22810;&#20010;&#37325;&#35201;&#25110;&#20195;&#34920;&#24615;&#19981;&#36275;&#30340;&#32676;&#20307;&#26469;&#20998;&#37197;&#19981;&#21487;&#20998;&#21106;&#30340;&#31232;&#32570;&#36164;&#28304;&#12290;&#19968;&#20123;&#24212;&#29992;&#21253;&#25324;&#30123;&#33495;&#30340;&#26368;&#20248;&#20998;&#37197;&#65292;&#25110;&#23558;&#23569;&#25968;&#20154;&#20998;&#37197;&#21040;&#21360;&#24230;&#30340;&#31934;&#33521;&#23398;&#38498;&#12290;&#26234;&#33021;&#20998;&#37197;&#26159;&#25351;&#20248;&#21270;&#20998;&#37197;&#21333;&#20803;&#25968;&#30340;&#20998;&#37197;&#12290;&#20808;&#21069;&#30340;&#25991;&#29486;&#22823;&#22810;&#20551;&#23450;&#20102;&#22522;&#20934;&#20248;&#20808;&#32423;&#65292;&#36825;&#22312;&#19981;&#21516;&#31867;&#21035;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#20043;&#38388;&#20250;&#20135;&#29983;&#37325;&#35201;&#30340;&#30456;&#20114;&#20381;&#36182;&#12290;&#23427;&#36824;&#20551;&#23450;&#35201;&#20040;&#27599;&#20010;&#20154;&#37117;&#26377;&#36164;&#26684;&#20174;&#20219;&#20309;&#31867;&#21035;&#25509;&#25910;&#21333;&#20803;&#65292;&#35201;&#20040;&#21482;&#26377;&#21463;&#30410;&#20154;&#26377;&#36164;&#26684;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#20840;&#38754;&#38408;&#20540;&#27169;&#22411;&#20801;&#35768;&#22312;&#31867;&#21035;&#20043;&#38388;&#36827;&#34892;&#29420;&#31435;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#65292;&#24182;&#35774;&#32622;&#20219;&#24847;&#30340;&#21463;&#30410;&#20154;&#21644;&#36164;&#26684;&#38408;&#20540;&#65292;&#20351;&#20915;&#31574;&#32773;&#33021;&#22815;&#36991;&#20813;&#22312;&#24179;&#26435;&#34892;&#21160;&#31995;&#32479;&#20013;&#36827;&#34892;&#26080;&#27861;&#27604;&#36739;&#30340;&#27604;&#36739;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26234;&#33021;&#20445;&#30041;&#31995;&#32479;&#65292;&#21487;&#20197;&#21516;&#26102;&#20248;&#21270;&#20004;&#20010;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reserve systems are used to accommodate multiple essential or underrepresented groups in allocating indivisible scarce resources by creating categories that prioritize their respective beneficiaries. Some applications include the optimal allocation of vaccines, or assignment of minority students to elite colleges in India. An allocation is called smart if it optimizes the number of units distributed. Previous literature mostly assumed baseline priorities, which impose significant interdependencies between the priority ordering of different categories. It also assumes either everybody is eligible for receiving a unit from any category, or only the beneficiaries are eligible. The comprehensive Threshold Model we propose allows independent priority orderings among categories and arbitrary beneficiary and eligibility thresholds, enabling policymakers to avoid comparing incomparables in affirmative action systems. We present a new smart reserve system that optimizes two objectives simultane
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;Matroid&#32422;&#26463;&#19979;&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#20013;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#27969;&#24335;&#31639;&#27861;&#21644;&#19981;&#21487;&#33021;&#30340;&#32467;&#26524;&#26469;&#26435;&#34913;&#25928;&#29575;&#12289;&#36136;&#37327;&#21644;&#20844;&#24179;&#24615;&#65292;&#24182;&#22312;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#23454;&#35777;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2305.15118</link><description>&lt;p&gt;
&#22312;&#19968;&#20010;Matroid&#32422;&#26463;&#19979;&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#20013;&#30340;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
Fairness in Streaming Submodular Maximization over a Matroid Constraint. (arXiv:2305.15118v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15118
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;Matroid&#32422;&#26463;&#19979;&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#20013;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#27969;&#24335;&#31639;&#27861;&#21644;&#19981;&#21487;&#33021;&#30340;&#32467;&#26524;&#26469;&#26435;&#34913;&#25928;&#29575;&#12289;&#36136;&#37327;&#21644;&#20844;&#24179;&#24615;&#65292;&#24182;&#22312;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#23454;&#35777;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#24335;&#23376;&#27169;&#26368;&#22823;&#21270;&#26159;&#20174;&#19968;&#20010;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#20013;&#36873;&#25321;&#19968;&#20010;&#20195;&#34920;&#24615;&#23376;&#38598;&#30340;&#33258;&#28982;&#27169;&#22411;&#12290;&#22914;&#26524;&#25968;&#25454;&#28857;&#20855;&#26377;&#25935;&#24863;&#23646;&#24615;&#65292;&#22914;&#24615;&#21035;&#25110;&#31181;&#26063;&#65292;&#24378;&#21046;&#20844;&#24179;&#24615;&#20197;&#36991;&#20813;&#20559;&#35265;&#21644;&#27495;&#35270;&#21464;&#24471;&#37325;&#35201;&#12290;&#36825;&#24341;&#36215;&#20102;&#23545;&#24320;&#21457;&#20844;&#24179;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#26497;&#22823;&#20852;&#36259;&#12290;&#26368;&#36817;&#65292;&#36825;&#26679;&#30340;&#31639;&#27861;&#24050;&#32463;&#34987;&#24320;&#21457;&#29992;&#20110;&#22522;&#20110;&#22522;&#25968;&#32422;&#26463;&#30340;&#21333;&#35843;&#23376;&#27169;&#26368;&#22823;&#21270;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#30340;&#33258;&#28982;&#25512;&#24191;&#21040;&#19968;&#20010;Matroid&#32422;&#26463;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#27969;&#24335;&#31639;&#27861;&#20197;&#21450;&#19981;&#21487;&#33021;&#30340;&#32467;&#26524;&#65292;&#36825;&#20123;&#32467;&#26524;&#22312;&#25928;&#29575;&#12289;&#36136;&#37327;&#21644;&#20844;&#24179;&#24615;&#20043;&#38388;&#25552;&#20379;&#20102;&#26435;&#34913;&#12290;&#25105;&#20204;&#22312;&#19968;&#31995;&#21015;&#30693;&#21517;&#30340;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#23545;&#25105;&#20204;&#30340;&#21457;&#29616;&#36827;&#34892;&#20102;&#32463;&#39564;&#35777;&#23454;&#65306;&#22522;&#20110;&#31034;&#20363;&#30340;&#32858;&#31867;&#12289;&#30005;&#24433;&#25512;&#33616;&#21644;&#31038;&#20132;&#32593;&#32476;&#20013;&#30340;&#26368;&#22823;&#35206;&#30422;&#12290;
&lt;/p&gt;
&lt;p&gt;
Streaming submodular maximization is a natural model for the task of selecting a representative subset from a large-scale dataset. If datapoints have sensitive attributes such as gender or race, it becomes important to enforce fairness to avoid bias and discrimination. This has spurred significant interest in developing fair machine learning algorithms. Recently, such algorithms have been developed for monotone submodular maximization under a cardinality constraint.  In this paper, we study the natural generalization of this problem to a matroid constraint. We give streaming algorithms as well as impossibility results that provide trade-offs between efficiency, quality and fairness. We validate our findings empirically on a range of well-known real-world applications: exemplar-based clustering, movie recommendation, and maximum coverage in social networks.
&lt;/p&gt;</description></item></channel></rss>