<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#24230;&#29305;&#24449;&#21305;&#37197;&#31639;&#27861;&#39640;&#25928;&#21305;&#37197;&#38543;&#26426;&#19981;&#22343;&#21248;&#22270;&#30340;&#26041;&#27861;&#65292;&#35201;&#27714;&#26368;&#23567;&#24179;&#22343;&#24230;&#21644;&#26368;&#23567;&#30456;&#20851;&#24615;&#36798;&#21040;&#19968;&#23450;&#38408;&#20540;&#12290;</title><link>http://arxiv.org/abs/2310.10441</link><description>&lt;p&gt;
&#36890;&#36807;&#24230;&#29305;&#24449;&#39640;&#25928;&#21305;&#37197;&#38543;&#26426;&#19981;&#22343;&#21248;&#22270;
&lt;/p&gt;
&lt;p&gt;
Efficiently matching random inhomogeneous graphs via degree profiles. (arXiv:2310.10441v1 [cs.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10441
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#24230;&#29305;&#24449;&#21305;&#37197;&#31639;&#27861;&#39640;&#25928;&#21305;&#37197;&#38543;&#26426;&#19981;&#22343;&#21248;&#22270;&#30340;&#26041;&#27861;&#65292;&#35201;&#27714;&#26368;&#23567;&#24179;&#22343;&#24230;&#21644;&#26368;&#23567;&#30456;&#20851;&#24615;&#36798;&#21040;&#19968;&#23450;&#38408;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24674;&#22797;&#20004;&#20010;&#30456;&#20851;&#30340;&#38543;&#26426;&#22270;&#20043;&#38388;&#28508;&#22312;&#39030;&#28857;&#23545;&#24212;&#20851;&#31995;&#30340;&#38382;&#39064;&#65292;&#36825;&#20004;&#20010;&#22270;&#20855;&#26377;&#26497;&#19981;&#22343;&#21248;&#19988;&#26410;&#30693;&#30340;&#19981;&#21516;&#39030;&#28857;&#23545;&#20043;&#38388;&#30340;&#36793;&#27010;&#29575;&#12290;&#22312;Ding&#12289;Ma&#12289;Wu&#21644;Xu(2021)&#25552;&#20986;&#30340;&#24230;&#29305;&#24449;&#21305;&#37197;&#31639;&#27861;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25193;&#23637;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#21482;&#35201;&#26368;&#23567;&#24179;&#22343;&#24230;&#33267;&#23569;&#20026;$\Omega(\log^{2} n)$&#65292;&#26368;&#23567;&#30456;&#20851;&#24615;&#33267;&#23569;&#20026;$1 - O(\log^{-2} n)$&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study the problem of recovering the latent vertex correspondence between two correlated random graphs with vastly inhomogeneous and unknown edge probabilities between different pairs of vertices. Inspired by and extending the matching algorithm via degree profiles by Ding, Ma, Wu and Xu (2021), we obtain an efficient matching algorithm as long as the minimal average degree is at least $\Omega(\log^{2} n)$ and the minimal correlation is at least $1 - O(\log^{-2} n)$.
&lt;/p&gt;</description></item></channel></rss>