<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#20998;&#24067;&#24335;&#23384;&#20648;&#22810;&#22788;&#29702;&#22120;&#19978;&#26368;&#22823;&#21270;&#23376;&#27169;&#20989;&#25968;&#30340;&#24182;&#34892;&#36817;&#20284;&#31639;&#27861;&#65292;&#20197;&#35299;&#20915;&#23454;&#38469;&#24212;&#29992;&#39046;&#22495;&#20013;&#28023;&#37327;&#25968;&#25454;&#38598;&#19978;&#30340;&#23376;&#27169;&#20248;&#21270;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.10332</link><description>&lt;p&gt;
GreedyML&#65306;&#19968;&#31181;&#29992;&#20110;&#26368;&#22823;&#21270;&#23376;&#27169;&#20989;&#25968;&#30340;&#24182;&#34892;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
GreedyML: A Parallel Algorithm for Maximizing Submodular Functions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10332
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#20998;&#24067;&#24335;&#23384;&#20648;&#22810;&#22788;&#29702;&#22120;&#19978;&#26368;&#22823;&#21270;&#23376;&#27169;&#20989;&#25968;&#30340;&#24182;&#34892;&#36817;&#20284;&#31639;&#27861;&#65292;&#20197;&#35299;&#20915;&#23454;&#38469;&#24212;&#29992;&#39046;&#22495;&#20013;&#28023;&#37327;&#25968;&#25454;&#38598;&#19978;&#30340;&#23376;&#27169;&#20248;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25551;&#36848;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#20998;&#24067;&#24335;&#23384;&#20648;&#22810;&#22788;&#29702;&#22120;&#19978;&#26368;&#22823;&#21270;&#21333;&#35843;&#23376;&#27169;&#20989;&#25968;&#30340;&#24182;&#34892;&#36817;&#20284;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#21463;&#21040;&#22312;&#28023;&#37327;&#25968;&#25454;&#38598;&#19978;&#35299;&#20915;&#23376;&#27169;&#20248;&#21270;&#38382;&#39064;&#30340;&#38656;&#27714;&#30340;&#21551;&#21457;&#65292;&#29992;&#20110;&#23454;&#38469;&#24212;&#29992;&#39046;&#22495;&#65292;&#22914;&#25968;&#25454;&#25688;&#35201;&#65292;&#26426;&#22120;&#23398;&#20064;&#21644;&#22270;&#31232;&#30095;&#21270;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#22522;&#20110;Barbosa&#12289;Ene&#12289;Nguyen&#21644;Ward&#65288;2015&#65289;&#25552;&#20986;&#30340;&#38543;&#26426;&#20998;&#24067;&#24335;RandGreedI&#31639;&#27861;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#23558;&#25968;&#25454;&#38543;&#26426;&#20998;&#21306;&#21040;&#25152;&#26377;&#22788;&#29702;&#22120;&#20013;&#65292;&#28982;&#21518;&#20351;&#29992;&#21333;&#20010;&#32047;&#31215;&#27493;&#39588;&#35745;&#31639;&#20998;&#24067;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#20854;&#20013;&#25152;&#26377;&#22788;&#29702;&#22120;&#23558;&#23427;&#20204;&#30340;&#37096;&#20998;&#35299;&#20915;&#26041;&#26696;&#21457;&#36865;&#32473;&#19968;&#20010;&#22788;&#29702;&#22120;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#22823;&#38382;&#39064;&#65292;&#32047;&#31215;&#27493;&#39588;&#21487;&#33021;&#36229;&#36807;&#22788;&#29702;&#22120;&#19978;&#21487;&#29992;&#30340;&#20869;&#23384;&#65292;&#24182;&#19988;&#25191;&#34892;&#32047;&#31215;&#30340;&#22788;&#29702;&#22120;&#21487;&#33021;&#25104;&#20026;&#35745;&#31639;&#29942;&#39048;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10332v1 Announce Type: cross  Abstract: We describe a parallel approximation algorithm for maximizing monotone submodular functions subject to hereditary constraints on distributed memory multiprocessors. Our work is motivated by the need to solve submodular optimization problems on massive data sets, for practical applications in areas such as data summarization, machine learning, and graph sparsification. Our work builds on the randomized distributed RandGreedI algorithm, proposed by Barbosa, Ene, Nguyen, and Ward (2015). This algorithm computes a distributed solution by randomly partitioning the data among all the processors and then employing a single accumulation step in which all processors send their partial solutions to one processor. However, for large problems, the accumulation step could exceed the memory available on a processor, and the processor which performs the accumulation could become a computational bottleneck.   Here, we propose a generalization of the R
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#21830;&#19994;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#65292;&#30528;&#37325;&#30740;&#31350;&#20102;&#25968;&#25454;&#28304;&#12289;&#29305;&#24449;&#24037;&#31243;&#21644;&#35780;&#20272;&#25351;&#26631;&#31561;&#26041;&#38754;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#31361;&#26174;&#20102;&#25512;&#33616;&#24341;&#25806;&#23545;&#29992;&#25143;&#20307;&#39564;&#21644;&#20915;&#31574;&#36807;&#31243;&#30340;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.08109</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#21040;&#20915;&#31574;&#65306;&#26426;&#22120;&#23398;&#20064;&#22312;&#21830;&#19994;&#25512;&#33616;&#20013;&#30340;&#36716;&#21464;&#21147;&#37327;
&lt;/p&gt;
&lt;p&gt;
From Data to Decisions: The Transformational Power of Machine Learning in Business Recommendations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08109
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#21830;&#19994;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#65292;&#30528;&#37325;&#30740;&#31350;&#20102;&#25968;&#25454;&#28304;&#12289;&#29305;&#24449;&#24037;&#31243;&#21644;&#35780;&#20272;&#25351;&#26631;&#31561;&#26041;&#38754;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#31361;&#26174;&#20102;&#25512;&#33616;&#24341;&#25806;&#23545;&#29992;&#25143;&#20307;&#39564;&#21644;&#20915;&#31574;&#36807;&#31243;&#30340;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#35752;&#26426;&#22120;&#23398;&#20064;&#23545;&#25512;&#33616;&#31995;&#32479;&#22312;&#21830;&#19994;&#29615;&#22659;&#20013;&#28436;&#21464;&#21644;&#26377;&#25928;&#24615;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#22312;&#23427;&#20204;&#22312;&#21830;&#19994;&#29615;&#22659;&#20013;&#26085;&#30410;&#37325;&#35201;&#30340;&#32972;&#26223;&#19979;&#12290;&#22312;&#26041;&#27861;&#35770;&#19978;&#65292;&#30740;&#31350;&#28145;&#20837;&#25506;&#35752;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#25512;&#33616;&#31995;&#32479;&#20013;&#22609;&#36896;&#21644;&#25913;&#36827;&#30340;&#20316;&#29992;&#65292;&#30528;&#37325;&#30740;&#31350;&#25968;&#25454;&#26469;&#28304;&#12289;&#29305;&#24449;&#24037;&#31243;&#21644;&#35780;&#20272;&#25351;&#26631;&#30340;&#37325;&#35201;&#24615;&#65292;&#20174;&#32780;&#31361;&#26174;&#20102;&#22686;&#24378;&#25512;&#33616;&#31639;&#27861;&#30340;&#36845;&#20195;&#24615;&#36136;&#12290;&#30740;&#31350;&#36824;&#25506;&#35752;&#20102;&#25512;&#33616;&#24341;&#25806;&#22312;&#21508;&#20010;&#39046;&#22495;&#30340;&#24212;&#29992;&#65292;&#36890;&#36807;&#39640;&#32423;&#31639;&#27861;&#21644;&#25968;&#25454;&#20998;&#26512;&#39537;&#21160;&#65292;&#23637;&#31034;&#20102;&#23427;&#20204;&#23545;&#29992;&#25143;&#20307;&#39564;&#21644;&#20915;&#31574;&#36807;&#31243;&#30340;&#37325;&#35201;&#24433;&#21709;&#12290;&#36825;&#20123;&#24341;&#25806;&#19981;&#20165;&#31616;&#21270;&#20102;&#20449;&#24687;&#21457;&#29616;&#21644;&#22686;&#24378;&#20102;&#21327;&#20316;&#65292;&#36824;&#21152;&#24555;&#20102;&#30693;&#35782;&#33719;&#21462;&#65292;&#23545;&#20225;&#19994;&#22312;&#25968;&#23383;&#21270;&#39046;&#22495;&#20013;&#30340;&#23548;&#33322;&#33267;&#20851;&#37325;&#35201;&#12290;&#23427;&#20204;&#23545;&#38144;&#21806;&#12289;&#25910;&#20837;&#21644;&#20225;&#19994;&#31454;&#20105;&#20248;&#21183;&#30340;&#36129;&#29486;&#38750;&#24120;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
This research aims to explore the impact of Machine Learning (ML) on the evolution and efficacy of Recommendation Systems (RS), particularly in the context of their growing significance in commercial business environments. Methodologically, the study delves into the role of ML in crafting and refining these systems, focusing on aspects such as data sourcing, feature engineering, and the importance of evaluation metrics, thereby highlighting the iterative nature of enhancing recommendation algorithms. The deployment of Recommendation Engines (RE), driven by advanced algorithms and data analytics, is explored across various domains, showcasing their significant impact on user experience and decision-making processes. These engines not only streamline information discovery and enhance collaboration but also accelerate knowledge acquisition, proving vital in navigating the digital landscape for businesses. They contribute significantly to sales, revenue, and the competitive edge of enterpr
&lt;/p&gt;</description></item></channel></rss>