<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#36825;&#31687;&#35770;&#25991;&#23545;&#21521;&#37327;&#25968;&#25454;&#24211;&#36827;&#34892;&#20102;&#20840;&#38754;&#35843;&#26597;&#65292;&#20171;&#32461;&#20102;&#23384;&#20648;&#21644;&#26816;&#32034;&#25216;&#26415;&#20197;&#21450;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#23545;&#35299;&#20915;&#36817;&#20284;&#26368;&#36817;&#37051;&#25628;&#32034;&#38382;&#39064;&#30340;&#19981;&#21516;&#26041;&#27861;&#36827;&#34892;&#20102;&#20998;&#31867;&#65292;&#24182;&#25506;&#35752;&#20102;&#21521;&#37327;&#25968;&#25454;&#24211;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32467;&#21512;&#24102;&#26469;&#30340;&#26032;&#26426;&#36935;&#12290;</title><link>http://arxiv.org/abs/2310.11703</link><description>&lt;p&gt;
&#23545;&#21521;&#37327;&#25968;&#25454;&#24211;&#30340;&#20840;&#38754;&#35843;&#26597;&#65306;&#23384;&#20648;&#21644;&#26816;&#32034;&#25216;&#26415;&#65292;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
A Comprehensive Survey on Vector Database: Storage and Retrieval Technique, Challenge. (arXiv:2310.11703v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11703
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#23545;&#21521;&#37327;&#25968;&#25454;&#24211;&#36827;&#34892;&#20102;&#20840;&#38754;&#35843;&#26597;&#65292;&#20171;&#32461;&#20102;&#23384;&#20648;&#21644;&#26816;&#32034;&#25216;&#26415;&#20197;&#21450;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#23545;&#35299;&#20915;&#36817;&#20284;&#26368;&#36817;&#37051;&#25628;&#32034;&#38382;&#39064;&#30340;&#19981;&#21516;&#26041;&#27861;&#36827;&#34892;&#20102;&#20998;&#31867;&#65292;&#24182;&#25506;&#35752;&#20102;&#21521;&#37327;&#25968;&#25454;&#24211;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32467;&#21512;&#24102;&#26469;&#30340;&#26032;&#26426;&#36935;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21521;&#37327;&#25968;&#25454;&#24211;&#29992;&#20110;&#23384;&#20648;&#26080;&#27861;&#29992;&#20256;&#32479;&#30340;DBMS&#26469;&#25551;&#36848;&#30340;&#39640;&#32500;&#25968;&#25454;&#12290;&#34429;&#28982;&#30446;&#21069;&#23545;&#29616;&#26377;&#30340;&#21521;&#37327;&#25968;&#25454;&#24211;&#26550;&#26500;&#30340;&#25551;&#36848;&#25110;&#26032;&#30340;&#24341;&#20837;&#30340;&#25991;&#31456;&#24182;&#19981;&#22810;&#65292;&#20294;&#36817;&#20284;&#26368;&#36817;&#37051;&#25628;&#32034;&#38382;&#39064;&#22312;&#21521;&#37327;&#25968;&#25454;&#24211;&#32972;&#21518;&#24050;&#32463;&#34987;&#38271;&#26102;&#38388;&#30740;&#31350;&#65292;&#30456;&#20851;&#30340;&#31639;&#27861;&#25991;&#31456;&#22312;&#25991;&#29486;&#20013;&#21487;&#20197;&#25214;&#21040;&#30456;&#24403;&#22810;&#12290;&#26412;&#25991;&#35797;&#22270;&#20840;&#38754;&#22238;&#39038;&#30456;&#20851;&#31639;&#27861;&#65292;&#20197;&#25552;&#20379;&#23545;&#36825;&#19968;&#34028;&#21187;&#21457;&#23637;&#30340;&#30740;&#31350;&#39046;&#22495;&#30340;&#26222;&#36941;&#29702;&#35299;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#23558;&#36825;&#20123;&#30740;&#31350;&#20998;&#20026;&#22522;&#20110;&#21704;&#24076;&#12289;&#22522;&#20110;&#26641;&#12289;&#22522;&#20110;&#22270;&#12289;&#21644;&#22522;&#20110;&#37327;&#21270;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36817;&#20284;&#26368;&#36817;&#37051;&#25628;&#32034;&#38382;&#39064;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#21521;&#37327;&#25968;&#25454;&#24211;&#38754;&#20020;&#30340;&#29616;&#26377;&#25361;&#25112;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#21521;&#37327;&#25968;&#25454;&#24211;&#22914;&#20309;&#32467;&#21512;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#25552;&#20379;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
A vector database is used to store high-dimensional data that cannot be characterized by traditional DBMS. Although there are not many articles describing existing or introducing new vector database architectures, the approximate nearest neighbor search problem behind vector databases has been studied for a long time, and considerable related algorithmic articles can be found in the literature. This article attempts to comprehensively review relevant algorithms to provide a general understanding of this booming research area. The basis of our framework categorises these studies by the approach of solving ANNS problem, respectively hash-based, tree-based, graph-based and quantization-based approaches. Then we present an overview of existing challenges for vector databases. Lastly, we sketch how vector databases can be combined with large language models and provide new possibilities.
&lt;/p&gt;</description></item></channel></rss>