<rss version="2.0"><channel><title>Chat Arxiv cs.DM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DM</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;WL&#27979;&#35797;&#22312;&#28857;&#20113;&#20013;&#30340;&#24212;&#29992;&#65292;&#32467;&#26524;&#21457;&#29616;&#19977;&#27425;&#36845;&#20195;&#30340;$(d-1)$-WL&#27979;&#35797;&#21487;&#20197;&#21306;&#20998;$d$&#32500;&#27431;&#20960;&#37324;&#24471;&#31354;&#38388;&#20013;&#30340;&#28857;&#20113;&#65292;&#19988;&#21482;&#38656;&#35201;&#19968;&#27425;&#36845;&#20195;&#30340;$d$-WL&#27979;&#35797;&#23601;&#21487;&#20197;&#36798;&#21040;&#23436;&#25972;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.12853</link><description>&lt;p&gt;
&#19977;&#27425;&#36845;&#20195;&#30340;$(1-d)$-WL&#27979;&#35797;&#21487;&#20197;&#21306;&#20998;$d$&#32500;&#28857;&#20113;&#30340;&#38750;&#31561;&#36317;&#21464;&#25442;. (arXiv:2303.12853v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
Three iterations of $(1-d)$-WL test distinguish non isometric clouds of $d$-dimensional points. (arXiv:2303.12853v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12853
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;WL&#27979;&#35797;&#22312;&#28857;&#20113;&#20013;&#30340;&#24212;&#29992;&#65292;&#32467;&#26524;&#21457;&#29616;&#19977;&#27425;&#36845;&#20195;&#30340;$(d-1)$-WL&#27979;&#35797;&#21487;&#20197;&#21306;&#20998;$d$&#32500;&#27431;&#20960;&#37324;&#24471;&#31354;&#38388;&#20013;&#30340;&#28857;&#20113;&#65292;&#19988;&#21482;&#38656;&#35201;&#19968;&#27425;&#36845;&#20195;&#30340;$d$-WL&#27979;&#35797;&#23601;&#21487;&#20197;&#36798;&#21040;&#23436;&#25972;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Weisfeiler-Lehman (WL)&#27979;&#35797;&#26159;&#19968;&#20010;&#26816;&#26597;&#22270;&#21516;&#26500;&#30340;&#22522;&#26412;&#36845;&#20195;&#31639;&#27861;&#12290;&#23427;&#34987;&#35266;&#23519;&#21040;&#26159;&#20960;&#31181;&#22270;&#31070;&#32463;&#32593;&#32476;&#20307;&#31995;&#32467;&#26500;&#35774;&#35745;&#30340;&#22522;&#30784;&#65292;&#36825;&#20123;&#32593;&#32476;&#30340;&#33021;&#21147;&#21644;&#24615;&#33021;&#21487;&#20197;&#29992;&#36825;&#20010;&#27979;&#35797;&#30340;&#34920;&#31034;&#33021;&#21147;&#26469;&#29702;&#35299;&#12290;&#21463;&#26368;&#36817;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20110;&#28041;&#21450;&#19977;&#32500;&#29289;&#20307;&#30340;&#25968;&#25454;&#38598;&#30340;&#21457;&#23637;&#21551;&#21457;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#24403;WL&#27979;&#35797;&#23545;&#23436;&#25972;&#30340;&#36317;&#31163;&#22270;&#34920;&#31034;&#30340;&#27431;&#20960;&#37324;&#24471;&#28857;&#20113;&#26159;&#8220;&#23436;&#25972;&#30340;&#8221;&#26102;&#65292;&#23427;&#20309;&#26102;&#33021;&#22815;&#35782;&#21035;&#20986;&#20219;&#24847;&#19968;&#20010;&#20219;&#24847;&#28857;&#20113;.&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#65292;$(d-1)$-&#32500;WL&#27979;&#35797;&#21487;&#20197;&#21306;&#20998;$d$&#32500;&#27431;&#20960;&#37324;&#24471;&#31354;&#38388;&#20013;&#30340;&#28857;&#20113;&#65292;&#20219;&#20309;$d\ge 2$&#37117;&#21487;&#20197;&#65292;&#32780;&#19988;&#21482;&#38656;&#35201;&#36827;&#34892;&#19977;&#27425;&#27979;&#35797;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#23545;&#20110;$d=2,3$&#26159;&#32039;&#30340;&#12290;&#25105;&#20204;&#36824;&#35266;&#23519;&#21040;$d$&#32500;WL&#27979;&#35797;&#21482;&#38656;&#35201;&#36827;&#34892;&#19968;&#27425;&#36845;&#20195;&#23601;&#21487;&#20197;&#36798;&#21040;&#23436;&#25972;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Weisfeiler--Lehman (WL) test is a fundamental iterative algorithm for checking isomorphism of graphs. It has also been observed that it underlies the design of several graph neural network architectures, whose capabilities and performance can be understood in terms of the expressive power of this test. Motivated by recent developments in machine learning applications to datasets involving three-dimensional objects, we study when the WL test is {\em complete} for clouds of euclidean points represented by complete distance graphs, i.e., when it can distinguish, up to isometry, any arbitrary such cloud.  Our main result states that the $(d-1)$-dimensional WL test is complete for point clouds in $d$-dimensional Euclidean space, for any $d\ge 2$, and that only three iterations of the test suffice. Our result is tight for $d = 2, 3$. We also observe that the $d$-dimensional WL test only requires one iteration to achieve completeness.
&lt;/p&gt;</description></item></channel></rss>