<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>FedMFS&#26159;&#19968;&#31181;&#26032;&#30340;&#22810;&#27169;&#24577;&#34701;&#21512;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#36873;&#25321;&#24615;&#27169;&#24577;&#36890;&#20449;&#35299;&#20915;&#20102;&#32570;&#20047;&#29305;&#23450;&#27169;&#24577;&#30340;&#24322;&#26500;&#23458;&#25143;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#26368;&#20248;&#30340;&#27169;&#24577;&#19978;&#20256;&#31574;&#30053;&#20197;&#25552;&#39640;&#23398;&#20064;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.07048</link><description>&lt;p&gt;
FedMFS: &#36873;&#25321;&#24615;&#27169;&#24577;&#36890;&#20449;&#30340;&#32852;&#37030;&#22810;&#27169;&#24577;&#34701;&#21512;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
FedMFS: Federated Multimodal Fusion Learning with Selective Modality Communication. (arXiv:2310.07048v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07048
&lt;/p&gt;
&lt;p&gt;
FedMFS&#26159;&#19968;&#31181;&#26032;&#30340;&#22810;&#27169;&#24577;&#34701;&#21512;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#36873;&#25321;&#24615;&#27169;&#24577;&#36890;&#20449;&#35299;&#20915;&#20102;&#32570;&#20047;&#29305;&#23450;&#27169;&#24577;&#30340;&#24322;&#26500;&#23458;&#25143;&#38382;&#39064;&#65292;&#24182;&#35774;&#35745;&#20102;&#26368;&#20248;&#30340;&#27169;&#24577;&#19978;&#20256;&#31574;&#30053;&#20197;&#25552;&#39640;&#23398;&#20064;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#26159;&#19968;&#31181;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#33539;&#24335;&#65292;&#36890;&#36807;&#20165;&#20849;&#20139;&#27169;&#22411;&#21442;&#25968;&#32780;&#19981;&#35775;&#38382;&#12289;&#20405;&#29359;&#25110;&#27844;&#38706;&#21407;&#22987;&#29992;&#25143;&#25968;&#25454;&#65292;&#20351;&#23458;&#25143;&#33021;&#22815;&#21512;&#20316;&#12290;&#22312;&#29289;&#32852;&#32593;&#20013;&#65292;&#36793;&#32536;&#35774;&#22791;&#36234;&#26469;&#36234;&#22810;&#22320;&#21033;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#32452;&#21512;&#21644;&#34701;&#21512;&#33539;&#24335;&#26469;&#25552;&#39640;&#27169;&#22411;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#22312;&#32852;&#37030;&#23398;&#20064;&#24212;&#29992;&#20013;&#65292;&#20173;&#28982;&#23384;&#22312;&#20004;&#20010;&#20027;&#35201;&#25361;&#25112;&#65306;&#65288;&#19968;&#65289;&#35299;&#20915;&#30001;&#20110;&#32570;&#20047;&#29305;&#23450;&#27169;&#24577;&#30340;&#24322;&#26500;&#23458;&#25143;&#24341;&#36215;&#30340;&#38382;&#39064;&#65307;&#65288;&#20108;&#65289;&#35774;&#35745;&#19968;&#31181;&#26368;&#20248;&#30340;&#27169;&#24577;&#19978;&#20256;&#31574;&#30053;&#65292;&#20197;&#26368;&#23567;&#21270;&#36890;&#20449;&#24320;&#38144;&#21516;&#26102;&#26368;&#22823;&#21270;&#23398;&#20064;&#24615;&#33021;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#27169;&#24577;&#34701;&#21512;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#21517;&#20026;FedMFS&#65292;&#21487;&#20197;&#35299;&#20915;&#19978;&#36848;&#25361;&#25112;&#12290;&#20851;&#38190;&#24605;&#24819;&#26159;&#21033;&#29992;Shapley&#20540;&#26469;&#37327;&#21270;&#27599;&#20010;&#27169;&#24577;&#30340;&#36129;&#29486;&#21644;&#27169;&#24577;&#27169;&#22411;&#22823;&#23567;&#26469;&#34913;&#37327;&#36890;&#20449;&#24320;&#38144;&#65292;&#20197;&#20415;&#27599;&#20010;&#23458;&#25143;&#31471;&#21487;&#20197;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated learning (FL) is a distributed machine learning (ML) paradigm that enables clients to collaborate without accessing, infringing upon, or leaking original user data by sharing only model parameters. In the Internet of Things (IoT), edge devices are increasingly leveraging multimodal data compositions and fusion paradigms to enhance model performance. However, in FL applications, two main challenges remain open: (i) addressing the issues caused by heterogeneous clients lacking specific modalities and (ii) devising an optimal modality upload strategy to minimize communication overhead while maximizing learning performance. In this paper, we propose Federated Multimodal Fusion learning with Selective modality communication (FedMFS), a new multimodal fusion FL methodology that can tackle the above mentioned challenges. The key idea is to utilize Shapley values to quantify each modality's contribution and modality model size to gauge communication overhead, so that each client can 
&lt;/p&gt;</description></item></channel></rss>