<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>Arukikata&#26053;&#28216;&#28216;&#35760;&#25968;&#25454;&#38598;&#26159;&#19968;&#20010;&#21253;&#21547;&#36229;&#36807;3100&#19975;&#20010;&#26085;&#25991;&#21333;&#35789;&#30340;&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;4672&#20010;&#26085;&#26412;&#22269;&#20869;&#28216;&#35760;&#21644;9607&#20010;&#28023;&#22806;&#28216;&#35760;&#65292;&#20026;&#30740;&#31350;&#20154;&#21592;&#25552;&#20379;&#20102;&#21487;&#37325;&#22797;&#21644;&#36879;&#26126;&#30340;&#30740;&#31350;&#25968;&#25454;&#12290;</title><link>http://arxiv.org/abs/2305.11444</link><description>&lt;p&gt;
Arukikata&#26053;&#28216;&#28216;&#35760;&#25968;&#25454;&#38598; (arXiv:2305.11444v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
Arukikata Travelogue Dataset. (arXiv:2305.11444v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11444
&lt;/p&gt;
&lt;p&gt;
Arukikata&#26053;&#28216;&#28216;&#35760;&#25968;&#25454;&#38598;&#26159;&#19968;&#20010;&#21253;&#21547;&#36229;&#36807;3100&#19975;&#20010;&#26085;&#25991;&#21333;&#35789;&#30340;&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;4672&#20010;&#26085;&#26412;&#22269;&#20869;&#28216;&#35760;&#21644;9607&#20010;&#28023;&#22806;&#28216;&#35760;&#65292;&#20026;&#30740;&#31350;&#20154;&#21592;&#25552;&#20379;&#20102;&#21487;&#37325;&#22797;&#21644;&#36879;&#26126;&#30340;&#30740;&#31350;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21019;&#24314;&#20102;Arukikata&#26053;&#28216;&#28216;&#35760;&#25968;&#25454;&#38598;&#65292;&#24182;&#20813;&#36153;&#25552;&#20379;&#32473;&#23398;&#26415;&#30740;&#31350;&#20351;&#29992;&#12290;&#35813;&#25968;&#25454;&#38598;&#21253;&#21547;&#36229;&#36807;3100&#19975;&#20010;&#26085;&#25991;&#21333;&#35789;&#65292;&#21253;&#25324;4672&#20010;&#26085;&#26412;&#22269;&#20869;&#28216;&#35760;&#21644;9607&#20010;&#28023;&#22806;&#28216;&#35760;&#12290;&#22312;&#25105;&#20204;&#25552;&#20379;&#25968;&#25454;&#38598;&#20043;&#21069;&#65292;&#24456;&#38590;&#33719;&#24471;&#21487;&#29992;&#20110;&#30740;&#31350;&#30340;&#24191;&#27867;&#26053;&#28216;&#28216;&#35760;&#25968;&#25454;&#65292;&#27599;&#20010;&#30740;&#31350;&#20154;&#21592;&#37117;&#24517;&#39035;&#20934;&#22791;&#33258;&#24049;&#30340;&#25968;&#25454;&#12290;&#36825;&#38459;&#30861;&#20102;&#23545;&#29616;&#26377;&#30740;&#31350;&#30340;&#22797;&#21046;&#20197;&#21450;&#23545;&#23454;&#39564;&#32467;&#26524;&#36827;&#34892;&#20844;&#27491;&#27604;&#36739;&#20998;&#26512;&#12290;&#25105;&#20204;&#30340;&#25968;&#25454;&#38598;&#20351;&#24471;&#20219;&#20309;&#30740;&#31350;&#20154;&#21592;&#37117;&#21487;&#20197;&#23545;&#30456;&#21516;&#30340;&#25968;&#25454;&#36827;&#34892;&#30740;&#31350;&#65292;&#24182;&#30830;&#20445;&#30740;&#31350;&#30340;&#36879;&#26126;&#24230;&#21644;&#21487;&#37325;&#22797;&#24615;&#12290; &#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#25105;&#20204;&#30340;&#25968;&#25454;&#38598;&#30340;&#23398;&#26415;&#24847;&#20041;&#12289;&#29305;&#28857;&#21644;&#21069;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;
We have constructed Arukikata Travelogue Dataset and released it free of charge for academic research. This dataset is a Japanese text dataset with a total of over 31 million words, comprising 4,672 Japanese domestic travelogues and 9,607 overseas travelogues. Before providing our dataset, there was a scarcity of widely available travelogue data for research purposes, and each researcher had to prepare their own data. This hinders the replication of existing studies and fair comparative analysis of experimental results. Our dataset enables any researchers to conduct investigation on the same data and to ensure transparency and reproducibility in research. In this paper, we describe the academic significance, characteristics, and prospects of our dataset.
&lt;/p&gt;</description></item></channel></rss>