<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>Unifews&#36890;&#36807;&#32479;&#19968;&#36880;&#26465;&#31232;&#30095;&#21270;&#30340;&#26041;&#24335;&#65292;&#32852;&#21512;&#36793;&#26435;&#37325;&#31232;&#30095;&#21270;&#20197;&#25552;&#39640;&#23398;&#20064;&#25928;&#29575;&#65292;&#36866;&#29992;&#20110;&#19981;&#21516;&#26550;&#26500;&#35774;&#35745;&#24182;&#20855;&#26377;&#36880;&#28176;&#22686;&#21152;&#31232;&#30095;&#24230;&#30340;&#33258;&#36866;&#24212;&#21387;&#32553;&#12290;</title><link>https://arxiv.org/abs/2403.13268</link><description>&lt;p&gt;
Unifews&#65306;&#29992;&#20110;&#39640;&#25928;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#32479;&#19968;&#36880;&#26465;&#31232;&#30095;&#21270;
&lt;/p&gt;
&lt;p&gt;
Unifews: Unified Entry-Wise Sparsification for Efficient Graph Neural Network
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13268
&lt;/p&gt;
&lt;p&gt;
Unifews&#36890;&#36807;&#32479;&#19968;&#36880;&#26465;&#31232;&#30095;&#21270;&#30340;&#26041;&#24335;&#65292;&#32852;&#21512;&#36793;&#26435;&#37325;&#31232;&#30095;&#21270;&#20197;&#25552;&#39640;&#23398;&#20064;&#25928;&#29575;&#65292;&#36866;&#29992;&#20110;&#19981;&#21516;&#26550;&#26500;&#35774;&#35745;&#24182;&#20855;&#26377;&#36880;&#28176;&#22686;&#21152;&#31232;&#30095;&#24230;&#30340;&#33258;&#36866;&#24212;&#21387;&#32553;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#22312;&#21508;&#31181;&#22270;&#23398;&#20064;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#20102;&#26377;&#24076;&#26395;&#30340;&#24615;&#33021;&#65292;&#20294;&#20195;&#20215;&#26159;&#36164;&#28304;&#23494;&#38598;&#22411;&#30340;&#35745;&#31639;&#12290;GNN&#26356;&#26032;&#30340;&#20027;&#35201;&#24320;&#38144;&#26469;&#33258;&#22270;&#20256;&#25773;&#21644;&#26435;&#37325;&#21464;&#25442;&#65292;&#20004;&#32773;&#37117;&#28041;&#21450;&#23545;&#22270;&#35268;&#27169;&#30697;&#38453;&#30340;&#25805;&#20316;&#12290;&#20808;&#21069;&#30340;&#30740;&#31350;&#23581;&#35797;&#36890;&#36807;&#21033;&#29992;&#22270;&#32423;&#21035;&#25110;&#32593;&#32476;&#32423;&#21035;&#30340;&#31232;&#30095;&#21270;&#25216;&#26415;&#26469;&#20943;&#23569;&#35745;&#31639;&#39044;&#31639;&#65292;&#20174;&#32780;&#20135;&#29983;&#32553;&#23567;&#30340;&#22270;&#25110;&#26435;&#37325;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Unifews&#65292;&#23427;&#20197;&#36880;&#20010;&#30697;&#38453;&#20803;&#32032;&#30340;&#26041;&#24335;&#32479;&#19968;&#20102;&#36825;&#20004;&#31181;&#25805;&#20316;&#65292;&#24182;&#36827;&#34892;&#32852;&#21512;&#36793;&#26435;&#37325;&#31232;&#30095;&#21270;&#20197;&#22686;&#24378;&#23398;&#20064;&#25928;&#29575;&#12290;Unifews&#30340;&#36880;&#26465;&#35774;&#35745;&#20351;&#20854;&#33021;&#22815;&#22312;GNN&#23618;&#20043;&#38388;&#36827;&#34892;&#33258;&#36866;&#24212;&#21387;&#32553;&#65292;&#31232;&#30095;&#24230;&#36880;&#28176;&#22686;&#21152;&#65292;&#24182;&#36866;&#29992;&#20110;&#21508;&#31181;&#26550;&#26500;&#35774;&#35745;&#65292;&#20855;&#26377;&#21363;&#26102;&#25805;&#20316;&#31616;&#21270;&#12290;&#22312;&#29702;&#35770;&#19978;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#26469;&#34920;&#24449;&#31232;&#30095;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13268v1 Announce Type: new  Abstract: Graph Neural Networks (GNNs) have shown promising performance in various graph learning tasks, but at the cost of resource-intensive computations. The primary overhead of GNN update stems from graph propagation and weight transformation, both involving operations on graph-scale matrices. Previous studies attempt to reduce the computational budget by leveraging graph-level or network-level sparsification techniques, resulting in downsized graph or weights. In this work, we propose Unifews, which unifies the two operations in an entry-wise manner considering individual matrix elements, and conducts joint edge-weight sparsification to enhance learning efficiency. The entry-wise design of Unifews enables adaptive compression across GNN layers with progressively increased sparsity, and is applicable to a variety of architectural designs with on-the-fly operation simplification. Theoretically, we establish a novel framework to characterize spa
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#24341;&#20837;&#32467;&#26500;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#32467;&#26500;&#24341;&#23548;&#30340;SQL&#29983;&#25104;&#27169;&#22411;&#65292;&#20197;&#25913;&#21892;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;SQL&#30340;&#20934;&#30830;&#24615;&#21644;&#21487;&#25191;&#34892;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.13284</link><description>&lt;p&gt;
&#32467;&#26500;&#24341;&#23548;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29992;&#20110;SQL&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Structure Guided Large Language Model for SQL Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13284
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#24341;&#20837;&#32467;&#26500;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#32467;&#26500;&#24341;&#23548;&#30340;SQL&#29983;&#25104;&#27169;&#22411;&#65292;&#20197;&#25913;&#21892;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;SQL&#30340;&#20934;&#30830;&#24615;&#21644;&#21487;&#25191;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20934;&#30830;&#30340;&#32467;&#26500;&#21270;&#26597;&#35810;&#35821;&#35328;&#65288;SQL&#65289;&#26159;&#19968;&#20010;&#38271;&#26399;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22312;&#23558;&#29992;&#25143;&#30340;&#35821;&#20041;&#26597;&#35810;&#19982;&#32467;&#26500;&#21270;&#25968;&#25454;&#24211;&#21305;&#37197;&#65292;&#28982;&#21518;&#29983;&#25104;&#32467;&#26500;&#21270;SQL&#26041;&#38754;&#12290;&#29616;&#26377;&#27169;&#22411;&#36890;&#24120;&#23558;&#26597;&#35810;&#21644;&#25968;&#25454;&#24211;&#27169;&#24335;&#36755;&#20837;&#21040;LLM&#20013;&#65292;&#24182;&#20381;&#36182;LLM&#25191;&#34892;&#35821;&#20041;-&#32467;&#26500;&#21305;&#37197;&#24182;&#29983;&#25104;&#32467;&#26500;&#21270;SQL&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#35299;&#20915;&#26041;&#26696;&#24573;&#30053;&#20102;&#29992;&#25143;&#26597;&#35810;&#21644;&#25968;&#25454;&#24211;&#20013;&#30340;&#32467;&#26500;&#20449;&#24687;&#65292;&#32780;&#36825;&#20123;&#20449;&#24687;&#21487;&#20197;&#29992;&#26469;&#22686;&#24378;&#32467;&#26500;&#21270;SQL&#30340;&#29983;&#25104;&#12290;&#36825;&#19968;&#30095;&#24573;&#21487;&#33021;&#23548;&#33268;&#19981;&#20934;&#30830;&#25110;&#26080;&#27861;&#25191;&#34892;&#30340;SQL&#29983;&#25104;&#12290;&#20026;&#20102;&#20805;&#20998;&#21033;&#29992;&#32467;&#26500;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32467;&#26500;&#21040;SQL&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#22266;&#26377;&#30340;&#32467;&#26500;&#20449;&#24687;&#26469;&#25913;&#21892;LLM&#30340;SQL&#29983;&#25104;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#25105;&#20204;&#30340;&#32467;&#26500;&#24341;&#23548;SQL&#65288;SGU-SQL&#65289;&#29983;&#25104;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13284v1 Announce Type: cross  Abstract: Generating accurate Structured Querying Language (SQL) is a long-standing problem, especially in matching users' semantic queries with structured databases and then generating structured SQL. Existing models typically input queries and database schemas into the LLM and rely on the LLM to perform semantic-structure matching and generate structured SQL. However, such solutions overlook the structural information within user queries and databases, which can be utilized to enhance the generation of structured SQL. This oversight can lead to inaccurate or unexecutable SQL generation. To fully exploit the structure, we propose a structure-to-SQL framework, which leverages the inherent structure information to improve the SQL generation of LLMs. Specifically, we introduce our Structure Guided SQL~(SGU-SQL) generation model. SGU-SQL first links user queries and databases in a structure-enhanced manner. It then decomposes complicated linked str
&lt;/p&gt;</description></item></channel></rss>