<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>cedar&#26159;&#19968;&#20010;&#32534;&#31243;&#27169;&#22411;&#21644;&#26694;&#26550;&#65292;&#21487;&#20197;&#36731;&#26494;&#26500;&#24314;&#12289;&#20248;&#21270;&#21644;&#25191;&#34892;&#26426;&#22120;&#23398;&#20064;&#36755;&#20837;&#25968;&#25454;&#31649;&#36947;&#12290;&#23427;&#25552;&#20379;&#20102;&#26131;&#20110;&#20351;&#29992;&#30340;&#32534;&#31243;&#25509;&#21475;&#21644;&#21487;&#32452;&#21512;&#36816;&#31639;&#31526;&#65292;&#25903;&#25345;&#20219;&#24847;ML&#26694;&#26550;&#21644;&#24211;&#12290;&#36890;&#36807;&#35299;&#20915;&#24403;&#21069;&#36755;&#20837;&#25968;&#25454;&#31995;&#32479;&#26080;&#27861;&#20805;&#20998;&#21033;&#29992;&#24615;&#33021;&#20248;&#21270;&#30340;&#38382;&#39064;&#65292;cedar&#25552;&#39640;&#20102;&#36164;&#28304;&#21033;&#29992;&#25928;&#29575;&#65292;&#28385;&#36275;&#20102;&#24222;&#22823;&#25968;&#25454;&#37327;&#21644;&#39640;&#35757;&#32451;&#21534;&#21520;&#37327;&#30340;&#38656;&#27714;&#12290;</title><link>http://arxiv.org/abs/2401.08895</link><description>&lt;p&gt;
cedar&#65306;&#21487;&#32452;&#21512;&#21644;&#20248;&#21270;&#30340;&#26426;&#22120;&#23398;&#20064;&#36755;&#20837;&#25968;&#25454;&#31649;&#36947;
&lt;/p&gt;
&lt;p&gt;
cedar: Composable and Optimized Machine Learning Input Data Pipelines. (arXiv:2401.08895v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08895
&lt;/p&gt;
&lt;p&gt;
cedar&#26159;&#19968;&#20010;&#32534;&#31243;&#27169;&#22411;&#21644;&#26694;&#26550;&#65292;&#21487;&#20197;&#36731;&#26494;&#26500;&#24314;&#12289;&#20248;&#21270;&#21644;&#25191;&#34892;&#26426;&#22120;&#23398;&#20064;&#36755;&#20837;&#25968;&#25454;&#31649;&#36947;&#12290;&#23427;&#25552;&#20379;&#20102;&#26131;&#20110;&#20351;&#29992;&#30340;&#32534;&#31243;&#25509;&#21475;&#21644;&#21487;&#32452;&#21512;&#36816;&#31639;&#31526;&#65292;&#25903;&#25345;&#20219;&#24847;ML&#26694;&#26550;&#21644;&#24211;&#12290;&#36890;&#36807;&#35299;&#20915;&#24403;&#21069;&#36755;&#20837;&#25968;&#25454;&#31995;&#32479;&#26080;&#27861;&#20805;&#20998;&#21033;&#29992;&#24615;&#33021;&#20248;&#21270;&#30340;&#38382;&#39064;&#65292;cedar&#25552;&#39640;&#20102;&#36164;&#28304;&#21033;&#29992;&#25928;&#29575;&#65292;&#28385;&#36275;&#20102;&#24222;&#22823;&#25968;&#25454;&#37327;&#21644;&#39640;&#35757;&#32451;&#21534;&#21520;&#37327;&#30340;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36755;&#20837;&#25968;&#25454;&#31649;&#36947;&#26159;&#27599;&#20010;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#35757;&#32451;&#20219;&#21153;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#23427;&#36127;&#36131;&#35835;&#21462;&#22823;&#37327;&#30340;&#35757;&#32451;&#25968;&#25454;&#65292;&#20351;&#29992;&#22797;&#26434;&#30340;&#21464;&#25442;&#22788;&#29702;&#26679;&#26412;&#25209;&#27425;&#65292;&#24182;&#20197;&#20302;&#24310;&#36831;&#21644;&#39640;&#21534;&#21520;&#37327;&#23558;&#20854;&#21152;&#36733;&#21040;&#35757;&#32451;&#33410;&#28857;&#19978;&#12290;&#39640;&#24615;&#33021;&#30340;&#36755;&#20837;&#25968;&#25454;&#31995;&#32479;&#21464;&#24471;&#36234;&#26469;&#36234;&#20851;&#38190;&#65292;&#21407;&#22240;&#26159;&#25968;&#25454;&#37327;&#24613;&#21095;&#22686;&#21152;&#21644;&#35757;&#32451;&#21534;&#21520;&#37327;&#30340;&#35201;&#27714;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#36755;&#20837;&#25968;&#25454;&#31995;&#32479;&#26080;&#27861;&#20805;&#20998;&#21033;&#29992;&#20851;&#38190;&#30340;&#24615;&#33021;&#20248;&#21270;&#65292;&#23548;&#33268;&#36164;&#28304;&#21033;&#29992;&#25928;&#29575;&#26497;&#20302;&#30340;&#22522;&#30784;&#35774;&#26045;&#65292;&#25110;&#32773;&#26356;&#31967;&#31957;&#22320;&#65292;&#28010;&#36153;&#26114;&#36149;&#30340;&#21152;&#36895;&#22120;&#12290;&#20026;&#20102;&#28385;&#36275;&#36825;&#20123;&#38656;&#27714;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;cedar&#65292;&#19968;&#20010;&#32534;&#31243;&#27169;&#22411;&#21644;&#26694;&#26550;&#65292;&#20801;&#35768;&#29992;&#25143;&#36731;&#26494;&#26500;&#24314;&#12289;&#20248;&#21270;&#21644;&#25191;&#34892;&#36755;&#20837;&#25968;&#25454;&#31649;&#36947;&#12290;cedar&#25552;&#20379;&#20102;&#26131;&#20110;&#20351;&#29992;&#30340;&#32534;&#31243;&#25509;&#21475;&#65292;&#20801;&#35768;&#29992;&#25143;&#20351;&#29992;&#21487;&#32452;&#21512;&#36816;&#31639;&#31526;&#26469;&#23450;&#20041;&#25903;&#25345;&#20219;&#24847;ML&#26694;&#26550;&#21644;&#24211;&#30340;&#36755;&#20837;&#25968;&#25454;&#31649;&#36947;&#12290;
&lt;/p&gt;
&lt;p&gt;
The input data pipeline is an essential component of each machine learning (ML) training job. It is responsible for reading massive amounts of training data, processing batches of samples using complex of transformations, and loading them onto training nodes at low latency and high throughput. Performant input data systems are becoming increasingly critical, driven by skyrocketing data volumes and training throughput demands. Unfortunately, current input data systems cannot fully leverage key performance optimizations, resulting in hugely inefficient infrastructures that require significant resources -- or worse -- underutilize expensive accelerators.  To address these demands, we present cedar, a programming model and framework that allows users to easily build, optimize, and execute input data pipelines. cedar presents an easy-to-use programming interface, allowing users to define input data pipelines using composable operators that support arbitrary ML frameworks and libraries. Mean
&lt;/p&gt;</description></item></channel></rss>