<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#36825;&#39033;&#22269;&#38469;&#36328;&#23398;&#31185;&#35843;&#26597;&#21457;&#29616;&#65292;&#20316;&#32773;&#32626;&#21517;&#30340;&#20914;&#31361;&#38382;&#39064;&#38750;&#24120;&#26222;&#36941;&#65292;&#24182;&#19988;&#24448;&#24448;&#22312;&#23398;&#32773;&#30340;&#32844;&#19994;&#29983;&#28079;&#26089;&#26399;&#23601;&#24320;&#22987;&#20986;&#29616;&#12290;</title><link>http://arxiv.org/abs/2303.00386</link><description>&lt;p&gt;
&#23398;&#26415;&#30028;&#30340;&#20316;&#32773;&#20914;&#31361;&#65306;&#19968;&#39033;&#22269;&#38469;&#36328;&#23398;&#31185;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Authorship Conflicts in Academia: an International Cross-Discipline Survey. (arXiv:2303.00386v2 [cs.DL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.00386
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#22269;&#38469;&#36328;&#23398;&#31185;&#35843;&#26597;&#21457;&#29616;&#65292;&#20316;&#32773;&#32626;&#21517;&#30340;&#20914;&#31361;&#38382;&#39064;&#38750;&#24120;&#26222;&#36941;&#65292;&#24182;&#19988;&#24448;&#24448;&#22312;&#23398;&#32773;&#30340;&#32844;&#19994;&#29983;&#28079;&#26089;&#26399;&#23601;&#24320;&#22987;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#32773;&#38388;&#30340;&#21512;&#20316;&#24050;&#25104;&#20026;&#24403;&#20195;&#31185;&#23398;&#30340;&#37325;&#35201;&#29305;&#24449;&#65292;&#22240;&#27492;&#22312;&#20986;&#29256;&#29289;&#20013;&#21015;&#20986;&#30340;&#20316;&#32773;&#25968;&#37327;&#19981;&#26029;&#19978;&#21319;&#12290;&#28982;&#32780;&#65292;&#30830;&#23450;&#24212;&#35813;&#21253;&#25324;&#21738;&#20123;&#20316;&#32773;&#20197;&#21450;&#20182;&#20204;&#30340;&#39034;&#24207;&#28041;&#21450;&#22810;&#31181;&#22256;&#38590;&#65292;&#24448;&#24448;&#20250;&#23548;&#33268;&#20914;&#31361;&#12290;&#23613;&#31649;&#20851;&#20110;&#23398;&#26415;&#20914;&#31361;&#30340;&#22823;&#37327;&#25991;&#29486;&#65292;&#20294;&#23427;&#22312;&#20027;&#35201;&#31038;&#20250;&#20154;&#21475;&#23398;&#29305;&#24449;&#20197;&#21450;&#23398;&#26415;&#30028;&#32463;&#21382;&#30340;&#19981;&#21516;&#31867;&#22411;&#30340;&#20132;&#20114;&#26041;&#38754;&#30340;&#20998;&#24067;&#20173;&#19981;&#28165;&#26970;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#22269;&#38469;&#36328;&#23398;&#31185;&#35843;&#26597;&#65292;&#21463;&#21040;&#20102;&#26469;&#33258;41&#20010;&#30740;&#31350;&#39046;&#22495;&#21644;93&#20010;&#22269;&#23478;&#30340;752&#21517;&#23398;&#32773;&#30340;&#32479;&#35745;&#23398;&#20195;&#34920;&#25972;&#20307;&#23398;&#26415;&#21171;&#21160;&#21147;&#30340;&#22238;&#31572;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20196;&#20154;&#25285;&#24551;&#65292;&#34920;&#26126;&#20316;&#32773;&#32626;&#21517;&#20914;&#31361;&#22312;&#19968;&#20010;&#20154;&#30340;&#23398;&#26415;&#29983;&#28079;&#26089;&#26399;&#21363;&#20135;&#29983;&#65292;&#29978;&#33267;&#22312;&#30805;&#22763;&#21644;&#21338;&#22763;&#27700;&#24179;&#19978;&#23601;&#26222;&#36941;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Collaboration among scholars has emerged as a significant characteristic of contemporary science. As a result, the number of authors listed in publications continues to rise steadily. Unfortunately, determining the authors to be included in the byline and their respective order entails multiple difficulties which often lead to conflicts. Despite the large volume of literature about conflicts in academia, it remains unclear how exactly it is distributed over the main socio-demographic properties, as well as the different types of interactions academics experience. To address this gap, we conducted an international and cross-disciplinary survey answered by 752 academics from 41 fields of research and 93 countries that statistically well-represent the overall academic workforce. Our findings are concerning and suggest that authorship credit conflicts arise very early in one's academic career, even at the level of Master and Ph.D., and become increasingly common over time.
&lt;/p&gt;</description></item></channel></rss>