<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#23618;&#27425;&#20998;&#31867;&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#33258;&#21160;&#23558;&#23398;&#26415;&#20986;&#29256;&#29289;&#36890;&#36807;&#25277;&#35937;&#36827;&#34892;&#20998;&#31867;&#65292;&#23454;&#29616;&#20102;&#23545;&#30740;&#31350;&#27963;&#21160;&#22312;&#19981;&#21516;&#23618;&#27425;&#32467;&#26500;&#20013;&#30340;&#20840;&#38754;&#20998;&#31867;&#65292;&#24182;&#20801;&#35768;&#36328;&#23398;&#31185;&#21644;&#36328;&#39046;&#22495;&#30340;&#21333;&#26631;&#31614;&#21644;&#22810;&#26631;&#31614;&#20998;&#31867;&#12290;</title><link>http://arxiv.org/abs/2302.00390</link><description>&lt;p&gt;
&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#22312;"Web of Science"&#20013;&#23545;&#30740;&#31350;&#39046;&#22495;&#36827;&#34892;&#23618;&#27425;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
Hierarchical Classification of Research Fields in the "Web of Science" Using Deep Learning. (arXiv:2302.00390v2 [cs.DL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.00390
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#23618;&#27425;&#20998;&#31867;&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#33258;&#21160;&#23558;&#23398;&#26415;&#20986;&#29256;&#29289;&#36890;&#36807;&#25277;&#35937;&#36827;&#34892;&#20998;&#31867;&#65292;&#23454;&#29616;&#20102;&#23545;&#30740;&#31350;&#27963;&#21160;&#22312;&#19981;&#21516;&#23618;&#27425;&#32467;&#26500;&#20013;&#30340;&#20840;&#38754;&#20998;&#31867;&#65292;&#24182;&#20801;&#35768;&#36328;&#23398;&#31185;&#21644;&#36328;&#39046;&#22495;&#30340;&#21333;&#26631;&#31614;&#21644;&#22810;&#26631;&#31614;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23618;&#27425;&#20998;&#31867;&#31995;&#32479;&#65292;&#36890;&#36807;&#20351;&#29992;&#25277;&#35937;&#23558;&#23398;&#26415;&#20986;&#29256;&#29289;&#33258;&#21160;&#20998;&#31867;&#21040;&#19977;&#32423;&#23618;&#27425;&#26631;&#31614;&#38598;&#65288;&#23398;&#31185;&#12289;&#39046;&#22495;&#12289;&#23376;&#39046;&#22495;&#65289;&#20013;&#65292;&#20197;&#22810;&#31867;&#21035;&#35774;&#32622;&#36827;&#34892;&#20998;&#31867;&#12290;&#35813;&#31995;&#32479;&#21487;&#20197;&#36890;&#36807;&#25991;&#31456;&#30340;&#30693;&#35782;&#29983;&#20135;&#21644;&#24341;&#29992;&#30340;&#24433;&#21709;&#65292;&#23545;&#30740;&#31350;&#27963;&#21160;&#22312;&#25152;&#36848;&#23618;&#27425;&#32467;&#26500;&#20013;&#36827;&#34892;&#20840;&#38754;&#30340;&#20998;&#31867;&#65292;&#24182;&#20801;&#35768;&#36825;&#20123;&#27963;&#21160;&#34987;&#24402;&#20026;&#22810;&#20010;&#31867;&#21035;&#12290;&#35813;&#20998;&#31867;&#31995;&#32479;&#22312;Microsoft Academic Graph (&#29256;&#26412;2018-05-17)&#30340;160 million&#20221;&#25688;&#35201;&#29255;&#27573;&#20013;&#21306;&#20998;&#20102;44&#20010;&#23398;&#31185;&#12289;718&#20010;&#39046;&#22495;&#21644;1,485&#20010;&#23376;&#39046;&#22495;&#12290;&#25105;&#20204;&#20197;&#27169;&#22359;&#21270;&#21644;&#20998;&#24067;&#24335;&#26041;&#24335;&#36827;&#34892;&#25209;&#37327;&#35757;&#32451;&#65292;&#20197;&#35299;&#20915;&#21644;&#20801;&#35768;&#36328;&#23398;&#31185;&#21644;&#36328;&#39046;&#22495;&#30340;&#21333;&#26631;&#31614;&#21644;&#22810;&#26631;&#31614;&#20998;&#31867;&#12290;&#24635;&#20849;&#65292;&#25105;&#20204;&#22312;&#25152;&#26377;&#32771;&#34385;&#30340;&#27169;&#22411;&#65288;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65292;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65292;&#21464;&#24418;&#22120;&#65289;&#20013;&#36827;&#34892;&#20102;3,140&#27425;&#23454;&#39564;&#12290;&#20998;&#31867;&#20934;&#30830;&#29575;&gt; 90&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a hierarchical classification system that automatically categorizes a scholarly publication using its abstract into a three-tier hierarchical label set (discipline, field, subfield) in a multi-class setting. This system enables a holistic categorization of research activities in the mentioned hierarchy in terms of knowledge production through articles and impact through citations, permitting those activities to fall into multiple categories. The classification system distinguishes 44 disciplines, 718 fields and 1,485 subfields among 160 million abstract snippets in Microsoft Academic Graph (version 2018-05-17). We used batch training in a modularized and distributed fashion to address and allow for interdisciplinary and interfield classifications in single-label and multi-label settings. In total, we have conducted 3,140 experiments in all considered models (Convolutional Neural Networks, Recurrent Neural Networks, Transformers). The classification accuracy is &gt; 90%
&lt;/p&gt;</description></item></channel></rss>