<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#20540;&#21387;&#32553;&#30340;&#31232;&#30095;&#21015;&#65288;VCSC&#65289;&#26159;&#19968;&#31181;&#26032;&#30340;&#31232;&#30095;&#30697;&#38453;&#23384;&#20648;&#26684;&#24335;&#65292;&#33021;&#22815;&#21033;&#29992;&#39640;&#20887;&#20313;&#24615;&#23558;&#25968;&#25454;&#36827;&#19968;&#27493;&#21387;&#32553;&#65292;&#24182;&#22312;&#24615;&#33021;&#19978;&#27809;&#26377;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;&#36890;&#36807;&#22686;&#37327;&#32534;&#30721;&#21644;&#23383;&#33410;&#25171;&#21253;&#21387;&#32553;&#32034;&#24341;&#25968;&#32452;&#65292;IVCSC&#23454;&#29616;&#20102;&#26356;&#22823;&#30340;&#23384;&#20648;&#31354;&#38388;&#33410;&#30465;&#12290;</title><link>http://arxiv.org/abs/2309.04355</link><description>&lt;p&gt;
&#20540;&#21387;&#32553;&#30340;&#31232;&#30095;&#21015;&#65288;VCSC&#65289;&#65306;&#20887;&#20313;&#25968;&#25454;&#30340;&#31232;&#30095;&#30697;&#38453;&#23384;&#20648;
&lt;/p&gt;
&lt;p&gt;
Value-Compressed Sparse Column (VCSC): Sparse Matrix Storage for Redundant Data. (arXiv:2309.04355v1 [cs.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04355
&lt;/p&gt;
&lt;p&gt;
&#20540;&#21387;&#32553;&#30340;&#31232;&#30095;&#21015;&#65288;VCSC&#65289;&#26159;&#19968;&#31181;&#26032;&#30340;&#31232;&#30095;&#30697;&#38453;&#23384;&#20648;&#26684;&#24335;&#65292;&#33021;&#22815;&#21033;&#29992;&#39640;&#20887;&#20313;&#24615;&#23558;&#25968;&#25454;&#36827;&#19968;&#27493;&#21387;&#32553;&#65292;&#24182;&#22312;&#24615;&#33021;&#19978;&#27809;&#26377;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;&#36890;&#36807;&#22686;&#37327;&#32534;&#30721;&#21644;&#23383;&#33410;&#25171;&#21253;&#21387;&#32553;&#32034;&#24341;&#25968;&#32452;&#65292;IVCSC&#23454;&#29616;&#20102;&#26356;&#22823;&#30340;&#23384;&#20648;&#31354;&#38388;&#33410;&#30465;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21387;&#32553;&#30340;&#31232;&#30095;&#21015;&#65288;CSC&#65289;&#21644;&#22352;&#26631;&#65288;COO&#65289;&#26159;&#31232;&#30095;&#30697;&#38453;&#30340;&#24120;&#29992;&#21387;&#32553;&#26684;&#24335;&#12290;&#28982;&#32780;&#65292;CSC&#21644;COO&#37117;&#26159;&#36890;&#29992;&#26684;&#24335;&#65292;&#19981;&#33021;&#21033;&#29992;&#38500;&#31232;&#30095;&#24615;&#20197;&#22806;&#30340;&#25968;&#25454;&#29305;&#24615;&#65292;&#22914;&#25968;&#25454;&#20887;&#20313;&#24615;&#12290;&#39640;&#24230;&#20887;&#20313;&#30340;&#31232;&#30095;&#25968;&#25454;&#22312;&#35768;&#22810;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#24456;&#24120;&#35265;&#65292;&#20363;&#22914;&#22522;&#22240;&#32452;&#23398;&#65292;&#22312;&#20256;&#32479;&#30340;&#31232;&#30095;&#23384;&#20648;&#26684;&#24335;&#19979;&#65292;&#36825;&#20123;&#25968;&#25454;&#36890;&#24120;&#22826;&#22823;&#26080;&#27861;&#36827;&#34892;&#20869;&#23384;&#35745;&#31639;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#25193;&#23637;&#30340;CSC&#26684;&#24335;&#65306;&#20540;&#21387;&#32553;&#30340;&#31232;&#30095;&#21015;&#65288;VCSC&#65289;&#21644;&#32034;&#24341;&#21644;&#20540;&#21387;&#32553;&#30340;&#31232;&#30095;&#21015;&#65288;IVCSC&#65289;&#12290;VCSC&#21033;&#29992;&#21015;&#20869;&#30340;&#39640;&#20887;&#20313;&#24615;&#65292;&#23558;&#25968;&#25454;&#36827;&#19968;&#27493;&#21387;&#32553;&#20102;3&#20493;&#20197;&#19978;&#65292;&#30456;&#27604;COO&#21387;&#32553;&#20102;2.25&#20493;&#65292;&#32780;&#24615;&#33021;&#29305;&#24449;&#27809;&#26377;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;IVCSC&#36890;&#36807;&#22686;&#37327;&#32534;&#30721;&#21644;&#23383;&#33410;&#25171;&#21253;&#21387;&#32553;&#32034;&#24341;&#25968;&#32452;&#65292;&#20351;&#20869;&#23384;&#20351;&#29992;&#37327;&#27604;COO&#20943;&#23569;&#20102;10&#20493;&#65292;&#27604;CSC&#20943;&#23569;&#20102;7.5&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Compressed Sparse Column (CSC) and Coordinate (COO) are popular compression formats for sparse matrices. However, both CSC and COO are general purpose and cannot take advantage of any of the properties of the data other than sparsity, such as data redundancy. Highly redundant sparse data is common in many machine learning applications, such as genomics, and is often too large for in-core computation using conventional sparse storage formats. In this paper, we present two extensions to CSC: (1) Value-Compressed Sparse Column (VCSC) and (2) Index- and Value-Compressed Sparse Column (IVCSC). VCSC takes advantage of high redundancy within a column to further compress data up to 3-fold over COO and 2.25-fold over CSC, without significant negative impact to performance characteristics. IVCSC extends VCSC by compressing index arrays through delta encoding and byte-packing, achieving a 10-fold decrease in memory usage over COO and 7.5-fold decrease over CSC. Our benchmarks on simulated and rea
&lt;/p&gt;</description></item></channel></rss>