<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#35299;&#20915;&#23398;&#20064;&#22823;&#38388;&#36317;&#21322;&#31354;&#38388;&#38382;&#39064;&#30340;&#21487;&#22797;&#21046;&#31639;&#27861;&#65292;&#30456;&#27604;&#20043;&#21069;&#30340;&#31639;&#27861;&#65292;&#22312;&#32500;&#24230;&#26080;&#20851;&#12289;&#26102;&#38388;&#22797;&#26434;&#24230;&#20248;&#21270;&#12289;&#26679;&#26412;&#22797;&#26434;&#24230;&#26041;&#38754;&#31561;&#22810;&#20010;&#20851;&#38190;&#21442;&#25968;&#19978;&#22343;&#26377;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2402.13857</link><description>&lt;p&gt;
&#21487;&#22797;&#21046;&#23398;&#20064;&#22823;&#38388;&#36317;&#21322;&#31354;&#38388;
&lt;/p&gt;
&lt;p&gt;
Replicable Learning of Large-Margin Halfspaces
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13857
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#35299;&#20915;&#23398;&#20064;&#22823;&#38388;&#36317;&#21322;&#31354;&#38388;&#38382;&#39064;&#30340;&#21487;&#22797;&#21046;&#31639;&#27861;&#65292;&#30456;&#27604;&#20043;&#21069;&#30340;&#31639;&#27861;&#65292;&#22312;&#32500;&#24230;&#26080;&#20851;&#12289;&#26102;&#38388;&#22797;&#26434;&#24230;&#20248;&#21270;&#12289;&#26679;&#26412;&#22797;&#26434;&#24230;&#26041;&#38754;&#31561;&#22810;&#20010;&#20851;&#38190;&#21442;&#25968;&#19978;&#22343;&#26377;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#21487;&#22797;&#21046;&#31639;&#27861;&#26469;&#35299;&#20915;&#23398;&#20064;&#22823;&#38388;&#36317;&#21322;&#31354;&#38388;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#25913;&#36827;&#20102;Impagliazzo, Lei, Pitassi&#21644;Sorrell&#22312;STOC, 2022&#20013;&#25552;&#20379;&#30340;&#31639;&#27861;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#36825;&#20010;&#20219;&#21153;&#30340;&#39318;&#20010;&#19982;&#32500;&#24230;&#26080;&#20851;&#30340;&#21487;&#22797;&#21046;&#31639;&#27861;&#65292;&#20854;&#36816;&#34892;&#26102;&#38388;&#20026;&#22810;&#39033;&#24335;&#65292;&#26159;&#27491;&#30830;&#30340;&#65292;&#24182;&#19988;&#22312;&#25152;&#26377;&#30456;&#20851;&#21442;&#25968;&#26041;&#38754;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#37117;&#20005;&#26684;&#27604;Impagliazzo&#31561;&#20154;&#22312;2022&#24180;&#23454;&#29616;&#30340;&#31639;&#27861;&#35201;&#22909;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#31639;&#27861;&#22312;&#31934;&#24230;&#21442;&#25968;$\epsilon$&#26041;&#38754;&#20855;&#26377;&#26679;&#26412;&#22797;&#26434;&#24230;&#12290;&#25105;&#20204;&#36824;&#35774;&#35745;&#20102;&#19968;&#20010;&#22522;&#20110;SGD&#30340;&#21487;&#22797;&#21046;&#31639;&#27861;&#65292;&#22312;&#26576;&#20123;&#21442;&#25968;&#33539;&#22260;&#20869;&#65292;&#20854;&#26679;&#26412;&#22797;&#26434;&#24230;&#21644;&#26102;&#38388;&#22797;&#26434;&#24230;&#20248;&#20110;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13857v1 Announce Type: new  Abstract: We provide efficient replicable algorithms for the problem of learning large-margin halfspaces. Our results improve upon the algorithms provided by Impagliazzo, Lei, Pitassi, and Sorrell [STOC, 2022]. We design the first dimension-independent replicable algorithms for this task which runs in polynomial time, is proper, and has strictly improved sample complexity compared to the one achieved by Impagliazzo et al. [2022] with respect to all the relevant parameters. Moreover, our first algorithm has sample complexity that is optimal with respect to the accuracy parameter $\epsilon$. We also design an SGD-based replicable algorithm that, in some parameters' regimes, achieves better sample and time complexity than our first algorithm.   Departing from the requirement of polynomial time algorithms, using the DP-to-Replicability reduction of Bun, Gaboardi, Hopkins, Impagliazzo, Lei, Pitassi, Sorrell, and Sivakumar [STOC, 2023], we show how to o
&lt;/p&gt;</description></item></channel></rss>