<rss version="2.0"><channel><title>Chat Arxiv cs.DM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DM</description><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#31070;&#32463;&#32593;&#32476;&#20013;&#20851;&#20110;&#26368;&#23567;&#28145;&#24230;&#30340;&#38382;&#39064;&#65292;&#29305;&#21035;&#20851;&#27880;&#20102;ReLU&#31070;&#32463;&#32593;&#32476;&#30340;&#34920;&#36798;&#33021;&#21147;&#21644;&#26368;&#23567;&#28145;&#24230;&#19982;CPWL&#20989;&#25968;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2402.15315</link><description>&lt;p&gt;
&#20851;&#20110;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#26368;&#23567;&#28145;&#24230;
&lt;/p&gt;
&lt;p&gt;
On Minimal Depth in Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15315
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#31070;&#32463;&#32593;&#32476;&#20013;&#20851;&#20110;&#26368;&#23567;&#28145;&#24230;&#30340;&#38382;&#39064;&#65292;&#29305;&#21035;&#20851;&#27880;&#20102;ReLU&#31070;&#32463;&#32593;&#32476;&#30340;&#34920;&#36798;&#33021;&#21147;&#21644;&#26368;&#23567;&#28145;&#24230;&#19982;CPWL&#20989;&#25968;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;ReLU&#31070;&#32463;&#32593;&#32476;&#34920;&#36798;&#33021;&#21147;&#20197;&#21450;&#19982;&#34920;&#31034;&#20219;&#20309;&#36830;&#32493;&#20998;&#27573;&#32447;&#24615;&#20989;&#25968;&#65288;CPWL&#65289;&#25152;&#38656;&#30340;&#26368;&#23567;&#28145;&#24230;&#30456;&#20851;&#30340;&#29468;&#24819;&#30340;&#20851;&#31995;&#36827;&#34892;&#30740;&#31350;&#65292;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#31070;&#32463;&#32593;&#32476;&#30340;&#34920;&#36798;&#33021;&#21147;&#29305;&#24615;&#12290;&#30740;&#31350;&#37325;&#28857;&#21253;&#25324;&#23545;&#27714;&#21644;&#21644;&#26368;&#22823;&#36816;&#31639;&#30340;&#26368;&#23567;&#28145;&#24230;&#34920;&#31034;&#65292;&#20197;&#21450;&#23545;&#22810;&#38754;&#20307;&#31070;&#32463;&#32593;&#32476;&#30340;&#25506;&#32034;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#27714;&#21644;&#36816;&#31639;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20851;&#20110;&#25805;&#20316;&#25968;&#26368;&#23567;&#28145;&#24230;&#30340;&#20805;&#20998;&#26465;&#20214;&#20197;&#25214;&#21040;&#36816;&#31639;&#30340;&#26368;&#23567;&#28145;&#24230;&#12290;&#30456;&#21453;&#65292;&#20851;&#20110;&#26368;&#22823;&#36816;&#31639;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20840;&#38754;&#30340;&#20363;&#23376;&#65292;&#35777;&#26126;&#20165;&#20381;&#36182;&#20110;&#25805;&#20316;&#25968;&#28145;&#24230;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#19981;&#20250;&#26263;&#31034;&#36816;&#31639;&#30340;&#26368;&#23567;&#28145;&#24230;&#12290;&#30740;&#31350;&#36824;&#32771;&#23519;&#20102;&#20984;CPWL&#20989;&#25968;&#20043;&#38388;&#30340;&#26368;&#23567;&#28145;&#24230;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15315v1 Announce Type: new  Abstract: A characterization of the representability of neural networks is relevant to comprehend their success in artificial intelligence. This study investigate two topics on ReLU neural network expressivity and their connection with a conjecture related to the minimum depth required for representing any continuous piecewise linear function (CPWL). The topics are the minimal depth representation of the sum and max operations, as well as the exploration of polytope neural networks. For the sum operation, we establish a sufficient condition on the minimal depth of the operands to find the minimal depth of the operation. In contrast, regarding the max operation, a comprehensive set of examples is presented, demonstrating that no sufficient conditions, depending solely on the depth of the operands, would imply a minimal depth for the operation. The study also examine the minimal depth relationship between convex CPWL functions. On polytope neural ne
&lt;/p&gt;</description></item></channel></rss>