<rss version="2.0"><channel><title>Chat Arxiv cs.DB</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DB</description><item><title>&#25903;&#25345;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#20351;&#29992;&#22810;&#20851;&#31995;&#25968;&#25454;&#30340;&#24067;&#25289;&#26684;&#25463;&#20811;&#25216;&#26415;&#22823;&#23398;&#20851;&#31995;&#23398;&#20064;&#36164;&#28304;&#24211;&#65292;&#21253;&#21547;&#22823;&#37327;SQL&#25968;&#25454;&#24211;&#65292;&#24182;&#30001;getML&#25552;&#20379;&#25903;&#25345;&#12290;</title><link>https://arxiv.org/abs/1511.03086</link><description>&lt;p&gt;
&#24067;&#25289;&#26684;&#25463;&#20811;&#25216;&#26415;&#22823;&#23398;&#20851;&#31995;&#23398;&#20064;&#36164;&#28304;&#24211;
&lt;/p&gt;
&lt;p&gt;
The CTU Prague Relational Learning Repository
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1511.03086
&lt;/p&gt;
&lt;p&gt;
&#25903;&#25345;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#20351;&#29992;&#22810;&#20851;&#31995;&#25968;&#25454;&#30340;&#24067;&#25289;&#26684;&#25463;&#20811;&#25216;&#26415;&#22823;&#23398;&#20851;&#31995;&#23398;&#20064;&#36164;&#28304;&#24211;&#65292;&#21253;&#21547;&#22823;&#37327;SQL&#25968;&#25454;&#24211;&#65292;&#24182;&#30001;getML&#25552;&#20379;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24067;&#25289;&#26684;&#20851;&#31995;&#23398;&#20064;&#36164;&#28304;&#24211;&#30340;&#30446;&#30340;&#26159;&#25903;&#25345;&#20855;&#26377;&#22810;&#20851;&#31995;&#25968;&#25454;&#30340;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#12290;&#27492;&#36164;&#28304;&#24211;&#30446;&#21069;&#21253;&#21547;148&#20010;SQL&#25968;&#25454;&#24211;&#65292;&#25176;&#31649;&#22312;&#20301;&#20110;\url{https://relational-data.org}&#30340;&#20844;&#20849;MySQL&#26381;&#21153;&#22120;&#19978;&#12290;&#26381;&#21153;&#22120;&#30001;getML&#25552;&#20379;&#65292;&#20197;&#25903;&#25345;&#20851;&#31995;&#26426;&#22120;&#23398;&#20064;&#31038;&#21306;&#65288;\url{www.getml.com}&#65289;&#12290;&#21487;&#25628;&#32034;&#30340;&#20803;&#25968;&#25454;&#24211;&#25552;&#20379;&#20803;&#25968;&#25454;&#65288;&#20363;&#22914;&#25968;&#25454;&#24211;&#20013;&#30340;&#34920;&#25968;&#37327;&#12289;&#34920;&#20013;&#30340;&#34892;&#21015;&#25968;&#12289;&#33258;&#20851;&#32852;&#25968;&#37327;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1511.03086v2 Announce Type: replace  Abstract: The aim of the Prague Relational Learning Repository is to support machine learning research with multi-relational data. The repository currently contains 148 SQL databases hosted on a public MySQL server located at \url{https://relational-data.org}. The server is provided by getML to support the relational machine learning community (\url{www.getml.com}). A searchable meta-database provides metadata (e.g., the number of tables in the database, the number of rows and columns in the tables, the number of self-relationships).
&lt;/p&gt;</description></item></channel></rss>