<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#20998;&#23376;&#27169;&#25311;&#30340;&#24490;&#29615;&#21644;&#26465;&#20214;&#35745;&#31639;&#22270;&#30340;&#24037;&#20316;&#27969;&#31649;&#29702;&#22120;&#65292;&#36890;&#36807;&#24182;&#34892;&#21270;&#21644;&#36890;&#20449;&#23454;&#29616;&#20219;&#24847;&#22270;&#32467;&#26500;&#30340;&#25191;&#34892;&#65292;&#20855;&#26377;&#24456;&#39640;&#30340;&#23454;&#29992;&#24615;&#21644;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.10064</link><description>&lt;p&gt;
&#23548;&#33322;&#29577;&#31859;&#65306;&#20998;&#23376;&#27169;&#25311;&#30340;&#24490;&#29615;&#21644;&#26465;&#20214;&#35745;&#31639;&#22270;
&lt;/p&gt;
&lt;p&gt;
Navigating the Maize: Cyclic and conditional computational graphs for molecular simulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10064
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#20998;&#23376;&#27169;&#25311;&#30340;&#24490;&#29615;&#21644;&#26465;&#20214;&#35745;&#31639;&#22270;&#30340;&#24037;&#20316;&#27969;&#31649;&#29702;&#22120;&#65292;&#36890;&#36807;&#24182;&#34892;&#21270;&#21644;&#36890;&#20449;&#23454;&#29616;&#20219;&#24847;&#22270;&#32467;&#26500;&#30340;&#25191;&#34892;&#65292;&#20855;&#26377;&#24456;&#39640;&#30340;&#23454;&#29992;&#24615;&#21644;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#35745;&#31639;&#21270;&#23398;&#21644;&#20998;&#23376;&#27169;&#25311;&#24037;&#20316;&#27969;&#31243;&#21487;&#20197;&#34920;&#31034;&#20026;&#35745;&#31639;&#22270;&#12290;&#36825;&#31181;&#25277;&#35937;&#26377;&#21161;&#20110;&#27169;&#22359;&#21270;&#21644;&#28508;&#22312;&#22320;&#37325;&#29992;&#29616;&#26377;&#32452;&#20214;&#65292;&#24182;&#25552;&#20379;&#24182;&#34892;&#21270;&#21644;&#26131;&#20110;&#22797;&#21046;&#12290;&#29616;&#26377;&#24037;&#20855;&#23558;&#35745;&#31639;&#34920;&#31034;&#20026;&#26377;&#21521;&#26080;&#29615;&#22270;(DAG)&#65292;&#20174;&#32780;&#36890;&#36807;&#24182;&#34892;&#21270;&#24182;&#21457;&#20998;&#25903;&#26469;&#23454;&#29616;&#39640;&#25928;&#25191;&#34892;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#31995;&#32479;&#36890;&#24120;&#26080;&#27861;&#34920;&#31034;&#24490;&#29615;&#21644;&#26465;&#20214;&#24037;&#20316;&#27969;&#31243;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;Maize&#65292;&#19968;&#31181;&#22522;&#20110;&#27969;&#31243;&#32534;&#31243;&#21407;&#29702;&#30340;&#12289;&#29992;&#20110;&#24490;&#29615;&#21644;&#26465;&#20214;&#22270;&#30340;&#24037;&#20316;&#27969;&#31649;&#29702;&#22120;&#12290;&#36890;&#36807;&#22312;&#21333;&#29420;&#30340;&#36827;&#31243;&#20013;&#21516;&#26102;&#36816;&#34892;&#22270;&#20013;&#30340;&#27599;&#20010;&#33410;&#28857;&#65292;&#24182;&#22312;&#20219;&#20309;&#26102;&#38388;&#36890;&#36807;&#19987;&#29992;&#30340;&#33410;&#28857;&#38388;&#36890;&#36947;&#36827;&#34892;&#36890;&#20449;&#65292;&#21487;&#20197;&#25191;&#34892;&#20219;&#24847;&#30340;&#22270;&#32467;&#26500;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#35745;&#31639;&#33647;&#29289;&#35774;&#35745;&#20013;&#36827;&#34892;&#21160;&#24577;&#20027;&#21160;&#23398;&#20064;&#20219;&#21153;&#26469;&#23637;&#31034;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#65292;&#20854;&#20013;&#28041;&#21450;&#20351;&#29992;&#23567;&#20998;&#23376; gen
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10064v1 Announce Type: cross  Abstract: Many computational chemistry and molecular simulation workflows can be expressed as graphs. This abstraction is useful to modularize and potentially reuse existing components, as well as provide parallelization and ease reproducibility. Existing tools represent the computation as a directed acyclic graph (DAG), thus allowing efficient execution by parallelization of concurrent branches. These systems can, however, generally not express cyclic and conditional workflows. We therefore developed Maize, a workflow manager for cyclic and conditional graphs based on the principles of flow-based programming. By running each node of the graph concurrently in separate processes and allowing communication at any time through dedicated inter-node channels, arbitrary graph structures can be executed. We demonstrate the effectiveness of the tool on a dynamic active learning task in computational drug design, involving the use of a small molecule gen
&lt;/p&gt;</description></item><item><title>Sentinel&#26159;&#19968;&#31181;&#29992;&#20110;&#20445;&#25252;&#20998;&#25955;&#24335;&#32852;&#37030;&#23398;&#20064;&#30340;&#38450;&#24481;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#26412;&#22320;&#25968;&#25454;&#24182;&#23450;&#20041;&#19968;&#20010;&#19977;&#27493;&#32858;&#21512;&#21327;&#35758;&#26469;&#23545;&#25239;&#27745;&#26579;&#25915;&#20987;&#12290;&#35780;&#20272;&#32467;&#26524;&#34920;&#26126;Sentinel&#22312;&#19981;&#21516;&#25968;&#25454;&#38598;&#21644;&#35780;&#20272;&#25351;&#26631;&#19979;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>http://arxiv.org/abs/2310.08097</link><description>&lt;p&gt;
Sentinel: &#19968;&#31181;&#29992;&#20110;&#20445;&#25252;&#20998;&#25955;&#24335;&#32852;&#37030;&#23398;&#20064;&#30340;&#32858;&#21512;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Sentinel: An Aggregation Function to Secure Decentralized Federated Learning. (arXiv:2310.08097v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08097
&lt;/p&gt;
&lt;p&gt;
Sentinel&#26159;&#19968;&#31181;&#29992;&#20110;&#20445;&#25252;&#20998;&#25955;&#24335;&#32852;&#37030;&#23398;&#20064;&#30340;&#38450;&#24481;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#26412;&#22320;&#25968;&#25454;&#24182;&#23450;&#20041;&#19968;&#20010;&#19977;&#27493;&#32858;&#21512;&#21327;&#35758;&#26469;&#23545;&#25239;&#27745;&#26579;&#25915;&#20987;&#12290;&#35780;&#20272;&#32467;&#26524;&#34920;&#26126;Sentinel&#22312;&#19981;&#21516;&#25968;&#25454;&#38598;&#21644;&#35780;&#20272;&#25351;&#26631;&#19979;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23558;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#24555;&#36895;&#25972;&#21512;&#21040;&#32593;&#32476;&#20013;&#28085;&#30422;&#20102;&#32593;&#32476;&#31649;&#29702;&#12289;&#26381;&#21153;&#36136;&#37327;&#21644;&#32593;&#32476;&#23433;&#20840;&#31561;&#21508;&#20010;&#26041;&#38754;&#65292;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20998;&#25955;&#24335;&#32852;&#37030;&#23398;&#20064;&#65288;DFL&#65289;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#33539;&#24335;&#65292;&#29992;&#20110;&#35757;&#32451;&#21327;&#20316;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#21333;&#28857;&#22833;&#25928;&#30340;&#38480;&#21046;&#12290;&#28982;&#32780;&#65292;FL&#21644;DFL&#30340;&#23433;&#20840;&#24615;&#21644;&#21487;&#20449;&#24615;&#21463;&#21040;&#27745;&#26579;&#25915;&#20987;&#30340;&#24433;&#21709;&#65292;&#20174;&#32780;&#23545;&#20854;&#24615;&#33021;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;&#29616;&#26377;&#30340;&#38450;&#24481;&#26426;&#21046;&#38024;&#23545;&#38598;&#20013;&#24335;FL&#36827;&#34892;&#35774;&#35745;&#65292;&#24182;&#26410;&#20805;&#20998;&#21033;&#29992;DFL&#30340;&#29305;&#28857;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;Sentinel&#65292;&#19968;&#31181;&#22312;DFL&#20013;&#23545;&#25239;&#27745;&#26579;&#25915;&#20987;&#30340;&#38450;&#24481;&#31574;&#30053;&#12290;Sentinel&#21033;&#29992;&#26412;&#22320;&#25968;&#25454;&#30340;&#21487;&#35775;&#38382;&#24615;&#65292;&#23450;&#20041;&#20102;&#19968;&#20010;&#19977;&#27493;&#32858;&#21512;&#21327;&#35758;&#65292;&#21253;&#25324;&#30456;&#20284;&#24615;&#36807;&#28388;&#12289;&#24341;&#23548;&#39564;&#35777;&#21644;&#26631;&#20934;&#21270;&#65292;&#20197;&#38450;&#27490;&#24694;&#24847;&#27169;&#22411;&#26356;&#26032;&#12290;&#36890;&#36807;&#20351;&#29992;&#19981;&#21516;&#25968;&#25454;&#38598;&#21644;&#19981;&#21516;&#30340;&#35780;&#20272;&#25351;&#26631;&#23545;Sentinel&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rapid integration of Federated Learning (FL) into networking encompasses various aspects such as network management, quality of service, and cybersecurity while preserving data privacy. In this context, Decentralized Federated Learning (DFL) emerges as an innovative paradigm to train collaborative models, addressing the single point of failure limitation. However, the security and trustworthiness of FL and DFL are compromised by poisoning attacks, negatively impacting its performance. Existing defense mechanisms have been designed for centralized FL and they do not adequately exploit the particularities of DFL. Thus, this work introduces Sentinel, a defense strategy to counteract poisoning attacks in DFL. Sentinel leverages the accessibility of local data and defines a three-step aggregation protocol consisting of similarity filtering, bootstrap validation, and normalization to safeguard against malicious model updates. Sentinel has been evaluated with diverse datasets and various 
&lt;/p&gt;</description></item></channel></rss>