<rss version="2.0"><channel><title>Chat Arxiv cs.DM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DM</description><item><title>&#22270;&#24418;-SCP&#26159;&#19968;&#31181;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21152;&#36895;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#35782;&#21035;&#21253;&#21547;&#35299;&#31354;&#38388;&#30340;&#36739;&#23567;&#23376;&#38382;&#39064;&#26469;&#25552;&#39640;&#20248;&#21270;&#27714;&#35299;&#22120;&#30340;&#24615;&#33021;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22270;&#24418;-SCP&#33021;&#22815;&#23558;&#38382;&#39064;&#22823;&#23567;&#20943;&#23569;30-70%&#65292;&#21644;&#21830;&#19994;&#27714;&#35299;&#22120;&#30456;&#27604;&#21152;&#36895;&#39640;&#36798;25&#20493;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#32473;&#23450;&#30340;&#26368;&#20248;&#24615;&#38408;&#20540;&#19979;&#25913;&#36827;&#25110;&#23454;&#29616;100%&#30340;&#26368;&#20248;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.07979</link><description>&lt;p&gt;
&#22270;&#24418;-SCP: &#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21152;&#36895;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Graph-SCP: Accelerating Set Cover Problems with Graph Neural Networks. (arXiv:2310.07979v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07979
&lt;/p&gt;
&lt;p&gt;
&#22270;&#24418;-SCP&#26159;&#19968;&#31181;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21152;&#36895;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#35782;&#21035;&#21253;&#21547;&#35299;&#31354;&#38388;&#30340;&#36739;&#23567;&#23376;&#38382;&#39064;&#26469;&#25552;&#39640;&#20248;&#21270;&#27714;&#35299;&#22120;&#30340;&#24615;&#33021;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22270;&#24418;-SCP&#33021;&#22815;&#23558;&#38382;&#39064;&#22823;&#23567;&#20943;&#23569;30-70%&#65292;&#21644;&#21830;&#19994;&#27714;&#35299;&#22120;&#30456;&#27604;&#21152;&#36895;&#39640;&#36798;25&#20493;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#32473;&#23450;&#30340;&#26368;&#20248;&#24615;&#38408;&#20540;&#19979;&#25913;&#36827;&#25110;&#23454;&#29616;100%&#30340;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#36234;&#26469;&#36234;&#22810;&#22320;&#29992;&#20110;&#21152;&#36895;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;&#65288;SCP&#65289;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#22270;&#24418;-SCP&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#23398;&#20064;&#35782;&#21035;&#21253;&#21547;&#35299;&#31354;&#38388;&#30340;&#22823;&#22823;&#36739;&#23567;&#30340;&#23376;&#38382;&#39064;&#26469;&#22686;&#24378;&#29616;&#26377;&#30340;&#20248;&#21270;&#27714;&#35299;&#22120;&#12290;&#25105;&#20204;&#22312;&#20855;&#26377;&#19981;&#21516;&#38382;&#39064;&#29305;&#24449;&#21644;&#22797;&#26434;&#24230;&#30340;&#21512;&#25104;&#21152;&#26435;&#21644;&#38750;&#21152;&#26435;SCP&#23454;&#20363;&#19978;&#35780;&#20272;&#20102;&#22270;&#24418;-SCP&#30340;&#24615;&#33021;&#65292;&#24182;&#22312;OR Library&#30340;&#23454;&#20363;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#36825;&#26159;SCP&#30340;&#19968;&#20010;&#32463;&#20856;&#22522;&#20934;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22270;&#24418;-SCP&#23558;&#38382;&#39064;&#22823;&#23567;&#20943;&#23569;&#20102;30-70%&#65292;&#24182;&#19988;&#30456;&#23545;&#20110;&#21830;&#19994;&#27714;&#35299;&#22120;&#65288;Gurobi&#65289;&#23454;&#29616;&#20102;&#39640;&#36798;25&#20493;&#30340;&#36816;&#34892;&#26102;&#38388;&#21152;&#36895;&#12290;&#22312;&#32473;&#23450;&#25152;&#38656;&#30340;&#26368;&#20248;&#24615;&#38408;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#22270;&#24418;-SCP&#23558;&#25913;&#36827;&#25110;&#29978;&#33267;&#23454;&#29616;100%&#30340;&#26368;&#20248;&#24615;&#12290;&#36825;&#19982;&#24555;&#36895;&#36138;&#23146;&#35299;&#20915;&#26041;&#26696;&#24418;&#25104;&#20102;&#23545;&#27604;&#65292;&#21518;&#32773;&#22312;&#20445;&#35777;&#22810;&#39033;&#24335;&#36816;&#34892;&#26102;&#38388;&#30340;&#21516;&#26102;&#26126;&#26174;&#25439;&#23475;&#20102;&#35299;&#20915;&#26041;&#26696;&#30340;&#36136;&#37327;&#12290;&#22270;&#24418;-SCP&#21487;&#20197;&#25512;&#24191;&#21040;&#26356;&#22823;&#30340;&#38382;&#39064;&#35268;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning (ML) approaches are increasingly being used to accelerate combinatorial optimization (CO) problems. We look specifically at the Set Cover Problem (SCP) and propose Graph-SCP, a graph neural network method that can augment existing optimization solvers by learning to identify a much smaller sub-problem that contains the solution space. We evaluate the performance of Graph-SCP on synthetic weighted and unweighted SCP instances with diverse problem characteristics and complexities, and on instances from the OR Library, a canonical benchmark for SCP. We show that Graph-SCP reduces the problem size by 30-70% and achieves run time speedups up to~25x when compared to commercial solvers (Gurobi). Given a desired optimality threshold, Graph-SCP will improve upon it or even achieve 100% optimality. This is in contrast to fast greedy solutions that significantly compromise solution quality to achieve guaranteed polynomial run time. Graph-SCP can generalize to larger problem sizes
&lt;/p&gt;</description></item></channel></rss>