<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19981;&#21516;&#23398;&#26415;&#39046;&#22495;&#22312;43&#24180;&#38388;&#24341;&#29992;&#36739;&#26087;&#20316;&#21697;&#30340;&#36235;&#21183;&#65292;&#21457;&#29616;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#20013;&#24341;&#25991;&#24180;&#40836;&#34928;&#36864;&#26368;&#20026;&#26126;&#26174;&#65292;&#27492;&#36235;&#21183;&#24182;&#38750;&#30001;&#20986;&#29256;&#36895;&#29575;&#22686;&#38271;&#20027;&#23548;&#12290;</title><link>https://arxiv.org/abs/2402.12046</link><description>&lt;p&gt;
&#24341;&#25991;&#36951;&#24536;&#65306;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#20854;&#20182;&#23398;&#26415;&#39046;&#22495;&#27491;&#22788;&#20110;&#24341;&#25991;&#24180;&#40836;&#34928;&#36864;&#26399;
&lt;/p&gt;
&lt;p&gt;
Citation Amnesia: NLP and Other Academic Fields Are in a Citation Age Recession
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12046
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19981;&#21516;&#23398;&#26415;&#39046;&#22495;&#22312;43&#24180;&#38388;&#24341;&#29992;&#36739;&#26087;&#20316;&#21697;&#30340;&#36235;&#21183;&#65292;&#21457;&#29616;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#20013;&#24341;&#25991;&#24180;&#40836;&#34928;&#36864;&#26368;&#20026;&#26126;&#26174;&#65292;&#27492;&#36235;&#21183;&#24182;&#38750;&#30001;&#20986;&#29256;&#36895;&#29575;&#22686;&#38271;&#20027;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#32771;&#23519;&#20102;&#22312;43&#24180;&#30340;&#26102;&#38388;&#36328;&#24230;&#65288;1980-2023&#24180;&#65289;&#20869;&#65292;&#22312;20&#20010;&#30740;&#31350;&#39046;&#22495;&#20013;&#20542;&#21521;&#20110;&#24341;&#29992;&#36739;&#26087;&#20316;&#21697;&#30340;&#36235;&#21183;&#12290;&#25105;&#20204;&#23558;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;(NLP)&#20542;&#21521;&#20110;&#24341;&#29992;&#36739;&#26087;&#20316;&#21697;&#30340;&#29305;&#24615;&#25918;&#22312;&#20854;&#20182;20&#20010;&#39046;&#22495;&#30340;&#32972;&#26223;&#19979;&#36827;&#34892;&#20998;&#26512;&#65292;&#20197;&#25506;&#35752;NLP&#26159;&#21542;&#23637;&#29616;&#20986;&#19982;&#20854;&#20182;&#39046;&#22495;&#38543;&#26102;&#38388;&#20986;&#29616;&#31867;&#20284;&#30340;&#24341;&#25991;&#27169;&#24335;&#65292;&#25110;&#32773;&#26159;&#21542;&#21487;&#20197;&#35266;&#23519;&#21040;&#24046;&#24322;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#22522;&#20110;&#32422;2.4&#20159;&#31687;&#35770;&#25991;&#30340;&#25968;&#25454;&#38598;&#65292;&#25581;&#31034;&#20102;&#19968;&#20010;&#26356;&#24191;&#27867;&#30340;&#31185;&#23398;&#36235;&#21183;&#65306;&#35768;&#22810;&#39046;&#22495;&#22312;&#24341;&#29992;&#36739;&#26087;&#20316;&#21697;&#26041;&#38754;&#26126;&#26174;&#19979;&#38477;&#65288;&#20363;&#22914;&#24515;&#29702;&#23398;&#12289;&#35745;&#31639;&#26426;&#31185;&#23398;&#65289;&#12290;&#25105;&#20204;&#23558;&#36825;&#31181;&#19979;&#38477;&#31216;&#20026;&#8220;&#24341;&#25991;&#24180;&#40836;&#34928;&#36864;&#8221;&#65292;&#31867;&#20284;&#20110;&#32463;&#27982;&#23398;&#23478;&#22914;&#20309;&#23450;&#20041;&#20943;&#23569;&#32463;&#27982;&#27963;&#21160;&#30340;&#26102;&#26399;&#12290;&#36825;&#19968;&#36235;&#21183;&#22312;NLP&#21644;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#20013;&#26368;&#20026;&#26174;&#33879;&#65288;&#24341;&#25991;&#24180;&#40836;&#20174;&#20808;&#21069;&#39640;&#23792;&#19979;&#38477;&#20102;12.8%&#21644;5.5%&#65289;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#26356;&#36817;&#26399;&#20316;&#21697;&#30340;&#24341;&#29992;&#24182;&#38750;&#30452;&#25509;&#21463;&#21040;&#20986;&#29256;&#36895;&#29575;&#22686;&#38271;&#30340;&#25512;&#21160;&#65288;&#36328;&#39046;&#22495;&#19979;&#38477;&#20102;3.4%&#65292;&#20154;&#25991;&#23398;&#31185;&#19979;&#38477;&#20102;5.2%&#65292;&#24418;&#24335;&#31185;&#23398;&#19979;&#38477;&#20102;5.5%&#65289;--&#21363;&#20351;&#22312;&#25511;&#21046;&#20102;&#21457;&#34920;&#25968;&#37327;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12046v1 Announce Type: cross  Abstract: This study examines the tendency to cite older work across 20 fields of study over 43 years (1980--2023). We put NLP's propensity to cite older work in the context of these 20 other fields to analyze whether NLP shows similar temporal citation patterns to these other fields over time or whether differences can be observed. Our analysis, based on a dataset of approximately 240 million papers, reveals a broader scientific trend: many fields have markedly declined in citing older works (e.g., psychology, computer science). We term this decline a 'citation age recession', analogous to how economists define periods of reduced economic activity. The trend is strongest in NLP and ML research (-12.8% and -5.5% in citation age from previous peaks). Our results suggest that citing more recent works is not directly driven by the growth in publication rates (-3.4% across fields; -5.2% in humanities; -5.5% in formal sciences) -- even when controlli
&lt;/p&gt;</description></item></channel></rss>