<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>HyFL&#26159;&#19968;&#31181;&#28151;&#21512;&#26694;&#26550;&#65292;&#23427;&#32467;&#21512;&#20102;&#23433;&#20840;&#22810;&#26041;&#35745;&#31639;&#25216;&#26415;&#21644;&#20998;&#23618;&#32852;&#21512;&#23398;&#20064;&#65292;&#24182;&#33021;&#22815;&#22312;&#20998;&#24067;&#24335;&#29615;&#22659;&#20013;&#20445;&#35777;&#25968;&#25454;&#21644;&#20840;&#23616;&#27169;&#22411;&#30340;&#38544;&#31169;&#23433;&#20840;&#65292;&#26377;&#21161;&#20110;&#22823;&#35268;&#27169;&#37096;&#32626;&#12290;</title><link>http://arxiv.org/abs/2302.09904</link><description>&lt;p&gt;
HyFL:&#19968;&#31181;&#29992;&#20110;&#31169;&#26377;&#32852;&#21512;&#23398;&#20064;&#30340;&#28151;&#21512;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
HyFL: A Hybrid Framework For Private Federated Learning. (arXiv:2302.09904v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09904
&lt;/p&gt;
&lt;p&gt;
HyFL&#26159;&#19968;&#31181;&#28151;&#21512;&#26694;&#26550;&#65292;&#23427;&#32467;&#21512;&#20102;&#23433;&#20840;&#22810;&#26041;&#35745;&#31639;&#25216;&#26415;&#21644;&#20998;&#23618;&#32852;&#21512;&#23398;&#20064;&#65292;&#24182;&#33021;&#22815;&#22312;&#20998;&#24067;&#24335;&#29615;&#22659;&#20013;&#20445;&#35777;&#25968;&#25454;&#21644;&#20840;&#23616;&#27169;&#22411;&#30340;&#38544;&#31169;&#23433;&#20840;&#65292;&#26377;&#21161;&#20110;&#22823;&#35268;&#27169;&#37096;&#32626;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#23398;&#20064;&#24050;&#32463;&#25104;&#20026;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#30340;&#26377;&#25928;&#26041;&#27861;&#65292;&#36890;&#36807;&#22312;&#23458;&#25143;&#31471;&#35774;&#22791;&#19978;&#20445;&#30041;&#35757;&#32451;&#25968;&#25454;&#26469;&#30830;&#20445;&#25968;&#25454;&#38544;&#31169;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#24378;&#35843;&#20102;FL&#20013;&#30340;&#28431;&#27934;&#65292;&#21253;&#25324;&#36890;&#36807;&#21333;&#20010;&#27169;&#22411;&#26356;&#26032;&#29978;&#33267;&#25972;&#20010;&#20840;&#23616;&#27169;&#22411;&#27844;&#28431;&#25935;&#24863;&#20449;&#24687;&#12290;&#34429;&#28982;&#20851;&#27880;&#28857;&#24050;&#25918;&#22312;&#23458;&#25143;&#31471;&#25968;&#25454;&#38544;&#31169;&#19978;&#65292;&#20294;&#26377;&#38480;&#30340;&#30740;&#31350;&#35299;&#20915;&#20102;&#20840;&#23616;&#27169;&#22411;&#38544;&#31169;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#23458;&#25143;&#31471;&#26412;&#22320;&#35757;&#32451;&#20026;&#24694;&#24847;&#23458;&#25143;&#31471;&#21551;&#21160;&#24378;&#22823;&#30340;&#27169;&#22411;&#27745;&#26579;&#25915;&#20987;&#24320;&#36767;&#20102;&#36884;&#24452;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#30446;&#21069;&#27809;&#26377;&#29616;&#26377;&#24037;&#20316;&#25552;&#20379;&#20840;&#38754;&#35299;&#20915;&#25152;&#26377;&#36825;&#20123;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;HyFL&#65292;&#36825;&#26159;&#19968;&#31181;&#28151;&#21512;&#26694;&#26550;&#65292;&#21487;&#23454;&#29616;&#25968;&#25454;&#21644;&#20840;&#23616;&#27169;&#22411;&#38544;&#31169;&#65292;&#24182;&#20419;&#36827;&#22823;&#35268;&#27169;&#37096;&#32626;&#12290;HyFL&#30340;&#22522;&#30784;&#26159;&#23433;&#20840;&#22810;&#26041;&#35745;&#31639;&#25216;&#26415;&#21644;&#20998;&#23618;&#32852;&#21512;&#23398;&#20064;&#30340;&#29420;&#29305;&#32452;&#21512;&#12290;&#22312;HyFL&#30340;&#35757;&#32451;&#36807;&#31243;&#20013;&#65292;&#23458;&#25143;&#31471;&#27169;&#22411;&#22312;&#22810;&#20010;&#25277;&#35937;&#23618;&#27425;&#19978;&#36827;&#34892;&#23433;&#20840;&#32858;&#21512;&#65292;&#20197;&#22312;&#20998;&#24067;&#24335;&#29615;&#22659;&#20013;&#25552;&#20379;&#38544;&#31169;&#20445;&#25252;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;HyFL&#22312;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#33391;&#22909;&#24615;&#33021;&#65292;&#21516;&#26102;&#30830;&#20445;&#23458;&#25143;&#31471;&#25968;&#25454;&#21644;&#20840;&#23616;&#27169;&#22411;&#30340;&#24378;&#22823;&#38544;&#31169;&#21644;&#23433;&#20840;&#20445;&#38556;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated learning (FL) has emerged as an efficient approach for large-scale distributed machine learning, ensuring data privacy by keeping training data on client devices. However, recent research has highlighted vulnerabilities in FL, including the potential disclosure of sensitive information through individual model updates and even the aggregated global model. While much attention has been given to clients' data privacy, limited research has addressed the issue of global model privacy. Furthermore, local training at the client's side has opened avenues for malicious clients to launch powerful model poisoning attacks. Unfortunately, no existing work has provided a comprehensive solution that tackles all these issues. Therefore, we introduce HyFL, a hybrid framework that enables data and global model privacy while facilitating large-scale deployments. The foundation of HyFL is a unique combination of secure multi-party computation (MPC) techniques with hierarchical federated learnin
&lt;/p&gt;</description></item></channel></rss>