<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#32447;&#35774;&#26045;&#36873;&#22336;&#38382;&#39064;&#30340;&#22312;&#32447;&#31639;&#27861;&#65292;&#31454;&#20105;&#27604;&#29575;&#33021;&#22815;&#20809;&#28369;&#22320;&#38543;&#35823;&#24046;&#20943;&#23567;&#32780;&#20174;&#23545;&#25968;&#32423;&#21035;&#38477;&#20302;&#21040;&#24120;&#25968;&#32423;&#21035;&#12290;</title><link>http://arxiv.org/abs/2107.08277</link><description>&lt;p&gt;
&#23398;&#20064;&#22686;&#24378;&#30340;&#22312;&#32447;&#35774;&#26045;&#36873;&#22336;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Learning Augmented Online Facility Location. (arXiv:2107.08277v3 [cs.DS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.08277
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#32447;&#35774;&#26045;&#36873;&#22336;&#38382;&#39064;&#30340;&#22312;&#32447;&#31639;&#27861;&#65292;&#31454;&#20105;&#27604;&#29575;&#33021;&#22815;&#20809;&#28369;&#22320;&#38543;&#35823;&#24046;&#20943;&#23567;&#32780;&#20174;&#23545;&#25968;&#32423;&#21035;&#38477;&#20302;&#21040;&#24120;&#25968;&#32423;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#32447;&#35774;&#26045;&#36873;&#22336;&#38382;&#39064;&#65292;&#22312;&#35813;&#38382;&#39064;&#20013;&#65292;&#38656;&#27714;&#36880;&#19968;&#21040;&#36798;&#65292;&#24182;&#19988;&#24517;&#39035;&#22312;&#21040;&#36798;&#26102;&#23558;&#20854;&#65288;&#26080;&#27861;&#25764;&#38144;&#22320;&#65289;&#20998;&#37197;&#32473;&#19968;&#20010;&#24320;&#25918;&#30340;&#35774;&#26045;&#65292;&#32780;&#27809;&#26377;&#20851;&#20110;&#26410;&#26469;&#38656;&#27714;&#30340;&#20219;&#20309;&#30693;&#35782;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#31639;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#35813;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;&#23545;&#26368;&#20248;&#35774;&#26045;&#20301;&#32622;&#30340;&#39044;&#27979;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#31454;&#20105;&#27604;&#29575;&#20174;&#38656;&#27714;&#25968;&#37327;&#30340;&#23545;&#25968;&#32423;&#21035;&#24179;&#28369;&#22320;&#38477;&#20302;&#21040;&#24120;&#25968;&#32423;&#21035;&#65292;&#24403;&#38169;&#35823;&#65288;&#21363;&#39044;&#27979;&#20301;&#32622;&#19982;&#26368;&#20248;&#35774;&#26045;&#20301;&#32622;&#20043;&#38388;&#30340;&#24635;&#36317;&#31163;&#65289;&#21521;&#38646;&#38477;&#20302;&#26102;&#12290;&#25105;&#20204;&#37197;&#21512;&#31639;&#27861;&#30340;&#38477;&#20302;&#30028;&#65292;&#24314;&#31435;&#20102;&#31639;&#27861;&#30340;&#31454;&#20105;&#27604;&#29575;&#23545;&#35823;&#24046;&#30340;&#20381;&#36182;&#20851;&#31995;&#26159;&#26368;&#20248;&#30340;&#65292;&#24120;&#25968;&#25509;&#36817;&#26368;&#20248;&#12290;
&lt;/p&gt;
&lt;p&gt;
Following the research agenda initiated by Munoz &amp; Vassilvitskii [1] and Lykouris &amp; Vassilvitskii [2] on learning-augmented online algorithms for classical online optimization problems, in this work, we consider the Online Facility Location problem under this framework. In Online Facility Location (OFL), demands arrive one-by-one in a metric space and must be (irrevocably) assigned to an open facility upon arrival, without any knowledge about future demands.  We present an online algorithm for OFL that exploits potentially imperfect predictions on the locations of the optimal facilities. We prove that the competitive ratio decreases smoothly from sublogarithmic in the number of demands to constant, as the error, i.e., the total distance of the predicted locations to the optimal facility locations, decreases towards zero. We complement our analysis with a matching lower bound establishing that the dependence of the algorithm's competitive ratio on the error is optimal, up to constant fa
&lt;/p&gt;</description></item></channel></rss>