<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>OAG-Bench&#26159;&#19968;&#20010;&#22522;&#20110;&#24320;&#25918;&#23398;&#26415;&#22270;&#30340;&#20840;&#38754;&#12289;&#22810;&#26041;&#38754;&#21644;&#31934;&#32454;&#21270;&#20154;&#24037;&#31579;&#36873;&#22522;&#20934;&#65292;&#28085;&#30422;&#20102;&#22810;&#20010;&#20219;&#21153;&#12289;&#25968;&#25454;&#38598;&#12289;&#22522;&#20934;&#21644;&#23454;&#39564;&#32467;&#26524;&#65292;&#26088;&#22312;&#20419;&#36827;&#23398;&#26415;&#22270;&#25366;&#25496;&#12290;</title><link>https://arxiv.org/abs/2402.15810</link><description>&lt;p&gt;
OAG-Bench&#65306;&#38754;&#21521;&#23398;&#26415;&#22270;&#25366;&#25496;&#30340;&#20154;&#24037;&#31579;&#36873;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
OAG-Bench: A Human-Curated Benchmark for Academic Graph Mining
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15810
&lt;/p&gt;
&lt;p&gt;
OAG-Bench&#26159;&#19968;&#20010;&#22522;&#20110;&#24320;&#25918;&#23398;&#26415;&#22270;&#30340;&#20840;&#38754;&#12289;&#22810;&#26041;&#38754;&#21644;&#31934;&#32454;&#21270;&#20154;&#24037;&#31579;&#36873;&#22522;&#20934;&#65292;&#28085;&#30422;&#20102;&#22810;&#20010;&#20219;&#21153;&#12289;&#25968;&#25454;&#38598;&#12289;&#22522;&#20934;&#21644;&#23454;&#39564;&#32467;&#26524;&#65292;&#26088;&#22312;&#20419;&#36827;&#23398;&#26415;&#22270;&#25366;&#25496;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#31185;&#23398;&#25991;&#29486;&#30340;&#36805;&#36895;&#22686;&#38271;&#65292;&#22810;&#21151;&#33021;&#30340;&#23398;&#26415;&#30693;&#35782;&#26381;&#21153;&#36234;&#26469;&#36234;&#20381;&#36182;&#20840;&#38754;&#30340;&#23398;&#26415;&#22270;&#25366;&#25496;&#12290;&#23613;&#31649;&#20844;&#24320;&#23398;&#26415;&#22270;&#12289;&#22522;&#20934;&#21644;&#25968;&#25454;&#38598;&#24050;&#32463;&#26377;&#20102;&#65292;&#20294;&#36825;&#20123;&#36164;&#28304;&#36890;&#24120;&#22312;&#22810;&#26041;&#38754;&#21644;&#32454;&#31890;&#24230;&#27880;&#37322;&#26041;&#38754;&#23384;&#22312;&#19981;&#36275;&#65292;&#21463;&#38480;&#20110;&#29305;&#23450;&#20219;&#21153;&#31867;&#22411;&#21644;&#39046;&#22495;&#65292;&#25110;&#32773;&#32570;&#20047;&#30495;&#23454;&#23398;&#26415;&#22270;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24320;&#25918;&#23398;&#26415;&#22270;&#65288;OAG&#65289;&#30340;&#20840;&#38754;&#12289;&#22810;&#26041;&#38754;&#21644;&#31934;&#32454;&#21270;&#20154;&#24037;&#31579;&#36873;&#22522;&#20934;OAG-Bench&#12290;OAG-Bench&#28085;&#30422;&#20102;10&#20010;&#20219;&#21153;&#65292;20&#20010;&#25968;&#25454;&#38598;&#65292;70+&#20010;&#22522;&#20934;&#21644;120+&#20010;&#25130;&#33267;&#30446;&#21069;&#30340;&#23454;&#39564;&#32467;&#26524;&#12290;&#25105;&#20204;&#38024;&#23545;&#26576;&#20123;&#20219;&#21153;&#25552;&#20986;&#20102;&#26032;&#30340;&#25968;&#25454;&#27880;&#37322;&#31574;&#30053;&#65292;&#24182;&#25552;&#20379;&#19968;&#22871;&#25968;&#25454;&#39044;&#22788;&#29702;&#20195;&#30721;&#12289;&#31639;&#27861;&#23454;&#29616;&#21644;&#26631;&#20934;&#21270;&#35780;&#20272;&#21327;&#35758;&#65292;&#20197;&#20419;&#36827;&#23398;&#26415;&#22270;&#25366;&#25496;&#12290;&#22823;&#37327;&#23454;&#39564;&#34920;&#26126;&#65292;&#21363;&#20351;&#26159;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#36825;&#26679;&#30340;&#20808;&#36827;&#31639;&#27861;&#20063;&#20250;&#22312;&#26576;&#20123;&#20219;&#21153;&#19978;&#21463;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15810v1 Announce Type: cross  Abstract: With the rapid proliferation of scientific literature, versatile academic knowledge services increasingly rely on comprehensive academic graph mining. Despite the availability of public academic graphs, benchmarks, and datasets, these resources often fall short in multi-aspect and fine-grained annotations, are constrained to specific task types and domains, or lack underlying real academic graphs. In this paper, we present OAG-Bench, a comprehensive, multi-aspect, and fine-grained human-curated benchmark based on the Open Academic Graph (OAG). OAG-Bench covers 10 tasks, 20 datasets, 70+ baselines, and 120+ experimental results to date. We propose new data annotation strategies for certain tasks and offer a suite of data pre-processing codes, algorithm implementations, and standardized evaluation protocols to facilitate academic graph mining. Extensive experiments reveal that even advanced algorithms like large language models (LLMs) en
&lt;/p&gt;</description></item><item><title>FedAIoT&#26159;&#19968;&#20010;&#29992;&#20110;AIoT&#30340;&#32852;&#37030;&#23398;&#20064;&#22522;&#20934;&#65292;&#21253;&#25324;&#20843;&#20010;&#25968;&#25454;&#38598;&#21644;&#19968;&#20010;&#32479;&#19968;&#30340;&#31471;&#21040;&#31471;FL&#26694;&#26550;&#12290;&#23427;&#22635;&#34917;&#20102;&#29616;&#26377;FL&#30740;&#31350;&#20013;&#32570;&#20047;&#30495;&#23454;&#29289;&#32852;&#32593;&#35774;&#22791;&#25968;&#25454;&#38598;&#30340;&#20851;&#38190;&#24046;&#36317;&#65292;&#24182;&#25581;&#31034;&#20102;FL&#22312;AIoT&#39046;&#22495;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2310.00109</link><description>&lt;p&gt;
FedAIoT: &#19968;&#31181;&#29992;&#20110;&#29289;&#32852;&#32593;&#20154;&#24037;&#26234;&#33021;&#30340;&#32852;&#37030;&#23398;&#20064;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
FedAIoT: A Federated Learning Benchmark for Artificial Intelligence of Things. (arXiv:2310.00109v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00109
&lt;/p&gt;
&lt;p&gt;
FedAIoT&#26159;&#19968;&#20010;&#29992;&#20110;AIoT&#30340;&#32852;&#37030;&#23398;&#20064;&#22522;&#20934;&#65292;&#21253;&#25324;&#20843;&#20010;&#25968;&#25454;&#38598;&#21644;&#19968;&#20010;&#32479;&#19968;&#30340;&#31471;&#21040;&#31471;FL&#26694;&#26550;&#12290;&#23427;&#22635;&#34917;&#20102;&#29616;&#26377;FL&#30740;&#31350;&#20013;&#32570;&#20047;&#30495;&#23454;&#29289;&#32852;&#32593;&#35774;&#22791;&#25968;&#25454;&#38598;&#30340;&#20851;&#38190;&#24046;&#36317;&#65292;&#24182;&#25581;&#31034;&#20102;FL&#22312;AIoT&#39046;&#22495;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29289;&#32852;&#32593;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#65292;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#20855;&#26377;&#37325;&#35201;&#30340;&#30456;&#20851;&#24615;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;FL&#30740;&#31350;&#24182;&#19981;&#26159;&#22522;&#20110;&#20174;&#30495;&#23454;&#29289;&#32852;&#32593;&#35774;&#22791;&#25910;&#38598;&#30340;&#25968;&#25454;&#38598;&#65292;&#36825;&#20123;&#25968;&#25454;&#38598;&#25429;&#25417;&#20102;&#29289;&#32852;&#32593;&#25968;&#25454;&#30340;&#29420;&#29305;&#27169;&#24335;&#21644;&#22266;&#26377;&#25361;&#25112;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;FedAIoT&#65292;&#19968;&#31181;&#29992;&#20110;AIoT&#30340;FL&#22522;&#20934;&#65292;&#20197;&#22635;&#34917;&#36825;&#20010;&#20851;&#38190;&#30340;&#24046;&#36317;&#12290;FedAIoT&#21253;&#25324;&#20174;&#21508;&#31181;&#29289;&#32852;&#32593;&#35774;&#22791;&#25910;&#38598;&#30340;&#20843;&#20010;&#25968;&#25454;&#38598;&#12290;&#36825;&#20123;&#25968;&#25454;&#38598;&#28085;&#30422;&#20102;&#29289;&#32852;&#32593;&#30340;&#29420;&#29305;&#27169;&#24335;&#65292;&#24182;&#38024;&#23545;AIoT&#30340;&#20856;&#22411;&#24212;&#29992;&#12290;FedAIoT&#36824;&#21253;&#25324;&#19968;&#31181;&#29992;&#20110;AIoT&#30340;&#32479;&#19968;&#30340;&#31471;&#21040;&#31471;FL&#26694;&#26550;&#65292;&#31616;&#21270;&#20102;&#25968;&#25454;&#38598;&#24615;&#33021;&#30340;&#22522;&#20934;&#27979;&#35797;&#12290;&#25105;&#20204;&#30340;&#22522;&#20934;&#27979;&#35797;&#32467;&#26524;&#25581;&#31034;&#20102;FL&#22312;AIoT&#39046;&#22495;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#25105;&#20204;&#24076;&#26395;FedAIoT&#33021;&#25104;&#20026;&#22312;FL for AIoT&#36825;&#19968;&#37325;&#35201;&#39046;&#22495;&#25512;&#21160;&#36827;&#23637;&#30340;&#29645;&#36149;&#36164;&#28304;&#12290;FedAIoT&#30340;&#20195;&#30721;&#20179;&#24211;&#20301;&#20110;https://github.com/AIoT-MLSys-Lab/FedAIoT&#12290;
&lt;/p&gt;
&lt;p&gt;
There is a significant relevance of federated learning (FL) in the realm of Artificial Intelligence of Things (AIoT). However, most existing FL works are not conducted on datasets collected from authentic IoT devices that capture unique modalities and inherent challenges of IoT data. In this work, we introduce FedAIoT, an FL benchmark for AIoT to fill this critical gap. FedAIoT includes eight datatsets collected from a wide range of IoT devices. These datasets cover unique IoT modalities and target representative applications of AIoT. FedAIoT also includes a unified end-to-end FL framework for AIoT that simplifies benchmarking the performance of the datasets. Our benchmark results shed light on the opportunities and challenges of FL for AIoT. We hope FedAIoT could serve as an invaluable resource to foster advancements in the important field of FL for AIoT. The repository of FedAIoT is maintained at https://github.com/AIoT-MLSys-Lab/FedAIoT.
&lt;/p&gt;</description></item></channel></rss>