<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#31227;&#21160;&#36793;&#32536;&#35745;&#31639;&#20013;&#30340;&#20219;&#21153;&#21368;&#36733;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;&#38754;&#20020;&#30528;&#36830;&#32493;&#21644;&#31163;&#25955;&#36164;&#28304;&#32422;&#26463;&#30340;&#25361;&#25112;&#65292;&#20294;&#26377;&#26395;&#23454;&#29616;&#39640;&#25928;&#30340;&#20219;&#21153;&#20998;&#37197;&#12290;</title><link>https://arxiv.org/abs/2402.11653</link><description>&lt;p&gt;
&#31227;&#21160;&#36793;&#32536;&#35745;&#31639;&#20013;&#32452;&#21512;&#24335;&#23458;&#25143;&#31471;-&#20027;&#25511;&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#29992;&#20110;&#20219;&#21153;&#21368;&#36733;
&lt;/p&gt;
&lt;p&gt;
Combinatorial Client-Master Multiagent Deep Reinforcement Learning for Task Offloading in Mobile Edge Computing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11653
&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#31227;&#21160;&#36793;&#32536;&#35745;&#31639;&#20013;&#30340;&#20219;&#21153;&#21368;&#36733;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;&#38754;&#20020;&#30528;&#36830;&#32493;&#21644;&#31163;&#25955;&#36164;&#28304;&#32422;&#26463;&#30340;&#25361;&#25112;&#65292;&#20294;&#26377;&#26395;&#23454;&#29616;&#39640;&#25928;&#30340;&#20219;&#21153;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#20986;&#29616;&#20102;&#22823;&#37327;&#25191;&#34892;&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#30340;&#31227;&#21160;&#24212;&#29992;&#31243;&#24207;&#65292;&#22914;&#35270;&#39057;&#27969;&#23186;&#20307;&#12289;&#25968;&#25454;&#25366;&#25496;&#12289;&#34394;&#25311;&#29616;&#23454;&#12289;&#22686;&#24378;&#29616;&#23454;&#12289;&#22270;&#20687;&#22788;&#29702;&#12289;&#35270;&#39057;&#22788;&#29702;&#12289;&#20154;&#33080;&#35782;&#21035;&#21644;&#22312;&#32447;&#28216;&#25103;&#12290;&#31227;&#21160;&#36793;&#32536;&#35745;&#31639;&#65288;MEC&#65289;&#24050;&#32463;&#25104;&#20026;&#19968;&#31181;&#28385;&#36275;&#29992;&#25143;&#35774;&#22791;&#65288;UDs&#65289;&#26085;&#30410;&#22686;&#38271;&#30340;&#35745;&#31639;&#38656;&#27714;&#30340;&#26377;&#21069;&#36884;&#30340;&#25216;&#26415;&#12290;MEC&#20013;&#30340;&#20219;&#21153;&#21368;&#36733;&#26159;&#19968;&#31181;&#31574;&#30053;&#65292;&#36890;&#36807;&#22312;UDs&#21644;MEC&#26381;&#21153;&#22120;&#20043;&#38388;&#20998;&#37197;&#20219;&#21153;&#26469;&#28385;&#36275;UDs&#30340;&#38656;&#27714;&#12290;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;DRL&#65289;&#22312;&#20219;&#21153;&#21368;&#36733;&#38382;&#39064;&#20013;&#21463;&#21040;&#20851;&#27880;&#65292;&#22240;&#20026;&#23427;&#21487;&#20197;&#36866;&#24212;&#21160;&#24577;&#21464;&#21270;&#24182;&#26368;&#23567;&#21270;&#22312;&#32447;&#35745;&#31639;&#22797;&#26434;&#24615;&#12290;&#28982;&#32780;&#65292;UDs&#21644;MEC&#26381;&#21153;&#22120;&#19978;&#30340;&#21508;&#31181;&#31867;&#22411;&#30340;&#36830;&#32493;&#21644;&#31163;&#25955;&#36164;&#28304;&#32422;&#26463;&#23545;&#26377;&#25928;&#30340;&#22522;&#20110;DRL&#30340;&#20219;&#21153;&#21368;&#36733;&#35774;&#35745;&#26500;&#25104;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11653v1 Announce Type: new  Abstract: Recently, there has been an explosion of mobile applications that perform computationally intensive tasks such as video streaming, data mining, virtual reality, augmented reality, image processing, video processing, face recognition, and online gaming. However, user devices (UDs), such as tablets and smartphones, have a limited ability to perform the computation needs of the tasks. Mobile edge computing (MEC) has emerged as a promising technology to meet the increasing computing demands of UDs. Task offloading in MEC is a strategy that meets the demands of UDs by distributing tasks between UDs and MEC servers. Deep reinforcement learning (DRL) is gaining attention in task-offloading problems because it can adapt to dynamic changes and minimize online computational complexity. However, the various types of continuous and discrete resource constraints on UDs and MEC servers pose challenges to the design of an efficient DRL-based task-offlo
&lt;/p&gt;</description></item></channel></rss>