<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>ScatterMoE&#26159;&#19968;&#31181;&#22312;GPU&#19978;&#23454;&#29616;&#30340;&#31232;&#30095;&#19987;&#23478;&#28151;&#21512;&#27169;&#22411;&#65292;&#36890;&#36807;&#36991;&#20813;&#22635;&#20805;&#21644;&#36807;&#22810;&#22797;&#21046;&#36755;&#20837;&#65292;&#25552;&#39640;&#20102;&#25512;&#29702;&#21644;&#35757;&#32451;&#36895;&#24230;&#65292;&#24182;&#20943;&#23569;&#20102;&#20869;&#23384;&#21344;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.08245</link><description>&lt;p&gt;
&#20998;&#25955;&#24335;&#19987;&#23478;&#28151;&#21512;&#27169;&#22411;&#30340;&#23454;&#29616;
&lt;/p&gt;
&lt;p&gt;
Scattered Mixture-of-Experts Implementation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08245
&lt;/p&gt;
&lt;p&gt;
ScatterMoE&#26159;&#19968;&#31181;&#22312;GPU&#19978;&#23454;&#29616;&#30340;&#31232;&#30095;&#19987;&#23478;&#28151;&#21512;&#27169;&#22411;&#65292;&#36890;&#36807;&#36991;&#20813;&#22635;&#20805;&#21644;&#36807;&#22810;&#22797;&#21046;&#36755;&#20837;&#65292;&#25552;&#39640;&#20102;&#25512;&#29702;&#21644;&#35757;&#32451;&#36895;&#24230;&#65292;&#24182;&#20943;&#23569;&#20102;&#20869;&#23384;&#21344;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;ScatterMoE&#65292;&#36825;&#26159;&#19968;&#31181;&#22312;GPU&#19978;&#23454;&#29616;&#30340;&#31232;&#30095;&#19987;&#23478;&#28151;&#21512;&#27169;&#22411;&#65288;SMoE&#65289;&#12290;ScatterMoE&#22312;&#29616;&#26377;&#23454;&#29616;&#30340;&#22522;&#30784;&#19978;&#26500;&#24314;&#65292;&#20811;&#26381;&#20102;&#19968;&#20123;&#38480;&#21046;&#20197;&#25552;&#39640;&#25512;&#29702;&#21644;&#35757;&#32451;&#36895;&#24230;&#65292;&#24182;&#20943;&#23569;&#20869;&#23384;&#21344;&#29992;&#12290;&#35813;&#23454;&#29616;&#36890;&#36807;&#36991;&#20813;&#22635;&#20805;&#21644;&#36807;&#22810;&#22797;&#21046;&#36755;&#20837;&#26469;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;ParallelLinear&#65292;&#36825;&#26159;&#25105;&#20204;&#29992;&#26469;&#26500;&#24314;&#23454;&#29616;&#30340;&#20027;&#35201;&#32452;&#20214;&#65292;&#20197;&#21450;&#29992;&#20110;&#21152;&#36895;&#25805;&#20316;&#30340;&#21508;&#31181;&#20869;&#26680;&#12290;&#25105;&#20204;&#23545;&#25105;&#20204;&#30340;&#23454;&#29616;&#36827;&#34892;&#20102;&#19982;Megablocks&#30340;&#22522;&#20934;&#27979;&#35797;&#65292;&#24182;&#23637;&#31034;&#23427;&#21487;&#20197;&#23454;&#29616;&#26356;&#39640;&#30340;&#21534;&#21520;&#37327;&#21644;&#26356;&#20302;&#30340;&#20869;&#23384;&#21344;&#29992;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;ParallelLinear&#22914;&#20309;&#36890;&#36807;&#23637;&#31034;Mixture of Attention&#30340;&#23454;&#29616;&#26469;&#25193;&#23637;&#19987;&#23478;&#28151;&#21512;&#27169;&#22411;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08245v1 Announce Type: new  Abstract: We present ScatterMoE, an implementation of Sparse Mixture-of-Experts (SMoE) on GPUs. ScatterMoE builds upon existing implementations, and overcoming some of the limitations to improve inference and training speed, and memory footprint. This implementation achieves this by avoiding padding and making excessive copies of the input.   We introduce ParallelLinear, the main component we use to build our implementation and the various kernels used to speed up the operation. We benchmark our implementation against Megablocks, and show that it enables a higher throughput and lower memory footprint. We also show how ParallelLinear enables extension of the Mixture-of-Experts concept by demonstrating with an implementation of Mixture of Attention.
&lt;/p&gt;</description></item></channel></rss>