<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#24046;&#20998;&#38544;&#31169;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#65292;&#22312;&#36229;&#31435;&#26041;&#20307;&#25968;&#25454;&#27969;&#19978;&#23454;&#29616;&#20102;&#36817;&#20046;&#26368;&#20248;&#30340;&#31934;&#24230;&#30028;&#38480;&#65292;&#20063;&#25512;&#24191;&#20102;&#20043;&#21069;&#20851;&#20110;&#35745;&#25968;&#26597;&#35810;&#30340;&#36830;&#32493;&#21457;&#24067;&#27169;&#22411;&#30340;&#24037;&#20316;&#65292;&#20165;&#38656;&#35201;&#39069;&#22806;&#30340;&#22810;&#39033;&#24335;&#23545;&#25968;&#22240;&#23376;&#12290;</title><link>https://arxiv.org/abs/2402.08012</link><description>&lt;p&gt;
&#22312;&#32447;&#24046;&#20998;&#38544;&#31169;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Online Differentially Private Synthetic Data Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08012
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#24046;&#20998;&#38544;&#31169;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#65292;&#22312;&#36229;&#31435;&#26041;&#20307;&#25968;&#25454;&#27969;&#19978;&#23454;&#29616;&#20102;&#36817;&#20046;&#26368;&#20248;&#30340;&#31934;&#24230;&#30028;&#38480;&#65292;&#20063;&#25512;&#24191;&#20102;&#20043;&#21069;&#20851;&#20110;&#35745;&#25968;&#26597;&#35810;&#30340;&#36830;&#32493;&#21457;&#24067;&#27169;&#22411;&#30340;&#24037;&#20316;&#65292;&#20165;&#38656;&#35201;&#39069;&#22806;&#30340;&#22810;&#39033;&#24335;&#23545;&#25968;&#22240;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#32447;&#24046;&#20998;&#38544;&#31169;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#12290;&#23545;&#20110;&#22312;&#36229;&#31435;&#26041;&#20307;$[0,1]^d$&#20869;&#30340;&#25968;&#25454;&#27969;&#21644;&#26080;&#38480;&#26102;&#38388;&#33539;&#22260;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22312;&#32447;&#31639;&#27861;&#65292;&#27599;&#20010;&#26102;&#38388;$t$&#37117;&#29983;&#25104;&#19968;&#20010;&#24046;&#20998;&#38544;&#31169;&#21512;&#25104;&#25968;&#25454;&#38598;&#12290;&#35813;&#31639;&#27861;&#22312;1-Wasserstein&#36317;&#31163;&#19978;&#23454;&#29616;&#20102;&#36817;&#20046;&#26368;&#20248;&#30340;&#31934;&#24230;&#30028;&#38480;&#65306;&#24403;$d\geq 2$&#26102;&#20026;$O(t^{-1/d}\log(t)$&#65292;&#24403;$d=1$&#26102;&#20026;$O(t^{-1}\log^{4.5}(t)$&#12290;&#36825;&#20010;&#32467;&#26524;&#23558;&#20043;&#21069;&#20851;&#20110;&#35745;&#25968;&#26597;&#35810;&#30340;&#36830;&#32493;&#21457;&#24067;&#27169;&#22411;&#30340;&#24037;&#20316;&#25512;&#24191;&#21040;&#21253;&#25324;Lipschitz&#26597;&#35810;&#12290;&#19982;&#31163;&#32447;&#24773;&#20917;&#19981;&#21516;&#65292;&#31163;&#32447;&#24773;&#20917;&#19979;&#25972;&#20010;&#25968;&#25454;&#38598;&#19968;&#27425;&#24615;&#21487;&#29992;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20165;&#38656;&#35201;&#22312;&#31934;&#24230;&#30028;&#38480;&#20013;&#39069;&#22806;&#30340;&#22810;&#39033;&#24335;&#23545;&#25968;&#22240;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a polynomial-time algorithm for online differentially private synthetic data generation. For a data stream within the hypercube $[0,1]^d$ and an infinite time horizon, we develop an online algorithm that generates a differentially private synthetic dataset at each time $t$. This algorithm achieves a near-optimal accuracy bound of $O(t^{-1/d}\log(t))$ for $d\geq 2$ and $O(t^{-1}\log^{4.5}(t))$ for $d=1$ in the 1-Wasserstein distance. This result generalizes the previous work on the continual release model for counting queries to include Lipschitz queries. Compared to the offline case, where the entire dataset is available at once, our approach requires only an extra polylog factor in the accuracy bound.
&lt;/p&gt;</description></item></channel></rss>