<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#21363;&#23398;&#20064;&#38431;&#21015;&#20013;&#30340;&#25104;&#26412; (CLQ)&#65292;&#29992;&#20110;&#37327;&#21270;&#30001;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#23548;&#33268;&#30340;&#26102;&#38388;&#24179;&#22343;&#38431;&#21015;&#38271;&#24230;&#26368;&#22823;&#22686;&#21152;&#37327;&#12290;&#35813;&#24230;&#37327;&#26041;&#27861;&#21487;&#20197;&#25429;&#25417;&#23398;&#20064;&#38431;&#21015;&#31995;&#32479;&#30340;&#32479;&#35745;&#22797;&#26434;&#24615;&#65292;&#19981;&#23616;&#38480;&#20110;&#28176;&#36817;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2308.07817</link><description>&lt;p&gt;
&#37327;&#21270;&#38431;&#21015;&#31995;&#32479;&#20013;&#30340;&#23398;&#20064;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
Quantifying the Cost of Learning in Queueing Systems. (arXiv:2308.07817v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07817
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#21363;&#23398;&#20064;&#38431;&#21015;&#20013;&#30340;&#25104;&#26412; (CLQ)&#65292;&#29992;&#20110;&#37327;&#21270;&#30001;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#23548;&#33268;&#30340;&#26102;&#38388;&#24179;&#22343;&#38431;&#21015;&#38271;&#24230;&#26368;&#22823;&#22686;&#21152;&#37327;&#12290;&#35813;&#24230;&#37327;&#26041;&#27861;&#21487;&#20197;&#25429;&#25417;&#23398;&#20064;&#38431;&#21015;&#31995;&#32479;&#30340;&#32479;&#35745;&#22797;&#26434;&#24615;&#65292;&#19981;&#23616;&#38480;&#20110;&#28176;&#36817;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38431;&#21015;&#31995;&#32479;&#26159;&#24191;&#27867;&#24212;&#29992;&#30340;&#38543;&#26426;&#27169;&#22411;&#65292;&#24212;&#29992;&#20110;&#36890;&#20449;&#32593;&#32476;&#12289;&#21307;&#30103;&#20445;&#20581;&#12289;&#26381;&#21153;&#31995;&#32479;&#31561;&#31561;&#12290;&#34429;&#28982;&#23427;&#20204;&#30340;&#26368;&#20248;&#25511;&#21046;&#24050;&#32463;&#24471;&#21040;&#20102;&#24191;&#27867;&#30740;&#31350;&#65292;&#20294;&#22823;&#22810;&#25968;&#29616;&#26377;&#26041;&#27861;&#37117;&#20551;&#35774;&#31995;&#32479;&#21442;&#25968;&#30340;&#23436;&#32654;&#30693;&#35782;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#24456;&#24120;&#35265;&#65292;&#22240;&#27492;&#26368;&#36817;&#19968;&#31995;&#21015;&#20851;&#20110;&#38431;&#21015;&#31995;&#32479;&#30340;&#23398;&#20064;&#30340;&#30740;&#31350;&#20135;&#29983;&#20102;&#12290;&#36825;&#20010;&#26032;&#20852;&#30340;&#30740;&#31350;&#26041;&#21521;&#20027;&#35201;&#20851;&#27880;&#25152;&#25552;&#31639;&#27861;&#30340;&#28176;&#36817;&#24615;&#33021;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35748;&#20026;&#28176;&#36817;&#24230;&#37327;&#65292;&#21363;&#30528;&#30524;&#20110;&#21518;&#26399;&#24615;&#33021;&#30340;&#24230;&#37327;&#65292;&#26080;&#27861;&#25429;&#25417;&#23398;&#20064;&#38431;&#21015;&#31995;&#32479;&#20013;&#22266;&#26377;&#30340;&#32479;&#35745;&#22797;&#26434;&#24615;&#65292;&#36825;&#31181;&#22797;&#26434;&#24615;&#36890;&#24120;&#20986;&#29616;&#22312;&#26089;&#26399;&#38454;&#27573;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23398;&#20064;&#38431;&#21015;&#20013;&#30340;&#25104;&#26412; (CLQ)&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#21487;&#20197;&#34913;&#37327;&#30001;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#23548;&#33268;&#30340;&#26102;&#38388;&#24179;&#22343;&#38431;&#21015;&#38271;&#24230;&#30340;&#26368;&#22823;&#22686;&#21152;&#37327;&#12290;&#25105;&#20204;&#23545;&#21333;&#38431;&#21015;&#22810;&#26381;&#21153;&#22120;&#31995;&#32479;&#30340;CLQ&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
Queueing systems are widely applicable stochastic models with use cases in communication networks, healthcare, service systems, etc. Although their optimal control has been extensively studied, most existing approaches assume perfect knowledge of system parameters. Of course, this assumption rarely holds in practice where there is parameter uncertainty, thus motivating a recent line of work on bandit learning for queueing systems. This nascent stream of research focuses on the asymptotic performance of the proposed algorithms.  In this paper, we argue that an asymptotic metric, which focuses on late-stage performance, is insufficient to capture the intrinsic statistical complexity of learning in queueing systems which typically occurs in the early stage. Instead, we propose the Cost of Learning in Queueing (CLQ), a new metric that quantifies the maximum increase in time-averaged queue length caused by parameter uncertainty. We characterize the CLQ of a single-queue multi-server system,
&lt;/p&gt;</description></item></channel></rss>