<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#26412;&#35770;&#25991;&#25506;&#35752;&#20102;&#25991;&#29486;&#23884;&#20837;&#22312;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35780;&#20272;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#36890;&#36807;&#32593;&#32476;&#20998;&#26512;&#21644;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26469;&#35780;&#20272;&#25512;&#33616;&#30340;&#26032;&#39062;&#24615;&#21644;&#22810;&#26679;&#24615;&#12290;&#30740;&#31350;&#34920;&#26126;&#22312;&#25512;&#33616;&#31995;&#32479;&#20013;&#36873;&#25321;&#19981;&#21516;&#30340;&#20195;&#34920;&#24615;&#26041;&#27861;&#20250;&#23545;&#25512;&#33616;&#32467;&#26524;&#30340;&#24615;&#36136;&#20135;&#29983;&#24433;&#21709;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#35770;&#25991;&#23884;&#20837;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#26356;&#22810;&#30340;&#21019;&#26032;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.14984</link><description>&lt;p&gt;
&#25991;&#29486;&#23884;&#20837;&#22312;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;: &#26159;&#30772;&#22351;&#23398;&#31185;&#36793;&#30028;&#36824;&#26159;&#21152;&#24378;&#23427;&#65311;
&lt;/p&gt;
&lt;p&gt;
The Role of Document Embedding in Research Paper Recommender Systems: To Breakdown or to Bolster Disciplinary Borders?. (arXiv:2309.14984v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14984
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25506;&#35752;&#20102;&#25991;&#29486;&#23884;&#20837;&#22312;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20316;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35780;&#20272;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#36890;&#36807;&#32593;&#32476;&#20998;&#26512;&#21644;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26469;&#35780;&#20272;&#25512;&#33616;&#30340;&#26032;&#39062;&#24615;&#21644;&#22810;&#26679;&#24615;&#12290;&#30740;&#31350;&#34920;&#26126;&#22312;&#25512;&#33616;&#31995;&#32479;&#20013;&#36873;&#25321;&#19981;&#21516;&#30340;&#20195;&#34920;&#24615;&#26041;&#27861;&#20250;&#23545;&#25512;&#33616;&#32467;&#26524;&#30340;&#24615;&#36136;&#20135;&#29983;&#24433;&#21709;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#35770;&#25991;&#23884;&#20837;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#26356;&#22810;&#30340;&#21019;&#26032;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24191;&#27867;&#30340;&#25512;&#33616;&#31995;&#32479;&#25991;&#29486;&#20013;&#65292;&#26032;&#39062;&#24615;&#21644;&#22810;&#26679;&#24615;&#34987;&#35748;&#20026;&#26159;&#26377;&#29992;&#25512;&#33616;&#30340;&#20851;&#38190;&#23646;&#24615;&#12290;&#28982;&#32780;&#65292;&#22312;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#31995;&#32479;&#30340;&#20855;&#20307;&#23376;&#39046;&#22495;&#20013;&#65292;&#36825;&#20123;&#23646;&#24615;&#24471;&#21040;&#20102;&#26377;&#38480;&#30340;&#20851;&#27880;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20026;&#31185;&#23398;&#23478;&#25552;&#20379;&#26032;&#39062;&#21644;&#22810;&#26679;&#30340;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#30340;&#37325;&#35201;&#24615;&#12290;&#36825;&#31181;&#26041;&#27861;&#26088;&#22312;&#20943;&#23569;&#38548;&#31163;&#38405;&#35835;&#65292;&#25171;&#30772;&#36807;&#28388;&#27873;&#21644;&#20419;&#36827;&#36328;&#23398;&#31185;&#30740;&#31350;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35780;&#20272;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#30340;&#26032;&#39062;&#24615;&#21644;&#22810;&#26679;&#24615;&#30340;&#26032;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#21033;&#29992;&#20102;&#32593;&#32476;&#20998;&#26512;&#21644;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26041;&#27861;&#12290;&#20351;&#29992;&#36825;&#20010;&#26694;&#26550;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#26356;&#22823;&#30340;&#30740;&#31350;&#35770;&#25991;&#25512;&#33616;&#31995;&#32479;&#20013;&#36873;&#25321;&#20195;&#34920;&#24615;&#26041;&#27861;&#21487;&#20197;&#23545;&#19979;&#28216;&#25512;&#33616;&#30340;&#24615;&#36136;&#65292;&#29305;&#21035;&#26159;&#23427;&#20204;&#30340;&#26032;&#39062;&#24615;&#21644;&#22810;&#26679;&#24615;&#20135;&#29983;&#21487;&#34913;&#37327;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#35770;&#25991;&#23884;&#20837;&#26041;&#27861;&#65292;&#25105;&#20204;&#35777;&#26126;&#23427;&#25552;&#20379;&#20102;&#26356;&#22810;&#30340;&#21019;&#26032;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the extensive recommender systems literature, novelty and diversity have been identified as key properties of useful recommendations. However, these properties have received limited attention in the specific sub-field of research paper recommender systems. In this work, we argue for the importance of offering novel and diverse research paper recommendations to scientists. This approach aims to reduce siloed reading, break down filter bubbles, and promote interdisciplinary research. We propose a novel framework for evaluating the novelty and diversity of research paper recommendations that leverages methods from network analysis and natural language processing. Using this framework, we show that the choice of representational method within a larger research paper recommendation system can have a measurable impact on the nature of downstream recommendations, specifically on their novelty and diversity. We introduce a novel paper embedding method, which we demonstrate offers more innov
&lt;/p&gt;</description></item></channel></rss>