<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>TACOS &#26159;&#19968;&#20010;&#33021;&#22815;&#33258;&#21160;&#21512;&#25104;&#20219;&#24847;&#36755;&#20837;&#32593;&#32476;&#25299;&#25169;&#30340;&#38754;&#21521;&#25299;&#25169;&#32467;&#26500;&#30340;&#38598;&#21512;&#21512;&#25104;&#22120;&#12290;&#19982;&#22522;&#20934;&#31639;&#27861;&#30456;&#27604;&#65292;TACOS &#21512;&#25104;&#30340; All-Reduce &#31639;&#27861;&#36895;&#24230;&#25552;&#39640;&#20102; 3.73 &#20493;&#65292;&#20026; 512-NPU &#31995;&#32479;&#21512;&#25104;&#38598;&#20307;&#31639;&#27861;&#21482;&#38656; 6.1 &#20998;&#38047;&#12290;</title><link>http://arxiv.org/abs/2304.05301</link><description>&lt;p&gt;
TACOS: &#38754;&#21521;&#25299;&#25169;&#32467;&#26500;&#30340;&#20998;&#24067;&#24335;&#35757;&#32451;&#38598;&#21512;&#31639;&#27861;&#21512;&#25104;&#22120;
&lt;/p&gt;
&lt;p&gt;
TACOS: Topology-Aware Collective Algorithm Synthesizer for Distributed Training. (arXiv:2304.05301v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05301
&lt;/p&gt;
&lt;p&gt;
TACOS &#26159;&#19968;&#20010;&#33021;&#22815;&#33258;&#21160;&#21512;&#25104;&#20219;&#24847;&#36755;&#20837;&#32593;&#32476;&#25299;&#25169;&#30340;&#38754;&#21521;&#25299;&#25169;&#32467;&#26500;&#30340;&#38598;&#21512;&#21512;&#25104;&#22120;&#12290;&#19982;&#22522;&#20934;&#31639;&#27861;&#30456;&#27604;&#65292;TACOS &#21512;&#25104;&#30340; All-Reduce &#31639;&#27861;&#36895;&#24230;&#25552;&#39640;&#20102; 3.73 &#20493;&#65292;&#20026; 512-NPU &#31995;&#32479;&#21512;&#25104;&#38598;&#20307;&#31639;&#27861;&#21482;&#38656; 6.1 &#20998;&#38047;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38598;&#32676;&#20043;&#38388;&#30340;&#38598;&#21512;&#36890;&#35759;&#26159;&#20998;&#24067;&#24335;&#35757;&#32451;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;&#36816;&#34892;&#38754;&#21521;&#25299;&#25169;&#32467;&#26500;&#30340;&#38598;&#21512;&#31639;&#27861;&#23545;&#20110;&#20248;&#21270;&#36890;&#35759;&#24615;&#33021;&#20197;&#26368;&#23567;&#21270;&#25317;&#22622;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#30446;&#21069;&#65292;&#27492;&#31867;&#31639;&#27861;&#20165;&#36866;&#29992;&#20110;&#19968;&#23567;&#37096;&#20998;&#31616;&#21333;&#25299;&#25169;&#32467;&#26500;&#65292;&#38480;&#21046;&#20102;&#35757;&#32451;&#38598;&#32676;&#20013;&#37319;&#29992;&#30340;&#25299;&#25169;&#32467;&#26500;&#24182;&#22788;&#29702;&#30001;&#20110;&#32593;&#32476;&#25925;&#38556;&#32780;&#20135;&#29983;&#30340;&#19981;&#35268;&#21017;&#25299;&#25169;&#32467;&#26500;&#12290; &#26412;&#25991;&#25552;&#20986;&#20102; TACOS&#65292;&#36825;&#26159;&#19968;&#20010;&#21487;&#33258;&#21160;&#21512;&#25104;&#20219;&#24847;&#36755;&#20837;&#32593;&#32476;&#25299;&#25169;&#30340;&#38754;&#21521;&#25299;&#25169;&#32467;&#26500;&#30340;&#38598;&#21512;&#21512;&#25104;&#22120;&#12290;TACOS &#21512;&#25104;&#30340; All-Reduce &#31639;&#27861;&#27604;&#22522;&#32447;&#31639;&#27861;&#24555;&#20102; 3.73 &#20493;&#65292;&#24182;&#20026; 512-NPU &#31995;&#32479;&#21512;&#25104;&#38598;&#20307;&#31639;&#27861;&#20165;&#38656; 6.1 &#20998;&#38047;&#12290;
&lt;/p&gt;
&lt;p&gt;
Collective communications are an indispensable part of distributed training. Running a topology-aware collective algorithm is crucial for optimizing communication performance by minimizing congestion. Today such algorithms only exist for a small set of simple topologies, limiting the topologies employed in training clusters and handling irregular topologies due to network failures. In this paper, we propose TACOS, an automated topology-aware collective synthesizer for arbitrary input network topologies. TACOS synthesized 3.73x faster All-Reduce algorithm over baselines, and synthesized collective algorithms for 512-NPU system in just 6.1 minutes.
&lt;/p&gt;</description></item></channel></rss>