<rss version="2.0"><channel><title>Chat Arxiv cs.DL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DL</description><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;33881&#20221;&#19987;&#21033;&#25991;&#20214;&#30340;&#26679;&#26412;&#65292;&#23558;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#38416;&#37322;&#20026;&#30693;&#35782;&#22270;&#35889;&#65292;&#20174;&#32780;&#25581;&#31034;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#35821;&#35328;&#21644;&#32467;&#26500;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2312.06355</link><description>&lt;p&gt;
&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#35821;&#35328;&#21644;&#32467;&#26500;&#22522;&#30784;
&lt;/p&gt;
&lt;p&gt;
Linguistic and Structural Basis of Engineering Design Knowledge. (arXiv:2312.06355v2 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.06355
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;33881&#20221;&#19987;&#21033;&#25991;&#20214;&#30340;&#26679;&#26412;&#65292;&#23558;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#38416;&#37322;&#20026;&#30693;&#35782;&#22270;&#35889;&#65292;&#20174;&#32780;&#25581;&#31034;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#35821;&#35328;&#21644;&#32467;&#26500;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#21697;&#25551;&#36848;&#26159;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#20027;&#35201;&#36733;&#20307;&#65292;&#26082;&#26159;&#35774;&#35745;&#36807;&#31243;&#30340;&#20135;&#29289;&#65292;&#20063;&#26159;&#39537;&#21160;&#35774;&#35745;&#36807;&#31243;&#30340;&#22240;&#32032;&#12290;&#23613;&#31649;&#29289;&#21697;&#21487;&#20197;&#20197;&#19981;&#21516;&#30340;&#20869;&#28085;&#36827;&#34892;&#25551;&#36848;&#65292;&#20294;&#35774;&#35745;&#36807;&#31243;&#38656;&#35201;&#19968;&#31181;&#25551;&#36848;&#26469;&#20307;&#29616;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#65292;&#36825;&#36890;&#36807;&#23454;&#20307;&#21644;&#20851;&#31995;&#30340;&#22797;&#26434;&#23433;&#25490;&#22312;&#25991;&#26412;&#20013;&#34920;&#29616;&#20986;&#26469;&#12290;&#34429;&#28982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21487;&#20197;&#20174;&#21508;&#31181;&#25991;&#26412;&#20013;&#23398;&#20064;&#65292;&#20294;&#23427;&#20204;&#23578;&#26410;&#29983;&#25104;&#20307;&#29616;&#26126;&#30830;&#30340;&#24037;&#31243;&#35774;&#35745;&#20107;&#23454;&#30340;&#25991;&#26412;&#12290;&#29616;&#26377;&#30340;&#26412;&#20307;&#35770;&#35774;&#35745;&#29702;&#35770;&#24456;&#23569;&#33021;&#25351;&#23548;&#30446;&#21069;&#20165;&#38480;&#20110;&#26500;&#24605;&#21644;&#23398;&#20064;&#30446;&#30340;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#24212;&#29992;&#12290;&#26412;&#25991;&#20174;33881&#20221;&#19987;&#21033;&#25991;&#20214;&#30340;&#22823;&#26679;&#26412;&#20013;&#23558;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#38416;&#37322;&#20026;&#30693;&#35782;&#22270;&#35889;&#12290;&#25105;&#20204;&#30740;&#31350;&#36825;&#20123;&#30693;&#35782;&#22270;&#35889;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#20197;&#29702;&#35299;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#35821;&#35328;&#21644;&#32467;&#26500;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artefact descriptions are the primary carriers of engineering design knowledge that is both an outcome and a driver of the design process. While an artefact could be described in different connotations, the design process requires a description to embody engineering design knowledge, which is expressed in the text through intricate placement of entities and relationships. As large-language models learn from all kinds of text merely as a sequence of characters/tokens, these are yet to generate text that embodies explicit engineering design facts. Existing ontological design theories are less likely to guide the large-language models whose applications are currently limited to ideation and learning purposes. In this article, we explicate engineering design knowledge as knowledge graphs from a large sample of 33,881 patent documents. We examine the constituents of these knowledge graphs to understand the linguistic and structural basis of engineering design knowledge. In terms of linguist
&lt;/p&gt;</description></item></channel></rss>