<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>FedAIoT&#26159;&#19968;&#20010;&#29992;&#20110;AIoT&#30340;&#32852;&#37030;&#23398;&#20064;&#22522;&#20934;&#65292;&#21253;&#25324;&#20843;&#20010;&#25968;&#25454;&#38598;&#21644;&#19968;&#20010;&#32479;&#19968;&#30340;&#31471;&#21040;&#31471;FL&#26694;&#26550;&#12290;&#23427;&#22635;&#34917;&#20102;&#29616;&#26377;FL&#30740;&#31350;&#20013;&#32570;&#20047;&#30495;&#23454;&#29289;&#32852;&#32593;&#35774;&#22791;&#25968;&#25454;&#38598;&#30340;&#20851;&#38190;&#24046;&#36317;&#65292;&#24182;&#25581;&#31034;&#20102;FL&#22312;AIoT&#39046;&#22495;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2310.00109</link><description>&lt;p&gt;
FedAIoT: &#19968;&#31181;&#29992;&#20110;&#29289;&#32852;&#32593;&#20154;&#24037;&#26234;&#33021;&#30340;&#32852;&#37030;&#23398;&#20064;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
FedAIoT: A Federated Learning Benchmark for Artificial Intelligence of Things. (arXiv:2310.00109v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00109
&lt;/p&gt;
&lt;p&gt;
FedAIoT&#26159;&#19968;&#20010;&#29992;&#20110;AIoT&#30340;&#32852;&#37030;&#23398;&#20064;&#22522;&#20934;&#65292;&#21253;&#25324;&#20843;&#20010;&#25968;&#25454;&#38598;&#21644;&#19968;&#20010;&#32479;&#19968;&#30340;&#31471;&#21040;&#31471;FL&#26694;&#26550;&#12290;&#23427;&#22635;&#34917;&#20102;&#29616;&#26377;FL&#30740;&#31350;&#20013;&#32570;&#20047;&#30495;&#23454;&#29289;&#32852;&#32593;&#35774;&#22791;&#25968;&#25454;&#38598;&#30340;&#20851;&#38190;&#24046;&#36317;&#65292;&#24182;&#25581;&#31034;&#20102;FL&#22312;AIoT&#39046;&#22495;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29289;&#32852;&#32593;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#65292;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#20855;&#26377;&#37325;&#35201;&#30340;&#30456;&#20851;&#24615;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;FL&#30740;&#31350;&#24182;&#19981;&#26159;&#22522;&#20110;&#20174;&#30495;&#23454;&#29289;&#32852;&#32593;&#35774;&#22791;&#25910;&#38598;&#30340;&#25968;&#25454;&#38598;&#65292;&#36825;&#20123;&#25968;&#25454;&#38598;&#25429;&#25417;&#20102;&#29289;&#32852;&#32593;&#25968;&#25454;&#30340;&#29420;&#29305;&#27169;&#24335;&#21644;&#22266;&#26377;&#25361;&#25112;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;FedAIoT&#65292;&#19968;&#31181;&#29992;&#20110;AIoT&#30340;FL&#22522;&#20934;&#65292;&#20197;&#22635;&#34917;&#36825;&#20010;&#20851;&#38190;&#30340;&#24046;&#36317;&#12290;FedAIoT&#21253;&#25324;&#20174;&#21508;&#31181;&#29289;&#32852;&#32593;&#35774;&#22791;&#25910;&#38598;&#30340;&#20843;&#20010;&#25968;&#25454;&#38598;&#12290;&#36825;&#20123;&#25968;&#25454;&#38598;&#28085;&#30422;&#20102;&#29289;&#32852;&#32593;&#30340;&#29420;&#29305;&#27169;&#24335;&#65292;&#24182;&#38024;&#23545;AIoT&#30340;&#20856;&#22411;&#24212;&#29992;&#12290;FedAIoT&#36824;&#21253;&#25324;&#19968;&#31181;&#29992;&#20110;AIoT&#30340;&#32479;&#19968;&#30340;&#31471;&#21040;&#31471;FL&#26694;&#26550;&#65292;&#31616;&#21270;&#20102;&#25968;&#25454;&#38598;&#24615;&#33021;&#30340;&#22522;&#20934;&#27979;&#35797;&#12290;&#25105;&#20204;&#30340;&#22522;&#20934;&#27979;&#35797;&#32467;&#26524;&#25581;&#31034;&#20102;FL&#22312;AIoT&#39046;&#22495;&#30340;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;&#25105;&#20204;&#24076;&#26395;FedAIoT&#33021;&#25104;&#20026;&#22312;FL for AIoT&#36825;&#19968;&#37325;&#35201;&#39046;&#22495;&#25512;&#21160;&#36827;&#23637;&#30340;&#29645;&#36149;&#36164;&#28304;&#12290;FedAIoT&#30340;&#20195;&#30721;&#20179;&#24211;&#20301;&#20110;https://github.com/AIoT-MLSys-Lab/FedAIoT&#12290;
&lt;/p&gt;
&lt;p&gt;
There is a significant relevance of federated learning (FL) in the realm of Artificial Intelligence of Things (AIoT). However, most existing FL works are not conducted on datasets collected from authentic IoT devices that capture unique modalities and inherent challenges of IoT data. In this work, we introduce FedAIoT, an FL benchmark for AIoT to fill this critical gap. FedAIoT includes eight datatsets collected from a wide range of IoT devices. These datasets cover unique IoT modalities and target representative applications of AIoT. FedAIoT also includes a unified end-to-end FL framework for AIoT that simplifies benchmarking the performance of the datasets. Our benchmark results shed light on the opportunities and challenges of FL for AIoT. We hope FedAIoT could serve as an invaluable resource to foster advancements in the important field of FL for AIoT. The repository of FedAIoT is maintained at https://github.com/AIoT-MLSys-Lab/FedAIoT.
&lt;/p&gt;</description></item></channel></rss>