<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#23646;&#24615;&#27979;&#35797;&#31639;&#27861;&#26041;&#38754;&#30340;&#30740;&#31350;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36817;&#20284;&#32447;&#24615;&#35268;&#21010;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#22312;&#20449;&#24687;&#29702;&#35770;&#19978;&#26368;&#20248;&#22320;&#35299;&#20915;&#26657;&#20934;&#24615;&#27979;&#35797;&#38382;&#39064;&#65288;&#26368;&#22810;&#19968;&#20010;&#24120;&#25968;&#20493;&#25968;&#65289;&#12290;</title><link>https://arxiv.org/abs/2402.13187</link><description>&lt;p&gt;
&#22312;&#27425;&#32447;&#24615;&#26102;&#38388;&#20869;&#27979;&#35797;&#26657;&#20934;&#24615;
&lt;/p&gt;
&lt;p&gt;
Testing Calibration in Subquadratic Time
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13187
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#23646;&#24615;&#27979;&#35797;&#31639;&#27861;&#26041;&#38754;&#30340;&#30740;&#31350;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36817;&#20284;&#32447;&#24615;&#35268;&#21010;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#22312;&#20449;&#24687;&#29702;&#35770;&#19978;&#26368;&#20248;&#22320;&#35299;&#20915;&#26657;&#20934;&#24615;&#27979;&#35797;&#38382;&#39064;&#65288;&#26368;&#22810;&#19968;&#20010;&#24120;&#25968;&#20493;&#25968;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#30340;&#26426;&#22120;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#25991;&#29486;&#20013;&#65292;&#26657;&#20934;&#24615;&#24050;&#32463;&#25104;&#20026;&#20108;&#20803;&#39044;&#27979;&#27169;&#22411;&#36755;&#20986;&#30340;&#19968;&#20010;&#20540;&#24471;&#26399;&#26395;&#21644;&#24191;&#27867;&#30740;&#31350;&#30340;&#32479;&#35745;&#24615;&#36136;&#12290;&#28982;&#32780;&#65292;&#27979;&#37327;&#27169;&#22411;&#26657;&#20934;&#24615;&#30340;&#31639;&#27861;&#26041;&#38754;&#20173;&#28982;&#30456;&#23545;&#36739;&#23569;&#34987;&#25506;&#32034;&#12290;&#22312;&#35770;&#25991; [BGHN23] &#30340;&#21551;&#21457;&#19979;&#65292;&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20005;&#26684;&#30340;&#26694;&#26550;&#26469;&#34913;&#37327;&#21040;&#26657;&#20934;&#24615;&#30340;&#36317;&#31163;&#65292;&#25105;&#20204;&#36890;&#36807;&#23646;&#24615;&#27979;&#35797;&#30340;&#35270;&#35282;&#24341;&#20837;&#20102;&#26657;&#20934;&#24615;&#30740;&#31350;&#30340;&#31639;&#27861;&#26041;&#38754;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#20174;&#26679;&#26412;&#20013;&#36827;&#34892;&#26657;&#20934;&#24615;&#27979;&#35797;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#20174;&#20998;&#24067; $\mathcal{D}$&#65288;&#39044;&#27979;&#65292;&#20108;&#20803;&#32467;&#26524;&#65289;&#20013;&#32473;&#20986; $n$ &#27425;&#25277;&#26679;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#21306;&#20998; $\mathcal{D}$ &#23436;&#20840;&#26657;&#20934;&#21644; $\mathcal{D}$ &#36317;&#31163;&#26657;&#20934;&#24615;&#20026; $\varepsilon$ &#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13187v1 Announce Type: new  Abstract: In the recent literature on machine learning and decision making, calibration has emerged as a desirable and widely-studied statistical property of the outputs of binary prediction models. However, the algorithmic aspects of measuring model calibration have remained relatively less well-explored. Motivated by [BGHN23], which proposed a rigorous framework for measuring distances to calibration, we initiate the algorithmic study of calibration through the lens of property testing. We define the problem of calibration testing from samples where given $n$ draws from a distribution $\mathcal{D}$ on (predictions, binary outcomes), our goal is to distinguish between the case where $\mathcal{D}$ is perfectly calibrated, and the case where $\mathcal{D}$ is $\varepsilon$-far from calibration.   We design an algorithm based on approximate linear programming, which solves calibration testing information-theoretically optimally (up to constant factor
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Metropolis-adjusted Mirror Langevin&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#32422;&#26463;&#31354;&#38388;&#20013;&#36827;&#34892;&#24555;&#36895;&#37319;&#26679;&#12290;&#36825;&#31181;&#31639;&#27861;&#26159;&#23545;Mirror Langevin&#31639;&#27861;&#30340;&#25913;&#36827;&#65292;&#36890;&#36807;&#28155;&#21152;&#25509;&#21463;-&#25298;&#32477;&#36807;&#28388;&#22120;&#26469;&#28040;&#38500;&#28176;&#36817;&#20559;&#24046;&#65292;&#24182;&#20855;&#26377;&#25351;&#25968;&#20248;&#21270;&#20381;&#36182;&#12290;</title><link>https://arxiv.org/abs/2312.08823</link><description>&lt;p&gt;
&#20351;&#29992;Metropolis-adjusted Mirror Langevin&#31639;&#27861;&#20174;&#32422;&#26463;&#31354;&#38388;&#20013;&#24555;&#36895;&#37319;&#26679;
&lt;/p&gt;
&lt;p&gt;
Fast sampling from constrained spaces using the Metropolis-adjusted Mirror Langevin algorithm
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.08823
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Metropolis-adjusted Mirror Langevin&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#32422;&#26463;&#31354;&#38388;&#20013;&#36827;&#34892;&#24555;&#36895;&#37319;&#26679;&#12290;&#36825;&#31181;&#31639;&#27861;&#26159;&#23545;Mirror Langevin&#31639;&#27861;&#30340;&#25913;&#36827;&#65292;&#36890;&#36807;&#28155;&#21152;&#25509;&#21463;-&#25298;&#32477;&#36807;&#28388;&#22120;&#26469;&#28040;&#38500;&#28176;&#36817;&#20559;&#24046;&#65292;&#24182;&#20855;&#26377;&#25351;&#25968;&#20248;&#21270;&#20381;&#36182;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;Metropolis-adjusted Mirror Langevin&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#20854;&#25903;&#25345;&#26159;&#32039;&#20984;&#38598;&#30340;&#20998;&#24067;&#20013;&#36827;&#34892;&#36817;&#20284;&#37319;&#26679;&#12290;&#35813;&#31639;&#27861;&#22312;Mirror Langevin&#31639;&#27861;&#65288;Zhang et al., 2020&#65289;&#30340;&#21333;&#27493;&#39532;&#23572;&#31185;&#22827;&#38142;&#20013;&#28155;&#21152;&#20102;&#19968;&#20010;&#25509;&#21463;-&#25298;&#32477;&#36807;&#28388;&#22120;&#65292;Mirror Langevin&#31639;&#27861;&#26159;Mirror Langevin&#21160;&#21147;&#23398;&#30340;&#22522;&#26412;&#31163;&#25955;&#21270;&#12290;&#30001;&#20110;&#21253;&#21547;&#20102;&#36825;&#20010;&#36807;&#28388;&#22120;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#30456;&#23545;&#20110;&#30446;&#26631;&#26159;&#26080;&#20559;&#30340;&#65292;&#32780;&#24050;&#30693;&#30340;Mirror Langevin&#31639;&#27861;&#31561;Mirror Langevin&#21160;&#21147;&#23398;&#30340;&#31163;&#25955;&#21270;&#20855;&#26377;&#28176;&#36817;&#20559;&#24046;&#12290;&#23545;&#20110;&#35813;&#31639;&#27861;&#65292;&#25105;&#20204;&#36824;&#32473;&#20986;&#20102;&#28151;&#21512;&#21040;&#19968;&#20010;&#30456;&#23545;&#24179;&#28369;&#12289;&#20984;&#24615;&#22909;&#19988;&#19982;&#33258;&#20849;&#36717;&#38236;&#20687;&#20989;&#25968;&#30456;&#20851;&#30340;&#32422;&#26463;&#20998;&#24067;&#25152;&#38656;&#36845;&#20195;&#27425;&#25968;&#30340;&#19978;&#30028;&#12290;&#30001;&#20110;&#21253;&#21547;Metropolis-Hastings&#36807;&#28388;&#22120;&#23548;&#33268;&#30340;&#39532;&#23572;&#31185;&#22827;&#38142;&#26159;&#21487;&#36870;&#30340;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#23545;&#35823;&#24046;&#30340;&#25351;&#25968;&#20248;&#21270;&#20381;&#36182;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new method called the Metropolis-adjusted Mirror Langevin algorithm for approximate sampling from distributions whose support is a compact and convex set. This algorithm adds an accept-reject filter to the Markov chain induced by a single step of the Mirror Langevin algorithm (Zhang et al., 2020), which is a basic discretisation of the Mirror Langevin dynamics. Due to the inclusion of this filter, our method is unbiased relative to the target, while known discretisations of the Mirror Langevin dynamics including the Mirror Langevin algorithm have an asymptotic bias. For this algorithm, we also give upper bounds for the number of iterations taken to mix to a constrained distribution whose potential is relatively smooth, convex, and Lipschitz continuous with respect to a self-concordant mirror function. As a consequence of the reversibility of the Markov chain induced by the inclusion of the Metropolis-Hastings filter, we obtain an exponentially better dependence on the erro
&lt;/p&gt;</description></item></channel></rss>