<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#32473;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#12289;&#39640;&#25928;&#12289;&#30830;&#23450;&#24615;&#30340;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#30340;&#26657;&#20934;&#36317;&#31163;&#35823;&#24046;&#26368;&#22810;&#20026;$2\sqrt{T}$</title><link>https://arxiv.org/abs/2402.11410</link><description>&lt;p&gt;
&#33719;&#24471;$2\sqrt{T}$&#21040;&#26657;&#20934;&#30340;&#22522;&#26412;&#39044;&#27979;&#22120;
&lt;/p&gt;
&lt;p&gt;
An Elementary Predictor Obtaining $2\sqrt{T}$ Distance to Calibration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11410
&lt;/p&gt;
&lt;p&gt;
&#32473;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#12289;&#39640;&#25928;&#12289;&#30830;&#23450;&#24615;&#30340;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#30340;&#26657;&#20934;&#36317;&#31163;&#35823;&#24046;&#26368;&#22810;&#20026;$2\sqrt{T}$
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Blasiok&#31561;&#20154;[2023]&#25552;&#20986;&#20102;&#26657;&#20934;&#36317;&#31163;&#20316;&#20026;&#19968;&#31181;&#33258;&#28982;&#30340;&#26657;&#20934;&#35823;&#24046;&#24230;&#37327;&#65292;&#19982;&#39044;&#26399;&#30340;&#26657;&#20934;&#35823;&#24046;(ECE)&#19981;&#21516;&#65292;&#23427;&#26159;&#36830;&#32493;&#30340;&#12290;&#26368;&#36817;&#65292;Qiao&#21644;Zheng [2024]&#32473;&#20986;&#20102;&#19968;&#20010;&#38750;&#26500;&#36896;&#24615;&#30340;&#35770;&#35777;&#65292;&#24314;&#31435;&#20102;&#19968;&#31181;&#22312;&#32447;&#39044;&#27979;&#22120;&#30340;&#23384;&#22312;&#65292;&#35813;&#39044;&#27979;&#22120;&#21487;&#20197;&#22312;&#23545;&#25239;&#35774;&#32622;&#20013;&#33719;&#24471;$O(\sqrt{T})$&#30340;&#26657;&#20934;&#36317;&#31163;&#65292;&#32780;&#23545;&#20110;ECE&#26469;&#35828;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;&#20182;&#20204;&#23558;&#25214;&#21040;&#19968;&#31181;&#26126;&#30830;&#30340;&#12289;&#39640;&#25928;&#30340;&#31639;&#27861;&#20316;&#20026;&#19968;&#20010;&#38656;&#35201;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#12289;&#39640;&#25928;&#12289;&#30830;&#23450;&#24615;&#30340;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#30340;&#26657;&#20934;&#36317;&#31163;&#35823;&#24046;&#26368;&#22810;&#20026;$2\sqrt{T}$&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11410v1 Announce Type: new  Abstract: Blasiok et al. [2023] proposed distance to calibration as a natural measure of calibration error that unlike expected calibration error (ECE) is continuous. Recently, Qiao and Zheng [2024] gave a non-constructive argument establishing the existence of an online predictor that can obtain $O(\sqrt{T})$ distance to calibration in the adversarial setting, which is known to be impossible for ECE. They leave as an open problem finding an explicit, efficient algorithm. We resolve this problem and give an extremely simple, efficient, deterministic algorithm that obtains distance to calibration error at most $2\sqrt{T}$.
&lt;/p&gt;</description></item></channel></rss>