<rss version="2.0"><channel><title>Chat Arxiv cs.DS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DS</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#26032;&#30340;SAT&#32534;&#30721;&#30340;&#20559;&#24207;&#27169;&#22411;&#29992;&#20110;&#22270;&#30528;&#33394;&#38382;&#39064;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#65292;&#24182;&#23545;&#24102;&#23485;&#30528;&#33394;&#38382;&#39064;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#12290;</title><link>https://arxiv.org/abs/2403.15961</link><description>&lt;p&gt;
SAT&#32534;&#30721;&#30340;&#20559;&#24207;&#27169;&#22411;&#29992;&#20110;&#22270;&#30528;&#33394;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
SAT Encoding of Partial Ordering Models for Graph Coloring Problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15961
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#26032;&#30340;SAT&#32534;&#30721;&#30340;&#20559;&#24207;&#27169;&#22411;&#29992;&#20110;&#22270;&#30528;&#33394;&#38382;&#39064;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#65292;&#24182;&#23545;&#24102;&#23485;&#30528;&#33394;&#38382;&#39064;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#20559;&#24207;&#30340;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#65288;ILP&#65289;&#27169;&#22411;&#30340;&#22270;&#30528;&#33394;&#38382;&#39064;&#65288;GCP&#65289;&#21644;&#24102;&#23485;&#30528;&#33394;&#38382;&#39064;&#65288;BCP&#65289;&#30340;&#26032;SAT&#32534;&#30721;&#12290; GCP&#35201;&#27714;&#32473;&#23450;&#22270;&#30340;&#39030;&#28857;&#20998;&#37197;&#26368;&#23569;&#25968;&#37327;&#30340;&#39068;&#33394;&#65292;&#20197;&#20415;&#27599;&#20004;&#20010;&#30456;&#37051;&#30340;&#39030;&#28857;&#24471;&#21040;&#19981;&#21516;&#30340;&#39068;&#33394;&#12290; BCP&#26159;&#19968;&#20010;&#27867;&#21270;&#38382;&#39064;&#65292;&#20854;&#20013;&#27599;&#26465;&#36793;&#37117;&#26377;&#19968;&#20010;&#26435;&#37325;&#65292;&#35201;&#27714;&#20998;&#37197;&#30340;&#39068;&#33394;&#20043;&#38388;&#26377;&#26368;&#23567;&#30340;&#8220;&#36317;&#31163;&#8221;&#65292;&#30446;&#26631;&#26159;&#26368;&#23567;&#21270;&#20351;&#29992;&#30340;&#8220;&#26368;&#22823;&#8221;&#39068;&#33394;&#12290; &#23545;&#20110;&#34987;&#24191;&#27867;&#30740;&#31350;&#30340;GCP&#65292;&#25105;&#20204;&#22312;DIMACS&#22522;&#20934;&#38598;&#19978;&#23454;&#39564;&#27604;&#36739;&#20102;&#25105;&#20204;&#26032;&#30340;SAT&#32534;&#30721;&#19982;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290; &#25105;&#20204;&#30340;&#35780;&#20272;&#35777;&#23454;&#65292;&#36825;&#31181;SAT&#32534;&#30721;&#23545;&#20110;&#31232;&#30095;&#22270;&#26159;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#29978;&#33267;&#22312;&#19968;&#20123;DIMACS&#31034;&#20363;&#19978;&#32988;&#36807;&#20102;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290; &#23545;&#20110;BCP&#65292;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;&#22522;&#20110;&#20559;&#24207;&#30340;SAT&#21644;ILP&#20844;&#24335;&#30340;&#22823;&#23567;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#23567;&#20110;&#32463;&#20856;&#30340;&#35299;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15961v1 Announce Type: new  Abstract: In this paper, we suggest new SAT encodings of the partial-ordering based ILP model for the graph coloring problem (GCP) and the bandwidth coloring problem (BCP). The GCP asks for the minimum number of colors that can be assigned to the vertices of a given graph such that each two adjacent vertices get different colors. The BCP is a generalization, where each edge has a weight that enforces a minimal "distance" between the assigned colors, and the goal is to minimize the "largest" color used. For the widely studied GCP, we experimentally compare our new SAT encoding to the state-of-the-art approaches on the DIMACS benchmark set. Our evaluation confirms that this SAT encoding is effective for sparse graphs and even outperforms the state-of-the-art on some DIMACS instances. For the BCP, our theoretical analysis shows that the partial-ordering based SAT and ILP formulations have an asymptotically smaller size than that of the classical assi
&lt;/p&gt;</description></item><item><title>&#24341;&#20837;&#24182;&#30740;&#31350;&#20102;&#19968;&#31867;&#24102;&#26377;&#38271;&#26399;&#32422;&#26463;&#30340;&#22312;&#32447;&#24230;&#37327;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22312;&#21487;&#25345;&#32493;&#33021;&#28304;&#21644;&#35745;&#31639;&#31995;&#32479;&#20013;&#22312;&#32447;&#36164;&#28304;&#20998;&#37197;&#24212;&#29992;&#20013;&#30340;&#26368;&#20248;&#31454;&#20105;&#31639;&#27861;&#21644;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>https://arxiv.org/abs/2402.14012</link><description>&lt;p&gt;
&#22312;&#28385;&#36275;&#38271;&#26399;&#32422;&#26463;&#26465;&#20214;&#19979;&#36861;&#36880;&#20984;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Chasing Convex Functions with Long-term Constraints
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14012
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#24182;&#30740;&#31350;&#20102;&#19968;&#31867;&#24102;&#26377;&#38271;&#26399;&#32422;&#26463;&#30340;&#22312;&#32447;&#24230;&#37327;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22312;&#21487;&#25345;&#32493;&#33021;&#28304;&#21644;&#35745;&#31639;&#31995;&#32479;&#20013;&#22312;&#32447;&#36164;&#28304;&#20998;&#37197;&#24212;&#29992;&#20013;&#30340;&#26368;&#20248;&#31454;&#20105;&#31639;&#27861;&#21644;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#24182;&#30740;&#31350;&#20102;&#19968;&#31867;&#24102;&#26377;&#38271;&#26399;&#32422;&#26463;&#30340;&#22312;&#32447;&#24230;&#37327;&#38382;&#39064;&#12290;&#22312;&#36825;&#20123;&#38382;&#39064;&#20013;&#65292;&#19968;&#20010;&#22312;&#32447;&#29609;&#23478;&#22312;&#24230;&#37327;&#31354;&#38388;$(X,d)$&#20013;&#20570;&#20986;&#20915;&#31574;$\mathbf{x}_t$&#65292;&#21516;&#26102;&#26368;&#23567;&#21270;&#20182;&#20204;&#30340;&#21629;&#20013;&#25104;&#26412;$f_t(\mathbf{x}_t)$&#21644;&#30001;&#24230;&#37327;&#30830;&#23450;&#30340;&#20999;&#25442;&#25104;&#26412;&#12290;&#22312;&#26102;&#38388;&#36328;&#24230;$T$&#20869;&#65292;&#29609;&#23478;&#24517;&#39035;&#28385;&#36275;&#38271;&#26399;&#38656;&#27714;&#32422;&#26463;$\sum_{t} c(\mathbf{x}_t) \geq 1$&#65292;&#20854;&#20013;$c(\mathbf{x}_t)$&#34920;&#31034;&#26102;&#38388;$t$&#26102;&#28385;&#36275;&#30340;&#38656;&#27714;&#27604;&#20363;&#12290;&#36825;&#31867;&#38382;&#39064;&#22312;&#21487;&#25345;&#32493;&#33021;&#28304;&#21644;&#35745;&#31639;&#31995;&#32479;&#20013;&#30340;&#22312;&#32447;&#36164;&#28304;&#20998;&#37197;&#20013;&#26377;&#30528;&#24191;&#27867;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#20026;&#36825;&#20123;&#38382;&#39064;&#30340;&#20855;&#20307;&#23454;&#20363;&#35774;&#35745;&#20102;&#26368;&#20248;&#30340;&#31454;&#20105;&#31639;&#27861;&#21644;&#23398;&#20064;&#22686;&#24378;&#31639;&#27861;&#65292;&#24182;&#36827;&#19968;&#27493;&#23637;&#31034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#31639;&#27861;&#22312;&#25968;&#20540;&#23454;&#39564;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14012v1 Announce Type: cross  Abstract: We introduce and study a family of online metric problems with long-term constraints. In these problems, an online player makes decisions $\mathbf{x}_t$ in a metric space $(X,d)$ to simultaneously minimize their hitting cost $f_t(\mathbf{x}_t)$ and switching cost as determined by the metric. Over the time horizon $T$, the player must satisfy a long-term demand constraint $\sum_{t} c(\mathbf{x}_t) \geq 1$, where $c(\mathbf{x}_t)$ denotes the fraction of demand satisfied at time $t$. Such problems can find a wide array of applications to online resource allocation in sustainable energy and computing systems. We devise optimal competitive and learning-augmented algorithms for specific instantiations of these problems, and further show that our proposed algorithms perform well in numerical experiments.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#20108;&#20803;&#20998;&#31867;&#24615;&#33021;&#30340;&#20869;&#22312;&#25968;&#25454;&#38480;&#21046;&#21644;&#19978;&#30028;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#24182;&#36827;&#34892;&#20102;&#29702;&#35770;&#25512;&#29702;&#21644;&#23454;&#35777;&#26816;&#39564;&#65292;&#21457;&#29616;&#29702;&#35770;&#19978;&#38480;&#26159;&#21487;&#20197;&#34987;&#36798;&#21040;&#30340;&#65292;&#24182;&#35745;&#31639;&#20986;&#20102;&#19977;&#20010;&#24120;&#29992;&#35780;&#20272;&#25351;&#26631;&#30340;&#31934;&#30830;&#19978;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.17036</link><description>&lt;p&gt;
&#20108;&#20803;&#20998;&#31867;&#24615;&#33021;&#20013;&#30340;&#20869;&#22312;&#25968;&#25454;&#38480;&#21046;&#21644;&#19978;&#30028;
&lt;/p&gt;
&lt;p&gt;
Intrinsic Data Constraints and Upper Bounds in Binary Classification Performance. (arXiv:2401.17036v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.17036
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20108;&#20803;&#20998;&#31867;&#24615;&#33021;&#30340;&#20869;&#22312;&#25968;&#25454;&#38480;&#21046;&#21644;&#19978;&#30028;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#24182;&#36827;&#34892;&#20102;&#29702;&#35770;&#25512;&#29702;&#21644;&#23454;&#35777;&#26816;&#39564;&#65292;&#21457;&#29616;&#29702;&#35770;&#19978;&#38480;&#26159;&#21487;&#20197;&#34987;&#36798;&#21040;&#30340;&#65292;&#24182;&#35745;&#31639;&#20986;&#20102;&#19977;&#20010;&#24120;&#29992;&#35780;&#20272;&#25351;&#26631;&#30340;&#31934;&#30830;&#19978;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#32452;&#32455;&#30340;&#32467;&#26500;&#34987;&#24191;&#27867;&#35748;&#20026;&#23545;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#23588;&#20854;&#26159;&#22312;&#20108;&#20803;&#20998;&#31867;&#20219;&#21153;&#20013;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#65292;&#35748;&#20026;&#32473;&#23450;&#25968;&#25454;&#38598;&#19978;&#20108;&#20803;&#20998;&#31867;&#22120;&#30340;&#26368;&#22823;&#28508;&#21147;&#20027;&#35201;&#21463;&#21040;&#25968;&#25454;&#30340;&#20869;&#22312;&#29305;&#24615;&#30340;&#38480;&#21046;&#12290;&#36890;&#36807;&#29702;&#35770;&#25512;&#29702;&#21644;&#23454;&#35777;&#26816;&#39564;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#26631;&#20934;&#30446;&#26631;&#20989;&#25968;&#12289;&#35780;&#20272;&#25351;&#26631;&#21644;&#20108;&#20803;&#20998;&#31867;&#22120;&#65292;&#24471;&#20986;&#20102;&#20004;&#20010;&#20027;&#35201;&#32467;&#35770;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#23454;&#38469;&#25968;&#25454;&#38598;&#19978;&#20108;&#20803;&#20998;&#31867;&#24615;&#33021;&#30340;&#29702;&#35770;&#19978;&#38480;&#26159;&#21487;&#20197;&#34987;&#29702;&#35770;&#19978;&#36798;&#21040;&#30340;&#12290;&#36825;&#20010;&#19978;&#38480;&#20195;&#34920;&#20102;&#23398;&#20064;&#25439;&#22833;&#21644;&#35780;&#20272;&#25351;&#26631;&#20043;&#38388;&#30340;&#21487;&#35745;&#31639;&#24179;&#34913;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#35745;&#31639;&#20102;&#19977;&#20010;&#24120;&#29992;&#35780;&#20272;&#25351;&#26631;&#30340;&#31934;&#30830;&#19978;&#38480;&#65292;&#25581;&#31034;&#20102;&#19982;&#25105;&#20204;&#24635;&#20307;&#35770;&#28857;&#30340;&#26681;&#26412;&#19968;&#33268;&#24615;&#65306;&#19978;&#30028;&#19982;&#20869;&#22312;&#25968;&#25454;&#38480;&#21046;&#23494;&#20999;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
The structure of data organization is widely recognized as having a substantial influence on the efficacy of machine learning algorithms, particularly in binary classification tasks. Our research provides a theoretical framework suggesting that the maximum potential of binary classifiers on a given dataset is primarily constrained by the inherent qualities of the data. Through both theoretical reasoning and empirical examination, we employed standard objective functions, evaluative metrics, and binary classifiers to arrive at two principal conclusions. Firstly, we show that the theoretical upper bound of binary classification performance on actual datasets can be theoretically attained. This upper boundary represents a calculable equilibrium between the learning loss and the metric of evaluation. Secondly, we have computed the precise upper bounds for three commonly used evaluation metrics, uncovering a fundamental uniformity with our overarching thesis: the upper bound is intricately 
&lt;/p&gt;</description></item></channel></rss>