<rss version="2.0"><channel><title>Chat Arxiv cs.DM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DM</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#24418;&#36716;&#25442;&#27169;&#22411;&#26500;&#24314;&#26041;&#27861;&#65292;&#32467;&#21512;&#29983;&#25104;&#21644;&#21160;&#24577;&#35266;&#28857;&#65292;&#23454;&#29616;&#23436;&#20840;&#33258;&#21160;&#21270;&#30340;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#25512;&#29702;&#65292;&#36890;&#36807;&#21387;&#32553;&#19968;&#32452;&#36716;&#25442;&#25104;&#19968;&#32452;&#35268;&#21017;&#65292;&#20801;&#35768;&#27169;&#22411;&#23637;&#31034;&#36229;&#20986;&#36755;&#20837;&#33539;&#22260;&#30340;&#34892;&#20026;&#12290;</title><link>https://arxiv.org/abs/2404.02692</link><description>&lt;p&gt;
&#22270;&#24418;&#36716;&#25442;&#35268;&#21017;&#30340;&#33258;&#21160;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Automated Inference of Graph Transformation Rules
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02692
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#24418;&#36716;&#25442;&#27169;&#22411;&#26500;&#24314;&#26041;&#27861;&#65292;&#32467;&#21512;&#29983;&#25104;&#21644;&#21160;&#24577;&#35266;&#28857;&#65292;&#23454;&#29616;&#23436;&#20840;&#33258;&#21160;&#21270;&#30340;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#25512;&#29702;&#65292;&#36890;&#36807;&#21387;&#32553;&#19968;&#32452;&#36716;&#25442;&#25104;&#19968;&#32452;&#35268;&#21017;&#65292;&#20801;&#35768;&#27169;&#22411;&#23637;&#31034;&#36229;&#20986;&#36755;&#20837;&#33539;&#22260;&#30340;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29983;&#21629;&#31185;&#23398;&#39046;&#22495;&#21487;&#29992;&#25968;&#25454;&#30340;&#29190;&#28856;&#24615;&#22686;&#38271;&#25512;&#21160;&#20102;&#23545;&#23500;&#26377;&#34920;&#29616;&#21147;&#27169;&#22411;&#21644;&#35745;&#31639;&#26041;&#27861;&#26085;&#30410;&#22686;&#38271;&#30340;&#38656;&#27714;&#12290;&#22270;&#24418;&#36716;&#25442;&#26159;&#19968;&#31181;&#20855;&#26377;&#24191;&#27867;&#24212;&#29992;&#30340;&#21160;&#24577;&#31995;&#32479;&#27169;&#22411;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#24418;&#36716;&#25442;&#27169;&#22411;&#26500;&#24314;&#26041;&#27861;&#65292;&#23558;&#29983;&#25104;&#21644;&#21160;&#24577;&#35266;&#28857;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#25552;&#20379;&#19968;&#20010;&#23436;&#20840;&#33258;&#21160;&#21270;&#30340;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#25512;&#29702;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#25509;&#21463;&#20316;&#20026;&#21160;&#24577;&#23646;&#24615;&#30340;&#36755;&#20837;&#65292;&#32473;&#23450;&#20026;&#30001;&#26174;&#24335;&#36716;&#25442;&#32534;&#30721;&#30340;&#21160;&#24577;&#30340;&#8220;&#24555;&#29031;&#8221;&#65292;&#24182;&#26500;&#24314;&#19968;&#20010;&#20860;&#23481;&#30340;&#27169;&#22411;&#12290;&#33719;&#24471;&#30340;&#27169;&#22411;&#34987;&#20445;&#35777;&#26159;&#26368;&#23567;&#30340;&#65292;&#22240;&#27492;&#23558;&#35813;&#26041;&#27861;&#35268;&#33539;&#20026;&#27169;&#22411;&#21387;&#32553;&#65288;&#23558;&#19968;&#32452;&#36716;&#25442;&#21387;&#32553;&#20026;&#19968;&#32452;&#35268;&#21017;&#65289;&#30340;&#26041;&#27861;&#12290;&#21387;&#32553;&#23545;&#26377;&#25439;&#24773;&#20917;&#24456;&#23485;&#23481;&#65292;&#21363;&#20801;&#35768;&#26500;&#24314;&#30340;&#27169;&#22411;&#23637;&#31034;&#36229;&#20986;&#36755;&#20837;&#36716;&#25442;&#33539;&#22260;&#30340;&#34892;&#20026;&#65292;&#20174;&#32780;&#24314;&#35758;&#23436;&#25104;&#36755;&#20837;&#21160;&#24577;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02692v1 Announce Type: cross  Abstract: The explosion of data available in life sciences is fueling an increasing demand for expressive models and computational methods. Graph transformation is a model for dynamic systems with a large variety of applications. We introduce a novel method of the graph transformation model construction, combining generative and dynamical viewpoints to give a fully automated data-driven model inference method.   The method takes the input dynamical properties, given as a "snapshot" of the dynamics encoded by explicit transitions, and constructs a compatible model. The obtained model is guaranteed to be minimal, thus framing the approach as model compression (from a set of transitions into a set of rules). The compression is permissive to a lossy case, where the constructed model is allowed to exhibit behavior outside of the input transitions, thus suggesting a completion of the input dynamics.   The task of graph transformation model inference i
&lt;/p&gt;</description></item></channel></rss>