<rss version="2.0"><channel><title>Chat Arxiv cs.DC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.DC</description><item><title>&#26412;&#25991;&#30740;&#31350;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#30340;&#32852;&#37030;&#23398;&#20064;&#22312;&#25932;&#23545;&#23041;&#32961;&#19979;&#30340;&#28431;&#27934;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25915;&#20987;&#31574;&#30053;&#65292;&#25581;&#31034;&#20102;&#35813;&#27169;&#22411;&#22312;&#19981;&#21516;&#37197;&#32622;&#30340;&#32852;&#37030;&#23398;&#20064;&#19979;&#23545;&#25932;&#23545;&#23041;&#32961;&#30340;&#39640;&#25935;&#24863;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.10375</link><description>&lt;p&gt;
&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#30340;&#32852;&#37030;&#23398;&#20064;&#22312;&#25932;&#23545;&#23041;&#32961;&#19979;&#30340;&#28431;&#27934;
&lt;/p&gt;
&lt;p&gt;
Vulnerabilities of Foundation Model Integrated Federated Learning Under Adversarial Threats. (arXiv:2401.10375v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10375
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#30340;&#32852;&#37030;&#23398;&#20064;&#22312;&#25932;&#23545;&#23041;&#32961;&#19979;&#30340;&#28431;&#27934;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25915;&#20987;&#31574;&#30053;&#65292;&#25581;&#31034;&#20102;&#35813;&#27169;&#22411;&#22312;&#19981;&#21516;&#37197;&#32622;&#30340;&#32852;&#37030;&#23398;&#20064;&#19979;&#23545;&#25932;&#23545;&#23041;&#32961;&#30340;&#39640;&#25935;&#24863;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#26159;&#35299;&#20915;&#19982;&#25968;&#25454;&#38544;&#31169;&#21644;&#23433;&#20840;&#30456;&#20851;&#30340;&#26426;&#22120;&#23398;&#20064;&#30340;&#37325;&#35201;&#38382;&#39064;&#65292;&#20294;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#23384;&#22312;&#25968;&#25454;&#19981;&#36275;&#21644;&#19981;&#24179;&#34913;&#38382;&#39064;&#12290;&#22522;&#30784;&#27169;&#22411;&#30340;&#20986;&#29616;&#20026;&#29616;&#26377;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550;&#30340;&#23616;&#38480;&#24615;&#25552;&#20379;&#20102;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20363;&#22914;&#36890;&#36807;&#29983;&#25104;&#21512;&#25104;&#25968;&#25454;&#36827;&#34892;&#27169;&#22411;&#21021;&#22987;&#21270;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#20869;&#22312;&#23433;&#20840;&#24615;&#38382;&#39064;&#65292;&#23558;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#21040;&#32852;&#37030;&#23398;&#20064;&#20013;&#21487;&#33021;&#24341;&#20837;&#26032;&#30340;&#39118;&#38505;&#65292;&#36825;&#26041;&#38754;&#30340;&#30740;&#31350;&#23578;&#23646;&#26410;&#24320;&#21457;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#39318;&#27425;&#30740;&#31350;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#30340;&#32852;&#37030;&#23398;&#20064;&#22312;&#25932;&#23545;&#23041;&#32961;&#19979;&#30340;&#28431;&#27934;&#12290;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#30340;&#32852;&#37030;&#23398;&#20064;&#30340;&#32479;&#19968;&#26694;&#26550;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#25915;&#20987;&#31574;&#30053;&#65292;&#21033;&#29992;&#22522;&#30784;&#27169;&#22411;&#30340;&#23433;&#20840;&#24615;&#38382;&#39064;&#26469;&#30772;&#22351;&#32852;&#37030;&#23398;&#20064;&#23458;&#25143;&#31471;&#27169;&#22411;&#12290;&#36890;&#36807;&#22312;&#22270;&#20687;&#21644;&#25991;&#26412;&#39046;&#22495;&#20013;&#20351;&#29992;&#30693;&#21517;&#27169;&#22411;&#21644;&#22522;&#20934;&#25968;&#25454;&#38598;&#36827;&#34892;&#24191;&#27867;&#23454;&#39564;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#38598;&#25104;&#30340;&#32852;&#37030;&#23398;&#20064;&#22312;&#19981;&#21516;&#37197;&#32622;&#30340;&#32852;&#37030;&#23398;&#20064;&#19979;&#23545;&#36825;&#31181;&#26032;&#23041;&#32961;&#30340;&#39640;&#25935;&#24863;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated Learning (FL) addresses critical issues in machine learning related to data privacy and security, yet suffering from data insufficiency and imbalance under certain circumstances. The emergence of foundation models (FMs) offers potential solutions to the limitations of existing FL frameworks, e.g., by generating synthetic data for model initialization. However, due to the inherent safety concerns of FMs, integrating FMs into FL could introduce new risks, which remains largely unexplored. To address this gap, we conduct the first investigation on the vulnerability of FM integrated FL (FM-FL) under adversarial threats. Based on a unified framework of FM-FL, we introduce a novel attack strategy that exploits safety issues of FM to compromise FL client models. Through extensive experiments with well-known models and benchmark datasets in both image and text domains, we reveal the high susceptibility of the FM-FL to this new threat under various FL configurations. Furthermore, we f
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21306;&#22359;&#38142;&#20195;&#24065;&#30340;&#26426;&#21046;&#35774;&#35745;&#65292;&#36890;&#36807;&#30740;&#31350;&#37325;&#22797;&#30340;&#31169;&#26377;&#20215;&#20540;&#25293;&#21334;&#21457;&#29616;&#65292;&#25293;&#21334;&#19982;&#20195;&#24065;&#30456;&#27604;&#20110;&#32654;&#20803;&#21644;&#37329;&#34701;&#35777;&#21048;&#25293;&#21334;&#65292;&#20855;&#26377;&#25552;&#21069;&#31215;&#32047;&#25910;&#20837;&#12289;&#21464;&#21160;&#36739;&#23567;&#21644;&#26356;&#36866;&#29992;&#20110;&#20005;&#37325;&#22865;&#32422;&#25705;&#25830;&#30340;&#20248;&#28857;&#12290;</title><link>http://arxiv.org/abs/2301.13794</link><description>&lt;p&gt;
&#25293;&#21334;&#19982;&#20195;&#24065;&#65306;&#36135;&#24065;&#25919;&#31574;&#20316;&#20026;&#26426;&#21046;&#35774;&#35745;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Auctions with Tokens: Monetary Policy as a Mechanism Design Choice. (arXiv:2301.13794v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13794
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21306;&#22359;&#38142;&#20195;&#24065;&#30340;&#26426;&#21046;&#35774;&#35745;&#65292;&#36890;&#36807;&#30740;&#31350;&#37325;&#22797;&#30340;&#31169;&#26377;&#20215;&#20540;&#25293;&#21334;&#21457;&#29616;&#65292;&#25293;&#21334;&#19982;&#20195;&#24065;&#30456;&#27604;&#20110;&#32654;&#20803;&#21644;&#37329;&#34701;&#35777;&#21048;&#25293;&#21334;&#65292;&#20855;&#26377;&#25552;&#21069;&#31215;&#32047;&#25910;&#20837;&#12289;&#21464;&#21160;&#36739;&#23567;&#21644;&#26356;&#36866;&#29992;&#20110;&#20005;&#37325;&#22865;&#32422;&#25705;&#25830;&#30340;&#20248;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21306;&#22359;&#38142;&#20195;&#24065;&#30340;&#26426;&#21046;&#35774;&#35745;&#65292;&#21363;&#22312;&#26426;&#21046;&#20869;&#21487;&#20197;&#20351;&#29992;&#30340;&#20195;&#24065;&#21516;&#26102;&#20063;&#21487;&#20197;&#22312;&#26426;&#21046;&#22806;&#20445;&#23384;&#21644;&#20132;&#26131;&#12290;&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#37325;&#22797;&#30340;&#31169;&#26377;&#20215;&#20540;&#25293;&#21334;&#65292;&#25293;&#21334;&#32773;&#25509;&#21463;&#33258;&#24049;&#21019;&#24314;&#21644;&#25317;&#26377;&#30340;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#20195;&#24065;&#20316;&#20026;&#25903;&#20184;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#39044;&#26399;&#25910;&#20837;&#30340;&#25240;&#29616;&#20215;&#20540;&#19982;&#26631;&#20934;&#36135;&#24065;&#25293;&#21334;&#30456;&#21516;&#65292;&#20294;&#36825;&#20123;&#25910;&#20837;&#30340;&#31215;&#32047;&#36739;&#26089;&#19988;&#21464;&#21160;&#36739;&#23567;&#12290;&#26368;&#20248;&#30340;&#36135;&#24065;&#25919;&#31574;&#28041;&#21450;&#21040;&#29123;&#28903;&#29992;&#20110;&#25293;&#21334;&#30340;&#20195;&#24065;&#65292;&#36825;&#26159;&#35768;&#22810;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#25293;&#21334;&#30340;&#20849;&#21516;&#29305;&#24449;&#12290;&#36827;&#19968;&#27493;&#24341;&#20837;&#19981;&#21487;&#22865;&#32422;&#30340;&#21162;&#21147;&#21644;&#25910;&#20837;&#20405;&#21344;&#30340;&#21487;&#33021;&#24615;&#12290;&#36890;&#36807;&#23558;&#20195;&#24065;&#25293;&#21334;&#19982;&#21487;&#20197;&#21457;&#34892;&#37329;&#34701;&#35777;&#21048;&#30340;&#32654;&#20803;&#25293;&#21334;&#36827;&#34892;&#27604;&#36739;&#65292;&#21457;&#29616;&#22312;&#23384;&#22312;&#20005;&#37325;&#30340;&#22865;&#32422;&#25705;&#25830;&#26102;&#65292;&#20195;&#24065;&#25293;&#21334;&#26356;&#21463;&#38738;&#30544;&#65292;&#32780;&#24403;&#22865;&#32422;&#25705;&#25830;&#36739;&#20302;&#26102;&#65292;&#21017;&#30456;&#21453;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study mechanism design with blockchain-based tokens, that is, tokens that can be used within a mechanism but can also be saved and traded outside of the mechanism. I do so by considering a repeated, private-value auction, in which the auctioneer accepts payments in a blockchain-based token he creates and initially owns. I show that the present-discounted value of the expected revenues is the same as in a standard auction with dollars, but these revenues accrue earlier and are less variable. The optimal monetary policy involves the burning of tokens used in the auction, a common feature of many blockchain-based auctions. I then introduce non-contractible effort and the possibility of misappropriating revenues. I compare the auction with tokens to an auction with dollars in which the auctioneer can also issue financial securities. An auction with tokens is preferred when there are sufficiently severe contracting frictions, while the opposite is true when contracting frictions are low.
&lt;/p&gt;</description></item></channel></rss>