<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#21453;&#23556;&#33108;&#20013;&#30340;&#22810;&#27425;&#25955;&#23556;&#36890;&#36807;&#34987;&#21160;&#35825;&#23548;&#20809;&#23398;&#38750;&#32447;&#24615;&#26144;&#23556;&#30340;&#35774;&#35745;&#65292;&#23454;&#29616;&#20102;&#20809;&#23398;&#25968;&#25454;&#21387;&#32553;&#21644;&#39640;&#25928;&#22788;&#29702;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2307.08558</link><description>&lt;p&gt;
&#20855;&#26377;&#34987;&#21160;&#20809;&#23398;&#38750;&#32447;&#24615;&#26144;&#23556;&#30340;&#28145;&#24230;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Deep Learning with Passive Optical Nonlinear Mapping. (arXiv:2307.08558v2 [physics.optics] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08558
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#21453;&#23556;&#33108;&#20013;&#30340;&#22810;&#27425;&#25955;&#23556;&#36890;&#36807;&#34987;&#21160;&#35825;&#23548;&#20809;&#23398;&#38750;&#32447;&#24615;&#26144;&#23556;&#30340;&#35774;&#35745;&#65292;&#23454;&#29616;&#20102;&#20809;&#23398;&#25968;&#25454;&#21387;&#32553;&#21644;&#39640;&#25928;&#22788;&#29702;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#24050;&#32463;&#20174;&#26681;&#26412;&#19978;&#25913;&#21464;&#20102;&#20154;&#24037;&#26234;&#33021;&#65292;&#20294;&#26159;&#26085;&#30410;&#22797;&#26434;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#38656;&#35201;&#19987;&#38376;&#30340;&#30828;&#20214;&#21152;&#36895;&#22120;&#12290;&#20809;&#23398;&#21152;&#36895;&#22120;&#21487;&#20197;&#25552;&#20379;&#22686;&#24378;&#30340;&#24615;&#33021;&#12289;&#21487;&#25193;&#23637;&#24615;&#21644;&#33021;&#37327;&#25928;&#29575;&#12290;&#28982;&#32780;&#65292;&#23454;&#29616;&#20809;&#23398;&#20013;&#30340;&#38750;&#32447;&#24615;&#26144;&#23556;&#65292;&#36825;&#26159;&#31070;&#32463;&#32593;&#32476;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#35774;&#35745;&#65292;&#21033;&#29992;&#19968;&#20010;&#21453;&#23556;&#33108;&#20013;&#30340;&#22810;&#27425;&#25955;&#23556;&#26469;&#34987;&#21160;&#35825;&#23548;&#20809;&#23398;&#38750;&#32447;&#24615;&#38543;&#26426;&#26144;&#23556;&#65292;&#32780;&#26080;&#38656;&#39069;&#22806;&#30340;&#28608;&#20809;&#21151;&#29575;&#12290;&#25105;&#20204;&#24037;&#20316;&#30340;&#19968;&#20010;&#37325;&#35201;&#20248;&#21183;&#26159;&#25105;&#20204;&#23637;&#31034;&#20102;&#21487;&#20197;&#36890;&#36807;&#21453;&#23556;&#33108;&#20013;&#30340;&#22810;&#27425;&#25955;&#23556;&#26469;&#36827;&#34892;&#20809;&#23398;&#25968;&#25454;&#21387;&#32553;&#65292;&#20197;&#39640;&#25928;&#22320;&#21387;&#32553;&#21644;&#20445;&#30041;&#37325;&#35201;&#20449;&#24687;&#65292;&#21516;&#26102;&#38477;&#20302;&#25968;&#25454;&#30340;&#32500;&#24230;&#12290;&#36825;&#20351;&#24471;&#24555;&#36895;&#30340;&#20809;&#23398;&#20449;&#24687;&#22788;&#29702;&#21644;&#29983;&#25104;&#39640;&#24230;&#38750;&#32447;&#24615;&#29305;&#24449;&#30340;&#20302;&#32500;&#28151;&#21512;&#25104;&#20998;&#25104;&#20026;&#21487;&#33021;&#12290;&#36825;&#23545;&#20110;&#38656;&#35201;&#39640;&#25928;&#22788;&#29702;&#30340;&#24212;&#29992;&#29305;&#21035;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep learning has fundamentally transformed artificial intelligence, but the ever-increasing complexity in deep learning models calls for specialized hardware accelerators. Optical accelerators can potentially offer enhanced performance, scalability, and energy efficiency. However, achieving nonlinear mapping, a critical component of neural networks, remains challenging optically. Here, we introduce a design that leverages multiple scattering in a reverberating cavity to passively induce optical nonlinear random mapping, without the need for additional laser power. A key advantage emerging from our work is that we show we can perform optical data compression, facilitated by multiple scattering in the cavity, to efficiently compress and retain vital information while also decreasing data dimensionality. This allows rapid optical information processing and generation of low dimensional mixtures of highly nonlinear features. These are particularly useful for applications demanding high-sp
&lt;/p&gt;</description></item></channel></rss>