<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;Winner-Take-All&#65288;WTA&#65289;&#36873;&#25321;&#24615;&#21644;&#29983;&#29289;&#21551;&#21457;&#30340;&#31283;&#24577;&#26426;&#21046;&#30456;&#32467;&#21512;&#30340;&#8220;&#33258;&#23450;&#20041;&#30446;&#26631;&#8221;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;&#26080;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#22312;&#36793;&#32536;AI&#30828;&#20214;&#19978;&#30340;&#35745;&#31639;&#36164;&#28304;&#31232;&#32570;&#24615;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.12116</link><description>&lt;p&gt;
&#22522;&#20110;&#33258;&#23450;&#20041;&#29983;&#29289;&#21551;&#21457;&#30446;&#26631;&#30340;&#26080;&#30417;&#30563;&#31471;&#21040;&#31471;&#35757;&#32451;
&lt;/p&gt;
&lt;p&gt;
Unsupervised End-to-End Training with a Self-Defined Bio-Inspired Target
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12116
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;Winner-Take-All&#65288;WTA&#65289;&#36873;&#25321;&#24615;&#21644;&#29983;&#29289;&#21551;&#21457;&#30340;&#31283;&#24577;&#26426;&#21046;&#30456;&#32467;&#21512;&#30340;&#8220;&#33258;&#23450;&#20041;&#30446;&#26631;&#8221;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;&#26080;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#22312;&#36793;&#32536;AI&#30828;&#20214;&#19978;&#30340;&#35745;&#31639;&#36164;&#28304;&#31232;&#32570;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#30340;&#26080;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#20381;&#36182;&#20110;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#65288;&#22914;&#33258;&#30417;&#30563;&#23398;&#20064;&#65289;&#36827;&#34892;&#31471;&#21040;&#31471;&#35757;&#32451;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#35745;&#31639;&#38656;&#27714;&#65292;&#25110;&#32773;&#37319;&#29992;&#36890;&#36807;&#31867;&#20284;Hebbian&#23398;&#20064;&#30340;&#29983;&#29289;&#21551;&#21457;&#26041;&#27861;&#36880;&#23618;&#35757;&#32451;&#65292;&#20351;&#29992;&#19982;&#30417;&#30563;&#23398;&#20064;&#19981;&#20860;&#23481;&#30340;&#23616;&#37096;&#23398;&#20064;&#35268;&#21017;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#20351;&#29992;&#32593;&#32476;&#26368;&#32456;&#23618;&#30340;&#32988;&#32773;&#36890;&#21507;&#65288;WTA&#65289;&#36873;&#25321;&#24615;&#30340;&#8220;&#33258;&#23450;&#20041;&#30446;&#26631;&#8221;&#65292;&#24182;&#36890;&#36807;&#29983;&#29289;&#21551;&#21457;&#30340;&#31283;&#24577;&#26426;&#21046;&#36827;&#34892;&#27491;&#21017;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12116v1 Announce Type: cross  Abstract: Current unsupervised learning methods depend on end-to-end training via deep learning techniques such as self-supervised learning, with high computational requirements, or employ layer-by-layer training using bio-inspired approaches like Hebbian learning, using local learning rules incompatible with supervised learning. Both approaches are problematic for edge AI hardware that relies on sparse computational resources and would strongly benefit from alternating between unsupervised and supervised learning phases - thus leveraging widely available unlabeled data from the environment as well as labeled training datasets. To solve this challenge, in this work, we introduce a 'self-defined target' that uses Winner-Take-All (WTA) selectivity at the network's final layer, complemented by regularization through biologically inspired homeostasis mechanism. This approach, framework-agnostic and compatible with both global (Backpropagation) and l
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;CDML&#35774;&#35745;&#24037;&#20855;&#31665;&#65292;&#21487;&#20197;&#25351;&#23548;&#24320;&#21457;&#32773;&#35774;&#35745;&#28385;&#36275;&#29992;&#20363;&#35201;&#27714;&#30340;&#21327;&#20316;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#12290;</title><link>http://arxiv.org/abs/2309.16584</link><description>&lt;p&gt;
&#29992;&#20110;&#24320;&#21457;&#21327;&#20316;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#35774;&#35745;&#24037;&#20855;&#31665;
&lt;/p&gt;
&lt;p&gt;
A Design Toolbox for the Development of Collaborative Distributed Machine Learning Systems. (arXiv:2309.16584v1 [cs.MA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16584
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;CDML&#35774;&#35745;&#24037;&#20855;&#31665;&#65292;&#21487;&#20197;&#25351;&#23548;&#24320;&#21457;&#32773;&#35774;&#35745;&#28385;&#36275;&#29992;&#20363;&#35201;&#27714;&#30340;&#21327;&#20316;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#22312;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#26426;&#23494;&#24615;&#30340;&#21516;&#26102;&#21033;&#29992;&#26469;&#33258;&#22810;&#26041;&#30340;&#35757;&#32451;&#25968;&#25454;&#23545;&#27169;&#22411;&#36827;&#34892;&#20805;&#20998;&#35757;&#32451;&#65292;&#30740;&#31350;&#20154;&#21592;&#24320;&#21457;&#20102;&#21508;&#31181;&#21327;&#20316;&#20998;&#24067;&#24335;&#26426;&#22120;&#23398;&#20064;&#65288;CDML&#65289;&#31995;&#32479;&#35774;&#35745;&#65292;&#20363;&#22914;&#36741;&#21161;&#23398;&#20064;&#12289;&#32852;&#37030;&#23398;&#20064;&#21644;&#20998;&#35010;&#23398;&#20064;&#12290;CDML&#31995;&#32479;&#35774;&#35745;&#23637;&#31034;&#20102;&#19981;&#21516;&#30340;&#29305;&#24449;&#65292;&#20363;&#22914;&#39640;&#24230;&#30340;&#20195;&#29702;&#20154;&#33258;&#27835;&#24615;&#12289;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#26426;&#23494;&#24615;&#21644;&#23481;&#38169;&#24615;&#12290;&#38754;&#23545;&#19981;&#21516;&#29305;&#24449;&#30340;&#21508;&#31181;CDML&#31995;&#32479;&#35774;&#35745;&#65292;&#24320;&#21457;&#32773;&#24456;&#38590;&#26377;&#38024;&#23545;&#24615;&#22320;&#35774;&#35745;&#28385;&#36275;&#29992;&#20363;&#35201;&#27714;&#30340;CDML&#31995;&#32479;&#12290;&#28982;&#32780;&#65292;&#19981;&#21512;&#36866;&#30340;CDML&#31995;&#32479;&#35774;&#35745;&#21487;&#33021;&#23548;&#33268;CDML&#31995;&#32479;&#26080;&#27861;&#23454;&#29616;&#20854;&#39044;&#26399;&#30446;&#30340;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;CDML&#35774;&#35745;&#24037;&#20855;&#31665;&#65292;&#21487;&#20197;&#25351;&#23548;CDML&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;&#22522;&#20110;CDML&#35774;&#35745;&#24037;&#20855;&#31665;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20855;&#26377;&#19981;&#21516;&#20851;&#38190;&#29305;&#24449;&#30340;CDML&#31995;&#32479;&#20856;&#22411;&#65292;&#21487;&#20197;&#25903;&#25345;&#35774;&#35745;&#28385;&#36275;&#29992;&#20363;&#35201;&#27714;&#30340;CDML&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
To leverage training data for the sufficient training of ML models from multiple parties in a confidentiality-preserving way, various collaborative distributed machine learning (CDML) system designs have been developed, for example, to perform assisted learning, federated learning, and split learning. CDML system designs show different traits, for example, high agent autonomy, machine learning (ML) model confidentiality, and fault tolerance. Facing a wide variety of CDML system designs with different traits, it is difficult for developers to design CDML systems with traits that match use case requirements in a targeted way. However, inappropriate CDML system designs may result in CDML systems failing their envisioned purposes. We developed a CDML design toolbox that can guide the development of CDML systems. Based on the CDML design toolbox, we present CDML system archetypes with distinct key traits that can support the design of CDML systems to meet use case requirements.
&lt;/p&gt;</description></item></channel></rss>