<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#26412;&#30740;&#31350;&#25253;&#21578;&#20102;&#19968;&#31181;&#22522;&#20110;&#20869;&#23384;&#35745;&#31639;&#30340;&#31070;&#32463;&#35299;&#30721;&#22120;&#25512;&#29702;&#21152;&#36895;&#22120;&#30340;&#35774;&#35745;&#21644;&#24615;&#33021;&#20998;&#26512;&#65292;&#35813;&#35299;&#30721;&#22120;&#29992;&#20110;&#23481;&#38169;&#37327;&#23376;&#38169;&#35823;&#32416;&#27491;&#65292;&#26088;&#22312;&#26368;&#23567;&#21270;&#35299;&#30721;&#26102;&#38388;&#24182;&#30830;&#20445;&#35299;&#30721;&#26041;&#27861;&#30340;&#21487;&#25193;&#23637;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.09463</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#23481;&#38169;&#37327;&#23376;&#38169;&#35823;&#32416;&#27491;&#30340;&#20302;&#28201;&#23384;&#20648;&#25935;&#21270;&#31070;&#32463;&#35299;&#30721;&#22120;
&lt;/p&gt;
&lt;p&gt;
A Cryogenic Memristive Neural Decoder for Fault-tolerant Quantum Error Correction. (arXiv:2307.09463v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09463
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25253;&#21578;&#20102;&#19968;&#31181;&#22522;&#20110;&#20869;&#23384;&#35745;&#31639;&#30340;&#31070;&#32463;&#35299;&#30721;&#22120;&#25512;&#29702;&#21152;&#36895;&#22120;&#30340;&#35774;&#35745;&#21644;&#24615;&#33021;&#20998;&#26512;&#65292;&#35813;&#35299;&#30721;&#22120;&#29992;&#20110;&#23481;&#38169;&#37327;&#23376;&#38169;&#35823;&#32416;&#27491;&#65292;&#26088;&#22312;&#26368;&#23567;&#21270;&#35299;&#30721;&#26102;&#38388;&#24182;&#30830;&#20445;&#35299;&#30721;&#26041;&#27861;&#30340;&#21487;&#25193;&#23637;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#38169;&#35823;&#32416;&#27491;(QEC)&#30340;&#31070;&#32463;&#35299;&#30721;&#22120;&#20381;&#36182;&#20110;&#31070;&#32463;&#32593;&#32476;&#26469;&#20998;&#31867;&#20174;&#38169;&#35823;&#32416;&#27491;&#32534;&#30721;&#20013;&#25552;&#21462;&#30340;&#32508;&#21512;&#24449;&#65292;&#24182;&#25214;&#21040;&#21512;&#36866;&#30340;&#24674;&#22797;&#25805;&#20316;&#21592;&#26469;&#20445;&#25252;&#36923;&#36753;&#20449;&#24687;&#20813;&#21463;&#38169;&#35823;&#24433;&#21709;&#12290;&#23613;&#31649;&#31070;&#32463;&#35299;&#30721;&#22120;&#24615;&#33021;&#33391;&#22909;&#65292;&#20294;&#20173;&#23384;&#22312;&#19968;&#20123;&#37325;&#35201;&#30340;&#23454;&#38469;&#35201;&#27714;&#65292;&#22914;&#23558;&#35299;&#30721;&#26102;&#38388;&#26368;&#23567;&#21270;&#20197;&#28385;&#36275;&#37325;&#22797;&#38169;&#35823;&#32416;&#27491;&#26041;&#26696;&#20013;&#30340;&#32508;&#21512;&#24449;&#29983;&#25104;&#36895;&#24230;&#65292;&#20197;&#21450;&#30830;&#20445;&#35299;&#30721;&#26041;&#27861;&#30340;&#21487;&#25193;&#23637;&#24615;&#38543;&#30528;&#32534;&#30721;&#36317;&#31163;&#30340;&#22686;&#21152;&#32780;&#22686;&#21152;&#12290;&#35774;&#35745;&#19968;&#20010;&#19987;&#29992;&#30340;&#38598;&#25104;&#30005;&#36335;&#20197;&#19982;&#37327;&#23376;&#22788;&#29702;&#22120;&#20849;&#21516;&#23436;&#25104;&#35299;&#30721;&#20219;&#21153;&#20284;&#20046;&#26159;&#24517;&#35201;&#30340;&#65292;&#22240;&#20026;&#23558;&#20449;&#21495;&#20174;&#20302;&#28201;&#29615;&#22659;&#20013;&#24341;&#20986;&#24182;&#36827;&#34892;&#22806;&#37096;&#22788;&#29702;&#20250;&#23548;&#33268;&#19981;&#24517;&#35201;&#30340;&#24310;&#36831;&#21644;&#26368;&#32456;&#30340;&#24067;&#32447;&#29942;&#39048;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25253;&#36947;&#20102;&#19968;&#31181;&#22522;&#20110;&#20869;&#23384;&#35745;&#31639;&#30340;&#31070;&#32463;&#35299;&#30721;&#22120;&#25512;&#29702;&#21152;&#36895;&#22120;&#30340;&#35774;&#35745;&#21644;&#24615;&#33021;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Neural decoders for quantum error correction (QEC) rely on neural networks to classify syndromes extracted from error correction codes and find appropriate recovery operators to protect logical information against errors. Despite the good performance of neural decoders, important practical requirements remain to be achieved, such as minimizing the decoding time to meet typical rates of syndrome generation in repeated error correction schemes, and ensuring the scalability of the decoding approach as the code distance increases. Designing a dedicated integrated circuit to perform the decoding task in co-integration with a quantum processor appears necessary to reach these decoding time and scalability requirements, as routing signals in and out of a cryogenic environment to be processed externally leads to unnecessary delays and an eventual wiring bottleneck. In this work, we report the design and performance analysis of a neural decoder inference accelerator based on an in-memory comput
&lt;/p&gt;</description></item></channel></rss>