<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#36825;&#39033;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#37327;&#23376;-&#32463;&#20856;&#28151;&#21512;&#27714;&#35299;&#22120; Q4RPD&#65292;&#26088;&#22312;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#30340;&#21253;&#35065;&#25237;&#36882;&#36335;&#24452;&#38382;&#39064;&#65292;&#36991;&#20813;&#20102;&#38382;&#39064;&#31616;&#21270;&#21644;&#25216;&#26415;&#25463;&#24452;&#65292;&#38024;&#23545;&#21253;&#35065;&#37325;&#37327;&#21644;&#23610;&#23544;&#30340;&#30495;&#23454;&#32422;&#26463;&#26465;&#20214;&#12290;</title><link>https://arxiv.org/abs/2403.15114</link><description>&lt;p&gt;
&#20351;&#29992;&#37327;&#23376;&#36864;&#28779;&#22120;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#30340;&#21253;&#35065;&#25237;&#36882;&#36335;&#24452;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Solving a Real-World Package Delivery Routing Problem Using Quantum Annealers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15114
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#37327;&#23376;-&#32463;&#20856;&#28151;&#21512;&#27714;&#35299;&#22120; Q4RPD&#65292;&#26088;&#22312;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#30340;&#21253;&#35065;&#25237;&#36882;&#36335;&#24452;&#38382;&#39064;&#65292;&#36991;&#20813;&#20102;&#38382;&#39064;&#31616;&#21270;&#21644;&#25216;&#26415;&#25463;&#24452;&#65292;&#38024;&#23545;&#21253;&#35065;&#37325;&#37327;&#21644;&#23610;&#23544;&#30340;&#30495;&#23454;&#32422;&#26463;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20960;&#24180;&#20851;&#20110;&#37327;&#23376;&#35745;&#31639;&#21644;&#36335;&#24452;&#38382;&#39064;&#20043;&#38388;&#30340;&#30740;&#31350;&#38750;&#24120;&#22810;&#20135;&#12290;&#22823;&#37096;&#20998;&#20316;&#21697;&#22260;&#32469;&#30528;&#32463;&#20856;&#38382;&#39064;&#65292;&#22914;&#26053;&#34892;&#25512;&#38144;&#21592;&#38382;&#39064;&#25110;&#36710;&#36742;&#36335;&#24452;&#38382;&#39064;&#12290;&#23613;&#31649;&#22788;&#29702;&#36825;&#20123;&#38382;&#39064;&#20855;&#26377;&#20215;&#20540;&#65292;&#20294;&#19981;&#21487;&#21542;&#35748;&#30340;&#26159;&#23427;&#20204;&#20197;&#23398;&#26415;&#20026;&#23548;&#21521;&#30340;&#29305;&#28857;&#26080;&#27861;&#28385;&#36275;&#29616;&#23454;&#19990;&#30028;&#30340;&#35201;&#27714;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#25552;&#20986;&#19968;&#31181;&#35299;&#20915;&#29616;&#23454;&#24773;&#20917;&#30340;&#26041;&#27861;&#65292;&#36991;&#20813;&#38382;&#39064;&#31616;&#21270;&#25110;&#25216;&#26415;&#25463;&#24452;&#12290;&#30456;&#21453;&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#37327;&#23376;-&#32463;&#20856;&#28151;&#21512;&#27714;&#35299;&#22120;&#65292;&#21629;&#21517;&#20026;Q4RPD&#65292;&#32771;&#34385;&#21040;&#19968;&#31995;&#21015;&#30495;&#23454;&#32422;&#26463;&#26465;&#20214;&#65292;&#22914;&#24322;&#26500;&#36710;&#38431;&#12289;&#20248;&#20808;&#25237;&#36882;&#21644;&#26681;&#25454;&#21253;&#35065;&#37325;&#37327;&#21644;&#23610;&#23544;&#30830;&#23450;&#30340;&#23481;&#37327;&#12290;Q4RPD&#37319;&#29992;&#20102;D-Wave&#30340;Leap&#21463;&#38480;&#20108;&#27425;&#27169;&#22411;&#28151;&#21512;&#27714;&#35299;&#22120;&#12290;&#20026;&#20102;&#35777;&#26126;Q4RPD&#30340;&#24212;&#29992;&#65292;&#35774;&#35745;&#20102;&#19968;&#20010;&#23454;&#39564;&#32452;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15114v1 Announce Type: cross  Abstract: Research focused on the conjunction between quantum computing and routing problems has been very prolific in recent years. Most of the works revolve around classical problems such as the Traveling Salesman Problem or the Vehicle Routing Problem. Even though working on these problems is valuable, it is also undeniable that their academic-oriented nature falls short of real-world requirements. The main objective of this research is to present a solving method for realistic instances, avoiding problem relaxations or technical shortcuts. Instead, a quantum-classical hybrid solver has been developed, coined Q4RPD, that considers a set of real constraints such as a heterogeneous fleet of vehicles, priority deliveries, and capacities characterized by two values: weight and dimensions of the packages. Q4RPD resorts to the Leap Constrained Quadratic Model Hybrid Solver of D-Wave. To demonstrate the application of Q4RPD, an experimentation compo
&lt;/p&gt;</description></item></channel></rss>