<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#33033;&#20914;&#30340;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#30340;&#34920;&#36798;&#33021;&#21147;&#65292;&#35777;&#26126;&#20102;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#65292;&#36825;&#31181;&#27169;&#22411;&#21487;&#20197;&#36924;&#36817;&#20219;&#24847;&#38750;&#32447;&#24615;&#20989;&#25968;&#65292;&#24182;&#21487;&#33021;&#22312;&#22797;&#26434;&#23398;&#20064;&#20219;&#21153;&#19978;&#20855;&#26377;&#26356;&#24378;&#22823;&#30340;&#34920;&#36798;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.02880</link><description>&lt;p&gt;
&#37322;&#25918;&#33033;&#20914;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#30340;&#34920;&#36798;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
Unleashing the Expressive Power of Pulse-Based Quantum Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02880
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#33033;&#20914;&#30340;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#30340;&#34920;&#36798;&#33021;&#21147;&#65292;&#35777;&#26126;&#20102;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#65292;&#36825;&#31181;&#27169;&#22411;&#21487;&#20197;&#36924;&#36817;&#20219;&#24847;&#38750;&#32447;&#24615;&#20989;&#25968;&#65292;&#24182;&#21487;&#33021;&#22312;&#22797;&#26434;&#23398;&#20064;&#20219;&#21153;&#19978;&#20855;&#26377;&#26356;&#24378;&#22823;&#30340;&#34920;&#36798;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#22122;&#22768;&#20013;&#31561;&#35268;&#27169;&#37327;&#23376;&#65288;NISQ&#65289;&#35774;&#22791;&#30340;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#65288;QML&#65289;&#38656;&#35201;&#26368;&#20339;&#21033;&#29992;&#26377;&#38480;&#30340;&#37327;&#23376;&#36164;&#28304;&#12290;&#24120;&#29992;&#30340;&#22522;&#20110;&#38376;&#30340; QML &#27169;&#22411;&#23545;&#36719;&#20214;&#24037;&#31243;&#24072;&#24456;&#26041;&#20415;&#65292;&#20294;&#20854;&#34920;&#36798;&#33021;&#21147;&#21463;&#38480;&#20110;&#26377;&#38480;&#30340;&#30456;&#24178;&#26102;&#38388;&#20869;&#20801;&#35768;&#30340;&#30005;&#36335;&#28145;&#24230;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#22522;&#20110;&#33033;&#20914;&#30340;&#27169;&#22411;&#21487;&#20197;&#22312;&#30456;&#21516;&#30340;&#30456;&#24178;&#26102;&#38388;&#20869;&#26500;&#24314;&#8220;&#26080;&#38480;&#8221;&#28145;&#24230;&#30340;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#65292;&#21487;&#33021;&#20026;&#22797;&#26434;&#23398;&#20064;&#20219;&#21153;&#37322;&#25918;&#26356;&#24378;&#22823;&#30340;&#34920;&#36798;&#33021;&#21147;&#12290;&#26412;&#25991;&#20174;&#37327;&#23376;&#25511;&#21046;&#29702;&#35770;&#30340;&#35270;&#35282;&#30740;&#31350;&#20102;&#36825;&#20010;&#28508;&#21147;&#12290;&#25105;&#20204;&#39318;&#20808;&#25351;&#20986;&#65292;&#33033;&#20914;&#27169;&#22411;&#30340;&#38750;&#32447;&#24615;&#26469;&#33258;&#32534;&#30721;&#36807;&#31243;&#65292;&#21487;&#20197;&#30475;&#20316;&#26159;&#22522;&#20110;&#38376;&#27169;&#22411;&#20013;&#25968;&#25454;&#37325;&#26032;&#19978;&#20256;&#30340;&#36830;&#32493;&#26497;&#38480;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#22522;&#30784;&#29289;&#29702;&#31995;&#32479;&#20855;&#26377;&#38598;&#21512;&#21487;&#25511;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#33033;&#20914;&#27169;&#22411;&#21487;&#20197;&#36924;&#36817;&#20219;&#24847;&#38750;&#32447;&#24615;&#20989;&#25968;&#12290;&#22312;&#36825;&#31181;&#26465;&#20214;&#19979;&#65292;&#25968;&#20540;&#27169;&#25311;&#34920;&#26126;&#33033;&#20914;&#27169;&#22411;&#21487;&#20197;&#36229;&#36807;&#22522;&#20110;&#38376;&#30340;&#27169;&#22411;&#22312;&#29305;&#23450;&#23398;&#20064;&#20219;&#21153;&#19978;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantum machine learning (QML) based on Noisy Intermediate-Scale Quantum (NISQ) devices requires the optimal utilization of limited quantum resources. The commonly used gate-based QML models are convenient for software engineers, but their expressivity is restricted by the permissible circuit depth within a finite coherence time. In contrast, pulse-based models enable the construction of "infinitely" deep quantum neural networks within the same coherence time, which may unleash greater expressive power for complex learning tasks. In this paper, we investigate this potential from the perspective of quantum control theory. We first indicate that the nonlinearity of pulse-based models comes from the encoding process that can be viewed as the continuous limit of data-reuploading in gate-based models. Subsequently, we prove that the pulse-based model can approximate arbitrary nonlinear functions when the underlying physical system is ensemble controllable. Under this condition, numerical si
&lt;/p&gt;</description></item></channel></rss>