<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#36825;&#39033;&#30740;&#31350;&#35752;&#35770;&#20102;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#24212;&#29992;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#30340;&#26032;&#30740;&#31350;&#26041;&#21521;&#65292;&#36890;&#36807;&#27604;&#36739;qGAN&#21644;QCBM&#31561;&#27169;&#22411;&#65292;&#23637;&#31034;&#20102;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#23454;&#29616;&#37327;&#23376;&#20248;&#21183;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2308.08448</link><description>&lt;p&gt;
&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#23454;&#29616;&#37327;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;qGAN&#65289;&#21644;QCBM
&lt;/p&gt;
&lt;p&gt;
Implementing Quantum Generative Adversarial Network (qGAN) and QCBM in Finance. (arXiv:2308.08448v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08448
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#35752;&#35770;&#20102;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#24212;&#29992;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#30340;&#26032;&#30740;&#31350;&#26041;&#21521;&#65292;&#36890;&#36807;&#27604;&#36739;qGAN&#21644;QCBM&#31561;&#27169;&#22411;&#65292;&#23637;&#31034;&#20102;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#23454;&#29616;&#37327;&#23376;&#20248;&#21183;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#65288;QML&#65289;&#26159;&#19968;&#20010;&#36328;&#23398;&#31185;&#30340;&#39046;&#22495;&#65292;&#30001;&#20004;&#20010;&#26368;&#20855;&#21019;&#26032;&#24615;&#30340;&#30740;&#31350;&#39046;&#22495;&#32452;&#25104;&#65306;&#37327;&#23376;&#35745;&#31639;&#21644;&#32463;&#20856;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#65292;ML&#21644;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#34987;&#35748;&#20026;&#26159;&#23558;&#21463;&#21040;&#37327;&#23376;&#35745;&#31639;&#26426;&#20852;&#36215;&#24433;&#21709;&#30340;&#31532;&#19968;&#20010;&#39046;&#22495;&#12290;&#36825;&#39033;&#24037;&#20316;&#35752;&#35770;&#20102;&#22312;&#37329;&#34701;&#20013;&#24212;&#29992;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#65288;QML&#65289;&#30340;&#19968;&#20123;&#26032;&#30740;&#31350;&#39046;&#22495;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#19968;&#20123;&#24050;&#22312;&#37329;&#34701;&#30028;&#24341;&#36215;&#20851;&#27880;&#30340;QML&#27169;&#22411;&#65292;&#20197;&#21450;&#20351;&#29992;&#27169;&#25311;&#29615;&#22659;&#20013;&#30340;&#30495;&#23454;&#37329;&#34701;&#25968;&#25454;&#38598;&#23545;qGAN&#65288;&#37327;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65289;&#21644;QCBM&#65288;&#37327;&#23376;&#30005;&#36335;Born&#26426;&#65289;&#31561;&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#12290;&#23545;&#20110;qGAN&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#37492;&#21035;&#22120;&#21644;&#29983;&#25104;&#22120;&#30340;&#37327;&#23376;&#30005;&#36335;&#65292;&#24182;&#23637;&#31034;&#20102;&#26410;&#26469;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#36890;&#36807;QML&#23454;&#29616;&#37327;&#23376;&#20248;&#21183;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantum machine learning (QML) is a cross-disciplinary subject made up of two of the most exciting research areas: quantum computing and classical machine learning (ML), with ML and artificial intelligence (AI) being projected as the first fields that will be impacted by the rise of quantum machines. Quantum computers are being used today in drug discovery, material &amp; molecular modelling and finance. In this work, we discuss some upcoming active new research areas in application of quantum machine learning (QML) in finance. We discuss certain QML models that has become areas of active interest in the financial world for various applications. We use real world financial dataset and compare models such as qGAN (quantum generative adversarial networks) and QCBM (quantum circuit Born machine) among others, using simulated environments. For the qGAN, we define quantum circuits for discriminators and generators and show promises of future quantum advantage via QML in finance.
&lt;/p&gt;</description></item></channel></rss>