<rss version="2.0"><channel><title>Chat Arxiv cs.ET</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.ET</description><item><title>&#36890;&#36807;&#30828;&#20214;-&#31639;&#27861;-&#36890;&#20449;&#21327;&#21516;&#35774;&#35745;&#65292;&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29616;&#39640;&#25928;&#21487;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;&#30340;&#30740;&#31350;&#26041;&#27861;&#65292;&#21363;&#36890;&#36807;&#32467;&#21512;&#29289;&#29702;&#27934;&#35265;&#12289;&#39640;&#25928;&#20449;&#24687;&#22788;&#29702;&#21407;&#21017;&#12289;&#26368;&#20248;&#19981;&#30830;&#23450;&#24230;&#37327;&#32467;&#26524;&#21644;&#20998;&#24067;&#24335;&#22788;&#29702;&#20934;&#21017;&#65292;&#26469;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#30340;&#25928;&#29575;&#21644;&#21487;&#20449;&#24230;&#12290;</title><link>http://arxiv.org/abs/2309.15942</link><description>&lt;p&gt;
&#36890;&#36807;&#30828;&#20214;-&#31639;&#27861;-&#36890;&#20449;&#21327;&#21516;&#35774;&#35745;&#23454;&#29616;&#39640;&#25928;&#21487;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Towards Efficient and Trustworthy AI Through Hardware-Algorithm-Communication Co-Design. (arXiv:2309.15942v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15942
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30828;&#20214;-&#31639;&#27861;-&#36890;&#20449;&#21327;&#21516;&#35774;&#35745;&#65292;&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29616;&#39640;&#25928;&#21487;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;&#30340;&#30740;&#31350;&#26041;&#27861;&#65292;&#21363;&#36890;&#36807;&#32467;&#21512;&#29289;&#29702;&#27934;&#35265;&#12289;&#39640;&#25928;&#20449;&#24687;&#22788;&#29702;&#21407;&#21017;&#12289;&#26368;&#20248;&#19981;&#30830;&#23450;&#24230;&#37327;&#32467;&#26524;&#21644;&#20998;&#24067;&#24335;&#22788;&#29702;&#20934;&#21017;&#65292;&#26469;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#30340;&#25928;&#29575;&#21644;&#21487;&#20449;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#24050;&#32463;&#34987;&#35774;&#35745;&#20102;&#20960;&#21313;&#24180;&#65292;&#30446;&#26631;&#26159;&#26368;&#22823;&#21270;&#26576;&#31181;&#20934;&#30830;&#24615;&#24230;&#37327;&#12290;&#36825;&#23548;&#33268;&#20102;&#20004;&#20010;&#19981;&#24076;&#26395;&#20986;&#29616;&#30340;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#20197;&#35745;&#31639;&#21644;&#20869;&#23384;&#38656;&#27714;&#20026;&#34913;&#37327;&#26631;&#20934;&#65292;&#27169;&#22411;&#22797;&#26434;&#24615;&#21576;&#25351;&#25968;&#22686;&#38271;&#12290;&#31532;&#20108;&#65292;&#26368;&#26032;&#30340;&#20154;&#24037;&#26234;&#33021;&#27169;&#22411;&#22312;&#25552;&#20379;&#21487;&#20449;&#24230;&#37327;&#26041;&#38754;&#24456;&#38590;&#23454;&#29616;&#65292;&#21487;&#33021;&#20986;&#29616;"&#24187;&#35273;"&#38382;&#39064;&#65292;&#20174;&#32780;&#38459;&#30861;&#20102;&#20854;&#22312;&#25935;&#24863;&#24212;&#29992;&#30340;&#20915;&#31574;&#21046;&#23450;&#20013;&#30340;&#24212;&#29992;&#12290;&#20026;&#20102;&#23454;&#29616;&#39640;&#25928;&#21487;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;&#65292;&#26412;&#25991;&#24378;&#35843;&#30828;&#20214;&#21644;&#36719;&#20214;&#35774;&#35745;&#20132;&#21449;&#30340;&#30740;&#31350;&#26041;&#21521;&#65292;&#23558;&#29289;&#29702;&#27934;&#35265;&#19982;&#35745;&#31639;&#22522;&#30784;&#12289;&#31070;&#32463;&#31185;&#23398;&#26377;&#20851;&#30340;&#39640;&#25928;&#20449;&#24687;&#22788;&#29702;&#21407;&#21017;&#12289;&#20449;&#24687;&#35770;&#20013;&#20851;&#20110;&#26368;&#20248;&#19981;&#30830;&#23450;&#24230;&#37327;&#30340;&#32467;&#26524;&#20197;&#21450;&#36890;&#20449;&#29702;&#35770;&#20013;&#20851;&#20110;&#20998;&#24067;&#24335;&#22788;&#29702;&#30340;&#20934;&#21017;&#30456;&#32467;&#21512;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#26412;&#25991;&#25552;&#20513;&#26032;&#30340;&#30828;&#20214;-&#31639;&#27861;-&#36890;&#20449;&#21327;&#21516;&#35774;&#35745;&#26041;&#27861;&#65292;&#20197;&#23454;&#29616;&#39640;&#25928;&#21487;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) algorithms based on neural networks have been designed for decades with the goal of maximising some measure of accuracy. This has led to two undesired effects. First, model complexity has risen exponentially when measured in terms of computation and memory requirements. Second, state-of-the-art AI models are largely incapable of providing trustworthy measures of their uncertainty, possibly `hallucinating' their answers and discouraging their adoption for decision-making in sensitive applications.  With the goal of realising efficient and trustworthy AI, in this paper we highlight research directions at the intersection of hardware and software design that integrate physical insights into computational substrates, neuroscientific principles concerning efficient information processing, information-theoretic results on optimal uncertainty quantification, and communication-theoretic guidelines for distributed processing. Overall, the paper advocates for novel d
&lt;/p&gt;</description></item></channel></rss>