<rss version="2.0"><channel><title>Chat Arxiv cs.FL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.FL</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#35831;&#27714;&#25104;&#21592;&#26631;&#31614;&#21644;&#25104;&#23545;&#20559;&#22909;&#26469;&#25193;&#23637;&#20027;&#21160;&#35268;&#33539;&#23398;&#20064;&#65292;&#25552;&#39640;&#23398;&#20064;&#24418;&#24335;&#35268;&#33539;&#30340;&#28789;&#27963;&#24615;&#12290;&#22312;&#20004;&#20010;&#19981;&#21516;&#39046;&#22495;&#30340;&#23454;&#39564;&#20013;&#65292;&#32467;&#26524;&#34920;&#26126;&#36890;&#36807;&#23398;&#20064;&#25104;&#21592;&#21644;&#20559;&#22909;&#30340;&#32452;&#21512;&#21487;&#20197;&#31283;&#23450;&#21644;&#26041;&#20415;&#22320;&#35782;&#21035;&#35268;&#33539;&#12290;</title><link>http://arxiv.org/abs/2307.10434</link><description>&lt;p&gt;
&#20174;&#25104;&#21592;&#21644;&#20559;&#22909;&#26597;&#35810;&#20013;&#23398;&#20064;&#24418;&#24335;&#35268;&#33539;
&lt;/p&gt;
&lt;p&gt;
Learning Formal Specifications from Membership and Preference Queries. (arXiv:2307.10434v1 [cs.FL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10434
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#35831;&#27714;&#25104;&#21592;&#26631;&#31614;&#21644;&#25104;&#23545;&#20559;&#22909;&#26469;&#25193;&#23637;&#20027;&#21160;&#35268;&#33539;&#23398;&#20064;&#65292;&#25552;&#39640;&#23398;&#20064;&#24418;&#24335;&#35268;&#33539;&#30340;&#28789;&#27963;&#24615;&#12290;&#22312;&#20004;&#20010;&#19981;&#21516;&#39046;&#22495;&#30340;&#23454;&#39564;&#20013;&#65292;&#32467;&#26524;&#34920;&#26126;&#36890;&#36807;&#23398;&#20064;&#25104;&#21592;&#21644;&#20559;&#22909;&#30340;&#32452;&#21512;&#21487;&#20197;&#31283;&#23450;&#21644;&#26041;&#20415;&#22320;&#35782;&#21035;&#35268;&#33539;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#21160;&#23398;&#20064;&#26159;&#19968;&#31181;&#30740;&#31350;&#24191;&#27867;&#30340;&#23398;&#20064;&#24418;&#24335;&#35268;&#33539;&#30340;&#26041;&#27861;&#65292;&#20363;&#22914;&#33258;&#21160;&#26426;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#23558;&#20027;&#21160;&#35268;&#33539;&#23398;&#20064;&#25193;&#23637;&#21040;&#35831;&#27714;&#32452;&#21512;&#25104;&#21592;&#26631;&#31614;&#21644;&#25104;&#23545;&#20559;&#22909;&#65288;&#23545;&#25104;&#21592;&#26631;&#31614;&#30340;&#19968;&#31181;&#27969;&#34892;&#26367;&#20195;&#26041;&#24335;&#65289;&#12290;&#25104;&#23545;&#20559;&#22909;&#21644;&#25104;&#21592;&#26631;&#31614;&#30340;&#32452;&#21512;&#20801;&#35768;&#26356;&#28789;&#27963;&#30340;&#20027;&#21160;&#35268;&#33539;&#23398;&#20064;&#26041;&#27861;&#65292;&#23427;&#20808;&#21069;&#20165;&#20381;&#36182;&#25104;&#21592;&#26631;&#31614;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#20004;&#20010;&#19981;&#21516;&#30340;&#39046;&#22495;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#24191;&#27867;&#24615;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#20174;&#20004;&#31181;&#27169;&#24335;&#23398;&#20064;&#21487;&#20197;&#36890;&#36807;&#25104;&#21592;&#21644;&#20559;&#22909;&#26469;&#31283;&#20581;&#21644;&#26041;&#20415;&#22320;&#35782;&#21035;&#35268;&#33539;&#12290;
&lt;/p&gt;
&lt;p&gt;
Active learning is a well-studied approach to learning formal specifications, such as automata. In this work, we extend active specification learning by proposing a novel framework that strategically requests a combination of membership labels and pair-wise preferences, a popular alternative to membership labels. The combination of pair-wise preferences and membership labels allows for a more flexible approach to active specification learning, which previously relied on membership labels only. We instantiate our framework in two different domains, demonstrating the generality of our approach. Our results suggest that learning from both modalities allows us to robustly and conveniently identify specifications via membership and preferences.
&lt;/p&gt;</description></item></channel></rss>