<rss version="2.0"><channel><title>Chat Arxiv cs.FL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.FL</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#65292;&#21033;&#29992;&#23618;&#27425;&#21270;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#23454;&#29616;&#21516;&#26102;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#24341;&#20837;&#23618;&#27425;&#21270;&#32467;&#26500;&#21040;LTL&#35268;&#33539;&#20013;&#65292;&#35813;&#26041;&#27861;&#26356;&#20855;&#34920;&#36798;&#33021;&#21147;&#12290;&#37319;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#26041;&#27861;&#26469;&#32508;&#21512;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#35745;&#21010;&#65292;&#23558;&#25628;&#32034;&#31354;&#38388;&#25286;&#20998;&#20026;&#26494;&#25955;&#30456;&#20114;&#36830;&#25509;&#30340;&#23376;&#31354;&#38388;&#65292;&#20197;&#20415;&#26356;&#39640;&#25928;&#22320;&#36827;&#34892;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#12290;</title><link>http://arxiv.org/abs/2401.04003</link><description>&lt;p&gt;
&#22810;&#26426;&#22120;&#20154;&#22312;&#23618;&#27425;&#21270;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#19979;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Simultaneous Task Allocation and Planning for Multi-Robots under Hierarchical Temporal Logic Specifications. (arXiv:2401.04003v2 [cs.RO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04003
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#65292;&#21033;&#29992;&#23618;&#27425;&#21270;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#23454;&#29616;&#21516;&#26102;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#24341;&#20837;&#23618;&#27425;&#21270;&#32467;&#26500;&#21040;LTL&#35268;&#33539;&#20013;&#65292;&#35813;&#26041;&#27861;&#26356;&#20855;&#34920;&#36798;&#33021;&#21147;&#12290;&#37319;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#26041;&#27861;&#26469;&#32508;&#21512;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#35745;&#21010;&#65292;&#23558;&#25628;&#32034;&#31354;&#38388;&#25286;&#20998;&#20026;&#26494;&#25955;&#30456;&#20114;&#36830;&#25509;&#30340;&#23376;&#31354;&#38388;&#65292;&#20197;&#20415;&#26356;&#39640;&#25928;&#22320;&#36827;&#34892;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20851;&#20110;&#26426;&#22120;&#20154;&#35268;&#21010;&#19982;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#30340;&#30740;&#31350;&#65292;&#29305;&#21035;&#26159;&#32447;&#24615;&#26102;&#38388;&#36923;&#36753;&#65288;LTL&#65289;&#65292;&#20027;&#35201;&#26159;&#22522;&#20110;&#38024;&#23545;&#20010;&#20307;&#25110;&#32676;&#20307;&#26426;&#22120;&#20154;&#30340;&#21333;&#19968;&#20844;&#24335;&#12290;&#20294;&#38543;&#30528;&#20219;&#21153;&#22797;&#26434;&#24615;&#30340;&#22686;&#21152;&#65292;LTL&#20844;&#24335;&#19981;&#21487;&#36991;&#20813;&#22320;&#21464;&#24471;&#20887;&#38271;&#65292;&#20351;&#35299;&#37322;&#21644;&#35268;&#33539;&#29983;&#25104;&#21464;&#24471;&#22797;&#26434;&#65292;&#21516;&#26102;&#36824;&#23545;&#35268;&#21010;&#22120;&#30340;&#35745;&#31639;&#33021;&#21147;&#36896;&#25104;&#21387;&#21147;&#12290;&#36890;&#36807;&#21033;&#29992;&#20219;&#21153;&#30340;&#20869;&#22312;&#32467;&#26500;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#23618;&#27425;&#21270;&#32467;&#26500;&#21040;&#20855;&#26377;&#35821;&#27861;&#21644;&#35821;&#20041;&#38656;&#27714;&#30340;LTL&#35268;&#33539;&#20013;&#65292;&#24182;&#35777;&#26126;&#23427;&#20204;&#27604;&#25153;&#24179;&#35268;&#33539;&#26356;&#20855;&#34920;&#36798;&#33021;&#21147;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#37319;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#26041;&#27861;&#26469;&#32508;&#21512;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#35745;&#21010;&#65292;&#23454;&#29616;&#21516;&#26102;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#12290;&#25628;&#32034;&#31354;&#38388;&#30001;&#26494;&#25955;&#30456;&#20114;&#36830;&#25509;&#30340;&#23376;&#31354;&#38388;&#36817;&#20284;&#34920;&#31034;&#65292;&#27599;&#20010;&#23376;&#31354;&#38388;&#23545;&#24212;&#19968;&#20010;LTL&#35268;&#33539;&#12290;&#25628;&#32034;&#20027;&#35201;&#21463;&#38480;&#20110;&#21333;&#20010;&#23376;&#31354;&#38388;&#65292;&#26681;&#25454;&#29305;&#23450;&#26465;&#20214;&#36716;&#31227;&#21040;&#21478;&#19968;&#20010;&#23376;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
Past research into robotic planning with temporal logic specifications, notably Linear Temporal Logic (LTL), was largely based on singular formulas for individual or groups of robots. But with increasing task complexity, LTL formulas unavoidably grow lengthy, complicating interpretation and specification generation, and straining the computational capacities of the planners. By leveraging the intrinsic structure of tasks, we introduced a hierarchical structure to LTL specifications with requirements on syntax and semantics, and proved that they are more expressive than their flat counterparts. Second, we employ a search-based approach to synthesize plans for a multi-robot system, accomplishing simultaneous task allocation and planning. The search space is approximated by loosely interconnected sub-spaces, with each sub-space corresponding to one LTL specification. The search is predominantly confined to a single sub-space, transitioning to another sub-space under certain conditions, de
&lt;/p&gt;</description></item></channel></rss>