<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#19968;&#31181;&#26032;&#30340;&#20851;&#20110;&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20351;&#29992;&#20102;Gale-Shapley&#31639;&#27861;&#30340;&#35266;&#28857;&#12290;&#32467;&#26524;&#32473;&#20986;&#20102;MaxProp&#21644;MaxRou&#31561;&#26465;&#20214;&#65292;&#24182;&#19982;&#20197;&#21069;&#30340;&#39034;&#24207;&#20559;&#22909;&#21644;&#26080;&#20132;&#21449;&#26465;&#20214;&#19981;&#30456;&#20132;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20351;MaxProp&#21487;&#26377;&#25928;&#39564;&#35777;&#30340;&#29305;&#24449;&#65292;&#24182;&#23637;&#31034;&#20102;&#19982;&#25972;&#20010;&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#31867;&#30340;&#24046;&#36317;&#12290;</title><link>http://arxiv.org/abs/2310.18736</link><description>&lt;p&gt;
&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#30340;Gale-Shapley&#35266;&#28857;
&lt;/p&gt;
&lt;p&gt;
A Gale-Shapley View of Unique Stable Marriages. (arXiv:2310.18736v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18736
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#19968;&#31181;&#26032;&#30340;&#20851;&#20110;&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20351;&#29992;&#20102;Gale-Shapley&#31639;&#27861;&#30340;&#35266;&#28857;&#12290;&#32467;&#26524;&#32473;&#20986;&#20102;MaxProp&#21644;MaxRou&#31561;&#26465;&#20214;&#65292;&#24182;&#19982;&#20197;&#21069;&#30340;&#39034;&#24207;&#20559;&#22909;&#21644;&#26080;&#20132;&#21449;&#26465;&#20214;&#19981;&#30456;&#20132;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20351;MaxProp&#21487;&#26377;&#25928;&#39564;&#35777;&#30340;&#29305;&#24449;&#65292;&#24182;&#23637;&#31034;&#20102;&#19982;&#25972;&#20010;&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#31867;&#30340;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20108;&#36793;&#24066;&#22330;&#30340;&#31283;&#23450;&#23130;&#23035;&#38382;&#39064;&#26159;&#19968;&#20010;&#32463;&#20856;&#38382;&#39064;&#65292;&#22312;&#35768;&#22810;&#23454;&#38469;&#22330;&#26223;&#20013;&#37117;&#20250;&#20986;&#29616;&#12290;&#27492;&#22806;&#65292;&#22312;&#36825;&#20010;&#24066;&#22330;&#19978;&#30340;&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#21487;&#20197;&#31616;&#21270;&#19968;&#31995;&#21015;&#19979;&#28216;&#38656;&#27714;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#36825;&#20010;&#35774;&#32622;&#19979;&#20851;&#20110;&#29420;&#29305;&#31283;&#23450;&#21305;&#37197;&#30340;&#19968;&#32452;&#20805;&#20998;&#26465;&#20214;&#12290;&#19982;&#20854;&#20182;&#20063;&#20351;&#29992;&#20559;&#22909;&#37197;&#32622;&#30340;&#32467;&#26500;&#26469;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#30340;&#26041;&#27861;&#19981;&#21516;&#65292;&#25105;&#20204;&#20351;&#29992;&#31639;&#27861;&#30340;&#35270;&#35282;&#65292;&#24182;&#30740;&#31350;&#26159;&#21542;&#21487;&#20197;&#29992;Gale&#21644;Shapley&#31639;&#27861;&#30340;&#35266;&#28857;&#26469;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#32473;&#20986;&#20102;&#19968;&#32452;&#20805;&#20998;&#26465;&#20214;&#65292;&#21253;&#25324;MaxProp&#21644;MaxRou&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#20123;&#26465;&#20214;&#19982;&#20197;&#21069;&#24050;&#30693;&#30340;&#26465;&#20214;&#22914;&#39034;&#24207;&#20559;&#22909;&#21644;&#26080;&#20132;&#21449;&#26159;&#19981;&#30456;&#20132;&#30340;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#20351;MaxProp&#21487;&#20197;&#39640;&#25928;&#39564;&#35777;&#30340;&#29305;&#24449;&#65292;&#24182;&#23637;&#31034;&#20102;MaxProp&#19982;&#25972;&#20010;&#29420;&#29305;&#31283;&#23450;&#23130;&#23035;&#31867;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#36825;&#20123;&#32467;&#26524;&#25552;&#20379;&#20102;&#23545;&#23376;&#32467;&#26500;&#30340;&#26356;&#35814;&#32454;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stable marriage of a two-sided market with unit demand is a classic problem that arises in many real-world scenarios. In addition, a unique stable marriage in this market simplifies a host of downstream desiderata. In this paper, we explore a new set of sufficient conditions for unique stable matching (USM) under this setup. Unlike other approaches that also address this question using the structure of preference profiles, we use an algorithmic viewpoint and investigate if this question can be answered using the lens of the deferred acceptance (DA) algorithm (Gale and Shapley, 1962). Our results yield a set of sufficient conditions for USM (viz., MaxProp and MaxRou) and show that these are disjoint from the previously known sufficiency conditions like sequential preference and no crossing. We also provide a characterization of MaxProp that makes it efficiently verifiable, and shows the gap between MaxProp and the entire USM class. These results give a more detailed view of the sub-stru
&lt;/p&gt;</description></item></channel></rss>