<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#22312;&#32447;&#24066;&#22330;&#65292;&#29992;&#20110;&#36830;&#25509;&#26426;&#22120;&#23398;&#20064;&#30340;&#20379;&#27714;&#21305;&#37197;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#36825;&#20010;&#24066;&#22330;&#35774;&#35745;&#20013;&#30340;&#20004;&#20010;&#26680;&#24515;&#25361;&#25112;&#30340;&#26032;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2310.17843</link><description>&lt;p&gt;
&#19968;&#31181;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#26426;&#22120;&#23398;&#20064;&#22312;&#32447;&#24066;&#22330;&#65306;&#20174;&#21457;&#29616;&#21040;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
A Data-Centric Online Market for Machine Learning: From Discovery to Pricing. (arXiv:2310.17843v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17843
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#22312;&#32447;&#24066;&#22330;&#65292;&#29992;&#20110;&#36830;&#25509;&#26426;&#22120;&#23398;&#20064;&#30340;&#20379;&#27714;&#21305;&#37197;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#36825;&#20010;&#24066;&#22330;&#35774;&#35745;&#20013;&#30340;&#20004;&#20010;&#26680;&#24515;&#25361;&#25112;&#30340;&#26032;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#26159;&#26426;&#22120;&#23398;&#20064;&#30340;&#21160;&#21147; - &#20016;&#23500;&#21644;&#39640;&#36136;&#37327;&#30340;&#35757;&#32451;&#25968;&#25454;&#23545;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#25104;&#21151;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#35201;&#23558;&#26426;&#22120;&#23398;&#20064;&#20174;&#23569;&#25968;&#22823;&#22411;&#20844;&#21496;&#20043;&#38388;&#30340;&#31454;&#36187;&#36716;&#21464;&#20026;&#20026;&#20247;&#22810;&#26222;&#36890;&#29992;&#25143;&#30340;&#25968;&#25454;&#20998;&#26512;&#35831;&#27714;&#26381;&#21153;&#30340;&#21487;&#35775;&#38382;&#25216;&#26415;&#65292;&#20173;&#28982;&#23384;&#22312;&#37325;&#35201;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#30340;&#19968;&#20010;&#24046;&#36317;&#26159;&#65292;&#35768;&#22810;&#26426;&#22120;&#23398;&#20064;&#29992;&#25143;&#21487;&#20197;&#20174;&#20854;&#20182;&#25968;&#25454;&#25152;&#26377;&#32773;&#25317;&#26377;&#30340;&#26032;&#25968;&#25454;&#20013;&#21463;&#30410;&#65292;&#32780;&#36825;&#20123;&#25968;&#25454;&#25152;&#26377;&#32773;&#21364;&#22352;&#22312;&#19968;&#22534;&#25968;&#25454;&#19978;&#65292;&#19981;&#30693;&#36947;&#35841;&#21487;&#20197;&#21463;&#30410;&#20110;&#23427;&#12290;&#36825;&#31181;&#24046;&#36317;&#20026;&#26500;&#24314;&#19968;&#20010;&#33021;&#22815;&#33258;&#21160;&#36830;&#25509;&#20379;&#27714;&#30340;&#22312;&#32447;&#24066;&#22330;&#21019;&#36896;&#20102;&#26426;&#20250;&#12290;&#34429;&#28982;&#22312;&#32447;&#21305;&#37197;&#24066;&#22330;&#24456;&#24120;&#35265;&#65288;&#20363;&#22914;&#65292;&#25171;&#36710;&#31995;&#32479;&#65289;&#65292;&#20294;&#20026;&#26426;&#22120;&#23398;&#20064;&#35774;&#35745;&#19968;&#20010;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#30340;&#24066;&#22330;&#38754;&#20020;&#35768;&#22810;&#21069;&#25152;&#26410;&#26377;&#30340;&#25361;&#25112;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#26032;&#30340;&#25216;&#26415;&#26469;&#35299;&#20915;&#35774;&#35745;&#36825;&#26679;&#19968;&#20010;&#24066;&#22330;&#20013;&#30340;&#20004;&#20010;&#26680;&#24515;&#25361;&#25112;&#65306;&#65288;a&#65289;&#20026;&#20102;&#39640;&#25928;&#22320;&#23558;&#38656;&#27714;&#19982;&#20379;&#24212;&#21305;&#37197;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#31639;&#27861;&#65292;&#21487;&#20197;&#20174;&#25968;&#21315;&#20010;&#25968;&#25454;&#27744;&#20013;&#33258;&#21160;&#21457;&#29616;&#20219;&#20309;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#25152;&#38656;&#30340;&#26377;&#29992;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data fuels machine learning (ML) - rich and high-quality training data is essential to the success of ML. However, to transform ML from the race among a few large corporations to an accessible technology that serves numerous normal users' data analysis requests, there still exist important challenges. One gap we observed is that many ML users can benefit from new data that other data owners possess, whereas these data owners sit on piles of data without knowing who can benefit from it. This gap creates the opportunity for building an online market that can automatically connect supply with demand. While online matching markets are prevalent (e.g., ride-hailing systems), designing a data-centric market for ML exhibits many unprecedented challenges.  This paper develops new techniques to tackle two core challenges in designing such a market: (a) to efficiently match demand with supply, we design an algorithm to automatically discover useful data for any ML task from a pool of thousands o
&lt;/p&gt;</description></item></channel></rss>