<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#23454;&#39564;&#35777;&#23454;&#22240;&#26524;&#25253;&#24212;&#22312;&#36164;&#28304;&#20998;&#37197;&#19978;&#24102;&#26469;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#31119;&#21033;&#22909;&#22788;&#65292;&#23588;&#20854;&#22312;&#20855;&#26377;&#38388;&#27463;&#24613;&#36843;&#24615;&#30340;&#24773;&#22659;&#20013;&#25928;&#26524;&#26356;&#20339;&#12290;</title><link>https://arxiv.org/abs/2404.02687</link><description>&lt;p&gt;
Karma&#65306;&#19968;&#20010;&#23454;&#39564;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Karma: An Experimental Study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02687
&lt;/p&gt;
&lt;p&gt;
&#23454;&#39564;&#35777;&#23454;&#22240;&#26524;&#25253;&#24212;&#22312;&#36164;&#28304;&#20998;&#37197;&#19978;&#24102;&#26469;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#31119;&#21033;&#22909;&#22788;&#65292;&#23588;&#20854;&#22312;&#20855;&#26377;&#38388;&#27463;&#24613;&#36843;&#24615;&#30340;&#24773;&#22659;&#20013;&#25928;&#26524;&#26356;&#20339;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21487;&#20132;&#26131;&#31215;&#20998;&#31995;&#32479;&#65292;&#31867;&#20284;&#20110;&#22240;&#26524;&#25253;&#24212;&#65292;&#22240;&#27492;&#25552;&#35758;&#20197;&#27492;&#21629;&#21517;&#65292;&#26159;&#19968;&#31181;&#29992;&#20110;&#37325;&#22797;&#36164;&#28304;&#20998;&#37197;&#30340;&#26426;&#21046;&#65292;&#22312;&#29702;&#35770;&#19978;&#20855;&#26377;&#21560;&#24341;&#20154;&#30340;&#25928;&#29575;&#21644;&#20844;&#24179;&#29305;&#24615;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#22312;&#19968;&#39033;&#22312;&#32447;&#23454;&#39564;&#20013;&#27979;&#35797;&#20102;&#22240;&#26524;&#25253;&#24212;&#65292;&#23454;&#39564;&#20013;&#20154;&#31867;&#34987;&#35201;&#27714;&#37325;&#22797;&#31454;&#20105;&#33719;&#21462;&#19968;&#31181;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#21644;&#38543;&#26426;&#20010;&#20154;&#20559;&#22909;&#25110;&#32039;&#36843;&#24615;&#30340;&#36164;&#28304;&#12290;&#25105;&#20204;&#30830;&#35748;&#65292;&#21363;&#20351;&#22312;&#27809;&#26377;&#20219;&#20309;&#20107;&#20808;&#22521;&#35757;&#30340;&#20154;&#32676;&#20013;&#65292;&#22240;&#26524;&#25253;&#24212;&#20063;&#20855;&#26377;&#26174;&#33879;&#19988;&#25345;&#20037;&#30340;&#31119;&#21033;&#22909;&#22788;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20855;&#26377;&#38388;&#27463;&#24613;&#36843;&#24615;&#30340;&#24773;&#22659;&#20013;&#65292;&#26426;&#21046;&#30340;&#20351;&#29992;&#27425;&#25968;&#27604;&#39057;&#32321;&#20013;&#31561;&#32039;&#36843;&#24615;&#30340;&#24773;&#22659;&#26356;&#22810;&#65292;&#24182;&#19988;&#23558;&#20854;&#23454;&#26045;&#20026;&#19968;&#20010;&#31616;&#21333;&#65288;&#20108;&#20803;&#65289;&#30340;&#22240;&#26524;&#25253;&#24212;&#31454;&#26631;&#26041;&#26696;&#65292;&#23545;&#20110;&#31119;&#21033;&#30340;&#25552;&#39640;&#29305;&#21035;&#26377;&#25928;&#65306;&#23454;&#29616;&#20102;&#30456;&#23545;&#36739;&#22823;&#30340;&#24635;&#20307;&#25928;&#29575;&#22686;&#30410;&#65292;&#36825;&#20123;&#22686;&#30410;&#20960;&#20046;&#26159;&#24085;&#32047;&#25176;&#25913;&#36827;&#30340;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#36827;&#19968;&#27493;&#27979;&#35797;&#21644;&#26410;&#26469;&#23454;&#26045;&#35745;&#21010;&#25552;&#20379;&#20102;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02687v1 Announce Type: new  Abstract: A system of non-tradable credits that flow between individuals like karma, hence proposed under that name, is a mechanism for repeated resource allocation that comes with attractive efficiency and fairness properties, in theory. In this study, we test karma in an online experiment in which human subjects repeatedly compete for a resource with time-varying and stochastic individual preferences or urgency to acquire the resource. We confirm that karma has significant and sustained welfare benefits even in a population with no prior training. We identify mechanism usage in contexts with sporadic high urgency, more so than with frequent moderate urgency, and implemented as an easy (binary) karma bidding scheme as particularly effective for welfare improvements: relatively larger aggregate efficiency gains are realized that are (almost) Pareto superior. These findings provide guidance for further testing and for future implementation plans of
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39034;&#24207;&#25293;&#21334;&#26426;&#21046;&#30340;&#32463;&#27982;DAO&#27835;&#29702;&#26032;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;DAO&#38754;&#20020;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#26082;&#36991;&#20813;&#20102;&#20844;&#20849;&#36873;&#25321;&#38382;&#39064;&#65292;&#21448;&#33021;&#20419;&#36827;&#20215;&#20540;&#22686;&#38271;&#21644;&#25237;&#36164;&#12290;</title><link>https://arxiv.org/abs/2403.16980</link><description>&lt;p&gt;
&#32463;&#27982;DAO&#27835;&#29702;&#65306;&#19968;&#31181;&#21487;&#20105;&#22842;&#25511;&#21046;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Economic DAO Governance: A Contestable Control Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16980
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39034;&#24207;&#25293;&#21334;&#26426;&#21046;&#30340;&#32463;&#27982;DAO&#27835;&#29702;&#26032;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;DAO&#38754;&#20020;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#26082;&#36991;&#20813;&#20102;&#20844;&#20849;&#36873;&#25321;&#38382;&#39064;&#65292;&#21448;&#33021;&#20419;&#36827;&#20215;&#20540;&#22686;&#38271;&#21644;&#25237;&#36164;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#24418;&#24335;&#30340;DAO&#27835;&#29702;&#65292;&#21033;&#29992;&#39034;&#24207;&#25293;&#21334;&#26426;&#21046;&#26469;&#20811;&#26381;DAO&#20986;&#29616;&#30340;&#26681;&#28145;&#33922;&#22266;&#30340;&#25511;&#21046;&#38382;&#39064;&#65292;&#36890;&#36807;&#21019;&#24314;&#19968;&#20010;&#20020;&#26102;&#21487;&#20105;&#22842;&#25511;&#21046;&#30340;&#21046;&#24230;&#12290;&#36825;&#31181;&#26426;&#21046;&#36991;&#20813;&#20102;&#25237;&#31080;&#26041;&#27861;&#22266;&#26377;&#30340;&#28508;&#22312;&#20844;&#20849;&#36873;&#25321;&#38382;&#39064;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#20010;&#21487;&#20197;&#22686;&#24378;&#21644;&#30830;&#20445;DAO&#25237;&#31080;&#21644;&#20854;&#20182;DAO&#38750;&#24066;&#22330;&#27835;&#29702;&#31243;&#24207;&#22266;&#26377;&#20215;&#20540;&#30340;&#24037;&#20855;&#12290;&#23427;&#23545;&#31354;&#22836;&#25237;&#31080;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#19988;&#20195;&#30721;&#21487;&#34892;&#12290;&#23427;&#20419;&#36827;&#20102;DAO&#22312;&#38754;&#23545;&#19981;&#21516;&#30417;&#31649;&#26041;&#27861;&#26102;&#23454;&#29616;&#20854;&#35268;&#33539;&#21644;&#36816;&#33829;&#30446;&#26631;&#30340;&#33021;&#21147;&#12290;&#35774;&#35745;&#26159;&#23558;&#25511;&#21046;&#26435;&#36716;&#31227;&#32473;&#25317;&#26377;&#26368;&#26377;&#21069;&#36884;&#21830;&#19994;&#35745;&#21010;&#30340;&#19968;&#26041;&#65292;&#21516;&#26102;&#20197;&#19968;&#31181;&#26377;&#21033;&#20110;&#20419;&#36827;&#20854;&#20182;&#26041;&#25237;&#36164;&#30340;&#26041;&#24335;&#20998;&#37197;&#21097;&#20313;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16980v1 Announce Type: cross  Abstract: In this article, we propose a new form of DAO governance that uses a sequential auction mechanism to overcome entrenched control issues that have emerged for DAOs by creating a regime of temporary contestable control. The mechanism avoids potential public choice problems inherent in voting approaches but at the same time provides a vehicle that can enhance and secure value than inheres to DAO voting and other DAO non-market governance procedures. It is robust to empty voting and is code feasible. It facilitates the ability of DAOs to meet their normative and operational goals in the face of diverse regulatory approaches. Designed to shift control to the party with the most promising business plan, at the same time it distributes surplus in a way that tends to promote investment by other parties.
&lt;/p&gt;</description></item></channel></rss>