<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#31639;&#27861;&#23450;&#20215;&#20013;&#30340;&#31639;&#27861;&#21512;&#35851;&#30417;&#31649;&#30340;&#23450;&#20041;&#65292;&#20801;&#35768;&#30417;&#31649;&#26426;&#26500;&#36890;&#36807;&#23545;&#25968;&#25454;&#30340;&#32479;&#35745;&#27979;&#35797;&#26469;&#23457;&#35745;&#31639;&#27861;&#65292;&#33391;&#22909;&#31639;&#27861;&#36890;&#36807;&#22686;&#21152;&#25968;&#25454;&#26469;&#36890;&#36807;&#23457;&#35745;&#65292;&#32780;&#36798;&#21040;&#39640;&#20110;&#31454;&#20105;&#20215;&#26684;&#30340;&#31639;&#27861;&#21017;&#26080;&#27861;&#36890;&#36807;&#23457;&#35745;&#12290;</title><link>http://arxiv.org/abs/2401.15794</link><description>&lt;p&gt;
&#31639;&#27861;&#23450;&#20215;&#20013;&#30340;&#31639;&#27861;&#21512;&#35851;&#30417;&#31649;
&lt;/p&gt;
&lt;p&gt;
Regulation of Algorithmic Collusion. (arXiv:2401.15794v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15794
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#31639;&#27861;&#23450;&#20215;&#20013;&#30340;&#31639;&#27861;&#21512;&#35851;&#30417;&#31649;&#30340;&#23450;&#20041;&#65292;&#20801;&#35768;&#30417;&#31649;&#26426;&#26500;&#36890;&#36807;&#23545;&#25968;&#25454;&#30340;&#32479;&#35745;&#27979;&#35797;&#26469;&#23457;&#35745;&#31639;&#27861;&#65292;&#33391;&#22909;&#31639;&#27861;&#36890;&#36807;&#22686;&#21152;&#25968;&#25454;&#26469;&#36890;&#36807;&#23457;&#35745;&#65292;&#32780;&#36798;&#21040;&#39640;&#20110;&#31454;&#20105;&#20215;&#26684;&#30340;&#31639;&#27861;&#21017;&#26080;&#27861;&#36890;&#36807;&#23457;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#21040;&#22312;&#31454;&#20105;&#24066;&#22330;&#20013;&#65292;&#21334;&#26041;&#20351;&#29992;&#31639;&#27861;&#26681;&#25454;&#20182;&#20204;&#25910;&#38598;&#21040;&#30340;&#25968;&#25454;&#35843;&#25972;&#20215;&#26684;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#31639;&#27861;&#21487;&#33021;&#24471;&#20986;&#39640;&#20110;&#31454;&#20105;&#20215;&#26684;&#30340;&#20215;&#26684;&#65292;&#20174;&#32780;&#20351;&#21334;&#26041;&#21463;&#30410;&#65292;&#32780;&#25439;&#23475;&#28040;&#36153;&#32773;&#65288;&#21363;&#24066;&#22330;&#20013;&#30340;&#20080;&#26041;&#65289;&#12290;&#26412;&#25991;&#20026;&#23450;&#20215;&#31639;&#27861;&#25552;&#20379;&#20102;&#21512;&#29702;&#30340;&#31639;&#27861;&#38750;&#21512;&#35851;&#30340;&#23450;&#20041;&#12290;&#35813;&#23450;&#20041;&#20801;&#35768;&#30417;&#31649;&#26426;&#26500;&#36890;&#36807;&#23545;&#25152;&#25910;&#38598;&#25968;&#25454;&#30340;&#32479;&#35745;&#27979;&#35797;&#26469;&#23545;&#31639;&#27861;&#36827;&#34892;&#23454;&#35777;&#23457;&#35745;&#12290;&#33391;&#22909;&#30340;&#31639;&#27861;&#65292;&#21363;&#22312;&#24066;&#22330;&#26465;&#20214;&#19979;&#36817;&#20284;&#20248;&#21270;&#20215;&#26684;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#36275;&#22815;&#25968;&#25454;&#26469;&#36890;&#36807;&#23457;&#35745;&#12290;&#30456;&#21453;&#65292;&#36798;&#21040;&#39640;&#20110;&#31454;&#20105;&#20215;&#26684;&#30340;&#31639;&#27861;&#26080;&#27861;&#36890;&#36807;&#23457;&#35745;&#12290;&#35813;&#23450;&#20041;&#20801;&#35768;&#21334;&#26041;&#25317;&#26377;&#19982;&#20379;&#38656;&#30456;&#20114;&#20851;&#32852;&#19988;&#21487;&#33021;&#24433;&#21709;&#33391;&#22909;&#31639;&#27861;&#25152;&#20351;&#29992;&#30340;&#20215;&#26684;&#30340;&#26377;&#29992;&#36741;&#21161;&#20449;&#24687;&#12290;&#26412;&#25991;&#36824;&#20998;&#26512;&#20102;&#32479;&#35745;&#20114;&#34917;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider sellers in a competitive market that use algorithms to adapt their prices from data that they collect. In such a context it is plausible that algorithms could arrive at prices that are higher than the competitive prices and this may benefit sellers at the expense of consumers (i.e., the buyers in the market). This paper gives a definition of plausible algorithmic non-collusion for pricing algorithms. The definition allows a regulator to empirically audit algorithms by applying a statistical test to the data that they collect. Algorithms that are good, i.e., approximately optimize prices to market conditions, can be augmented to contain the data sufficient to pass the audit. Algorithms that have colluded on, e.g., supra-competitive prices cannot pass the audit. The definition allows sellers to possess useful side information that may be correlated with supply and demand and could affect the prices used by good algorithms. The paper provides an analysis of the statistical comple
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;Stackelberg&#21338;&#24328;&#20013;&#30340;&#20027;&#21160;&#36870;&#21521;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#27963;&#36291;&#22320;&#26368;&#22823;&#21270;&#36319;&#38543;&#32773;&#22312;&#19981;&#21516;&#20551;&#35774;&#19979;&#30340;&#36712;&#36857;&#24046;&#24322;&#26469;&#21152;&#36895;&#39046;&#23548;&#32773;&#30340;&#25512;&#26029;&#36807;&#31243;&#12290;</title><link>http://arxiv.org/abs/2308.08017</link><description>&lt;p&gt;
Stackelberg&#36712;&#36857;&#21338;&#24328;&#20013;&#30340;&#20027;&#21160;&#36870;&#21521;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Active Inverse Learning in Stackelberg Trajectory Games. (arXiv:2308.08017v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08017
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;Stackelberg&#21338;&#24328;&#20013;&#30340;&#20027;&#21160;&#36870;&#21521;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#27963;&#36291;&#22320;&#26368;&#22823;&#21270;&#36319;&#38543;&#32773;&#22312;&#19981;&#21516;&#20551;&#35774;&#19979;&#30340;&#36712;&#36857;&#24046;&#24322;&#26469;&#21152;&#36895;&#39046;&#23548;&#32773;&#30340;&#25512;&#26029;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21338;&#24328;&#35770;&#30340;&#36870;&#21521;&#23398;&#20064;&#26159;&#20174;&#29609;&#23478;&#30340;&#34892;&#20026;&#20013;&#25512;&#26029;&#20986;&#20182;&#20204;&#30340;&#30446;&#26631;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;Stackelberg&#21338;&#24328;&#20013;&#65292;&#36890;&#36807;&#27599;&#20010;&#29609;&#23478;&#30340;&#21160;&#24577;&#31995;&#32479;&#36712;&#36857;&#26469;&#23450;&#20041;&#19968;&#20010;&#36870;&#21521;&#23398;&#20064;&#38382;&#39064;&#65292;&#20854;&#20013;&#21253;&#25324;&#19968;&#20010;&#39046;&#23548;&#32773;&#21644;&#19968;&#20010;&#36319;&#38543;&#32773;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20027;&#21160;&#36870;&#21521;&#23398;&#20064;&#26041;&#27861;&#65292;&#35753;&#39046;&#23548;&#32773;&#25512;&#26029;&#20986;&#19968;&#20010;&#26377;&#38480;&#20505;&#36873;&#38598;&#20013;&#25551;&#36848;&#36319;&#38543;&#32773;&#30446;&#26631;&#20989;&#25968;&#30340;&#20551;&#35774;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#20351;&#29992;&#34987;&#21160;&#35266;&#23519;&#21040;&#30340;&#36712;&#36857;&#19981;&#21516;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20027;&#21160;&#22320;&#26368;&#22823;&#21270;&#19981;&#21516;&#20551;&#35774;&#19979;&#36319;&#38543;&#32773;&#36712;&#36857;&#30340;&#24046;&#24322;&#65292;&#21152;&#36895;&#39046;&#23548;&#32773;&#30340;&#25512;&#26029;&#36807;&#31243;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#36882;&#36827;&#30340;&#37325;&#22797;&#36712;&#36857;&#21338;&#24328;&#20013;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#12290;&#19982;&#22343;&#21248;&#38543;&#26426;&#36755;&#20837;&#30456;&#27604;&#65292;&#25152;&#25552;&#20379;&#30340;&#26041;&#27861;&#21152;&#36895;&#20102;&#27010;&#29575;&#25910;&#25947;&#21040;&#26465;&#20214;&#20110;&#36319;&#38543;&#32773;&#36712;&#36857;&#30340;&#19981;&#21516;&#20551;&#35774;&#19978;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Game-theoretic inverse learning is the problem of inferring the players' objectives from their actions. We formulate an inverse learning problem in a Stackelberg game between a leader and a follower, where each player's action is the trajectory of a dynamical system. We propose an active inverse learning method for the leader to infer which hypothesis among a finite set of candidates describes the follower's objective function. Instead of using passively observed trajectories like existing methods, the proposed method actively maximizes the differences in the follower's trajectories under different hypotheses to accelerate the leader's inference. We demonstrate the proposed method in a receding-horizon repeated trajectory game. Compared with uniformly random inputs, the leader inputs provided by the proposed method accelerate the convergence of the probability of different hypotheses conditioned on the follower's trajectory by orders of magnitude.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26082;&#23562;&#37325;&#20010;&#20154;&#24847;&#24895;&#21448;&#39640;&#25928;&#30340;&#25424;&#36192;&#26426;&#21046;&#65292;&#36890;&#36807;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#20998;&#37197;&#27599;&#20010;&#25424;&#36192;&#32773;&#30340;&#36129;&#29486;&#65292;&#27809;&#26377;&#20219;&#20309;&#25424;&#21161;&#20154;&#26377;&#21160;&#26426;&#37325;&#26032;&#20998;&#37197;&#20182;&#20204;&#30340;&#25424;&#27454;&#12290;</title><link>http://arxiv.org/abs/2305.10286</link><description>&lt;p&gt;
&#24179;&#34913;&#25424;&#36192;&#32773;&#21327;&#35843;
&lt;/p&gt;
&lt;p&gt;
Balanced Donor Coordination. (arXiv:2305.10286v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10286
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26082;&#23562;&#37325;&#20010;&#20154;&#24847;&#24895;&#21448;&#39640;&#25928;&#30340;&#25424;&#36192;&#26426;&#21046;&#65292;&#36890;&#36807;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#20998;&#37197;&#27599;&#20010;&#25424;&#36192;&#32773;&#30340;&#36129;&#29486;&#65292;&#27809;&#26377;&#20219;&#20309;&#25424;&#21161;&#20154;&#26377;&#21160;&#26426;&#37325;&#26032;&#20998;&#37197;&#20182;&#20204;&#30340;&#25424;&#27454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24904;&#21892;&#36890;&#24120;&#30001;&#20010;&#20154;&#25424;&#36192;&#32773;&#25110;&#20013;&#22830;&#32452;&#32455;&#65288;&#22914;&#25919;&#24220;&#25110;&#24066;&#25919;&#26426;&#26500;&#65289;&#36827;&#34892;&#65292;&#20182;&#20204;&#25910;&#38598;&#20010;&#20154;&#25424;&#27454;&#24182;&#23558;&#23427;&#20204;&#20998;&#37197;&#32473;&#19968;&#32452;&#24904;&#21892;&#26426;&#26500;&#12290;&#19968;&#26041;&#38754;&#65292;&#20010;&#20154;&#24904;&#21892;&#23562;&#37325;&#25424;&#36192;&#32773;&#30340;&#24847;&#24895;&#65292;&#20294;&#30001;&#20110;&#32570;&#20047;&#21327;&#35843;&#32780;&#21487;&#33021;&#25928;&#29575;&#20302;&#19979;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#38598;&#20013;&#24904;&#21892;&#21487;&#33021;&#26356;&#26377;&#25928;&#65292;&#20294;&#21487;&#33021;&#24573;&#30053;&#20010;&#20154;&#25424;&#36192;&#32773;&#30340;&#24847;&#24895;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#21046;&#65292;&#23427;&#32467;&#21512;&#20102;&#20004;&#31181;&#26041;&#27861;&#30340;&#20248;&#28857;&#65292;&#36890;&#36807;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#20998;&#37197;&#27599;&#20010;&#25424;&#36192;&#32773;&#30340;&#36129;&#29486;&#65292;&#27809;&#26377;&#20219;&#20309;&#25424;&#21161;&#20154;&#26377;&#21160;&#26426;&#37325;&#26032;&#20998;&#37197;&#20182;&#20204;&#30340;&#25424;&#27454;&#12290;&#22312;&#20551;&#35774;Leontief&#25928;&#29992;&#20989;&#25968;&#65288;&#21363;&#27599;&#20010;&#25424;&#36192;&#32773;&#22343;&#24076;&#26395;&#26368;&#22823;&#21270;&#25152;&#26377;&#24904;&#21892;&#26426;&#26500;&#30340;&#26368;&#23567;&#36129;&#29486;&#30340;&#20010;&#20154;&#21152;&#26435;&#20043;&#21644;&#65289;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#26426;&#21046;&#26159;&#32452;&#31574;&#30053;&#27491;&#30830;&#12289;&#20559;&#22909;&#21333;&#35843;&#12289;&#36129;&#29486;&#21333;&#35843;&#12289;&#26368;&#22823;&#21270;&#32435;&#20160;&#31119;&#21033;&#24182;&#21487;&#20197;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;
Charity is typically done either by individual donors, who donate money to the charities that they support, or by centralized organizations such as governments or municipalities, which collect the individual contributions and distribute them among a set of charities. On the one hand, individual charity respects the will of the donors but may be inefficient due to a lack of coordination. On the other hand, centralized charity is potentially more efficient but may ignore the will of individual donors. We present a mechanism that combines the advantages of both methods by distributing the contribution of each donor in an efficient way such that no subset of donors has an incentive to redistribute their donations. Assuming Leontief utilities (i.e., each donor is interested in maximizing an individually weighted minimum of all contributions across the charities), our mechanism is group-strategyproof, preference-monotonic, contribution-monotonic, maximizes Nash welfare, and can be computed u
&lt;/p&gt;</description></item></channel></rss>