<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>HUMAP&#26159;&#19968;&#31181;&#26032;&#30340;&#23618;&#27425;&#38477;&#32500;&#25216;&#26415;&#65292;&#33021;&#22815;&#22312;&#23618;&#27425;&#25506;&#32034;&#20013;&#20445;&#30041;&#24515;&#29702;&#22320;&#22270;&#24182;&#22312;&#22810;&#20010;&#25968;&#25454;&#38598;&#21644;&#25968;&#25454;&#31867;&#22411;&#19978;&#20855;&#26377;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2106.07718</link><description>&lt;p&gt;
HUMAP&#65306;&#23618;&#27425;&#32479;&#19968;&#27969;&#24418;&#36924;&#36817;&#19982;&#25237;&#24433;
&lt;/p&gt;
&lt;p&gt;
HUMAP: Hierarchical Uniform Manifold Approximation and Projection. (arXiv:2106.07718v3 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.07718
&lt;/p&gt;
&lt;p&gt;
HUMAP&#26159;&#19968;&#31181;&#26032;&#30340;&#23618;&#27425;&#38477;&#32500;&#25216;&#26415;&#65292;&#33021;&#22815;&#22312;&#23618;&#27425;&#25506;&#32034;&#20013;&#20445;&#30041;&#24515;&#29702;&#22320;&#22270;&#24182;&#22312;&#22810;&#20010;&#25968;&#25454;&#38598;&#21644;&#25968;&#25454;&#31867;&#22411;&#19978;&#20855;&#26377;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#38477;&#32500;&#25216;&#26415;&#26377;&#21161;&#20110;&#20998;&#26512;&#20154;&#21592;&#29702;&#35299;&#39640;&#32500;&#31354;&#38388;&#20013;&#30340;&#27169;&#24335;&#12290;&#36825;&#20123;&#25216;&#26415;&#36890;&#24120;&#20197;&#25955;&#28857;&#22270;&#24418;&#24335;&#21576;&#29616;&#65292;&#24212;&#29992;&#20110;&#21508;&#31181;&#31185;&#23398;&#39046;&#22495;&#65292;&#24182;&#20419;&#36827;&#38598;&#32676;&#21644;&#25968;&#25454;&#26679;&#26412;&#20043;&#38388;&#30340;&#30456;&#20284;&#24615;&#20998;&#26512;&#12290;&#38024;&#23545;&#21253;&#21547;&#35768;&#22810;&#31890;&#24230;&#25110;&#36981;&#24490;&#20449;&#24687;&#21487;&#35270;&#21270;&#20934;&#21017;&#30340;&#25968;&#25454;&#38598;&#30340;&#20998;&#26512;&#65292;&#23618;&#27425;&#38477;&#32500;&#25216;&#26415;&#26159;&#26368;&#36866;&#21512;&#30340;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#20204;&#20808;&#21069;&#21576;&#29616;&#20102;&#20027;&#35201;&#32467;&#26500;&#24182;&#21487;&#20197;&#25353;&#38656;&#25552;&#20379;&#35814;&#32454;&#20449;&#24687;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#23618;&#27425;&#38477;&#32500;&#25216;&#26415;&#24182;&#19981;&#33021;&#23436;&#20840;&#35299;&#20915;&#25991;&#29486;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#22240;&#20026;&#23427;&#20204;&#19981;&#33021;&#22312;&#23618;&#27425;&#32423;&#21035;&#20043;&#38388;&#20445;&#25345;&#25237;&#24433;&#24515;&#29702;&#22320;&#22270;&#65292;&#20063;&#19981;&#36866;&#29992;&#20110;&#22823;&#22810;&#25968;&#25968;&#25454;&#31867;&#22411;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#23618;&#27425;&#38477;&#32500;&#25216;&#26415;HUMAP&#65292;&#26088;&#22312;&#28789;&#27963;&#22320;&#20445;&#30041;&#26412;&#22320;&#21644;&#20840;&#23616;&#32467;&#26500;&#20197;&#21450;&#24515;&#29702;&#22320;&#22270;&#65292;&#22312;&#23618;&#27425;&#25506;&#32034;&#20013;&#20855;&#26377;&#20248;&#36234;&#24615;&#65292;&#24182;&#22312;&#22810;&#20010;&#25968;&#25454;&#38598;&#21644;&#25968;&#25454;&#31867;&#22411;&#19978;&#25552;&#20379;&#20102;&#23454;&#35777;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dimensionality reduction (DR) techniques help analysts understand patterns in high-dimensional spaces. These techniques, often represented by scatter plots, are employed in diverse science domains and facilitate similarity analysis among clusters and data samples. For datasets containing many granularities or when analysis follows the information visualization mantra, hierarchical DR techniques are the most suitable approach since they present major structures beforehand and details on demand. However, current hierarchical DR techniques are not fully capable of addressing literature problems because they do not preserve the projection mental map across hierarchical levels or are not suitable for most data types. This work presents HUMAP, a novel hierarchical dimensionality reduction technique designed to be flexible in preserving local and global structures and the mental map throughout hierarchical exploration. We provide empirical evidence of our technique's superiority compared with
&lt;/p&gt;</description></item></channel></rss>