<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#23884;&#20837;3D&#24418;&#29366;&#30340;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#36890;&#36807;&#22810;&#23610;&#24230;&#28151;&#21512;&#31995;&#32479;&#21644;&#36830;&#32493;&#21487;&#24494;&#30340;&#35299;&#30721;&#22120;&#65292;&#19981;&#20165;&#33021;&#22815;&#29983;&#25104;&#26377;&#25928;&#30340;&#26377;&#31526;&#21495;&#36317;&#31163;&#22330;&#65292;&#36824;&#33021;&#22815;&#22312;&#35757;&#32451;&#21644;&#25512;&#26029;&#20013;&#20165;&#20351;&#29992;&#38646;&#27700;&#24179;&#38598;&#30340;&#30693;&#35782;&#12290;&#21516;&#26102;&#65292;&#36824;&#25552;&#20986;&#20102;&#38024;&#23545;&#26354;&#38754;&#27861;&#32447;&#19981;&#23384;&#22312;&#24773;&#20917;&#30340;&#25439;&#22833;&#20989;&#25968;&#20462;&#25913;&#12290;</title><link>https://arxiv.org/abs/2310.06644</link><description>&lt;p&gt;
&#31070;&#32463;&#36317;&#31163;&#22330;&#30340;&#38646;&#27700;&#24179;&#38598;&#32534;&#30721;&#22120;
&lt;/p&gt;
&lt;p&gt;
Zero-Level-Set Encoder for Neural Distance Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2310.06644
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#23884;&#20837;3D&#24418;&#29366;&#30340;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#36890;&#36807;&#22810;&#23610;&#24230;&#28151;&#21512;&#31995;&#32479;&#21644;&#36830;&#32493;&#21487;&#24494;&#30340;&#35299;&#30721;&#22120;&#65292;&#19981;&#20165;&#33021;&#22815;&#29983;&#25104;&#26377;&#25928;&#30340;&#26377;&#31526;&#21495;&#36317;&#31163;&#22330;&#65292;&#36824;&#33021;&#22815;&#22312;&#35757;&#32451;&#21644;&#25512;&#26029;&#20013;&#20165;&#20351;&#29992;&#38646;&#27700;&#24179;&#38598;&#30340;&#30693;&#35782;&#12290;&#21516;&#26102;&#65292;&#36824;&#25552;&#20986;&#20102;&#38024;&#23545;&#26354;&#38754;&#27861;&#32447;&#19981;&#23384;&#22312;&#24773;&#20917;&#30340;&#25439;&#22833;&#20989;&#25968;&#20462;&#25913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#24418;&#29366;&#34920;&#31034;&#36890;&#24120;&#25351;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#26469;&#34920;&#31034;3D&#20960;&#20309;&#65292;&#20363;&#22914;&#65292;&#22312;&#29305;&#23450;&#31354;&#38388;&#20301;&#32622;&#35745;&#31639;&#26377;&#31526;&#21495;&#36317;&#31163;&#25110;&#21344;&#25454;&#20540;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#31070;&#32463;&#32593;&#32476;&#65292;&#29992;&#20110;&#22312;&#21333;&#27425;&#21069;&#21521;&#20256;&#36882;&#20013;&#23884;&#20837;3D&#24418;&#29366;&#12290;&#25105;&#20204;&#30340;&#26550;&#26500;&#22522;&#20110;&#22810;&#23610;&#24230;&#28151;&#21512;&#31995;&#32479;&#65292;&#21253;&#25324;&#22522;&#20110;&#22270;&#24418;&#21644;&#22522;&#20110;&#20307;&#32032;&#30340;&#32452;&#20214;&#65292;&#20197;&#21450;&#36830;&#32493;&#21487;&#24494;&#30340;&#35299;&#30721;&#22120;&#12290;&#27492;&#22806;&#65292;&#35813;&#32593;&#32476;&#32463;&#36807;&#35757;&#32451;&#20197;&#35299;&#20915;Eikonal&#26041;&#31243;&#65292;&#20165;&#38656;&#35201;&#38646;&#27700;&#24179;&#38598;&#30340;&#30693;&#35782;&#36827;&#34892;&#35757;&#32451;&#21644;&#25512;&#26029;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#19982;&#22823;&#22810;&#25968;&#20043;&#21069;&#30340;&#24037;&#20316;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#32593;&#32476;&#33021;&#22815;&#36755;&#20986;&#26377;&#25928;&#30340;&#26377;&#31526;&#21495;&#36317;&#31163;&#22330;&#65292;&#32780;&#26080;&#38656;&#26126;&#30830;&#30340;&#38750;&#38646;&#36317;&#31163;&#20540;&#25110;&#24418;&#29366;&#21344;&#25454;&#30340;&#20808;&#39564;&#30693;&#35782;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#25439;&#22833;&#20989;&#25968;&#30340;&#20462;&#25913;&#65292;&#20197;&#35299;&#20915;&#26354;&#38754;&#27861;&#32447;&#19981;&#23384;&#22312;&#30340;&#24773;&#20917;&#65292;&#20363;&#22914;&#65292;&#38750;&#23553;&#38381;&#26354;&#38754;&#21644;&#38750;&#27969;&#24418;&#20960;&#20309;&#30340;&#19978;&#19979;&#25991;&#12290;&#24635;&#20307;&#19978;&#65292;&#36825;&#21487;&#20197;&#24110;&#21161;&#20943;&#23569;&#24517;&#35201;&#30340;&#20808;&#39564;&#30693;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;
Neural shape representation generally refers to representing 3D geometry using neural networks, e.g., to compute a signed distance or occupancy value at a specific spatial position. In this paper, we present a novel encoder-decoder neural network for embedding 3D shapes in a single forward pass. Our architecture is based on a multi-scale hybrid system incorporating graph-based and voxel-based components, as well as a continuously differentiable decoder. Furthermore, the network is trained to solve the Eikonal equation and only requires knowledge of the zero-level set for training and inference. This means that in contrast to most previous work, our network is able to output valid signed distance fields without explicit prior knowledge of non-zero distance values or shape occupancy. We further propose a modification of the loss function in case that surface normals are not well defined, e.g., in the context of non-watertight surfaces and non-manifold geometry. Overall, this can help red
&lt;/p&gt;</description></item></channel></rss>