<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#36890;&#36807;&#22810;agent&#24433;&#21709;&#22270;&#26041;&#27861;&#20998;&#26512; Maker &#21327;&#35758;&#20013;&#30340;&#28216;&#25103;&#21160;&#24577;&#65292;&#24182;&#25552;&#20986;&#20102;&#20419;&#36827;&#21327;&#35843;&#21644;&#22686;&#24378;&#32463;&#27982;&#23433;&#20840;&#24615;&#30340;&#31574;&#30053;</title><link>https://arxiv.org/abs/2402.15037</link><description>&lt;p&gt;
&#22312; Maker &#21327;&#35758;&#20013;&#20998;&#26512;&#28216;&#25103;&#30340;&#31532;&#19968;&#37096;&#20998;&#65306;&#19968;&#31181;&#38754;&#21521;&#21327;&#35843;&#30340;&#22810;agent&#24433;&#21709;&#22270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Analyzing Games in Maker Protocol Part One: A Multi-Agent Influence Diagram Approach Towards Coordination
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15037
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22810;agent&#24433;&#21709;&#22270;&#26041;&#27861;&#20998;&#26512; Maker &#21327;&#35758;&#20013;&#30340;&#28216;&#25103;&#21160;&#24577;&#65292;&#24182;&#25552;&#20986;&#20102;&#20419;&#36827;&#21327;&#35843;&#21644;&#22686;&#24378;&#32463;&#27982;&#23433;&#20840;&#24615;&#30340;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#65288;DeFi&#65289;&#29983;&#24577;&#31995;&#32479;&#65292;&#20197; Maker &#21327;&#35758;&#20026;&#20363;&#65292;&#20381;&#36182;&#20110;&#22797;&#26434;&#30340;&#28216;&#25103;&#26469;&#32500;&#25345;&#31283;&#23450;&#24615;&#21644;&#23433;&#20840;&#24615;&#12290;&#20102;&#35299;&#36825;&#20123;&#28216;&#25103;&#30340;&#21160;&#24577;&#23545;&#20110;&#30830;&#20445;&#31995;&#32479;&#30340;&#31283;&#20581;&#24615;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;agent&#24433;&#21709;&#22270;&#65288;MAID&#65289;&#65292;&#36825;&#26159;&#30001; Koller &#21644; Milch &#26368;&#21021;&#25552;&#20986;&#30340;&#65292;&#20197;&#35299;&#21078;&#21644;&#20998;&#26512; Maker &#31283;&#23450;&#24065;&#21327;&#35758;&#20013;&#30340;&#28216;&#25103;&#12290;&#36890;&#36807;&#23558; Maker &#21327;&#35758;&#30340;&#29992;&#25143;&#21644;&#27835;&#29702;&#34920;&#31034;&#20026;&#20195;&#29702;&#20154;&#65292;&#23558;&#23427;&#20204;&#30340;&#20114;&#21160;&#34920;&#31034;&#20026;&#22270;&#20013;&#30340;&#36793;&#65292;&#25105;&#20204;&#25429;&#25417;&#21040;&#25351;&#23548;&#20195;&#29702;&#20154;&#34892;&#20026;&#30340;&#22797;&#26434;&#24433;&#21709;&#32593;&#32476;&#12290;&#27492;&#22806;&#65292;&#22312;&#25509;&#19979;&#26469;&#30340;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#23637;&#31034;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#27169;&#22411;&#65292;&#20197;&#38416;&#26126;&#20419;&#36827;&#21327;&#35843;&#21644;&#22686;&#24378;&#29983;&#24577;&#31995;&#32479;&#20869;&#32463;&#27982;&#23433;&#20840;&#24615;&#30340;&#31574;&#30053;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#26088;&#22312;&#25512;&#21160;&#21033;&#29992;&#36825;&#31181;&#26041;&#27861;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#24418;&#24335;&#39564;&#35777;&#26041;&#27861;&#65292;&#39564;&#35777;&#21338;&#24328;&#35770;&#23433;&#20840;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15037v1 Announce Type: cross  Abstract: Decentralized Finance (DeFi) ecosystems, exemplified by the Maker Protocol, rely on intricate games to maintain stability and security. Understanding the dynamics of these games is crucial for ensuring the robustness of the system. This motivating research proposes a novel methodology leveraging Multi-Agent Influence Diagrams (MAID), originally proposed by Koller and Milch, to dissect and analyze the games within the Maker stablecoin protocol. By representing users and governance of the Maker protocol as agents and their interactions as edges in a graph, we capture the complex network of influences governing agent behaviors. Furthermore in the upcoming papers, we will show a Nash Equilibrium model to elucidate strategies that promote coordination and enhance economic security within the ecosystem. Through this approach, we aim to motivate the use of this method to introduce a new method of formal verification of game theoretic security
&lt;/p&gt;</description></item></channel></rss>