<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#22823;&#37327;&#21160;&#20316;&#30340;&#37325;&#22797;&#28216;&#25103;&#20013;&#23454;&#29616;&#36951;&#25022;&#26368;&#23567;&#21270;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;Oracle&#30340;&#31639;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#20869;&#37096;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#22823;&#22411;&#28216;&#25103;&#20013;&#35745;&#31639;&#30456;&#20851;&#22343;&#34913;&#30340;&#39640;&#25928;&#24615;&#12290;&#36890;&#36807;&#22312;AI&#23433;&#20840;&#36777;&#35770;&#29615;&#22659;&#20013;&#30340;&#23454;&#39564;&#39564;&#35777;&#20102;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2312.04792</link><description>&lt;p&gt;
&#20351;&#29992;Oracle&#21644;AI&#36777;&#35770;&#36827;&#34892;&#22823;&#22411;&#28216;&#25103;&#30340;&#29609;&#27861;
&lt;/p&gt;
&lt;p&gt;
Playing Large Games with Oracles and AI Debate
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.04792
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#22823;&#37327;&#21160;&#20316;&#30340;&#37325;&#22797;&#28216;&#25103;&#20013;&#23454;&#29616;&#36951;&#25022;&#26368;&#23567;&#21270;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;Oracle&#30340;&#31639;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#20869;&#37096;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#22823;&#22411;&#28216;&#25103;&#20013;&#35745;&#31639;&#30456;&#20851;&#22343;&#34913;&#30340;&#39640;&#25928;&#24615;&#12290;&#36890;&#36807;&#22312;AI&#23433;&#20840;&#36777;&#35770;&#29615;&#22659;&#20013;&#30340;&#23454;&#39564;&#39564;&#35777;&#20102;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;&#20855;&#26377;&#22823;&#37327;&#21160;&#20316;&#30340;&#37325;&#22797;&#28216;&#25103;&#20013;&#23454;&#29616;&#36951;&#25022;&#26368;&#23567;&#21270;&#12290;&#36825;&#31181;&#28216;&#25103;&#22312;&#36890;&#36807;&#36777;&#35770;&#30830;&#20445;AI&#23433;&#20840;&#30340;&#29615;&#22659;&#20013;&#26159;&#22266;&#26377;&#30340;&#65292;&#24182;&#19988;&#26356;&#19968;&#33324;&#22320;&#24212;&#29992;&#20110;&#21160;&#20316;&#22522;&#20110;&#35821;&#35328;&#30340;&#28216;&#25103;&#20013;&#12290;&#29616;&#26377;&#30340;&#22312;&#32447;&#28216;&#25103;&#31639;&#27861;&#38656;&#35201;&#22810;&#39033;&#24335;&#35745;&#31639;&#25968;&#37327;&#30340;&#21160;&#20316;&#65292;&#32780;&#23545;&#20110;&#22823;&#22411;&#28216;&#25103;&#26469;&#35828;&#65292;&#36825;&#21487;&#33021;&#26159;&#38590;&#20197;&#23454;&#29616;&#30340;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#32771;&#34385;&#20351;&#29992;&#22522;&#20110;Oracle&#30340;&#31639;&#27861;&#65292;&#22240;&#20026;Oracle&#33258;&#28982;&#22320;&#27169;&#25311;&#20102;&#23545;AI&#20195;&#29702;&#30340;&#35775;&#38382;&#12290;&#36890;&#36807;&#23545;Oracle&#35775;&#38382;&#36827;&#34892;&#29305;&#24449;&#21270;&#65292;&#25105;&#20204;&#21487;&#20197;&#26377;&#25928;&#22320;&#23454;&#29616;&#20869;&#37096;&#21644;&#22806;&#37096;&#36951;&#25022;&#30340;&#26368;&#23567;&#21270;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20869;&#37096;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#65292;&#20854;&#36951;&#25022;&#21644;&#35745;&#31639;&#22797;&#26434;&#24230;&#23545;&#25968;&#22320;&#20381;&#36182;&#20110;&#21160;&#20316;&#25968;&#37327;&#12290;&#36825;&#24847;&#21619;&#30528;&#21487;&#20197;&#39640;&#25928;&#22320;&#22522;&#20110;Oracle&#35745;&#31639;&#22823;&#22411;&#28216;&#25103;&#20013;&#30340;&#30456;&#20851;&#22343;&#34913;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#22312;AI&#23433;&#20840;&#36777;&#35770;&#29615;&#22659;&#20013;&#36827;&#34892;&#23454;&#39564;&#65292;&#23637;&#31034;&#20102;&#25105;&#20204;&#31639;&#27861;&#20998;&#26512;&#30340;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider regret minimization in repeated games with a very large number of actions. Such games are inherent in the setting of AI safety via debate, and more generally games whose actions are language-based. Existing algorithms for online game playing require computation polynomial in the number of actions, which can be prohibitive for large games.   We thus consider oracle-based algorithms, as oracles naturally model access to AI agents. With oracle access, we characterize when internal and external regret can be minimized efficiently. We give a novel efficient algorithm for internal regret minimization whose regret and computation complexity depend logarithmically on the number of actions. This implies efficient oracle-based computation of a correlated equilibrium in large games.   We conclude with experiments in the setting of AI Safety via Debate that shows the benefit of insights from our algorithmic analysis.
&lt;/p&gt;</description></item></channel></rss>