<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#23398;&#20064;&#22914;&#20309;&#35774;&#35745;&#26368;&#20248;&#31246;&#25910;&#65292;&#20197;&#22312;&#38750;&#21407;&#23376;&#25317;&#22581;&#21338;&#24328;&#20013;&#25552;&#39640;&#25928;&#29575;&#12290;&#20026;&#20102;&#35299;&#20915;&#25351;&#25968;&#32423;&#30340;&#31246;&#25910;&#20989;&#25968;&#31354;&#38388;&#12289;&#26799;&#24230;&#19981;&#23384;&#22312;&#21644;&#30446;&#26631;&#20989;&#25968;&#30340;&#38750;&#20984;&#24615;&#31561;&#25361;&#25112;&#65292;&#35813;&#31639;&#27861;&#21033;&#29992;&#20102;&#20998;&#27573;&#32447;&#24615;&#31246;&#25910;&#12289;&#39069;&#22806;&#30340;&#32447;&#24615;&#39033;&#21644;&#26377;&#25928;&#30340;&#23376;&#20363;&#31243;&#30340;&#26032;&#39062;&#32452;&#25104;&#37096;&#20998;&#12290;</title><link>https://arxiv.org/abs/2402.07437</link><description>&lt;p&gt;
&#38750;&#21407;&#23376;&#25317;&#22581;&#21338;&#24328;&#20013;&#23398;&#20064;&#26368;&#20248;&#31246;&#25910;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Learning Optimal Tax Design in Nonatomic Congestion Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#23398;&#20064;&#22914;&#20309;&#35774;&#35745;&#26368;&#20248;&#31246;&#25910;&#65292;&#20197;&#22312;&#38750;&#21407;&#23376;&#25317;&#22581;&#21338;&#24328;&#20013;&#25552;&#39640;&#25928;&#29575;&#12290;&#20026;&#20102;&#35299;&#20915;&#25351;&#25968;&#32423;&#30340;&#31246;&#25910;&#20989;&#25968;&#31354;&#38388;&#12289;&#26799;&#24230;&#19981;&#23384;&#22312;&#21644;&#30446;&#26631;&#20989;&#25968;&#30340;&#38750;&#20984;&#24615;&#31561;&#25361;&#25112;&#65292;&#35813;&#31639;&#27861;&#21033;&#29992;&#20102;&#20998;&#27573;&#32447;&#24615;&#31246;&#25910;&#12289;&#39069;&#22806;&#30340;&#32447;&#24615;&#39033;&#21644;&#26377;&#25928;&#30340;&#23376;&#20363;&#31243;&#30340;&#26032;&#39062;&#32452;&#25104;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22914;&#20309;&#23398;&#20064;&#26368;&#20248;&#31246;&#25910;&#35774;&#35745;&#65292;&#20197;&#22312;&#38750;&#21407;&#23376;&#25317;&#22581;&#21338;&#24328;&#20013;&#26368;&#22823;&#21270;&#25928;&#29575;&#12290;&#20247;&#25152;&#21608;&#30693;&#65292;&#29609;&#23478;&#20043;&#38388;&#30340;&#33258;&#21033;&#34892;&#20026;&#21487;&#33021;&#20250;&#30772;&#22351;&#31995;&#32479;&#30340;&#25928;&#29575;&#12290;&#31246;&#21153;&#26426;&#21046;&#26159;&#32531;&#35299;&#27492;&#38382;&#39064;&#24182;&#24341;&#23548;&#31038;&#20250;&#26368;&#20248;&#34892;&#20026;&#30340;&#24120;&#35265;&#26041;&#27861;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#39318;&#27425;&#37319;&#21462;&#20102;&#23398;&#20064;&#26368;&#20248;&#31246;&#25910;&#30340;&#21021;&#22987;&#27493;&#39588;&#65292;&#35813;&#26368;&#20248;&#31246;&#25910;&#21487;&#20197;&#36890;&#36807;&#24179;&#34913;&#21453;&#39304;&#26469;&#26368;&#23567;&#21270;&#31038;&#20250;&#25104;&#26412;&#65292;&#21363;&#31246;&#21153;&#35774;&#35745;&#32773;&#21482;&#33021;&#35266;&#23519;&#21040;&#24378;&#21046;&#31246;&#25910;&#19979;&#30340;&#22343;&#34913;&#29366;&#24577;&#12290;&#30001;&#20110;&#25351;&#25968;&#32423;&#30340;&#31246;&#25910;&#20989;&#25968;&#31354;&#38388;&#65292;&#26799;&#24230;&#19981;&#23384;&#22312;&#21644;&#30446;&#26631;&#20989;&#25968;&#30340;&#38750;&#20984;&#24615;&#65292;&#29616;&#26377;&#31639;&#27861;&#19981;&#36866;&#29992;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#21033;&#29992;&#20102;&#20960;&#20010;&#26032;&#39062;&#30340;&#32452;&#25104;&#37096;&#20998;&#65306;&#65288;1&#65289;&#20998;&#27573;&#32447;&#24615;&#31246;&#25910;&#26469;&#36817;&#20284;&#26368;&#20248;&#31246;&#25910;&#65307;&#65288;2&#65289;&#39069;&#22806;&#30340;&#32447;&#24615;&#39033;&#26469;&#20445;&#35777;&#24378;&#20984;&#28508;&#21147;&#20989;&#25968;&#65307;&#65288;3&#65289;&#26377;&#25928;&#30340;&#23376;&#20363;&#31243;&#26469;&#25214;&#21040;&#8220;&#36793;&#30028;&#8221;&#31246;&#25910;&#12290;&#35813;&#31639;&#27861;&#21487;&#20197;&#25214;&#21040;&#19968;&#20010;$\epsilon$-&#26368;&#20248;&#31246;&#25910;&#65292;&#26102;&#38388;&#22797;&#26434;&#24230;&#20026;$O(\bet
&lt;/p&gt;
&lt;p&gt;
We study how to learn the optimal tax design to maximize the efficiency in nonatomic congestion games. It is known that self-interested behavior among the players can damage the system's efficiency. Tax mechanisms is a common method to alleviate this issue and induce socially optimal behavior. In this work, we take the initial step for learning the optimal tax that can minimize the social cost with \emph{equilibrium feedback}, i.e., the tax designer can only observe the equilibrium state under the enforced tax. Existing algorithms are not applicable due to the exponentially large tax function space, nonexistence of the gradient, and nonconvexity of the objective. To tackle these challenges, our algorithm leverages several novel components: (1) piece-wise linear tax to approximate the optimal tax; (2) an extra linear term to guarantee a strongly convex potential function; (3) efficient subroutine to find the ``boundary'' tax. The algorithm can find an $\epsilon$-optimal tax with $O(\bet
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#27010;&#29575;&#39564;&#35777;&#27169;&#22411;&#65292;&#36890;&#36807;&#36873;&#25321;&#32479;&#35745;&#27979;&#35797;&#26469;&#39564;&#35777;&#20195;&#29702;&#20154;&#30340;&#22768;&#26126;&#65292;&#24182;&#21028;&#26029;&#26159;&#21542;&#26377;&#26368;&#20339;&#27979;&#35797;&#31579;&#36873;&#25152;&#26377;&#20854;&#20182;&#31867;&#22411;&#12290;&#36825;&#20010;&#26041;&#27861;&#33021;&#22815;&#21033;&#28070;&#26368;&#22823;&#21270;&#24182;&#19981;&#26029;&#25554;&#20540;&#35299;&#20915;&#39564;&#35777;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/1908.05556</link><description>&lt;p&gt;
&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#27010;&#29575;&#39564;&#35777;
&lt;/p&gt;
&lt;p&gt;
Probabilistic Verification in Mechanism Design. (arXiv:1908.05556v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1908.05556
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#27010;&#29575;&#39564;&#35777;&#27169;&#22411;&#65292;&#36890;&#36807;&#36873;&#25321;&#32479;&#35745;&#27979;&#35797;&#26469;&#39564;&#35777;&#20195;&#29702;&#20154;&#30340;&#22768;&#26126;&#65292;&#24182;&#21028;&#26029;&#26159;&#21542;&#26377;&#26368;&#20339;&#27979;&#35797;&#31579;&#36873;&#25152;&#26377;&#20854;&#20182;&#31867;&#22411;&#12290;&#36825;&#20010;&#26041;&#27861;&#33021;&#22815;&#21033;&#28070;&#26368;&#22823;&#21270;&#24182;&#19981;&#26029;&#25554;&#20540;&#35299;&#20915;&#39564;&#35777;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#26426;&#21046;&#35774;&#35745;&#32972;&#26223;&#19979;&#24341;&#20837;&#20102;&#19968;&#20010;&#27010;&#29575;&#39564;&#35777;&#27169;&#22411;&#12290;&#22996;&#25176;&#20154;&#36873;&#25321;&#19968;&#20010;&#32479;&#35745;&#27979;&#35797;&#26469;&#39564;&#35777;&#20195;&#29702;&#20154;&#30340;&#22768;&#26126;&#12290;&#20195;&#29702;&#20154;&#30340;&#30495;&#23454;&#31867;&#22411;&#20915;&#23450;&#20102;&#20182;&#21487;&#20197;&#36890;&#36807;&#27599;&#20010;&#27979;&#35797;&#30340;&#27010;&#29575;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#27599;&#20010;&#31867;&#22411;&#26159;&#21542;&#26377;&#19968;&#20010;&#30456;&#20851;&#30340;&#27979;&#35797;&#65292;&#26368;&#22909;&#22320;&#31579;&#36873;&#20986;&#25152;&#26377;&#20854;&#20182;&#31867;&#22411;&#65292;&#26080;&#35770;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#22914;&#20309;&#12290;&#22914;&#26524;&#36825;&#20010;&#26465;&#20214;&#25104;&#31435;&#65292;&#37027;&#20040;&#27979;&#35797;&#25216;&#26415;&#21487;&#20197;&#29992;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#31616;&#21270;&#24418;&#24335;&#34920;&#31034;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#20010;&#31616;&#21270;&#24418;&#24335;&#26469;&#35299;&#20915;&#39564;&#35777;&#30340;&#21033;&#28070;&#26368;&#22823;&#21270;&#26426;&#21046;&#12290;&#38543;&#30528;&#39564;&#35777;&#30340;&#25913;&#36827;&#65292;&#35299;&#20915;&#26041;&#26696;&#20174;&#26080;&#39564;&#35777;&#35299;&#20915;&#26041;&#26696;&#21040;&#23436;&#20840;&#21097;&#20313;&#25552;&#21462;&#19981;&#26029;&#25554;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a model of probabilistic verification in a mechanism design setting. The principal selects a statistical test to verify the agent's claim. The agent's true type determines the probability with which he can pass each test. We characterize whether each type has an associated test that best screens out all other types, no matter the social choice rule. If this condition holds, then the testing technology can be represented in a tractable reduced form. We use this reduced form to solve for profit-maximizing mechanisms with verification. As verification improves, the solution continuously interpolates from the no-verification solution to full surplus extraction.
&lt;/p&gt;</description></item></channel></rss>