<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#22312;&#22996;&#25176;&#28216;&#25103;&#20013;&#25506;&#35752;&#20102;&#25511;&#21046;&#38382;&#39064;&#65288;&#20195;&#29702;&#20154;&#26410;&#33021;&#25353;&#29031;&#20854;&#22996;&#25176;&#20154;&#30340;&#20559;&#22909;&#34892;&#20107;&#65289;&#21644;&#21512;&#20316;&#38382;&#39064;&#65288;&#20195;&#29702;&#20154;&#26410;&#33021;&#33391;&#22909;&#22320;&#21327;&#20316;&#65289;&#65292;&#24182;&#20998;&#26512;&#20102;&#23545;&#40784;&#21644;&#33021;&#21147;&#23545;&#22996;&#25176;&#20154;&#31119;&#21033;&#30340;&#24433;&#21709;&#12290;en_tdlr: This paper explores the issues of control (agents failing to act in line with their principals' preferences) and cooperation (agents failing to work well together) in delegation games, analyzing how alignment and capabilities impact principals' welfare.</title><link>https://arxiv.org/abs/2402.15821</link><description>&lt;p&gt;
&#22996;&#25176;&#28216;&#25103;&#20013;&#30340;&#21512;&#20316;&#19982;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Cooperation and Control in Delegation Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15821
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#22996;&#25176;&#28216;&#25103;&#20013;&#25506;&#35752;&#20102;&#25511;&#21046;&#38382;&#39064;&#65288;&#20195;&#29702;&#20154;&#26410;&#33021;&#25353;&#29031;&#20854;&#22996;&#25176;&#20154;&#30340;&#20559;&#22909;&#34892;&#20107;&#65289;&#21644;&#21512;&#20316;&#38382;&#39064;&#65288;&#20195;&#29702;&#20154;&#26410;&#33021;&#33391;&#22909;&#22320;&#21327;&#20316;&#65289;&#65292;&#24182;&#20998;&#26512;&#20102;&#23545;&#40784;&#21644;&#33021;&#21147;&#23545;&#22996;&#25176;&#20154;&#31119;&#21033;&#30340;&#24433;&#21709;&#12290;en_tdlr: This paper explores the issues of control (agents failing to act in line with their principals' preferences) and cooperation (agents failing to work well together) in delegation games, analyzing how alignment and capabilities impact principals' welfare.
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#28041;&#21450;&#20154;&#31867;&#21644;&#26426;&#22120;&#30340;&#24863;&#20852;&#36259;&#30340;&#22330;&#26223; - &#20174;&#34394;&#25311;&#20010;&#20154;&#21161;&#29702;&#21040;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742; - &#21487;&#20197;&#33258;&#28982;&#22320;&#24314;&#27169;&#20026;&#22996;&#25176;&#20154;&#65288;&#20154;&#31867;&#65289;&#22996;&#25176;&#32473;&#20195;&#29702;&#20154;&#65288;&#26426;&#22120;&#65289;&#65292;&#36825;&#20123;&#20195;&#29702;&#20154;&#20043;&#21518;&#20195;&#34920;&#20182;&#20204;&#30340;&#22996;&#25176;&#20154;&#30456;&#20114;&#20132;&#20114;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#22810;&#22996;&#25176;&#20154;&#65292;&#22810;&#20195;&#29702;&#20154;&#30340;&#24773;&#20917;&#31216;&#20026;&#22996;&#25176;&#28216;&#25103;&#12290;&#22312;&#36825;&#31867;&#28216;&#25103;&#20013;&#65292;&#23384;&#22312;&#20004;&#31181;&#37325;&#35201;&#30340;&#22833;&#36133;&#27169;&#24335;&#65306;&#25511;&#21046;&#38382;&#39064;&#65288;&#20195;&#29702;&#20154;&#26410;&#33021;&#25353;&#29031;&#20854;&#22996;&#25176;&#20154;&#30340;&#20559;&#22909;&#34892;&#20107;&#65289;&#21644;&#21512;&#20316;&#38382;&#39064;&#65288;&#20195;&#29702;&#20154;&#26410;&#33021;&#33391;&#22909;&#22320;&#21327;&#20316;&#65289;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24418;&#24335;&#21270;&#21644;&#20998;&#26512;&#36825;&#20123;&#38382;&#39064;&#65292;&#36827;&#19968;&#27493;&#23558;&#20854;&#35299;&#37322;&#20026;&#23545;&#40784;&#65288;&#21442;&#19982;&#32773;&#26159;&#21542;&#20855;&#26377;&#30456;&#20284;&#30340;&#20559;&#22909;&#65311;&#65289;&#21644;&#33021;&#21147;&#65288;&#21442;&#19982;&#32773;&#22312;&#28385;&#36275;&#36825;&#20123;&#20559;&#22909;&#26041;&#38754;&#30340;&#33021;&#21147;&#22914;&#20309;&#65311;&#65289;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#29702;&#35770;&#19978;&#21644;&#32463;&#39564;&#19978;&#23637;&#31034;&#20102;&#36825;&#20123;&#25514;&#26045;&#22914;&#20309;&#30830;&#23450;&#22996;&#25176;&#20154;&#30340;&#31119;&#21033;&#65292;&#22914;&#20309;&#21487;&#20197;&#20351;&#29992;&#26377;&#38480;&#30340;&#35266;&#23519;&#26469;&#20272;&#35745;&#36825;&#20123;&#25514;&#26045;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15821v1 Announce Type: cross  Abstract: Many settings of interest involving humans and machines -- from virtual personal assistants to autonomous vehicles -- can naturally be modelled as principals (humans) delegating to agents (machines), which then interact with each other on their principals' behalf. We refer to these multi-principal, multi-agent scenarios as delegation games. In such games, there are two important failure modes: problems of control (where an agent fails to act in line their principal's preferences) and problems of cooperation (where the agents fail to work well together). In this paper we formalise and analyse these problems, further breaking them down into issues of alignment (do the players have similar preferences?) and capabilities (how competent are the players at satisfying those preferences?). We show -- theoretically and empirically -- how these measures determine the principals' welfare, how they can be estimated using limited observations, and 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;</title><link>https://arxiv.org/abs/2312.15326</link><description>&lt;p&gt;
&#20851;&#20110;&#36830;&#36890;&#19988;&#24378;&#27604;&#20363;&#20999;&#34507;&#31957;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Connected Strongly-Proportional Cake-Cutting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.15326
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#32452;&#20195;&#29702;&#20154;&#20013;&#22914;&#20309;&#20844;&#24179;&#22320;&#20998;&#37197;&#21487;&#21010;&#20998;&#30340;&#24322;&#36136;&#36164;&#28304;&#65292;&#20063;&#31216;&#20026;&#34507;&#31957;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#23384;&#22312;&#30528;&#19968;&#31181;&#20998;&#37197;&#26041;&#24335;&#65292;&#27599;&#20010;&#20195;&#29702;&#20154;&#37117;&#20250;&#25910;&#21040;&#19968;&#20010;&#20215;&#20540;&#20005;&#26684;&#36229;&#36807;&#20182;&#20204;&#27604;&#20363;&#20221;&#39069;&#30340;&#36830;&#32493;&#37096;&#20998;&#65292;&#20063;&#31216;&#20026;*&#24378;&#27604;&#20363;&#20998;&#37197;*&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#21487;&#20197;&#20351;&#29992;&#26368;&#22810;$n \cdot 2^{n-1}$&#20010;&#26597;&#35810;&#26469;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#12290;&#23545;&#20110;&#20855;&#26377;&#20005;&#26684;&#27491;&#20272;&#20540;&#30340;&#20195;&#29702;&#20154;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26356;&#31616;&#21333;&#30340;&#21051;&#30011;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#25152;&#38656;&#30340;&#26597;&#35810;&#25968;&#37327;&#26159;$\Theta(n^2)$&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#19988;&#24403;&#23384;&#22312;&#26102;&#65292;&#32473;&#20986;&#20102;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#65292;&#20351;&#29992;&#20102;&#31867;&#20284;&#25968;&#37327;&#30340;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.15326v2 Announce Type: replace-cross Abstract: We investigate the problem of fairly dividing a divisible heterogeneous resource, also known as a cake, among a set of agents. We characterize the existence of an allocation in which every agent receives a contiguous piece worth strictly more than their proportional share, also known as a *strongly-proportional allocation*. The characterization is supplemented with an algorithm that determines the existence of a connected strongly-proportional allocation using at most $n \cdot 2^{n-1}$ queries. We provide a simpler characterization for agents with strictly positive valuations, and show that the number of queries required to determine the existence of a connected strongly-proportional allocation is in $\Theta(n^2)$. Our proofs are constructive and yield a connected strongly-proportional allocation, when it exists, using a similar number of queries.
&lt;/p&gt;</description></item></channel></rss>