<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#24102;&#26377;&#20998;&#37197;&#39044;&#31639;&#30340;&#25300;&#27827;&#28216;&#25103;&#25968;&#23398;&#27169;&#22411;&#65292;&#27599;&#20010;&#29609;&#23478;&#20381;&#38752;&#33258;&#24049;&#30340;&#39044;&#31639;&#36827;&#34892;&#36172;&#27880;&#65292;&#22312;&#32473;&#23450;&#30340;&#36718;&#27425;&#20013;&#65292;&#26681;&#25454;&#30828;&#24065;&#32763;&#36716;&#30340;&#32467;&#26524;&#33719;&#24471;&#31227;&#21160;&#30340;&#26435;&#21033;&#65292;&#24403;&#35745;&#25968;&#22120;&#21040;&#36798;&#36793;&#30028;&#26102;&#65292;&#20854;&#20013;&#19968;&#20010;&#29609;&#23478;&#21521;&#21478;&#19968;&#20010;&#25903;&#20184;&#30001;&#36793;&#30028;&#23450;&#28857;&#30830;&#23450;&#30340;&#37329;&#39069;&#12290;</title><link>http://arxiv.org/abs/2206.08300</link><description>&lt;p&gt;
&#36172;&#27880;&#25511;&#21046;&#30340;&#25300;&#27827;&#28216;&#25103;&#19982;&#26377;&#20559;&#26080;&#38480;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stake-governed tug-of-war and the biased infinity Laplacian. (arXiv:2206.08300v2 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.08300
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#24102;&#26377;&#20998;&#37197;&#39044;&#31639;&#30340;&#25300;&#27827;&#28216;&#25103;&#25968;&#23398;&#27169;&#22411;&#65292;&#27599;&#20010;&#29609;&#23478;&#20381;&#38752;&#33258;&#24049;&#30340;&#39044;&#31639;&#36827;&#34892;&#36172;&#27880;&#65292;&#22312;&#32473;&#23450;&#30340;&#36718;&#27425;&#20013;&#65292;&#26681;&#25454;&#30828;&#24065;&#32763;&#36716;&#30340;&#32467;&#26524;&#33719;&#24471;&#31227;&#21160;&#30340;&#26435;&#21033;&#65292;&#24403;&#35745;&#25968;&#22120;&#21040;&#36798;&#36793;&#30028;&#26102;&#65292;&#20854;&#20013;&#19968;&#20010;&#29609;&#23478;&#21521;&#21478;&#19968;&#20010;&#25903;&#20184;&#30001;&#36793;&#30028;&#23450;&#28857;&#30830;&#23450;&#30340;&#37329;&#39069;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25300;&#27827;&#28216;&#25103;&#20013;&#65292;&#20004;&#20010;&#29609;&#23478;&#36890;&#36807;&#27839;&#22270;&#24418;&#30340;&#36793;&#31227;&#21160;&#35745;&#25968;&#22120;&#26469;&#31454;&#20105;&#65292;&#27599;&#20010;&#20154;&#26681;&#25454;&#21487;&#33021;&#23384;&#22312;&#20559;&#24046;&#30340;&#30828;&#24065;&#32763;&#36716;&#20915;&#23450;&#22312;&#32473;&#23450;&#36718;&#27425;&#20013;&#33719;&#24471;&#31227;&#21160;&#30340;&#26435;&#21033;&#12290;&#24403;&#35745;&#25968;&#22120;&#21040;&#36798;&#36793;&#30028;&#26102;&#65292;&#21363;&#22266;&#23450;&#30340;&#39030;&#28857;&#23376;&#38598;&#65292;&#28216;&#25103;&#32467;&#26463;&#65292;&#20854;&#20013;&#19968;&#20010;&#29609;&#23478;&#21521;&#21478;&#19968;&#20010;&#25903;&#20184;&#30001;&#36793;&#30028;&#23450;&#28857;&#30830;&#23450;&#30340;&#37329;&#39069;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31867;&#24102;&#26377;&#20998;&#37197;&#39044;&#31639;&#30340;&#25300;&#27827;&#28216;&#25103;&#30340;&#25968;&#23398;&#22788;&#29702;&#65306;&#27599;&#20010;&#29609;&#23478;&#26368;&#21021;&#33719;&#24471;&#19968;&#20010;&#22266;&#23450;&#30340;&#39044;&#31639;&#65292;&#22905;&#22312;&#25972;&#20010;&#28216;&#25103;&#20013;&#20381;&#38752;&#36825;&#20010;&#39044;&#31639;&#36827;&#34892;&#19979;&#19968;&#36718;&#30340;&#36172;&#27880;&#65292;&#22905;&#36194;&#24471;&#36718;&#27425;&#30340;&#27010;&#29575;&#26159;
&lt;/p&gt;
&lt;p&gt;
In tug-of-war, two players compete by moving a counter along edges of a graph, each winning the right to move at a given turn according to the flip of a possibly biased coin. The game ends when the counter reaches the boundary, a fixed subset of the vertices, at which point one player pays the other an amount determined by the boundary vertex. Economists and mathematicians have independently studied tug-of-war for many years, focussing respectively on resource-allocation forms of the game, in which players iteratively spend precious budgets in an effort to influence the bias of the coins that determine the turn victors; and on PDE arising in fine mesh limits of the constant-bias game in a Euclidean setting.  In this article, we offer a mathematical treatment of a class of tug-of-war games with allocated budgets: each player is initially given a fixed budget which she draws on throughout the game to offer a stake at the start of each turn, and her probability of winning the turn is the 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20844;&#24179;&#20998;&#37197;&#38382;&#39064;&#20013;&#65292;&#32771;&#34385;&#20102;&#29609;&#23478;&#23545;&#22242;&#38431;&#30340;&#20559;&#22909;&#65292;&#25552;&#20986;&#20102;&#20004;&#20391;&#31283;&#23450;&#12289;EF1&#21644;&#20132;&#25442;&#31283;&#23450;&#30340;&#20998;&#37197;&#26041;&#24335;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#23384;&#22312;&#24615;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;EF1&#21644;&#28608;&#21169;&#26080;&#23241;&#22930;&#30340;&#30456;&#23481;&#24615;&#12290;</title><link>http://arxiv.org/abs/2206.05879</link><description>&lt;p&gt;
&#20004;&#20391;&#20559;&#22909;&#30340;&#20844;&#24179;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Fair Division with Two-Sided Preferences. (arXiv:2206.05879v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.05879
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20844;&#24179;&#20998;&#37197;&#38382;&#39064;&#20013;&#65292;&#32771;&#34385;&#20102;&#29609;&#23478;&#23545;&#22242;&#38431;&#30340;&#20559;&#22909;&#65292;&#25552;&#20986;&#20102;&#20004;&#20391;&#31283;&#23450;&#12289;EF1&#21644;&#20132;&#25442;&#31283;&#23450;&#30340;&#20998;&#37197;&#26041;&#24335;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#23384;&#22312;&#24615;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;EF1&#21644;&#28608;&#21169;&#26080;&#23241;&#22930;&#30340;&#30456;&#23481;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#20844;&#24179;&#20998;&#37197;&#30340;&#35774;&#32622;&#65292;&#22312;&#36825;&#20010;&#35774;&#32622;&#20013;&#65292;&#19968;&#20123;&#29609;&#23478;&#38656;&#35201;&#22312;&#19968;&#32452;&#22242;&#38431;&#20043;&#38388;&#20844;&#24179;&#22320;&#20998;&#37197;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#19981;&#20165;&#22242;&#38431;&#20687;&#32463;&#20856;&#20844;&#24179;&#20998;&#37197;&#19968;&#26679;&#23545;&#29609;&#23478;&#26377;&#20559;&#22909;&#65292;&#32780;&#19988;&#29609;&#23478;&#20063;&#23545;&#22242;&#38431;&#26377;&#20559;&#22909;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#37325;&#28857;&#26159;&#20445;&#35777;&#22242;&#38431;&#33021;&#33719;&#24471;&#26368;&#22810;&#19968;&#20010;&#20154;&#30340;&#19981;&#28385;&#65288;EF1&#65289;&#65292;&#21516;&#26102;&#20004;&#20391;&#33021;&#20445;&#25345;&#31283;&#23450;&#12290;&#25105;&#20204;&#23637;&#31034;&#20986;&#65292;&#19968;&#31181;&#28385;&#36275;EF1&#12289;&#20132;&#25442;&#31283;&#23450;&#21644;&#20010;&#20154;&#31283;&#23450;&#30340;&#20998;&#37197;&#24635;&#26159;&#23384;&#22312;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#35745;&#31639;&#20986;&#26469;&#65292;&#21363;&#20415;&#22242;&#38431;&#23545;&#29609;&#23478;&#26377;&#27491;&#20540;&#25110;&#36127;&#20540;&#30340;&#24773;&#20917;&#19979;&#20063;&#26159;&#22914;&#27492;&#12290;&#21516;&#26679;&#65292;&#19968;&#20010;&#28385;&#36275;EF1&#26494;&#24347;&#26465;&#20214;&#24182;&#19988;&#24179;&#34913;&#21450;&#20132;&#25442;&#31283;&#23450;&#30340;&#20998;&#37197;&#21487;&#20197;&#26377;&#25928;&#22320;&#35745;&#31639;&#12290;&#24403;&#22242;&#38431;&#23545;&#29609;&#23478;&#30340;&#20215;&#20540;&#38750;&#36127;&#26102;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#21487;&#20197;&#23384;&#22312;EF1&#21644;Pareto&#26368;&#20248;&#20998;&#37197;&#65292;&#22914;&#26524;&#20272;&#20215;&#26159;&#20108;&#20803;&#30340;&#65292;&#37027;&#20040;&#21487;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#25214;&#21040;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;EF1&#21644;&#28608;&#21169;&#26080;&#23241;&#22930;&#30340;&#30456;&#23481;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a fair division setting in which a number of players are to be fairly distributed among a set of teams. In our model, not only do the teams have preferences over the players as in the canonical fair division setting, but the players also have preferences over the teams. We focus on guaranteeing envy-freeness up to one player (EF1) for the teams together with a stability condition for both sides. We show that an allocation satisfying EF1, swap stability, and individual stability always exists and can be computed in polynomial time, even when teams may have positive or negative values for players. Similarly, a balanced and swap stable allocation that satisfies a relaxation of EF1 can be computed efficiently. When teams have nonnegative values for players, we prove that an EF1 and Pareto optimal allocation exists and, if the valuations are binary, can be found in polynomial time. We also examine the compatibility between EF1 and justified envy-freeness.
&lt;/p&gt;</description></item></channel></rss>