<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#38450;&#21246;&#32467;&#24615;&#38382;&#39064;&#65292;&#35752;&#35770;&#20102;&#22810;&#20010;&#35201;&#27714;&#21644;&#23646;&#24615;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#20132;&#26131;&#31454;&#20105;&#26102;&#65292;&#20219;&#20309;TFM&#37117;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#25152;&#26377;&#35201;&#27714;&#21644;&#23646;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09321</link><description>&lt;p&gt;
&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#38450;&#21246;&#32467;&#24615;
&lt;/p&gt;
&lt;p&gt;
Collusion-Resilience in Transaction Fee Mechanism Design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#38450;&#21246;&#32467;&#24615;&#38382;&#39064;&#65292;&#35752;&#35770;&#20102;&#22810;&#20010;&#35201;&#27714;&#21644;&#23646;&#24615;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#20132;&#26131;&#31454;&#20105;&#26102;&#65292;&#20219;&#20309;TFM&#37117;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#25152;&#26377;&#35201;&#27714;&#21644;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21306;&#22359;&#38142;&#21327;&#35758;&#20013;&#65292;&#29992;&#25143;&#36890;&#36807;&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#65288;TFM&#65289;&#36827;&#34892;&#31454;&#26631;&#65292;&#20197;&#20415;&#23558;&#20854;&#20132;&#26131;&#21253;&#21547;&#24182;&#33719;&#24471;&#30830;&#35748;&#12290;Roughgarden&#65288;EC'21&#65289;&#23545;TFM&#36827;&#34892;&#20102;&#27491;&#24335;&#30340;&#22788;&#29702;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#20010;&#35201;&#27714;&#65306;&#29992;&#25143;&#28608;&#21169;&#20860;&#23481;&#24615;&#65288;UIC&#65289;&#65292;&#30719;&#24037;&#28608;&#21169;&#20860;&#23481;&#24615;&#65288;MIC&#65289;&#20197;&#21450;&#19968;&#31181;&#31216;&#20026;OCA-proofness&#30340;&#38450;&#21246;&#32467;&#24615;&#24418;&#24335;&#12290;&#24403;&#27809;&#26377;&#20132;&#26131;&#20043;&#38388;&#30340;&#31454;&#20105;&#26102;&#65292;Ethereum&#30340;EIP-1559&#26426;&#21046;&#21516;&#26102;&#28385;&#36275;&#36825;&#19977;&#20010;&#23646;&#24615;&#65292;&#20294;&#24403;&#26377;&#36807;&#22810;&#30340;&#31526;&#21512;&#26465;&#20214;&#30340;&#20132;&#26131;&#26080;&#27861;&#25918;&#20837;&#21333;&#20010;&#21306;&#22359;&#26102;&#65292;&#22833;&#21435;&#20102;UIC&#23646;&#24615;&#12290;Chung&#21644;Shi&#65288;SODA'23&#65289;&#32771;&#34385;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#38450;&#21246;&#32467;&#24615;&#27010;&#24565;&#65292;&#31216;&#20026;c-side-construct-proofness(c-SCP)&#65292;&#24182;&#35777;&#26126;&#20102;&#24403;&#20132;&#26131;&#20043;&#38388;&#23384;&#22312;&#31454;&#20105;&#26102;&#65292;&#20219;&#20309;TFM&#37117;&#19981;&#33021;&#28385;&#36275;UIC&#12289;MIC&#21644;&#33267;&#23569;&#20026;1&#30340;&#20219;&#20309;c&#30340;c-SCP&#12290;OCA-proofness&#26029;&#35328;&#29992;&#25143;&#21644;&#30719;&#24037;&#19981;&#24212;&#35813;&#33021;&#22815;&#20174;&#21327;&#35758;&#20013;&#8220;&#20599;&#21462;&#8221;&#65292;&#24182;&#19988;&#22312;&#30452;&#35273;&#19978;&#27604;UIC&#12289;MIC&#26356;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09321v1 Announce Type: cross Abstract: Users bid in a transaction fee mechanism (TFM) to get their transactions included and confirmed by a blockchain protocol. Roughgarden (EC'21) initiated the formal treatment of TFMs and proposed three requirements: user incentive compatibility (UIC), miner incentive compatibility (MIC), and a form of collusion-resilience called OCA-proofness. Ethereum's EIP-1559 mechanism satisfies all three properties simultaneously when there is no contention between transactions, but loses the UIC property when there are too many eligible transactions to fit in a single block. Chung and Shi (SODA'23) considered an alternative notion of collusion-resilience, called c-side-constract-proofness (c-SCP), and showed that, when there is contention between transactions, no TFM can satisfy UIC, MIC, and c-SCP for any c at least 1. OCA-proofness asserts that the users and a miner should not be able to "steal from the protocol" and is intuitively weaker than the
&lt;/p&gt;</description></item></channel></rss>