<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#35782;&#21035;&#20102;&#24076;&#20811;&#26031;&#38656;&#27714;&#30340;&#20215;&#26684;&#24377;&#24615;&#30340;&#32477;&#23545;&#20540;&#26368;&#22823;&#20540;&#20316;&#20026;&#24066;&#22330;&#28072;&#36300;&#36807;&#31243;&#20013;&#30340;&#32463;&#27982;&#21442;&#25968;&#65292;&#22312;&#21516;&#31867;&#33778;&#33293;&#23572;&#24066;&#22330;&#20013;&#35777;&#26126;&#20102;&#28072;&#36300;&#36807;&#31243;&#30340;&#25910;&#25947;&#29575;&#20026;$O((1+\varepsilon^2)/T)$&#12290;</title><link>http://arxiv.org/abs/2306.04890</link><description>&lt;p&gt;
&#21516;&#31867;&#33778;&#33293;&#23572;&#24066;&#22330;&#20013;&#30340;&#28072;&#36300;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
T\^atonnement in Homothetic Fisher Markets. (arXiv:2306.04890v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04890
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#35782;&#21035;&#20102;&#24076;&#20811;&#26031;&#38656;&#27714;&#30340;&#20215;&#26684;&#24377;&#24615;&#30340;&#32477;&#23545;&#20540;&#26368;&#22823;&#20540;&#20316;&#20026;&#24066;&#22330;&#28072;&#36300;&#36807;&#31243;&#20013;&#30340;&#32463;&#27982;&#21442;&#25968;&#65292;&#22312;&#21516;&#31867;&#33778;&#33293;&#23572;&#24066;&#22330;&#20013;&#35777;&#26126;&#20102;&#28072;&#36300;&#36807;&#31243;&#30340;&#25910;&#25947;&#29575;&#20026;$O((1+\varepsilon^2)/T)$&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#21644;&#35745;&#31639;&#39046;&#22495;&#20013;&#19968;&#20010;&#27969;&#34892;&#30340;&#20027;&#39064;&#26159;&#36890;&#36807;&#24066;&#22330;&#20013;&#21334;&#23478;&#21644;&#20080;&#23478;&#21487;&#20197;&#21457;&#29616;&#22343;&#34913;&#20215;&#26684;&#30340;&#33258;&#28982;&#20215;&#26684;&#35843;&#25972;&#36807;&#31243;&#12290;&#36825;&#31181;&#36807;&#31243;&#30340;&#19968;&#20010;&#20363;&#23376;&#26159;&#28072;&#36300;&#36807;&#31243;&#65292;&#36825;&#26159;&#19968;&#31181;&#31867;&#20284;&#20110;&#25293;&#21334;&#30340;&#31639;&#27861;&#65292;&#30001;&#27861;&#22269;&#32463;&#27982;&#23398;&#23478;&#29926;&#23572;&#25289;&#26031;&#22312;1874&#24180;&#39318;&#27425;&#25552;&#20986;&#65292;&#21334;&#23478;&#26681;&#25454;&#20080;&#23478;&#30340;&#39532;&#27463;&#23572;&#38656;&#27714;&#35843;&#25972;&#20215;&#26684;&#12290;&#28040;&#36153;&#32773;&#29702;&#35770;&#20013;&#30340;&#19968;&#20010;&#23545;&#20598;&#27010;&#24565;&#26159;&#20080;&#23478;&#30340;&#24076;&#20811;&#26031;&#38656;&#27714;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#24076;&#20811;&#26031;&#38656;&#27714;&#30340;&#24377;&#24615;&#30340;&#32477;&#23545;&#20540;&#26368;&#22823;&#20540;&#65292;&#20316;&#20026;&#19968;&#20010;&#32463;&#27982;&#21442;&#25968;&#65292;&#36275;&#20197;&#25429;&#25417;&#21644;&#35299;&#37322;&#24191;&#27867;&#31867;&#24066;&#22330;&#20013;&#25910;&#25947;&#21644;&#38750;&#25910;&#25947;&#30340;&#28072;&#36300;&#34892;&#20026;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;&#20215;&#26684;&#24377;&#24615;&#21463;&#21040;&#38480;&#21046;&#30340;&#21516;&#31867;&#33778;&#33293;&#23572;&#24066;&#22330;&#20013;&#65292;&#21363;&#30001;&#21516;&#31867;&#25928;&#29992;&#20989;&#25968;&#34920;&#31034;&#30340;&#28040;&#36153;&#32773;&#20559;&#22909;&#21644;&#20215;&#26684;&#24377;&#24615;&#21463;&#21040;&#38480;&#21046;&#30340;Fisher&#24066;&#22330;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;t&#226;tonnement&#30340;&#25910;&#25947;&#29575;&#20026;$O((1+\varepsilon^2)/T)$&#12290;
&lt;/p&gt;
&lt;p&gt;
A prevalent theme in the economics and computation literature is to identify natural price-adjustment processes by which sellers and buyers in a market can discover equilibrium prices. An example of such a process is t\^atonnement, an auction-like algorithm first proposed in 1874 by French economist Walras in which sellers adjust prices based on the Marshallian demands of buyers. A dual concept in consumer theory is a buyer's Hicksian demand. In this paper, we identify the maximum of the absolute value of the elasticity of the Hicksian demand, as an economic parameter sufficient to capture and explain a range of convergent and non-convergent t\^atonnement behaviors in a broad class of markets. In particular, we prove the convergence of t\^atonnement at a rate of $O((1+\varepsilon^2)/T)$, in homothetic Fisher markets with bounded price elasticity of Hicksian demand, i.e., Fisher markets in which consumers have preferences represented by homogeneous utility functions and the price elasti
&lt;/p&gt;</description></item></channel></rss>