<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38544;&#24335;&#28857;&#20113;&#34920;&#31034;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#36830;&#32493;&#20843;&#21449;&#26641;&#27010;&#29575;&#22330;&#21644;&#22810;&#20998;&#36776;&#29575;&#21704;&#24076;&#32593;&#26684;&#65292;&#23454;&#29616;&#20102;&#24555;&#36895;&#28210;&#26579;&#21644;&#20445;&#30041;&#32454;&#33268;&#20960;&#20309;&#32454;&#33410;&#30340;&#20248;&#21183;&#65292;&#24182;&#19988;&#22312;&#20960;&#20010;&#24120;&#35265;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#22270;&#20687;&#36136;&#37327;&#12290;</title><link>https://arxiv.org/abs/2403.16862</link><description>&lt;p&gt;
INPC&#65306;&#29992;&#20110;&#36752;&#23556;&#22330;&#28210;&#26579;&#30340;&#38544;&#24335;&#31070;&#32463;&#28857;&#20113;
&lt;/p&gt;
&lt;p&gt;
INPC: Implicit Neural Point Clouds for Radiance Field Rendering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16862
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38544;&#24335;&#28857;&#20113;&#34920;&#31034;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#36830;&#32493;&#20843;&#21449;&#26641;&#27010;&#29575;&#22330;&#21644;&#22810;&#20998;&#36776;&#29575;&#21704;&#24076;&#32593;&#26684;&#65292;&#23454;&#29616;&#20102;&#24555;&#36895;&#28210;&#26579;&#21644;&#20445;&#30041;&#32454;&#33268;&#20960;&#20309;&#32454;&#33410;&#30340;&#20248;&#21183;&#65292;&#24182;&#19988;&#22312;&#20960;&#20010;&#24120;&#35265;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#22270;&#20687;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#37325;&#24314;&#21644;&#21512;&#25104;&#26080;&#36793;&#30028;&#30340;&#29616;&#23454;&#19990;&#30028;&#22330;&#26223;&#12290;&#19982;&#20197;&#24448;&#20351;&#29992;&#20307;&#31215;&#22330;&#12289;&#22522;&#20110;&#32593;&#26684;&#30340;&#27169;&#22411;&#25110;&#31163;&#25955;&#28857;&#20113;&#20195;&#29702;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#22330;&#26223;&#34920;&#31034;&#65292;&#23427;&#22312;&#36830;&#32493;&#20843;&#21449;&#26641;&#27010;&#29575;&#22330;&#21644;&#22810;&#20998;&#36776;&#29575;&#21704;&#24076;&#32593;&#26684;&#20013;&#38544;&#21547;&#22320;&#32534;&#30721;&#28857;&#20113;&#12290;&#36890;&#36807;&#36825;&#26679;&#20570;&#65292;&#25105;&#20204;&#32467;&#21512;&#20102;&#20004;&#20010;&#19990;&#30028;&#30340;&#20248;&#21183;&#65292;&#20445;&#30041;&#20102;&#22312;&#20248;&#21270;&#36807;&#31243;&#20013;&#26377;&#21033;&#30340;&#34892;&#20026;&#65306;&#25105;&#20204;&#30340;&#26032;&#39062;&#38544;&#24335;&#28857;&#20113;&#34920;&#31034;&#21644;&#21487;&#24494;&#30340;&#21452;&#32447;&#24615;&#20809;&#26629;&#21270;&#22120;&#23454;&#29616;&#20102;&#24555;&#36895;&#28210;&#26579;&#65292;&#21516;&#26102;&#20445;&#30041;&#20102;&#32454;&#24494;&#30340;&#20960;&#20309;&#32454;&#33410;&#65292;&#32780;&#26080;&#38656;&#20381;&#36182;&#20110;&#20687;&#32467;&#26500;&#36816;&#21160;&#28857;&#20113;&#36825;&#26679;&#30340;&#21021;&#22987;&#20808;&#39564;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#20960;&#20010;&#24120;&#35265;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#22270;&#20687;&#36136;&#37327;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#24555;&#36895;&#25512;&#29702;&#65292;&#21487;&#20132;&#20114;&#24103;&#36895;&#29575;&#65292;&#24182;&#19988;&#21487;&#20197;&#25552;&#21462;&#26174;&#24335;&#28857;&#20113;&#20197;&#36827;&#19968;&#27493;&#25552;&#39640;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16862v1 Announce Type: cross  Abstract: We introduce a new approach for reconstruction and novel-view synthesis of unbounded real-world scenes. In contrast to previous methods using either volumetric fields, grid-based models, or discrete point cloud proxies, we propose a hybrid scene representation, which implicitly encodes a point cloud in a continuous octree-based probability field and a multi-resolution hash grid. In doing so, we combine the benefits of both worlds by retaining favorable behavior during optimization: Our novel implicit point cloud representation and differentiable bilinear rasterizer enable fast rendering while preserving fine geometric detail without depending on initial priors like structure-from-motion point clouds. Our method achieves state-of-the-art image quality on several common benchmark datasets. Furthermore, we achieve fast inference at interactive frame rates, and can extract explicit point clouds to further enhance performance.
&lt;/p&gt;</description></item></channel></rss>