<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22312;&#23569;&#37327;&#25968;&#25454;&#19978;&#35782;&#21035;&#26234;&#33021;&#20307;&#23398;&#20064;&#21160;&#21147;&#23398;&#30340;&#31639;&#27861;&#26694;&#26550;&#12290;&#36890;&#36807;&#20351;&#29992;&#22810;&#39033;&#24335;&#22238;&#24402;&#21644;&#24341;&#20837;&#25429;&#25417;&#26234;&#33021;&#20307;&#34892;&#20026;&#30340;&#20391;&#20449;&#24687;&#32422;&#26463;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#20351;&#29992;&#21333;&#20010;&#36712;&#36857;&#30340;&#30701;&#26242;&#36816;&#34892;&#20013;&#20165;&#20165;5&#20010;&#26679;&#26412;&#30340;&#24773;&#20917;&#19979;&#20934;&#30830;&#24674;&#22797;&#30495;&#23454;&#21160;&#21147;&#23398;&#12290;</title><link>http://arxiv.org/abs/2307.06640</link><description>&lt;p&gt;
&#21457;&#29616;&#26234;&#33021;&#20307;&#22312;&#23569;&#37327;&#25968;&#25454;&#19978;&#30340;&#23398;&#20064;&#26041;&#24335;
&lt;/p&gt;
&lt;p&gt;
Discovering How Agents Learn Using Few Data. (arXiv:2307.06640v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06640
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22312;&#23569;&#37327;&#25968;&#25454;&#19978;&#35782;&#21035;&#26234;&#33021;&#20307;&#23398;&#20064;&#21160;&#21147;&#23398;&#30340;&#31639;&#27861;&#26694;&#26550;&#12290;&#36890;&#36807;&#20351;&#29992;&#22810;&#39033;&#24335;&#22238;&#24402;&#21644;&#24341;&#20837;&#25429;&#25417;&#26234;&#33021;&#20307;&#34892;&#20026;&#30340;&#20391;&#20449;&#24687;&#32422;&#26463;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#20351;&#29992;&#21333;&#20010;&#36712;&#36857;&#30340;&#30701;&#26242;&#36816;&#34892;&#20013;&#20165;&#20165;5&#20010;&#26679;&#26412;&#30340;&#24773;&#20917;&#19979;&#20934;&#30830;&#24674;&#22797;&#30495;&#23454;&#21160;&#21147;&#23398;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25955;&#24335;&#23398;&#20064;&#31639;&#27861;&#26159;&#35774;&#35745;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#30340;&#37325;&#35201;&#24037;&#20855;&#65292;&#23427;&#20204;&#20351;&#24471;&#26234;&#33021;&#20307;&#33021;&#22815;&#20174;&#32463;&#39564;&#21644;&#36807;&#21435;&#30340;&#20132;&#20114;&#20013;&#33258;&#20027;&#23398;&#20064;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#29702;&#35770;&#21644;&#31639;&#27861;&#26694;&#26550;&#65292;&#29992;&#20110;&#23454;&#26102;&#35782;&#21035;&#35268;&#23450;&#26234;&#33021;&#20307;&#34892;&#20026;&#30340;&#23398;&#20064;&#21160;&#21147;&#23398;&#65292;&#21482;&#38656;&#20351;&#29992;&#21333;&#20010;&#31995;&#32479;&#36712;&#36857;&#30340;&#30701;&#26242;&#31361;&#21457;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#22810;&#39033;&#24335;&#22238;&#24402;&#35782;&#21035;&#26234;&#33021;&#20307;&#21160;&#21147;&#23398;&#65292;&#22312;&#26377;&#38480;&#30340;&#25968;&#25454;&#19978;&#36890;&#36807;&#24341;&#20837;&#25429;&#25417;&#26234;&#33021;&#20307;&#34892;&#20026;&#30340;&#22522;&#26412;&#20551;&#35774;&#25110;&#26399;&#26395;&#30340;&#20391;&#20449;&#24687;&#32422;&#26463;&#26469;&#34917;&#20607;&#65292;&#24182;&#19988;&#36890;&#36807;&#20351;&#29992;&#21644;&#20248;&#21270;&#32422;&#26463;&#30340;&#24179;&#26041;&#21644;&#35745;&#31639;&#26469;&#23454;&#26045;&#36825;&#20123;&#32422;&#26463;&#65292;&#20174;&#32780;&#24471;&#21040;&#36234;&#26469;&#36234;&#20934;&#30830;&#30340;&#26234;&#33021;&#20307;&#21160;&#21147;&#23398;&#36817;&#20284;&#23618;&#27425;&#12290;&#24191;&#27867;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21482;&#20351;&#29992;&#21333;&#20010;&#36712;&#36857;&#30340;&#30701;&#26242;&#36816;&#34892;&#20013;&#30340;5&#20010;&#26679;&#26412;&#65292;&#23601;&#21487;&#20197;&#20934;&#30830;&#24674;&#22797;&#21508;&#31181;&#22522;&#20934;&#27979;&#35797;&#20013;&#30340;&#30495;&#23454;&#21160;&#21147;&#23398;&#65292;&#21253;&#25324;&#22343;&#34913;&#36873;&#25321;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized learning algorithms are an essential tool for designing multi-agent systems, as they enable agents to autonomously learn from their experience and past interactions. In this work, we propose a theoretical and algorithmic framework for real-time identification of the learning dynamics that govern agent behavior using a short burst of a single system trajectory. Our method identifies agent dynamics through polynomial regression, where we compensate for limited data by incorporating side-information constraints that capture fundamental assumptions or expectations about agent behavior. These constraints are enforced computationally using sum-of-squares optimization, leading to a hierarchy of increasingly better approximations of the true agent dynamics. Extensive experiments demonstrated that our approach, using only 5 samples from a short run of a single trajectory, accurately recovers the true dynamics across various benchmarks, including equilibrium selection and predictio
&lt;/p&gt;</description></item></channel></rss>