<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#31867;&#21035;&#65292;&#36890;&#36807;&#24102;&#26377;&#32593;&#32476;&#21487;&#20998;&#31163;&#20132;&#20114;&#30340;&#22810;&#20154;&#38646;&#21644;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#27169;&#22411;&#65288;MZNMGs&#65289;&#26469;&#27169;&#25311;&#38750;&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#39034;&#24207;&#20915;&#31574;&#20013;&#30340;&#23616;&#37096;&#20132;&#20114;&#32467;&#26500;&#12290;&#20316;&#32773;&#30830;&#23450;&#20102;MG&#21487;&#34987;&#34920;&#31034;&#20026;MZNMG&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#35777;&#26126;&#20854;Markov CCE&#38598;&#21512;&#19982;Markov NE&#38598;&#21512;&#30456;&#31561;&#65307;&#27492;&#22806;&#65292;&#22312;&#26080;&#38480;&#26102;&#38388;&#25240;&#25187;MZNMG&#20013;&#25214;&#21040;&#36817;&#20284;&#30340;Markov&#31283;&#23450;CCE&#26159;PPAD&#38590;&#39064;&#65292;&#38500;&#38750;&#32593;&#32476;&#20855;&#26377;&#8220;&#26143;&#29366;&#32467;&#26500;&#8221;&#12290;</title><link>http://arxiv.org/abs/2307.09470</link><description>&lt;p&gt;
&#24102;&#26377;&#32593;&#32476;&#21487;&#20998;&#31163;&#20132;&#20114;&#30340;&#22810;&#20154;&#38646;&#21644;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Multi-Player Zero-Sum Markov Games with Networked Separable Interactions. (arXiv:2307.09470v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09470
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#31867;&#21035;&#65292;&#36890;&#36807;&#24102;&#26377;&#32593;&#32476;&#21487;&#20998;&#31163;&#20132;&#20114;&#30340;&#22810;&#20154;&#38646;&#21644;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#27169;&#22411;&#65288;MZNMGs&#65289;&#26469;&#27169;&#25311;&#38750;&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#39034;&#24207;&#20915;&#31574;&#20013;&#30340;&#23616;&#37096;&#20132;&#20114;&#32467;&#26500;&#12290;&#20316;&#32773;&#30830;&#23450;&#20102;MG&#21487;&#34987;&#34920;&#31034;&#20026;MZNMG&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#35777;&#26126;&#20854;Markov CCE&#38598;&#21512;&#19982;Markov NE&#38598;&#21512;&#30456;&#31561;&#65307;&#27492;&#22806;&#65292;&#22312;&#26080;&#38480;&#26102;&#38388;&#25240;&#25187;MZNMG&#20013;&#25214;&#21040;&#36817;&#20284;&#30340;Markov&#31283;&#23450;CCE&#26159;PPAD&#38590;&#39064;&#65292;&#38500;&#38750;&#32593;&#32476;&#20855;&#26377;&#8220;&#26143;&#29366;&#32467;&#26500;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#31867;&#21035;&#65292;&#21363;&#24102;&#26377;&#32593;&#32476;&#21487;&#20998;&#31163;&#20132;&#20114;&#30340;&#22810;&#20154;&#38646;&#21644;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#65288;MZNMGs&#65289;&#65292;&#20197;&#27169;&#25311;&#38750;&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#39034;&#24207;&#20915;&#31574;&#20013;&#30340;&#23616;&#37096;&#20132;&#20114;&#32467;&#26500;&#12290;&#25105;&#20204;&#23558;MZNMG&#23450;&#20041;&#20026;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#19982;&#27599;&#20010;&#29366;&#24577;&#30456;&#20851;&#30340;&#36741;&#21161;&#28216;&#25103;&#30340;&#25910;&#30410;&#26159;&#38646;&#21644;&#30340;&#65292;&#24182;&#19988;&#22312;&#26576;&#20010;&#20132;&#20114;&#32593;&#32476;&#19978;&#30340;&#37051;&#23621;&#20043;&#38388;&#20855;&#26377;&#19968;&#20123;&#21487;&#20998;&#31163;&#65288;&#21363;&#32858;&#21512;&#30697;&#38453;&#65289;&#32467;&#26500;&#12290;&#25105;&#20204;&#39318;&#20808;&#30830;&#23450;&#20102;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#33021;&#22815;&#34987;&#34920;&#31034;&#20026;MZNMG&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#19988;&#35777;&#26126;&#22312;&#36825;&#20123;&#28216;&#25103;&#20013;&#65292;&#39532;&#23572;&#21487;&#22827;&#31895;&#31961;&#30456;&#20851;&#22343;&#34913;&#65288;CCE&#65289;&#30340;&#38598;&#21512;&#32553;&#20943;&#20026;&#39532;&#23572;&#21487;&#22827;&#32435;&#20160;&#22343;&#34913;&#65288;NE&#65289;&#30340;&#38598;&#21512;&#65292;&#21363;&#21069;&#32773;&#23545;&#25152;&#26377;&#29609;&#23478;&#30340;&#27599;&#20010;&#29366;&#24577;&#30340;&#36793;&#38469;&#21270;&#20056;&#31215;&#32467;&#26524;&#24471;&#21040;&#21518;&#32773;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#22312;&#26080;&#38480;&#26102;&#38388;&#25240;&#25187;MZNMGs&#20013;&#25214;&#21040;&#36817;&#20284;&#39532;&#23572;&#21487;&#22827;\emph{&#31283;&#23450;}CCE&#26159;PPAD&#38590;&#39064;&#65292;&#38500;&#38750;&#24213;&#23618;&#32593;&#32476;&#20855;&#26377;``&#26143;&#29366;&#32467;&#26500;''&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a new class of Markov games (MGs), \textit{Multi-player Zero-sum Markov Games} with {\it Networked separable interactions} (MZNMGs), to model the local interaction structure in non-cooperative multi-agent sequential decision-making. We define an MZNMG as a model where {the payoffs of the auxiliary games associated with each state are zero-sum and} have some separable (i.e., polymatrix) structure across the neighbors over some interaction network. We first identify the necessary and sufficient conditions under which an MG can be presented as an MZNMG, and show that the set of Markov coarse correlated equilibrium (CCE) collapses to the set of Markov Nash equilibrium (NE) in these games, in that the {product of} per-state marginalization of the former for all players yields the latter. Furthermore, we show that finding approximate Markov \emph{stationary} CCE in infinite-horizon discounted MZNMGs is \texttt{PPAD}-hard, unless the underlying network has a ``star topology''. Then, 
&lt;/p&gt;</description></item></channel></rss>