<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#21338;&#24328;&#35770;&#27169;&#22411;&#21644;&#22522;&#30784;&#27169;&#22411;&#22312;&#20998;&#26512;&#12289;&#35774;&#35745;&#21644;&#23454;&#26045;&#32593;&#32476;&#27450;&#39575;&#31574;&#30053;&#20013;&#21457;&#25381;&#20851;&#38190;&#20316;&#29992;&#65292;&#20026;&#25552;&#21319;&#20027;&#21160;&#21644;&#33258;&#21160;&#21270;&#32593;&#32476;&#38450;&#24481;&#26426;&#21046;&#25552;&#20379;&#20102;&#26032;&#24605;&#36335;&#12290;</title><link>https://arxiv.org/abs/2403.10570</link><description>&lt;p&gt;
&#25112;&#30053;&#32593;&#32476;&#25112;&#20013;&#30340;&#29983;&#29289;&#20849;&#29983;&#28216;&#25103;&#21644;&#22522;&#30784;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Symbiotic Game and Foundation Models for Cyber Deception Operations in Strategic Cyber Warfare
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10570
&lt;/p&gt;
&lt;p&gt;
&#21338;&#24328;&#35770;&#27169;&#22411;&#21644;&#22522;&#30784;&#27169;&#22411;&#22312;&#20998;&#26512;&#12289;&#35774;&#35745;&#21644;&#23454;&#26045;&#32593;&#32476;&#27450;&#39575;&#31574;&#30053;&#20013;&#21457;&#25381;&#20851;&#38190;&#20316;&#29992;&#65292;&#20026;&#25552;&#21319;&#20027;&#21160;&#21644;&#33258;&#21160;&#21270;&#32593;&#32476;&#38450;&#24481;&#26426;&#21046;&#25552;&#20379;&#20102;&#26032;&#24605;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38754;&#20020;&#30528;&#32593;&#32476;&#25112;&#25112;&#26415;&#30340;&#24555;&#36895;&#28436;&#21464;&#12289;&#24773;&#25253;&#19981;&#23545;&#31216;&#24615;&#22686;&#21152;&#21644;&#40657;&#23458;&#24037;&#20855;&#30340;&#26085;&#30410;&#26131;&#24471;&#65292;&#25105;&#20204;&#27491;&#38754;&#20020;&#21069;&#25152;&#26410;&#26377;&#30340;&#32593;&#32476;&#25112;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#32593;&#32476;&#27450;&#39575;&#20316;&#20026;&#25105;&#20204;&#38450;&#24481;&#31574;&#30053;&#20013;&#30340;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#23853;&#38706;&#22836;&#35282;&#65292;&#26088;&#22312;&#24212;&#23545;&#26085;&#30410;&#22797;&#26434;&#30340;&#25915;&#20987;&#12290;&#26412;&#31456;&#26088;&#22312;&#24378;&#35843;&#21338;&#24328;&#35770;&#27169;&#22411;&#21644;&#22522;&#30784;&#27169;&#22411;&#65288;FMs&#65289;&#22312;&#20998;&#26512;&#12289;&#35774;&#35745;&#21644;&#23454;&#26045;&#32593;&#32476;&#27450;&#39575;&#31574;&#30053;&#20013;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;&#21338;&#24328;&#27169;&#22411;&#65288;GMs&#65289;&#20316;&#20026;&#19968;&#20010;&#22522;&#30784;&#26694;&#26550;&#65292;&#29992;&#20110;&#24314;&#27169;&#22810;&#26679;&#30340;&#23545;&#25239;&#24615;&#20132;&#20114;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#21253;&#23481;&#23545;&#25239;&#24615;&#30693;&#35782;&#21644;&#39046;&#22495;&#29305;&#23450;&#30340;&#35265;&#35299;&#12290;&#21516;&#26102;&#65292;&#22522;&#30784;&#27169;&#22411;&#20316;&#20026;&#21019;&#24314;&#38024;&#23545;&#29305;&#23450;&#24212;&#29992;&#30340;&#23450;&#21046;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#26500;&#24314;&#22359;&#12290;&#36890;&#36807;&#21033;&#29992;&#21338;&#24328;&#27169;&#22411;&#21644;&#22522;&#30784;&#27169;&#22411;&#20043;&#38388;&#30340;&#21327;&#21516;&#25928;&#24212;&#65292;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#19981;&#20165;&#20445;&#25252;&#25105;&#20204;&#30340;&#32593;&#32476;&#20813;&#21463;&#25915;&#20987;&#65292;&#32780;&#19988;&#25552;&#39640;&#20027;&#21160;&#21644;&#33258;&#21160;&#21270;&#32593;&#32476;&#38450;&#24481;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10570v1 Announce Type: cross  Abstract: We are currently facing unprecedented cyber warfare with the rapid evolution of tactics, increasing asymmetry of intelligence, and the growing accessibility of hacking tools. In this landscape, cyber deception emerges as a critical component of our defense strategy against increasingly sophisticated attacks. This chapter aims to highlight the pivotal role of game-theoretic models and foundation models (FMs) in analyzing, designing, and implementing cyber deception tactics. Game models (GMs) serve as a foundational framework for modeling diverse adversarial interactions, allowing us to encapsulate both adversarial knowledge and domain-specific insights. Meanwhile, FMs serve as the building blocks for creating tailored machine learning models suited to given applications. By leveraging the synergy between GMs and FMs, we can advance proactive and automated cyber defense mechanisms by not only securing our networks against attacks but als
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#20551;&#35774;&#22312;&#32447;&#23398;&#20064;&#65288;COL&#65289;&#30340;&#23398;&#20064;&#26041;&#26696;&#65292;&#38024;&#23545;&#36890;&#29992;AISG&#65292;&#32467;&#26500;&#21270;&#20026;&#19968;&#20010;&#20808;&#39564;&#39044;&#27979;&#32773;-&#28436;&#21592;-&#35780;&#35770;&#23478;&#65288;FAC&#65289;&#26550;&#26500;&#65292;&#21033;&#29992;&#19968;&#32423;&#20449;&#24565;&#21644;&#23545;&#25163;&#31574;&#30053;&#30340;&#20027;&#35266;&#39044;&#27979;&#65292;&#36890;&#36807;&#22312;&#32447;&#23637;&#24320;&#26356;&#26032;&#31574;&#30053;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#23398;&#20064;&#26657;&#20934;&#20551;&#35774;&#12290;</title><link>https://arxiv.org/abs/2402.18781</link><description>&lt;p&gt;
&#20855;&#26377;&#19968;&#32423;&#20449;&#24565;&#30340;&#20551;&#35774;&#22312;&#32447;&#23398;&#20064;&#22312;&#19981;&#23545;&#31216;&#20449;&#24687;&#38543;&#26426;&#21338;&#24328;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Conjectural Online Learning with First-order Beliefs in Asymmetric Information Stochastic Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18781
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#20551;&#35774;&#22312;&#32447;&#23398;&#20064;&#65288;COL&#65289;&#30340;&#23398;&#20064;&#26041;&#26696;&#65292;&#38024;&#23545;&#36890;&#29992;AISG&#65292;&#32467;&#26500;&#21270;&#20026;&#19968;&#20010;&#20808;&#39564;&#39044;&#27979;&#32773;-&#28436;&#21592;-&#35780;&#35770;&#23478;&#65288;FAC&#65289;&#26550;&#26500;&#65292;&#21033;&#29992;&#19968;&#32423;&#20449;&#24565;&#21644;&#23545;&#25163;&#31574;&#30053;&#30340;&#20027;&#35266;&#39044;&#27979;&#65292;&#36890;&#36807;&#22312;&#32447;&#23637;&#24320;&#26356;&#26032;&#31574;&#30053;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#23398;&#20064;&#26657;&#20934;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#21338;&#24328;&#20986;&#29616;&#22312;&#35768;&#22810;&#22797;&#26434;&#30340;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#20013;&#65292;&#22914;&#32593;&#32476;&#29289;&#29702;&#31995;&#32479;&#21644;IT&#22522;&#30784;&#35774;&#26045;&#65292;&#20449;&#24687;&#19981;&#23545;&#31216;&#20026;&#20915;&#31574;&#23454;&#20307;&#65288;&#29609;&#23478;&#65289;&#30340;&#20915;&#31574;&#24102;&#26469;&#25361;&#25112;&#12290;&#29616;&#26377;&#30340;&#19981;&#23545;&#31216;&#20449;&#24687;&#38543;&#26426;&#21338;&#24328;&#65288;AISG&#65289;&#30340;&#35745;&#31639;&#26041;&#27861;&#20027;&#35201;&#26159;&#31163;&#32447;&#30340;&#65292;&#38024;&#23545;&#29305;&#27530;&#31867;&#21035;&#30340;AISG&#65292;&#20197;&#36991;&#20813;&#20449;&#24565;&#23618;&#27425;&#65292;&#24182;&#19988;&#32570;&#20047;&#36866;&#24212;&#22343;&#34913;&#20559;&#24046;&#30340;&#22312;&#32447;&#33021;&#21147;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#20551;&#35774;&#22312;&#32447;&#23398;&#20064;&#65288;COL&#65289;&#30340;&#23398;&#20064;&#26041;&#26696;&#65292;&#19987;&#38376;&#38024;&#23545;&#36890;&#29992;AISG&#12290;COL&#32467;&#26500;&#21270;&#20026;&#19968;&#20010;&#20808;&#39564;&#39044;&#27979;&#32773;-&#28436;&#21592;-&#35780;&#35770;&#23478;&#65288;FAC&#65289;&#26550;&#26500;&#65292;&#21033;&#29992;&#23545;&#38544;&#34255;&#29366;&#24577;&#30340;&#19968;&#32423;&#20449;&#24565;&#21644;&#23545;&#23545;&#25163;&#31574;&#30053;&#30340;&#20027;&#35266;&#39044;&#27979;&#12290;&#38024;&#23545;&#20551;&#35774;&#30340;&#23545;&#25163;&#65292;COL&#36890;&#36807;&#22312;&#32447;&#23637;&#24320;&#26356;&#26032;&#31574;&#30053;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#23398;&#20064;&#26657;&#20934;&#20551;&#35774;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;COL&#20013;&#30340;&#20551;&#35774;&#19982;t&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18781v1 Announce Type: cross  Abstract: Stochastic games arise in many complex socio-technical systems, such as cyber-physical systems and IT infrastructures, where information asymmetry presents challenges for decision-making entities (players). Existing computational methods for asymmetric information stochastic games (AISG) are primarily offline, targeting special classes of AISGs to avoid belief hierarchies, and lack online adaptability to deviations from equilibrium. To address this limitation, we propose a conjectural online learning (COL), a learning scheme for generic AISGs. COL, structured as a forecaster-actor-critic (FAC) architecture, utilizes first-order beliefs over the hidden states and subjective forecasts of the opponent's strategies. Against the conjectured opponent, COL updates strategies in an actor-critic approach using online rollout and calibrates conjectures through Bayesian learning. We prove that conjecture in COL is asymptotically consistent with t
&lt;/p&gt;</description></item></channel></rss>