<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#28608;&#21169;&#20860;&#23481;&#24615;&#31038;&#20250;&#25216;&#26415;&#23545;&#40784;&#38382;&#39064;&#65288;ICSAP&#65289;&#65292;&#26088;&#22312;&#25506;&#35752;&#22914;&#20309;&#21033;&#29992;&#21338;&#24328;&#35770;&#20013;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#21407;&#21017;&#26469;&#32500;&#25345;AI&#19982;&#20154;&#31867;&#31038;&#20250;&#30340;&#20849;&#35782;&#12290;</title><link>https://arxiv.org/abs/2402.12907</link><description>&lt;p&gt;
AI&#23545;&#40784;&#22312;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#20013;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#65306;&#31435;&#22330;&#19982;&#21069;&#26223;
&lt;/p&gt;
&lt;p&gt;
Incentive Compatibility for AI Alignment in Sociotechnical Systems: Positions and Prospects
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12907
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#28608;&#21169;&#20860;&#23481;&#24615;&#31038;&#20250;&#25216;&#26415;&#23545;&#40784;&#38382;&#39064;&#65288;ICSAP&#65289;&#65292;&#26088;&#22312;&#25506;&#35752;&#22914;&#20309;&#21033;&#29992;&#21338;&#24328;&#35770;&#20013;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#21407;&#21017;&#26469;&#32500;&#25345;AI&#19982;&#20154;&#31867;&#31038;&#20250;&#30340;&#20849;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#26085;&#30410;&#34701;&#20837;&#20154;&#31867;&#31038;&#20250;&#65292;&#23545;&#31038;&#20250;&#27835;&#29702;&#21644;&#23433;&#20840;&#24102;&#26469;&#37325;&#35201;&#24433;&#21709;&#12290;&#23613;&#31649;&#22312;&#35299;&#20915;AI&#23545;&#40784;&#25361;&#25112;&#26041;&#38754;&#21462;&#24471;&#20102;&#37325;&#22823;&#36827;&#23637;&#65292;&#20294;&#29616;&#26377;&#26041;&#27861;&#20027;&#35201;&#38598;&#20013;&#22312;&#25216;&#26415;&#26041;&#38754;&#65292;&#24448;&#24448;&#24573;&#35270;&#20102;AI&#31995;&#32479;&#22797;&#26434;&#30340;&#31038;&#20250;&#25216;&#26415;&#24615;&#36136;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#24320;&#21457;&#21644;&#37096;&#32626;&#32972;&#26223;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#19968;&#20010;&#20540;&#24471;&#25506;&#32034;&#30340;&#26032;&#38382;&#39064;&#65306;&#28608;&#21169;&#20860;&#23481;&#24615;&#31038;&#20250;&#25216;&#26415;&#23545;&#40784;&#38382;&#39064;&#65288;ICSAP&#65289;&#12290;&#25105;&#20204;&#24076;&#26395;&#36825;&#33021;&#21628;&#21505;&#26356;&#22810;&#30740;&#31350;&#20154;&#21592;&#25506;&#35752;&#22914;&#20309;&#21033;&#29992;&#21338;&#24328;&#35770;&#20013;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#21407;&#21017;&#26469;&#24357;&#21512;&#25216;&#26415;&#21644;&#31038;&#20250;&#32452;&#25104;&#37096;&#20998;&#20043;&#38388;&#30340;&#40511;&#27807;&#65292;&#20197;&#22312;&#19981;&#21516;&#32972;&#26223;&#19979;&#32500;&#25345;AI&#19982;&#20154;&#31867;&#31038;&#20250;&#30340;&#20849;&#35782;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35752;&#35770;&#20102;&#23454;&#29616;IC&#30340;&#19977;&#20010;&#32463;&#20856;&#21338;&#24328;&#38382;&#39064;&#65306;&#26426;&#21046;&#35774;&#35745;&#12289;&#22865;&#32422;&#29702;&#35770;&#21644;&#36125;&#21494;&#26031;&#35828;&#26381;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12907v1 Announce Type: new  Abstract: The burgeoning integration of artificial intelligence (AI) into human society brings forth significant implications for societal governance and safety. While considerable strides have been made in addressing AI alignment challenges, existing methodologies primarily focus on technical facets, often neglecting the intricate sociotechnical nature of AI systems, which can lead to a misalignment between the development and deployment contexts. To this end, we posit a new problem worth exploring: Incentive Compatibility Sociotechnical Alignment Problem (ICSAP). We hope this can call for more researchers to explore how to leverage the principles of Incentive Compatibility (IC) from game theory to bridge the gap between technical and societal components to maintain AI consensus with human societies in different contexts. We further discuss three classical game problems for achieving IC: mechanism design, contract theory, and Bayesian persuasion,
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#24066;&#22330;&#20013;&#20351;&#29992;&#22312;&#32447;&#23398;&#20064;&#36827;&#34892;&#24179;&#34913;&#23450;&#20215;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#35299;&#20915;&#36873;&#25321;&#24615;&#35854;&#35328;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2303.11522</link><description>&lt;p&gt;
&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#24066;&#22330;&#20013;&#20351;&#29992;&#22312;&#32447;&#23398;&#20064;&#36827;&#34892;&#24179;&#34913;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Online Learning for Equilibrium Pricing in Markets under Incomplete Information. (arXiv:2303.11522v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11522
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#24066;&#22330;&#20013;&#20351;&#29992;&#22312;&#32447;&#23398;&#20064;&#36827;&#34892;&#24179;&#34913;&#23450;&#20215;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#35299;&#20915;&#36873;&#25321;&#24615;&#35854;&#35328;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#24179;&#34913;&#30340;&#30740;&#31350;&#26159;&#32463;&#27982;&#29702;&#35770;&#30340;&#26680;&#24515;&#65292;&#29305;&#21035;&#26159;&#22312;&#26377;&#25928;&#37197;&#32622;&#31232;&#32570;&#36164;&#28304;&#26041;&#38754;&#12290;&#28982;&#32780;&#65292;&#23450;&#20215;&#22343;&#34913;&#30340;&#35745;&#31639;&#36890;&#24120;&#20381;&#36182;&#20110;&#23436;&#25972;&#30340;&#20010;&#20307;&#23646;&#24615;&#20449;&#24687;&#65292;&#22914;&#20379;&#24212;&#21830;&#30340;&#25104;&#26412;&#20989;&#25968;&#31561;&#65292;&#36825;&#22312;&#23454;&#36341;&#20013;&#24448;&#24448;&#19981;&#21487;&#29992;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#35299;&#20915;&#23450;&#20215;&#22343;&#34913;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24066;&#22330;&#32463;&#33829;&#32773;&#23547;&#27714;&#36890;&#36807;&#20174;&#25104;&#26412;&#20989;&#25968;&#26410;&#30693;&#30340;&#31454;&#20105;&#20379;&#24212;&#21830;&#36141;&#20080;&#25152;&#38656;&#25968;&#37327;&#26469;&#28385;&#36275;&#23458;&#25143;&#38656;&#27714;&#12290;&#22312;&#36825;&#31181;&#19981;&#23436;&#25972;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#32447;&#23398;&#20064;&#38382;&#39064;&#65292;&#21363;&#23398;&#20064;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#24179;&#34913;&#20215;&#26684;&#65292;&#21516;&#26102;&#32852;&#21512;&#20248;&#21270;&#19977;&#20010;&#24615;&#33021;&#25351;&#26631;&#8212;&#8212;&#26410;&#28385;&#36275;&#30340;&#38656;&#27714;&#12289;&#25104;&#26412;&#22833;&#35823;&#21644;&#20184;&#27454;&#22833;&#35823;&#8212;&#8212;&#36825;&#26159;&#22312;&#23450;&#20215;&#22343;&#34913;&#30340;&#24773;&#20917;&#19979;&#30456;&#20851;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The study of market equilibria is central to economic theory, particularly in efficiently allocating scarce resources. However, the computation of equilibrium prices at which the supply of goods matches their demand typically relies on having access to complete information on private attributes of agents, e.g., suppliers' cost functions, which are often unavailable in practice. Motivated by this practical consideration, we consider the problem of setting equilibrium prices in the incomplete information setting wherein a market operator seeks to satisfy the customer demand for a commodity by purchasing the required amount from competing suppliers with privately known cost functions unknown to the market operator. In this incomplete information setting, we consider the online learning problem of learning equilibrium prices over time while jointly optimizing three performance metrics -- unmet demand, cost regret, and payment regret -- pertinent in the context of equilibrium pricing over a
&lt;/p&gt;</description></item></channel></rss>