<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.15890</link><description>&lt;p&gt;
&#24102;&#39044;&#31639;&#30340;&#22810;&#20195;&#29702;&#21512;&#21516;&#35774;&#35745;&#20013;&#21152;&#26435;&#21512;&#21516;&#30340;&#26368;&#20248;&#24615;
&lt;/p&gt;
&lt;p&gt;
Optimality of weighted contracts for multi-agent contract design with a budget
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15890
&lt;/p&gt;
&lt;p&gt;
&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#20043;&#38388;&#30340;&#21512;&#21516;&#35774;&#35745;&#38382;&#39064;&#12290;&#27599;&#20010;&#20195;&#29702;&#21442;&#19982;&#19968;&#20010;&#29420;&#31435;&#20219;&#21153;&#65292;&#32467;&#26524;&#20026;&#25104;&#21151;&#25110;&#22833;&#36133;&#65292;&#20195;&#29702;&#21487;&#20197;&#20184;&#20986;&#20195;&#20215;&#21162;&#21147;&#25552;&#39640;&#25104;&#21151;&#30340;&#27010;&#29575;&#65292;&#20027;&#20307;&#26377;&#22266;&#23450;&#39044;&#31639;&#65292;&#21487;&#20197;&#20026;&#20195;&#29702;&#25552;&#20379;&#19982;&#32467;&#26524;&#30456;&#20851;&#30340;&#22870;&#21169;&#12290;&#20851;&#38190;&#26159;&#65292;&#25105;&#20204;&#20551;&#35774;&#20027;&#20307;&#21482;&#20851;&#24515;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#65292;&#32780;&#19981;&#20851;&#24515;&#39044;&#31639;&#30340;&#25903;&#20986;&#37327;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#20102;&#23545;&#20110;&#26576;&#20123;&#30446;&#26631;&#65292;&#21512;&#21516;&#21482;&#26377;&#24403;&#23427;&#26159;&#25104;&#21151;&#19968;&#20999;&#30340;&#21512;&#21516;&#25165;&#26159;&#26368;&#20248;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#30340;&#19968;&#20010;&#30452;&#25509;&#25512;&#35770;&#26159;&#65292;&#22312;&#36825;&#31181;&#35774;&#23450;&#19979;&#65292;&#35745;&#20214;&#21512;&#21516;&#21644;&#22870;&#37329;&#27744;&#21512;&#21516;&#20174;&#26469;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#28982;&#21518;&#25105;&#20204;&#35777;&#26126;&#65292;&#23545;&#20110;&#20219;&#20309;&#30446;&#26631;&#65292;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#30340;&#22522;&#20110;&#20248;&#20808;&#32423;&#21152;&#26435;&#30340;&#21512;&#21516;&#65292;&#36825;&#20010;&#21512;&#21516;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#65292;&#24182;&#23558;&#39044;&#31639;&#20998;&#37197;&#32473;&#26368;&#39640;&#20248;&#20808;&#32423;&#30340;&#25104;&#21151;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15890v1 Announce Type: new  Abstract: We study a contract design problem between a principal and multiple agents. Each agent participates in an independent task with binary outcomes (success or failure), in which it may exert costly effort towards improving its probability of success, and the principal has a fixed budget which it can use to provide outcome-dependent rewards to the agents. Crucially, we assume the principal cares only about maximizing the agents' probabilities of success, not how much of the budget it expends. We first show that a contract is optimal for some objective if and only if it is a successful-get-everything contract. An immediate consequence of this result is that piece-rate contracts and bonus-pool contracts are never optimal in this setting. We then show that for any objective, there is an optimal priority-based weighted contract, which assigns positive weights and priority levels to the agents, and splits the budget among the highest-priority suc
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#35821;&#35328;&#27169;&#22411;&#20013;&#24341;&#20837;&#21338;&#24328;&#35770;&#24605;&#24819;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#32465;&#23450;&#21338;&#24328;&#35770;&#30340;&#31526;&#21495;&#36923;&#36753;&#65292;&#20351;&#24471;&#35821;&#35328;&#27169;&#22411;&#33021;&#22815;&#36890;&#36807;&#21338;&#24328;&#35770;&#27714;&#35299;&#22120;&#25552;&#20379;&#26356;&#21152;&#31283;&#23450;&#21644;&#29702;&#24615;&#30340;&#23545;&#35805;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2402.01704</link><description>&lt;p&gt;
&#20316;&#20026;&#31574;&#30053;&#30340;&#29366;&#24577;&#23383;&#31526;&#20018;&#65306;&#29992;&#21338;&#24328;&#35770;&#27714;&#35299;&#22120;&#24341;&#23548;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
States as Strings as Strategies: Steering Language Models with Game-Theoretic Solvers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01704
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#35821;&#35328;&#27169;&#22411;&#20013;&#24341;&#20837;&#21338;&#24328;&#35770;&#24605;&#24819;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#32465;&#23450;&#21338;&#24328;&#35770;&#30340;&#31526;&#21495;&#36923;&#36753;&#65292;&#20351;&#24471;&#35821;&#35328;&#27169;&#22411;&#33021;&#22815;&#36890;&#36807;&#21338;&#24328;&#35770;&#27714;&#35299;&#22120;&#25552;&#20379;&#26356;&#21152;&#31283;&#23450;&#21644;&#29702;&#24615;&#30340;&#23545;&#35805;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21338;&#24328;&#35770;&#26159;&#30740;&#31350;&#29702;&#24615;&#20027;&#20307;&#38388;&#25112;&#30053;&#20114;&#21160;&#30340;&#25968;&#23398;&#27169;&#22411;&#12290;&#35821;&#35328;&#26159;&#20154;&#31867;&#20114;&#21160;&#30340;&#37325;&#35201;&#26041;&#24335;&#65292;&#20294;&#22312;&#21382;&#21490;&#19978;&#19968;&#30452;&#24456;&#38590;&#36890;&#36807;&#25968;&#23398;&#26041;&#27861;&#23545;&#23545;&#35805;&#21450;&#20854;&#25112;&#30053;&#21160;&#26426;&#24314;&#27169;&#12290;&#19982;&#35821;&#35328;&#20114;&#21160;&#30456;&#20851;&#30340;&#29609;&#23478;&#12289;&#31574;&#30053;&#21644;&#22238;&#25253;&#30340;&#36866;&#24403;&#27169;&#22411;&#65288;&#21363;&#23545;&#28216;&#25103;&#35770;&#24120;&#35268;&#31526;&#21495;&#36923;&#36753;&#30340;&#32422;&#26463;&#65289;&#23558;&#20351;&#29616;&#26377;&#30340;&#21338;&#24328;&#35770;&#31639;&#27861;&#33021;&#22815;&#22312;&#35821;&#35328;&#39046;&#22495;&#25552;&#20379;&#25112;&#30053;&#35299;&#20915;&#26041;&#26696;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#36825;&#31181;&#32422;&#26463;&#21487;&#20197;&#20026;&#22312;&#23545;&#35805;&#20013;&#35745;&#31639;&#31283;&#23450;&#12289;&#29702;&#24615;&#30340;&#23545;&#35805;&#31574;&#30053;&#25552;&#20379;&#19968;&#26465;&#36884;&#24452;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#21487;&#33021;&#24050;&#32463;&#36798;&#21040;&#20102;&#20854;&#29983;&#25104;&#33021;&#21147;&#36275;&#20197;&#23454;&#29616;&#33258;&#28982;&#23545;&#35805;&#30495;&#23454;&#12289;&#31867;&#20284;&#20154;&#31867;&#30340;&#27169;&#25311;&#30340;&#31243;&#24230;&#12290;&#36890;&#36807;&#20197;&#19981;&#21516;&#30340;&#26041;&#24335;&#25552;&#31034;&#23427;&#20204;&#65292;&#25105;&#20204;&#21487;&#20197;&#23558;&#20854;&#21709;&#24212;&#24341;&#23548;&#21040;&#19981;&#21516;&#30340;&#36755;&#20986;&#35805;&#35821;&#12290;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#30340;&#34920;&#36798;&#33021;&#21147;&#65292;LLM&#36824;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#24555;&#36895;&#29983;&#25104;&#26032;&#30340;&#23545;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;
Game theory is the study of mathematical models of strategic interactions among rational agents. Language is a key medium of interaction for humans, though it has historically proven difficult to model dialogue and its strategic motivations mathematically. A suitable model of the players, strategies, and payoffs associated with linguistic interactions (i.e., a binding to the conventional symbolic logic of game theory) would enable existing game-theoretic algorithms to provide strategic solutions in the space of language. In other words, a binding could provide a route to computing stable, rational conversational strategies in dialogue. Large language models (LLMs) have arguably reached a point where their generative capabilities can enable realistic, human-like simulations of natural dialogue. By prompting them in various ways, we can steer their responses towards different output utterances. Leveraging the expressivity of natural language, LLMs can also help us quickly generate new di
&lt;/p&gt;</description></item></channel></rss>