<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23610;&#24230;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#22810;&#23610;&#24230;&#38899;&#35270;&#21516;&#27493;&#25439;&#22833;&#21644;&#22810;&#23610;&#24230;&#33258;&#22238;&#24402;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65292;&#23454;&#29616;&#20102;&#35821;&#38899;&#21644;&#22836;&#37096;&#21160;&#21147;&#23398;&#30340;&#21516;&#27493;&#29983;&#25104;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#22312;&#24403;&#21069;&#29366;&#24577;&#19979;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2307.03270</link><description>&lt;p&gt;
&#35821;&#38899;&#21644;&#21160;&#21147;&#23398;&#21516;&#27493;&#30340;&#20840;&#38754;&#22810;&#23610;&#24230;&#26041;&#27861;&#22312;&#34394;&#25311;&#35828;&#35805;&#22836;&#29983;&#25104;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A Comprehensive Multi-scale Approach for Speech and Dynamics Synchrony in Talking Head Generation. (arXiv:2307.03270v1 [cs.GR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03270
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23610;&#24230;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#22810;&#23610;&#24230;&#38899;&#35270;&#21516;&#27493;&#25439;&#22833;&#21644;&#22810;&#23610;&#24230;&#33258;&#22238;&#24402;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65292;&#23454;&#29616;&#20102;&#35821;&#38899;&#21644;&#22836;&#37096;&#21160;&#21147;&#23398;&#30340;&#21516;&#27493;&#29983;&#25104;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#22312;&#24403;&#21069;&#29366;&#24577;&#19979;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#28145;&#24230;&#29983;&#25104;&#27169;&#22411;&#20351;&#29992;&#35821;&#38899;&#36755;&#20837;&#20449;&#21495;&#23545;&#38745;&#24577;&#38754;&#37096;&#22270;&#20687;&#36827;&#34892;&#21160;&#30011;&#21270;&#26159;&#19968;&#20010;&#27963;&#36291;&#30340;&#30740;&#31350;&#35838;&#39064;&#65292;&#24182;&#19988;&#36817;&#26399;&#21462;&#24471;&#20102;&#37325;&#35201;&#30340;&#36827;&#23637;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#24456;&#22823;&#19968;&#37096;&#20998;&#24037;&#20316;&#37117;&#38598;&#20013;&#22312;&#22068;&#21767;&#21516;&#27493;&#21644;&#28210;&#26579;&#36136;&#37327;&#19978;&#65292;&#24456;&#23569;&#20851;&#27880;&#33258;&#28982;&#22836;&#37096;&#36816;&#21160;&#30340;&#29983;&#25104;&#65292;&#26356;&#19981;&#29992;&#35828;&#22836;&#37096;&#36816;&#21160;&#19982;&#35821;&#38899;&#30340;&#35270;&#21548;&#30456;&#20851;&#24615;&#20102;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23610;&#24230;&#38899;&#35270;&#21516;&#27493;&#25439;&#22833;&#21644;&#22810;&#23610;&#24230;&#33258;&#22238;&#24402;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65292;&#20197;&#26356;&#22909;&#22320;&#22788;&#29702;&#35821;&#38899;&#19982;&#22836;&#37096;&#21644;&#22068;&#21767;&#21160;&#21147;&#23398;&#20043;&#38388;&#30340;&#30701;&#26399;&#21644;&#38271;&#26399;&#30456;&#20851;&#24615;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#22312;&#22810;&#27169;&#24577;&#36755;&#20837;&#37329;&#23383;&#22612;&#19978;&#35757;&#32451;&#20102;&#19968;&#22534;&#21516;&#27493;&#27169;&#22411;&#65292;&#24182;&#23558;&#36825;&#20123;&#27169;&#22411;&#29992;&#20316;&#22810;&#23610;&#24230;&#29983;&#25104;&#32593;&#32476;&#20013;&#30340;&#25351;&#23548;&#65292;&#20197;&#20135;&#29983;&#19981;&#21516;&#26102;&#38388;&#23610;&#24230;&#19978;&#30340;&#38899;&#39057;&#23545;&#40784;&#36816;&#21160;&#23637;&#24320;&#12290;&#25105;&#20204;&#30340;&#29983;&#25104;&#22120;&#22312;&#38754;&#37096;&#26631;&#24535;&#22495;&#20013;&#25805;&#20316;&#65292;&#36825;&#26159;&#19968;&#31181;&#26631;&#20934;&#30340;&#20302;&#32500;&#22836;&#37096;&#34920;&#31034;&#26041;&#27861;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#22312;&#22836;&#37096;&#36816;&#21160;&#21160;&#21147;&#23398;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
Animating still face images with deep generative models using a speech input signal is an active research topic and has seen important recent progress. However, much of the effort has been put into lip syncing and rendering quality while the generation of natural head motion, let alone the audio-visual correlation between head motion and speech, has often been neglected. In this work, we propose a multi-scale audio-visual synchrony loss and a multi-scale autoregressive GAN to better handle short and long-term correlation between speech and the dynamics of the head and lips. In particular, we train a stack of syncer models on multimodal input pyramids and use these models as guidance in a multi-scale generator network to produce audio-aligned motion unfolding over diverse time scales. Our generator operates in the facial landmark domain, which is a standard low-dimensional head representation. The experiments show significant improvements over the state of the art in head motion dynamic
&lt;/p&gt;</description></item></channel></rss>