<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#25293;&#21334;&#20013;&#23450;&#20215;&#23545;&#20080;&#23478;&#21097;&#20313;&#20998;&#37197;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#36194;&#23478;&#30340;&#32463;&#39564;&#26041;&#24046;&#20316;&#20026;&#19968;&#20010;&#21097;&#20313;&#20844;&#24179;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#34920;&#26126;&#22312;&#19968;&#23450;&#31169;&#26377;-&#20844;&#20849;&#20215;&#20540;&#27604;&#20363;&#19979;&#65292;&#25353;&#31454;&#26631;&#25903;&#20184;&#21644;&#32479;&#19968;&#23450;&#20215;&#28151;&#21512;&#21487;&#20197;&#26368;&#23567;&#21270;&#21097;&#20313;&#30340;&#26041;&#24046;&#12290;</title><link>https://arxiv.org/abs/2403.07799</link><description>&lt;p&gt;
&#25293;&#21334;&#20013;&#30340;&#20844;&#24179;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Equitable Pricing in Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07799
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25293;&#21334;&#20013;&#23450;&#20215;&#23545;&#20080;&#23478;&#21097;&#20313;&#20998;&#37197;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#36194;&#23478;&#30340;&#32463;&#39564;&#26041;&#24046;&#20316;&#20026;&#19968;&#20010;&#21097;&#20313;&#20844;&#24179;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#34920;&#26126;&#22312;&#19968;&#23450;&#31169;&#26377;-&#20844;&#20849;&#20215;&#20540;&#27604;&#20363;&#19979;&#65292;&#25353;&#31454;&#26631;&#25903;&#20184;&#21644;&#32479;&#19968;&#23450;&#20215;&#28151;&#21512;&#21487;&#20197;&#26368;&#23567;&#21270;&#21097;&#20313;&#30340;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#23450;&#20215;&#22914;&#20309;&#24433;&#21709;&#22312;&#22810;&#21333;&#20301;&#25293;&#21334;&#20013;&#20080;&#23478;&#20043;&#38388;&#30340;&#21097;&#20313;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#20844;&#24179;&#30446;&#26631;&#21487;&#33021;&#24456;&#37325;&#35201;&#65292;&#20363;&#22914;&#65292;&#23545;&#20110;&#19979;&#28216;&#24066;&#22330;&#20013;&#30340;&#31454;&#20105;&#38382;&#39064;&#65292;&#36825;&#26159;&#23545;&#38271;&#26399;&#20851;&#20110;&#25910;&#20837;&#21644;&#25928;&#29575;&#30340;&#36777;&#35770;&#30340;&#19968;&#20010;&#34917;&#20805;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#32463;&#20856;&#30340;&#22810;&#19981;&#21487;&#20998;&#21333;&#20803;&#25293;&#21334;&#27169;&#22411;&#65292;&#20854;&#20013;&#26377;&#21333;&#20301;&#38656;&#27714;&#30340;&#20080;&#23478;&#21644;&#20855;&#26377;&#31169;&#26377;&#21644;&#20844;&#20849;&#25104;&#20998;&#30340;&#20272;&#20540;&#65292;&#24182;&#32771;&#34385;&#20102;&#25152;&#26377;&#23450;&#20215;&#35268;&#21017;&#65292;&#36825;&#20123;&#35268;&#21017;&#26159;&#25353;&#31454;&#26631;&#25903;&#20184;&#21644;&#32479;&#19968;&#23450;&#20215;&#30340;&#28151;&#21512;&#65288;&#21363;&#20984;&#32452;&#21512;&#65289;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#36194;&#23478;&#30340;&#32463;&#39564;&#26041;&#24046;&#65288;WEV&#65289;&#65292;&#21363;&#36194;&#23478;&#20043;&#38388;&#21097;&#20313;&#30340;&#39044;&#26399;&#32463;&#39564;&#26041;&#24046;&#65292;&#20316;&#20026;&#21097;&#20313;&#20844;&#24179;&#30340;&#24230;&#37327;&#26631;&#20934;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#19968;&#31995;&#21015;&#31169;&#26377;-&#20844;&#20849;&#20215;&#20540;&#27604;&#20363;&#20013;&#65292;&#25216;&#26415;&#20869;&#37096;&#30340;&#25353;&#31454;&#26631;&#20184;&#36153;&#21644;&#32479;&#19968;&#23450;&#20215;&#28151;&#21512;&#26368;&#23567;&#21270;&#20102;WEV&#12290;&#20174;&#20844;&#24179;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#20855;&#26377;&#26356;&#39640;&#31169;&#26377;&#20540;&#25104;&#20998;&#30340;&#25293;&#21334;&#21463;&#30410;&#20110;&#26356;&#22810;&#30340;&#20215;&#26684;&#27495;&#35270;&#65292;&#32780;&#20165;&#20855;&#26377;&#36275;&#22815;&#22823;&#23567;&#31169;&#26377;&#20540;&#25104;&#20998;&#30340;&#25293;&#21334;&#25165;&#33021;&#33719;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07799v1 Announce Type: new  Abstract: We study how pricing affects the division of surplus among buyers in auctions for multiple units. Our equity objective may be important, e.g., for competition concerns in downstream markets, complementing the long-standing debate on revenue and efficiency. We study a canonical model of auctions for multiple indivisible units with unit demand buyers and valuations with a private and a common component and consider all pricing rules that are a mixture (i.e., a convex combination) of pay-as-bid and uniform pricing. We propose the winners' empirical variance (WEV), the expected empirical variance of surplus among the winners, as a metric for surplus equity. We show that, for a range of private-common value proportions, a strictly interior mix of pay-as-bid and uniform pricing minimizes WEV. From an equity perspective, auctions with a higher private value component benefit from more price discrimination, whereas only auctions with a sufficien
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31454;&#20105;&#24615;&#35774;&#26045;&#36873;&#22336;&#30340;&#20004;&#38454;&#27573;&#22810;&#20195;&#29702;&#31995;&#32479;&#65292;&#38024;&#23545;&#19981;&#21487;&#20998;&#21106;&#26435;&#37325;&#30340;&#23458;&#25143;&#25552;&#20986;&#20102;&#28151;&#21512;&#31574;&#30053;&#65292;&#23637;&#31034;&#20102;&#22312;&#32473;&#23450;&#35774;&#26045;&#24067;&#32622;&#26102;&#21487;&#33021;&#20986;&#29616;&#25130;&#28982;&#19981;&#21516;&#30340;&#23458;&#25143;&#22343;&#34913;&#12290;</title><link>https://arxiv.org/abs/2403.03114</link><description>&lt;p&gt;
&#20004;&#38454;&#27573;&#35774;&#26045;&#36873;&#22336;&#20013;&#30340;&#22343;&#34913;&#19982;&#21407;&#23376;&#23458;&#25143;
&lt;/p&gt;
&lt;p&gt;
Equilibria in Two-Stage Facility Location with Atomic Clients
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03114
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31454;&#20105;&#24615;&#35774;&#26045;&#36873;&#22336;&#30340;&#20004;&#38454;&#27573;&#22810;&#20195;&#29702;&#31995;&#32479;&#65292;&#38024;&#23545;&#19981;&#21487;&#20998;&#21106;&#26435;&#37325;&#30340;&#23458;&#25143;&#25552;&#20986;&#20102;&#28151;&#21512;&#31574;&#30053;&#65292;&#23637;&#31034;&#20102;&#22312;&#32473;&#23450;&#35774;&#26045;&#24067;&#32622;&#26102;&#21487;&#33021;&#20986;&#29616;&#25130;&#28982;&#19981;&#21516;&#30340;&#23458;&#25143;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;&#31454;&#20105;&#24615;&#35774;&#26045;&#36873;&#22336;&#35270;&#20026;&#19968;&#20010;&#24102;&#26377;&#20004;&#31181;&#23458;&#25143;&#31867;&#22411;&#30340;&#20004;&#38454;&#27573;&#22810;&#20195;&#29702;&#31995;&#32479;&#12290;&#23545;&#20110;&#20855;&#26377;&#21152;&#26435;&#23458;&#25143;&#30340;&#20027;&#26426;&#22270;&#65292;&#39318;&#20808;&#35774;&#26045;&#20195;&#29702;&#32773;&#25112;&#30053;&#24615;&#22320;&#36873;&#25321;&#24320;&#35774;&#35774;&#26045;&#30340;&#39030;&#28857;&#12290;&#28982;&#21518;&#65292;&#23458;&#25143;&#25112;&#30053;&#24615;&#22320;&#36873;&#25321;&#22312;&#20854;&#37051;&#22495;&#20869;&#30340;&#21738;&#20010;&#24320;&#35774;&#35774;&#26045;&#28040;&#36153;&#12290;&#35774;&#26045;&#24076;&#26395;&#23613;&#21487;&#33021;&#21560;&#24341;&#26356;&#22810;&#23458;&#25143;&#26435;&#37325;&#65292;&#23458;&#25143;&#24076;&#26395;&#26368;&#23567;&#21270;&#25152;&#36873;&#35774;&#26045;&#19978;&#30340;&#25317;&#25380;&#12290;&#25152;&#26377;&#26368;&#36817;&#30740;&#31350;&#30340;&#27492;&#27169;&#22411;&#29256;&#26412;&#37117;&#20551;&#23450;&#23458;&#25143;&#21487;&#20197;&#25112;&#30053;&#24615;&#22320;&#20998;&#25285;&#20182;&#20204;&#30340;&#26435;&#37325;&#12290;&#25105;&#20204;&#32771;&#34385;&#20855;&#26377;&#19981;&#21487;&#20998;&#21106;&#26435;&#37325;&#30340;&#23458;&#25143;&#65292;&#20294;&#20801;&#35768;&#28151;&#21512;&#31574;&#30053;&#12290;&#22240;&#27492;&#65292;&#23458;&#25143;&#21487;&#20197;&#22312;&#21738;&#20010;&#35774;&#26045;&#28040;&#36153;&#19978;&#38543;&#26426;&#36873;&#25321;&#12290;&#38500;&#20102;&#23545;&#33258;&#28982;&#23458;&#25143;&#34892;&#20026;&#36827;&#34892;&#24314;&#27169;&#22806;&#65292;&#36825;&#31181;&#24494;&#22937;&#30340;&#21464;&#21270;&#20250;&#20135;&#29983; drast &#21095;&#28872;&#30340;&#21464;&#21270;&#65292;&#20363;&#22914;&#65292;&#22312;&#32473;&#23450;&#35774;&#26045;&#24067;&#32622;&#26102;&#65292;&#21487;&#33021;&#20986;&#29616;&#25130;&#28982;&#19981;&#21516;&#30340;&#23458;&#25143;&#22343;&#34913;&#12290;&#20316;&#20026;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#32431;&#23376;&#21338;&#24328;&#23436;&#32654;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03114v1 Announce Type: cross  Abstract: We consider competitive facility location as a two-stage multi-agent system with two types of clients. For a given host graph with weighted clients on the vertices, first facility agents strategically select vertices for opening their facilities. Then, the clients strategically select which of the opened facilities in their neighborhood to patronize. Facilities want to attract as much client weight as possible, clients want to minimize congestion on the chosen facility.   All recently studied versions of this model assume that clients can split their weight strategically. We consider clients with unsplittable weights, but allow mixed strategies. So clients may randomize over which facility to patronize. Besides modeling a natural client behavior, this subtle change yields drastic changes, e.g., for a given facility placement, qualitatively different client equilibria are possible.   As our main result, we show that pure subgame perfect
&lt;/p&gt;</description></item></channel></rss>