<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#30740;&#31350;&#20851;&#27880;&#23545;&#31216;&#21452;&#36793;&#21305;&#37197;&#38382;&#39064;&#65292;&#20171;&#32461;&#20102;&#31283;&#23450;&#21644;&#22362;&#20915;&#26426;&#21046;&#22312;&#21305;&#37197;&#36807;&#31243;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.01404</link><description>&lt;p&gt;
&#23545;&#31216;&#26426;&#21046;&#29992;&#20110;&#21452;&#36793;&#21305;&#37197;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Symmetric mechanisms for two-sided matching problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01404
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20851;&#27880;&#23545;&#31216;&#21452;&#36793;&#21305;&#37197;&#38382;&#39064;&#65292;&#20171;&#32461;&#20102;&#31283;&#23450;&#21644;&#22362;&#20915;&#26426;&#21046;&#22312;&#21305;&#37197;&#36807;&#31243;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#19987;&#27880;&#20110;&#22522;&#26412;&#30340;&#19968;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#27169;&#22411;&#65292;&#22312;&#36825;&#20010;&#27169;&#22411;&#20013;&#26377;&#20004;&#20010;&#30456;&#31561;&#35268;&#27169;&#30340;&#19981;&#30456;&#20132;&#20195;&#29702;&#20154;&#38598;&#21512;&#65292;&#27599;&#20010;&#20195;&#29702;&#20154;&#22312;&#19968;&#20010;&#38598;&#21512;&#20013;&#23545;&#21478;&#19968;&#20010;&#38598;&#21512;&#20013;&#30340;&#20195;&#29702;&#20154;&#26377;&#20559;&#22909;&#65292;&#36825;&#20123;&#20559;&#22909;&#36890;&#36807;&#32447;&#24615;&#25490;&#24207;&#36827;&#34892;&#24314;&#27169;&#12290;&#30446;&#26631;&#26159;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#20559;&#22909;&#25214;&#21040;&#23558;&#19968;&#20010;&#38598;&#21512;&#20013;&#30340;&#27599;&#20010;&#20195;&#29702;&#20154;&#19982;&#21478;&#19968;&#20010;&#38598;&#21512;&#20013;&#30340;&#19968;&#20010;&#19988;&#20165;&#19968;&#20010;&#20195;&#29702;&#20154;&#20851;&#32852;&#30340;&#21305;&#37197;&#12290;&#26426;&#21046;&#26159;&#23558;&#19968;&#32452;&#21305;&#37197;&#19982;&#27599;&#20010;&#20559;&#22909;&#37197;&#32622;&#20851;&#32852;&#30340;&#35268;&#21017;&#12290;&#31283;&#23450;&#24615;&#25351;&#30340;&#26159;&#26426;&#21046;&#24212;&#28385;&#36275;&#30340;&#21482;&#36873;&#25321;&#31283;&#23450;&#21305;&#37197;&#30340;&#33021;&#21147;&#65292;&#32780;&#21478;&#19968;&#20010;&#29305;&#21035;&#36866;&#29992;&#20110;&#24212;&#29992;&#30340;&#20851;&#38190;&#29305;&#24615;&#26159;&#22362;&#20915;&#24615;&#65292;&#36825;&#35201;&#27714;&#26426;&#21046;&#24635;&#26159;&#36873;&#25321;&#21807;&#19968;&#30340;&#21305;&#37197;&#12290;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#20004;&#20010;&#29256;&#26412;&#26159;&#31283;&#23450;&#21644;&#22362;&#20915;&#30340;&#26426;&#21046;&#30340;&#31034;&#20363;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26426;&#21046;&#38750;&#24120;&#19981;&#20844;&#24179;&#65292;&#22240;&#20026;&#23427;&#20204;&#20005;&#37325;&#20559;&#21521;&#20110;&#24066;&#22330;&#30340;&#20004;&#20391;&#12290;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01404v1 Announce Type: new  Abstract: We focus on the basic one-to-one two-sided matching model, where there are two disjoint sets of agents of equal size, and each agent in a set has preferences on the agents in the other set, modelled by linear orders. The goal is to find a matching that associates each agent in one set with one and only one agent in the other set based on the agents' preferences. A mechanism is a rule that associates a set of matchings to each preference profile. Stability, which refers to the capability to select only stable matchings, is an important property a mechanism should fulfill. Another crucial property, especially useful for applications, is resoluteness, which requires that the mechanism always selects a unique matching. The two versions of the deferred acceptance algorithm are examples of stable and resolute mechanisms. However, these mechanisms are severely unfair since they strongly favor one of the two sides of the market. In this paper, w
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#21160;&#24577;&#23450;&#20215;&#21644;&#27719;&#32858;&#32593;&#32476;&#30340;&#24066;&#22330;&#35774;&#35745;&#65292;&#36890;&#36807;&#35774;&#32622;&#36793;&#32536;&#20215;&#26684;&#28608;&#21169;&#20195;&#29702;&#21830;&#20849;&#20139;&#26377;&#38480;&#32593;&#32476;&#23481;&#37327;&#12290;&#22312;&#32771;&#34385;&#20102;&#25972;&#25968;&#21644;&#32593;&#32476;&#32422;&#26463;&#20197;&#21450;&#20195;&#29702;&#21830;&#24322;&#36136;&#20559;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20805;&#20998;&#26465;&#20214;&#65292;&#20445;&#35777;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#65292;&#24182;&#35782;&#21035;&#20102;&#23454;&#29616;&#26368;&#22823;&#25928;&#29992;&#30340;&#29305;&#23450;&#24066;&#22330;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2307.03994</link><description>&lt;p&gt;
&#21160;&#24577;&#23450;&#20215;&#21644;&#27719;&#32858;&#32593;&#32476;&#30340;&#24066;&#22330;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Market Design for Dynamic Pricing and Pooling in Capacitated Networks. (arXiv:2307.03994v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03994
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#21160;&#24577;&#23450;&#20215;&#21644;&#27719;&#32858;&#32593;&#32476;&#30340;&#24066;&#22330;&#35774;&#35745;&#65292;&#36890;&#36807;&#35774;&#32622;&#36793;&#32536;&#20215;&#26684;&#28608;&#21169;&#20195;&#29702;&#21830;&#20849;&#20139;&#26377;&#38480;&#32593;&#32476;&#23481;&#37327;&#12290;&#22312;&#32771;&#34385;&#20102;&#25972;&#25968;&#21644;&#32593;&#32476;&#32422;&#26463;&#20197;&#21450;&#20195;&#29702;&#21830;&#24322;&#36136;&#20559;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20805;&#20998;&#26465;&#20214;&#65292;&#20445;&#35777;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#65292;&#24182;&#35782;&#21035;&#20102;&#23454;&#29616;&#26368;&#22823;&#25928;&#29992;&#30340;&#29305;&#23450;&#24066;&#22330;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#24066;&#22330;&#26426;&#21046;&#65292;&#36890;&#36807;&#35774;&#32622;&#36793;&#32536;&#20215;&#26684;&#26469;&#28608;&#21169;&#25112;&#30053;&#24615;&#20195;&#29702;&#21830;&#32452;&#32455;&#26053;&#34892;&#65292;&#20197;&#26377;&#25928;&#20849;&#20139;&#26377;&#38480;&#30340;&#32593;&#32476;&#23481;&#37327;&#12290;&#35813;&#24066;&#22330;&#20801;&#35768;&#20195;&#29702;&#21830;&#32452;&#25104;&#22242;&#38431;&#20849;&#20139;&#26053;&#34892;&#65292;&#20570;&#20986;&#20986;&#21457;&#26102;&#38388;&#21644;&#36335;&#32447;&#36873;&#25321;&#30340;&#20915;&#31574;&#65292;&#24182;&#25903;&#20184;&#36793;&#32536;&#20215;&#26684;&#21644;&#20854;&#20182;&#25104;&#26412;&#12290;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#20998;&#26512;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#35745;&#31639;&#65292;&#24314;&#31435;&#22312;&#32452;&#21512;&#25293;&#21334;&#21644;&#21160;&#24577;&#32593;&#32476;&#27969;&#29702;&#35770;&#30340;&#22522;&#30784;&#19978;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#35299;&#20915;&#20102;&#24066;&#22330;&#22343;&#34913;&#29305;&#24449;&#21270;&#20013;&#30340;&#25361;&#25112;&#65292;&#21253;&#25324;&#65306;&#65288;a&#65289;&#20849;&#20139;&#26377;&#38480;&#36793;&#32536;&#23481;&#37327;&#20013;&#26053;&#34892;&#30340;&#21160;&#24577;&#27969;&#37327;&#25152;&#24341;&#21457;&#30340;&#25972;&#25968;&#21644;&#32593;&#32476;&#32422;&#26463;&#65307;&#65288;b&#65289;&#25112;&#30053;&#24615;&#20195;&#29702;&#21830;&#30340;&#24322;&#36136;&#21644;&#31169;&#20154;&#20559;&#22909;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#32593;&#32476;&#25299;&#25169;&#21644;&#20195;&#29702;&#21830;&#20559;&#22909;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20197;&#30830;&#20445;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20010;&#29305;&#23450;&#30340;&#24066;&#22330;&#22343;&#34913;&#65292;&#23454;&#29616;&#20102;&#25152;&#26377;&#20195;&#29702;&#21830;&#30340;&#26368;&#22823;&#25928;&#29992;&#65292;&#24182;&#19988;&#19982;&#32463;&#20856;&#30340;&#26368;&#22823;&#27969;&#26368;&#23567;&#21106;&#38382;&#39064;&#31561;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a market mechanism that sets edge prices to incentivize strategic agents to organize trips that efficiently share limited network capacity. This market allows agents to form groups to share trips, make decisions on departure times and route choices, and make payments to cover edge prices and other costs. We develop a new approach to analyze the existence and computation of market equilibrium, building on theories of combinatorial auctions and dynamic network flows. Our approach tackles the challenges in market equilibrium characterization arising from: (a) integer and network constraints on the dynamic flow of trips in sharing limited edge capacity; (b) heterogeneous and private preferences of strategic agents. We provide sufficient conditions on the network topology and agents' preferences that ensure the existence and polynomial-time computation of market equilibrium. We identify a particular market equilibrium that achieves maximum utilities for all agents, and is equivalen
&lt;/p&gt;</description></item></channel></rss>