<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#24418;&#24335;&#65292;&#21457;&#29616;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#19988;&#24378;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#65292;&#21516;&#26102;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#21516;&#26102;&#39640;&#25928;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#30340;&#20808;&#39564;&#29420;&#31435;&#25293;&#21334;&#12290;</title><link>https://arxiv.org/abs/2404.00475</link><description>&lt;p&gt;
&#20813;&#30123;&#20316;&#24330;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
Shill-Proof Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#24418;&#24335;&#65292;&#21457;&#29616;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#19988;&#24378;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#65292;&#21516;&#26102;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#21516;&#26102;&#39640;&#25928;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#30340;&#20808;&#39564;&#29420;&#31435;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21333;&#21697;&#25293;&#21334;&#20013;&#65292;&#19968;&#20010;&#27450;&#35784;&#24615;&#30340;&#21334;&#23478;&#21487;&#33021;&#20250;&#20266;&#35013;&#25104;&#19968;&#20010;&#25110;&#22810;&#20010;&#31454;&#26631;&#32773;&#65292;&#20197;&#25805;&#32437;&#25104;&#20132;&#20215;&#26684;&#12290;&#26412;&#25991;&#23545;&#37027;&#20123;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#26684;&#24335;&#36827;&#34892;&#20102;&#34920;&#24449;&#65306;&#19968;&#20010;&#21033;&#28070;&#26368;&#22823;&#21270;&#30340;&#21334;&#23478;&#27809;&#26377;&#20219;&#20309;&#21160;&#26426;&#25552;&#20132;&#20219;&#20309;&#34394;&#20551;&#25253;&#20215;&#12290;&#25105;&#20204;&#21306;&#20998;&#20102;&#24378;&#20813;&#30123;&#20316;&#24330;&#65292;&#21363;&#19968;&#20010;&#20102;&#35299;&#31454;&#26631;&#32773;&#20272;&#20540;&#30340;&#21334;&#23478;&#27704;&#36828;&#26080;&#27861;&#20174;&#20316;&#24330;&#20013;&#33719;&#21033;&#65292;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#65292;&#23427;&#20165;&#35201;&#27714;&#20174;&#20316;&#24330;&#20013;&#24471;&#21040;&#30340;&#24179;&#34913;&#39044;&#26399;&#21033;&#28070;&#20026;&#38750;&#27491;&#12290;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#21644;&#24378;&#20813;&#30123;&#20316;&#24330;&#25293;&#21334;&#12290;&#27492;&#22806;&#65292;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#20855;&#26377;&#20808;&#39564;&#29420;&#31435;&#24615;&#30340;&#25293;&#21334;&#65292;&#26082;&#39640;&#25928;&#21448;&#24369;&#20813;&#30123;&#20316;&#24330;&#12290;&#34429;&#28982;&#23384;&#22312;&#22810;&#31181;&#31574;&#30053;&#35777;&#26126;&#12289;&#24369;&#20813;&#30123;&#20316;&#24330;&#21644;&#26368;&#20248;&#25293;&#21334;&#65307;&#20219;&#20309;&#26368;&#20248;&#25293;&#21334;&#21482;&#33021;&#28385;&#36275;&#38598;&#21512; {&#38745;&#24577;&#12289;&#31574;&#30053;&#35777;&#26126;&#12289;&#24369;&#20813;&#30123;&#20316;&#24330;} &#20013;&#30340;&#20004;&#20010;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00475v1 Announce Type: new  Abstract: In a single-item auction, a duplicitous seller may masquerade as one or more bidders in order to manipulate the clearing price. This paper characterizes auction formats that are shill-proof: a profit-maximizing seller has no incentive to submit any shill bids. We distinguish between strong shill-proofness, in which a seller with full knowledge of bidders' valuations can never profit from shilling, and weak shill-proofness, which requires only that the expected equilibrium profit from shilling is nonpositive. The Dutch auction (with suitable reserve) is the unique optimal and strongly shill-proof auction. Moreover, the Dutch auction (with no reserve) is the unique prior-independent auction that is both efficient and weakly shill-proof. While there are a multiplicity of strategy-proof, weakly shill-proof, and optimal auctions; any optimal auction can satisfy only two properties in the set {static, strategy-proof, weakly shill-proof}.
&lt;/p&gt;</description></item></channel></rss>