<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.16942</link><description>&lt;p&gt;
&#40065;&#26834;&#30340;&#20215;&#26684;&#27495;&#35270;
&lt;/p&gt;
&lt;p&gt;
Robust Price Discrimination. (arXiv:2401.16942v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16942
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#30340;&#27169;&#22411;&#65292;&#20854;&#20013;&#21334;&#26041;&#23545;&#20135;&#21697;&#30340;&#20272;&#20540;&#26410;&#30693;&#20110;&#24066;&#22330;&#35774;&#35745;&#32773;&#65292;&#21518;&#32773;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20080;&#26041;&#20272;&#20540;&#30340;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#36951;&#25022;&#24230;&#38480;&#21046;&#20026;$U^*(0)/e$&#65292;&#20854;&#20013; $U^*(0)$&#26159;&#22312;&#21334;&#26041;&#23545;&#20135;&#21697;&#27809;&#26377;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#20080;&#26041;&#21097;&#20313;&#12290;&#35813;&#38480;&#21046;&#36890;&#36807;&#38543;&#26426;&#25277;&#21462;&#21334;&#26041;&#20272;&#20540;&#24182;&#24212;&#29992;Bergemann&#31561;&#20154;&#65288;2015&#65289;&#23545;&#20110;&#25277;&#21462;&#20272;&#20540;&#30340;&#20998;&#21106;&#26041;&#27861;&#24471;&#21040;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#20108;&#20998;&#31867;&#20080;&#26041;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;$U^*(0)/e$&#38480;&#21046;&#26159;&#32039;&#23494;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a model of third-degree price discrimination, in which the seller has a valuation for the product which is unknown to the market designer, who aims to maximize the buyers' surplus by revealing information regarding the buyer's valuation to the seller. Our main result shows that the regret is bounded by $U^*(0)/e$, where $U^*(0)$ is the optimal buyer surplus in the case where the seller has zero valuation for the product. This bound is attained by randomly drawing a seller valuation and applying the segmentation of Bergemann et al. (2015) with respect to the drawn valuation. We show that the $U^*(0)/e$ bound is tight in the case of binary buyer valuation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33756;&#21333;&#25551;&#36848;&#22312;&#23637;&#31034;&#26426;&#21046;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2209.13148</link><description>&lt;p&gt;
&#20855;&#26377;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#30340;&#26292;&#38706;&#26426;&#21046;&#25551;&#36848;
&lt;/p&gt;
&lt;p&gt;
Strategyproofness-Exposing Mechanism Descriptions. (arXiv:2209.13148v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.13148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33756;&#21333;&#25551;&#36848;&#22312;&#23637;&#31034;&#26426;&#21046;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33756;&#21333;&#25551;&#36848;&#20197;&#20004;&#20010;&#27493;&#39588;&#21521;&#29609;&#23478;i&#23637;&#31034;&#26426;&#21046;&#12290;&#31532;&#19968;&#27493;&#20351;&#29992;&#20854;&#20182;&#29609;&#23478;&#30340;&#25253;&#21578;&#25551;&#36848;i&#30340;&#33756;&#21333;&#65306;&#21363;i&#30340;&#28508;&#22312;&#32467;&#26524;&#38598;&#21512;&#12290;&#31532;&#20108;&#27493;&#20351;&#29992;i&#30340;&#25253;&#21578;&#20174;&#22905;&#30340;&#33756;&#21333;&#20013;&#36873;&#25321;i&#26368;&#21916;&#27426;&#30340;&#32467;&#26524;&#12290;&#33756;&#21333;&#25551;&#36848;&#33021;&#26356;&#22909;&#22320;&#26292;&#38706;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#21527;&#65292;&#32780;&#19981;&#20250;&#29306;&#29298;&#31616;&#21333;&#24615;&#65311;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#19982;&#20854;&#20182;&#24120;&#35265;&#30340;&#21305;&#37197;&#26426;&#21046;&#30456;&#27604;&#65292;&#36825;&#31181;&#33756;&#21333;&#25551;&#36848;&#24517;&#39035;&#19982;&#30456;&#24212;&#30340;&#20256;&#32479;&#25551;&#36848;&#26377;&#30528;&#23454;&#36136;&#24615;&#30340;&#19981;&#21516;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#20004;&#31181;&#22522;&#26412;&#26426;&#21046;&#30340;&#23454;&#39564;&#23460;&#23454;&#39564;&#35777;&#26126;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
A menu description presents a mechanism to player $i$ in two steps. Step (1) uses the reports of other players to describe $i$'s menu: the set of $i$'s potential outcomes. Step (2) uses $i$'s report to select $i$'s favorite outcome from her menu. Can menu descriptions better expose strategyproofness, without sacrificing simplicity? We propose a new, simple menu description of Deferred Acceptance. We prove that -- in contrast with other common matching mechanisms -- this menu description must differ substantially from the corresponding traditional description. We demonstrate, with a lab experiment on two elementary mechanisms, the promise and challenges of menu descriptions.
&lt;/p&gt;</description></item></channel></rss>