<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#20998;&#37197;&#21338;&#24328;&#30340;&#26356;&#21152;&#20844;&#24179;&#26680;&#20998;&#37197;&#30340;&#32452;&#21512;&#22810;&#39033;&#24335;&#26102;&#38388;&#26426;&#21046;&#12290;</title><link>https://arxiv.org/abs/2402.11437</link><description>&lt;p&gt;
&#12298;&#20998;&#37197;&#21338;&#24328;&#65306;&#20844;&#24179;&#26680;&#20998;&#37197;&#30340;&#26032;&#26426;&#21046;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Assignment Game: New Mechanisms for Equitable Core Imputations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#20998;&#37197;&#21338;&#24328;&#30340;&#26356;&#21152;&#20844;&#24179;&#26680;&#20998;&#37197;&#30340;&#32452;&#21512;&#22810;&#39033;&#24335;&#26102;&#38388;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#12298;&#20998;&#37197;&#21338;&#24328;&#12299;&#30340;&#26680;&#20998;&#37197;&#38598;&#24418;&#25104;&#19968;&#20010;&#65288;&#38750;&#26377;&#38480;&#65289;&#20998;&#37197;&#26684;&#12290;&#36804;&#20170;&#20026;&#27490;&#65292;&#20165;&#24050;&#30693;&#26377;&#25928;&#31639;&#27861;&#29992;&#20110;&#35745;&#31639;&#20854;&#20004;&#20010;&#26497;&#31471;&#20998;&#37197;&#65307;&#20294;&#26159;&#65292;&#20854;&#20013;&#27599;&#19968;&#20010;&#37117;&#26368;&#22823;&#31243;&#24230;&#22320;&#20559;&#34962;&#19968;&#20010;&#26041;&#65292;&#19981;&#21033;&#20110;&#21452;&#26041;&#30340;&#20998;&#37197;&#65292;&#23548;&#33268;&#30408;&#21033;&#19981;&#22343;&#34913;&#12290;&#21478;&#19968;&#20010;&#38382;&#39064;&#26159;&#65292;&#30001;&#19968;&#20010;&#29609;&#23478;&#32452;&#25104;&#30340;&#23376;&#32852;&#30431;&#65288;&#25110;&#32773;&#26469;&#33258;&#20998;&#37197;&#20004;&#20391;&#30340;&#19968;&#31995;&#29609;&#23478;&#65289;&#21487;&#20197;&#33719;&#24471;&#38646;&#21033;&#28070;&#65292;&#22240;&#27492;&#26680;&#20998;&#37197;&#19981;&#24517;&#32473;&#20104;&#20182;&#20204;&#20219;&#20309;&#21033;&#28070;&#12290;&#22240;&#27492;&#65292;&#26680;&#20998;&#37197;&#22312;&#20010;&#20307;&#20195;&#29702;&#20154;&#23618;&#38754;&#19978;&#19981;&#25552;&#20379;&#20219;&#20309;&#20844;&#24179;&#24615;&#20445;&#35777;&#12290;&#36825;&#24341;&#20986;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#22914;&#20309;&#35745;&#31639;&#26356;&#20844;&#24179;&#30340;&#26680;&#20998;&#37197;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#35745;&#31639;&#20998;&#37197;&#21338;&#24328;&#30340;Leximin&#21644;Leximax&#26680;&#20998;&#37197;&#30340;&#32452;&#21512;&#65288;&#21363;&#65292;&#35813;&#26426;&#21046;&#19981;&#28041;&#21450;LP&#27714;&#35299;&#22120;&#65289;&#22810;&#39033;&#24335;&#26102;&#38388;&#26426;&#21046;&#12290;&#36825;&#20123;&#20998;&#37197;&#20197;&#19981;&#21516;&#26041;&#24335;&#23454;&#29616;&#20102;&#8220;&#20844;&#24179;&#24615;&#8221;&#65306;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11437v1 Announce Type: cross  Abstract: The set of core imputations of the assignment game forms a (non-finite) distributive lattice. So far, efficient algorithms were known for computing only its two extreme imputations; however, each of them maximally favors one side and disfavors the other side of the bipartition, leading to inequitable profit sharing. Another issue is that a sub-coalition consisting of one player (or a set of players from the same side of the bipartition) can make zero profit, therefore a core imputation is not obliged to give them any profit. Hence core imputations make no fairness guarantee at the level of individual agents. This raises the question of computing {\em more equitable core imputations}.   In this paper, we give combinatorial (i.e., the mechanism does not invoke an LP-solver) polynomial time mechanisms for computing the leximin and leximax core imputations for the assignment game. These imputations achieve ``fairness'' in different ways: w
&lt;/p&gt;</description></item></channel></rss>