<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#37325;&#22797;&#21338;&#24328;&#20013;&#65292;&#37319;&#29992;&#26080;&#24724;&#24615;&#31574;&#30053;&#30340;&#29609;&#23478;&#21019;&#36896;&#30340;&#32852;&#21512;&#32463;&#39564;&#20998;&#24067;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22522;&#20934;&#19968;&#33268;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#22312;&#20801;&#35768;&#30340;&#34892;&#21160;&#21464;&#21270;&#27425;&#25968;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#20445;&#35777;&#20102;&#26368;&#20339;&#21160;&#24577;&#34892;&#21160;&#24207;&#21015;&#30340;&#34920;&#29616;&#12290;&#22312;&#26102;&#38388;&#36275;&#22815;&#38271;&#26102;&#65292;&#25152;&#26377;&#29609;&#23478;&#37319;&#29992;&#35813;&#31574;&#30053;&#21518;&#23558;&#20986;&#29616;&#30456;&#21516;&#30340;&#32463;&#39564;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2212.03152</link><description>&lt;p&gt;
&#22312;&#26080;&#25034;&#24724;&#31574;&#30053;&#19979;&#30340;&#37325;&#22797;&#21338;&#24328;&#20013;&#30340;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Equilibria in Repeated Games under No-Regret with Dynamic Benchmarks. (arXiv:2212.03152v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.03152
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#37325;&#22797;&#21338;&#24328;&#20013;&#65292;&#37319;&#29992;&#26080;&#24724;&#24615;&#31574;&#30053;&#30340;&#29609;&#23478;&#21019;&#36896;&#30340;&#32852;&#21512;&#32463;&#39564;&#20998;&#24067;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22522;&#20934;&#19968;&#33268;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#22312;&#20801;&#35768;&#30340;&#34892;&#21160;&#21464;&#21270;&#27425;&#25968;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#20445;&#35777;&#20102;&#26368;&#20339;&#21160;&#24577;&#34892;&#21160;&#24207;&#21015;&#30340;&#34920;&#29616;&#12290;&#22312;&#26102;&#38388;&#36275;&#22815;&#38271;&#26102;&#65292;&#25152;&#26377;&#29609;&#23478;&#37319;&#29992;&#35813;&#31574;&#30053;&#21518;&#23558;&#20986;&#29616;&#30456;&#21516;&#30340;&#32463;&#39564;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37325;&#22797;&#21338;&#24328;&#20013;&#65292;&#31574;&#30053;&#36890;&#24120;&#36890;&#36807;&#23427;&#20204;&#33021;&#21542;&#20445;&#35777;&#20107;&#21518;&#36873;&#25321;&#30340;&#26368;&#20339;&#34892;&#21160;&#30340;&#34920;&#29616;&#26469;&#36827;&#34892;&#35780;&#20272;&#65292;&#36825;&#34987;&#31216;&#20026;Hannan&#19968;&#33268;&#24615;&#25110;&#26080;&#24724;&#24615;&#12290;&#28982;&#32780;&#65292;&#21333;&#20010;&#26368;&#20339;&#34892;&#21160;&#20316;&#20026;&#35780;&#20272;&#31574;&#30053;&#30340;&#22522;&#20934;&#30340;&#26377;&#25928;&#24615;&#26159;&#26377;&#38480;&#30340;&#65292;&#22240;&#20026;&#22312;&#24120;&#35265;&#30340;&#21160;&#24577;&#29615;&#22659;&#20013;&#65292;&#20219;&#20309;&#38745;&#24577;&#34892;&#21160;&#21487;&#33021;&#34920;&#29616;&#19981;&#20339;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#36716;&#21521;&#20102;&#26356;&#20026;&#23439;&#22823;&#30340;&#8220;&#21160;&#24577;&#22522;&#20934;&#19968;&#33268;&#24615;&#8221;&#27010;&#24565;&#65292;&#23427;&#20445;&#35777;&#20102;&#36873;&#25321;&#20107;&#21518;&#30340;&#26368;&#20339;&#8220;&#21160;&#24577;&#8221;&#34892;&#21160;&#24207;&#21015;&#30340;&#34920;&#29616;&#65292;&#21516;&#26102;&#23545;&#20801;&#35768;&#30340;&#34892;&#21160;&#21464;&#21270;&#27425;&#25968;&#26377;&#38480;&#21046;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#25152;&#26377;&#29609;&#23478;&#37117;&#37319;&#29992;&#26080;&#24724;&#31574;&#30053;&#21487;&#33021;&#20986;&#29616;&#30340;&#20219;&#20309;&#32852;&#21512;&#32463;&#39564;&#20998;&#24067;&#65292;&#23384;&#22312;&#21160;&#24577;&#22522;&#20934;&#19968;&#33268;&#31574;&#30053;&#65292;&#22914;&#26524;&#25152;&#26377;&#29609;&#23478;&#37117;&#37319;&#29992;&#36825;&#20123;&#31574;&#30053;&#65292;&#24403;&#26102;&#38388;&#36275;&#22815;&#38271;&#26102;&#65292;&#23558;&#20986;&#29616;&#30456;&#21516;&#30340;&#32463;&#39564;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;
In repeated games, strategies are often evaluated by their ability to guarantee the performance of the single best action that is selected in hindsight, a property referred to as \emph{Hannan consistency}, or \emph{no-regret}. However, the effectiveness of the single best action as a yardstick to evaluate strategies is limited, as any static action may perform poorly in common dynamic settings. Our work therefore turns to a more ambitious notion of \emph{dynamic benchmark consistency}, which guarantees the performance of the best \emph{dynamic} sequence of actions, selected in hindsight subject to a constraint on the allowable number of action changes. Our main result establishes that for any joint empirical distribution of play that may arise when all players deploy no-regret strategies, there exist dynamic benchmark consistent strategies such that if all players deploy these strategies the same empirical distribution emerges when the horizon is large enough. This result demonstrates 
&lt;/p&gt;</description></item></channel></rss>