<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#36890;&#36807;&#21487;&#23398;&#20064;&#30340;&#23616;&#37096;&#32593;&#26684;&#21464;&#24418;&#25216;&#26415;&#65292;HeadEvolver&#26694;&#26550;&#21487;&#20197;&#36890;&#36807;&#25991;&#26412;&#24341;&#23548;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#22836;&#37096;&#22836;&#20687;&#65292;&#20445;&#30041;&#32454;&#33410;&#24182;&#25903;&#25345;&#32534;&#36753;&#21644;&#21160;&#30011;&#12290;</title><link>https://arxiv.org/abs/2403.09326</link><description>&lt;p&gt;
HeadEvolver&#65306;&#36890;&#36807;&#26412;&#22320;&#21487;&#23398;&#20064;&#32593;&#26684;&#21464;&#24418;&#23454;&#29616;&#25991;&#26412;&#21040;&#22836;&#37096;&#22836;&#20687;&#30340;&#36716;&#25442;
&lt;/p&gt;
&lt;p&gt;
HeadEvolver: Text to Head Avatars via Locally Learnable Mesh Deformation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09326
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21487;&#23398;&#20064;&#30340;&#23616;&#37096;&#32593;&#26684;&#21464;&#24418;&#25216;&#26415;&#65292;HeadEvolver&#26694;&#26550;&#21487;&#20197;&#36890;&#36807;&#25991;&#26412;&#24341;&#23548;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#22836;&#37096;&#22836;&#20687;&#65292;&#20445;&#30041;&#32454;&#33410;&#24182;&#25903;&#25345;&#32534;&#36753;&#21644;&#21160;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;HeadEvolver&#65292;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#36890;&#36807;&#25991;&#26412;&#24341;&#23548;&#29983;&#25104;&#39118;&#26684;&#21270;&#30340;&#22836;&#37096;&#22836;&#20687;&#12290;HeadEvolver&#20351;&#29992;&#27169;&#26495;&#22836;&#37096;&#32593;&#26684;&#30340;&#26412;&#22320;&#21487;&#23398;&#20064;&#32593;&#26684;&#21464;&#24418;&#65292;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#25968;&#23383;&#36164;&#20135;&#65292;&#20197;&#23454;&#29616;&#20445;&#30041;&#32454;&#33410;&#30340;&#32534;&#36753;&#21644;&#21160;&#30011;&#12290;&#20026;&#20102;&#35299;&#20915;&#20840;&#23616;&#21464;&#24418;&#20013;&#32570;&#20047;&#32454;&#31890;&#24230;&#21644;&#35821;&#20041;&#24863;&#30693;&#26412;&#22320;&#24418;&#29366;&#25511;&#21046;&#30340;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#21487;&#35757;&#32451;&#21442;&#25968;&#20316;&#20026;&#27599;&#20010;&#19977;&#35282;&#24418;&#30340;Jacobi&#30697;&#38453;&#30340;&#21152;&#26435;&#22240;&#23376;&#65292;&#20197;&#33258;&#36866;&#24212;&#22320;&#25913;&#21464;&#26412;&#22320;&#24418;&#29366;&#21516;&#26102;&#20445;&#25345;&#20840;&#23616;&#23545;&#24212;&#21644;&#38754;&#37096;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#20026;&#20102;&#30830;&#20445;&#26469;&#33258;&#19981;&#21516;&#35270;&#35282;&#30340;&#32467;&#26524;&#24418;&#29366;&#21644;&#22806;&#35266;&#30340;&#36830;&#36143;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#39044;&#35757;&#32451;&#30340;&#22270;&#20687;&#25193;&#25955;&#27169;&#22411;&#36827;&#34892;&#21487;&#24494;&#20998;&#28210;&#26579;&#65292;&#24182;&#28155;&#21152;&#27491;&#21017;&#21270;&#39033;&#20197;&#22312;&#25991;&#26412;&#24341;&#23548;&#19979;&#20248;&#21270;&#21464;&#24418;&#12290;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#29983;&#25104;&#20855;&#26377;&#20851;&#33410;&#32593;&#26684;&#30340;&#22810;&#26679;&#21270;&#22836;&#37096;&#22836;&#20687;&#65292;&#21487;&#26080;&#32541;&#32534;&#36753;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09326v1 Announce Type: cross  Abstract: We present HeadEvolver, a novel framework to generate stylized head avatars from text guidance. HeadEvolver uses locally learnable mesh deformation from a template head mesh, producing high-quality digital assets for detail-preserving editing and animation. To tackle the challenges of lacking fine-grained and semantic-aware local shape control in global deformation through Jacobians, we introduce a trainable parameter as a weighting factor for the Jacobian at each triangle to adaptively change local shapes while maintaining global correspondences and facial features. Moreover, to ensure the coherence of the resulting shape and appearance from different viewpoints, we use pretrained image diffusion models for differentiable rendering with regularization terms to refine the deformation under text guidance. Extensive experiments demonstrate that our method can generate diverse head avatars with an articulated mesh that can be edited seaml
&lt;/p&gt;</description></item></channel></rss>