<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#26412;&#25991;&#23545;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#22312;&#22810;&#27169;&#24577;&#23398;&#20064;&#20013;&#30340;&#24212;&#29992;&#36827;&#34892;&#20102;&#20840;&#38754;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#22235;&#31181;&#19981;&#21516;&#30340;&#31574;&#30053;&#20197;&#23558;&#31532;&#20108;&#27169;&#24577;&#65288;&#38750;RGB&#65289;&#32435;&#20837;NeRFs&#20013;&#65292;&#36890;&#36807;&#36873;&#25321;&#28909;&#25104;&#20687;&#20316;&#20026;&#31532;&#20108;&#27169;&#24577;&#26469;&#25361;&#25112;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#30340;&#25972;&#21512;&#12290;</title><link>https://arxiv.org/abs/2403.11865</link><description>&lt;p&gt;
&#21033;&#29992;&#28909;&#25104;&#20687;&#25506;&#32034;&#22810;&#27169;&#24577;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#24182;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Exploring Multi-modal Neural Scene Representations With Applications on Thermal Imaging
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#22312;&#22810;&#27169;&#24577;&#23398;&#20064;&#20013;&#30340;&#24212;&#29992;&#36827;&#34892;&#20102;&#20840;&#38754;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#22235;&#31181;&#19981;&#21516;&#30340;&#31574;&#30053;&#20197;&#23558;&#31532;&#20108;&#27169;&#24577;&#65288;&#38750;RGB&#65289;&#32435;&#20837;NeRFs&#20013;&#65292;&#36890;&#36807;&#36873;&#25321;&#28909;&#25104;&#20687;&#20316;&#20026;&#31532;&#20108;&#27169;&#24577;&#26469;&#25361;&#25112;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#30340;&#25972;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#36752;&#23556;&#22330;&#65288;NeRFs&#65289;&#22312;&#19968;&#32452;RGB&#22270;&#20687;&#19978;&#35757;&#32451;&#26102;&#36805;&#36895;&#21457;&#23637;&#20026;&#26032;&#30340;&#20107;&#23454;&#26631;&#20934;&#65292;&#29992;&#20110;&#26032;&#35270;&#35282;&#21512;&#25104;&#20219;&#21153;&#12290;&#26412;&#25991;&#22312;&#22810;&#27169;&#24577;&#23398;&#20064;&#30340;&#32972;&#26223;&#19979;&#23545;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#65288;&#22914;NeRFs&#65289;&#36827;&#34892;&#20102;&#20840;&#38754;&#35780;&#20272;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#31181;&#19981;&#21516;&#30340;&#31574;&#30053;&#65292;&#29992;&#20110;&#22914;&#20309;&#23558;&#31532;&#20108;&#27169;&#24577;&#65288;&#38750;RGB&#65289;&#32435;&#20837;NeRFs&#20013;&#65306;&#65288;1&#65289;&#29420;&#31435;&#22320;&#20174;&#22836;&#35757;&#32451;&#27599;&#31181;&#27169;&#24577;&#65307;&#65288;2&#65289;&#22312;RGB&#19978;&#36827;&#34892;&#39044;&#35757;&#32451;&#65292;&#28982;&#21518;&#22312;&#31532;&#20108;&#27169;&#24577;&#19978;&#36827;&#34892;&#24494;&#35843;&#65307;&#65288;3&#65289;&#28155;&#21152;&#31532;&#20108;&#20998;&#25903;&#65307;&#65288;4&#65289;&#28155;&#21152;&#19968;&#20010;&#21333;&#29420;&#30340;&#32452;&#20214;&#26469;&#39044;&#27979;&#65288;&#39068;&#33394;&#65289;&#39069;&#22806;&#27169;&#24577;&#30340;&#20540;&#12290;&#25105;&#20204;&#36873;&#25321;&#20102;&#28909;&#25104;&#20687;&#20316;&#20026;&#31532;&#20108;&#27169;&#24577;&#65292;&#22240;&#20026;&#20174;&#36752;&#23556;&#24230;&#26469;&#30475;&#65292;&#23427;&#19982;RGB&#26377;&#24456;&#22823;&#24046;&#24322;&#65292;&#36825;&#20351;&#24471;&#23558;&#20854;&#25972;&#21512;&#21040;&#31070;&#32463;&#22330;&#26223;&#34920;&#31034;&#20013;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11865v1 Announce Type: cross  Abstract: Neural Radiance Fields (NeRFs) quickly evolved as the new de-facto standard for the task of novel view synthesis when trained on a set of RGB images. In this paper, we conduct a comprehensive evaluation of neural scene representations, such as NeRFs, in the context of multi-modal learning. Specifically, we present four different strategies of how to incorporate a second modality, other than RGB, into NeRFs: (1) training from scratch independently on both modalities; (2) pre-training on RGB and fine-tuning on the second modality; (3) adding a second branch; and (4) adding a separate component to predict (color) values of the additional modality. We chose thermal imaging as second modality since it strongly differs from RGB in terms of radiosity, making it challenging to integrate into neural scene representations. For the evaluation of the proposed strategies, we captured a new publicly available multi-view dataset, ThermalMix, consisti
&lt;/p&gt;</description></item></channel></rss>