<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.06000</link><description>&lt;p&gt;
&#40723;&#21169;&#25968;&#25454;&#20849;&#20139;&#20197;&#36827;&#34892;&#33021;&#28304;&#39044;&#27979;&#65306;&#20855;&#26377;&#30456;&#20851;&#25968;&#25454;&#30340;&#20998;&#26512;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Incentivizing Data Sharing for Energy Forecasting: Analytics Markets with Correlated Data. (arXiv:2310.06000v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06000
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#22320;&#39044;&#27979;&#19981;&#30830;&#23450;&#30340;&#30005;&#21147;&#20135;&#37327;&#23545;&#20110;&#30005;&#21147;&#24066;&#22330;&#30340;&#31038;&#20250;&#31119;&#21033;&#20855;&#26377;&#30410;&#22788;&#65292;&#21487;&#20197;&#20943;&#23569;&#24179;&#34913;&#36164;&#28304;&#30340;&#38656;&#27714;&#12290;&#23558;&#36825;&#31181;&#39044;&#27979;&#25551;&#36848;&#20026;&#19968;&#39033;&#20998;&#26512;&#20219;&#21153;&#65292;&#24403;&#21069;&#25991;&#29486;&#25552;&#20986;&#20102;&#20197;&#20998;&#26512;&#24066;&#22330;&#20316;&#20026;&#28608;&#21169;&#25163;&#27573;&#26469;&#25913;&#21892;&#31934;&#24230;&#30340;&#25968;&#25454;&#20849;&#20139;&#26041;&#27861;&#65292;&#20363;&#22914;&#21033;&#29992;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;&#25361;&#25112;&#22312;&#20110;&#65292;&#24403;&#30456;&#20851;&#25968;&#25454;&#29992;&#20316;&#39044;&#27979;&#30340;&#36755;&#20837;&#29305;&#24449;&#26102;&#65292;&#37325;&#21472;&#20449;&#24687;&#30340;&#20215;&#20540;&#22312;&#20110;&#25910;&#20837;&#20998;&#37197;&#26041;&#38754;&#20351;&#24066;&#22330;&#35774;&#35745;&#22797;&#26434;&#21270;&#65292;&#22240;&#20026;&#36825;&#31181;&#20215;&#20540;&#22312;&#26412;&#36136;&#19978;&#26159;&#32452;&#21512;&#30340;&#12290;&#25105;&#20204;&#20026;&#39118;&#21147;&#39044;&#27979;&#24212;&#29992;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#12290;&#20026;&#20102;&#20998;&#37197;&#25910;&#20837;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#22522;&#20110;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#65292;&#23558;&#20195;&#29702;&#20154;&#30340;&#29305;&#24449;&#35270;&#20026;&#29609;&#23478;&#65292;&#23558;&#20182;&#20204;&#30340;&#30456;&#20114;&#20316;&#29992;&#35270;&#20026;&#19968;&#20010;&#29305;&#24449;&#20989;&#25968;&#21338;&#24328;&#12290;&#25105;&#20204;&#35828;&#26126;&#20102;&#25551;&#36848;&#36825;&#31181;&#21338;&#24328;&#30340;&#22810;&#31181;&#36873;&#39033;&#65292;&#27599;&#20010;&#36873;&#39033;&#37117;&#26377;&#22240;&#26524;&#32454;&#24494;&#24046;&#21035;&#65292;&#24433;&#21709;&#30528;&#29305;&#24449;&#30456;&#20851;&#26102;&#30340;&#24066;&#22330;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reliably forecasting uncertain power production is beneficial for the social welfare of electricity markets by reducing the need for balancing resources. Describing such forecasting as an analytics task, the current literature proposes analytics markets as an incentive for data sharing to improve accuracy, for instance by leveraging spatio-temporal correlations. The challenge is that, when used as input features for forecasting, correlated data complicates the market design with respect to the revenue allocation, as the value of overlapping information is inherently combinatorial. We develop a correlation-aware analytics market for a wind power forecasting application. To allocate revenue, we adopt a Shapley value-based attribution policy, framing the features of agents as players and their interactions as a characteristic function game. We illustrate that there are multiple options to describe such a game, each having causal nuances that influence market behavior when features are cor
&lt;/p&gt;</description></item></channel></rss>