<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#21322;&#30701;&#35270;&#27169;&#24335;&#19979;&#65292;&#20174;&#26102;&#38388;&#25240;&#25187;&#20132;&#26131;&#20013;&#36827;&#34892;&#31454;&#20105;&#24615;&#25910;&#20837;&#25552;&#21462;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#30740;&#31350;&#29616;&#26377;&#30340;&#25968;&#25454;&#21253;&#35843;&#24230;&#26041;&#27861;&#65292;&#21457;&#29616;&#22312;&#26356;&#19968;&#33324;&#30340;&#25240;&#25187;&#35774;&#23450;&#19979;&#34920;&#29616;&#19981;&#20339;&#12290;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#12289;&#31616;&#21333;&#12289;&#26080;&#35760;&#24518;&#19988;&#26368;&#20248;&#30340;&#30830;&#23450;&#24615;&#31639;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.08549</link><description>&lt;p&gt;
&#22312;&#21322;&#30701;&#35270;&#27169;&#24335;&#20013;&#20174;&#26102;&#38388;&#25240;&#25187;&#20132;&#26131;&#20013;&#36827;&#34892;&#31454;&#20105;&#24615;&#25910;&#20837;&#25552;&#21462;
&lt;/p&gt;
&lt;p&gt;
Competitive Revenue Extraction from Time-Discounted Transactions in the Semi-Myopic Regime
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08549
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#21322;&#30701;&#35270;&#27169;&#24335;&#19979;&#65292;&#20174;&#26102;&#38388;&#25240;&#25187;&#20132;&#26131;&#20013;&#36827;&#34892;&#31454;&#20105;&#24615;&#25910;&#20837;&#25552;&#21462;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#30740;&#31350;&#29616;&#26377;&#30340;&#25968;&#25454;&#21253;&#35843;&#24230;&#26041;&#27861;&#65292;&#21457;&#29616;&#22312;&#26356;&#19968;&#33324;&#30340;&#25240;&#25187;&#35774;&#23450;&#19979;&#34920;&#29616;&#19981;&#20339;&#12290;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#12289;&#31616;&#21333;&#12289;&#26080;&#35760;&#24518;&#19988;&#26368;&#20248;&#30340;&#30830;&#23450;&#24615;&#31639;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25955;&#30340;&#21152;&#23494;&#36135;&#24065;&#26159;&#20381;&#38752;&#29992;&#25143;&#21644;&#30719;&#24037;&#30340;&#28608;&#21169;&#26426;&#21046;&#26469;&#27491;&#30830;&#36816;&#20316;&#24182;&#20026;&#29992;&#25143;&#25552;&#20379;&#39640;&#36136;&#37327;&#26381;&#21153;&#30340;&#25903;&#20184;&#31995;&#32479;&#12290;&#26368;&#36817;&#30340;&#25991;&#29486;&#30740;&#31350;&#20102;&#20316;&#20026;&#21152;&#23494;&#36135;&#24065;&#20132;&#26131;&#36153;&#26426;&#21046; (TFM) &#30340;&#25293;&#21334;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#23545;&#30719;&#24037;&#36827;&#34892;&#38750;&#30701;&#35270;&#24314;&#27169;&#19982;&#21478;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#38382;&#39064;&#38750;&#24120;&#25509;&#36817;&#65306;&#25968;&#25454;&#21253;&#20132;&#25442;&#30340;&#22312;&#32447;&#32531;&#20914;&#31649;&#29702;&#38382;&#39064;&#12290;&#20027;&#35201;&#30340;&#21306;&#21035;&#22312;&#20110;&#65292;&#22312;&#37329;&#34701;&#29615;&#22659;&#20013;&#65292;&#29992;&#25143;&#30340;&#20559;&#22909;&#65288;&#22240;&#27492;&#26159;&#25910;&#20837;&#25552;&#21462;&#65289;&#21487;&#33021;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#29305;&#23450;&#25240;&#25187;&#29575;&#19979;&#32473;&#20986;&#30340;&#31454;&#20105;&#27604;&#29575;&#20445;&#35777;&#65292;&#24182;&#23637;&#31034;&#20102;&#29616;&#26377;&#30340;&#25968;&#25454;&#21253;&#35843;&#24230;&#26041;&#27861;&#22312;&#26356;&#19968;&#33324;&#30340;&#25240;&#25187;&#35774;&#23450;&#19979;&#34920;&#29616;&#19981;&#20339;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#26080;&#25240;&#25187;&#24773;&#20917;&#8221;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#19968;&#31181;&#26032;&#39062;&#12289;&#31616;&#21333;&#12289;&#26080;&#35760;&#24518;&#19988;&#26368;&#20248;&#30340;&#30830;&#23450;&#24615;&#31639;&#27861;&#65292;&#36866;&#29992;&#20110;&#21322;&#30701;&#35270;&#24773;&#20917;&#65292;&#24403;&#29992;&#25143;&#30340;&#20132;&#26131;&#20215;&#20540;&#26681;&#25454;&#26102;&#38388;&#32780;&#21464;&#21270;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized cryptocurrencies are payment systems that rely on aligning the incentives of users and miners to operate correctly and offer a high quality of service to users. Recent literature studies the mechanism design problem of the auction serving as a cryptocurrency's transaction fee mechanism (TFM). We find that a non-myopic modelling of miners falls close to another well-known problem: that of online buffer management for packet switching. The main difference is that unlike packets which are of a fixed size throughout their lifetime, in a financial environment, user preferences (and therefore revenue extraction) may be time-dependent. We study the competitive ratio guarantees given a certain discount rate, and show how existing methods from packet scheduling, which we call "the undiscounted case", perform suboptimally in the more general discounted setting. Most notably, we find a novel, simple, memoryless, and optimal deterministic algorithm for the semi-myopic case, when the 
&lt;/p&gt;</description></item></channel></rss>