<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#19968;&#31181;&#22522;&#20110;&#31890;&#23376;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;&#20855;&#26377;&#36830;&#32493;&#32431;&#31574;&#30053;&#38598;&#21644;&#23545;&#25910;&#30410;&#20989;&#25968;&#30340;&#19968;&#38454;&#35775;&#38382;&#30340;&#20004;&#20154;&#38646;&#21644;&#21338;&#24328;&#30340;&#28151;&#21512;&#32435;&#20160;&#22343;&#34913;&#38382;&#39064;&#65292;&#24182;&#22312;&#28385;&#36275;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#20174;&#20219;&#20309;&#21021;&#22987;&#21270;&#25351;&#25968;&#25910;&#25947;&#20110;&#20934;&#30830;&#30340;&#35299;&#12290;</title><link>http://arxiv.org/abs/2211.01280</link><description>&lt;p&gt;
&#19968;&#31181;&#36830;&#32493;&#21338;&#24328;&#28151;&#21512;&#32435;&#20160;&#22343;&#34913;&#30340;&#25351;&#25968;&#25910;&#25947;&#31890;&#23376;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
An Exponentially Converging Particle Method for the Mixed Nash Equilibrium of Continuous Games. (arXiv:2211.01280v3 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.01280
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#19968;&#31181;&#22522;&#20110;&#31890;&#23376;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;&#20855;&#26377;&#36830;&#32493;&#32431;&#31574;&#30053;&#38598;&#21644;&#23545;&#25910;&#30410;&#20989;&#25968;&#30340;&#19968;&#38454;&#35775;&#38382;&#30340;&#20004;&#20154;&#38646;&#21644;&#21338;&#24328;&#30340;&#28151;&#21512;&#32435;&#20160;&#22343;&#34913;&#38382;&#39064;&#65292;&#24182;&#22312;&#28385;&#36275;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#20174;&#20219;&#20309;&#21021;&#22987;&#21270;&#25351;&#25968;&#25910;&#25947;&#20110;&#20934;&#30830;&#30340;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#35299;&#20915;&#20855;&#26377;&#36830;&#32493;&#32431;&#31574;&#30053;&#38598;&#21644;&#23545;&#25910;&#30410;&#20989;&#25968;&#30340;&#19968;&#38454;&#35775;&#38382;&#30340;&#20004;&#20154;&#38646;&#21644;&#21338;&#24328;&#30340;&#28151;&#21512;&#32435;&#20160;&#22343;&#34913;&#35745;&#31639;&#38382;&#39064;&#12290;&#35813;&#38382;&#39064;&#22312;&#20197;&#21338;&#24328;&#29702;&#35770;&#20026;&#28789;&#24863;&#30340;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#20986;&#29616;&#65292;&#22914;&#20998;&#24067;&#24335;&#31283;&#20581;&#23398;&#20064;&#12290;&#22312;&#36825;&#20123;&#24212;&#29992;&#20013;&#65292;&#31574;&#30053;&#38598;&#26159;&#39640;&#32500;&#30340;&#65292;&#22240;&#27492;&#22522;&#20110;&#31163;&#25955;&#21270;&#30340;&#26041;&#27861;&#19981;&#33021;&#36820;&#22238;&#39640;&#31934;&#24230;&#30340;&#35299;&#12290;&#26412;&#25991;&#24341;&#20837;&#24182;&#20998;&#26512;&#20102;&#19968;&#31181;&#22522;&#20110;&#31890;&#23376;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#38024;&#23545;&#27492;&#38382;&#39064;&#20855;&#26377;&#20445;&#35777;&#30340;&#23616;&#37096;&#25910;&#25947;&#24615;&#12290;&#35813;&#26041;&#27861;&#23558;&#28151;&#21512;&#31574;&#30053;&#21442;&#25968;&#21270;&#20026;&#21407;&#23376;&#27979;&#24230;&#65292;&#24182;&#23545;&#21407;&#23376;&#30340;&#26435;&#37325;&#21644;&#20301;&#32622;&#24212;&#29992;&#36817;&#31471;&#28857;&#26356;&#26032;&#12290;&#23427;&#21487;&#20197;&#34987;&#35299;&#37322;&#20026;&#8220;&#30456;&#20114;&#20316;&#29992;&#8221;Wasserstein-Fisher-Rao&#26799;&#24230;&#27969;&#30340;&#26102;&#38388;&#38544;&#24335;&#31163;&#25955;&#21270;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#38750;&#36864;&#21270;&#30340;&#20551;&#35774;&#19979;&#65292;&#35813;&#26041;&#27861;&#20174;&#20219;&#20309;&#21021;&#22987;&#21270;&#20197;&#25351;&#25968;&#36895;&#24230;&#25910;&#25947;&#20110;&#20934;&#30830;&#30340;&#28151;&#21512;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#25552;&#20379;&#25968;&#20540;&#23454;&#39564;&#26469;&#35828;&#26126;&#35813;&#26041;&#27861;&#30340;&#23454;&#38469;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of computing mixed Nash equilibria of two-player zero-sum games with continuous sets of pure strategies and with first-order access to the payoff function. This problem arises for example in game-theory-inspired machine learning applications, such as distributionally-robust learning. In those applications, the strategy sets are high-dimensional and thus methods based on discretisation cannot tractably return high-accuracy solutions.  In this paper, we introduce and analyze a particle-based method that enjoys guaranteed local convergence for this problem. This method consists in parametrizing the mixed strategies as atomic measures and applying proximal point updates to both the atoms' weights and positions. It can be interpreted as a time-implicit discretization of the "interacting" Wasserstein-Fisher-Rao gradient flow.  We prove that, under non-degeneracy assumptions, this method converges at an exponential rate to the exact mixed Nash equilibrium from any init
&lt;/p&gt;</description></item></channel></rss>