<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#27979;&#24066;&#22330;&#26426;&#21046;&#65292;&#20801;&#35768;&#22312;&#26080;&#27861;&#39564;&#35777;&#32467;&#26524;&#30340;&#24773;&#20917;&#19979;&#20174;&#19968;&#32452;&#20195;&#29702;&#20013;&#25910;&#38598;&#20449;&#24687;&#21644;&#27719;&#24635;&#39044;&#27979;&#65292;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23454;&#29616;&#33258;&#27835;&#20197;&#21450;&#36991;&#20813;&#20102;&#38656;&#36827;&#19968;&#27493;&#30340;&#39564;&#35777;&#25110;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.04305</link><description>&lt;p&gt;
&#26080;&#27861;&#39564;&#35777;&#32467;&#26524;&#30340;&#33258;&#21160;&#35299;&#20915;&#39044;&#27979;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Self-Resolving Prediction Markets for Unverifiable Outcomes. (arXiv:2306.04305v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04305
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#27979;&#24066;&#22330;&#26426;&#21046;&#65292;&#20801;&#35768;&#22312;&#26080;&#27861;&#39564;&#35777;&#32467;&#26524;&#30340;&#24773;&#20917;&#19979;&#20174;&#19968;&#32452;&#20195;&#29702;&#20013;&#25910;&#38598;&#20449;&#24687;&#21644;&#27719;&#24635;&#39044;&#27979;&#65292;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23454;&#29616;&#33258;&#27835;&#20197;&#21450;&#36991;&#20813;&#20102;&#38656;&#36827;&#19968;&#27493;&#30340;&#39564;&#35777;&#25110;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#24066;&#22330;&#36890;&#36807;&#26681;&#25454;&#39044;&#27979;&#26159;&#21542;&#25509;&#36817;&#21487;&#39564;&#35777;&#30340;&#26410;&#26469;&#32467;&#26524;&#21521;&#20195;&#29702;&#25903;&#20184;&#36153;&#29992;&#26469;&#28608;&#21169;&#21644;&#27719;&#24635;&#20449;&#24565;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#37325;&#35201;&#38382;&#39064;&#30340;&#32467;&#26524;&#38590;&#20197;&#39564;&#35777;&#25110;&#19981;&#21487;&#39564;&#35777;&#65292;&#22240;&#20026;&#21487;&#33021;&#24456;&#38590;&#25110;&#19981;&#21487;&#33021;&#33719;&#21462;&#23454;&#38469;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#32780;&#21448;&#19981;&#30452;&#35266;&#30340;&#32467;&#26524;&#65292;&#34920;&#26126;&#21487;&#20197;&#36890;&#36807;&#21521;&#20195;&#29702;&#25903;&#20184;&#20854;&#39044;&#27979;&#19982;&#31934;&#24515;&#36873;&#25321;&#30340;&#21442;&#32771;&#20195;&#29702;&#30340;&#39044;&#27979;&#20043;&#38388;&#30340;&#36127;&#20132;&#21449;&#29109;&#26469;&#36816;&#34892;&#19968;&#20010;&#949;-&#28608;&#21169;&#20860;&#23481;&#30340;&#39044;&#27979;&#24066;&#22330;&#65292;&#20174;&#20195;&#29702;&#27744;&#20013;&#33719;&#21462;&#20449;&#24687;&#24182;&#36827;&#34892;&#26377;&#25928;&#30340;&#27719;&#24635;&#65292;&#32780;&#19981;&#38656;&#35201;&#35266;&#23519;&#32467;&#26524;&#12290;&#25105;&#20204;&#30340;&#26426;&#21046;&#21033;&#29992;&#19968;&#20010;&#31163;&#32447;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#26681;&#25454;&#24066;&#22330;&#35774;&#35745;&#32773;&#24050;&#30693;&#30340;&#19968;&#32452;&#29305;&#24449;&#26469;&#39044;&#27979;&#32467;&#26524;&#65292;&#20174;&#32780;&#20351;&#24066;&#22330;&#33021;&#22815;&#22312;&#35266;&#23519;&#21040;&#32467;&#26524;&#21518;&#33258;&#34892;&#35299;&#20915;&#24182;&#31435;&#21363;&#21521;&#20195;&#29702;&#25903;&#20184;&#25253;&#37228;&#65292;&#32780;&#19981;&#38656;&#35201;&#36827;&#19968;&#27493;&#30340;&#39564;&#35777;&#25110;&#24178;&#39044;&#12290;&#25105;&#20204;&#23545;&#25105;&#20204;&#30340;&#26426;&#21046;&#30340;&#25928;&#29575;&#12289;&#28608;&#21169;&#20860;&#23481;&#24615;&#21644;&#25910;&#25947;&#24615;&#25552;&#20379;&#20102;&#29702;&#35770;&#20445;&#35777;&#65292;&#21516;&#26102;&#22312;&#20960;&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Prediction markets elicit and aggregate beliefs by paying agents based on how close their predictions are to a verifiable future outcome. However, outcomes of many important questions are difficult to verify or unverifiable, in that the ground truth may be hard or impossible to access. Examples include questions about causal effects where it is infeasible or unethical to run randomized trials; crowdsourcing and content moderation tasks where it is prohibitively expensive to verify ground truth; and questions asked over long time horizons, where the delay until the realization of the outcome skews agents' incentives to report their true beliefs. We present a novel and unintuitive result showing that it is possible to run an $\varepsilon-$incentive compatible prediction market to elicit and efficiently aggregate information from a pool of agents without observing the outcome by paying agents the negative cross-entropy between their prediction and that of a carefully chosen reference agen
&lt;/p&gt;</description></item></channel></rss>