<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22810;&#20154;&#28216;&#25103;&#20013;&#20551;&#21160;&#20316;&#30340;&#39318;&#27425;&#24418;&#24335;&#21270;&#12289;&#23454;&#29616;&#21644;&#23450;&#37327;&#35780;&#20272;&#65292;&#24182;&#35777;&#26126;&#20854;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#22870;&#21169;&#25910;&#30410;&#12289;&#22686;&#21152;&#28216;&#25103;&#22810;&#26679;&#24615;&#65292;&#19988;&#26102;&#38388;&#28040;&#32791;&#26041;&#38754;&#24320;&#38144;&#24456;&#23567;&#12290;</title><link>https://arxiv.org/abs/2403.07932</link><description>&lt;p&gt;
&#22810;&#20154;&#28216;&#25103;&#20013;&#30340;&#20551;&#21160;&#20316;
&lt;/p&gt;
&lt;p&gt;
Feint in Multi-Player Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07932
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22810;&#20154;&#28216;&#25103;&#20013;&#20551;&#21160;&#20316;&#30340;&#39318;&#27425;&#24418;&#24335;&#21270;&#12289;&#23454;&#29616;&#21644;&#23450;&#37327;&#35780;&#20272;&#65292;&#24182;&#35777;&#26126;&#20854;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#22870;&#21169;&#25910;&#30410;&#12289;&#22686;&#21152;&#28216;&#25103;&#22810;&#26679;&#24615;&#65292;&#19988;&#26102;&#38388;&#28040;&#32791;&#26041;&#38754;&#24320;&#38144;&#24456;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#23545;&#22810;&#20154;&#28216;&#25103;&#20013;&#30340;&#20551;&#21160;&#20316;&#36827;&#34892;&#20102;&#39318;&#27425;&#24418;&#24335;&#21270;&#12289;&#23454;&#29616;&#21644;&#23450;&#37327;&#35780;&#20272;&#12290;&#25105;&#20204;&#39318;&#20808;&#20174;&#22810;&#20154;&#28216;&#25103;&#30340;&#35282;&#24230;&#23545;&#20551;&#21160;&#20316;&#36827;&#34892;&#20102;&#24418;&#24335;&#21270;&#65292;&#28041;&#21450;&#21040;&#26102;&#38388;&#12289;&#31354;&#38388;&#21644;&#23427;&#20204;&#30340;&#38598;&#20307;&#24433;&#21709;&#12290;&#35813;&#24418;&#24335;&#21270;&#24314;&#31435;&#22312;&#38750;&#20256;&#36882;&#24615;&#20027;&#21160;&#39532;&#23572;&#21487;&#22827;&#28216;&#25103;&#27169;&#22411;&#20043;&#19978;&#65292;&#20854;&#20013;&#20551;&#21160;&#20316;&#33021;&#22815;&#20135;&#29983;&#21487;&#35266;&#30340;&#24433;&#21709;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#22810;&#20195;&#29702;&#24314;&#27169;&#30340;&#26368;&#26032;&#36827;&#23637;&#19979;&#65288;&#21363;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#65289;&#22312;&#22810;&#20154;&#28216;&#25103;&#20013;&#23454;&#26045;&#20551;&#21160;&#20316;&#30340;&#23454;&#38469;&#32454;&#33410;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23450;&#37327;&#26816;&#39564;&#20102;&#25105;&#20204;&#35774;&#35745;&#30340;&#26377;&#25928;&#24615;&#65292;&#32467;&#26524;&#26174;&#31034;&#25105;&#20204;&#30340;&#20551;&#21160;&#20316;&#35774;&#35745;&#21487;&#20197;&#65288;1&#65289;&#26174;&#33879;&#25552;&#39640;&#28216;&#25103;&#20013;&#30340;&#22870;&#21169;&#25910;&#30410;&#65307;&#65288;2&#65289;&#26174;&#33879;&#25552;&#39640;&#22810;&#20154;&#28216;&#25103;&#30340;&#22810;&#26679;&#24615;&#65307;&#20197;&#21450;&#65288;3&#65289;&#20165;&#22312;&#26102;&#38388;&#28040;&#32791;&#26041;&#38754;&#20135;&#29983;&#21487;&#24573;&#30053;&#30340;&#24320;&#38144;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#25105;&#20204;&#30340;&#20551;&#21160;&#20316;&#35774;&#35745;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07932v1 Announce Type: cross  Abstract: This paper introduces the first formalization, implementation and quantitative evaluation of Feint in Multi-Player Games. Our work first formalizes Feint from the perspective of Multi-Player Games, in terms of the temporal, spatial, and their collective impacts. The formalization is built upon Non-transitive Active Markov Game Model, where Feint can have a considerable amount of impacts. Then, our work considers practical implementation details of Feint in Multi-Player Games, under the state-of-the-art progress of multi-agent modeling to date (namely Multi-Agent Reinforcement Learning). Finally, our work quantitatively examines the effectiveness of our design, and the results show that our design of Feint can (1) greatly improve the reward gains from the game; (2) significantly improve the diversity of Multi-Player Games; and (3) only incur negligible overheads in terms of time consumption. We conclude that our design of Feint is effec
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21305;&#37197;&#38382;&#39064;&#20013;&#30340;&#31283;&#23450;&#33756;&#21333;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20445;&#35777;&#23384;&#22312;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#65292;&#23545;&#26080;&#31574;&#30053;&#24615;&#31283;&#23450;&#21305;&#37197;&#32473;&#20986;&#20102;&#31215;&#26497;&#21644;&#28040;&#26497;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.11370</link><description>&lt;p&gt;
&#20844;&#20849;&#29289;&#21697;&#30340;&#31283;&#23450;&#33756;&#21333;: &#19968;&#20010;&#21305;&#37197;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Stable Menus of Public Goods: A Matching Problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11370
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21305;&#37197;&#38382;&#39064;&#20013;&#30340;&#31283;&#23450;&#33756;&#21333;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20445;&#35777;&#23384;&#22312;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#65292;&#23545;&#26080;&#31574;&#30053;&#24615;&#31283;&#23450;&#21305;&#37197;&#32473;&#20986;&#20102;&#31215;&#26497;&#21644;&#28040;&#26497;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#27809;&#26377;&#36135;&#24065;&#36716;&#31227;&#30340;&#24773;&#22659;&#19979;&#65292;&#20195;&#29702;&#32773;&#21644;&#20844;&#20849;&#29289;&#21697;&#20043;&#38388;&#30340;&#21305;&#37197;&#38382;&#39064;&#12290;&#30001;&#20110;&#29289;&#21697;&#26159;&#20844;&#20849;&#30340;&#65292;&#23427;&#20204;&#27809;&#26377;&#23481;&#37327;&#38480;&#21046;&#12290;&#27809;&#26377;&#22806;&#29983;&#23450;&#20041;&#30340;&#25552;&#20379;&#29289;&#21697;&#30340;&#39044;&#31639;&#12290;&#30456;&#21453;&#65292;&#27599;&#20010;&#25552;&#20379;&#30340;&#29289;&#21697;&#24517;&#39035;&#35777;&#26126;&#20854;&#25104;&#26412;&#65292;&#23548;&#33268;&#22312;&#29289;&#21697;&#30340;&#8220;&#20559;&#22909;&#8221;&#20013;&#23384;&#22312;&#24456;&#24378;&#30340;&#20114;&#34917;&#24615;&#12290;&#27492;&#22806;&#65292;&#37492;&#20110;&#24050;&#25552;&#20379;&#30340;&#20854;&#20182;&#29289;&#21697;&#65292;&#37027;&#20123;&#38656;&#27714;&#37327;&#39640;&#30340;&#29289;&#21697;&#20063;&#24517;&#39035;&#24471;&#21040;&#25552;&#20379;&#12290;&#23384;&#22312;&#19968;&#20010;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#65288;&#25552;&#20379;&#30340;&#20844;&#20849;&#29289;&#21697;&#30340;&#33756;&#21333;&#65289;&#30340;&#38382;&#39064;&#23637;&#31034;&#20102;&#20016;&#23500;&#30340;&#32452;&#21512;&#32467;&#26500;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;&#20445;&#35777;&#23384;&#22312;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#30340;&#20805;&#20998;&#26465;&#20214;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#20026;&#26080;&#31574;&#30053;&#24615;&#31283;&#23450;&#21305;&#37197;&#24471;&#20986;&#20102;&#31215;&#26497;&#21644;&#28040;&#26497;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11370v1 Announce Type: cross  Abstract: We study a matching problem between agents and public goods, in settings without monetary transfers. Since goods are public, they have no capacity constraints. There is no exogenously defined budget of goods to be provided. Rather, each provided good must justify its cost, leading to strong complementarities in the "preferences" of goods. Furthermore, goods that are in high demand given other already-provided goods must also be provided. The question of the existence of a stable solution (a menu of public goods to be provided) exhibits a rich combinatorial structure. We uncover sufficient conditions and necessary conditions for guaranteeing the existence of a stable solution, and derive both positive and negative results for strategyproof stable matching.
&lt;/p&gt;</description></item></channel></rss>