<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#30340;&#19968;&#20010;&#27010;&#24565;&#65292;&#21487;&#20197;&#20197;&#20998;&#24067;&#24335;&#26041;&#24335;&#26377;&#25928;&#22320;&#35745;&#31639;&#21644;&#23454;&#29616;&#65292;&#24182;&#22312;&#24191;&#27867;&#30340;&#21338;&#24328;&#31867;&#21035;&#20013;&#36798;&#21040;&#36817;&#20284;&#26368;&#20248;&#30340;&#31038;&#20250;&#31119;&#21033;&#65292;&#22312;&#23454;&#39564;&#20013;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.05005</link><description>&lt;p&gt;
&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#21644;&#26080;&#24724;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
Bayes correlated equilibria and no-regret dynamics. (arXiv:2304.05005v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05005
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#30340;&#19968;&#20010;&#27010;&#24565;&#65292;&#21487;&#20197;&#20197;&#20998;&#24067;&#24335;&#26041;&#24335;&#26377;&#25928;&#22320;&#35745;&#31639;&#21644;&#23454;&#29616;&#65292;&#24182;&#22312;&#24191;&#27867;&#30340;&#21338;&#24328;&#31867;&#21035;&#20013;&#36798;&#21040;&#36817;&#20284;&#26368;&#20248;&#30340;&#31038;&#20250;&#31119;&#21033;&#65292;&#22312;&#23454;&#39564;&#20013;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36125;&#21494;&#26031;&#21338;&#24328;&#30340;&#22343;&#34913;&#27010;&#24565;&#65292;&#36825;&#26159;&#19968;&#31181;&#20855;&#26377;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#22522;&#26412;&#21338;&#24328;&#27169;&#22411;&#12290;&#25105;&#20204;&#26088;&#22312;&#23454;&#29616;&#19977;&#31181;&#29702;&#24819;&#30340;&#24179;&#34913;&#24615;&#36136;&#12290;&#39318;&#20808;&#65292;&#36890;&#36807;&#22312;&#21338;&#24328;&#20013;&#24341;&#20837;&#35843;&#35299;&#32773;&#26469;&#33258;&#28982;&#22320;&#23454;&#29616;&#22343;&#34913;&#12290;&#20854;&#27425;&#65292;&#21487;&#20197;&#20197;&#20998;&#24067;&#24335;&#26041;&#24335;&#26377;&#25928;&#22320;&#35745;&#31639;&#22343;&#34913;&#12290;&#31532;&#19977;&#65292;&#23545;&#20110;&#24191;&#27867;&#30340;&#21338;&#24328;&#31867;&#21035;&#65292;&#35813;&#31867;&#22343;&#34913;&#36817;&#20284;&#22320;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#65292;&#21363;&#36890;&#36807;&#28798;&#21464;&#20195;&#20215;&#26469;&#24230;&#37327;&#12290;&#36825;&#19977;&#31181;&#23646;&#24615;&#20801;&#35768;&#29609;&#23478;&#35745;&#31639;&#22343;&#34913;&#65292;&#24182;&#36890;&#36807;&#35843;&#35299;&#32773;&#20351;&#20854;&#23454;&#29616;&#65292;&#20174;&#32780;&#22312;&#36817;&#20046;&#26368;&#20248;&#30340;&#31038;&#20250;&#31119;&#21033;&#20013;&#36798;&#25104;&#31283;&#23450;&#29366;&#24577;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#23384;&#22312;&#19968;&#20010;&#22343;&#34913;&#27010;&#24565;&#65292;&#28385;&#36275;&#36825;&#19977;&#31181;&#24615;&#36136;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#21508;&#31181;&#65288;&#19981;&#31561;&#20215;&#30340;&#65289;&#30456;&#20851;&#22343;&#34913;&#25193;&#23637;&#65292;&#32479;&#31216;&#20026;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#20851;&#27880;&#20419;&#36827;&#29609;&#23478;&#20043;&#38388;&#20132;&#27969;&#30340;&#27807;&#36890;&#22343;&#34913;&#65288;&#20063;&#31216;&#20026;&#21327;&#35843;&#26426;&#21046;&#65289;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#24724;&#21160;&#24577;&#65292;&#20197;&#20998;&#24067;&#24335;&#26041;&#24335;&#25910;&#25947;&#20110;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#24179;&#34913;&#27010;&#24565;&#28385;&#36275;&#19977;&#31181;&#29702;&#24819;&#30340;&#24179;&#34913;&#24615;&#36136;&#65292;&#24182;&#21576;&#29616;&#20102;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#30340;&#23454;&#39564;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper explores equilibrium concepts for Bayesian games, which are fundamental models of games with incomplete information. We aim at three desirable properties of equilibria. First, equilibria can be naturally realized by introducing a mediator into games. Second, an equilibrium can be computed efficiently in a distributed fashion. Third, any equilibrium in that class approximately maximizes social welfare, as measured by the price of anarchy, for a broad class of games. These three properties allow players to compute an equilibrium and realize it via a mediator, thereby settling into a stable state with approximately optimal social welfare. Our main result is the existence of an equilibrium concept that satisfies these three properties.  Toward this goal, we characterize various (non-equivalent) extensions of correlated equilibria, collectively known as Bayes correlated equilibria. In particular, we focus on communication equilibria (also known as coordination mechanisms), which 
&lt;/p&gt;</description></item></channel></rss>