<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#26684;&#30340;&#30740;&#31350;&#34920;&#26126;&#20854;&#19981;&#20855;&#26377;&#20998;&#37197;&#24615;&#36136;&#65292;&#19982;&#31283;&#23450;&#21305;&#37197;&#26684;&#19981;&#21516;&#65292;&#23545;&#20110;&#23398;&#29983;&#19981;&#19968;&#23450;&#26159;&#24085;&#32047;&#25176;&#26368;&#20248;&#12290;</title><link>https://arxiv.org/abs/2404.02142</link><description>&lt;p&gt;
&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#26684;&#19981;&#26159;&#20998;&#37197;&#30340;
&lt;/p&gt;
&lt;p&gt;
Priority-Neutral Matching Lattices Are Not Distributive
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02142
&lt;/p&gt;
&lt;p&gt;
&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#26684;&#30340;&#30740;&#31350;&#34920;&#26126;&#20854;&#19981;&#20855;&#26377;&#20998;&#37197;&#24615;&#36136;&#65292;&#19982;&#31283;&#23450;&#21305;&#37197;&#26684;&#19981;&#21516;&#65292;&#23545;&#20110;&#23398;&#29983;&#19981;&#19968;&#23450;&#26159;&#24085;&#32047;&#25176;&#26368;&#20248;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31283;&#23450;&#21305;&#37197;&#26159;&#24066;&#22330;&#35774;&#35745;&#30340;&#22522;&#30707;&#65292;&#20855;&#26377;&#20016;&#23500;&#30340;&#29702;&#35770;&#32467;&#26500;&#25903;&#25345;&#20247;&#22810;&#23454;&#38469;&#37096;&#32626;&#12290;&#28982;&#32780;&#65292;&#22312;&#23398;&#26657;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#31283;&#23450;&#21305;&#37197;&#23545;&#23398;&#29983;&#24182;&#19981;&#26159;&#24085;&#32047;&#25176;&#26368;&#20248;&#12290;&#30001;Reny&#65288;&#32463;&#27982;&#23398;&#24180;&#25253;&#65292;2022&#24180;&#65289;&#24341;&#20837;&#30340;&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#25193;&#23637;&#20102;&#31283;&#23450;&#21305;&#37197;&#38598;&#21512;&#65292;&#20801;&#35768;&#26576;&#20123;&#20248;&#20808;&#32423;&#36829;&#35268;&#65292;&#19988;&#24635;&#26377;&#19968;&#20010;&#24085;&#32047;&#25176;&#26368;&#20248;&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#12290;&#27492;&#22806;&#65292;&#31867;&#20284;&#20110;&#31283;&#23450;&#21305;&#37197;&#65292;&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#24418;&#25104;&#19968;&#20010;&#26684;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20248;&#20808;&#20013;&#31435;&#26684;&#30340;&#32467;&#26500;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#25105;&#20204;&#34920;&#26126;&#20248;&#20808;&#20013;&#31435;&#26684;&#30340;&#31616;&#21333;&#24615;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#19981;&#36866;&#29992;&#20110;&#31283;&#23450;&#21305;&#37197;&#26684;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#34920;&#26126;&#20248;&#20808;&#20013;&#31435;&#26684;&#19981;&#19968;&#23450;&#26159;&#20998;&#37197;&#30340;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#34920;&#26126;&#20248;&#20808;&#20013;&#31435;&#26684;&#20013;&#20004;&#20010;&#21305;&#37197;&#30340;&#26368;&#22823;&#19979;&#30028;&#19981;&#19968;&#23450;&#26159;&#23427;&#20204;&#30340;&#23398;&#29983;&#26368;&#23567;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02142v1 Announce Type: new  Abstract: Stable matchings are a cornerstone of market design, with numerous practical deployments backed by a rich, theoretically-tractable structure. However, in school-choice problems, stable matchings are not Pareto optimal for the students. Priority-neutral matchings, introduced by Reny (AER, 2022), generalizes the set of stable matchings by allowing for certain priority violations, and there is always a Pareto optimal priority-neutral matching. Moreover, like stable matchings, the set of priority-neutral matchings forms a lattice.   We study the structure of the priority-neutral lattice. Unfortunately, we show that much of the simplicity of the stable matching lattice does not hold for the priority-neutral lattice. In particular, we show that the priority-neutral lattice need not be distributive. Moreover, we show that the greatest lower bound of two matchings in the priority-neutral lattice need not be their student-by-student minimum, answ
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#28145;&#24230;&#23398;&#20064;&#19982;&#26426;&#21046;&#35774;&#35745;&#30340;&#32467;&#21512;&#65292;&#25506;&#35752;&#20102;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#22312;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#25152;&#26377;&#26399;&#26395;&#29305;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#23398;&#20064;&#36817;&#20284;&#28385;&#36275;&#29305;&#24615;&#35201;&#27714;&#30340;&#26426;&#21046;&#12290;</title><link>http://arxiv.org/abs/2401.05683</link><description>&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#19982;&#26426;&#21046;&#35774;&#35745;&#65306;&#20851;&#38190;&#32467;&#26524;&#21644;&#19968;&#20123;&#26032;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Deep Learning Meets Mechanism Design: Key Results and Some Novel Applications. (arXiv:2401.05683v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05683
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#28145;&#24230;&#23398;&#20064;&#19982;&#26426;&#21046;&#35774;&#35745;&#30340;&#32467;&#21512;&#65292;&#25506;&#35752;&#20102;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#22312;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#25152;&#26377;&#26399;&#26395;&#29305;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#23398;&#20064;&#36817;&#20284;&#28385;&#36275;&#29305;&#24615;&#35201;&#27714;&#30340;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#21046;&#35774;&#35745;&#26412;&#36136;&#19978;&#26159;&#23545;&#28216;&#25103;&#30340;&#36870;&#21521;&#24037;&#31243;&#65292;&#28041;&#21450;&#22312;&#21338;&#24328;&#20013;&#35825;&#23548;&#19968;&#31181;&#26041;&#24335;&#65292;&#20351;&#24471;&#35825;&#23548;&#30340;&#21338;&#24328;&#22312;&#21338;&#24328;&#22343;&#34913;&#20013;&#28385;&#36275;&#19968;&#32452;&#26399;&#26395;&#30340;&#29305;&#24615;&#12290;&#26426;&#21046;&#30340;&#26399;&#26395;&#29305;&#24615;&#21253;&#25324;&#28608;&#21169;&#20860;&#23481;&#24615;&#12289;&#20010;&#20307;&#21512;&#29702;&#24615;&#12289;&#31119;&#21033;&#26368;&#22823;&#21270;&#12289;&#25910;&#20837;&#26368;&#22823;&#21270;&#65288;&#25110;&#25104;&#26412;&#26368;&#23567;&#21270;&#65289;&#12289;&#20998;&#37197;&#20844;&#24179;&#31561;&#12290;&#26681;&#25454;&#26426;&#21046;&#35774;&#35745;&#29702;&#35770;&#65292;&#21482;&#26377;&#26576;&#20123;&#20005;&#26684;&#30340;&#23376;&#38598;&#21487;&#20197;&#21516;&#26102;&#34987;&#20219;&#20309;&#32473;&#23450;&#30340;&#26426;&#21046;&#23436;&#20840;&#28385;&#36275;&#12290;&#22312;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#65292;&#36890;&#24120;&#25152;&#38656;&#30340;&#26426;&#21046;&#21487;&#33021;&#38656;&#35201;&#19968;&#20123;&#22312;&#29702;&#35770;&#19978;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#30340;&#29305;&#24615;&#23376;&#38598;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#19968;&#20010;&#26174;&#33879;&#30340;&#36817;&#26399;&#26041;&#27861;&#26159;&#20351;&#29992;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#36866;&#24403;&#23450;&#20041;&#30340;&#25439;&#22833;&#20989;&#25968;&#26469;&#23398;&#20064;&#19968;&#20010;&#36817;&#20284;&#28385;&#36275;&#25152;&#38656;&#29305;&#24615;&#30340;&#26426;&#21046;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20174;&#30456;&#20851;&#25991;&#29486;&#20013;&#20171;&#32461;&#20102;&#25216;&#26415;&#32454;&#33410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mechanism design is essentially reverse engineering of games and involves inducing a game among strategic agents in a way that the induced game satisfies a set of desired properties in an equilibrium of the game. Desirable properties for a mechanism include incentive compatibility, individual rationality, welfare maximisation, revenue maximisation (or cost minimisation), fairness of allocation, etc. It is known from mechanism design theory that only certain strict subsets of these properties can be simultaneously satisfied exactly by any given mechanism. Often, the mechanisms required by real-world applications may need a subset of these properties that are theoretically impossible to be simultaneously satisfied. In such cases, a prominent recent approach is to use a deep learning based approach to learn a mechanism that approximately satisfies the required properties by minimizing a suitably defined loss function. In this paper, we present, from relevant literature, technical details 
&lt;/p&gt;</description></item></channel></rss>