<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#22312;&#20195;&#29702;&#28216;&#25103;&#20013;&#22914;&#20309;&#36890;&#36807;&#20195;&#29702;&#30340;&#20449;&#24687;&#25581;&#31034;&#26469;&#25351;&#23548;&#24230;&#37327;&#26631;&#20934;&#30340;&#36873;&#25321;&#65292;&#20197;&#35299;&#20915;&#20449;&#24687;&#19981;&#36275;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.14005</link><description>&lt;p&gt;
&#20195;&#29702;&#28216;&#25103;&#20013;&#30340;&#20449;&#24687;&#24341;&#23548;
&lt;/p&gt;
&lt;p&gt;
Information Elicitation in Agency Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14005
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#22312;&#20195;&#29702;&#28216;&#25103;&#20013;&#22914;&#20309;&#36890;&#36807;&#20195;&#29702;&#30340;&#20449;&#24687;&#25581;&#31034;&#26469;&#25351;&#23548;&#24230;&#37327;&#26631;&#20934;&#30340;&#36873;&#25321;&#65292;&#20197;&#35299;&#20915;&#20449;&#24687;&#19981;&#36275;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25968;&#25454;&#25910;&#38598;&#21644;&#25968;&#25454;&#22788;&#29702;&#26041;&#38754;&#30340;&#21487;&#25193;&#23637;&#21270;&#12289;&#36890;&#29992;&#21270;&#24037;&#20855;&#21462;&#24471;&#20102;&#24555;&#36895;&#36827;&#23637;&#65292;&#36825;&#20351;&#24471;&#20844;&#21496;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#33021;&#22815;&#37319;&#29992;&#26356;&#21152;&#22797;&#26434;&#30340;&#24230;&#37327;&#26631;&#20934;&#20316;&#20026;&#20915;&#31574;&#25351;&#21335;&#25104;&#20026;&#21487;&#33021;&#12290;&#28982;&#32780;&#65292;&#20915;&#23450;&#35745;&#31639;&#21738;&#20123;&#24230;&#37327;&#26631;&#20934;&#20173;&#28982;&#26159;&#19968;&#20010;&#25361;&#25112;&#65292;&#23588;&#20854;&#26159;&#23545;&#20110;&#37027;&#20123;&#23578;&#26410;&#30693;&#26195;&#30340;&#20449;&#24687;&#38480;&#21046;&#19979;&#65292;&#20844;&#21496;&#30340;&#24191;&#27867;&#35745;&#31639;&#24230;&#37327;&#26631;&#20934;&#30340;&#33021;&#21147;&#24182;&#19981;&#33021;&#35299;&#20915;&#8220;&#26410;&#30693;&#30340;&#26410;&#30693;&#8221;&#38382;&#39064;&#12290;&#20026;&#20102;&#22312;&#38754;&#23545;&#36825;&#31181;&#20449;&#24687;&#38382;&#39064;&#26102;&#25351;&#23548;&#24230;&#37327;&#26631;&#20934;&#30340;&#36873;&#25321;&#65292;&#25105;&#20204;&#36716;&#21521;&#35780;&#20272;&#20195;&#29702;&#26412;&#36523;&#65292;&#20182;&#20204;&#21487;&#33021;&#27604;&#22996;&#25176;&#20154;&#25317;&#26377;&#26356;&#22810;&#20851;&#20110;&#22914;&#20309;&#26377;&#25928;&#34913;&#37327;&#32467;&#26524;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#23558;&#36825;&#31181;&#20114;&#21160;&#24314;&#27169;&#20026;&#19968;&#20010;&#31616;&#21333;&#30340;&#20195;&#29702;&#28216;&#25103;&#65292;&#35810;&#38382;&#65306;&#20195;&#29702;&#20309;&#26102;&#26377;&#21160;&#26426;&#21521;&#22996;&#25176;&#20154;&#25581;&#31034;&#19982;&#25104;&#26412;&#30456;&#20851;&#21464;&#37327;&#30340;&#21487;&#35266;&#23519;&#24615;&#65311;&#23384;&#22312;&#20004;&#31181;&#25928;&#24212;&#65306;&#26356;&#22909;&#30340;&#20449;&#24687;&#38477;&#20302;&#20102;&#20195;&#29702;&#21830;&#30340;&#19981;&#36879;&#26126;&#24230;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14005v1 Announce Type: cross  Abstract: Rapid progress in scalable, commoditized tools for data collection and data processing has made it possible for firms and policymakers to employ ever more complex metrics as guides for decision-making. These developments have highlighted a prevailing challenge -- deciding *which* metrics to compute. In particular, a firm's ability to compute a wider range of existing metrics does not address the problem of *unknown unknowns*, which reflects informational limitations on the part of the firm. To guide the choice of metrics in the face of this informational problem, we turn to the evaluated agents themselves, who may have more information than a principal about how to measure outcomes effectively. We model this interaction as a simple agency game, where we ask: *When does an agent have an incentive to reveal the observability of a cost-correlated variable to the principal?* There are two effects: better information reduces the agent's inf
&lt;/p&gt;</description></item><item><title>&#32431;&#33945;&#29305;&#21345;&#27931;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#65288;PCFR&#65289;&#26159;&#19968;&#31181;&#32467;&#21512;&#20102;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#65288;CFR&#65289;&#21644;&#34394;&#25311;&#28216;&#25103;&#65288;FP&#65289;&#27010;&#24565;&#30340;&#26032;&#31639;&#27861;&#65292;&#33021;&#22815;&#19982;&#21508;&#31181;CFR&#21464;&#20307;&#30456;&#32467;&#21512;&#65292;&#21253;&#25324;&#33945;&#29305;&#21345;&#27931;CFR&#65288;MCCFR&#65289;&#12290;PCFR&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#21644;&#36739;&#24555;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#21516;&#26102;&#38477;&#20302;&#20102;&#26102;&#38388;&#21644;&#31354;&#38388;&#22797;&#26434;&#24230;&#12290;</title><link>http://arxiv.org/abs/2309.03084</link><description>&lt;p&gt;
&#32431;&#33945;&#29305;&#21345;&#27931;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;
&lt;/p&gt;
&lt;p&gt;
Pure Monte Carlo Counterfactual Regret Minimization. (arXiv:2309.03084v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03084
&lt;/p&gt;
&lt;p&gt;
&#32431;&#33945;&#29305;&#21345;&#27931;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#31639;&#27861;&#65288;PCFR&#65289;&#26159;&#19968;&#31181;&#32467;&#21512;&#20102;&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#65288;CFR&#65289;&#21644;&#34394;&#25311;&#28216;&#25103;&#65288;FP&#65289;&#27010;&#24565;&#30340;&#26032;&#31639;&#27861;&#65292;&#33021;&#22815;&#19982;&#21508;&#31181;CFR&#21464;&#20307;&#30456;&#32467;&#21512;&#65292;&#21253;&#25324;&#33945;&#29305;&#21345;&#27931;CFR&#65288;MCCFR&#65289;&#12290;PCFR&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#21644;&#36739;&#24555;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#21516;&#26102;&#38477;&#20302;&#20102;&#26102;&#38388;&#21644;&#31354;&#38388;&#22797;&#26434;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21453;&#20107;&#23454;&#36951;&#25022;&#26368;&#23567;&#21270;&#65288;CFR&#65289;&#21450;&#20854;&#21464;&#20307;&#26159;&#30446;&#21069;&#35299;&#20915;&#22823;&#35268;&#27169;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#30340;&#26368;&#20339;&#31639;&#27861;&#12290;&#26412;&#25991;&#22312;CFR&#30340;&#22522;&#30784;&#19978;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#32431;CFR&#65288;PCFR&#65289;&#30340;&#26032;&#31639;&#27861;&#65292;&#20197;&#23454;&#29616;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;PCFR&#21487;&#20197;&#30475;&#20316;&#26159;CFR&#21644;&#34394;&#25311;&#28216;&#25103;&#65288;FP&#65289;&#30340;&#32467;&#21512;&#65292;&#32487;&#25215;&#20102;CFR&#30340;&#21453;&#20107;&#23454;&#36951;&#25022;&#65288;&#20540;&#65289;&#30340;&#27010;&#24565;&#65292;&#24182;&#22312;&#19979;&#19968;&#27425;&#36845;&#20195;&#20013;&#20351;&#29992;&#26368;&#20339;&#21709;&#24212;&#31574;&#30053;&#32780;&#19981;&#26159;&#36951;&#25022;&#21305;&#37197;&#31574;&#30053;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#35777;&#26126;&#20102;PCFR&#21487;&#20197;&#23454;&#29616;Blackwell&#21487;&#36798;&#24615;&#65292;&#20351;PCFR&#33021;&#22815;&#19982;&#21253;&#25324;&#33945;&#29305;&#21345;&#27931;CFR&#65288;MCCFR&#65289;&#22312;&#20869;&#30340;&#20219;&#20309;CFR&#21464;&#20307;&#30456;&#32467;&#21512;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#32431;MCCFR&#65288;PMCCFR&#65289;&#21487;&#20197;&#22823;&#22823;&#38477;&#20302;&#26102;&#38388;&#21644;&#31354;&#38388;&#22797;&#26434;&#24230;&#12290;&#29305;&#21035;&#22320;&#65292;PMCCFR&#30340;&#25910;&#25947;&#36895;&#24230;&#33267;&#23569;&#27604;MCCFR&#24555;&#19977;&#20493;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;PMCCFR&#19981;&#36890;&#36807;&#20005;&#26684;&#34987;&#25903;&#37197;&#31574;&#30053;&#30340;&#36335;&#24452;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21160;&#31639;&#27861;&#65292;&#21463;&#21040;&#20102;&#20005;&#26684;&#34987;&#25903;&#37197;&#31574;&#30053;&#30340;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Counterfactual Regret Minimization (CFR) and its variants are the best algorithms so far for solving large-scale incomplete information games. Building upon CFR, this paper proposes a new algorithm named Pure CFR (PCFR) for achieving better performance. PCFR can be seen as a combination of CFR and Fictitious Play (FP), inheriting the concept of counterfactual regret (value) from CFR, and using the best response strategy instead of the regret matching strategy for the next iteration. Our theoretical proof that PCFR can achieve Blackwell approachability enables PCFR's ability to combine with any CFR variant including Monte Carlo CFR (MCCFR). The resultant Pure MCCFR (PMCCFR) can significantly reduce time and space complexity. Particularly, the convergence speed of PMCCFR is at least three times more than that of MCCFR. In addition, since PMCCFR does not pass through the path of strictly dominated strategies, we developed a new warm-start algorithm inspired by the strictly dominated strat
&lt;/p&gt;</description></item></channel></rss>