<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#30740;&#31350;&#35777;&#26126;&#20102;&#22312;&#20855;&#26377;&#20984;&#25104;&#26412;&#30340;Tullock&#31454;&#36187;&#20013;&#65292;&#36830;&#32493;&#26102;&#38388;&#26368;&#20248;&#21709;&#24212;&#21160;&#24577;&#25910;&#25947;&#21040;&#21807;&#19968;&#22343;&#34913;&#28857;&#65292;&#24182;&#25552;&#20379;&#20102;&#35745;&#31639;&#36817;&#20284;&#22343;&#34913;&#30340;&#31639;&#27861;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#30456;&#20851;&#31163;&#25955;&#26102;&#38388;&#21160;&#24577;&#30340;&#25910;&#25947;&#24615;&#65292;&#36825;&#34920;&#26126;&#22343;&#34913;&#26159;&#36825;&#20123;&#28216;&#25103;&#20013;&#20195;&#29702;&#20154;&#34892;&#20026;&#30340;&#21487;&#38752;&#39044;&#27979;&#22120;&#12290;</title><link>https://arxiv.org/abs/2402.08541</link><description>&lt;p&gt;
Tullock&#31454;&#36187;&#20013;&#22522;&#20110;&#36830;&#32493;&#26102;&#38388;&#26368;&#20248;&#21709;&#24212;&#21644;&#30456;&#20851;&#21160;&#24577;&#30340;&#20984;&#25104;&#26412;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Continuous-Time Best-Response and Related Dynamics in Tullock Contests with Convex Costs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08541
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35777;&#26126;&#20102;&#22312;&#20855;&#26377;&#20984;&#25104;&#26412;&#30340;Tullock&#31454;&#36187;&#20013;&#65292;&#36830;&#32493;&#26102;&#38388;&#26368;&#20248;&#21709;&#24212;&#21160;&#24577;&#25910;&#25947;&#21040;&#21807;&#19968;&#22343;&#34913;&#28857;&#65292;&#24182;&#25552;&#20379;&#20102;&#35745;&#31639;&#36817;&#20284;&#22343;&#34913;&#30340;&#31639;&#27861;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#30456;&#20851;&#31163;&#25955;&#26102;&#38388;&#21160;&#24577;&#30340;&#25910;&#25947;&#24615;&#65292;&#36825;&#34920;&#26126;&#22343;&#34913;&#26159;&#36825;&#20123;&#28216;&#25103;&#20013;&#20195;&#29702;&#20154;&#34892;&#20026;&#30340;&#21487;&#38752;&#39044;&#27979;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Tullock&#31454;&#36187;&#27169;&#22411;&#36866;&#29992;&#20110;&#21508;&#31181;&#29616;&#23454;&#24773;&#26223;&#65292;&#21253;&#25324;PoW&#21306;&#22359;&#38142;&#30719;&#24037;&#20043;&#38388;&#30340;&#31454;&#20105;&#12289;&#23547;&#31199;&#21644;&#28216;&#35828;&#27963;&#21160;&#12290;&#25105;&#20204;&#21033;&#29992;&#26446;&#38597;&#26222;&#35834;&#22827;&#26041;&#24335;&#30340;&#35770;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#20855;&#26377;&#20984;&#25104;&#26412;&#30340;Tullock&#31454;&#36187;&#20013;&#65292;&#36830;&#32493;&#26102;&#38388;&#26368;&#20248;&#21709;&#24212;&#21160;&#24577;&#25910;&#25947;&#21040;&#21807;&#19968;&#22343;&#34913;&#28857;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#36825;&#19968;&#32467;&#26524;&#25552;&#20379;&#20102;&#19968;&#31181;&#35745;&#31639;&#36817;&#20284;&#22343;&#34913;&#30340;&#31639;&#27861;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#30456;&#20851;&#31163;&#25955;&#26102;&#38388;&#21160;&#24577;&#30340;&#25910;&#25947;&#24615;&#65292;&#20363;&#22914;&#65292;&#24403;&#20195;&#29702;&#20154;&#23545;&#20854;&#20182;&#20195;&#29702;&#20154;&#30340;&#32463;&#39564;&#24179;&#22343;&#34892;&#21160;&#20570;&#20986;&#26368;&#20248;&#21709;&#24212;&#26102;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#22343;&#34913;&#26159;&#36825;&#20123;&#28216;&#25103;&#20013;&#20195;&#29702;&#20154;&#34892;&#20026;&#30340;&#21487;&#38752;&#39044;&#27979;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
Tullock contests model real-life scenarios that range from competition among proof-of-work blockchain miners to rent-seeking and lobbying activities. We show that continuous-time best-response dynamics in Tullock contests with convex costs converges to the unique equilibrium using Lyapunov-style arguments. We then use this result to provide an algorithm for computing an approximate equilibrium. We also establish convergence of related discrete-time dynamics, e.g., when the agents best-respond to the empirical average action of other agents. These results indicate that the equilibrium is a reliable predictor of the agents' behavior in these games.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#21512;&#20316;&#21338;&#24328;&#20013;&#20005;&#26684;&#20984;&#24773;&#20917;&#19979;&#65292;&#23398;&#20064;&#39044;&#26399;&#26680;&#24515;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;\texttt{Common-Points-Picking}&#30340;&#31639;&#27861;&#65292;&#22312;&#22810;&#39033;&#24335;&#25968;&#37327;&#30340;&#26679;&#26412;&#32473;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;&#39640;&#27010;&#29575;&#36820;&#22238;&#19968;&#20010;&#31283;&#23450;&#20998;&#37197;&#12290;</title><link>https://arxiv.org/abs/2402.07067</link><description>&lt;p&gt;
&#23398;&#20064;&#20005;&#26684;&#20984;&#30340;&#38543;&#26426;&#21512;&#20316;&#21338;&#24328;&#30340;&#39044;&#26399;&#26680;&#24515;
&lt;/p&gt;
&lt;p&gt;
Learning the Expected Core of Strictly Convex Stochastic Cooperative Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07067
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#21512;&#20316;&#21338;&#24328;&#20013;&#20005;&#26684;&#20984;&#24773;&#20917;&#19979;&#65292;&#23398;&#20064;&#39044;&#26399;&#26680;&#24515;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;\texttt{Common-Points-Picking}&#30340;&#31639;&#27861;&#65292;&#22312;&#22810;&#39033;&#24335;&#25968;&#37327;&#30340;&#26679;&#26412;&#32473;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;&#39640;&#27010;&#29575;&#36820;&#22238;&#19968;&#20010;&#31283;&#23450;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22870;&#21169;&#20998;&#37197;&#65292;&#20063;&#31216;&#20026;&#20449;&#29992;&#20998;&#37197;&#38382;&#39064;&#65292;&#26159;&#32463;&#27982;&#23398;&#12289;&#24037;&#31243;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#37325;&#35201;&#20027;&#39064;&#12290;&#20449;&#29992;&#20998;&#37197;&#20013;&#30340;&#19968;&#20010;&#37325;&#35201;&#27010;&#24565;&#26159;&#26680;&#24515;&#65292;&#23427;&#26159;&#31283;&#23450;&#20998;&#37197;&#30340;&#38598;&#21512;&#65292;&#20854;&#20013;&#27809;&#26377;&#20195;&#29702;&#26377;&#21160;&#26426;&#20174;&#22823;&#32852;&#30431;&#20013;&#20559;&#31163;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#38543;&#26426;&#21512;&#20316;&#21338;&#24328;&#30340;&#31283;&#23450;&#20998;&#37197;&#23398;&#20064;&#38382;&#39064;&#65292;&#20854;&#20013;&#22870;&#21169;&#20989;&#25968;&#34987;&#25551;&#36848;&#20026;&#20855;&#26377;&#26410;&#30693;&#20998;&#24067;&#30340;&#38543;&#26426;&#21464;&#37327;&#12290;&#22312;&#27599;&#19968;&#36718;&#20013;&#65292;&#32473;&#23450;&#19968;&#20010;&#36820;&#22238;&#26597;&#35810;&#32852;&#30431;&#30340;&#38543;&#26426;&#22870;&#21169;&#30340;oracle&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#23398;&#20064;&#39044;&#26399;&#26680;&#24515;&#65292;&#21363;&#22312;&#26399;&#26395;&#19978;&#31283;&#23450;&#30340;&#20998;&#37197;&#38598;&#21512;&#12290;&#22312;&#20005;&#26684;&#20984;&#21338;&#24328;&#31867;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;\texttt{Common-Points-Picking}&#30340;&#31639;&#27861;&#65292;&#23427;&#22312;&#22810;&#39033;&#24335;&#25968;&#37327;&#30340;&#26679;&#26412;&#32473;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#20197;&#39640;&#27010;&#29575;&#36820;&#22238;&#19968;&#20010;&#31283;&#23450;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#20998;&#26512;&#28041;&#21450;&#21040;&#20984;&#20960;&#20309;&#20013;&#30340;&#20960;&#20010;&#26032;&#32467;&#26524;&#30340;&#21457;&#23637;&#65292;&#21253;&#25324;&#19968;&#20010;
&lt;/p&gt;
&lt;p&gt;
Reward allocation, also known as the credit assignment problem, has been an important topic in economics, engineering, and machine learning. An important concept in credit assignment is the core, which is the set of stable allocations where no agent has the motivation to deviate from the grand coalition. In this paper, we consider the stable allocation learning problem of stochastic cooperative games, where the reward function is characterised as a random variable with an unknown distribution. Given an oracle that returns a stochastic reward for an enquired coalition each round, our goal is to learn the expected core, that is, the set of allocations that are stable in expectation. Within the class of strictly convex games, we present an algorithm named \texttt{Common-Points-Picking} that returns a stable allocation given a polynomial number of samples, with high probability. The analysis of our algorithm involves the development of several new results in convex geometry, including an e
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65292;&#22240;&#20026;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2309.10609</link><description>&lt;p&gt;
&#28216;&#25103;&#36830;&#36890;&#24615;&#19982;&#33258;&#36866;&#24212;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
Game Connectivity and Adaptive Dynamics. (arXiv:2309.10609v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10609
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65292;&#22240;&#20026;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#20998;&#26512;&#20102;&#28216;&#25103;&#30340;&#20856;&#22411;&#32467;&#26500;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#65292;&#36825;&#24847;&#21619;&#30528;&#27599;&#20010;&#38750;&#22343;&#34913;&#30340;&#34892;&#21160;&#37197;&#32622;&#37117;&#21487;&#20197;&#36890;&#36807;&#26368;&#20339;&#21709;&#24212;&#36335;&#24452;&#21040;&#36798;&#27599;&#20010;&#32431;&#32435;&#20160;&#22343;&#34913;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65306;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#65292;&#20363;&#22914;&#24102;&#26377;&#24815;&#24615;&#30340;&#26368;&#20339;&#21709;&#24212;&#21160;&#24577;&#65292;&#22312;&#36830;&#36890;&#30340;&#28216;&#25103;&#20013;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;&#22240;&#27492;&#65292;&#23384;&#22312;&#31616;&#21333;&#30340;&#12289;&#19981;&#32806;&#21512;&#30340;&#33258;&#36866;&#24212;&#21160;&#24577;&#65292;&#25353;&#21608;&#26399;&#28216;&#25103;&#23558;&#20960;&#20046;&#30830;&#23450;&#22320;&#25910;&#25947;&#21040;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#30340;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyse the typical structure of games in terms of the connectivity properties of their best-response graphs. In particular, we show that almost every 'large' generic game that has a pure Nash equilibrium is connected, meaning that every non-equilibrium action profile can reach every pure Nash equilibrium via best-response paths. This has implications for dynamics in games: many adaptive dynamics, such as the best-response dynamic with inertia, lead to equilibrium in connected games. It follows that there are simple, uncoupled, adaptive dynamics for which period-by-period play converges almost surely to a pure Nash equilibrium in almost every 'large' generic game that has one. We build on recent results in probabilistic combinatorics for our characterisation of game connectivity.
&lt;/p&gt;</description></item></channel></rss>