<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#27010;&#29575;&#39564;&#35777;&#27169;&#22411;&#65292;&#36890;&#36807;&#36873;&#25321;&#32479;&#35745;&#27979;&#35797;&#26469;&#39564;&#35777;&#20195;&#29702;&#20154;&#30340;&#22768;&#26126;&#65292;&#24182;&#21028;&#26029;&#26159;&#21542;&#26377;&#26368;&#20339;&#27979;&#35797;&#31579;&#36873;&#25152;&#26377;&#20854;&#20182;&#31867;&#22411;&#12290;&#36825;&#20010;&#26041;&#27861;&#33021;&#22815;&#21033;&#28070;&#26368;&#22823;&#21270;&#24182;&#19981;&#26029;&#25554;&#20540;&#35299;&#20915;&#39564;&#35777;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/1908.05556</link><description>&lt;p&gt;
&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#27010;&#29575;&#39564;&#35777;
&lt;/p&gt;
&lt;p&gt;
Probabilistic Verification in Mechanism Design. (arXiv:1908.05556v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1908.05556
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#27010;&#29575;&#39564;&#35777;&#27169;&#22411;&#65292;&#36890;&#36807;&#36873;&#25321;&#32479;&#35745;&#27979;&#35797;&#26469;&#39564;&#35777;&#20195;&#29702;&#20154;&#30340;&#22768;&#26126;&#65292;&#24182;&#21028;&#26029;&#26159;&#21542;&#26377;&#26368;&#20339;&#27979;&#35797;&#31579;&#36873;&#25152;&#26377;&#20854;&#20182;&#31867;&#22411;&#12290;&#36825;&#20010;&#26041;&#27861;&#33021;&#22815;&#21033;&#28070;&#26368;&#22823;&#21270;&#24182;&#19981;&#26029;&#25554;&#20540;&#35299;&#20915;&#39564;&#35777;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#26426;&#21046;&#35774;&#35745;&#32972;&#26223;&#19979;&#24341;&#20837;&#20102;&#19968;&#20010;&#27010;&#29575;&#39564;&#35777;&#27169;&#22411;&#12290;&#22996;&#25176;&#20154;&#36873;&#25321;&#19968;&#20010;&#32479;&#35745;&#27979;&#35797;&#26469;&#39564;&#35777;&#20195;&#29702;&#20154;&#30340;&#22768;&#26126;&#12290;&#20195;&#29702;&#20154;&#30340;&#30495;&#23454;&#31867;&#22411;&#20915;&#23450;&#20102;&#20182;&#21487;&#20197;&#36890;&#36807;&#27599;&#20010;&#27979;&#35797;&#30340;&#27010;&#29575;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#27599;&#20010;&#31867;&#22411;&#26159;&#21542;&#26377;&#19968;&#20010;&#30456;&#20851;&#30340;&#27979;&#35797;&#65292;&#26368;&#22909;&#22320;&#31579;&#36873;&#20986;&#25152;&#26377;&#20854;&#20182;&#31867;&#22411;&#65292;&#26080;&#35770;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#22914;&#20309;&#12290;&#22914;&#26524;&#36825;&#20010;&#26465;&#20214;&#25104;&#31435;&#65292;&#37027;&#20040;&#27979;&#35797;&#25216;&#26415;&#21487;&#20197;&#29992;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#31616;&#21270;&#24418;&#24335;&#34920;&#31034;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#20010;&#31616;&#21270;&#24418;&#24335;&#26469;&#35299;&#20915;&#39564;&#35777;&#30340;&#21033;&#28070;&#26368;&#22823;&#21270;&#26426;&#21046;&#12290;&#38543;&#30528;&#39564;&#35777;&#30340;&#25913;&#36827;&#65292;&#35299;&#20915;&#26041;&#26696;&#20174;&#26080;&#39564;&#35777;&#35299;&#20915;&#26041;&#26696;&#21040;&#23436;&#20840;&#21097;&#20313;&#25552;&#21462;&#19981;&#26029;&#25554;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a model of probabilistic verification in a mechanism design setting. The principal selects a statistical test to verify the agent's claim. The agent's true type determines the probability with which he can pass each test. We characterize whether each type has an associated test that best screens out all other types, no matter the social choice rule. If this condition holds, then the testing technology can be represented in a tractable reduced form. We use this reduced form to solve for profit-maximizing mechanisms with verification. As verification improves, the solution continuously interpolates from the no-verification solution to full surplus extraction.
&lt;/p&gt;</description></item></channel></rss>