<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.05657</link><description>&lt;p&gt;
&#25237;&#31080;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#21644;&#19968;&#20010;&#26032;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
The defensible set and a new impossibility theorem in voting. (arXiv:2401.05657v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#31216;&#21487;&#38450;&#24481;&#38598;&#21512;&#20026;&#37027;&#20123;&#23545;&#20110;&#20219;&#20309;&#26367;&#20195;&#26041;&#26696;$x$&#65292;&#22914;&#26524;$y$&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20987;&#36133;$x$&#65292;&#21017;&#23384;&#22312;&#19968;&#20010;&#26367;&#20195;&#26041;&#26696;$z$&#65292;&#23427;&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20197;&#33267;&#23569;&#19982;$y$&#20987;&#36133;$x$&#30340;&#38388;&#38548;&#19968;&#26679;&#22823;&#30340;&#38388;&#38548;&#20987;&#36133;$y$&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#20004;&#20010;&#24050;&#30693;&#20844;&#29702;&#65288;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#65289;&#30340;&#24207;&#27425;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#21487;&#38450;&#24481;&#38598;&#21512;&#12290;&#21033;&#29992;&#36825;&#20010;&#24341;&#29702;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65306;&#27809;&#26377;&#19968;&#31181;&#21516;&#26102;&#36824;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#65292;&#21363;&#20915;&#32988;&#32773;&#30340;&#36873;&#25321;&#21482;&#21462;&#20915;&#20110;&#22810;&#25968;&#36793;&#38469;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#25237;&#31080;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the context of social choice theory with ordinal preferences, we say that the defensible set is the set of alternatives $x$ such that for any alternative $y$, if $y$ beats $x$ in a head-to-head majority comparison, then there is an alternative $z$ that beats $y$ in a head-to-head majority comparison by a margin at least as large as the margin by which $y$ beat $x$. We show that any ordinal voting method satisfying two well-known axioms from voting theory--positive involvement and the Condorcet winner criterion--refines the defensible set. Using this lemma, we prove an impossibility theorem: there is no such voting method that also satisfies the Condorcet loser criterion, resolvability, and a common invariance property for Condorcet methods, namely that the choice of winners depends only on the relative sizes of majority margins.
&lt;/p&gt;</description></item></channel></rss>