<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36190;&#25104;&#31080;&#30340;&#22810;&#33719;&#32988;&#32773;&#25237;&#31080;&#30340;&#23454;&#20363;&#36873;&#25321;&#26041;&#27861;&#65292;&#36890;&#36807;&#20195;&#34920;&#24615;&#25237;&#31080;&#35268;&#21017;&#36873;&#25321;&#33719;&#32988;&#32773;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#20943;&#23569;&#35757;&#32451;&#38598;&#30340;&#25968;&#25454;&#23454;&#20363;&#12290;</title><link>http://arxiv.org/abs/2304.09995</link><description>&lt;p&gt;
&#22522;&#20110;&#25237;&#31080;&#30340;&#23454;&#20363;&#31579;&#36873;&#26041;&#27861;&#65306;&#20351;&#29992;&#22522;&#20110;&#36190;&#25104;&#31080;&#30340;&#22810;&#33719;&#32988;&#32773;&#25237;&#31080;
&lt;/p&gt;
&lt;p&gt;
Data as voters: instance selection using approval-based multi-winner voting. (arXiv:2304.09995v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09995
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36190;&#25104;&#31080;&#30340;&#22810;&#33719;&#32988;&#32773;&#25237;&#31080;&#30340;&#23454;&#20363;&#36873;&#25321;&#26041;&#27861;&#65292;&#36890;&#36807;&#20195;&#34920;&#24615;&#25237;&#31080;&#35268;&#21017;&#36873;&#25321;&#33719;&#32988;&#32773;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#20943;&#23569;&#35757;&#32451;&#38598;&#30340;&#25968;&#25454;&#23454;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#65288;&#25110;&#25968;&#25454;&#25366;&#25496;&#65289;&#20013;&#30340;&#23454;&#20363;&#31579;&#36873;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;&#26368;&#36817;&#20851;&#20110;&#22522;&#20110;&#36190;&#25104;&#31080;&#30340;&#22810;&#33719;&#32988;&#32773;&#36873;&#20030;&#20013;&#20195;&#34920;&#24615;&#34920;&#24449;&#30340;&#32467;&#26524;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#23454;&#20363;&#25198;&#28436;&#36873;&#27665;&#21644;&#20505;&#36873;&#20154;&#30340;&#21452;&#37325;&#35282;&#33394;&#12290;&#27599;&#20010;&#35757;&#32451;&#38598;&#20013;&#30340;&#23454;&#20363;&#65288;&#20316;&#20026;&#36873;&#27665;&#65289;&#36190;&#25104;&#20854;&#26412;&#22320;&#38598;&#21512;&#20013;&#30340;&#23454;&#20363;&#65288;&#25198;&#28436;&#20505;&#36873;&#20154;&#30340;&#35282;&#33394;&#65289;&#65288;&#38500;&#33258;&#36523;&#20197;&#22806;&#30340;&#23454;&#20363;&#65289;&#65292;&#36825;&#20010;&#27010;&#24565;&#22312;&#25991;&#29486;&#20013;&#24050;&#32463;&#23384;&#22312;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#20195;&#34920;&#24615;&#25237;&#31080;&#35268;&#21017;&#36873;&#25321;&#36873;&#20030;&#33719;&#32988;&#32773;&#65292;&#24182;&#20316;&#20026;&#20943;&#23569;&#35757;&#32451;&#38598;&#20013;&#30340;&#25968;&#25454;&#23454;&#20363;&#20445;&#30041;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a novel approach to the instance selection problem in machine learning (or data mining). Our approach is based on recent results on (proportional) representation in approval-based multi-winner elections. In our model, instances play a double role as voters and candidates. Each instance in the training set (acting as a voter) approves of the instances (playing the role of candidates) belonging to its local set (except itself), a concept already existing in the literature. We then select the election winners using a representative voting rule, and such winners are the data instances kept in the reduced training set.
&lt;/p&gt;</description></item></channel></rss>