<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#26368;&#20248;&#39044;&#31639;&#32858;&#21512;&#38382;&#39064;&#65292;&#24182;&#22312;&#22810;&#32500;&#27867;&#21270;&#30340;&#26143;&#24418;&#25928;&#29992;&#20989;&#25968;&#31867;&#21035;&#20013;&#25506;&#35752;&#19981;&#21516;&#27169;&#22411;&#12290;&#23545;&#20110;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#32479;&#19968;&#24187;&#24433;&#26426;&#21046;&#26159;&#21807;&#19968;&#28385;&#36275;&#27604;&#20363;&#24615;&#30340;&#31574;&#30053;&#35777;&#26126;&#26426;&#21046;&#12290;&#28982;&#21518;&#65292;&#23545;&#20110;&#36229;&#36807;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#35770;&#25991;&#34920;&#26126;&#19981;&#23384;&#22312;&#21516;&#26102;&#28385;&#36275;&#25928;&#29575;&#12289;&#31574;&#30053;&#24615;&#21644;&#27604;&#20363;&#24615;&#30340;&#26426;&#21046;&#12290;</title><link>https://arxiv.org/abs/2402.15904</link><description>&lt;p&gt;
&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#26368;&#20248;&#39044;&#31639;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Optimal Budget Aggregation with Single-Peaked Preferences
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15904
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#26368;&#20248;&#39044;&#31639;&#32858;&#21512;&#38382;&#39064;&#65292;&#24182;&#22312;&#22810;&#32500;&#27867;&#21270;&#30340;&#26143;&#24418;&#25928;&#29992;&#20989;&#25968;&#31867;&#21035;&#20013;&#25506;&#35752;&#19981;&#21516;&#27169;&#22411;&#12290;&#23545;&#20110;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#32479;&#19968;&#24187;&#24433;&#26426;&#21046;&#26159;&#21807;&#19968;&#28385;&#36275;&#27604;&#20363;&#24615;&#30340;&#31574;&#30053;&#35777;&#26126;&#26426;&#21046;&#12290;&#28982;&#21518;&#65292;&#23545;&#20110;&#36229;&#36807;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#35770;&#25991;&#34920;&#26126;&#19981;&#23384;&#22312;&#21516;&#26102;&#28385;&#36275;&#25928;&#29575;&#12289;&#31574;&#30053;&#24615;&#21644;&#27604;&#20363;&#24615;&#30340;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#23558;&#20998;&#24067;&#65288;&#22914;&#39044;&#31639;&#25552;&#26696;&#65289;&#32858;&#21512;&#25104;&#38598;&#20307;&#20998;&#24067;&#30340;&#38382;&#39064;&#12290;&#29702;&#24819;&#30340;&#32858;&#21512;&#26426;&#21046;&#24212;&#35813;&#26159;&#24085;&#32047;&#25176;&#26377;&#25928;&#12289;&#31574;&#30053;&#35777;&#26126;&#21644;&#20844;&#24179;&#30340;&#12290;&#22823;&#22810;&#25968;&#20808;&#21069;&#30340;&#24037;&#20316;&#20551;&#35774;&#20195;&#29702;&#26681;&#25454;&#20854;&#29702;&#24819;&#39044;&#31639;&#19982;$\ell_1$&#36317;&#31163;&#26469;&#35780;&#20272;&#39044;&#31639;&#12290;&#25105;&#20204;&#30740;&#31350;&#24182;&#27604;&#36739;&#20102;&#26469;&#33258;&#26143;&#24418;&#25928;&#29992;&#20989;&#25968;&#26356;&#22823;&#31867;&#21035;&#30340;&#19981;&#21516;&#27169;&#22411;&#65292;&#36825;&#26159;&#21333;&#23792;&#20559;&#22909;&#30340;&#22810;&#32500;&#27867;&#21270;&#12290;&#23545;&#20110;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#36890;&#36807;&#35777;&#26126;&#22312;&#38750;&#24120;&#19968;&#33324;&#30340;&#20551;&#35774;&#19979;&#65292;&#32479;&#19968;&#24187;&#24433;&#26426;&#21046;&#26159;&#21807;&#19968;&#28385;&#36275;&#27604;&#20363;&#24615;&#30340;&#31574;&#30053;&#35777;&#26126;&#26426;&#21046;&#65292;&#20174;&#32780;&#25193;&#23637;&#20102;&#29616;&#26377;&#32467;&#26524;&#12290;&#23545;&#20110;&#36229;&#36807;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#23545;$\ell_1$&#21644;$\ell_\infty$&#30340;&#19981;&#28385;&#24847;&#24615;&#24314;&#31435;&#20102;&#20840;&#38754;&#30340;&#19981;&#21487;&#33021;&#24615;&#65306;&#27809;&#26377;&#26426;&#21046;&#33021;&#22815;&#21516;&#26102;&#28385;&#36275;&#25928;&#29575;&#12289;&#31574;&#30053;&#24615;&#21644;&#27604;&#20363;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15904v1 Announce Type: new  Abstract: We study the problem of aggregating distributions, such as budget proposals, into a collective distribution. An ideal aggregation mechanism would be Pareto efficient, strategyproof, and fair. Most previous work assumes that agents evaluate budgets according to the $\ell_1$ distance to their ideal budget. We investigate and compare different models from the larger class of star-shaped utility functions - a multi-dimensional generalization of single-peaked preferences. For the case of two alternatives, we extend existing results by proving that under very general assumptions, the uniform phantom mechanism is the only strategyproof mechanism that satisfies proportionality - a minimal notion of fairness introduced by Freeman et al. (2021). Moving to the case of more than two alternatives, we establish sweeping impossibilities for $\ell_1$ and $\ell_\infty$ disutilities: no mechanism satisfies efficiency, strategyproofness, and proportionalit
&lt;/p&gt;</description></item></channel></rss>