<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#30740;&#31350;&#25293;&#21334;&#35774;&#35745;&#20013;&#24066;&#22330;&#21402;&#24230;&#21644;&#20449;&#24687;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#29305;&#21035;&#20851;&#27880;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#12290;</title><link>https://arxiv.org/abs/2403.11022</link><description>&lt;p&gt;
&#20855;&#26377;&#21160;&#24577;&#35780;&#20998;&#30340;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
Auctions with Dynamic Scoring
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11022
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25293;&#21334;&#35774;&#35745;&#20013;&#24066;&#22330;&#21402;&#24230;&#21644;&#20449;&#24687;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#29305;&#21035;&#20851;&#27880;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#21160;&#24577;&#35780;&#20998;&#30340;&#25293;&#21334;&#35774;&#35745;&#65292;&#36825;&#20123;&#25293;&#21334;&#26681;&#25454;&#32473;&#23450;&#30340;&#35780;&#20998;&#35268;&#21017;&#20998;&#37197;&#21333;&#20010;&#29289;&#21697;&#12290;&#25105;&#20204;&#30340;&#21160;&#26426;&#26469;&#33258;&#22312;&#32447;&#24191;&#21578;&#25293;&#21334;&#65292;&#24403;&#29992;&#25143;&#22312;&#20250;&#35805;&#26399;&#38388;&#19982;&#24179;&#21488;&#20114;&#21160;&#26102;&#12290;&#24179;&#21488;&#26681;&#25454;&#25237;&#26631;&#21644;&#36136;&#37327;&#24471;&#20998;&#30340;&#32452;&#21512;&#23545;&#24191;&#21578;&#36827;&#34892;&#25490;&#21517;&#65292;&#24182;&#26681;&#25454;&#29992;&#25143;&#30340;&#22312;&#32447;&#27963;&#21160;&#22312;&#20250;&#35805;&#26399;&#38388;&#26356;&#26032;&#36136;&#37327;&#24471;&#20998;&#12290;&#24179;&#21488;&#24517;&#39035;&#20915;&#23450;&#20309;&#26102;&#22312;&#20250;&#35805;&#26399;&#38388;&#23637;&#31034;&#24191;&#21578;&#12290;&#36890;&#36807;&#25512;&#36831;&#25293;&#21334;&#65292;&#25293;&#21334;&#32773;&#21487;&#20197;&#33719;&#21462;&#26377;&#20851;&#24191;&#21578;&#36136;&#37327;&#30340;&#20449;&#24687;&#65292;&#25552;&#39640;&#36873;&#25321;&#39640;&#36136;&#37327;&#24191;&#21578;&#30340;&#26426;&#20250;&#12290;&#28982;&#32780;&#65292;&#20449;&#24687;&#26159;&#26377;&#25104;&#26412;&#30340;&#65292;&#22240;&#20026;&#24310;&#36831;&#20250;&#20943;&#23569;&#24066;&#22330;&#21402;&#24230;&#65292;&#20174;&#32780;&#20943;&#23569;&#25910;&#20837;&#12290;&#25293;&#21334;&#32773;&#24212;&#35813;&#20309;&#26102;&#20998;&#37197;&#21360;&#35937;&#20197;&#24179;&#34913;&#36825;&#20123;&#21147;&#37327;&#65311;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#29702;&#35770;&#27169;&#22411;&#26469;&#30740;&#31350;&#24066;&#22330;&#35774;&#35745;&#23545;&#24066;&#22330;&#21402;&#24230;&#21644;&#20449;&#24687;&#20043;&#38388;&#30340;&#26435;&#34913;&#30340;&#24433;&#21709;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#20851;&#27880;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11022v1 Announce Type: new  Abstract: We study the design of auctions with dynamic scoring, which allocate a single item according to a given scoring rule. We are motivated by online advertising auctions when users interact with a platform over the course of a session. The platform ranks ads based on a combination of bids and quality scores, and updates the quality scores throughout the session based on the user's online activity. The platform must decide when to show an ad during the session. By delaying the auction, the auctioneer acquires information about an ad's quality, improving her chances of selecting a high quality ad. However information is costly, because delay reduces market thickness and in turn revenue. When should the auctioneer allocate the impression to balance these forces?   We develop a theoretical model to study the effect of market design on the trade-off between market thickness and information. In particular, we focus on first- and second-price aucti
&lt;/p&gt;</description></item></channel></rss>