<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65292;&#22240;&#20026;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2309.10609</link><description>&lt;p&gt;
&#28216;&#25103;&#36830;&#36890;&#24615;&#19982;&#33258;&#36866;&#24212;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
Game Connectivity and Adaptive Dynamics. (arXiv:2309.10609v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10609
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65292;&#22240;&#20026;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#20998;&#26512;&#20102;&#28216;&#25103;&#30340;&#20856;&#22411;&#32467;&#26500;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#65292;&#36825;&#24847;&#21619;&#30528;&#27599;&#20010;&#38750;&#22343;&#34913;&#30340;&#34892;&#21160;&#37197;&#32622;&#37117;&#21487;&#20197;&#36890;&#36807;&#26368;&#20339;&#21709;&#24212;&#36335;&#24452;&#21040;&#36798;&#27599;&#20010;&#32431;&#32435;&#20160;&#22343;&#34913;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65306;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#65292;&#20363;&#22914;&#24102;&#26377;&#24815;&#24615;&#30340;&#26368;&#20339;&#21709;&#24212;&#21160;&#24577;&#65292;&#22312;&#36830;&#36890;&#30340;&#28216;&#25103;&#20013;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;&#22240;&#27492;&#65292;&#23384;&#22312;&#31616;&#21333;&#30340;&#12289;&#19981;&#32806;&#21512;&#30340;&#33258;&#36866;&#24212;&#21160;&#24577;&#65292;&#25353;&#21608;&#26399;&#28216;&#25103;&#23558;&#20960;&#20046;&#30830;&#23450;&#22320;&#25910;&#25947;&#21040;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#30340;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyse the typical structure of games in terms of the connectivity properties of their best-response graphs. In particular, we show that almost every 'large' generic game that has a pure Nash equilibrium is connected, meaning that every non-equilibrium action profile can reach every pure Nash equilibrium via best-response paths. This has implications for dynamics in games: many adaptive dynamics, such as the best-response dynamic with inertia, lead to equilibrium in connected games. It follows that there are simple, uncoupled, adaptive dynamics for which period-by-period play converges almost surely to a pure Nash equilibrium in almost every 'large' generic game that has one. We build on recent results in probabilistic combinatorics for our characterisation of game connectivity.
&lt;/p&gt;</description></item></channel></rss>