<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26377;&#39044;&#31639;&#38480;&#21046;&#30340;&#24066;&#22330;&#65292;&#20080;&#23478;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#21644;&#32447;&#24615;&#26367;&#20195;&#20272;&#20540;&#65292;&#21334;&#23478;&#38656;&#35201;&#25214;&#21040;&#26368;&#22823;&#21270;&#25910;&#20837;&#25110;&#31119;&#21033;&#30340;&#20215;&#26684;&#21644;&#26080;&#23241;&#22930;&#30340;&#20998;&#37197;&#12290;&#30740;&#31350;&#21457;&#29616;&#31454;&#20105;&#22343;&#34913;&#20215;&#26684;&#20063;&#26159;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#8220;&#21487;&#34892;&#8221;&#20215;&#26684;&#38598;&#30340;&#26032;&#39062;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2310.03692</link><description>&lt;p&gt;
&#26377;&#39044;&#31639;&#38480;&#21046;&#30340;&#26367;&#20195;&#24066;&#22330;&#65306;&#35299;&#20915;&#31454;&#20105;&#21644;&#26368;&#20248;&#20215;&#26684;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Substitutes markets with budget constraints: solving for competitive and optimal prices. (arXiv:2310.03692v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03692
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26377;&#39044;&#31639;&#38480;&#21046;&#30340;&#24066;&#22330;&#65292;&#20080;&#23478;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#21644;&#32447;&#24615;&#26367;&#20195;&#20272;&#20540;&#65292;&#21334;&#23478;&#38656;&#35201;&#25214;&#21040;&#26368;&#22823;&#21270;&#25910;&#20837;&#25110;&#31119;&#21033;&#30340;&#20215;&#26684;&#21644;&#26080;&#23241;&#22930;&#30340;&#20998;&#37197;&#12290;&#30740;&#31350;&#21457;&#29616;&#31454;&#20105;&#22343;&#34913;&#20215;&#26684;&#20063;&#26159;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#8220;&#21487;&#34892;&#8221;&#20215;&#26684;&#38598;&#30340;&#26032;&#39062;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#20010;&#21487;&#20998;&#21106;&#21830;&#21697;&#30340;&#24066;&#22330;&#20174;&#25910;&#20837;&#21644;&#31119;&#21033;&#30340;&#35282;&#24230;&#24471;&#21040;&#20102;&#24191;&#27867;&#30340;&#30740;&#31350;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#20247;&#25152;&#21608;&#30693;&#65292;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#32467;&#26524;&#21487;&#33021;&#20250;&#23548;&#33268;&#27604;&#31454;&#20105;&#22343;&#34913;&#30340;&#32467;&#26524;&#26356;&#20302;&#30340;&#31119;&#21033;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#24066;&#22330;&#65292;&#20080;&#23478;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#21644;&#32447;&#24615;&#26367;&#20195;&#20272;&#20540;&#65292;&#24182;&#19988;&#26377;&#39044;&#31639;&#38480;&#21046;&#65292;&#21334;&#23478;&#24517;&#39035;&#25214;&#21040;&#26368;&#22823;&#21270;&#25910;&#20837;&#25110;&#31119;&#21033;&#30340;&#20215;&#26684;&#21644;&#26080;&#23241;&#22930;&#30340;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#35774;&#32622;&#19982;&#24191;&#21578;&#25293;&#21334;&#21644;&#37329;&#34701;&#36164;&#20135;&#20132;&#25442;&#25293;&#21334;&#31561;&#24066;&#22330;&#30456;&#20284;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21807;&#19968;&#30340;&#31454;&#20105;&#22343;&#34913;&#20215;&#26684;&#20063;&#26159;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#12290;&#36825;&#31181;&#26368;&#22823;&#25910;&#20837;&#21644;&#31119;&#21033;&#30340;&#24039;&#21512;&#20196;&#20154;&#24778;&#35766;&#65292;&#22312;&#20080;&#23478;&#20855;&#26377;&#20998;&#27573;&#32447;&#24615;&#20272;&#20540;&#26102;&#29978;&#33267;&#20250;&#22833;&#36133;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23545;&#8220;&#21487;&#34892;&#8221;&#20215;&#26684;&#38598;&#30340;&#26032;&#39062;&#25551;&#36848;&#65292;&#34920;&#26126;&#36825;&#20010;&#38598;&#21512;&#26377;&#19968;&#20010;&#25353;&#20803;&#32032;&#26368;&#23567;&#30340;&#20215;&#26684;&#21521;&#37327;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#20215;&#26684;&#26368;&#22823;&#21270;&#25910;&#20837;&#21644;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets with multiple divisible goods have been studied widely from the perspective of revenue and welfare. In general, it is well known that envy-free revenue-maximal outcomes can result in lower welfare than competitive equilibrium outcomes. We study a market in which buyers have quasilinear utilities with linear substitutes valuations and budget constraints, and the seller must find prices and an envy-free allocation that maximise revenue or welfare. Our setup mirrors markets such as ad auctions and auctions for the exchange of financial assets. We prove that the unique competitive equilibrium prices are also envy-free revenue-maximal. This coincidence of maximal revenue and welfare is surprising and breaks down even when buyers have piecewise-linear valuations. We present a novel characterisation of the set of "feasible" prices at which demand does not exceed supply, show that this set has an elementwise minimal price vector, and demonstrate that these prices maximise revenue and w
&lt;/p&gt;</description></item></channel></rss>