<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#31995;&#32479;&#30740;&#31350;&#20102;&#40065;&#26834;&#26031;&#22612;&#20811;&#20271;&#26684;&#22343;&#34913;&#30340;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;RSE&#65292;&#26088;&#22312;&#25552;&#39640;&#39046;&#34966;&#31574;&#30053;&#30340;&#31283;&#20581;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;RSE&#30340;&#23384;&#22312;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#23427;&#30340;&#25928;&#29992;&#20445;&#35777;&#12289;&#31639;&#27861;&#21644;&#21487;&#23398;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.14990</link><description>&lt;p&gt;
&#40065;&#26834;&#26031;&#22612;&#20811;&#20271;&#26684;&#22343;&#34913;&#30340;&#31995;&#32479;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Robust Stackelberg Equilibria. (arXiv:2304.14990v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14990
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#31995;&#32479;&#30740;&#31350;&#20102;&#40065;&#26834;&#26031;&#22612;&#20811;&#20271;&#26684;&#22343;&#34913;&#30340;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;RSE&#65292;&#26088;&#22312;&#25552;&#39640;&#39046;&#34966;&#31574;&#30053;&#30340;&#31283;&#20581;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;RSE&#30340;&#23384;&#22312;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#23427;&#30340;&#25928;&#29992;&#20445;&#35777;&#12289;&#31639;&#27861;&#21644;&#21487;&#23398;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31995;&#32479;&#30740;&#31350;&#20102;&#40065;&#26834;&#26031;&#22612;&#20811;&#20271;&#26684;&#22343;&#34913;(RSE)&#30340;&#27010;&#24565;&#65292;&#35813;&#27010;&#24565;&#33258;&#28982;&#22320;&#25512;&#24191;&#20102;&#24191;&#27867;&#37319;&#29992;&#30340;&#24378;&#26031;&#22612;&#20811;&#20271;&#26684;&#22343;&#34913;(SSE)&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;RSE&#32771;&#34385;&#20102;&#22312;&#26031;&#22612;&#20811;&#20271;&#26684;&#21338;&#24328;&#20013;&#21487;&#33021;&#20986;&#29616;&#30340;&#39640;&#36798;-$\delta$ &#23376;&#20248;&#36319;&#38543;&#32773;&#21453;&#24212;&#65292;&#24182;&#34987;&#37319;&#29992;&#26469;&#25552;&#39640;&#39046;&#34966;&#31574;&#30053;&#30340;&#31283;&#20581;&#24615;&#12290;&#34429;&#28982;&#20808;&#21069;&#30340;&#25991;&#29486;&#20013;&#24050;&#32463;&#32771;&#34385;&#20102;&#19968;&#20123;&#40065;&#26834;&#26031;&#22612;&#20811;&#20271;&#26684;&#22343;&#34913;&#30340;&#21464;&#20307;&#65292;&#20294;&#26412;&#25991;&#32771;&#34385;&#30340;RSE&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#37325;&#35201;&#30340;&#19981;&#21516;&#20043;&#22788;&#22312;&#20110;&#65292;&#26576;&#31181;&#24847;&#20041;&#19978;&#23427;&#25918;&#26494;&#20102;&#20808;&#21069;&#30740;&#31350;&#30340;&#40065;&#26834;&#26031;&#22612;&#20811;&#20271;&#26684;&#31574;&#30053;&#65292;&#24182;&#19988;&#36866;&#29992;&#20110;&#26356;&#24191;&#27867;&#30340;&#19981;&#30830;&#23450;&#24615;&#26469;&#28304;&#12290;&#25105;&#20204;&#23545;&#20960;&#20010;RSE&#30340;&#22522;&#26412;&#23646;&#24615;&#36827;&#34892;&#20102;&#24443;&#24213;&#30340;&#35843;&#26597;&#65292;&#21253;&#25324;&#23427;&#30340;&#25928;&#29992;&#20445;&#35777;&#12289;&#31639;&#27861;&#21644;&#21487;&#23398;&#24615;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#20102;&#25105;&#20204;&#23450;&#20041;&#30340;RSE&#24635;&#26159;&#23384;&#22312;&#30340;&#65292;&#20174;&#32780;&#26159;&#20005;&#26684;&#23450;&#20041;&#30340;&#12290;&#28982;&#21518;&#25105;&#20204;&#38416;&#26126;&#20102;&#22312;&#32771;&#34385;&#30340;&#40065;&#26834;&#24615;&#27700;&#24179;&#19979;&#39046;&#34966;&#25928;&#29992;&#30340;&#21464;&#21270;&#24773;&#20917;&#12290;&#22312;&#31639;&#27861;&#26041;&#38754;&#65292;&#25105;&#20204;&#34920;&#26126;&#35745;&#31639;RSE&#26159;&#35745;&#31639;&#19978;&#22256;&#38590;&#30340;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#26576;&#20123;&#28216;&#25103;&#31867;&#30340;&#26377;&#25928;&#31639;&#27861;&#26469;&#36817;&#20284;&#35745;&#31639;&#23427;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;RSE&#30340;&#21487;&#23398;&#24615;&#65292;&#24182;&#34920;&#26126;&#23427;&#21487;&#20197;&#20174;&#26679;&#26412;&#20013;&#36817;&#20284;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides a systematic study of the robust Stackelberg equilibrium (RSE), which naturally generalizes the widely adopted solution concept of the strong Stackelberg equilibrium (SSE). The RSE accounts for any possible up-to-$\delta$ suboptimal follower responses in Stackelberg games and is adopted to improve the robustness of the leader's strategy. While a few variants of robust Stackelberg equilibrium have been considered in previous literature, the RSE solution concept we consider is importantly different -- in some sense, it relaxes previously studied robust Stackelberg strategies and is applicable to much broader sources of uncertainties.  We provide a thorough investigation of several fundamental properties of RSE, including its utility guarantees, algorithmics, and learnability. We first show that the RSE we defined always exists and thus is well-defined. Then we characterize how the leader's utility in RSE changes with the robustness level considered. On the algorithmic
&lt;/p&gt;</description></item></channel></rss>