<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2302.13937</link><description>&lt;p&gt;
&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#20154;&#31867;&#19982;&#26426;&#22120;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Human and Machine Intelligence in n-Person Games with Partial Knowledge. (arXiv:2302.13937v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13937
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#8212;&#8212;&#26377;&#38480;&#30693;&#35782;&#19979;&#30340;n&#20154;&#21338;&#24328;&#65292;&#20854;&#20013;&#29609;&#23478;&#21482;&#23545;&#28216;&#25103;&#30340;&#26576;&#20123;&#26041;&#38754;&#65288;&#21253;&#25324;&#34892;&#21160;&#12289;&#32467;&#26524;&#21644;&#20854;&#20182;&#29609;&#23478;&#65289;&#26377;&#38480;&#30340;&#20102;&#35299;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#20123;&#28216;&#25103;&#65292;&#25105;&#20171;&#32461;&#20102;&#19968;&#32452;&#26032;&#30340;&#27010;&#24565;&#21644;&#26426;&#21046;&#65292;&#37325;&#28857;&#20851;&#27880;&#20154;&#31867;&#21644;&#26426;&#22120;&#20915;&#31574;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#24341;&#20837;&#20102;&#20004;&#20010;&#20027;&#35201;&#27010;&#24565;&#65306;&#31532;&#19968;&#20010;&#26159;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#65288;GI&#65289;&#26426;&#21046;&#65292;&#23427;&#36890;&#36807;&#32771;&#34385;&#21442;&#32771;&#26426;&#22120;&#26234;&#33021;&#19979;&#30340;&#8220;&#38169;&#35823;&#8221;&#65292;&#19981;&#20165;&#20165;&#26159;&#28216;&#25103;&#30340;&#32467;&#26524;&#65292;&#37327;&#21270;&#20102;&#29609;&#23478;&#22312;&#28216;&#25103;&#20013;&#23637;&#31034;&#20986;&#30340;&#26234;&#33021;&#12290;&#31532;&#20108;&#20010;&#26159;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#65292;&#36825;&#26159;&#19968;&#31181;&#23454;&#29992;&#30340;&#12289;&#21487;&#35745;&#31639;&#30340;&#31574;&#30053;&#26080;&#20851;&#24615;&#30340;&#27010;&#24565;&#12290;GI&#26426;&#21046;&#25552;&#20379;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#29609;&#23478;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24212;&#29992;&#20110;&#20174;&#22312;&#32447;&#28216;&#25103;&#21040;&#29616;&#23454;&#29983;&#27963;&#20915;&#31574;&#30340;&#21508;&#31181;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this note, I introduce a new framework called n-person games with partial knowledge, in which players have only limited knowledge about the aspects of the game -- including actions, outcomes, and other players. For example, playing an actual game of chess is a game of partial knowledge. To analyze these games, I introduce a set of new concepts and mechanisms for measuring the intelligence of players, with a focus on the interplay between human- and machine-based decision-making. Specifically, I introduce two main concepts: firstly, the Game Intelligence (GI) mechanism, which quantifies a player's demonstrated intelligence in a game by considering not only the game's outcome but also the "mistakes" made during the game according to the reference machine's intelligence. Secondly, I define gaming-proofness, a practical and computational concept of strategy-proofness. The GI mechanism provides a practicable way to assess players and can potentially be applied to a wide range of games, f
&lt;/p&gt;</description></item></channel></rss>