<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38544;&#31169;&#25935;&#24863;&#39046;&#22495;&#20013;&#22914;&#20309;&#35774;&#35745;&#19968;&#31181;FL&#21327;&#35758;&#65292;&#26082;&#33021;&#20445;&#35777;&#38544;&#31169;&#65292;&#21448;&#33021;&#25552;&#39640;&#27169;&#22411;&#20934;&#30830;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#35774;&#35745;&#20986;&#23545;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#26377;&#30410;&#22788;&#30340;&#21327;&#35758;&#12290;</title><link>https://arxiv.org/abs/2403.06672</link><description>&lt;p&gt;
&#22312;&#38544;&#31169;&#25935;&#24863;&#39046;&#22495;&#20013;&#20174;&#32852;&#37030;&#23398;&#20064;&#20013;&#26377;&#21487;&#35777;&#26126;&#30340;&#20114;&#24800;&#30410;&#22788;
&lt;/p&gt;
&lt;p&gt;
Provable Mutual Benefits from Federated Learning in Privacy-Sensitive Domains
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06672
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38544;&#31169;&#25935;&#24863;&#39046;&#22495;&#20013;&#22914;&#20309;&#35774;&#35745;&#19968;&#31181;FL&#21327;&#35758;&#65292;&#26082;&#33021;&#20445;&#35777;&#38544;&#31169;&#65292;&#21448;&#33021;&#25552;&#39640;&#27169;&#22411;&#20934;&#30830;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#35774;&#35745;&#20986;&#23545;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#26377;&#30410;&#22788;&#30340;&#21327;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#39046;&#22495;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#20801;&#35768;&#25968;&#25454;&#25152;&#26377;&#32773;&#36890;&#36807;&#20174;&#24444;&#27492;&#30340;&#31169;&#26377;&#25968;&#25454;&#38598;&#20013;&#33719;&#30410;&#26469;&#35757;&#32451;&#20934;&#30830;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#26381;&#21153;&#22120;&#21487;&#20197;&#35774;&#35745;&#19968;&#31181;&#23545;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#26377;&#21033;&#30340;FL&#21327;&#35758;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22312;&#22343;&#20540;&#20272;&#35745;&#21644;&#20984;&#38543;&#26426;&#20248;&#21270;&#32972;&#26223;&#19979;&#23384;&#22312;&#30456;&#20114;&#26377;&#21033;&#21327;&#35758;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#22312;&#23545;&#31216;&#38544;&#31169;&#20559;&#22909;&#19979;&#65292;&#26368;&#22823;&#21270;&#24635;&#23458;&#25143;&#25928;&#29992;&#30340;&#21327;&#35758;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#26368;&#22823;&#21270;&#26368;&#32456;&#27169;&#22411;&#20934;&#30830;&#24615;&#30340;&#21327;&#35758;&#65292;&#24182;&#22312;&#21512;&#25104;&#23454;&#39564;&#20013;&#23637;&#31034;&#20102;&#23427;&#20204;&#30340;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06672v1 Announce Type: cross  Abstract: Cross-silo federated learning (FL) allows data owners to train accurate machine learning models by benefiting from each others private datasets. Unfortunately, the model accuracy benefits of collaboration are often undermined by privacy defenses. Therefore, to incentivize client participation in privacy-sensitive domains, a FL protocol should strike a delicate balance between privacy guarantees and end-model accuracy. In this paper, we study the question of when and how a server could design a FL protocol provably beneficial for all participants. First, we provide necessary and sufficient conditions for the existence of mutually beneficial protocols in the context of mean estimation and convex stochastic optimization. We also derive protocols that maximize the total clients' utility, given symmetric privacy preferences. Finally, we design protocols maximizing end-model accuracy and demonstrate their benefits in synthetic experiments.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#22270;&#21453;&#39304;&#30340;&#19978;&#19979;&#25991;&#36172;&#21338;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21051;&#30011;&#23398;&#20064;&#26497;&#38480;&#30340;&#22270;&#35770;&#37327; $\beta_M(G)$&#65292;&#24182;&#24314;&#31435;&#20102;&#23545;&#24212;&#30340;&#36951;&#25022;&#19979;&#38480;&#12290;</title><link>https://arxiv.org/abs/2402.18591</link><description>&lt;p&gt;
&#20855;&#26377;&#22270;&#21453;&#39304;&#30340;&#38543;&#26426;&#19978;&#19979;&#25991;&#36172;&#21338;&#65306;&#20174;&#29420;&#31435;&#25968;&#21040;MAS&#25968;
&lt;/p&gt;
&lt;p&gt;
Stochastic contextual bandits with graph feedback: from independence number to MAS number
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#22270;&#21453;&#39304;&#30340;&#19978;&#19979;&#25991;&#36172;&#21338;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21051;&#30011;&#23398;&#20064;&#26497;&#38480;&#30340;&#22270;&#35770;&#37327; $\beta_M(G)$&#65292;&#24182;&#24314;&#31435;&#20102;&#23545;&#24212;&#30340;&#36951;&#25022;&#19979;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20855;&#26377;&#22270;&#21453;&#39304;&#30340;&#19978;&#19979;&#25991;&#36172;&#21338;&#65292;&#22312;&#36825;&#31867;&#20114;&#21160;&#23398;&#20064;&#38382;&#39064;&#20013;&#65292;&#20855;&#26377;&#27604;&#26222;&#36890;&#19978;&#19979;&#25991;&#36172;&#21338;&#26356;&#20016;&#23500;&#32467;&#26500;&#65292;&#20854;&#20013;&#37319;&#21462;&#19968;&#20010;&#34892;&#21160;&#23558;&#22312;&#25152;&#26377;&#24773;&#22659;&#19979;&#25581;&#31034;&#25152;&#26377;&#30456;&#37051;&#34892;&#21160;&#30340;&#22870;&#21169;&#12290;&#19982;&#22810;&#33218;&#36172;&#21338;&#35774;&#32622;&#19981;&#21516;&#65292;&#22810;&#25991;&#29486;&#24050;&#32463;&#23545;&#22270;&#21453;&#39304;&#30340;&#29702;&#35299;&#36827;&#34892;&#20102;&#20840;&#38754;&#25506;&#35752;&#65292;&#20294;&#22312;&#19978;&#19979;&#25991;&#36172;&#21338;&#23545;&#24212;&#37096;&#20998;&#20173;&#26377;&#35768;&#22810;&#26410;&#34987;&#25506;&#35752;&#30340;&#22320;&#26041;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#24314;&#31435;&#19968;&#20010;&#36951;&#25022;&#19979;&#38480; $\Omega(\sqrt{\beta_M(G) T})$ &#25506;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#20854;&#20013; $M$ &#26159;&#24773;&#22659;&#25968;&#65292;$G$ &#26159;&#21453;&#39304;&#22270;&#65292;$\beta_M(G)$ &#26159;&#25105;&#20204;&#25552;&#20986;&#30340;&#34920;&#24449;&#35813;&#38382;&#39064;&#31867;&#30340;&#22522;&#30784;&#23398;&#20064;&#38480;&#21046;&#30340;&#22270;&#35770;&#37327;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;$\beta_M(G)$ &#22312; $\alpha(G)$ (&#22270;&#30340;&#29420;&#31435;&#25968;) &#21644; $\mathsf{m}(G)$ (&#22270;&#30340;&#26368;&#22823;&#26080;&#29615;&#23376;&#22270;&#65288;MAS&#65289;&#25968;) &#20043;&#38388;&#25554;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18591v1 Announce Type: new  Abstract: We consider contextual bandits with graph feedback, a class of interactive learning problems with richer structures than vanilla contextual bandits, where taking an action reveals the rewards for all neighboring actions in the feedback graph under all contexts. Unlike the multi-armed bandits setting where a growing literature has painted a near-complete understanding of graph feedback, much remains unexplored in the contextual bandits counterpart. In this paper, we make inroads into this inquiry by establishing a regret lower bound $\Omega(\sqrt{\beta_M(G) T})$, where $M$ is the number of contexts, $G$ is the feedback graph, and $\beta_M(G)$ is our proposed graph-theoretical quantity that characterizes the fundamental learning limit for this class of problems. Interestingly, $\beta_M(G)$ interpolates between $\alpha(G)$ (the independence number of the graph) and $\mathsf{m}(G)$ (the maximum acyclic subgraph (MAS) number of the graph) as 
&lt;/p&gt;</description></item></channel></rss>