<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21338;&#24328;&#30340;&#28508;&#21147;&#20989;&#25968;&#65292;&#21457;&#29616;&#20102;&#19968;&#31181;&#19982;Macho-Stadler&#31561;&#20154;&#30340;MPW&#35299;&#30456;&#20851;&#30340;&#29420;&#29305;&#28508;&#21147;&#20989;&#25968;&#65292;&#23427;&#36890;&#36807;&#29609;&#23478;&#38543;&#26426;&#21010;&#20998;&#30340;&#26399;&#26395;&#32047;&#31215;&#20215;&#20540;&#35745;&#31639;&#65292;&#25512;&#24191;&#20102;&#26080;&#22806;&#37096;&#24615;&#21338;&#24328;&#30340;&#28508;&#21147;&#65292;&#24182;&#19988;&#22312;&#23384;&#22312;&#22806;&#37096;&#24615;&#30340;&#24773;&#20917;&#19979;&#20173;&#28385;&#36275;&#31354;&#29609;&#23478;&#29305;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.00394</link><description>&lt;p&gt;
&#38543;&#26426;&#21010;&#20998;&#12289;Shapley&#20540;&#30340;&#28508;&#21147;&#21644;&#20855;&#26377;&#22806;&#37096;&#24615;&#30340;&#21338;&#24328;&#35770;
&lt;/p&gt;
&lt;p&gt;
Random partitions, potential of the Shapley value, and games with externalities
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00394
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21338;&#24328;&#30340;&#28508;&#21147;&#20989;&#25968;&#65292;&#21457;&#29616;&#20102;&#19968;&#31181;&#19982;Macho-Stadler&#31561;&#20154;&#30340;MPW&#35299;&#30456;&#20851;&#30340;&#29420;&#29305;&#28508;&#21147;&#20989;&#25968;&#65292;&#23427;&#36890;&#36807;&#29609;&#23478;&#38543;&#26426;&#21010;&#20998;&#30340;&#26399;&#26395;&#32047;&#31215;&#20215;&#20540;&#35745;&#31639;&#65292;&#25512;&#24191;&#20102;&#26080;&#22806;&#37096;&#24615;&#21338;&#24328;&#30340;&#28508;&#21147;&#65292;&#24182;&#19988;&#22312;&#23384;&#22312;&#22806;&#37096;&#24615;&#30340;&#24773;&#20917;&#19979;&#20173;&#28385;&#36275;&#31354;&#29609;&#23478;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Shapley&#20540;&#31561;&#20110;&#29609;&#23478;&#23545;&#21338;&#24328;&#30340;&#28508;&#21147;&#30340;&#36129;&#29486;&#12290;&#28508;&#21147;&#26159;&#19968;&#20010;&#26368;&#33258;&#28982;&#30340;&#23545;&#21338;&#24328;&#30340;&#19968;&#31181;&#25968;&#20540;&#24635;&#32467;&#65292;&#21487;&#20197;&#35745;&#31639;&#20026;&#29609;&#23478;&#38543;&#26426;&#21010;&#20998;&#30340;&#26399;&#26395;&#32047;&#31215;&#20215;&#20540;&#12290;&#36825;&#31181;&#35745;&#31639;&#23558;&#25152;&#26377;&#29609;&#23478;&#30340;&#32852;&#30431;&#24418;&#25104;&#38598;&#25104;&#36215;&#26469;&#65292;&#24182;&#19988;&#21487;&#20197;&#36731;&#26494;&#25512;&#24191;&#21040;&#20855;&#26377;&#22806;&#37096;&#24615;&#30340;&#21338;&#24328;&#20013;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#37027;&#20123;&#21487;&#20197;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#35745;&#31639;&#30340;&#20855;&#26377;&#22806;&#37096;&#24615;&#30340;&#21338;&#24328;&#30340;&#28508;&#21147;&#20989;&#25968;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;Macho-Stadler&#31561;&#20154;(2007, J. Econ. Theory 135, 339-356)&#24341;&#20837;&#30340;MPW&#35299;&#30456;&#23545;&#24212;&#30340;&#28508;&#21147;&#22312;&#20197;&#19979;&#24847;&#20041;&#19978;&#26159;&#21807;&#19968;&#30340;&#12290;&#23427;&#20316;&#20026;&#29609;&#23478;&#38543;&#26426;&#21010;&#20998;&#30340;&#26399;&#26395;&#32047;&#31215;&#20215;&#20540;&#24471;&#21040;&#65292;&#23427;&#25512;&#24191;&#20102;&#27809;&#26377;&#22806;&#37096;&#24615;&#30340;&#21338;&#24328;&#30340;&#28508;&#21147;&#65292;&#24182;&#19988;&#22312;&#23384;&#22312;&#22806;&#37096;&#24615;&#30340;&#24773;&#20917;&#19979;&#28385;&#36275;&#31354;&#29609;&#23478;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Shapley value equals a player's contribution to the potential of a game. The potential is a most natural one-number summary of a game, which can be computed as the expected accumulated worth of a random partition of the players. This computation integrates the coalition formation of all players and readily extends to games with externalities. We investigate those potential functions for games with externalities that can be computed this way. It turns out that the potential that corresponds to the MPW solution introduced by Macho-Stadler et al. (2007, J. Econ. Theory 135, 339-356), is unique in the following sense. It is obtained as a the expected accumulated worth of a random partition, it generalizes the potential for games without externalities, and it induces a solution that satisfies the null player property even in the presence of externalities.
&lt;/p&gt;</description></item></channel></rss>