<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#27604;&#36739;&#20102;&#31616;&#21333;&#28216;&#25103;&#20013;&#22522;&#20110;&#21512;&#20316;&#21644;&#20998;&#35010;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#21644;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#25193;&#23637;&#24378;&#21333;&#35843;&#24615;&#12289;&#19981;&#20998;&#37197;&#26435;&#21147;&#32473;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#30340;&#26032;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#32479;&#19968;&#20004;&#31181;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2207.03565</link><description>&lt;p&gt;
&#31616;&#21333;&#28216;&#25103;&#20013;&#32676;&#20307;&#37325;&#35201;&#24615;&#27010;&#24565;&#30340;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
A Comparison of Group Criticality Notions for Simple Games. (arXiv:2207.03565v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.03565
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27604;&#36739;&#20102;&#31616;&#21333;&#28216;&#25103;&#20013;&#22522;&#20110;&#21512;&#20316;&#21644;&#20998;&#35010;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#21644;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#25193;&#23637;&#24378;&#21333;&#35843;&#24615;&#12289;&#19981;&#20998;&#37197;&#26435;&#21147;&#32473;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#30340;&#26032;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#32479;&#19968;&#20004;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22522;&#20110;&#29609;&#23478;&#20043;&#38388;&#30340;&#21512;&#20316;&#65288;&#25110;&#20998;&#35010;&#65289;&#26469;&#23450;&#20041;&#31616;&#21333;&#21333;&#35843;&#21338;&#24328;&#20013;&#29609;&#23478;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#65292;&#35201;&#27714;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#20855;&#26377;&#37325;&#35201;&#35282;&#33394;&#12290;&#25105;&#20204;&#23558;&#20854;&#19982;Beisbart&#25552;&#20986;&#30340;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#36827;&#34892;&#27604;&#36739;&#65292;&#21518;&#32773;&#23558;&#26435;&#21147;&#23450;&#20041;&#20026;&#20854;&#20182;&#29609;&#23478;&#30041;&#19979;&#30340;&#26426;&#20250;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#25552;&#35758;&#28385;&#36275;Young&#24341;&#20837;&#30340;&#24378;&#21333;&#35843;&#24615;&#30340;&#25193;&#23637;&#65292;&#19981;&#20250;&#20026;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#20998;&#37197;&#20219;&#20309;&#26435;&#21147;&#65292;&#24182;&#19988;&#21487;&#20197;&#20174;&#26368;&#23567;&#30340;&#33719;&#32988;&#21644;&#38459;&#22622;&#32852;&#30431;&#20013;&#36731;&#26494;&#35745;&#31639;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#36804;&#20170;&#20026;&#27490;&#23450;&#20041;&#30340;&#32676;&#20307;&#20851;&#38190;&#24615;&#24230;&#37327;&#26080;&#27861;&#34913;&#37327;&#37325;&#35201;&#30340;&#29609;&#23478;&#65292;&#21516;&#26102;&#20165;&#20445;&#25345;&#20026;&#26426;&#20250;&#24230;&#37327;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#21327;&#35843;&#20004;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define a notion of the criticality of a player for simple monotone games based on cooperation with other players, either to form a winning coalition or to break a winning one, with an essential role for all the players involved. We compare it with the notion of differential criticality given by Beisbart that measures power as the opportunity left by other players.  We prove that our proposal satisfies an extension of the strong monotonicity introduced by Young, it assigns no power to dummy players and free riders, and it can easily be computed from the minimal winning and blocking coalitions. Our analysis shows that the measures of group criticality defined so far cannot weigh essential players while only remaining an opportunity measure. We propose a group opportunity test to reconcile the two views.
&lt;/p&gt;</description></item></channel></rss>