<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#28548;&#28165;&#20102;&#20048;&#35266;&#21644;&#24754;&#35266;&#26041;&#27861;&#30340;&#35299;&#37322;&#65292;&#23637;&#31034;&#20102;&#30830;&#20445;&#32852;&#30431;&#19981;&#36229;&#36807;&#20854;&#20048;&#35266;&#19978;&#30028;&#33267;&#23569;&#21644;&#20445;&#35777;&#20854;&#24754;&#35266;&#19979;&#30028;&#19968;&#26679;&#22256;&#38590;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.01442</link><description>&lt;p&gt;
&#21512;&#20316;&#21338;&#24328;&#30340;&#20048;&#35266;&#19982;&#24754;&#35266;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Optimistic and pessimistic approaches for cooperative games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01442
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#28548;&#28165;&#20102;&#20048;&#35266;&#21644;&#24754;&#35266;&#26041;&#27861;&#30340;&#35299;&#37322;&#65292;&#23637;&#31034;&#20102;&#30830;&#20445;&#32852;&#30431;&#19981;&#36229;&#36807;&#20854;&#20048;&#35266;&#19978;&#30028;&#33267;&#23569;&#21644;&#20445;&#35777;&#20854;&#24754;&#35266;&#19979;&#30028;&#19968;&#26679;&#22256;&#38590;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#20316;&#21338;&#24328;&#29702;&#35770;&#26088;&#22312;&#30740;&#31350;&#22914;&#20309;&#21010;&#20998;&#19968;&#32452;&#29609;&#23478;&#20849;&#21516;&#21019;&#36896;&#30340;&#20215;&#20540;&#12290;&#36825;&#20123;&#28216;&#25103;&#36890;&#24120;&#36890;&#36807;&#21487;&#36716;&#35753;&#25928;&#29992;&#30340;&#29305;&#24449;&#20989;&#25968;&#24418;&#24335;&#36827;&#34892;&#30740;&#31350;&#65292;&#35813;&#24418;&#24335;&#20195;&#34920;&#20102;&#27599;&#20010;&#32852;&#30431;&#21487;&#33719;&#24471;&#30340;&#20215;&#20540;&#12290;&#22312;&#23384;&#22312;&#22806;&#37096;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#26377;&#35768;&#22810;&#23450;&#20041;&#36825;&#20010;&#20215;&#20540;&#30340;&#26041;&#24335;&#12290;&#24050;&#32463;&#30740;&#31350;&#20102;&#21508;&#31181;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#19981;&#21516;&#27700;&#24179;&#30340;&#29609;&#23478;&#21512;&#20316;&#20197;&#21450;&#22806;&#37096;&#29609;&#23478;&#23545;&#32852;&#30431;&#20215;&#20540;&#30340;&#24433;&#21709;&#12290;&#23613;&#31649;&#23384;&#22312;&#19981;&#21516;&#30340;&#26041;&#27861;&#65292;&#20294;&#36890;&#24120;&#65292;&#20048;&#35266;&#21644;&#24754;&#35266;&#26041;&#27861;&#20026;&#25112;&#30053;&#20114;&#21160;&#25552;&#20379;&#20102;&#20805;&#20998;&#30340;&#35265;&#35299;&#12290;&#26412;&#25991;&#36890;&#36807;&#25552;&#20379;&#32479;&#19968;&#26694;&#26550;&#26469;&#28548;&#28165;&#36825;&#20123;&#26041;&#27861;&#30340;&#35299;&#37322;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#30830;&#20445;&#27809;&#26377;&#20219;&#20309;&#32852;&#30431;&#33719;&#24471;&#22810;&#20110;&#20182;&#20204;&#65288;&#20048;&#35266;&#65289;&#19978;&#30028;&#30340;&#26159;&#33267;&#23569;&#21644;&#20445;&#35777;&#20182;&#20204;&#65288;&#24754;&#35266;&#65289;&#19979;&#30028;&#19968;&#26679;&#22256;&#38590;&#30340;&#12290;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#22914;&#26524;&#22806;&#37096;&#24615;&#26159;&#36127;&#38754;&#30340;&#65292;&#25552;&#20379;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01442v1 Announce Type: new  Abstract: Cooperative game theory aims to study how to divide a joint value created by a set of players. These games are often studied through the characteristic function form with transferable utility, which represents the value obtainable by each coalition. In the presence of externalities, there are many ways to define this value. Various models that account for different levels of player cooperation and the influence of external players on coalition value have been studied. Although there are different approaches, typically, the optimistic and pessimistic approaches provide sufficient insights into strategic interactions. This paper clarifies the interpretation of these approaches by providing a unified framework. We show that making sure that no coalition receives more than their (optimistic) upper bounds is always at least as difficult as guaranteeing their (pessimistic) lower bounds. We also show that if externalities are negative, providin
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#26377;&#25928;&#30340;&#22312;&#32447;&#31639;&#27861;&#65292;&#22312;&#27809;&#26377;&#20808;&#39564;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#65292;&#33258;&#36866;&#24212;&#23398;&#20064;&#26368;&#20248;&#23450;&#20215;&#21644;&#24191;&#21578;&#31574;&#30053;&#65292;&#36798;&#21040;&#27425;&#32447;&#24615;&#21518;&#24724;&#12290;</title><link>http://arxiv.org/abs/2304.14385</link><description>&lt;p&gt;
&#24102;&#26377;&#36125;&#21494;&#26031;&#35828;&#26381;&#30340;&#21160;&#24577;&#23450;&#20215;&#21644;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Dynamic Pricing and Learning with Bayesian Persuasion. (arXiv:2304.14385v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14385
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#26377;&#25928;&#30340;&#22312;&#32447;&#31639;&#27861;&#65292;&#22312;&#27809;&#26377;&#20808;&#39564;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#65292;&#33258;&#36866;&#24212;&#23398;&#20064;&#26368;&#20248;&#23450;&#20215;&#21644;&#24191;&#21578;&#31574;&#30053;&#65292;&#36798;&#21040;&#27425;&#32447;&#24615;&#21518;&#24724;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#21160;&#24577;&#23450;&#20215;&#21644;&#23398;&#20064;&#35774;&#32622;&#65292;&#22312;&#25353;&#39034;&#24207;&#35774;&#32622;&#20135;&#21697;&#20215;&#26684;&#30340;&#21516;&#26102;&#65292;&#21334;&#23478;&#36824;&#39044;&#20808;&#25215;&#35834;&#8220;&#24191;&#21578;&#26041;&#26696;&#8221;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;&#27599;&#36718;&#24320;&#22987;&#26102;&#65292;&#21334;&#23478;&#21487;&#20197;&#20915;&#23450;&#25552;&#20379;&#20160;&#20040;&#26679;&#30340;&#20449;&#21495;&#26469;&#21578;&#30693;&#20080;&#23478;&#20135;&#21697;&#23454;&#38469;&#30340;&#36136;&#37327;&#12290;&#25105;&#20204;&#20351;&#29992;&#27969;&#34892;&#30340;&#36125;&#21494;&#26031;&#35828;&#26381;&#26694;&#26550;&#26469;&#27169;&#25311;&#36825;&#20123;&#20449;&#21495;&#23545;&#20080;&#23478;&#30340;&#35780;&#20272;&#21644;&#36141;&#20080;&#21453;&#24212;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#21046;&#23450;&#20102;&#22312;&#26368;&#22823;&#21270;&#21334;&#26041;&#39044;&#26399;&#25910;&#20837;&#30340;&#21516;&#26102;&#25214;&#21040;&#24191;&#21578;&#26041;&#26696;&#21644;&#23450;&#20215;&#26041;&#26696;&#30340;&#26368;&#20248;&#35774;&#35745;&#38382;&#39064;&#12290;&#22312;&#27809;&#26377;&#20219;&#20309;&#20808;&#39564;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#35774;&#35745;&#19968;&#20010;&#22312;&#32447;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#21487;&#20197;&#20351;&#29992;&#36807;&#21435;&#30340;&#36141;&#20080;&#21453;&#24212;&#26469;&#33258;&#36866;&#24212;&#22320;&#23398;&#20064;&#26368;&#20248;&#23450;&#20215;&#21644;&#24191;&#21578;&#31574;&#30053;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#31639;&#27861;&#30340;&#21518;&#24724;&#65292;&#19982;&#26368;&#20248;&#30340;&#21315;&#37324;&#20043;&#22564;&#20215;&#26684;&#21644;&#24191;&#21578;&#35745;&#21010;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#19968;&#31181;&#35745;&#31639;&#26377;&#25928;&#30340;&#22312;&#32447;&#31639;&#27861;&#65292;&#21363;&#20351;&#21334;&#23478;&#27809;&#26377;&#20080;&#23478;&#38656;&#27714;&#20989;&#25968;&#30340;&#20808;&#39564;&#30693;&#35782;&#65292;&#20063;&#21487;&#20197;&#23454;&#29616;&#19982;&#26368;&#20339;&#22266;&#23450;&#20215;&#26684;&#21644;&#24191;&#21578;&#26041;&#26696;&#30456;&#20851;&#30340;&#27425;&#32447;&#24615;&#21518;&#24724;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a novel dynamic pricing and learning setting where in addition to setting prices of products in sequential rounds, the seller also ex-ante commits to 'advertising schemes'. That is, in the beginning of each round the seller can decide what kind of signal they will provide to the buyer about the product's quality upon realization. Using the popular Bayesian persuasion framework to model the effect of these signals on the buyers' valuation and purchase responses, we formulate the problem of finding an optimal design of the advertising scheme along with a pricing scheme that maximizes the seller's expected revenue. Without any apriori knowledge of the buyers' demand function, our goal is to design an online algorithm that can use past purchase responses to adaptively learn the optimal pricing and advertising strategy. We study the regret of the algorithm when compared to the optimal clairvoyant price and advertising scheme.  Our main result is a computationally efficient onlin
&lt;/p&gt;</description></item></channel></rss>