<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#26377;&#20851;&#20195;&#29702;&#31867;&#22411;&#30340;&#20391;&#38754;&#20449;&#24687;&#65292;&#24182;&#20855;&#26377;&#21516;&#26102;&#29983;&#25104;&#39640;&#31038;&#20250;&#31119;&#21033;&#21644;&#39640;&#25910;&#20837;&#30340;&#21452;&#30446;&#26631;&#35201;&#27714;&#65292;&#20854;&#20013;&#22522;&#20110;&#26368;&#24369;&#31454;&#20105;&#32773;&#27010;&#24565;&#30340;&#26032;&#39062;&#26500;&#36896;&#25551;&#36848;&#20102;&#20803;&#26426;&#21046;&#30340;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2302.14234</link><description>&lt;p&gt;
&#20855;&#26377;&#20391;&#38754;&#20449;&#24687;&#30340;&#21452;&#30446;&#26631;&#22810;&#32500;&#26426;&#21046;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Bicriteria Multidimensional Mechanism Design with Side Information. (arXiv:2302.14234v3 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.14234
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#26377;&#20851;&#20195;&#29702;&#31867;&#22411;&#30340;&#20391;&#38754;&#20449;&#24687;&#65292;&#24182;&#20855;&#26377;&#21516;&#26102;&#29983;&#25104;&#39640;&#31038;&#20250;&#31119;&#21033;&#21644;&#39640;&#25910;&#20837;&#30340;&#21452;&#30446;&#26631;&#35201;&#27714;&#65292;&#20854;&#20013;&#22522;&#20110;&#26368;&#24369;&#31454;&#20105;&#32773;&#27010;&#24565;&#30340;&#26032;&#39062;&#26500;&#36896;&#25551;&#36848;&#20102;&#20803;&#26426;&#21046;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#22810;&#32500;&#26426;&#21046;&#35774;&#35745;&#30340;&#36890;&#29992;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#26377;&#20851;&#20195;&#29702;&#31867;&#22411;&#30340;&#20391;&#38754;&#20449;&#24687;&#65292;&#20855;&#26377;&#21516;&#26102;&#29983;&#25104;&#39640;&#31038;&#20250;&#31119;&#21033;&#21644;&#39640;&#25910;&#20837;&#30340;&#21452;&#30446;&#26631;&#35201;&#27714;&#12290;&#20391;&#38754;&#20449;&#24687;&#21487;&#20197;&#26469;&#33258;&#21508;&#31181;&#26469;&#28304;----&#20363;&#22914;&#65292;&#26469;&#33258;&#39046;&#22495;&#19987;&#23478;&#30340;&#24314;&#35758;&#65292;&#21382;&#21490;&#20195;&#29702;&#25968;&#25454;&#35757;&#32451;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#39044;&#27979;&#65292;&#29978;&#33267;&#26159;&#26426;&#21046;&#35774;&#35745;&#24072;&#33258;&#24049;&#30340;&#30452;&#35273;----&#22312;&#23454;&#36341;&#20013;&#36825;&#31867;&#20449;&#24687;&#24456;&#20016;&#23500;&#12290;&#26412;&#25991;&#37319;&#29992;&#19981;&#32771;&#34385;&#20391;&#38754;&#20449;&#24687;&#27491;&#30830;&#24615;&#12289;&#20934;&#30830;&#24615;&#25110;&#26469;&#28304;&#30340;&#20808;&#39564;&#35270;&#35282;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#20803;&#26426;&#21046;&#65292;&#23558;&#36755;&#20837;&#30340;&#20391;&#38754;&#20449;&#24687;&#19982;&#20256;&#32479;VCG&#26426;&#21046;&#30340;&#25913;&#36827;&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20123;&#26032;&#39062;&#26500;&#36896;&#65292;&#20197;&#26368;&#24369;&#31454;&#20105;&#32773;&#30340;&#27010;&#24565;&#20026;&#22522;&#30784;&#65292;&#23545;&#25105;&#20204;&#30340;&#20803;&#26426;&#21046;&#30340;&#31119;&#21033;&#12289;&#25910;&#20837;&#21644;&#28608;&#21169;&#29305;&#24615;&#36827;&#34892;&#20102;&#25551;&#36848;&#65292;&#26368;&#24369;&#31454;&#20105;&#32773;&#26159;&#23545;&#31119;&#21033;&#24433;&#21709;&#26368;&#23567;&#30340;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a versatile new methodology for multidimensional mechanism design that incorporates side information about agent types with the bicriteria goal of generating high social welfare and high revenue simultaneously. Side information can come from a variety of sources -- examples include advice from a domain expert, predictions from a machine-learning model trained on historical agent data, or even the mechanism designer's own gut instinct -- and in practice such sources are abundant. In this paper we adopt a prior-free perspective that makes no assumptions on the correctness, accuracy, or source of the side information. First, we design a meta-mechanism that integrates input side information with an improvement of the classical VCG mechanism. The welfare, revenue, and incentive properties of our meta-mechanism are characterized by a number of novel constructions we introduce based on the notion of a weakest competitor, which is an agent that has the smallest impact on welfare. We
&lt;/p&gt;</description></item></channel></rss>