<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#25509;&#25910;&#32773;&#22312;&#25215;&#35834;&#20915;&#31574;&#35268;&#21017;&#26102;&#65292;&#26368;&#20248;&#31574;&#30053;&#26159;&#37319;&#29992;&#37197;&#39069;&#35268;&#21017;&#65292;&#20197;&#23436;&#20840;&#20445;&#25345;&#21457;&#36865;&#32773;&#30340;&#28608;&#21169;&#19968;&#33268;&#12290;</title><link>http://arxiv.org/abs/2310.10024</link><description>&lt;p&gt;
&#39640;&#25928;&#31649;&#29702;&#35828;&#26381;&#21147;&#65306;&#23450;&#39069;&#35268;&#21017;&#30340;&#26368;&#20248;&#24615;
&lt;/p&gt;
&lt;p&gt;
Managing Persuasion Robustly: The Optimality of Quota Rules. (arXiv:2310.10024v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10024
&lt;/p&gt;
&lt;p&gt;
&#25509;&#25910;&#32773;&#22312;&#25215;&#35834;&#20915;&#31574;&#35268;&#21017;&#26102;&#65292;&#26368;&#20248;&#31574;&#30053;&#26159;&#37319;&#29992;&#37197;&#39069;&#35268;&#21017;&#65292;&#20197;&#23436;&#20840;&#20445;&#25345;&#21457;&#36865;&#32773;&#30340;&#28608;&#21169;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#21457;&#36865;&#32773;-&#25509;&#25910;&#32773;&#27169;&#22411;&#65292;&#20854;&#20013;&#25509;&#25910;&#32773;&#21487;&#20197;&#22312;&#21457;&#36865;&#32773;&#30830;&#23450;&#20449;&#24687;&#31574;&#30053;&#20043;&#21069;&#25215;&#35834;&#19968;&#20010;&#20915;&#31574;&#35268;&#21017;&#12290;&#20915;&#31574;&#35268;&#21017;&#21487;&#20197;&#20381;&#36182;&#20110;&#20449;&#21495;&#32467;&#26500;&#21644;&#21457;&#36865;&#32773;&#37319;&#29992;&#30340;&#20449;&#21495;&#23454;&#29616;&#12290;&#36825;&#20010;&#26694;&#26550;&#28085;&#30422;&#20102;&#20174;&#19968;&#20010;&#21033;&#30410;&#30456;&#20851;&#26041;&#65288;&#21457;&#36865;&#32773;&#65289;&#37027;&#37324;&#24449;&#27714;&#24847;&#35265;&#30340;&#20915;&#31574;&#32773;&#65288;&#25509;&#25910;&#32773;&#65289;&#38754;&#20020;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#36825;&#20123;&#24212;&#29992;&#20013;&#65292;&#25509;&#25910;&#32773;&#38754;&#20020;&#30528;&#23545;&#21457;&#36865;&#32773;&#20559;&#22909;&#21644;&#21487;&#34892;&#20449;&#21495;&#32467;&#26500;&#38598;&#21512;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#40065;&#26834;&#20998;&#26512;&#26694;&#26550;&#65292;&#23558;&#26368;&#22823;&#26368;&#23567;&#25928;&#29992;&#12289;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#21644;&#26368;&#23567;&#26368;&#22823;&#36817;&#20284;&#27604;&#32435;&#20837;&#20102;&#29305;&#27530;&#24773;&#20917;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#20026;&#20102;&#23436;&#20840;&#20445;&#25345;&#21457;&#36865;&#32773;&#30340;&#28608;&#21169;&#19968;&#33268;&#65292;&#25509;&#25910;&#32773;&#22312;&#23454;&#29616;&#21518;&#26399;&#26368;&#20248;&#24615;&#30340;&#21516;&#26102;&#65292;&#29306;&#29298;&#20102;&#19968;&#33268;&#24615;&#23450;&#39069;&#35268;&#21017;&#19979;&#34892;&#21160;&#30340;&#36793;&#38469;&#20998;&#24067;&#12290;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;&#26159;&#19968;&#20010;&#37197;&#39069;&#35268;&#21017;&#65292;&#21363;&#20915;&#31574;&#35268;&#21017;&#22312;&#20445;&#35777;&#32422;&#26463;&#26465;&#20214;&#19979;&#65292;&#26368;&#22823;&#21270;&#25509;&#25910;&#32773;&#30340;&#26399;&#26395;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a sender-receiver model where the receiver can commit to a decision rule before the sender determines the information policy. The decision rule can depend on the signal structure and the signal realization that the sender adopts. This framework captures applications where a decision-maker (the receiver) solicit advice from an interested party (sender). In these applications, the receiver faces uncertainty regarding the sender's preferences and the set of feasible signal structures. Consequently, we adopt a unified robust analysis framework that includes max-min utility, min-max regret, and min-max approximation ratio as special cases. We show that it is optimal for the receiver to sacrifice ex-post optimality to perfectly align the sender's incentive. The optimal decision rule is a quota rule, i.e., the decision rule maximizes the receiver's ex-ante payoff subject to the constraint that the marginal distribution over actions adheres to a consistent quota, regardless of the sen
&lt;/p&gt;</description></item></channel></rss>