<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.15890</link><description>&lt;p&gt;
&#24102;&#39044;&#31639;&#30340;&#22810;&#20195;&#29702;&#21512;&#21516;&#35774;&#35745;&#20013;&#21152;&#26435;&#21512;&#21516;&#30340;&#26368;&#20248;&#24615;
&lt;/p&gt;
&lt;p&gt;
Optimality of weighted contracts for multi-agent contract design with a budget
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15890
&lt;/p&gt;
&lt;p&gt;
&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#20043;&#38388;&#30340;&#21512;&#21516;&#35774;&#35745;&#38382;&#39064;&#12290;&#27599;&#20010;&#20195;&#29702;&#21442;&#19982;&#19968;&#20010;&#29420;&#31435;&#20219;&#21153;&#65292;&#32467;&#26524;&#20026;&#25104;&#21151;&#25110;&#22833;&#36133;&#65292;&#20195;&#29702;&#21487;&#20197;&#20184;&#20986;&#20195;&#20215;&#21162;&#21147;&#25552;&#39640;&#25104;&#21151;&#30340;&#27010;&#29575;&#65292;&#20027;&#20307;&#26377;&#22266;&#23450;&#39044;&#31639;&#65292;&#21487;&#20197;&#20026;&#20195;&#29702;&#25552;&#20379;&#19982;&#32467;&#26524;&#30456;&#20851;&#30340;&#22870;&#21169;&#12290;&#20851;&#38190;&#26159;&#65292;&#25105;&#20204;&#20551;&#35774;&#20027;&#20307;&#21482;&#20851;&#24515;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#65292;&#32780;&#19981;&#20851;&#24515;&#39044;&#31639;&#30340;&#25903;&#20986;&#37327;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#20102;&#23545;&#20110;&#26576;&#20123;&#30446;&#26631;&#65292;&#21512;&#21516;&#21482;&#26377;&#24403;&#23427;&#26159;&#25104;&#21151;&#19968;&#20999;&#30340;&#21512;&#21516;&#25165;&#26159;&#26368;&#20248;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#30340;&#19968;&#20010;&#30452;&#25509;&#25512;&#35770;&#26159;&#65292;&#22312;&#36825;&#31181;&#35774;&#23450;&#19979;&#65292;&#35745;&#20214;&#21512;&#21516;&#21644;&#22870;&#37329;&#27744;&#21512;&#21516;&#20174;&#26469;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#28982;&#21518;&#25105;&#20204;&#35777;&#26126;&#65292;&#23545;&#20110;&#20219;&#20309;&#30446;&#26631;&#65292;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#30340;&#22522;&#20110;&#20248;&#20808;&#32423;&#21152;&#26435;&#30340;&#21512;&#21516;&#65292;&#36825;&#20010;&#21512;&#21516;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#65292;&#24182;&#23558;&#39044;&#31639;&#20998;&#37197;&#32473;&#26368;&#39640;&#20248;&#20808;&#32423;&#30340;&#25104;&#21151;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15890v1 Announce Type: new  Abstract: We study a contract design problem between a principal and multiple agents. Each agent participates in an independent task with binary outcomes (success or failure), in which it may exert costly effort towards improving its probability of success, and the principal has a fixed budget which it can use to provide outcome-dependent rewards to the agents. Crucially, we assume the principal cares only about maximizing the agents' probabilities of success, not how much of the budget it expends. We first show that a contract is optimal for some objective if and only if it is a successful-get-everything contract. An immediate consequence of this result is that piece-rate contracts and bonus-pool contracts are never optimal in this setting. We then show that for any objective, there is an optimal priority-based weighted contract, which assigns positive weights and priority levels to the agents, and splits the budget among the highest-priority suc
&lt;/p&gt;</description></item></channel></rss>