<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#30001;&#29992;&#25143;&#21644;&#39564;&#35777;&#32773;&#32452;&#25104;&#30340;PoS&#21306;&#22359;&#38142;&#31995;&#32479;&#20013;&#30340;&#20196;&#29260;&#32463;&#27982;&#35774;&#35745;&#65292;&#25506;&#35752;&#20102;&#31995;&#32479;&#26381;&#21153;&#25552;&#20379;&#19982;&#36866;&#24403;&#22870;&#21169;&#26041;&#26696;&#22914;&#20309;&#20849;&#21516;&#23548;&#33268;&#20855;&#26377;&#21487;&#21462;&#29305;&#24449;&#30340;&#22343;&#34913;&#29366;&#24577;&#12290;</title><link>https://arxiv.org/abs/2403.15429</link><description>&lt;p&gt;
&#21333;&#20196;&#29260; vs &#21452;&#20196;&#29260;&#21306;&#22359;&#38142;&#32463;&#27982;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Single-token vs Two-token Blockchain Tokenomics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15429
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#30001;&#29992;&#25143;&#21644;&#39564;&#35777;&#32773;&#32452;&#25104;&#30340;PoS&#21306;&#22359;&#38142;&#31995;&#32479;&#20013;&#30340;&#20196;&#29260;&#32463;&#27982;&#35774;&#35745;&#65292;&#25506;&#35752;&#20102;&#31995;&#32479;&#26381;&#21153;&#25552;&#20379;&#19982;&#36866;&#24403;&#22870;&#21169;&#26041;&#26696;&#22914;&#20309;&#20849;&#21516;&#23548;&#33268;&#20855;&#26377;&#21487;&#21462;&#29305;&#24449;&#30340;&#22343;&#34913;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#30001;&#29992;&#25143;&#21644;&#39564;&#35777;&#32773;&#32452;&#25104;&#30340;PoS&#21306;&#22359;&#38142;&#31995;&#32479;&#30340;&#20196;&#29260;&#32463;&#27982;&#35774;&#35745;&#20013;&#20135;&#29983;&#30340;&#38271;&#26399;&#22343;&#34913;&#65292;&#20004;&#32773;&#37117;&#33268;&#21147;&#20110;&#26368;&#22823;&#21270;&#33258;&#24049;&#30340;&#25928;&#29992;&#12290;&#39564;&#35777;&#32773;&#26159;&#31995;&#32479;&#32500;&#25252;&#32773;&#65292;&#20182;&#20204;&#36890;&#36807;&#25191;&#34892;&#31995;&#32479;&#27491;&#24120;&#36816;&#34892;&#25152;&#38656;&#30340;&#24037;&#20316;&#26469;&#33719;&#24471;&#20196;&#29260;&#20316;&#20026;&#22870;&#21169;&#65292;&#32780;&#29992;&#25143;&#21017;&#36890;&#36807;&#25903;&#20184;&#36825;&#20123;&#20196;&#29260;&#26469;&#33719;&#21462;&#25152;&#38656;&#30340;&#31995;&#32479;&#26381;&#21153;&#27700;&#24179;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#31995;&#32479;&#26381;&#21153;&#25552;&#20379;&#21644;&#36866;&#24403;&#22870;&#21169;&#26041;&#26696;&#22914;&#20309;&#20849;&#21516;&#23548;&#33268;&#20855;&#26377;&#21487;&#21462;&#29305;&#24449;&#30340;&#22343;&#34913;&#29366;&#24577;&#65306;&#65288;1&#65289;&#21487;&#25345;&#32493;&#24615;&#65306;&#31995;&#32479;&#20445;&#25345;&#21508;&#26041;&#21442;&#19982;&#65292;&#65288;2&#65289;&#21435;&#20013;&#24515;&#21270;&#65306;&#22810;&#20010;&#39564;&#35777;&#32773;&#21442;&#19982;&#65292;&#65288;3&#65289;&#31283;&#23450;&#24615;&#65306;&#29992;&#20110;&#19982;&#31995;&#32479;&#20132;&#26131;&#30340;&#22522;&#30784;&#20196;&#29260;&#30340;&#20215;&#26684;&#36335;&#24452;&#38543;&#26102;&#38388;&#19981;&#20250;&#21457;&#29983;&#22823;&#24133;&#21464;&#21270;&#65292;&#21644;&#65288;4&#65289;&#21487;&#34892;&#24615;&#65306;&#35813;&#26426;&#21046;&#26131;&#20110;&#23454;&#29616;&#20026;&#26234;&#33021;&#21512;&#32422;&#65292;&#21363;&#19981;&#38656;&#35201;&#22312;&#38142;&#19978;&#36827;&#34892;&#20080;&#22238;&#20196;&#29260;&#25110;&#25191;&#34892;&#20854;&#20182;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15429v1 Announce Type: cross  Abstract: We consider long-term equilibria that arise in the tokenomics design of proof-of-stake (PoS) blockchain systems that comprise of users and validators, both striving to maximize their own utilities. Validators are system maintainers who get rewarded with tokens for performing the work necessary for the system to function properly, while users compete and pay with such tokens for getting a desired system service level.   We study how the system service provision and suitable rewards schemes together can lead to equilibria with desirable characteristics (1) viability: the system keeps parties engaged, (2) decentralization: multiple validators are participating, (3) stability: the price path of the underlying token used to transact with the system does not change widely over time, and (4) feasibility: the mechanism is easy to implement as a smart contract, i.e., it does not require fiat reserves on-chain for buy back of tokens or to perfor
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;AMMs&#20004;&#20010;&#37325;&#35201;&#26410;&#35299;&#20915;&#38382;&#39064;&#30340;&#21333;&#19968;&#26426;&#21046;&#65306;&#20943;&#23569;&#23545;&#26377;&#20449;&#24687;&#30340;&#35746;&#21333;&#27969;&#30340;&#25439;&#22833;&#65292;&#26368;&#22823;&#21270;&#23545;&#26080;&#20449;&#24687;&#30340;&#35746;&#21333;&#27969;&#30340;&#25910;&#30410;&#12290;</title><link>https://arxiv.org/abs/2403.03367</link><description>&lt;p&gt;
am-AMM: &#19968;&#20010;&#25293;&#21334;&#31649;&#29702;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;
&lt;/p&gt;
&lt;p&gt;
am-AMM: An Auction-Managed Automated Market Maker
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03367
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;AMMs&#20004;&#20010;&#37325;&#35201;&#26410;&#35299;&#20915;&#38382;&#39064;&#30340;&#21333;&#19968;&#26426;&#21046;&#65306;&#20943;&#23569;&#23545;&#26377;&#20449;&#24687;&#30340;&#35746;&#21333;&#27969;&#30340;&#25439;&#22833;&#65292;&#26368;&#22823;&#21270;&#23545;&#26080;&#20449;&#24687;&#30340;&#35746;&#21333;&#27969;&#30340;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#20570;&#24066;&#21830;&#65288;AMMs&#65289;&#24050;&#25104;&#20026;&#21306;&#22359;&#38142;&#19978;&#21435;&#20013;&#24515;&#21270;&#20132;&#26131;&#25152;&#30340;&#20027;&#35201;&#24066;&#22330;&#26426;&#21046;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;AMMs&#20004;&#20010;&#37325;&#35201;&#26410;&#35299;&#20915;&#38382;&#39064;&#30340;&#21333;&#19968;&#26426;&#21046;&#65306;&#20943;&#23569;&#23545;&#26377;&#20449;&#24687;&#30340;&#35746;&#21333;&#27969;&#30340;&#25439;&#22833;&#65292;&#26368;&#22823;&#21270;&#23545;&#26080;&#20449;&#24687;&#30340;&#35746;&#21333;&#27969;&#30340;&#25910;&#30410;&#12290;&#36825;&#20010;&#8220;&#25293;&#21334;&#31649;&#29702;&#30340;AMM&#8221;&#36890;&#36807;&#22312;&#38142;&#19978;&#36827;&#34892;&#19968;&#27425;&#19981;&#21463;&#23457;&#26597;&#30340;&#25293;&#21334;&#65292;&#20197;&#20020;&#26102;&#34892;&#20351;&#8220;&#27969;&#21160;&#24615;&#27744;&#31649;&#29702;&#32773;&#8221;&#32844;&#33021;&#30340;&#26435;&#21033;&#12290;&#27969;&#21160;&#24615;&#27744;&#31649;&#29702;&#32773;&#35774;&#32622;&#27744;&#30340;&#20132;&#25442;&#36153;&#29575;&#65292;&#24182;&#20174;&#20132;&#25442;&#20013;&#33719;&#24471;&#30340;&#36153;&#29992;&#12290;&#27969;&#21160;&#24615;&#27744;&#31649;&#29702;&#32773;&#21487;&#20197;&#36890;&#36807;&#38024;&#23545;&#23567;&#20215;&#26684;&#27874;&#21160;&#32780;&#23545;&#20914;&#27969;&#21160;&#24615;&#27744;&#26469;&#29420;&#21344;&#19968;&#20123;&#22871;&#21033;&#65292;&#24182;&#19988;&#21487;&#20197;&#35774;&#32622;&#20132;&#25442;&#36153;&#29992;&#65292;&#21253;&#25324;&#38646;&#21806;&#35746;&#21333;&#27969;&#30340;&#20215;&#26684;&#25935;&#24863;&#24615;&#65292;&#24182;&#36866;&#24212;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#26465;&#20214;&#65292;&#26368;&#32456;&#23558;&#20004;&#32773;&#30340;&#25910;&#30410;&#24402;&#32467;&#20026;&#27969;&#21160;&#24615;&#25552;&#20379;&#26041;&#12290;&#27969;&#21160;&#24615;&#25552;&#20379;&#26041;&#21487;&#20197;&#36827;&#20837;&#21644;&#36864;&#20986;&#27744;&#8230;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03367v1 Announce Type: new  Abstract: Automated market makers (AMMs) have emerged as the dominant market mechanism for trading on decentralized exchanges implemented on blockchains. This paper presents a single mechanism that targets two important unsolved problems for AMMs: reducing losses to informed orderflow, and maximizing revenue from uninformed orderflow. The "auction-managed AMM" works by running a censorship-resistant onchain auction for the right to temporarily act as "pool manager" for a constant-product AMM. The pool manager sets the swap fee rate on the pool, and also receives the accrued fees from swaps. The pool manager can exclusively capture some arbitrage by trading against the pool in response to small price movements, and also can set swap fees incorporating price sensitivity of retail orderflow and adapting to changing market conditions, with the benefits from both ultimately accruing to liquidity providers. Liquidity providers can enter and exit the poo
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27169;&#25311;&#25509;&#25910;&#32773;&#34892;&#20026;&#30340;&#36125;&#21494;&#26031;&#21149;&#23548;&#38382;&#39064;&#20013;&#65292;&#21457;&#36865;&#32773;&#35774;&#35745;&#20102;&#19968;&#20010;&#26368;&#20248;&#28040;&#24687;&#31574;&#30053;&#24182;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#26597;&#35810;&#31639;&#27861;&#65292;&#20197;&#20248;&#21270;&#20854;&#39044;&#26399;&#25928;&#29992;&#12290;</title><link>https://arxiv.org/abs/2311.18138</link><description>&lt;p&gt;
&#36890;&#36807;&#27169;&#25311;&#36827;&#34892;&#31639;&#27861;&#24615;&#21149;&#23548;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Persuasion Through Simulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.18138
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27169;&#25311;&#25509;&#25910;&#32773;&#34892;&#20026;&#30340;&#36125;&#21494;&#26031;&#21149;&#23548;&#38382;&#39064;&#20013;&#65292;&#21457;&#36865;&#32773;&#35774;&#35745;&#20102;&#19968;&#20010;&#26368;&#20248;&#28040;&#24687;&#31574;&#30053;&#24182;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#26597;&#35810;&#31639;&#27861;&#65292;&#20197;&#20248;&#21270;&#20854;&#39044;&#26399;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#21149;&#23548;&#38382;&#39064;&#65292;&#20854;&#20013;&#21457;&#36865;&#32773;&#24076;&#26395;&#35828;&#26381;&#25509;&#25910;&#32773;&#37319;&#21462;&#20108;&#20803;&#34892;&#20026;&#65292;&#20363;&#22914;&#36141;&#20080;&#20135;&#21697;&#12290;&#21457;&#36865;&#32773;&#20102;&#35299;&#19990;&#30028;&#30340;&#65288;&#20108;&#20803;&#65289;&#29366;&#24577;&#65292;&#27604;&#22914;&#20135;&#21697;&#36136;&#37327;&#26159;&#39640;&#36824;&#26159;&#20302;&#65292;&#20294;&#26159;&#23545;&#25509;&#25910;&#32773;&#30340;&#20449;&#24565;&#21644;&#25928;&#29992;&#21482;&#26377;&#26377;&#38480;&#30340;&#20449;&#24687;&#12290;&#21463;&#21040;&#23458;&#25143;&#35843;&#26597;&#12289;&#29992;&#25143;&#30740;&#31350;&#21644;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#26368;&#26032;&#36827;&#23637;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#20801;&#35768;&#21457;&#36865;&#32773;&#36890;&#36807;&#26597;&#35810;&#27169;&#25311;&#25509;&#25910;&#32773;&#30340;&#34892;&#20026;&#26469;&#20102;&#35299;&#26356;&#22810;&#20851;&#20110;&#25509;&#25910;&#32773;&#30340;&#20449;&#24687;&#12290;&#22312;&#22266;&#23450;&#25968;&#37327;&#30340;&#26597;&#35810;&#20043;&#21518;&#65292;&#21457;&#36865;&#32773;&#25215;&#35834;&#19968;&#20010;&#28040;&#24687;&#31574;&#30053;&#65292;&#25509;&#25910;&#32773;&#26681;&#25454;&#25910;&#21040;&#30340;&#28040;&#24687;&#26469;&#26368;&#22823;&#21270;&#22905;&#30340;&#39044;&#26399;&#25928;&#29992;&#26469;&#37319;&#21462;&#34892;&#21160;&#12290;&#25105;&#20204;&#23545;&#21457;&#36865;&#32773;&#22312;&#20219;&#20309;&#25509;&#25910;&#32773;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#26368;&#20248;&#28040;&#24687;&#31574;&#30053;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#26597;&#35810;&#31639;&#27861;&#65292;&#20248;&#21270;&#20102;&#36825;&#20010;&#36125;&#21494;&#26031;&#21149;&#23548;&#28216;&#25103;&#20013;&#21457;&#36865;&#32773;&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.18138v2 Announce Type: replace-cross Abstract: We study a Bayesian persuasion problem where a sender wants to persuade a receiver to take a binary action, such as purchasing a product. The sender is informed about the (binary) state of the world, such as whether the quality of the product is high or low, but only has limited information about the receiver's beliefs and utilities. Motivated by customer surveys, user studies, and recent advances in generative AI, we allow the sender to learn more about the receiver by querying an oracle that simulates the receiver's behavior. After a fixed number of queries, the sender commits to a messaging policy and the receiver takes the action that maximizes her expected utility given the message she receives. We characterize the sender's optimal messaging policy given any distribution over receiver types. We then design a polynomial-time querying algorithm that optimizes the sender's expected utility in this Bayesian persuasion game. We 
&lt;/p&gt;</description></item></channel></rss>