<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#22312;&#22810;&#26234;&#20307;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#31574;&#30053;&#24207;&#21015;&#65292;&#25506;&#35752;&#28385;&#36275;&#29305;&#23450;&#32422;&#26463;&#30340;&#31574;&#30053;&#36335;&#24452;&#65292;&#21363;&#28385;&#36275;&#36335;&#24452;&#65292;&#23545;&#20110;&#26500;&#24314;&#32456;&#27490;&#20110;&#22343;&#34913;&#31574;&#30053;&#30340;&#36335;&#24452;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>https://arxiv.org/abs/2403.18079</link><description>&lt;p&gt;
&#27491;&#24577;&#24418;&#24335;&#21338;&#24328;&#20013;&#30340;&#22343;&#34913;&#36335;&#24452;
&lt;/p&gt;
&lt;p&gt;
Paths to Equilibrium in Normal-Form Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18079
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22312;&#22810;&#26234;&#20307;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#31574;&#30053;&#24207;&#21015;&#65292;&#25506;&#35752;&#28385;&#36275;&#29305;&#23450;&#32422;&#26463;&#30340;&#31574;&#30053;&#36335;&#24452;&#65292;&#21363;&#28385;&#36275;&#36335;&#24452;&#65292;&#23545;&#20110;&#26500;&#24314;&#32456;&#27490;&#20110;&#22343;&#34913;&#31574;&#30053;&#30340;&#36335;&#24452;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#26234;&#20307;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#20013;&#65292;&#26234;&#20307;&#20250;&#21453;&#22797;&#22312;&#26102;&#38388;&#19978;&#20132;&#20114;&#65292;&#24182;&#38543;&#30528;&#26032;&#25968;&#25454;&#30340;&#21040;&#26469;&#20462;&#35746;&#20182;&#20204;&#30340;&#31574;&#30053;&#65292;&#20174;&#32780;&#20135;&#29983;&#19968;&#31995;&#21015;&#31574;&#30053;&#27010;&#20917;&#12290;&#26412;&#25991;&#30740;&#31350;&#28385;&#36275;&#19968;&#31181;&#30001;&#24378;&#21270;&#23398;&#20064;&#20013;&#25919;&#31574;&#26356;&#26032;&#21551;&#21457;&#30340;&#25104;&#23545;&#32422;&#26463;&#30340;&#31574;&#30053;&#24207;&#21015;&#65292;&#20854;&#20013;&#22312;&#31532; $t$ &#26399;&#26368;&#20248;&#24212;&#31572;&#30340;&#26234;&#20307;&#22312;&#19979;&#19968;&#26399; $t+1$ &#19981;&#20250;&#25913;&#21464;&#20854;&#31574;&#30053;&#12290;&#36825;&#31181;&#32422;&#26463;&#20165;&#35201;&#27714;&#20248;&#21270;&#26234;&#20307;&#19981;&#26356;&#25913;&#31574;&#30053;&#65292;&#20294;&#24182;&#19981;&#20197;&#20219;&#20309;&#26041;&#24335;&#38480;&#21046;&#20854;&#20182;&#38750;&#26368;&#20248;&#21270;&#26234;&#20307;&#65292;&#22240;&#27492;&#20801;&#35768;&#25506;&#32034;&#12290;&#20855;&#26377;&#27492;&#23646;&#24615;&#30340;&#24207;&#21015;&#34987;&#31216;&#20026;&#28385;&#36275;&#36335;&#24452;&#65292;&#24182;&#22312;&#35768;&#22810; MARL &#31639;&#27861;&#20013;&#33258;&#28982;&#20986;&#29616;&#12290;&#20851;&#20110;&#25112;&#30053;&#21160;&#24577;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#26159;&#65306;&#23545;&#20110;&#32473;&#23450;&#30340;&#21338;&#24328;&#21644;&#21021;&#22987;&#31574;&#30053;&#27010;&#20917;&#65292;&#26159;&#21542;&#24635;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#32456;&#27490;&#20110;&#22343;&#34913;&#31574;&#30053;&#30340;&#28385;&#36275;&#36335;&#24452;&#65311;&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#23545;&#24212;&#30528;&#19968;&#20123;&#37325;&#35201;&#21547;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18079v1 Announce Type: cross  Abstract: In multi-agent reinforcement learning (MARL), agents repeatedly interact across time and revise their strategies as new data arrives, producing a sequence of strategy profiles. This paper studies sequences of strategies satisfying a pairwise constraint inspired by policy updating in reinforcement learning, where an agent who is best responding in period $t$ does not switch its strategy in the next period $t+1$. This constraint merely requires that optimizing agents do not switch strategies, but does not constrain the other non-optimizing agents in any way, and thus allows for exploration. Sequences with this property are called satisficing paths, and arise naturally in many MARL algorithms. A fundamental question about strategic dynamics is such: for a given game and initial strategy profile, is it always possible to construct a satisficing path that terminates at an equilibrium strategy? The resolution of this question has implication
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#36890;&#36807;&#26356;&#26032;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#25552;&#21462;&#29575;&#65292;&#20197;&#22312;&#30719;&#24037;&#21644;&#29992;&#25143;&#20043;&#38388;&#32500;&#25345;&#20581;&#24247;&#24179;&#34913;&#12290;</title><link>https://arxiv.org/abs/2402.15849</link><description>&lt;p&gt;
&#20851;&#20110;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#20877;&#20998;&#37197;&#30340;&#21160;&#24577;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
On the Redistribution of Maximal Extractable Value: A Dynamic Mechanism
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15849
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#36890;&#36807;&#26356;&#26032;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#25552;&#21462;&#29575;&#65292;&#20197;&#22312;&#30719;&#24037;&#21644;&#29992;&#25143;&#20043;&#38388;&#32500;&#25345;&#20581;&#24247;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#24050;&#32463;&#25104;&#20026;&#21306;&#22359;&#38142;&#31995;&#32479;&#35774;&#35745;&#39046;&#22495;&#30340;&#19968;&#20010;&#26032;&#21069;&#27839;&#12290;&#21435;&#20013;&#24515;&#21270;&#21644;&#37329;&#34701;&#30340;&#32467;&#21512;&#36171;&#20104;&#20102;&#21306;&#22359;&#29983;&#20135;&#32773;&#65288;&#21363;&#30719;&#24037;&#65289;&#19981;&#20165;&#36873;&#25321;&#21644;&#28155;&#21152;&#20132;&#26131;&#21040;&#21306;&#22359;&#38142;&#30340;&#26435;&#21147;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#36824;&#21487;&#20197;&#23545;&#20854;&#36827;&#34892;&#25490;&#24207;&#65292;&#20197;&#23613;&#21487;&#33021;&#22810;&#22320;&#20174;&#20013;&#33719;&#21033;&#12290;&#34429;&#28982;&#36825;&#31181;&#20215;&#26684;&#23545;&#20110;&#21306;&#22359;&#29983;&#20135;&#32773;&#25552;&#20379;&#30340;&#26381;&#21153;&#26469;&#35828;&#21487;&#33021;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#38142;&#19978;&#29992;&#25143;&#20174;&#38271;&#36828;&#26469;&#30475;&#21487;&#33021;&#26356;&#24895;&#24847;&#20351;&#29992;&#19981;&#37027;&#20040;&#25504;&#22842;&#24615;&#30340;&#31995;&#32479;&#12290;&#26412;&#25991;&#25552;&#20986;&#23558;MEV&#25552;&#21462;&#29575;&#32435;&#20837;&#21327;&#35758;&#35774;&#35745;&#31354;&#38388;&#20013;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#21033;&#29992;&#27492;&#21442;&#25968;&#26469;&#32500;&#25345;&#30719;&#24037;&#65288;&#38656;&#35201;&#24471;&#21040;&#34917;&#20607;&#65289;&#21644;&#29992;&#25143;&#65288;&#38656;&#35201;&#24863;&#21040;&#34987;&#40723;&#21169;&#36827;&#34892;&#20132;&#26131;&#65289;&#20043;&#38388;&#30340;&#20581;&#24247;&#24179;&#34913;&#12290;&#21463;EIP-1559&#24341;&#20837;&#30340;&#20132;&#26131;&#36153;&#21407;&#21017;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#26088;&#22312;&#36890;&#36807;&#26356;&#26032;MEV&#25552;&#21462;&#29575;&#26469;&#36798;&#21040;&#31283;&#23450;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15849v1 Announce Type: cross  Abstract: Maximal Extractable Value (MEV) has emerged as a new frontier in the design of blockchain systems. The marriage between decentralization and finance gives the power to block producers (a.k.a., miners) not only to select and add transactions to the blockchain but, crucially, also to order them so as to extract as much financial gain as possible for themselves. Whilst this price may be unavoidable for the service provided by block producers, users of the chain may in the long run prefer to use less predatory systems. In this paper, we propose to make the MEV extraction rate part of the protocol design space. Our aim is to leverage this parameter to maintain a healthy balance between miners (who need to be compensated) and users (who need to feel encouraged to transact). Inspired by the principles introduced by EIP-1559 for transaction fees, we design a dynamic mechanism which updates the MEV extraction rate with the goal of stabilizing i
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.06000</link><description>&lt;p&gt;
&#40723;&#21169;&#25968;&#25454;&#20849;&#20139;&#20197;&#36827;&#34892;&#33021;&#28304;&#39044;&#27979;&#65306;&#20855;&#26377;&#30456;&#20851;&#25968;&#25454;&#30340;&#20998;&#26512;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Incentivizing Data Sharing for Energy Forecasting: Analytics Markets with Correlated Data. (arXiv:2310.06000v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06000
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#22320;&#39044;&#27979;&#19981;&#30830;&#23450;&#30340;&#30005;&#21147;&#20135;&#37327;&#23545;&#20110;&#30005;&#21147;&#24066;&#22330;&#30340;&#31038;&#20250;&#31119;&#21033;&#20855;&#26377;&#30410;&#22788;&#65292;&#21487;&#20197;&#20943;&#23569;&#24179;&#34913;&#36164;&#28304;&#30340;&#38656;&#27714;&#12290;&#23558;&#36825;&#31181;&#39044;&#27979;&#25551;&#36848;&#20026;&#19968;&#39033;&#20998;&#26512;&#20219;&#21153;&#65292;&#24403;&#21069;&#25991;&#29486;&#25552;&#20986;&#20102;&#20197;&#20998;&#26512;&#24066;&#22330;&#20316;&#20026;&#28608;&#21169;&#25163;&#27573;&#26469;&#25913;&#21892;&#31934;&#24230;&#30340;&#25968;&#25454;&#20849;&#20139;&#26041;&#27861;&#65292;&#20363;&#22914;&#21033;&#29992;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;&#25361;&#25112;&#22312;&#20110;&#65292;&#24403;&#30456;&#20851;&#25968;&#25454;&#29992;&#20316;&#39044;&#27979;&#30340;&#36755;&#20837;&#29305;&#24449;&#26102;&#65292;&#37325;&#21472;&#20449;&#24687;&#30340;&#20215;&#20540;&#22312;&#20110;&#25910;&#20837;&#20998;&#37197;&#26041;&#38754;&#20351;&#24066;&#22330;&#35774;&#35745;&#22797;&#26434;&#21270;&#65292;&#22240;&#20026;&#36825;&#31181;&#20215;&#20540;&#22312;&#26412;&#36136;&#19978;&#26159;&#32452;&#21512;&#30340;&#12290;&#25105;&#20204;&#20026;&#39118;&#21147;&#39044;&#27979;&#24212;&#29992;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#12290;&#20026;&#20102;&#20998;&#37197;&#25910;&#20837;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#22522;&#20110;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#65292;&#23558;&#20195;&#29702;&#20154;&#30340;&#29305;&#24449;&#35270;&#20026;&#29609;&#23478;&#65292;&#23558;&#20182;&#20204;&#30340;&#30456;&#20114;&#20316;&#29992;&#35270;&#20026;&#19968;&#20010;&#29305;&#24449;&#20989;&#25968;&#21338;&#24328;&#12290;&#25105;&#20204;&#35828;&#26126;&#20102;&#25551;&#36848;&#36825;&#31181;&#21338;&#24328;&#30340;&#22810;&#31181;&#36873;&#39033;&#65292;&#27599;&#20010;&#36873;&#39033;&#37117;&#26377;&#22240;&#26524;&#32454;&#24494;&#24046;&#21035;&#65292;&#24433;&#21709;&#30528;&#29305;&#24449;&#30456;&#20851;&#26102;&#30340;&#24066;&#22330;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reliably forecasting uncertain power production is beneficial for the social welfare of electricity markets by reducing the need for balancing resources. Describing such forecasting as an analytics task, the current literature proposes analytics markets as an incentive for data sharing to improve accuracy, for instance by leveraging spatio-temporal correlations. The challenge is that, when used as input features for forecasting, correlated data complicates the market design with respect to the revenue allocation, as the value of overlapping information is inherently combinatorial. We develop a correlation-aware analytics market for a wind power forecasting application. To allocate revenue, we adopt a Shapley value-based attribution policy, framing the features of agents as players and their interactions as a characteristic function game. We illustrate that there are multiple options to describe such a game, each having causal nuances that influence market behavior when features are cor
&lt;/p&gt;</description></item></channel></rss>