<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#38024;&#23545;&#19977;&#31867;&#21464;&#20998;&#19981;&#31561;&#24335;&#38382;&#39064;&#25552;&#20986;&#20102;&#20855;&#26377;&#38543;&#26426;&#37325;&#25490;&#30340;&#38543;&#26426;&#22806;&#25512;&#27861;&#65288;SEG-RR&#65289;&#65292;&#24182;&#35777;&#26126;&#20854;&#22312;&#21333;&#35843;&#24773;&#20917;&#19979;&#23454;&#29616;&#20102;&#27604;&#22343;&#21248;&#26367;&#25442;&#37319;&#26679;SEG&#26356;&#24555;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.07148</link><description>&lt;p&gt;
&#20855;&#26377;&#38543;&#26426;&#37325;&#25490;&#30340;&#38543;&#26426;&#22806;&#25512;&#27861;&#65306;&#25913;&#36827;&#21464;&#20998;&#19981;&#31561;&#24335;&#30340;&#25910;&#25947;&#24615;
&lt;/p&gt;
&lt;p&gt;
Stochastic Extragradient with Random Reshuffling: Improved Convergence for Variational Inequalities
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07148
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#38024;&#23545;&#19977;&#31867;&#21464;&#20998;&#19981;&#31561;&#24335;&#38382;&#39064;&#25552;&#20986;&#20102;&#20855;&#26377;&#38543;&#26426;&#37325;&#25490;&#30340;&#38543;&#26426;&#22806;&#25512;&#27861;&#65288;SEG-RR&#65289;&#65292;&#24182;&#35777;&#26126;&#20854;&#22312;&#21333;&#35843;&#24773;&#20917;&#19979;&#23454;&#29616;&#20102;&#27604;&#22343;&#21248;&#26367;&#25442;&#37319;&#26679;SEG&#26356;&#24555;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#22806;&#25512;&#27861;&#65288;SEG&#65289;&#26041;&#27861;&#26159;&#35299;&#20915;&#20986;&#29616;&#22312;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#20013;&#30340;&#26377;&#38480;&#27714;&#21644;&#26497;&#23567;-&#26497;&#22823;&#20248;&#21270;&#21644;&#21464;&#20998;&#19981;&#31561;&#24335;&#38382;&#39064;&#65288;VIPs&#65289;&#30340;&#26368;&#27969;&#34892;&#31639;&#27861;&#20043;&#19968;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;SEG&#25910;&#25947;&#20998;&#26512;&#19987;&#27880;&#20110;&#20854;&#24102;&#26367;&#25442;&#21464;&#20307;&#65292;&#32780;&#26041;&#27861;&#30340;&#23454;&#38469;&#23454;&#29616;&#20250;&#38543;&#26426;&#37325;&#26032;&#25490;&#21015;&#20998;&#37327;&#24182;&#25353;&#39034;&#24207;&#20351;&#29992;&#23427;&#20204;&#12290;&#19982;&#24191;&#20026;&#30740;&#31350;&#30340;&#24102;&#26367;&#25442;&#21464;&#20307;&#19981;&#21516;&#65292;&#20855;&#26377;&#38543;&#26426;&#37325;&#25490;&#30340;SEG&#65288;SEG-RR&#65289;&#32570;&#20047;&#24050;&#24314;&#31435;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;&#22312;&#26412;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#38024;&#23545;&#19977;&#31867;VIPs&#65288;i&#65289;&#24378;&#21333;&#35843;&#65292;&#65288;ii&#65289;&#20223;&#23556;&#21644;&#65288;iii&#65289;&#21333;&#35843;&#25552;&#20379;&#20102;SEG-RR&#30340;&#25910;&#25947;&#24615;&#20998;&#26512;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;SEG-RR&#23454;&#29616;&#27604;&#22343;&#21248;&#24102;&#26367;&#25442;&#37319;&#26679;SEG&#20855;&#26377;&#26356;&#24555;&#25910;&#25947;&#36895;&#24230;&#30340;&#26465;&#20214;&#12290;&#22312;&#21333;&#35843;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#30340;SEG-RR&#20998;&#26512;&#20445;&#35777;&#20102;&#25910;&#25947;&#21040;&#20219;&#24847;&#31934;&#24230;&#32780;&#26080;&#38656;&#22823;&#25209;&#37327;&#22823;&#23567;&#65292;&#36825;&#26159;&#23545;&#22823;&#25209;&#37327;&#22823;&#23567;&#32780;&#35328;&#30340;&#24378;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07148v1 Announce Type: cross  Abstract: The Stochastic Extragradient (SEG) method is one of the most popular algorithms for solving finite-sum min-max optimization and variational inequality problems (VIPs) appearing in various machine learning tasks. However, existing convergence analyses of SEG focus on its with-replacement variants, while practical implementations of the method randomly reshuffle components and sequentially use them. Unlike the well-studied with-replacement variants, SEG with Random Reshuffling (SEG-RR) lacks established theoretical guarantees. In this work, we provide a convergence analysis of SEG-RR for three classes of VIPs: (i) strongly monotone, (ii) affine, and (iii) monotone. We derive conditions under which SEG-RR achieves a faster convergence rate than the uniform with-replacement sampling SEG. In the monotone setting, our analysis of SEG-RR guarantees convergence to an arbitrary accuracy without large batch sizes, a strong requirement needed in 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;M/M/1&#25490;&#38431;&#27169;&#22411;&#65292;&#39038;&#23458;&#21487;&#20197;&#26681;&#25454;&#31574;&#30053;&#20915;&#23450;&#21152;&#20837;&#38431;&#21015;&#25110;&#36864;&#20986;&#38431;&#21015;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#19968;&#31867;&#25490;&#38431;&#21046;&#24230;&#65292;&#20351;&#24471;&#22312;&#20219;&#20309;&#21442;&#25968;&#19979;&#65292;&#31038;&#20250;&#25928;&#29575;&#34892;&#20026;&#37117;&#26159;&#22343;&#34913;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2401.13812</link><description>&lt;p&gt;
&#26368;&#20248;&#25490;&#38431;&#21046;&#24230;
&lt;/p&gt;
&lt;p&gt;
Optimal Queueing Regimes. (arXiv:2401.13812v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13812
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;M/M/1&#25490;&#38431;&#27169;&#22411;&#65292;&#39038;&#23458;&#21487;&#20197;&#26681;&#25454;&#31574;&#30053;&#20915;&#23450;&#21152;&#20837;&#38431;&#21015;&#25110;&#36864;&#20986;&#38431;&#21015;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#19968;&#31867;&#25490;&#38431;&#21046;&#24230;&#65292;&#20351;&#24471;&#22312;&#20219;&#20309;&#21442;&#25968;&#19979;&#65292;&#31038;&#20250;&#25928;&#29575;&#34892;&#20026;&#37117;&#26159;&#22343;&#34913;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;M/M/1&#25490;&#38431;&#27169;&#22411;&#65292;&#20854;&#20013;&#39038;&#23458;&#21487;&#20197;&#26681;&#25454;&#31574;&#30053;&#20915;&#23450;&#26159;&#21542;&#21152;&#20837;&#38431;&#21015;&#12289;&#20309;&#26102;&#36864;&#20986;&#38431;&#21015;&#12290;&#25105;&#20204;&#23545;&#25490;&#38431;&#21046;&#24230;&#30340;&#31867;&#21035;&#36827;&#34892;&#20102;&#21051;&#30011;&#65292;&#20351;&#24471;&#22312;&#27169;&#22411;&#30340;&#20219;&#20309;&#21442;&#25968;&#19979;&#65292;&#31038;&#20250;&#25928;&#29575;&#34892;&#20026;&#37117;&#26159;&#22343;&#34913;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider an M/M/1 queueing model where customers can strategically decide whether to join the queue or balk and when to renege. We characterize the class of queueing regimes such that, for any parameters of the model, the socially efficient behavior is an equilibrium outcome.
&lt;/p&gt;</description></item></channel></rss>