<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#30446;&#26631;&#33829;&#38144;&#30340;&#24378;&#30423;&#21033;&#28070;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25932;&#23545;&#24378;&#30423;&#24773;&#22659;&#19979;&#30340;&#36817;&#20046;&#26368;&#20248;&#31639;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.01361</link><description>&lt;p&gt;
&#38024;&#23545;&#30446;&#26631;&#33829;&#38144;&#30340;&#24378;&#30423;&#21033;&#28070;&#26368;&#22823;&#21270;
&lt;/p&gt;
&lt;p&gt;
Bandit Profit-maximization for Targeted Marketing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01361
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#30446;&#26631;&#33829;&#38144;&#30340;&#24378;&#30423;&#21033;&#28070;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25932;&#23545;&#24378;&#30423;&#24773;&#22659;&#19979;&#30340;&#36817;&#20046;&#26368;&#20248;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#39034;&#24207;&#21033;&#28070;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20248;&#21270;&#20215;&#26684;&#21644;&#20687;&#33829;&#38144;&#25903;&#20986;&#36825;&#26679;&#30340;&#36741;&#21161;&#21464;&#37327;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#26088;&#22312;&#22312;&#19968;&#20010;&#20219;&#24847;&#24207;&#21015;&#30340;&#22810;&#20010;&#38656;&#27714;&#26354;&#32447;&#19978;&#26368;&#22823;&#21270;&#21033;&#28070;&#65292;&#27599;&#20010;&#26354;&#32447;&#20381;&#36182;&#20110;&#19968;&#20010;&#19981;&#21516;&#30340;&#36741;&#21161;&#21464;&#37327;&#65292;&#20294;&#20849;&#20139;&#30456;&#21516;&#30340;&#20215;&#26684;&#12290;&#19968;&#20010;&#20856;&#22411;&#30340;&#20363;&#23376;&#26159;&#38024;&#23545;&#33829;&#38144;&#65292;&#20854;&#20013;&#19968;&#23478;&#20844;&#21496;&#65288;&#21334;&#26041;&#65289;&#24076;&#26395;&#22312;&#22810;&#20010;&#24066;&#22330;&#19978;&#38144;&#21806;&#20135;&#21697;&#12290;&#20844;&#21496;&#21487;&#20197;&#20026;&#19981;&#21516;&#24066;&#22330;&#25237;&#20837;&#19981;&#21516;&#30340;&#33829;&#38144;&#25903;&#20986;&#20197;&#20248;&#21270;&#23458;&#25143;&#33719;&#21462;&#65292;&#20294;&#24517;&#39035;&#22312;&#25152;&#26377;&#24066;&#22330;&#19978;&#20445;&#25345;&#30456;&#21516;&#30340;&#20215;&#26684;&#12290;&#27492;&#22806;&#65292;&#24066;&#22330;&#21487;&#33021;&#20855;&#26377;&#24322;&#36136;&#30340;&#38656;&#27714;&#26354;&#32447;&#65292;&#27599;&#20010;&#38656;&#27714;&#26354;&#32447;&#23545;&#20215;&#26684;&#21644;&#33829;&#38144;&#25903;&#20986;&#30340;&#21709;&#24212;&#26041;&#24335;&#19981;&#21516;&#12290;&#20844;&#21496;&#30340;&#30446;&#26631;&#26159;&#26368;&#22823;&#21270;&#27611;&#21033;&#28070;&#65292;&#21363;&#24635;&#25910;&#20837;&#20943;&#21435;&#33829;&#38144;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01361v1 Announce Type: new  Abstract: We study a sequential profit-maximization problem, optimizing for both price and ancillary variables like marketing expenditures. Specifically, we aim to maximize profit over an arbitrary sequence of multiple demand curves, each dependent on a distinct ancillary variable, but sharing the same price. A prototypical example is targeted marketing, where a firm (seller) wishes to sell a product over multiple markets. The firm may invest different marketing expenditures for different markets to optimize customer acquisition, but must maintain the same price across all markets. Moreover, markets may have heterogeneous demand curves, each responding to prices and marketing expenditures differently. The firm's objective is to maximize its gross profit, the total revenue minus marketing costs.   Our results are near-optimal algorithms for this class of problems in an adversarial bandit setting, where demand curves are arbitrary non-adaptive seque
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#19968;&#20215;&#25293;&#21334;&#20013;&#36827;&#34892;&#31454;&#26631;&#30340;&#26032;&#39062;&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#35777;&#26126;&#20102;&#20854;&#22312;&#25112;&#30053;&#32972;&#26223;&#19979;&#30340;&#25928;&#26524;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#38754;&#23545;&#23545;&#31574;&#24615;&#21334;&#23478;&#26102;&#34920;&#29616;&#33391;&#22909;&#65292;&#28608;&#21169;&#20080;&#23478;&#36827;&#34892;&#30495;&#23454;&#30340;&#20132;&#26131;&#65292;&#24182;&#33719;&#24471;&#20102;&#26368;&#20339;&#30340;&#21518;&#24724;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.07363</link><description>&lt;p&gt;
&#22522;&#20110;&#31574;&#30053;&#31283;&#23450;&#24615;&#30340;&#23398;&#20064;&#31639;&#27861;&#22312;&#19968;&#20215;&#25293;&#21334;&#20013;&#30340;&#31454;&#26631;
&lt;/p&gt;
&lt;p&gt;
Strategically-Robust Learning Algorithms for Bidding in First-Price Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07363
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#19968;&#20215;&#25293;&#21334;&#20013;&#36827;&#34892;&#31454;&#26631;&#30340;&#26032;&#39062;&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#35777;&#26126;&#20102;&#20854;&#22312;&#25112;&#30053;&#32972;&#26223;&#19979;&#30340;&#25928;&#26524;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36825;&#20123;&#31639;&#27861;&#22312;&#38754;&#23545;&#23545;&#31574;&#24615;&#21334;&#23478;&#26102;&#34920;&#29616;&#33391;&#22909;&#65292;&#28608;&#21169;&#20080;&#23478;&#36827;&#34892;&#30495;&#23454;&#30340;&#20132;&#26131;&#65292;&#24182;&#33719;&#24471;&#20102;&#26368;&#20339;&#30340;&#21518;&#24724;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#28216;&#25103;&#29702;&#35770;&#21644;&#26426;&#22120;&#23398;&#20064;&#30340;&#20132;&#30028;&#22788;&#65292;&#23398;&#20064;&#22312;&#37325;&#22797;&#30340;&#19968;&#20215;&#25293;&#21334;&#20013;&#36827;&#34892;&#31454;&#26631;&#26159;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#65292;&#30001;&#20110;&#26174;&#31034;&#24191;&#21578;&#36716;&#21521;&#19968;&#20215;&#25293;&#21334;&#65292;&#26368;&#36817;&#21463;&#21040;&#20102;&#24191;&#27867;&#20851;&#27880;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#20985;&#20989;&#25968;&#24418;&#24335;&#65292;&#29992;&#20110;&#19968;&#20215;&#25293;&#21334;&#20013;&#32431;&#31574;&#30053;&#30340;&#31454;&#26631;&#65292;&#24182;&#23558;&#20854;&#29992;&#20110;&#20998;&#26512;&#36825;&#20010;&#38382;&#39064;&#30340;&#33258;&#28982;&#26799;&#24230;&#19978;&#21319;&#31639;&#27861;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#36229;&#36234;&#20102;&#36807;&#21435;&#24037;&#20316;&#30340;&#24046;&#36317;&#65292;&#36824;&#32771;&#34385;&#20102;&#22312;&#32447;&#24191;&#21578;&#24066;&#22330;&#30340;&#25112;&#30053;&#32972;&#26223;&#65292;&#20854;&#20013;&#37096;&#32626;&#20102;&#31454;&#26631;&#31639;&#27861; - &#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#19981;&#20250;&#34987;&#31574;&#30053;&#24615;&#21334;&#23478;&#21033;&#29992;&#65292;&#24182;&#19988;&#23427;&#20204;&#28608;&#21169;&#20080;&#23478;&#35802;&#23454;&#20132;&#26131;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#26368;&#39640;&#31454;&#20105;&#20986;&#20215;&#36890;&#36807;&#23545;&#25239;&#26041;&#24335;&#29983;&#25104;&#26102;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#36798;&#21040;&#20102;$O(\sqrt{T})$&#30340;&#21518;&#24724;&#65292;&#24182;&#34920;&#26126;&#27809;&#26377;&#26356;&#22909;&#30340;&#22312;&#32447;&#31639;&#27861;&#21487;&#20197;&#20570;&#24471;&#26356;&#22909;&#12290;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;&#24403;&#26368;&#39640;&#31454;&#20105;&#20986;&#20215;&#36890;&#36807;&#23545;&#25239;&#26041;&#24335;&#29983;&#25104;&#26102;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#36798;&#21040;&#20102;$O(\log T)$&#30340;&#21518;&#24724;&#12290;
&lt;/p&gt;
&lt;p&gt;
Learning to bid in repeated first-price auctions is a fundamental problem at the interface of game theory and machine learning, which has seen a recent surge in interest due to the transition of display advertising to first-price auctions. In this work, we propose a novel concave formulation for pure-strategy bidding in first-price auctions, and use it to analyze natural Gradient-Ascent-based algorithms for this problem. Importantly, our analysis goes beyond regret, which was the typical focus of past work, and also accounts for the strategic backdrop of online-advertising markets where bidding algorithms are deployed -- we prove that our algorithms cannot be exploited by a strategic seller and that they incentivize truth-telling for the buyer.   Concretely, we show that our algorithms achieve $O(\sqrt{T})$ regret when the highest competing bids are generated adversarially, and show that no online algorithm can do better. We further prove that the regret improves to $O(\log T)$ when th
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;</title><link>https://arxiv.org/abs/2312.15326</link><description>&lt;p&gt;
&#20851;&#20110;&#36830;&#36890;&#19988;&#24378;&#27604;&#20363;&#20999;&#34507;&#31957;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Connected Strongly-Proportional Cake-Cutting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.15326
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#32452;&#20195;&#29702;&#20154;&#20013;&#22914;&#20309;&#20844;&#24179;&#22320;&#20998;&#37197;&#21487;&#21010;&#20998;&#30340;&#24322;&#36136;&#36164;&#28304;&#65292;&#20063;&#31216;&#20026;&#34507;&#31957;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#23384;&#22312;&#30528;&#19968;&#31181;&#20998;&#37197;&#26041;&#24335;&#65292;&#27599;&#20010;&#20195;&#29702;&#20154;&#37117;&#20250;&#25910;&#21040;&#19968;&#20010;&#20215;&#20540;&#20005;&#26684;&#36229;&#36807;&#20182;&#20204;&#27604;&#20363;&#20221;&#39069;&#30340;&#36830;&#32493;&#37096;&#20998;&#65292;&#20063;&#31216;&#20026;*&#24378;&#27604;&#20363;&#20998;&#37197;*&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#21487;&#20197;&#20351;&#29992;&#26368;&#22810;$n \cdot 2^{n-1}$&#20010;&#26597;&#35810;&#26469;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#12290;&#23545;&#20110;&#20855;&#26377;&#20005;&#26684;&#27491;&#20272;&#20540;&#30340;&#20195;&#29702;&#20154;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26356;&#31616;&#21333;&#30340;&#21051;&#30011;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#25152;&#38656;&#30340;&#26597;&#35810;&#25968;&#37327;&#26159;$\Theta(n^2)$&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#19988;&#24403;&#23384;&#22312;&#26102;&#65292;&#32473;&#20986;&#20102;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#65292;&#20351;&#29992;&#20102;&#31867;&#20284;&#25968;&#37327;&#30340;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.15326v2 Announce Type: replace-cross Abstract: We investigate the problem of fairly dividing a divisible heterogeneous resource, also known as a cake, among a set of agents. We characterize the existence of an allocation in which every agent receives a contiguous piece worth strictly more than their proportional share, also known as a *strongly-proportional allocation*. The characterization is supplemented with an algorithm that determines the existence of a connected strongly-proportional allocation using at most $n \cdot 2^{n-1}$ queries. We provide a simpler characterization for agents with strictly positive valuations, and show that the number of queries required to determine the existence of a connected strongly-proportional allocation is in $\Theta(n^2)$. Our proofs are constructive and yield a connected strongly-proportional allocation, when it exists, using a similar number of queries.
&lt;/p&gt;</description></item></channel></rss>