<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#22312;&#22810;&#29366;&#24577;&#30340;&#39118;&#38505;&#20998;&#20139;&#20013;&#65292;&#25105;&#20204;&#23450;&#37327;&#35780;&#20272;&#20102;&#31119;&#21033;&#65292;&#24182;&#35777;&#26126;&#20102;&#38543;&#30528;&#29366;&#24577;&#25968;&#22686;&#21152;&#65292;&#25913;&#21892;&#20010;&#20307;&#31119;&#21033;&#30340;&#31354;&#38388;&#28040;&#22833;&#65292;&#20998;&#37197;&#32473;&#25913;&#36827;&#32858;&#21512;&#36164;&#28304;&#30340;&#33539;&#22260;&#20063;&#28040;&#22833;&#65292;&#24182;&#19988;&#22312;&#20302;&#25928;&#20998;&#37197;&#20013;&#65292;&#36890;&#36807;&#25200;&#21160;&#32858;&#21512;&#36164;&#28304;&#26469;&#22686;&#24378;&#31119;&#21033;&#30340;&#21487;&#33021;&#24615;&#38543;&#29366;&#24577;&#25968;&#30340;&#25351;&#25968;&#22686;&#21152;&#32780;&#21464;&#20026;&#38646;&#65292;&#21516;&#26102;&#65292;&#26576;&#20123;&#20808;&#39564;&#27010;&#29575;&#38598;&#38543;&#30528;&#29366;&#24577;&#31354;&#38388;&#30340;&#22823;&#23567;&#32780;&#32553;&#23567;&#12290;</title><link>http://arxiv.org/abs/2401.07337</link><description>&lt;p&gt;
&#22810;&#29366;&#24577;&#39118;&#38505;&#20998;&#20139;&#20013;&#30340;&#20010;&#20307;&#21644;&#38598;&#20307;&#31119;&#21033;
&lt;/p&gt;
&lt;p&gt;
Individual and Collective Welfare in Risk Sharing with Many States. (arXiv:2401.07337v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07337
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#29366;&#24577;&#30340;&#39118;&#38505;&#20998;&#20139;&#20013;&#65292;&#25105;&#20204;&#23450;&#37327;&#35780;&#20272;&#20102;&#31119;&#21033;&#65292;&#24182;&#35777;&#26126;&#20102;&#38543;&#30528;&#29366;&#24577;&#25968;&#22686;&#21152;&#65292;&#25913;&#21892;&#20010;&#20307;&#31119;&#21033;&#30340;&#31354;&#38388;&#28040;&#22833;&#65292;&#20998;&#37197;&#32473;&#25913;&#36827;&#32858;&#21512;&#36164;&#28304;&#30340;&#33539;&#22260;&#20063;&#28040;&#22833;&#65292;&#24182;&#19988;&#22312;&#20302;&#25928;&#20998;&#37197;&#20013;&#65292;&#36890;&#36807;&#25200;&#21160;&#32858;&#21512;&#36164;&#28304;&#26469;&#22686;&#24378;&#31119;&#21033;&#30340;&#21487;&#33021;&#24615;&#38543;&#29366;&#24577;&#25968;&#30340;&#25351;&#25968;&#22686;&#21152;&#32780;&#21464;&#20026;&#38646;&#65292;&#21516;&#26102;&#65292;&#26576;&#20123;&#20808;&#39564;&#27010;&#29575;&#38598;&#38543;&#30528;&#29366;&#24577;&#31354;&#38388;&#30340;&#22823;&#23567;&#32780;&#32553;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23545;&#39118;&#38505;&#20998;&#20139;&#21644;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#32463;&#20856;&#27169;&#22411;&#20013;&#30340;&#31119;&#21033;&#36827;&#34892;&#20102;&#23450;&#37327;&#35780;&#20272;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#19977;&#31181;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#22312;&#22343;&#34913;&#20998;&#37197;&#20013;&#65292;&#36890;&#36807;&#32473;&#23450;&#30340;&#36793;&#38469;&#25552;&#39640;&#20010;&#20307;&#31119;&#21033;&#65288;&#949;-&#25552;&#39640;&#65289;&#30340;&#31354;&#38388;&#38543;&#30528;&#29366;&#24577;&#25968;&#30340;&#22686;&#21152;&#32780;&#28040;&#22833;&#12290;&#20854;&#27425;&#65292;&#20026;&#20102;&#25552;&#39640;&#20010;&#20307;&#31119;&#21033;&#65292;&#20998;&#37197;&#32473;&#25913;&#36827;&#32858;&#21512;&#36164;&#28304;&#30340;&#33539;&#22260;&#20063;&#28040;&#22833;&#12290;&#31561;&#20215;&#22320;&#35828;&#65306;&#22312;&#20302;&#25928;&#20998;&#37197;&#20013;&#65292;&#23545;&#20110;&#32473;&#23450;&#27700;&#24179;&#30340;&#36164;&#28304;&#27425;&#20248;&#21270;&#65288;&#26681;&#25454;&#36164;&#28304;&#26410;&#20805;&#20998;&#21033;&#29992;&#30340;&#31995;&#25968;&#24230;&#37327;&#65289;&#65292;&#36890;&#36807;&#25200;&#21160;&#32858;&#21512;&#36164;&#28304;&#26469;&#22686;&#24378;&#31119;&#21033;&#30340;&#21487;&#33021;&#24615;&#38543;&#29366;&#24577;&#25968;&#30340;&#25351;&#25968;&#22686;&#21152;&#32780;&#21464;&#20026;&#38646;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20855;&#26377;&#22810;&#20010;&#20808;&#39564;&#27010;&#29575;&#30340;&#26631;&#20934;&#19981;&#30830;&#23450;&#24615;&#35268;&#36991;&#20013;&#30340;&#39640;&#25928;&#39118;&#38505;&#20998;&#20139;&#65292;&#24182;&#26174;&#31034;&#22312;&#20302;&#25928;&#20998;&#37197;&#20013;&#65292;&#26576;&#20123;&#20808;&#39564;&#27010;&#29575;&#38598;&#38543;&#30528;&#29366;&#24577;&#31354;&#38388;&#30340;&#22823;&#23567;&#32780;&#32553;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide a quantitative assessment of welfare in the classical model of risk-sharing and exchange under uncertainty. We prove three kinds of results. First, that in an equilibrium allocation, the scope for improving individual welfare by a given margin (an $\ve$-improvement) vanishes as the number of states increases. Second, that the scope for a change in aggregate resources that may be distributed to enhance individual welfare by a given margin also vanishes. Equivalently: in an inefficient allocation, for a given level of resource sub-optimality (as measured by the coefficient of resource under-utilization), the possibilities for enhancing welfare by perturbing aggregate resources decrease exponentially to zero with the number of states. Finally, we consider efficient risk-sharing in standard models of uncertainty aversion with multiple priors, and show that, in an inefficient allocation, certain sets of priors shrink with the size of the state space.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#31574;&#30053;&#24615;&#20080;&#23478;&#30340;&#24773;&#22659;&#21160;&#24577;&#23450;&#20215;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31574;&#30053;&#21160;&#24577;&#23450;&#20215;&#31574;&#30053;&#65292;&#23558;&#20080;&#23478;&#30340;&#31574;&#30053;&#34892;&#20026;&#32435;&#20837;&#22312;&#32447;&#23398;&#20064;&#20013;&#65292;&#20197;&#26368;&#22823;&#21270;&#21334;&#26041;&#30340;&#32047;&#35745;&#25910;&#30410;&#12290;</title><link>http://arxiv.org/abs/2307.04055</link><description>&lt;p&gt;
&#20855;&#26377;&#31574;&#30053;&#24615;&#20080;&#23478;&#30340;&#24773;&#22659;&#21160;&#24577;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Contextual Dynamic Pricing with Strategic Buyers. (arXiv:2307.04055v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04055
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#31574;&#30053;&#24615;&#20080;&#23478;&#30340;&#24773;&#22659;&#21160;&#24577;&#23450;&#20215;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31574;&#30053;&#21160;&#24577;&#23450;&#20215;&#31574;&#30053;&#65292;&#23558;&#20080;&#23478;&#30340;&#31574;&#30053;&#34892;&#20026;&#32435;&#20837;&#22312;&#32447;&#23398;&#20064;&#20013;&#65292;&#20197;&#26368;&#22823;&#21270;&#21334;&#26041;&#30340;&#32047;&#35745;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20010;&#24615;&#21270;&#23450;&#20215;&#26159;&#20225;&#19994;&#24120;&#29992;&#30340;&#19968;&#31181;&#38024;&#23545;&#20010;&#20307;&#29305;&#24449;&#21046;&#23450;&#20215;&#26684;&#30340;&#31574;&#30053;&#12290;&#22312;&#36825;&#20010;&#36807;&#31243;&#20013;&#65292;&#20080;&#23478;&#20063;&#21487;&#20197;&#36890;&#36807;&#25805;&#32437;&#29305;&#24449;&#25968;&#25454;&#26469;&#33719;&#21462;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#20294;&#36825;&#20063;&#20250;&#23548;&#33268;&#29305;&#23450;&#30340;&#25805;&#20316;&#25104;&#26412;&#12290;&#36825;&#31181;&#31574;&#30053;&#34892;&#20026;&#21487;&#33021;&#20250;&#38459;&#30861;&#20225;&#19994;&#26368;&#22823;&#21270;&#21033;&#28070;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#31574;&#30053;&#24615;&#20080;&#23478;&#30340;&#24773;&#22659;&#21160;&#24577;&#23450;&#20215;&#38382;&#39064;&#12290;&#21334;&#26041;&#26080;&#27861;&#35266;&#23519;&#21040;&#20080;&#23478;&#30340;&#30495;&#23454;&#29305;&#24449;&#65292;&#32780;&#21482;&#33021;&#35266;&#23519;&#21040;&#20080;&#23478;&#26681;&#25454;&#31574;&#30053;&#34892;&#20026;&#25805;&#32437;&#21518;&#30340;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#21334;&#26041;&#21482;&#33021;&#35266;&#23519;&#21040;&#20080;&#23478;&#23545;&#20135;&#21697;&#30340;&#20272;&#20540;&#65292;&#32780;&#26080;&#27861;&#30452;&#25509;&#33719;&#21462;&#20855;&#20307;&#25968;&#20540;&#65292;&#21482;&#33021;&#24471;&#21040;&#19968;&#20010;&#20108;&#36827;&#21046;&#30340;&#21709;&#24212;&#65292;&#34920;&#31034;&#26159;&#21542;&#21457;&#29983;&#38144;&#21806;&#12290;&#37492;&#20110;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31574;&#30053;&#21160;&#24577;&#23450;&#20215;&#31574;&#30053;&#65292;&#23558;&#20080;&#23478;&#30340;&#31574;&#30053;&#34892;&#20026;&#32435;&#20837;&#22312;&#32447;&#23398;&#20064;&#20013;&#65292;&#20197;&#26368;&#22823;&#21270;&#21334;&#26041;&#30340;&#32047;&#35745;&#25910;&#30410;&#12290;&#39318;&#20808;&#35777;&#26126;&#20102;&#29616;&#26377;&#30340;&#19981;&#32771;&#34385;&#31574;&#30053;&#24615;&#30340;&#23450;&#20215;&#31574;&#30053;&#30340;&#23384;&#22312;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Personalized pricing, which involves tailoring prices based on individual characteristics, is commonly used by firms to implement a consumer-specific pricing policy. In this process, buyers can also strategically manipulate their feature data to obtain a lower price, incurring certain manipulation costs. Such strategic behavior can hinder firms from maximizing their profits. In this paper, we study the contextual dynamic pricing problem with strategic buyers. The seller does not observe the buyer's true feature, but a manipulated feature according to buyers' strategic behavior. In addition, the seller does not observe the buyers' valuation of the product, but only a binary response indicating whether a sale happens or not. Recognizing these challenges, we propose a strategic dynamic pricing policy that incorporates the buyers' strategic behavior into the online learning to maximize the seller's cumulative revenue. We first prove that existing non-strategic pricing policies that neglect
&lt;/p&gt;</description></item></channel></rss>