<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#25991;&#31456;&#30740;&#31350;&#20102;&#31169;&#26377;&#31169;&#26377;&#20449;&#24687;&#32467;&#26500;&#65292;&#21363;&#22914;&#20309;&#22312;&#20445;&#25252;&#38544;&#31169;&#30340;&#21069;&#25552;&#19979;&#25552;&#20379;&#20851;&#20110;&#26410;&#30693;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#25551;&#36848;&#20102;&#26368;&#20248;&#30340;&#32467;&#26500;&#24182;&#19982;&#20844;&#24179;&#30340;&#25512;&#33616;&#31995;&#32479;&#32852;&#31995;&#65292;&#24182;&#25506;&#35752;&#20102;&#20854;&#20182;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2112.14356</link><description>&lt;p&gt;
&#31169;&#26377;&#31169;&#26377;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Private Private Information. (arXiv:2112.14356v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.14356
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#30740;&#31350;&#20102;&#31169;&#26377;&#31169;&#26377;&#20449;&#24687;&#32467;&#26500;&#65292;&#21363;&#22914;&#20309;&#22312;&#20445;&#25252;&#38544;&#31169;&#30340;&#21069;&#25552;&#19979;&#25552;&#20379;&#20851;&#20110;&#26410;&#30693;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#25551;&#36848;&#20102;&#26368;&#20248;&#30340;&#32467;&#26500;&#24182;&#19982;&#20844;&#24179;&#30340;&#25512;&#33616;&#31995;&#32479;&#32852;&#31995;&#65292;&#24182;&#25506;&#35752;&#20102;&#20854;&#20182;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31169;&#26377;&#31169;&#26377;&#20449;&#24687;&#32467;&#26500;&#25552;&#20379;&#20851;&#20110;&#26410;&#30693;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#21516;&#26102;&#20445;&#25252;&#38544;&#31169;&#65306;&#19968;&#20010;&#20195;&#29702;&#30340;&#20449;&#21495;&#21253;&#21547;&#20851;&#20110;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#20294;&#20173;&#28982;&#29420;&#31435;&#20110;&#20854;&#20182;&#20154;&#30340;&#25935;&#24863;&#25110;&#31169;&#26377;&#20449;&#24687;&#12290;&#25105;&#20204;&#30740;&#31350;&#36825;&#31181;&#32467;&#26500;&#33021;&#26377;&#22810;&#23569;&#20449;&#24687;&#37327;&#65292;&#24182;&#19988;&#25551;&#36848;&#37027;&#20123;&#26159;&#26368;&#20248;&#30340;&#65292;&#21363;&#22312;&#19981;&#20405;&#29359;&#38544;&#31169;&#30340;&#21069;&#25552;&#19979;&#19981;&#33021;&#26356;&#20855;&#20449;&#24687;&#37327;&#12290;&#25105;&#20204;&#23558;&#32467;&#26524;&#32852;&#31995;&#21040;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20844;&#24179;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#35768;&#22810;&#20854;&#20182;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
A private private information structure delivers information about an unknown state while preserving privacy: An agent's signal contains information about the state but remains independent of others' sensitive or private information. We study how informative such structures can be, and characterize those that are optimal in the sense that they cannot be made more informative without violating privacy. We connect our results to fairness in recommendation systems and explore a number of further applications.
&lt;/p&gt;</description></item></channel></rss>