<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#30740;&#31350;&#20174;&#22312;&#32447;&#23398;&#20064;&#30340;&#35270;&#35282;&#30740;&#31350;&#20102;&#37325;&#22797;&#30340;&#22996;&#25176;-&#20195;&#29702;&#38382;&#39064;&#65292;&#38024;&#23545;&#19981;&#21516;&#24773;&#24418;&#25552;&#20986;&#20102;&#35774;&#35745;&#23398;&#20064;&#31639;&#27861;&#30340;&#19981;&#21516;&#26041;&#27861;&#21644;&#25216;&#26415;&#65292;&#21253;&#25324;&#24322;&#36136;&#20195;&#29702;&#12289;&#21516;&#36136;&#20195;&#29702;&#21644;&#38750;&#21333;&#32431;&#35270;&#35282;&#20195;&#29702;&#12290;</title><link>https://arxiv.org/abs/2403.07143</link><description>&lt;p&gt;
&#22312;&#32447;&#21512;&#21516;&#35774;&#35745;&#30340;&#26032;&#35270;&#35282;&#65306;&#24322;&#36136;&#12289;&#21516;&#36136;&#12289;&#38750;&#21333;&#32431;&#35270;&#35282;&#20195;&#29702;&#21644;&#22242;&#38431;&#29983;&#20135;
&lt;/p&gt;
&lt;p&gt;
New Perspectives in Online Contract Design: Heterogeneous, Homogeneous, Non-myopic Agents and Team Production
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07143
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20174;&#22312;&#32447;&#23398;&#20064;&#30340;&#35270;&#35282;&#30740;&#31350;&#20102;&#37325;&#22797;&#30340;&#22996;&#25176;-&#20195;&#29702;&#38382;&#39064;&#65292;&#38024;&#23545;&#19981;&#21516;&#24773;&#24418;&#25552;&#20986;&#20102;&#35774;&#35745;&#23398;&#20064;&#31639;&#27861;&#30340;&#19981;&#21516;&#26041;&#27861;&#21644;&#25216;&#26415;&#65292;&#21253;&#25324;&#24322;&#36136;&#20195;&#29702;&#12289;&#21516;&#36136;&#20195;&#29702;&#21644;&#38750;&#21333;&#32431;&#35270;&#35282;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#20174;&#22312;&#32447;&#23398;&#20064;&#30340;&#35270;&#35282;&#30740;&#31350;&#20102;&#37325;&#22797;&#30340;&#22996;&#25176;-&#20195;&#29702;&#38382;&#39064;&#12290; &#22996;&#25176;&#26041;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;&#37325;&#22797;&#20114;&#21160;&#23398;&#20064;&#26368;&#22823;&#21270;&#20854;&#25928;&#29992;&#30340;&#26368;&#20339;&#21512;&#21516;&#65292;&#32780;&#27809;&#26377;&#20851;&#20110;&#20195;&#29702;&#26041;&#31867;&#22411;&#65288;&#21363;&#20195;&#29702;&#26041;&#30340;&#25104;&#26412;&#21644;&#29983;&#20135;&#20989;&#25968;&#65289;&#30340;&#20808;&#39564;&#30693;&#35782;&#12290; &#25105;&#30740;&#31350;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#24773;&#22659;&#65292;&#22996;&#25176;&#26041;&#22312;&#27599;&#19968;&#36718;&#19982;$\textit{&#21333;&#20010;}$&#20195;&#29702;&#26041;&#31614;&#35746;&#21512;&#21516;&#26102;&#65306;1. &#20195;&#29702;&#26041;&#26159;&#24322;&#36136;&#30340;&#65307;2. &#20195;&#29702;&#26041;&#26159;&#21516;&#36136;&#30340;&#65307;3. &#22996;&#25176;&#26041;&#19982;&#30456;&#21516;&#30340;&#20195;&#29702;&#26041;&#20114;&#21160;&#19988;&#35813;&#20195;&#29702;&#26041;&#26159;&#38750;&#21333;&#32431;&#30340;&#12290; &#25105;&#25552;&#20986;&#19981;&#21516;&#30340;&#26041;&#27861;&#21644;&#25216;&#26415;&#26469;&#35774;&#35745;&#27599;&#31181;&#24773;&#20917;&#19979;&#30340;&#23398;&#20064;&#31639;&#27861;&#12290; &#23545;&#20110;&#24322;&#36136;&#20195;&#29702;&#31867;&#22411;&#65292;&#25105;&#30830;&#23450;&#20102;&#19968;&#20010;&#26465;&#20214;&#65292;&#20801;&#35768;&#23558;&#38382;&#39064;&#30452;&#25509;&#31616;&#21270;&#20026;Lipschitz&#32769;&#34382;&#26426;&#38382;&#39064;&#12290; &#23545;&#20110;&#30456;&#21516;&#20195;&#29702;&#26041;&#65292;&#25105;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#36870;&#21338;&#24328;&#35770;&#30340;&#22810;&#39033;&#24335;&#26679;&#26412;&#22797;&#26434;&#24230;&#26041;&#26696;&#26469;&#23398;&#20064;&#26368;&#20339;&#21512;&#21516;&#12290; &#23545;&#20110;&#25112;&#30053;&#24615;&#38750;&#21333;&#32431;&#20195;&#29702;&#65292;&#25105;&#35774;&#35745;&#20102;&#19968;&#20010;&#20302;&#25112;&#30053;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07143v1 Announce Type: cross  Abstract: This work studies the repeated principal-agent problem from an online learning perspective. The principal's goal is to learn the optimal contract that maximizes her utility through repeated interactions, without prior knowledge of the agent's type (i.e., the agent's cost and production functions).   I study three different settings when the principal contracts with a $\textit{single}$ agent each round: 1. The agents are heterogeneous; 2. the agents are homogenous; 3. the principal interacts with the same agent and the agent is non-myopic. I present different approaches and techniques for designing learning algorithms in each setting. For heterogeneous agent types, I identify a condition that allows the problem to be reduced to Lipschitz bandits directly. For identical agents, I give a polynomial sample complexity scheme to learn the optimal contract based on inverse game theory. For strategic non-myopic agents, I design a low strategic
&lt;/p&gt;</description></item></channel></rss>