<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#29289;&#29702;&#30340;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#65292;&#21487;&#20197;&#30452;&#25509;&#32534;&#30721;&#24067;&#26009;&#27169;&#25311;&#30340;&#29289;&#29702;&#29305;&#24449;&#65292;&#23454;&#29616;&#24555;&#36895;&#21644;&#23454;&#26102;&#27169;&#25311;&#65292;&#24182;&#22312;&#19981;&#20351;&#29992;&#26032;&#25968;&#25454;&#35757;&#32451;&#30340;&#24773;&#20917;&#19979;&#36890;&#36807;&#27979;&#35797;&#34920;&#29616;&#20986;&#19982;&#22522;&#32447;&#30340;&#19968;&#33268;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.12820</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#29289;&#29702;&#30340;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#29992;&#20110;&#24067;&#26009;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
A Physics-embedded Deep Learning Framework for Cloth Simulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12820
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#29289;&#29702;&#30340;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#65292;&#21487;&#20197;&#30452;&#25509;&#32534;&#30721;&#24067;&#26009;&#27169;&#25311;&#30340;&#29289;&#29702;&#29305;&#24449;&#65292;&#23454;&#29616;&#24555;&#36895;&#21644;&#23454;&#26102;&#27169;&#25311;&#65292;&#24182;&#22312;&#19981;&#20351;&#29992;&#26032;&#25968;&#25454;&#35757;&#32451;&#30340;&#24773;&#20917;&#19979;&#36890;&#36807;&#27979;&#35797;&#34920;&#29616;&#20986;&#19982;&#22522;&#32447;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31934;&#32454;&#30340;&#24067;&#26009;&#27169;&#25311;&#38271;&#26399;&#20197;&#26469;&#19968;&#30452;&#26159;&#35745;&#31639;&#26426;&#22270;&#24418;&#23398;&#20013;&#25152;&#26399;&#26395;&#30340;&#12290;&#20026;&#25913;&#36827;&#21463;&#21147;&#20132;&#20114;&#12289;&#30896;&#25758;&#22788;&#29702;&#21644;&#25968;&#20540;&#31215;&#20998;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#26041;&#27861;&#12290;&#28145;&#24230;&#23398;&#20064;&#26377;&#28508;&#21147;&#23454;&#29616;&#24555;&#36895;&#21644;&#23454;&#26102;&#27169;&#25311;&#65292;&#20294;&#24120;&#35265;&#30340;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#36890;&#24120;&#38656;&#35201;&#22823;&#37327;&#21442;&#25968;&#26469;&#25429;&#33719;&#24067;&#26009;&#21160;&#21147;&#23398;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#30452;&#25509;&#32534;&#30721;&#24067;&#26009;&#27169;&#25311;&#29289;&#29702;&#29305;&#24449;&#30340;&#29289;&#29702;&#23884;&#20837;&#23398;&#20064;&#26694;&#26550;&#12290;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#34920;&#31034;&#36136;&#28857;-&#24377;&#31783;&#31995;&#32479;&#30340;&#31354;&#38388;&#30456;&#20851;&#24615;&#65292;&#20043;&#21518;&#35774;&#35745;&#20102;&#19977;&#20010;&#20998;&#25903;&#26469;&#23398;&#20064;&#24067;&#26009;&#29289;&#29702;&#30340;&#32447;&#24615;&#12289;&#38750;&#32447;&#24615;&#21644;&#26102;&#38388;&#23548;&#25968;&#29305;&#24449;&#12290;&#35813;&#26694;&#26550;&#36824;&#21487;&#20197;&#36890;&#36807;&#20256;&#32479;&#27169;&#25311;&#22120;&#25110;&#23376;&#31070;&#32463;&#32593;&#32476;&#19982;&#20854;&#20182;&#22806;&#37096;&#21147;&#21644;&#30896;&#25758;&#22788;&#29702;&#36827;&#34892;&#38598;&#25104;&#12290;&#27169;&#22411;&#22312;&#19981;&#20351;&#29992;&#26032;&#25968;&#25454;&#36827;&#34892;&#35757;&#32451;&#30340;&#24773;&#20917;&#19979;&#65292;&#22312;&#19981;&#21516;&#30340;&#24067;&#26009;&#21160;&#30011;&#26696;&#20363;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#19982;&#22522;&#32447;&#30340;&#19968;&#33268;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12820v1 Announce Type: cross  Abstract: Delicate cloth simulations have long been desired in computer graphics. Various methods were proposed to improve engaged force interactions, collision handling, and numerical integrations. Deep learning has the potential to achieve fast and real-time simulation, but common neural network structures often demand many parameters to capture cloth dynamics. This paper proposes a physics-embedded learning framework that directly encodes physical features of cloth simulation. The convolutional neural network is used to represent spatial correlations of the mass-spring system, after which three branches are designed to learn linear, nonlinear, and time derivate features of cloth physics. The framework can also integrate with other external forces and collision handling through either traditional simulators or sub neural networks. The model is tested across different cloth animation cases, without training with new data. Agreement with baselin
&lt;/p&gt;</description></item></channel></rss>