<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#26088;&#22312;&#36890;&#36807;&#20248;&#21270;&#25581;&#31034;&#32852;&#30431;&#20215;&#20540;&#30340;&#39034;&#24207;&#26469;&#20943;&#23569;&#19981;&#23436;&#20840;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;&#20048;&#35266;&#20559;&#35823;&#12290;</title><link>https://arxiv.org/abs/2402.01930</link><description>&lt;p&gt;
&#20943;&#23569;&#19981;&#23436;&#20840;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;&#20048;&#35266;&#20559;&#35823;
&lt;/p&gt;
&lt;p&gt;
Reducing Optimism Bias in Incomplete Cooperative Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01930
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#26088;&#22312;&#36890;&#36807;&#20248;&#21270;&#25581;&#31034;&#32852;&#30431;&#20215;&#20540;&#30340;&#39034;&#24207;&#26469;&#20943;&#23569;&#19981;&#23436;&#20840;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;&#20048;&#35266;&#20559;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#20316;&#21338;&#24328;&#29702;&#35770;&#22312;&#24403;&#20195;&#20154;&#24037;&#26234;&#33021;&#20013;&#20855;&#26377;&#24191;&#27867;&#30340;&#24212;&#29992;&#65292;&#21253;&#25324;&#35299;&#37322;&#24615;&#26426;&#22120;&#23398;&#20064;&#12289;&#36164;&#28304;&#20998;&#37197;&#21644;&#21327;&#21516;&#20915;&#31574;&#31561;&#39046;&#22495;&#12290;&#28982;&#32780;&#65292;&#25351;&#23450;&#19968;&#20010;&#21512;&#20316;&#21338;&#24328;&#38656;&#35201;&#20026;&#25351;&#25968;&#22810;&#20010;&#32852;&#30431;&#20998;&#37197;&#20215;&#20540;&#65292;&#24182;&#19988;&#22312;&#23454;&#36341;&#20013;&#33719;&#24471;&#19968;&#20010;&#32852;&#30431;&#20215;&#20540;&#21487;&#33021;&#20250;&#28040;&#32791;&#22823;&#37327;&#36164;&#28304;&#12290;&#28982;&#32780;&#65292;&#31616;&#21333;&#22320;&#19981;&#20844;&#24320;&#26576;&#20123;&#32852;&#30431;&#30340;&#20215;&#20540;&#20250;&#24341;&#20837;&#20851;&#20110;&#20010;&#20307;&#23545;&#38598;&#20307;&#22823;&#32852;&#30431;&#30340;&#36129;&#29486;&#30340;&#27169;&#31946;&#24615;&#12290;&#36825;&#31181;&#27169;&#31946;&#24615;&#32463;&#24120;&#23548;&#33268;&#29609;&#23478;&#25345;&#26377;&#36807;&#20110;&#20048;&#35266;&#30340;&#26399;&#26395;&#65292;&#20854;&#28304;&#20110;&#20869;&#22312;&#20559;&#35265;&#25110;&#25112;&#30053;&#32771;&#34385;&#65292;&#36827;&#32780;&#24120;&#24120;&#23548;&#33268;&#38598;&#20307;&#35201;&#27714;&#36229;&#36807;&#23454;&#38469;&#30340;&#22823;&#32852;&#30431;&#20215;&#20540;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#26088;&#22312;&#20248;&#21270;&#25581;&#31034;&#32852;&#30431;&#20215;&#20540;&#30340;&#39034;&#24207;&#65292;&#20197;&#23454;&#29616;&#26377;&#25928;&#22320;&#32553;&#23567;&#21512;&#20316;&#21338;&#24328;&#20013;&#29609;&#23478;&#26399;&#26395;&#19982;&#21487;&#23454;&#29616;&#32467;&#26524;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cooperative game theory has diverse applications in contemporary artificial intelligence, including domains like interpretable machine learning, resource allocation, and collaborative decision-making. However, specifying a cooperative game entails assigning values to exponentially many coalitions, and obtaining even a single value can be resource-intensive in practice. Yet simply leaving certain coalition values undisclosed introduces ambiguity regarding individual contributions to the collective grand coalition. This ambiguity often leads to players holding overly optimistic expectations, stemming from either inherent biases or strategic considerations, frequently resulting in collective claims exceeding the actual grand coalition value. In this paper, we present a framework aimed at optimizing the sequence for revealing coalition values, with the overarching goal of efficiently closing the gap between players' expectations and achievable outcomes in cooperative games. Our contributio
&lt;/p&gt;</description></item></channel></rss>