<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>Frankenstein&#26159;&#19968;&#20010;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#21333;&#20010;&#36890;&#36947;&#20013;&#21516;&#26102;&#29983;&#25104;&#22810;&#20010;&#35821;&#20041;&#30456;&#20851;&#30340;3D&#24418;&#29366;&#65292;&#20026;&#29983;&#25104;&#25151;&#38388;&#20869;&#37096;&#21644;&#20154;&#31867;&#21270;&#36523;&#31561;&#22330;&#26223;&#25552;&#20379;&#20102;&#26377;&#24076;&#26395;&#30340;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.16210</link><description>&lt;p&gt;
Frankenstein: &#22312;&#19968;&#20010;&#19977;&#38754;&#20301;&#24179;&#38754;&#20013;&#29983;&#25104;&#35821;&#20041;-&#32452;&#21512;&#24335;3D&#22330;&#26223;
&lt;/p&gt;
&lt;p&gt;
Frankenstein: Generating Semantic-Compositional 3D Scenes in One Tri-Plane
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16210
&lt;/p&gt;
&lt;p&gt;
Frankenstein&#26159;&#19968;&#20010;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#21333;&#20010;&#36890;&#36947;&#20013;&#21516;&#26102;&#29983;&#25104;&#22810;&#20010;&#35821;&#20041;&#30456;&#20851;&#30340;3D&#24418;&#29366;&#65292;&#20026;&#29983;&#25104;&#25151;&#38388;&#20869;&#37096;&#21644;&#20154;&#31867;&#21270;&#36523;&#31561;&#22330;&#26223;&#25552;&#20379;&#20102;&#26377;&#24076;&#26395;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;Frankenstein&#65292;&#36825;&#26159;&#19968;&#20010;&#22522;&#20110;&#25193;&#25955;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#21333;&#20010;&#36890;&#36947;&#20013;&#29983;&#25104;&#35821;&#20041;-&#32452;&#21512;&#24335;3D&#22330;&#26223;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#36755;&#20986;&#21333;&#20010;&#32479;&#19968;&#30340;3D&#24418;&#29366;&#19981;&#21516;&#65292;Frankenstein&#21516;&#26102;&#29983;&#25104;&#22810;&#20010;&#29420;&#31435;&#30340;&#24418;&#29366;&#65292;&#27599;&#20010;&#23545;&#24212;&#19968;&#20010;&#35821;&#20041;&#19978;&#26377;&#24847;&#20041;&#30340;&#37096;&#20998;&#12290;3D&#22330;&#26223;&#20449;&#24687;&#32534;&#30721;&#22312;&#19968;&#20010;&#19977;&#38754;&#20301;&#24179;&#38754;&#24352;&#37327;&#20013;&#65292;&#20174;&#20013;&#21487;&#20197;&#35299;&#30721;&#22810;&#20010;&#31526;&#21495;&#36317;&#31163;&#20989;&#25968;&#65288;SDF&#65289;&#22330;&#20197;&#34920;&#31034;&#32452;&#21512;&#24418;&#29366;&#12290;&#22312;&#35757;&#32451;&#26399;&#38388;&#65292;&#19968;&#20010;&#33258;&#32534;&#30721;&#22120;&#23558;&#19977;&#38754;&#20301;&#24179;&#38754;&#21387;&#32553;&#21040;&#28508;&#22312;&#31354;&#38388;&#65292;&#28982;&#21518;&#20351;&#29992;&#21435;&#22122;&#25193;&#25955;&#36807;&#31243;&#26469;&#36924;&#36817;&#32452;&#21512;&#22330;&#26223;&#30340;&#20998;&#24067;&#12290;Frankenstein&#22312;&#29983;&#25104;&#25151;&#38388;&#20869;&#37096;&#21644;&#20855;&#26377;&#33258;&#21160;&#20998;&#31163;&#37096;&#20998;&#30340;&#20154;&#31867;&#21270;&#36523;&#26041;&#38754;&#34920;&#29616;&#20986;&#26377;&#24076;&#26395;&#30340;&#32467;&#26524;&#12290;&#29983;&#25104;&#30340;&#22330;&#26223;&#26377;&#21161;&#20110;&#35768;&#22810;&#19979;&#28216;&#24212;&#29992;&#65292;&#20363;&#22914;&#37096;&#20998;&#37325;&#36148;&#22270;&#12289;&#25151;&#38388;&#25110;&#21270;&#36523;&#34915;&#26381;&#30340;&#23545;&#35937;&#37325;&#26032;&#25490;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16210v1 Announce Type: cross  Abstract: We present Frankenstein, a diffusion-based framework that can generate semantic-compositional 3D scenes in a single pass. Unlike existing methods that output a single, unified 3D shape, Frankenstein simultaneously generates multiple separated shapes, each corresponding to a semantically meaningful part. The 3D scene information is encoded in one single tri-plane tensor, from which multiple Singed Distance Function (SDF) fields can be decoded to represent the compositional shapes. During training, an auto-encoder compresses tri-planes into a latent space, and then the denoising diffusion process is employed to approximate the distribution of the compositional scenes. Frankenstein demonstrates promising results in generating room interiors as well as human avatars with automatically separated parts. The generated scenes facilitate many downstream applications, such as part-wise re-texturing, object rearrangement in the room or avatar clo
&lt;/p&gt;</description></item></channel></rss>