<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38271;&#26399;&#39033;&#30446;&#20013;&#38599;&#20323;&#20195;&#29702;&#20154;&#30340;&#26816;&#26597;&#31574;&#30053;&#12290;&#21608;&#26399;&#24615;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#21152;&#36895;&#31361;&#30772;&#65292;&#38543;&#26426;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#24310;&#36831;&#23849;&#28291;&#12290;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20915;&#23450;&#20102;&#20182;&#22312;&#24809;&#32602;&#26102;&#38388;&#26041;&#38754;&#30340;&#39118;&#38505;&#24577;&#24230;&#12290;</title><link>http://arxiv.org/abs/2304.01385</link><description>&lt;p&gt;
&#26816;&#26597;&#26102;&#38388;&#21487;&#39044;&#27979;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Should the Timing of Inspections be Predictable?. (arXiv:2304.01385v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01385
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38271;&#26399;&#39033;&#30446;&#20013;&#38599;&#20323;&#20195;&#29702;&#20154;&#30340;&#26816;&#26597;&#31574;&#30053;&#12290;&#21608;&#26399;&#24615;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#21152;&#36895;&#31361;&#30772;&#65292;&#38543;&#26426;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#24310;&#36831;&#23849;&#28291;&#12290;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20915;&#23450;&#20102;&#20182;&#22312;&#24809;&#32602;&#26102;&#38388;&#26041;&#38754;&#30340;&#39118;&#38505;&#24577;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20301;&#22996;&#25176;&#20154;&#32856;&#35831;&#19968;&#20010;&#20195;&#29702;&#20154;&#38271;&#26399;&#20174;&#20107;&#24037;&#20316;&#65292;&#35813;&#24037;&#20316;&#20250;&#22312;&#26576;&#20010;&#26102;&#21051;&#31361;&#30772;&#25110;&#32773;&#23849;&#28291;&#12290;&#22312;&#27599;&#20010;&#26102;&#21051;&#65292;&#20195;&#29702;&#20154;&#20250;&#31169;&#19979;&#36873;&#25321;&#24037;&#20316;&#25110;&#36867;&#36991;&#36131;&#20219;&#12290;&#24037;&#20316;&#21487;&#20197;&#22686;&#21152;&#31361;&#30772;&#21040;&#26469;&#30340;&#36895;&#24230;&#24182;&#20943;&#23569;&#23849;&#28291;&#21040;&#26469;&#30340;&#36895;&#24230;&#12290;&#20026;&#20102;&#28608;&#21169;&#20195;&#29702;&#20154;&#24037;&#20316;&#65292;&#22996;&#25176;&#20154;&#20250;&#36827;&#34892;&#26114;&#36149;&#30340;&#26816;&#26597;&#65292;&#22914;&#26524;&#21457;&#29616;&#20195;&#29702;&#20154;&#22312;&#36867;&#36991;&#36131;&#20219;&#65292;&#23601;&#20250;&#35299;&#38599;&#20182;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#22996;&#25176;&#20154;&#30340;&#26368;&#20339;&#26816;&#26597;&#31574;&#30053;&#12290;&#24403;&#24037;&#20316;&#20027;&#35201;&#21152;&#36895;&#31361;&#30772;&#26102;&#65292;&#21608;&#26399;&#24615;&#26816;&#26597;&#26159;&#26368;&#20248;&#30340;&#12290;&#24403;&#24037;&#20316;&#20027;&#35201;&#24310;&#36831;&#23849;&#28291;&#26102;&#65292;&#38543;&#26426;&#26816;&#26597;&#26159;&#26368;&#20248;&#30340;&#12290;&#33267;&#20851;&#37325;&#35201;&#30340;&#26159;&#65292;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20915;&#23450;&#20102;&#20182;&#22312;&#24809;&#32602;&#26102;&#38388;&#26041;&#38754;&#30340;&#39118;&#38505;&#24577;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
A principal hires an agent to work on a long-term project that culminates in a breakthrough or a breakdown. At each time, the agent privately chooses to work or shirk. Working increases the arrival rate of breakthroughs and decreases the arrival rate of breakdowns. To motivate the agent to work, the principal conducts costly inspections. She fires the agent if shirking is detected. We characterize the principal's optimal inspection policy. Periodic inspections are optimal if work primarily speeds up breakthroughs. Random inspections are optimal if work primarily delays breakdowns. Crucially, the agent's actions determine his risk-attitude over the timing of punishments.
&lt;/p&gt;</description></item></channel></rss>