<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20379;&#20102;&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#26426;&#21046;&#65292;&#36890;&#36807;&#24341;&#20837;&#26435;&#37325;&#65292;&#25913;&#36827;&#20102;&#20197;&#21069;&#26080;&#26435;&#37325;&#35774;&#32622;&#19979;&#30340;&#36924;&#36817;&#27604;&#29575;&#65292;&#24182;&#23637;&#31034;&#20102;&#35813;&#26426;&#21046;&#21487;&#20197;&#36866;&#29992;&#20110;&#20844;&#27491;&#20998;&#37197;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2310.14991</link><description>&lt;p&gt;
&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Deterministic Impartial Selection with Weights. (arXiv:2310.14991v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14991
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20379;&#20102;&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#26426;&#21046;&#65292;&#36890;&#36807;&#24341;&#20837;&#26435;&#37325;&#65292;&#25913;&#36827;&#20102;&#20197;&#21069;&#26080;&#26435;&#37325;&#35774;&#32622;&#19979;&#30340;&#36924;&#36817;&#27604;&#29575;&#65292;&#24182;&#23637;&#31034;&#20102;&#35813;&#26426;&#21046;&#21487;&#20197;&#36866;&#29992;&#20110;&#20844;&#27491;&#20998;&#37197;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20844;&#27491;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#22522;&#20110;&#20195;&#29702;&#20154;&#25237;&#31080;&#36873;&#21462;&#19968;&#20010;&#22266;&#23450;&#22823;&#23567;&#20026;$k$&#30340;&#20195;&#29702;&#20154;&#23376;&#38598;&#12290;&#22914;&#26524;&#27809;&#26377;&#20195;&#29702;&#20154;&#21487;&#20197;&#36890;&#36807;&#25913;&#21464;&#33258;&#24049;&#30340;&#25237;&#31080;&#26469;&#24433;&#21709;&#33258;&#24049;&#34987;&#36873;&#25321;&#30340;&#26426;&#20250;&#65292;&#21017;&#36873;&#25321;&#26426;&#21046;&#26159;&#20844;&#27491;&#30340;&#12290;&#22914;&#26524;&#23545;&#20110;&#27599;&#20010;&#23454;&#20363;&#65292;&#25152;&#36873;&#23376;&#38598;&#25152;&#25509;&#25910;&#30340;&#31080;&#25968;&#19982;&#33719;&#24471;&#26368;&#39640;&#31080;&#25968;&#30340;&#22823;&#23567;&#20026;$k$&#30340;&#23376;&#38598;&#25152;&#25509;&#25910;&#30340;&#31080;&#25968;&#30340;&#27604;&#29575;&#33267;&#23569;&#20026;$\alpha$&#30340;&#19968;&#37096;&#20998;&#65292;&#21017;&#35813;&#26426;&#21046;&#26159;$\alpha$-&#26368;&#20248;&#30340;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#26356;&#19968;&#33324;&#30340;&#35774;&#32622;&#20013;&#30740;&#31350;&#20102;&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#26426;&#21046;&#65292;&#24182;&#25552;&#20379;&#20102;&#39318;&#20010;&#36924;&#36817;&#20445;&#35777;&#65292;&#22823;&#32422;&#20026;$1/\lceil 2n/k\rceil$&#12290;&#24403;&#35201;&#36873;&#25321;&#30340;&#20195;&#29702;&#20154;&#25968;&#37327;&#30456;&#23545;&#20110;&#24635;&#20195;&#29702;&#20154;&#25968;&#37327;&#36275;&#22815;&#22823;&#26102;&#65292;&#36825;&#27604;&#20197;&#21069;&#24050;&#30693;&#30340;&#26080;&#26435;&#37325;&#35774;&#32622;&#30340;&#36924;&#36817;&#27604;&#29575;$1/k$&#26377;&#25152;&#25913;&#36827;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26426;&#21046;&#21487;&#20197;&#36866;&#24212;&#20844;&#27491;&#20998;&#37197;&#38382;&#39064;&#65292;&#21363;&#22312;&#20854;&#20013;&#26377;&#22810;&#20010;&#38598;&#21512;&#38656;&#35201;&#36873;&#20986;&#20195;&#29702;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the impartial selection problem, a subset of agents up to a fixed size $k$ among a group of $n$ is to be chosen based on votes cast by the agents themselves. A selection mechanism is impartial if no agent can influence its own chance of being selected by changing its vote. It is $\alpha$-optimal if, for every instance, the ratio between the votes received by the selected subset is at least a fraction of $\alpha$ of the votes received by the subset of size $k$ with the highest number of votes. We study deterministic impartial mechanisms in a more general setting with arbitrarily weighted votes and provide the first approximation guarantee, roughly $1/\lceil 2n/k\rceil$. When the number of agents to select is large enough compared to the total number of agents, this yields an improvement on the previously best known approximation ratio of $1/k$ for the unweighted setting. We further show that our mechanism can be adapted to the impartial assignment problem, in which multiple sets of u
&lt;/p&gt;</description></item></channel></rss>