<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20174;&#38544;&#31169;&#25935;&#24863;&#21334;&#26041;&#25910;&#38598;&#30340;&#25968;&#25454;&#19978;&#25191;&#34892;&#36923;&#36753;&#22238;&#24402;&#30340;&#38382;&#39064;&#65292;&#35774;&#35745;&#20102;&#19968;&#20010;&#20248;&#21270;&#27979;&#35797;&#25439;&#22833;&#12289;&#21334;&#26041;&#38544;&#31169;&#21644;&#25903;&#20184;&#30340;&#21152;&#26435;&#32452;&#21512;&#30340;&#26368;&#20339;&#26426;&#21046;&#65292;&#36890;&#36807;&#32467;&#21512;&#21338;&#24328;&#35770;&#12289;&#32479;&#35745;&#23398;&#20064;&#29702;&#35770;&#21644;&#24046;&#20998;&#38544;&#31169;&#30340;&#24605;&#24819;&#65292;&#35299;&#20915;&#20102;&#20080;&#26041;&#30340;&#30446;&#26631;&#20989;&#25968;&#38750;&#20984;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#24403;&#21334;&#26041;&#25968;&#37327;&#21464;&#22823;&#26102;&#30340;&#28176;&#36817;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2309.10340</link><description>&lt;p&gt;
&#23547;&#25214;&#24179;&#34913;&#65306;&#29992;&#20110;&#24322;&#26500;&#24046;&#20998;&#38544;&#31169;&#25968;&#25454;&#37319;&#38598;&#30340;&#36923;&#36753;&#22238;&#24402;&#30340;&#26368;&#20339;&#26426;&#21046;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Striking a Balance: An Optimal Mechanism Design for Heterogenous Differentially Private Data Acquisition for Logistic Regression. (arXiv:2309.10340v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10340
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20174;&#38544;&#31169;&#25935;&#24863;&#21334;&#26041;&#25910;&#38598;&#30340;&#25968;&#25454;&#19978;&#25191;&#34892;&#36923;&#36753;&#22238;&#24402;&#30340;&#38382;&#39064;&#65292;&#35774;&#35745;&#20102;&#19968;&#20010;&#20248;&#21270;&#27979;&#35797;&#25439;&#22833;&#12289;&#21334;&#26041;&#38544;&#31169;&#21644;&#25903;&#20184;&#30340;&#21152;&#26435;&#32452;&#21512;&#30340;&#26368;&#20339;&#26426;&#21046;&#65292;&#36890;&#36807;&#32467;&#21512;&#21338;&#24328;&#35770;&#12289;&#32479;&#35745;&#23398;&#20064;&#29702;&#35770;&#21644;&#24046;&#20998;&#38544;&#31169;&#30340;&#24605;&#24819;&#65292;&#35299;&#20915;&#20102;&#20080;&#26041;&#30340;&#30446;&#26631;&#20989;&#25968;&#38750;&#20984;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#24403;&#21334;&#26041;&#25968;&#37327;&#21464;&#22823;&#26102;&#30340;&#28176;&#36817;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#20174;&#38544;&#31169;&#25935;&#24863;&#21334;&#26041;&#25910;&#38598;&#30340;&#25968;&#25454;&#19978;&#25191;&#34892;&#36923;&#36753;&#22238;&#24402;&#30340;&#38382;&#39064;&#12290;&#30001;&#20110;&#25968;&#25454;&#26159;&#31169;&#26377;&#30340;&#65292;&#21334;&#26041;&#24517;&#39035;&#36890;&#36807;&#25903;&#20184;&#26469;&#28608;&#21169;&#20182;&#20204;&#25552;&#20379;&#25968;&#25454;&#12290;&#22240;&#27492;&#65292;&#30446;&#26631;&#26159;&#35774;&#35745;&#19968;&#20010;&#26426;&#21046;&#65292;&#20248;&#21270;&#27979;&#35797;&#25439;&#22833;&#12289;&#21334;&#26041;&#38544;&#31169;&#21644;&#25903;&#20184;&#30340;&#21152;&#26435;&#32452;&#21512;&#65292;&#21363;&#22312;&#22810;&#20010;&#24863;&#20852;&#36259;&#30340;&#30446;&#26631;&#20043;&#38388;&#23547;&#25214;&#24179;&#34913;&#12290;&#25105;&#20204;&#36890;&#36807;&#32467;&#21512;&#21338;&#24328;&#35770;&#12289;&#32479;&#35745;&#23398;&#20064;&#29702;&#35770;&#21644;&#24046;&#20998;&#38544;&#31169;&#30340;&#24605;&#24819;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#20080;&#26041;&#30340;&#30446;&#26631;&#20989;&#25968;&#21487;&#33021;&#38750;&#24120;&#38750;&#20984;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#38382;&#39064;&#21442;&#25968;&#30340;&#26576;&#20123;&#26465;&#20214;&#19979;&#65292;&#21487;&#20197;&#36890;&#36807;&#21464;&#37327;&#30340;&#21464;&#25442;&#23558;&#38382;&#39064;&#20984;&#21270;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#24403;&#21334;&#26041;&#25968;&#37327;&#21464;&#22823;&#26102;&#65292;&#20080;&#26041;&#30340;&#27979;&#35797;&#35823;&#24046;&#21644;&#25903;&#20184;&#30340;&#28176;&#36817;&#32467;&#26524;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#36825;&#20123;&#24605;&#24819;&#24212;&#29992;&#20110;&#19968;&#20010;&#30495;&#23454;&#30340;&#21307;&#30103;&#25968;&#25454;&#38598;&#26469;&#23637;&#31034;&#25105;&#20204;&#30340;&#24819;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the problem of performing logistic regression on data collected from privacy-sensitive sellers. Since the data is private, sellers must be incentivized through payments to provide their data. Thus, the goal is to design a mechanism that optimizes a weighted combination of test loss, seller privacy, and payment, i.e., strikes a balance between multiple objectives of interest. We solve the problem by combining ideas from game theory, statistical learning theory, and differential privacy. The buyer's objective function can be highly non-convex. However, we show that, under certain conditions on the problem parameters, the problem can be convexified by using a change of variables. We also provide asymptotic results characterizing the buyer's test error and payments when the number of sellers becomes large. Finally, we demonstrate our ideas by applying them to a real healthcare data set.
&lt;/p&gt;</description></item></channel></rss>