<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#36890;&#36807;&#21338;&#24328;&#35770;&#26041;&#27861;&#25506;&#35752;PinFi&#26426;&#21046;&#21450;&#20854;&#26356;&#24191;&#27867;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;PinFi&#33021;&#22815;&#22312;LPs&#12289;&#21334;&#23478;&#21644;&#20080;&#23478;&#20043;&#38388;&#24314;&#31435;&#21160;&#24577;&#22343;&#34913;&#12290;</title><link>https://arxiv.org/abs/2404.02174</link><description>&lt;p&gt;
&#35802;&#23454;&#30340;PinFi&#31995;&#32479;&#20013;&#22359;&#22870;&#21169;&#30340;&#36793;&#30028;
&lt;/p&gt;
&lt;p&gt;
Bounds of Block Rewards in Honest PinFi Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02174
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21338;&#24328;&#35770;&#26041;&#27861;&#25506;&#35752;PinFi&#26426;&#21046;&#21450;&#20854;&#26356;&#24191;&#27867;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;PinFi&#33021;&#22815;&#22312;LPs&#12289;&#21334;&#23478;&#21644;&#20080;&#23478;&#20043;&#38388;&#24314;&#31435;&#21160;&#24577;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
PinFi&#26159;&#19968;&#31867;&#26032;&#22411;&#30340;&#21327;&#35758;&#65292;&#29992;&#20110;&#21435;&#20013;&#24515;&#21270;&#23450;&#20215;&#36880;&#28176;&#36140;&#20540;&#30340;&#36164;&#20135;&#65292;&#20854;&#20215;&#20540;&#38543;&#30528;&#26102;&#38388;&#33258;&#28982;&#19979;&#38477;&#12290;&#27969;&#21160;&#24615;&#25552;&#20379;&#32773;&#65288;LPs&#65289;&#22312;&#21327;&#35758;&#21151;&#33021;&#21644;&#24066;&#22330;&#25928;&#29575;&#20013;&#36215;&#30528;&#26680;&#24515;&#20316;&#29992;&#12290;&#26412;&#30740;&#31350;&#35299;&#20915;&#20102;&#21327;&#35758;&#20013;&#30340;&#20851;&#38190;&#31283;&#23450;&#24615;&#21644;&#21487;&#25345;&#32493;&#24615;&#25361;&#25112;&#65292;&#21363;LPs&#26356;&#20542;&#21521;&#20110;&#22312;&#22806;&#37096;&#24066;&#22330;&#20986;&#21806;&#32780;&#38750;&#21442;&#19982;&#21327;&#35758;&#65307;&#22312;PinFi&#31995;&#32479;&#20869;&#20986;&#21806;&#32780;&#38750;&#20316;&#20026;LPs&#36827;&#34892;&#36129;&#29486;&#65307;&#20197;&#21450;LPs&#19981;&#24895;&#22312;&#21327;&#35758;&#20869;&#20986;&#21806;&#30340;&#22330;&#26223;&#12290;&#25105;&#20204;&#37319;&#29992;&#21338;&#24328;&#35770;&#26041;&#27861;&#25506;&#35752;PinFi&#30340;&#26426;&#21046;&#21450;&#20854;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#21508;&#31181;&#24120;&#35265;&#26465;&#20214;&#19979;&#65292;&#24182;&#19988;&#20551;&#35774;&#21442;&#19982;&#32773;&#35802;&#23454;&#65292;PinFi&#33021;&#22815;&#22312;LPs&#12289;&#21334;&#23478;&#21644;&#20080;&#23478;&#20043;&#38388;&#24314;&#31435;&#21160;&#24577;&#22343;&#34913;&#12290;&#36825;&#31181;&#24179;&#34913;&#26159;&#36890;&#36807;&#31934;&#24515;&#26657;&#20934;&#30340;&#22870;&#21169;&#26426;&#21046;&#26469;&#32500;&#25345;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02174v1 Announce Type: cross  Abstract: PinFi is a class of novel protocols for decentralized pricing of dissipative assets, whose value naturally declines over time. Central to the protocol's functionality and its market efficiency is the role of liquidity providers (LPs). This study addresses critical stability and sustainability challenges within the protocol, namely: the propensity of LPs to prefer selling in external markets over participation in the protocol; a similar inclination towards selling within the PinFi system rather than contributing as LPs; and a scenario where LPs are disinclined to sell within the protocol. Employing a game-theoretic approach, we explore PinFi's mechanisms and its broader ramifications. Our findings reveal that, under a variety of common conditions and with an assumption of participant integrity, PinFi is capable of fostering a dynamic equilibrium among LPs, sellers, and buyers. This balance is maintained through a carefully calibrated ra
&lt;/p&gt;</description></item><item><title>&#22312;&#22810;&#20010;&#23398;&#21306;&#30340;&#29615;&#22659;&#20013;&#65292;&#23398;&#29983;&#30340;&#30495;&#35802;&#25110;&#32769;&#32451;&#20197;&#21450;&#21463;&#38480;&#21046;&#31243;&#24230;&#30340;&#36873;&#25321;&#20250;&#24433;&#21709;&#20182;&#20204;&#30340;&#36873;&#25321;&#20559;&#22909;&#65292;&#30740;&#31350;&#21457;&#29616;&#19968;&#20123;&#20851;&#38190;&#32467;&#26524;&#20986;&#29616;&#39072;&#20498;&#65292;&#23398;&#29983;&#20043;&#38388;&#30340;&#20114;&#21160;&#20250;&#23548;&#33268;&#23398;&#21306;&#36873;&#25321;&#26426;&#21046;&#30340;&#19981;&#21516;&#20559;&#22909;&#12290;</title><link>https://arxiv.org/abs/2403.04530</link><description>&lt;p&gt;
&#22810;&#21306;&#22495;&#23398;&#26657;&#36873;&#25321;&#65306;&#22312;&#20960;&#20010;&#39046;&#22495;&#20013;&#36827;&#34892;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Multi-District School Choice: Playing on Several Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04530
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20010;&#23398;&#21306;&#30340;&#29615;&#22659;&#20013;&#65292;&#23398;&#29983;&#30340;&#30495;&#35802;&#25110;&#32769;&#32451;&#20197;&#21450;&#21463;&#38480;&#21046;&#31243;&#24230;&#30340;&#36873;&#25321;&#20250;&#24433;&#21709;&#20182;&#20204;&#30340;&#36873;&#25321;&#20559;&#22909;&#65292;&#30740;&#31350;&#21457;&#29616;&#19968;&#20123;&#20851;&#38190;&#32467;&#26524;&#20986;&#29616;&#39072;&#20498;&#65292;&#23398;&#29983;&#20043;&#38388;&#30340;&#20114;&#21160;&#20250;&#23548;&#33268;&#23398;&#21306;&#36873;&#25321;&#26426;&#21046;&#30340;&#19981;&#21516;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;Pathak&#21644;S\"onmez (2008)&#30340;&#24320;&#21019;&#24615;&#27169;&#22411;&#25193;&#23637;&#21040;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#23398;&#21306;&#30340;&#29615;&#22659;&#20013;&#65292;&#27599;&#20010;&#23398;&#21306;&#37117;&#36816;&#34892;&#20854;&#33258;&#24049;&#30340;&#29420;&#31435;&#20013;&#24515;&#21270;&#21305;&#37197;&#65292;&#37325;&#28857;&#20851;&#27880;&#20004;&#20010;&#23398;&#21306;&#30340;&#24773;&#20917;&#12290;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#65292;&#38500;&#20102;&#27599;&#20010;&#23398;&#29983;&#26159;&#30495;&#35802;&#36824;&#26159;&#32769;&#32451;&#20043;&#22806;&#65292;&#22905;&#36824;&#21487;&#20197;&#26159;&#21463;&#38480;&#21046;&#30340; - &#21482;&#33021;&#30003;&#35831;&#33258;&#24049;&#23621;&#20303;&#23398;&#21306;&#20869;&#30340;&#23398;&#26657; - &#25110;&#19981;&#21463;&#38480;&#21046;&#30340; - &#33021;&#22815;&#36873;&#25321;&#20219;&#20309;&#19968;&#20010;&#23398;&#21306;&#36827;&#34892;&#30003;&#35831;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102; Pathak&#21644;S\"onmez (2008) &#20013;&#30340;&#20960;&#20010;&#20851;&#38190;&#32467;&#26524;&#22312;&#24615;&#36136;&#19978;&#21457;&#29983;&#20102;&#21464;&#21270;&#65306; &#19968;&#20010;&#32769;&#32451;&#30340;&#23398;&#29983;&#21487;&#33021;&#24076;&#26395;&#19968;&#20010;&#30495;&#35802;&#30340;&#23398;&#29983;&#21464;&#24471;&#32769;&#32451;&#65292;&#19968;&#20010;&#32769;&#32451;&#30340;&#23398;&#29983;&#21487;&#33021;&#26356;&#21916;&#27426;&#33258;&#24049;&#25152;&#22312;&#23398;&#21306;&#20351;&#29992;&#24310;&#36831;&#25509;&#21463;&#32780;&#19981;&#26159;&#27874;&#22763;&#39039;&#26426;&#21046;&#65292;&#32780;&#19981;&#32771;&#34385;&#20854;&#20182;&#23398;&#21306;&#20351;&#29992;&#30340;&#26426;&#21046;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;&#23398;&#29983;&#23545;&#20854;&#20182;&#23398;&#29983;&#21463;&#38480;&#27700;&#24179;&#30340;&#20559;&#22909;&#12290;&#20854;&#20013;&#35768;&#22810;&#29616;&#35937;&#22823;&#37327;&#20986;&#29616;&#22312;&#22823;&#35268;&#27169;&#30340;&#38543;&#26426;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04530v1 Announce Type: cross  Abstract: We extend the seminal model of Pathak and S\"onmez (2008) to a setting with multiple school districts, each running its own separate centralized match, and focus on the case of two districts. In our setting, in addition to each student being either sincere or sophisticated, she is also either constrained - able to apply only to schools within her own district of residence - or unconstrained - able to choose any single district within which to apply. We show that several key results from Pathak and S\"onmez (2008) qualitatively flip: A sophisticated student may prefer for a sincere student to become sophisticated, and a sophisticated student may prefer for her own district to use Deferred Acceptance over the Boston Mechanism, irrespective of the mechanism used by the other district. We furthermore investigate the preferences of students over the constraint levels of other students. Many of these phenomena appear abundantly in large rand
&lt;/p&gt;</description></item></channel></rss>