<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#35810;&#38382;&#36873;&#27665;&#26377;&#20851;&#23569;&#37327;&#20505;&#36873;&#20154;&#30340;&#25237;&#31080;&#35268;&#21017;&#35745;&#31639;&#38382;&#39064;&#65292;&#23436;&#20840;&#34920;&#24449;&#20102;&#21487;&#35745;&#31639;&#30340;&#20301;&#32622;&#35780;&#20998;&#35268;&#21017;&#38598;&#21512;&#65292;&#24182;&#32473;&#20986;&#20102;&#23545;&#20110;&#30830;&#23450;&#24615;&#25110;&#38543;&#26426;&#31639;&#27861;&#30830;&#23450;&#26368;&#22823;&#24471;&#20998;&#20505;&#36873;&#20154;&#24517;&#39035;&#36827;&#34892;&#30340;&#26597;&#35810;&#27425;&#25968;&#30340;&#21442;&#25968;&#21270;&#19978;&#38480;&#21644;&#19979;&#38480;&#12290;</title><link>https://arxiv.org/abs/2402.11104</link><description>&lt;p&gt;
&#29992;&#35810;&#38382;&#19981;&#23436;&#25972;&#36873;&#31080;&#35745;&#31639;&#25237;&#31080;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Computing Voting Rules with Elicited Incomplete Votes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#35810;&#38382;&#36873;&#27665;&#26377;&#20851;&#23569;&#37327;&#20505;&#36873;&#20154;&#30340;&#25237;&#31080;&#35268;&#21017;&#35745;&#31639;&#38382;&#39064;&#65292;&#23436;&#20840;&#34920;&#24449;&#20102;&#21487;&#35745;&#31639;&#30340;&#20301;&#32622;&#35780;&#20998;&#35268;&#21017;&#38598;&#21512;&#65292;&#24182;&#32473;&#20986;&#20102;&#23545;&#20110;&#30830;&#23450;&#24615;&#25110;&#38543;&#26426;&#31639;&#27861;&#30830;&#23450;&#26368;&#22823;&#24471;&#20998;&#20505;&#36873;&#20154;&#24517;&#39035;&#36827;&#34892;&#30340;&#26597;&#35810;&#27425;&#25968;&#30340;&#21442;&#25968;&#21270;&#19978;&#38480;&#21644;&#19979;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#21040;&#22312;&#22823;&#22411;&#20505;&#36873;&#20154;&#32676;&#20307;&#20013;&#35828;&#26126;&#23436;&#25972;&#24207;&#25968;&#20559;&#22909;&#30340;&#22256;&#38590;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36890;&#36807;&#35810;&#38382;&#36873;&#27665;&#26377;&#20851; $t &lt; m$ &#20505;&#36873;&#20154;&#30340;&#25237;&#31080;&#35268;&#21017;&#12290;&#22312;&#25512;&#24191;&#20102;&#20851;&#20110;&#35813;&#38382;&#39064;&#29305;&#23450;&#24773;&#20917;&#30340;&#20808;&#21069;&#30740;&#31350;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#30340;&#35770;&#25991;&#23436;&#20840;&#34920;&#24449;&#20102;&#23545;&#20110;&#20219;&#24847; $1 \leq t &lt; m$ &#21487;&#20197;&#35745;&#31639;&#24471;&#20986;&#30340;&#20301;&#32622;&#35780;&#20998;&#35268;&#21017;&#30340;&#38598;&#21512;&#65292;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#20854;&#20013;&#24182;&#19981;&#21253;&#25324;&#22810;&#25968;&#21046;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25193;&#23637;&#36825;&#19968;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;&#21333;&#27425;&#21487;&#36716;&#31227;&#25237;&#31080;&#65288;&#28120;&#27760;&#25237;&#31080;&#65289;&#30340;&#31867;&#20284;&#26080;&#27861;&#35745;&#31639;&#30340;&#32467;&#26524;&#12290;&#36825;&#20123;&#36127;&#38754;&#32467;&#26524;&#26159;&#20449;&#24687;&#29702;&#35770;&#30340;&#65292;&#19981;&#20851;&#24515;&#26597;&#35810;&#30340;&#25968;&#37327;&#12290;&#26368;&#21518;&#65292;&#23545;&#20110;&#21487;&#20197;&#20351;&#29992;&#26377;&#38480;&#22823;&#23567;&#26597;&#35810;&#35745;&#31639;&#30340;&#35780;&#20998;&#35268;&#21017;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#21442;&#25968;&#21270;&#30340;&#20851;&#20110;&#30830;&#23450;&#24615;&#25110;&#38543;&#26426;&#31639;&#27861;&#24517;&#39035;&#20570;&#20986;&#30340;&#26597;&#35810;&#25968;&#37327;&#30340;&#19978;&#38480;&#21644;&#19979;&#38480;&#12290;&#34429;&#28982;&#25105;&#20204;&#30340;&#30830;&#23450;&#24615;&#31639;&#27861;&#30340;&#30028;&#38480;&#20043;&#38388;&#27809;&#26377;&#24046;&#36317;&#65292;&#20294;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11104v1 Announce Type: cross  Abstract: Motivated by the difficulty of specifying complete ordinal preferences over a large set of $m$ candidates, we study voting rules that are computable by querying voters about $t &lt; m$ candidates. Generalizing prior works that focused on specific instances of this problem, our paper fully characterizes the set of positional scoring rules that can be computed for any $1 \leq t &lt; m$, which notably does not include plurality. We then extend this to show a similar impossibility result for single transferable vote (elimination voting). These negative results are information-theoretic and agnostic to the number of queries. Finally, for scoring rules that are computable with limited-sized queries, we give parameterized upper and lower bounds on the number of such queries a deterministic or randomized algorithm must make to determine the score-maximizing candidate. While there is no gap between our bounds for deterministic algorithms, identifying
&lt;/p&gt;</description></item></channel></rss>