<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#33258;&#36866;&#24212;&#29468;&#24819;&#30340;&#22312;&#32447;&#23398;&#20064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;IT&#22522;&#30784;&#35774;&#26045;&#30340;&#33258;&#21160;&#21270;&#23433;&#20840;&#21709;&#24212;&#26041;&#27861;&#65292;&#20854;&#20013;&#28216;&#25103;&#21442;&#19982;&#32773;&#36890;&#36807;Bayesian&#23398;&#20064;&#35843;&#25972;&#29468;&#24819;&#65292;&#24182;&#36890;&#36807;&#25512;&#28436;&#26356;&#26032;&#31574;&#30053;&#65292;&#26368;&#32456;&#23454;&#29616;&#20102;&#26368;&#20339;&#25311;&#21512;&#65292;&#25552;&#39640;&#20102;&#25512;&#28436;&#22312;&#29468;&#24819;&#27169;&#22411;&#19979;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.12499</link><description>&lt;p&gt;
&#36890;&#36807;&#33258;&#36866;&#24212;&#29468;&#24819;&#30340;&#22312;&#32447;&#23398;&#20064;&#23454;&#29616;&#33258;&#21160;&#21270;&#23433;&#20840;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Automated Security Response through Online Learning with Adaptive Conjectures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12499
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#33258;&#36866;&#24212;&#29468;&#24819;&#30340;&#22312;&#32447;&#23398;&#20064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;IT&#22522;&#30784;&#35774;&#26045;&#30340;&#33258;&#21160;&#21270;&#23433;&#20840;&#21709;&#24212;&#26041;&#27861;&#65292;&#20854;&#20013;&#28216;&#25103;&#21442;&#19982;&#32773;&#36890;&#36807;Bayesian&#23398;&#20064;&#35843;&#25972;&#29468;&#24819;&#65292;&#24182;&#36890;&#36807;&#25512;&#28436;&#26356;&#26032;&#31574;&#30053;&#65292;&#26368;&#32456;&#23454;&#29616;&#20102;&#26368;&#20339;&#25311;&#21512;&#65292;&#25552;&#39640;&#20102;&#25512;&#28436;&#22312;&#29468;&#24819;&#27169;&#22411;&#19979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#38024;&#23545;IT&#22522;&#30784;&#35774;&#26045;&#30340;&#33258;&#21160;&#21270;&#23433;&#20840;&#21709;&#24212;&#65292;&#24182;&#23558;&#25915;&#20987;&#32773;&#21644;&#38450;&#24481;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#24418;&#24335;&#34920;&#36848;&#20026;&#19968;&#20010;&#37096;&#20998;&#35266;&#27979;&#12289;&#38750;&#24179;&#31283;&#21338;&#24328;&#12290;&#25105;&#20204;&#25918;&#23485;&#20102;&#28216;&#25103;&#27169;&#22411;&#27491;&#30830;&#35268;&#23450;&#30340;&#26631;&#20934;&#20551;&#35774;&#65292;&#24182;&#32771;&#34385;&#27599;&#20010;&#21442;&#19982;&#32773;&#23545;&#27169;&#22411;&#26377;&#19968;&#20010;&#27010;&#29575;&#24615;&#29468;&#24819;&#65292;&#21487;&#33021;&#22312;&#26576;&#31181;&#24847;&#20041;&#19978;&#38169;&#35823;&#35268;&#23450;&#65292;&#21363;&#30495;&#23454;&#27169;&#22411;&#30340;&#27010;&#29575;&#20026;0&#12290;&#36825;&#31181;&#24418;&#24335;&#20801;&#35768;&#25105;&#20204;&#25429;&#25417;&#20851;&#20110;&#22522;&#30784;&#35774;&#26045;&#21644;&#21442;&#19982;&#32773;&#24847;&#22270;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#20026;&#20102;&#22312;&#32447;&#23398;&#20064;&#26377;&#25928;&#30340;&#28216;&#25103;&#31574;&#30053;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#20854;&#20013;&#19968;&#20010;&#21442;&#19982;&#32773;&#36890;&#36807;&#36125;&#21494;&#26031;&#23398;&#20064;&#36845;&#20195;&#22320;&#35843;&#25972;&#20854;&#29468;&#24819;&#65292;&#24182;&#36890;&#36807;&#25512;&#28436;&#26356;&#26032;&#20854;&#31574;&#30053;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#29468;&#24819;&#20250;&#25910;&#25947;&#21040;&#26368;&#20339;&#25311;&#21512;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;&#20855;&#26377;&#29468;&#27979;&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#25512;&#28436;&#23454;&#29616;&#24615;&#33021;&#25913;&#36827;&#30340;&#19978;&#38480;&#12290;&#20026;&#20102;&#21051;&#30011;&#28216;&#25103;&#30340;&#31283;&#23450;&#29366;&#24577;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Berk-Nash&#24179;&#34913;&#30340;&#19968;&#20010;&#21464;&#31181;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12499v1 Announce Type: cross  Abstract: We study automated security response for an IT infrastructure and formulate the interaction between an attacker and a defender as a partially observed, non-stationary game. We relax the standard assumption that the game model is correctly specified and consider that each player has a probabilistic conjecture about the model, which may be misspecified in the sense that the true model has probability 0. This formulation allows us to capture uncertainty about the infrastructure and the intents of the players. To learn effective game strategies online, we design a novel method where a player iteratively adapts its conjecture using Bayesian learning and updates its strategy through rollout. We prove that the conjectures converge to best fits, and we provide a bound on the performance improvement that rollout enables with a conjectured model. To characterize the steady state of the game, we propose a variant of the Berk-Nash equilibrium. We 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#65292;&#26088;&#22312;&#21516;&#26102;&#20943;&#23569;&#20132;&#36890;&#25317;&#22581;&#27700;&#24179;&#21644;&#32553;&#23567;&#19981;&#21516;&#26053;&#34892;&#32773;&#20043;&#38388;&#30340;&#25104;&#26412;&#24046;&#24322;&#65292;&#20174;&#32780;&#25552;&#39640;&#25928;&#29575;&#21644;&#20844;&#24179;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.16844</link><description>&lt;p&gt;
&#29992;&#20110;&#25928;&#29575;&#21644;&#20844;&#24179;&#24615;&#30340;&#25317;&#22581;&#23450;&#20215;&#65306;&#29702;&#35770;&#21450;&#20854;&#22312;&#26087;&#37329;&#23665;&#28286;&#21306;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Congestion Pricing for Efficiency and Equity: Theory and Applications to the San Francisco Bay Area. (arXiv:2401.16844v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16844
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#65292;&#26088;&#22312;&#21516;&#26102;&#20943;&#23569;&#20132;&#36890;&#25317;&#22581;&#27700;&#24179;&#21644;&#32553;&#23567;&#19981;&#21516;&#26053;&#34892;&#32773;&#20043;&#38388;&#30340;&#25104;&#26412;&#24046;&#24322;&#65292;&#20174;&#32780;&#25552;&#39640;&#25928;&#29575;&#21644;&#20844;&#24179;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25317;&#22581;&#23450;&#20215;&#34987;&#35768;&#22810;&#22478;&#24066;&#29992;&#20110;&#32531;&#35299;&#20132;&#36890;&#25317;&#22581;&#65292;&#20294;&#30001;&#20110;&#23545;&#20302;&#25910;&#20837;&#26053;&#34892;&#32773;&#24433;&#21709;&#36739;&#22823;&#65292;&#24341;&#21457;&#20102;&#20851;&#20110;&#31038;&#20250;&#32463;&#27982;&#24046;&#36317;&#25193;&#22823;&#30340;&#25285;&#24551;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#65292;&#19981;&#20165;&#21487;&#20197;&#26368;&#22823;&#38480;&#24230;&#22320;&#20943;&#23569;&#20132;&#36890;&#25317;&#22581;&#65292;&#36824;&#21487;&#20197;&#23558;&#20844;&#24179;&#24615;&#30446;&#26631;&#32435;&#20837;&#20854;&#20013;&#65292;&#20197;&#20943;&#23569;&#19981;&#21516;&#25903;&#20184;&#24847;&#24895;&#30340;&#26053;&#34892;&#32773;&#20043;&#38388;&#30340;&#25104;&#26412;&#24046;&#24322;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#22522;&#20110;&#19968;&#20010;&#20855;&#26377;&#24322;&#36136;&#26053;&#34892;&#32773;&#32676;&#20307;&#30340;&#25317;&#22581;&#21338;&#24328;&#27169;&#22411;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22235;&#31181;&#32771;&#34385;&#23454;&#38469;&#22240;&#32032;&#30340;&#23450;&#20215;&#26041;&#26696;&#65292;&#20363;&#22914;&#23545;&#19981;&#21516;&#26053;&#34892;&#32773;&#32676;&#20307;&#25910;&#21462;&#24046;&#24322;&#21270;&#30340;&#36890;&#34892;&#36153;&#20197;&#21450;&#24449;&#25910;&#25972;&#20010;&#36335;&#32593;&#20013;&#30340;&#25152;&#26377;&#36793;&#25110;&#21482;&#24449;&#25910;&#20854;&#20013;&#19968;&#37096;&#20998;&#36793;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#22312;&#26087;&#37329;&#23665;&#28286;&#21306;&#30340;&#26657;&#20934;&#39640;&#36895;&#20844;&#36335;&#32593;&#32476;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#23450;&#20215;&#26041;&#26696;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25317;&#22581;&#23450;&#20215;&#26041;&#26696;&#21487;&#20197;&#25552;&#39640;&#25928;&#29575;&#65288;&#21363;&#20943;&#23569;&#24179;&#22343;&#26053;&#34892;&#26102;&#38388;&#65289;&#21644;&#20844;&#24179;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Congestion pricing, while adopted by many cities to alleviate traffic congestion, raises concerns about widening socioeconomic disparities due to its disproportionate impact on low-income travelers. In this study, we address this concern by proposing a new class of congestion pricing schemes that not only minimize congestion levels but also incorporate an equity objective to reduce cost disparities among travelers with different willingness-to-pay. Our analysis builds on a congestion game model with heterogeneous traveler populations. We present four pricing schemes that account for practical considerations, such as the ability to charge differentiated tolls to various traveler populations and the option to toll all or only a subset of edges in the network. We evaluate our pricing schemes in the calibrated freeway network of the San Francisco Bay Area. We demonstrate that the proposed congestion pricing schemes improve both efficiency (in terms of reduced average travel time) and equit
&lt;/p&gt;</description></item></channel></rss>