<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#21487;&#33021;&#26377;&#21161;&#20110;&#29702;&#35299;&#36845;&#20195;&#32452;&#21512;&#25293;&#21334;&#65292;&#20294;&#20854;&#26377;&#25928;&#37096;&#32626;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#38656;&#35201;&#32771;&#34385;&#20445;&#25345;&#28216;&#25103;&#21487;&#22788;&#29702;&#24615;&#20197;&#21450;&#36991;&#20813;&#21508;&#31181;&#31639;&#27861;&#30340;&#38519;&#38449;&#12290;</title><link>https://arxiv.org/abs/2402.19420</link><description>&lt;p&gt;
&#36890;&#36807;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#29702;&#35299;&#36845;&#20195;&#32452;&#21512;&#25293;&#21334;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Understanding Iterative Combinatorial Auction Designs via Multi-Agent Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19420
&lt;/p&gt;
&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#21487;&#33021;&#26377;&#21161;&#20110;&#29702;&#35299;&#36845;&#20195;&#32452;&#21512;&#25293;&#21334;&#65292;&#20294;&#20854;&#26377;&#25928;&#37096;&#32626;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#38656;&#35201;&#32771;&#34385;&#20445;&#25345;&#28216;&#25103;&#21487;&#22788;&#29702;&#24615;&#20197;&#21450;&#36991;&#20813;&#21508;&#31181;&#31639;&#27861;&#30340;&#38519;&#38449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36845;&#20195;&#32452;&#21512;&#25293;&#21334;&#22312;&#39640;&#39118;&#38505;&#22330;&#26223;&#22914;&#39057;&#35889;&#25293;&#21334;&#20013;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#28982;&#32780;&#65292;&#36825;&#31867;&#25293;&#21334;&#38590;&#20197;&#22312;&#29702;&#35770;&#19978;&#29702;&#35299;&#65292;&#20351;&#24471;&#31454;&#26631;&#32773;&#24456;&#38590;&#20915;&#23450;&#22914;&#20309;&#34892;&#21160;&#20197;&#21450;&#35774;&#35745;&#32773;&#24456;&#38590;&#20248;&#21270;&#25293;&#21334;&#35268;&#21017;&#20197;&#30830;&#20445;&#29702;&#24819;&#30340;&#32467;&#26524;&#65292;&#22914;&#39640;&#25910;&#20837;&#25110;&#31119;&#21033;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#26159;&#21542;&#33021;&#22815;&#29992;&#20110;&#29702;&#35299;&#36845;&#20195;&#32452;&#21512;&#25293;&#21334;&#65292;&#37492;&#20110;&#36825;&#20123;&#31639;&#27861;&#26368;&#36817;&#22312;&#20854;&#20182;&#39046;&#22495;&#24050;&#32463;&#26174;&#31034;&#20986;&#23454;&#35777;&#25104;&#21151;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#30830;&#23454;&#21487;&#20197;&#21463;&#30410;&#20110;&#25293;&#21334;&#20998;&#26512;&#65292;&#20294;&#26377;&#25928;&#37096;&#32626;&#24182;&#19981;&#23481;&#26131;&#12290;&#25105;&#20204;&#39318;&#20808;&#25551;&#36848;&#20102;&#20445;&#25345;&#32467;&#26524;&#28216;&#25103;&#21487;&#22788;&#29702;&#30340;&#24314;&#27169;&#20915;&#31574;&#65292;&#21516;&#26102;&#19981;&#29306;&#29298;&#35832;&#22914;&#20449;&#24687;&#19981;&#23436;&#20840;&#25110;&#31454;&#26631;&#32773;&#38388;&#19981;&#23545;&#31216;&#31561;&#37325;&#35201;&#29305;&#24449;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#22914;&#20309;&#36991;&#20813;&#21508;&#31181;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#30340;&#38519;&#38449;&#65292;&#22914;&#20309;&#20811;&#26381;&#25361;&#25112;&#20197;&#21450;&#22914;&#20309;&#24212;&#23545;&#21508;&#31181;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19420v1 Announce Type: cross  Abstract: Iterative combinatorial auctions are widely used in high stakes settings such as spectrum auctions. Such auctions can be hard to understand analytically, making it difficult for bidders to determine how to behave and for designers to optimize auction rules to ensure desirable outcomes such as high revenue or welfare. In this paper, we investigate whether multi-agent reinforcement learning (MARL) algorithms can be used to understand iterative combinatorial auctions, given that these algorithms have recently shown empirical success in several other domains. We find that MARL can indeed benefit auction analysis, but that deploying it effectively is nontrivial. We begin by describing modelling decisions that keep the resulting game tractable without sacrificing important features such as imperfect information or asymmetry between bidders. We also discuss how to navigate pitfalls of various MARL algorithms, how to overcome challenges in ver
&lt;/p&gt;</description></item></channel></rss>