<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#31169;&#26377;&#36164;&#20135;&#25152;&#26377;&#26435;&#37325;&#32452;&#30340;&#26080;&#25805;&#32437;&#26426;&#21046;&#65292;&#33021;&#22815;&#30495;&#23454;&#33719;&#21462;&#25152;&#26377;&#32773;&#30340;&#20272;&#20540;&#65292;&#26131;&#20110;&#23454;&#26045;&#12289;&#39044;&#31639;&#24179;&#34913;&#12289;&#38450;&#27490;&#21246;&#32467;&#12289;&#20010;&#20307;&#21512;&#29702;&#21644;&#21518;&#39564;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2311.06780</link><description>&lt;p&gt;
&#19968;&#20010;&#36866;&#29992;&#20110;&#31169;&#26377;&#36164;&#20135;&#25152;&#26377;&#26435;&#37325;&#32452;&#30340;&#26080;&#25805;&#32437;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
A Strategyproof Mechanism for Ownership Restructuring in Privately Owned Assets. (arXiv:2311.06780v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.06780
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#31169;&#26377;&#36164;&#20135;&#25152;&#26377;&#26435;&#37325;&#32452;&#30340;&#26080;&#25805;&#32437;&#26426;&#21046;&#65292;&#33021;&#22815;&#30495;&#23454;&#33719;&#21462;&#25152;&#26377;&#32773;&#30340;&#20272;&#20540;&#65292;&#26131;&#20110;&#23454;&#26045;&#12289;&#39044;&#31639;&#24179;&#34913;&#12289;&#38450;&#27490;&#21246;&#32467;&#12289;&#20010;&#20307;&#21512;&#29702;&#21644;&#21518;&#39564;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#36164;&#20135;&#26159;&#31169;&#26377;&#30340;&#19988;&#25152;&#26377;&#32773;&#23545;&#20854;&#20027;&#35266;&#20272;&#20540;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#26102;&#65292;&#37325;&#32452;&#25152;&#26377;&#26435;&#21464;&#24471;&#27169;&#31946;&#19981;&#28165;&#12290;&#24403;&#25152;&#26377;&#26435;&#22312;&#20004;&#20010;&#25152;&#26377;&#32773;&#20043;&#38388;&#24179;&#22343;&#20998;&#37197;&#26102;&#65292;&#24120;&#29992;&#30340;&#26426;&#21046;&#26159;&#31216;&#20026;BMBY&#26426;&#21046;&#12290;&#35813;&#26426;&#21046;&#30340;&#24037;&#20316;&#21407;&#29702;&#22914;&#19979;&#65306;&#27599;&#20010;&#25152;&#26377;&#32773;&#21487;&#20197;&#36890;&#36807;&#25253;&#20215;&#26469;&#21457;&#36215;BMBY&#12290;&#19968;&#26086;&#19968;&#20010;&#25152;&#26377;&#32773;&#22768;&#26126;&#20102;&#19968;&#20010;&#20215;&#26684;&#65292;&#21478;&#19968;&#20010;&#25152;&#26377;&#32773;&#21487;&#20197;&#36873;&#25321;&#20197;&#32473;&#23450;&#20215;&#26684;&#20986;&#21806;&#33258;&#24049;&#30340;&#25345;&#32929;&#20221;&#39069;&#25110;&#36141;&#20080;&#21457;&#36215;&#32773;&#30340;&#32929;&#20221;&#12290;&#35813;&#26426;&#21046;&#31616;&#21333;&#26131;&#23454;&#26045;&#65292;&#20294;&#26080;&#27861;&#25581;&#31034;&#23454;&#38469;&#30340;&#25152;&#26377;&#32773;&#20272;&#20540;&#65292;&#20063;&#26080;&#27861;&#20445;&#35777;&#26377;&#25928;&#30340;&#20998;&#37197;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#23427;&#38480;&#21046;&#22312;&#20004;&#20010;&#25152;&#26377;&#32773;&#20043;&#38388;&#30340;&#22343;&#31561;&#21512;&#20316;&#20249;&#20276;&#20851;&#31995;&#12290;&#26412;&#25991;&#23558;&#36825;&#19968;&#29702;&#35770;&#25193;&#23637;&#21040;&#22810;&#20010;&#25152;&#26377;&#32773;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26426;&#21046;&#21487;&#20197;&#30495;&#23454;&#22320;&#33719;&#21462;&#25152;&#26377;&#32773;&#30340;&#20272;&#20540;&#65292;&#24182;&#20855;&#26377;&#20197;&#19979;&#20960;&#20010;&#20248;&#28857;&#65306;&#26131;&#20110;&#23454;&#26045;&#12289;&#39044;&#31639;&#24179;&#34913;&#12289;&#38450;&#27490;&#21246;&#32467;&#65288;&#24369;&#38598;&#20307;&#31574;&#30053;&#35777;&#26126;&#65289;&#12289;&#20010;&#20307;&#21512;&#29702;&#12289;&#19988;&#21518;&#39564;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
It is unclear how to restructure ownership when an asset is privately held, and there is uncertainty about the owners' subjective valuations. When ownership is divided equally between two owners, a commonly used mechanism is called a BMBY mechanism. This mechanism works as follows: each owner can initiate a BMBY by naming her price. Once an owner declares a price, the other chooses to sell his holdings or buy the shares of the initiator at the given price. This mechanism is simple and tractable; however, it does not elicit actual owner valuations, does not guarantee an efficient allocation, and, most importantly, is limited to an equal partnership of two owners. In this paper, we extend this rationale to a multi-owner setting. Our proposed mechanism elicits owner valuations truthfully. Additionally, our proposed mechanism exhibits several desirable traits: it is easy to implement, budget balanced, robust to collusion (weakly group strategyproof), individually rational, and ex-post effi
&lt;/p&gt;</description></item></channel></rss>