<rss version="2.0"><channel><title>Chat Arxiv cs.GR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24067;&#26009;&#27169;&#25311;&#26041;&#27861; NeuralClothSim&#65292;&#20351;&#29992;&#34180;&#22771;&#29702;&#35770;&#21644;&#31070;&#32463;&#21464;&#24418;&#22330;&#36827;&#34892;&#34920;&#38754;&#28436;&#21270;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#24067;&#26009;&#27169;&#25311;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#21644;&#25361;&#25112;&#65292;&#20026;&#29289;&#29702;&#21512;&#29702;&#30340;&#24067;&#26009;&#27169;&#25311;&#25552;&#20379;&#20102;&#19968;&#31181;&#20840;&#26032;&#30340;&#35270;&#35282;&#12290;</title><link>http://arxiv.org/abs/2308.12970</link><description>&lt;p&gt;
NeuralClothSim: &#31070;&#32463;&#21464;&#24418;&#22330;&#19982;Kirchhoff-Love&#34180;&#22771;&#29702;&#35770;&#30456;&#36935;
&lt;/p&gt;
&lt;p&gt;
NeuralClothSim: Neural Deformation Fields Meet the Kirchhoff-Love Thin Shell Theory. (arXiv:2308.12970v1 [cs.GR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12970
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24067;&#26009;&#27169;&#25311;&#26041;&#27861; NeuralClothSim&#65292;&#20351;&#29992;&#34180;&#22771;&#29702;&#35770;&#21644;&#31070;&#32463;&#21464;&#24418;&#22330;&#36827;&#34892;&#34920;&#38754;&#28436;&#21270;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#24067;&#26009;&#27169;&#25311;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#21644;&#25361;&#25112;&#65292;&#20026;&#29289;&#29702;&#21512;&#29702;&#30340;&#24067;&#26009;&#27169;&#25311;&#25552;&#20379;&#20102;&#19968;&#31181;&#20840;&#26032;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24067;&#26009;&#27169;&#25311;&#26159;&#19968;&#20010;&#24191;&#27867;&#30740;&#31350;&#30340;&#38382;&#39064;&#65292;&#22312;&#35745;&#31639;&#26426;&#22270;&#24418;&#23398;&#25991;&#29486;&#20013;&#26377;&#22823;&#37327;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#29616;&#26377;&#30340;&#24067;&#26009;&#27169;&#25311;&#22120;&#20135;&#29983;&#31526;&#21512;&#19981;&#21516;&#31867;&#22411;&#36793;&#30028;&#26465;&#20214;&#30340;&#36924;&#30495;&#24067;&#26009;&#21464;&#24418;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#30340;&#25805;&#20316;&#21407;&#29702;&#22312;&#20960;&#20010;&#26041;&#38754;&#20173;&#28982;&#23384;&#22312;&#23616;&#38480;&#24615;&#65306;&#23427;&#20204;&#22312;&#20855;&#26377;&#22266;&#23450;&#31354;&#38388;&#20998;&#36776;&#29575;&#30340;&#26174;&#24335;&#34920;&#38754;&#34920;&#31034;&#19978;&#36827;&#34892;&#25805;&#20316;&#65292;&#25191;&#34892;&#19968;&#31995;&#21015;&#31163;&#25955;&#21270;&#30340;&#26356;&#26032;&#65288;&#38480;&#21046;&#20102;&#23427;&#20204;&#30340;&#26102;&#38388;&#20998;&#36776;&#29575;&#65289;&#65292;&#24182;&#19988;&#38656;&#35201;&#30456;&#23545;&#36739;&#22823;&#30340;&#23384;&#20648;&#31354;&#38388;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#29616;&#26377;&#30340;&#27714;&#35299;&#22120;&#36827;&#34892;&#26799;&#24230;&#21453;&#21521;&#20256;&#25773;&#36890;&#24120;&#24182;&#19981;&#30452;&#35266;&#65292;&#36825;&#22312;&#23558;&#20854;&#38598;&#25104;&#21040;&#29616;&#20195;&#31070;&#32463;&#26550;&#26500;&#20013;&#26102;&#36896;&#25104;&#20102;&#39069;&#22806;&#30340;&#25361;&#25112;&#12290;&#38024;&#23545;&#19978;&#36848;&#38480;&#21046;&#65292;&#26412;&#25991;&#20174;&#26681;&#26412;&#19978;&#20197;&#19968;&#31181;&#26681;&#26412;&#19981;&#21516;&#30340;&#35270;&#35282;&#26469;&#32771;&#34385;&#29289;&#29702;&#21512;&#29702;&#30340;&#24067;&#26009;&#27169;&#25311;&#65292;&#24182;&#37325;&#26032;&#24605;&#32771;&#36825;&#20010;&#38271;&#26399;&#23384;&#22312;&#30340;&#38382;&#39064;&#65306;&#25105;&#20204;&#25552;&#20986;&#20102;NeuralClothSim&#65292;&#21363;&#19968;&#31181;&#20351;&#29992;&#34180;&#22771;&#30340;&#26032;&#24067;&#26009;&#27169;&#25311;&#26041;&#27861;&#65292;&#20854;&#20013;&#34920;&#38754;&#28436;&#21270;&#36890;&#36807;&#31070;&#32463;&#21464;&#24418;&#22330;&#31561;&#36827;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cloth simulation is an extensively studied problem, with a plethora of solutions available in computer graphics literature. Existing cloth simulators produce realistic cloth deformations that obey different types of boundary conditions. Nevertheless, their operational principle remains limited in several ways: They operate on explicit surface representations with a fixed spatial resolution, perform a series of discretised updates (which bounds their temporal resolution), and require comparably large amounts of storage. Moreover, back-propagating gradients through the existing solvers is often not straightforward, which poses additional challenges when integrating them into modern neural architectures. In response to the limitations mentioned above, this paper takes a fundamentally different perspective on physically-plausible cloth simulation and re-thinks this long-standing problem: We propose NeuralClothSim, i.e., a new cloth simulation approach using thin shells, in which surface ev
&lt;/p&gt;</description></item></channel></rss>