<rss version="2.0"><channel><title>Chat Arxiv cs.GT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.GT</description><item><title>&#36825;&#39033;&#24037;&#20316;&#36890;&#36807;&#20998;&#26512;&#20195;&#29702;&#20154;&#20559;&#22909;&#20998;&#24067;&#30340;&#24179;&#22343;&#24773;&#20917;&#65292;&#25193;&#23637;&#20102;&#36845;&#20195;&#25237;&#31080;&#27169;&#22411;&#30340;&#25928;&#26524;&#20998;&#26512;&#12290;&#24182;&#19988;&#21306;&#20998;&#20102;&#36845;&#20195;&#22810;&#25968;&#21046;&#20309;&#26102;&#25913;&#21892;&#25110;&#38477;&#20302;&#28176;&#36817;&#31119;&#21033;&#12290;</title><link>https://arxiv.org/abs/2402.08144</link><description>&lt;p&gt;
&#36845;&#20195;&#25237;&#31080;&#30340;&#24179;&#22343;&#24773;&#20917;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Average-Case Analysis of Iterative Voting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08144
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#36890;&#36807;&#20998;&#26512;&#20195;&#29702;&#20154;&#20559;&#22909;&#20998;&#24067;&#30340;&#24179;&#22343;&#24773;&#20917;&#65292;&#25193;&#23637;&#20102;&#36845;&#20195;&#25237;&#31080;&#27169;&#22411;&#30340;&#25928;&#26524;&#20998;&#26512;&#12290;&#24182;&#19988;&#21306;&#20998;&#20102;&#36845;&#20195;&#22810;&#25968;&#21046;&#20309;&#26102;&#25913;&#21892;&#25110;&#38477;&#20302;&#28176;&#36817;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36845;&#20195;&#25237;&#31080;&#26159;&#31038;&#20250;&#36873;&#25321;&#20013;&#37325;&#22797;&#25112;&#30053;&#20915;&#31574;&#30340;&#33258;&#28982;&#27169;&#22411;&#65292;&#24403;&#20195;&#29702;&#21487;&#20197;&#22312;&#26368;&#32456;&#30830;&#23450;&#32676;&#20307;&#20915;&#31574;&#20043;&#21069;&#26356;&#26032;&#20182;&#20204;&#30340;&#25237;&#31080;&#26102;&#12290;&#20043;&#21069;&#30340;&#30740;&#31350;&#36890;&#36807;&#23545;&#26080;&#24207;&#25991;&#21270;&#19979;&#20195;&#29702;&#20154;&#20559;&#22909;&#30340;&#26368;&#22351;&#24773;&#20917;&#21644;&#24179;&#22343;&#24773;&#20917;&#34920;&#29616;&#36827;&#34892;&#20998;&#26512;&#65292;&#36890;&#36807;&#25913;&#36827;&#23433;&#32435;&#22522;&#20215;&#26684;&#26469;&#20998;&#26512;&#36845;&#20195;&#22810;&#25968;&#21046;&#23545;&#24179;&#34913;&#28857;&#36873;&#20986;&#30340;&#32467;&#26524;&#31119;&#21033;&#30340;&#26377;&#25928;&#24615;&#12290;&#28982;&#32780;&#65292;&#20043;&#21069;&#30340;&#20998;&#26512;&#21482;&#30740;&#31350;&#20102;&#22312;&#20195;&#29702;&#20154;&#20559;&#22909;&#36890;&#36807;&#26080;&#20559;&#25991;&#21270;&#20998;&#24067;&#30340;&#26368;&#22351;&#24773;&#20917;&#21644;&#24179;&#22343;&#24773;&#20917;&#19979;&#30340;&#24615;&#33021;&#12290;&#26412;&#30740;&#31350;&#23558;&#24179;&#22343;&#24773;&#20917;&#20998;&#26512;&#25193;&#23637;&#21040;&#26356;&#24191;&#27867;&#30340;&#20998;&#24067;&#31867;&#65292;&#24182;&#21306;&#20998;&#20986;&#36845;&#20195;&#22810;&#25968;&#21046;&#20309;&#26102;&#25913;&#21892;&#25110;&#38477;&#20302;&#28176;&#36817;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
Iterative voting is a natural model of repeated strategic decision-making in social choice when agents have the opportunity to update their votes prior to finalizing the group decision. Prior work has analyzed the efficacy of iterative plurality on the welfare of the chosen outcome at equilibrium, relative to the truthful vote profile, via an adaptation of the price of anarchy. However, prior analyses have only studied the worst-case and average-case performances when agents' preferences are distributed by the impartial culture. This work extends average-case analyses to a wider class of distributions and distinguishes when iterative plurality improves or degrades asymptotic welfare.
&lt;/p&gt;</description></item></channel></rss>