<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#31070;&#32463;&#31526;&#21495;&#26550;&#26500;&#65292;&#21487;&#20197;&#36890;&#36807;&#33258;&#28982;&#35821;&#35328;&#25351;&#24341;&#26426;&#22120;&#20154;&#23436;&#25104;&#21508;&#31181;&#20219;&#21153;&#65292;&#21033;&#29992;&#20849;&#20139;&#30340;&#21407;&#22987;&#25216;&#33021;&#24211;&#20197;&#20219;&#21153;&#26080;&#20851;&#30340;&#26041;&#24335;&#35299;&#20915;&#25152;&#26377;&#24773;&#20917;&#12290;&#36825;&#23558;&#31163;&#25955;&#31526;&#21495;&#26041;&#27861;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#31995;&#32479;&#21270;&#27867;&#21270;&#20248;&#21183;&#19982;&#21487;&#25193;&#23637;&#24615;&#21644;&#20195;&#34920;&#24615;&#26435;&#21147;&#30456;&#32467;&#21512;&#12290;</title><link>http://arxiv.org/abs/2210.00858</link><description>&lt;p&gt;
&#22686;&#24378;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#20114;&#21160;&#24615;&#65306;&#19968;&#31181;&#31070;&#32463;&#31526;&#21495;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Enhancing Interpretability and Interactivity in Robot Manipulation: A Neurosymbolic Approach. (arXiv:2210.00858v3 [cs.RO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.00858
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#31070;&#32463;&#31526;&#21495;&#26550;&#26500;&#65292;&#21487;&#20197;&#36890;&#36807;&#33258;&#28982;&#35821;&#35328;&#25351;&#24341;&#26426;&#22120;&#20154;&#23436;&#25104;&#21508;&#31181;&#20219;&#21153;&#65292;&#21033;&#29992;&#20849;&#20139;&#30340;&#21407;&#22987;&#25216;&#33021;&#24211;&#20197;&#20219;&#21153;&#26080;&#20851;&#30340;&#26041;&#24335;&#35299;&#20915;&#25152;&#26377;&#24773;&#20917;&#12290;&#36825;&#23558;&#31163;&#25955;&#31526;&#21495;&#26041;&#27861;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#31995;&#32479;&#21270;&#27867;&#21270;&#20248;&#21183;&#19982;&#21487;&#25193;&#23637;&#24615;&#21644;&#20195;&#34920;&#24615;&#26435;&#21147;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#31526;&#21495;&#26550;&#26500;&#65292;&#29992;&#20110;&#23558;&#35821;&#35328;&#24341;&#23548;&#30340;&#35270;&#35273;&#25512;&#29702;&#19982;&#26426;&#22120;&#20154;&#25805;&#20316;&#30456;&#32467;&#21512;&#12290;&#38750;&#19987;&#19994;&#20154;&#22763;&#21487;&#20197;&#20351;&#29992;&#33258;&#28982;&#35821;&#35328;&#24341;&#23548;&#26426;&#22120;&#20154;&#65292;&#25552;&#20379;&#25351;&#20195;&#34920;&#36798;&#24335;&#65288;REF&#65289;&#12289;&#38382;&#39064;&#65288;VQA&#65289;&#25110;&#25235;&#25569;&#21160;&#20316;&#25351;&#20196;&#12290;&#35813;&#31995;&#32479;&#36890;&#36807;&#21033;&#29992;&#20849;&#20139;&#30340;&#21407;&#22987;&#25216;&#33021;&#24211;&#20197;&#20219;&#21153;&#26080;&#20851;&#30340;&#26041;&#24335;&#35299;&#20915;&#25152;&#26377;&#24773;&#20917;&#12290;&#27599;&#20010;&#21407;&#22987;&#25216;&#33021;&#37117;&#22788;&#29702;&#19968;&#20010;&#29420;&#31435;&#30340;&#23376;&#20219;&#21153;&#65292;&#20363;&#22914;&#25512;&#29702;&#35270;&#35273;&#23646;&#24615;&#12289;&#31354;&#38388;&#20851;&#31995;&#29702;&#35299;&#12289;&#36923;&#36753;&#21644;&#26522;&#20030;&#20197;&#21450;&#25163;&#33218;&#25511;&#21046;&#12290;&#35821;&#35328;&#35299;&#26512;&#22120;&#23558;&#36755;&#20837;&#26597;&#35810;&#26144;&#23556;&#21040;&#30001;&#36825;&#20123;&#21407;&#35821;&#32452;&#25104;&#30340;&#21487;&#25191;&#34892;&#31243;&#24207;&#19978;&#65292;&#20855;&#20307;&#21462;&#20915;&#20110;&#19978;&#19979;&#25991;&#12290;&#23613;&#31649;&#26377;&#20123;&#21407;&#35821;&#26159;&#32431;&#31526;&#21495;&#25805;&#20316;&#65288;&#20363;&#22914;&#35745;&#25968;&#65289;&#65292;&#20294;&#21478;&#19968;&#20123;&#26159;&#21487;&#35757;&#32451;&#30340;&#31070;&#32463;&#20989;&#25968;&#65288;&#20363;&#22914;&#35270;&#35273;&#25509;&#22320;&#65289;&#65292;&#22240;&#27492;&#34701;&#21512;&#20102;&#31163;&#25955;&#31526;&#21495;&#26041;&#27861;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#31995;&#32479;&#21270;&#27867;&#21270;&#20248;&#21183;&#19982;&#21487;&#25193;&#23637;&#24615;&#21644;&#20877;&#29616;&#24615;&#30340;&#20195;&#34920;&#24615;&#26435;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we present a neurosymbolic architecture for coupling language-guided visual reasoning with robot manipulation. A non-expert human user can prompt the robot using unconstrained natural language, providing a referring expression (REF), a question (VQA), or a grasp action instruction. The system tackles all cases in a task-agnostic fashion through the utilization of a shared library of primitive skills. Each primitive handles an independent sub-task, such as reasoning about visual attributes, spatial relation comprehension, logic and enumeration, as well as arm control. A language parser maps the input query to an executable program composed of such primitives, depending on the context. While some primitives are purely symbolic operations (e.g. counting), others are trainable neural functions (e.g. visual grounding), therefore marrying the interpretability and systematic generalization benefits of discrete symbolic approaches with the scalability and representational power o
&lt;/p&gt;</description></item></channel></rss>