<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#20027;&#30340;&#12289;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#25805;&#20316;&#22120;&#26694;&#26550;&#65292;&#23558;&#20154;&#22312;&#22238;&#36335;&#21407;&#21017;&#21644;&#25193;&#23637;&#29616;&#23454;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20419;&#36827;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#30452;&#35266;&#30340;&#27807;&#36890;&#21644;&#32534;&#31243;&#12290;</title><link>https://arxiv.org/abs/2403.14597</link><description>&lt;p&gt;
&#25193;&#23637;&#29616;&#23454;&#29992;&#20110;&#22686;&#24378;&#20154;&#26426;&#21327;&#20316;&#65306;&#19968;&#31181;&#20154;&#22312;&#22238;&#36335;&#20013;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Extended Reality for Enhanced Human-Robot Collaboration: a Human-in-the-Loop Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14597
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#20027;&#30340;&#12289;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#25805;&#20316;&#22120;&#26694;&#26550;&#65292;&#23558;&#20154;&#22312;&#22238;&#36335;&#21407;&#21017;&#21644;&#25193;&#23637;&#29616;&#23454;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20419;&#36827;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#30452;&#35266;&#30340;&#27807;&#36890;&#21644;&#32534;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#21270;&#30340;&#23835;&#36215;&#20026;&#21046;&#36896;&#36807;&#31243;&#30340;&#39640;&#25928;&#29575;&#25552;&#20379;&#20102;&#26426;&#20250;&#65292;&#20294;&#24448;&#24448;&#29306;&#29298;&#20102;&#21450;&#26102;&#21709;&#24212;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#38656;&#27714;&#21644;&#28385;&#36275;&#23450;&#21046;&#38656;&#27714;&#25152;&#38656;&#30340;&#28789;&#27963;&#24615;&#12290;&#20154;&#26426;&#21327;&#20316;&#35797;&#22270;&#36890;&#36807;&#23558;&#26426;&#22120;&#30340;&#21147;&#37327;&#21644;&#31934;&#24230;&#19982;&#20154;&#31867;&#30340;&#26426;&#26234;&#21644;&#24863;&#30693;&#29702;&#35299;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#12290;&#26412;&#25991;&#27010;&#24565;&#21270;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#29616;&#26694;&#26550;&#65292;&#29992;&#20110;&#23558;&#20154;&#22312;&#22238;&#36335;&#21407;&#21017;&#19982;&#25193;&#23637;&#29616;&#23454;&#65288;XR&#65289;&#30456;&#32467;&#21512;&#65292;&#20197;&#20415;&#20110;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#36827;&#34892;&#30452;&#35266;&#27807;&#36890;&#21644;&#32534;&#31243;&#12290;&#27492;&#22806;&#65292;&#36825;&#20010;&#27010;&#24565;&#26694;&#26550;&#39044;&#35265;&#21040;&#20102;&#20154;&#30452;&#25509;&#21442;&#19982;&#26426;&#22120;&#20154;&#23398;&#20064;&#36807;&#31243;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#36866;&#24212;&#24615;&#21644;&#20219;&#21153;&#27867;&#21270;&#33021;&#21147;&#12290;&#26412;&#25991;&#37325;&#28857;&#20171;&#32461;&#20102;&#25903;&#25345;&#25152;&#25552;&#20986;&#26694;&#26550;&#30340;&#20851;&#38190;&#25216;&#26415;&#65292;&#24378;&#35843;&#20102;&#23454;&#29616;&#36825;&#19968;&#26694;&#26550;&#30340;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14597v1 Announce Type: cross  Abstract: The rise of automation has provided an opportunity to achieve higher efficiency in manufacturing processes, yet it often compromises the flexibility required to promptly respond to evolving market needs and meet the demand for customization. Human-robot collaboration attempts to tackle these challenges by combining the strength and precision of machines with human ingenuity and perceptual understanding. In this paper, we conceptualize and propose an implementation framework for an autonomous, machine learning-based manipulator that incorporates human-in-the-loop principles and leverages Extended Reality (XR) to facilitate intuitive communication and programming between humans and robots. Furthermore, the conceptual framework foresees human involvement directly in the robot learning process, resulting in higher adaptability and task generalization. The paper highlights key technologies enabling the proposed framework, emphasizing the im
&lt;/p&gt;</description></item><item><title>&#22823;&#35821;&#35328;&#27169;&#22411;&#20195;&#29702;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#30340;&#20449;&#20219;&#34892;&#20026;&#65292;&#34920;&#29616;&#20986;&#22312;&#20449;&#20219;&#28216;&#25103;&#20013;&#30340;&#20449;&#20219;&#34892;&#20026;&#65292;&#24182;&#19988;&#19982;&#20154;&#31867;&#34892;&#20026;&#20855;&#26377;&#39640;&#24230;&#19968;&#33268;&#24615;&#65292;&#20294;&#23384;&#22312;&#19968;&#20123;&#20559;&#35265;&#21644;&#23545;&#20195;&#29702;&#19982;&#20154;&#31867;&#30340;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2402.04559</link><description>&lt;p&gt;
&#22823;&#35821;&#35328;&#27169;&#22411;&#20195;&#29702;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#30340;&#20449;&#20219;&#34892;&#20026;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Can Large Language Model Agents Simulate Human Trust Behaviors?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04559
&lt;/p&gt;
&lt;p&gt;
&#22823;&#35821;&#35328;&#27169;&#22411;&#20195;&#29702;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#30340;&#20449;&#20219;&#34892;&#20026;&#65292;&#34920;&#29616;&#20986;&#22312;&#20449;&#20219;&#28216;&#25103;&#20013;&#30340;&#20449;&#20219;&#34892;&#20026;&#65292;&#24182;&#19988;&#19982;&#20154;&#31867;&#34892;&#20026;&#20855;&#26377;&#39640;&#24230;&#19968;&#33268;&#24615;&#65292;&#20294;&#23384;&#22312;&#19968;&#20123;&#20559;&#35265;&#21644;&#23545;&#20195;&#29702;&#19982;&#20154;&#31867;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#20195;&#29702;&#24050;&#32463;&#36234;&#26469;&#36234;&#22810;&#22320;&#34987;&#37319;&#29992;&#20316;&#20026;&#27169;&#25311;&#24037;&#20855;&#65292;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#22312;&#31038;&#20250;&#31185;&#23398;&#31561;&#39046;&#22495;&#20013;&#30340;&#34892;&#20026;&#12290;&#28982;&#32780;&#65292;&#19968;&#20010;&#22522;&#26412;&#30340;&#38382;&#39064;&#20173;&#28982;&#23384;&#22312;&#65306;LLM&#20195;&#29702;&#26159;&#21542;&#30495;&#30340;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#34892;&#20026;&#65311;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#19987;&#27880;&#20110;&#20154;&#31867;&#20114;&#21160;&#20013;&#26368;&#20851;&#38190;&#30340;&#34892;&#20026;&#20043;&#19968;&#65292;&#20449;&#20219;&#65292;&#26088;&#22312;&#35843;&#26597;LLM&#20195;&#29702;&#26159;&#21542;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#30340;&#20449;&#20219;&#34892;&#20026;&#12290;&#25105;&#20204;&#39318;&#20808;&#21457;&#29616;&#65292;&#22312;&#34987;&#34892;&#20026;&#32463;&#27982;&#23398;&#24191;&#27867;&#25509;&#21463;&#30340;&#20449;&#20219;&#28216;&#25103;&#26694;&#26550;&#19979;&#65292;LLM&#20195;&#29702;&#36890;&#24120;&#34920;&#29616;&#20986;&#20449;&#20219;&#34892;&#20026;&#65292;&#31216;&#20026;&#20195;&#29702;&#20449;&#20219;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;LLM&#20195;&#29702;&#22312;&#20449;&#20219;&#34892;&#20026;&#26041;&#38754;&#19982;&#20154;&#31867;&#20855;&#26377;&#36739;&#39640;&#30340;&#34892;&#20026;&#19968;&#33268;&#24615;&#65292;&#34920;&#26126;&#20351;&#29992;LLM&#20195;&#29702;&#27169;&#25311;&#20154;&#31867;&#30340;&#20449;&#20219;&#34892;&#20026;&#26159;&#21487;&#34892;&#30340;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25506;&#32034;&#20102;&#20195;&#29702;&#20449;&#20219;&#20013;&#30340;&#20559;&#35265;&#20197;&#21450;&#20195;&#29702;&#20449;&#20219;&#22312;&#23545;&#20195;&#29702;&#21644;&#20154;&#31867;&#20043;&#38388;&#30340;&#24046;&#24322;&#26041;&#38754;&#30340;&#20869;&#22312;&#29305;&#24615;&#12290;&#25105;&#20204;&#36824;&#25506;&#35752;&#20102;&#21253;&#25324;&#39640;&#32423;&#25512;&#29702;&#31574;&#30053;&#22312;&#20869;&#30340;&#26465;&#20214;&#19979;&#20195;&#29702;&#20449;&#20219;&#30340;&#20869;&#22312;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large Language Model (LLM) agents have been increasingly adopted as simulation tools to model humans in applications such as social science. However, one fundamental question remains: can LLM agents really simulate human behaviors? In this paper, we focus on one of the most critical behaviors in human interactions, trust, and aim to investigate whether or not LLM agents can simulate human trust behaviors. We first find that LLM agents generally exhibit trust behaviors, referred to as agent trust, under the framework of Trust Games, which are widely recognized in behavioral economics. Then, we discover that LLM agents can have high behavioral alignment with humans regarding trust behaviors, indicating the feasibility to simulate human trust behaviors with LLM agents. In addition, we probe into the biases in agent trust and the differences in agent trust towards agents and humans. We also explore the intrinsic properties of agent trust under conditions including advanced reasoning strate
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;AI&#22312;&#24651;&#29233;&#35299;&#20307;&#36807;&#31243;&#20013;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24403;&#21069;&#25216;&#26415;&#22312;&#20449;&#24687;&#25910;&#38598;&#12289;&#31038;&#32676;&#25903;&#25345;&#21644;&#20419;&#36827;&#27807;&#36890;&#26041;&#38754;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#21442;&#19982;&#32773;&#39044;&#35745;AI&#21487;&#20197;&#28385;&#36275;&#19981;&#21516;&#38454;&#27573;&#30340;&#38656;&#27714;&#65292;&#24110;&#21161;&#35299;&#20307;&#24651;&#24773;&#12290;</title><link>http://arxiv.org/abs/2401.09695</link><description>&lt;p&gt;
&#22312;&#32467;&#26463;&#24651;&#24773;&#36807;&#31243;&#20013;&#65292;ChatGPT&#26159;&#21542;&#24212;&#35813;&#26367;&#20320;&#20889;&#20998;&#25163;&#30701;&#20449;&#65311;&#25506;&#32034;AI&#22312;&#24651;&#29233;&#35299;&#20307;&#20013;&#30340;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
Should ChatGPT Write Your Breakup Text? Exploring the Role of AI in Relationship Dissolution. (arXiv:2401.09695v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09695
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;AI&#22312;&#24651;&#29233;&#35299;&#20307;&#36807;&#31243;&#20013;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24403;&#21069;&#25216;&#26415;&#22312;&#20449;&#24687;&#25910;&#38598;&#12289;&#31038;&#32676;&#25903;&#25345;&#21644;&#20419;&#36827;&#27807;&#36890;&#26041;&#38754;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#21442;&#19982;&#32773;&#39044;&#35745;AI&#21487;&#20197;&#28385;&#36275;&#19981;&#21516;&#38454;&#27573;&#30340;&#38656;&#27714;&#65292;&#24110;&#21161;&#35299;&#20307;&#24651;&#24773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24651;&#29233;&#20851;&#31995;&#23545;&#25105;&#20204;&#30340;&#24184;&#31119;&#21644;&#24184;&#31119;&#24863;&#33267;&#20851;&#37325;&#35201;&#12290;&#24651;&#29233;&#35299;&#20307;&#26159;&#24651;&#29233;&#29983;&#21629;&#21608;&#26399;&#30340;&#26368;&#21518;&#38454;&#27573;&#65292;&#20063;&#26159;&#20010;&#20154;&#29983;&#27963;&#20013;&#26368;&#20855;&#21387;&#21147;&#30340;&#20107;&#20214;&#20043;&#19968;&#65292;&#21487;&#33021;&#23545;&#20154;&#20204;&#20135;&#29983;&#28145;&#36828;&#32780;&#25345;&#20037;&#30340;&#24433;&#21709;&#12290;&#38543;&#30528;&#36890;&#36807;&#35745;&#31639;&#26426;&#20171;&#36136;&#20256;&#36798;&#30340;&#35299;&#20307;&#36807;&#31243;&#36234;&#26469;&#36234;&#21463;&#21040;&#25903;&#25345;&#65292;&#20197;&#21450;AI&#20171;&#20837;&#30340;&#20256;&#25773;&#26041;&#24335;&#30340;&#21487;&#33021;&#26410;&#26469;&#24433;&#21709;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#21322;&#32467;&#26500;&#21270;&#35775;&#35848;&#30740;&#31350;&#65292;&#20849;&#26377;21&#21517;&#21442;&#19982;&#32773;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#26088;&#22312;&#20102;&#35299;&#65306;1&#65289;&#25216;&#26415;&#22312;&#35299;&#20307;&#36807;&#31243;&#20013;&#30340;&#24403;&#21069;&#35282;&#33394;&#65292;2&#65289;&#20010;&#20154;&#22312;&#36807;&#31243;&#20013;&#30340;&#38656;&#27714;&#21644;&#25903;&#25345;&#65292;&#20197;&#21450;3&#65289;AI&#22914;&#20309;&#28385;&#36275;&#36825;&#20123;&#38656;&#27714;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#26174;&#31034;&#65292;&#20154;&#20204;&#22312;&#32467;&#26463;&#24651;&#24773;&#30340;&#19981;&#21516;&#38454;&#27573;&#26377;&#19981;&#21516;&#30340;&#38656;&#27714;&#12290;&#30446;&#21069;&#65292;&#25216;&#26415;&#34987;&#29992;&#20110;&#20449;&#24687;&#25910;&#38598;&#21644;&#31038;&#32676;&#25903;&#25345;&#65292;&#22312;&#20419;&#25104;&#20998;&#25163;&#12289;&#20351;&#39740;&#39746;&#24335;&#20998;&#25163;&#21644;&#25289;&#40657;&#25104;&#20026;&#21487;&#33021;&#65292;&#20197;&#21450;&#20419;&#36827;&#27807;&#36890;&#12290;&#21442;&#19982;&#32773;&#39044;&#35745;AI&#21487;&#20197;&#24110;&#21161;&#23454;&#29616;&#24863;&#30693;&#25216;&#24039;&#12290;
&lt;/p&gt;
&lt;p&gt;
Relationships are essential to our happiness and wellbeing. The dissolution of a relationship, the final stage of relationship's lifecycle and one of the most stressful events in an individual's life, can have profound and long-lasting impacts on people. With the breakup process increasingly facilitated by computer-mediated communication (CMC), and the likely future influence of AI-mediated communication (AIMC) tools, we conducted a semi-structured interview study with 21 participants. We aim to understand: 1) the current role of technology in the breakup process, 2) the needs and support individuals have during the process, and 3) how AI might address these needs. Our research shows that people have distinct needs at various stages of ending a relationship. Presently, technology is used for information gathering and community support, acting as a catalyst for breakups, enabling ghosting and blocking, and facilitating communication. Participants anticipate that AI could aid in sense-ma
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#35774;&#35745;&#20102;&#19968;&#31181;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#34892;&#20026;&#24178;&#39044;&#26041;&#27861;&#65292;&#36890;&#36807;&#25552;&#20379;&#26032;&#39062;&#30340;&#21453;&#20107;&#23454;&#35299;&#37322;&#26469;&#39044;&#38450;&#34880;&#31958;&#24322;&#24120;&#65292;&#26377;&#26395;&#23545;&#31038;&#20250;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.01684</link><description>&lt;p&gt;
&#35774;&#35745;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#34892;&#20026;&#24178;&#39044;&#26469;&#39044;&#38450;&#34880;&#31958;&#24322;&#24120;&#65292;&#24182;&#25552;&#20379;&#26032;&#39062;&#30340;&#21453;&#20107;&#23454;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Designing User-Centric Behavioral Interventions to Prevent Dysglycemia with Novel Counterfactual Explanations. (arXiv:2310.01684v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01684
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#35774;&#35745;&#20102;&#19968;&#31181;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#34892;&#20026;&#24178;&#39044;&#26041;&#27861;&#65292;&#36890;&#36807;&#25552;&#20379;&#26032;&#39062;&#30340;&#21453;&#20107;&#23454;&#35299;&#37322;&#26469;&#39044;&#38450;&#34880;&#31958;&#24322;&#24120;&#65292;&#26377;&#26395;&#23545;&#31038;&#20250;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#29983;&#27963;&#26041;&#24335;&#34892;&#20026;&#32500;&#25345;&#27491;&#24120;&#34880;&#31958;&#27700;&#24179;&#23545;&#20110;&#20445;&#25345;&#20581;&#24247;&#21644;&#39044;&#38450;&#30142;&#30149;&#33267;&#20851;&#37325;&#35201;&#12290;&#39057;&#32321;&#25509;&#35302;&#34880;&#31958;&#24322;&#24120;&#65288;&#21363;&#39640;&#34880;&#31958;&#21644;&#20302;&#34880;&#31958;&#31561;&#24322;&#24120;&#20107;&#20214;&#65289;&#20250;&#23548;&#33268;&#24930;&#24615;&#24182;&#21457;&#30151;&#65292;&#21253;&#25324;&#31958;&#23615;&#30149;&#12289;&#32958;&#33039;&#30142;&#30149;&#21450;&#38656;&#36879;&#26512;&#27835;&#30103;&#12289;&#24515;&#32908;&#26775;&#27515;&#12289;&#20013;&#39118;&#12289;&#25130;&#32930;&#21644;&#27515;&#20129;&#12290;&#22240;&#27492;&#65292;&#33021;&#22815;&#39044;&#27979;&#34880;&#31958;&#24322;&#24120;&#24182;&#21521;&#29992;&#25143;&#25552;&#20379;&#34892;&#21160;&#21453;&#39304;&#20197;&#25913;&#21464;&#39278;&#39135;&#12289;&#36816;&#21160;&#21644;&#33647;&#29289;&#27835;&#30103;&#26469;&#39044;&#38450;&#24322;&#24120;&#34880;&#31958;&#20107;&#20214;&#30340;&#24037;&#20855;&#21487;&#33021;&#20855;&#26377;&#37325;&#35201;&#30340;&#31038;&#20250;&#24433;&#21709;&#12290;&#21453;&#20107;&#23454;&#35299;&#37322;&#21487;&#20197;&#36890;&#36807;&#29983;&#25104;&#31867;&#20284;&#20110;&#21407;&#22987;&#36755;&#20837;&#20294;&#23548;&#33268;&#19981;&#21516;&#39044;&#27979;&#32467;&#26524;&#30340;&#20551;&#35774;&#23454;&#20363;&#65292;&#25552;&#20379;&#27169;&#22411;&#20026;&#20309;&#23545;&#29305;&#23450;&#39044;&#27979;&#30340;&#35265;&#35299;&#12290;&#22240;&#27492;&#65292;&#21453;&#20107;&#23454;&#35299;&#37322;&#21487;&#20197;&#34987;&#35270;&#20026;&#35774;&#35745;AI&#39537;&#21160;&#30340;&#20581;&#24247;&#24178;&#39044;&#26469;&#39044;&#38450;&#19981;&#33391;&#20581;&#24247;&#32467;&#26524;&#65288;&#22914;&#34880;&#31958;&#24322;&#24120;&#65289;&#30340;&#19968;&#31181;&#25163;&#27573;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;GlyCoa...
&lt;/p&gt;
&lt;p&gt;
Maintaining normal blood glucose levels through lifestyle behaviors is central to maintaining health and preventing disease. Frequent exposure to dysglycemia (i.e., abnormal glucose events such as hyperlycemia and hypoglycemia) leads to chronic complications including diabetes, kidney disease and need for dialysis, myocardial infarction, stroke, amputation, and death. Therefore, a tool capable of predicting dysglycemia and offering users actionable feedback about how to make changes in their diet, exercise, and medication to prevent abnormal glycemic events could have significant societal impacts. Counterfactual explanations can provide insights into why a model made a particular prediction by generating hypothetical instances that are similar to the original input but lead to a different prediction outcome. Therefore, counterfactuals can be viewed as a means to design AI-driven health interventions to prevent adverse health outcomes such as dysglycemia. In this paper, we design GlyCoa
&lt;/p&gt;</description></item></channel></rss>