<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#20154;&#24037;&#26234;&#33021;&#30340;&#36807;&#24230;&#33258;&#20449;&#21644;&#32570;&#20047;&#33258;&#20449;&#20250;&#38459;&#30861;&#20154;&#26426;&#21327;&#20316;&#65292;&#25259;&#38706;&#20449;&#24515;&#27700;&#24179;&#21644;&#25552;&#20379;&#21453;&#39304;&#26377;&#21161;&#20110;&#35748;&#35782;&#21040;&#20154;&#24037;&#26234;&#33021;&#30340;&#20449;&#24515;&#19981;&#19968;&#33268;&#65292;&#20294;&#21442;&#19982;&#32773;&#24448;&#24448;&#22240;&#27492;&#19981;&#20449;&#20219;&#20154;&#24037;&#26234;&#33021;&#30340;&#24314;&#35758;&#65292;&#23548;&#33268;&#21327;&#20316;&#32467;&#26524;&#36739;&#24046;&#12290;</title><link>https://arxiv.org/abs/2402.07632</link><description>&lt;p&gt;
&#36807;&#20110;&#33258;&#20449;&#21644;&#32570;&#20047;&#33258;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;&#38459;&#30861;&#20154;&#26426;&#21327;&#20316;
&lt;/p&gt;
&lt;p&gt;
Overconfident and Unconfident AI Hinder Human-AI Collaboration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07632
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#36807;&#24230;&#33258;&#20449;&#21644;&#32570;&#20047;&#33258;&#20449;&#20250;&#38459;&#30861;&#20154;&#26426;&#21327;&#20316;&#65292;&#25259;&#38706;&#20449;&#24515;&#27700;&#24179;&#21644;&#25552;&#20379;&#21453;&#39304;&#26377;&#21161;&#20110;&#35748;&#35782;&#21040;&#20154;&#24037;&#26234;&#33021;&#30340;&#20449;&#24515;&#19981;&#19968;&#33268;&#65292;&#20294;&#21442;&#19982;&#32773;&#24448;&#24448;&#22240;&#27492;&#19981;&#20449;&#20219;&#20154;&#24037;&#26234;&#33021;&#30340;&#24314;&#35758;&#65292;&#23548;&#33268;&#21327;&#20316;&#32467;&#26524;&#36739;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#30340;&#36827;&#27493;&#65292;&#20154;&#26426;&#21327;&#20316;&#22312;&#19987;&#19994;&#21644;&#26085;&#24120;&#22330;&#26223;&#20013;&#36234;&#26469;&#36234;&#26222;&#36941;&#12290;&#22312;&#36825;&#31181;&#21327;&#20316;&#20013;&#65292;&#20154;&#24037;&#26234;&#33021;&#21487;&#20197;&#34920;&#36798;&#20854;&#23545;&#33258;&#24049;&#34920;&#29616;&#30340;&#20449;&#24515;&#27700;&#24179;&#65292;&#20316;&#20026;&#20154;&#31867;&#35780;&#20272;&#20154;&#24037;&#26234;&#33021;&#24314;&#35758;&#30340;&#37325;&#35201;&#25351;&#26631;&#12290;&#28982;&#32780;&#65292;&#20154;&#24037;&#26234;&#33021;&#21487;&#33021;&#34920;&#29616;&#20986;&#36807;&#24230;&#33258;&#20449;&#25110;&#32570;&#20047;&#33258;&#20449;&#65292;&#21363;&#20854;&#34920;&#36798;&#30340;&#20449;&#24515;&#39640;&#20110;&#25110;&#20302;&#20110;&#20854;&#23454;&#38469;&#34920;&#29616;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#20154;&#20204;&#38169;&#35823;&#22320;&#35780;&#20272;&#20154;&#24037;&#26234;&#33021;&#30340;&#24314;&#35758;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#36807;&#24230;&#33258;&#20449;&#21644;&#32570;&#20047;&#33258;&#20449;&#23545;&#20154;&#31867;&#20449;&#20219;&#12289;&#25509;&#21463;&#20154;&#24037;&#26234;&#33021;&#24314;&#35758;&#21644;&#21327;&#20316;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#25259;&#38706;&#20154;&#24037;&#26234;&#33021;&#30340;&#20449;&#24515;&#27700;&#24179;&#21644;&#34920;&#29616;&#21453;&#39304;&#26377;&#21161;&#20110;&#26356;&#22909;&#22320;&#35748;&#35782;&#20154;&#24037;&#26234;&#33021;&#20449;&#24515;&#19981;&#19968;&#33268;&#12290;&#28982;&#32780;&#65292;&#21442;&#19982;&#32773;&#24448;&#24448;&#20250;&#22240;&#20026;&#23519;&#35273;&#21040;&#36825;&#31181;&#19981;&#19968;&#33268;&#32780;&#19981;&#20449;&#20219;&#20154;&#24037;&#26234;&#33021;&#30340;&#24314;&#35758;&#65292;&#23548;&#33268;&#25298;&#32477;&#20154;&#24037;&#26234;&#33021;&#30340;&#24314;&#35758;&#65292;&#24182;&#19988;&#22312;&#21327;&#20316;&#20219;&#21153;&#20013;&#34920;&#29616;&#26356;&#24046;&#12290;&#30456;&#21453;&#65292;&#27809;&#26377;&#36825;&#20123;&#25552;&#31034;&#30340;&#24773;&#20917;&#19979;&#65292;&#21442;&#19982;&#32773;&#26356;&#23481;&#26131;&#20449;&#20219;&#20154;&#24037;&#26234;&#33021;&#24182;&#25509;&#21463;&#20854;&#24314;&#35758;&#65292;&#20174;&#32780;&#22312;&#21327;&#20316;&#20219;&#21153;&#20013;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
As artificial intelligence (AI) advances, human-AI collaboration has become increasingly prevalent across both professional and everyday settings. In such collaboration, AI can express its confidence level about its performance, serving as a crucial indicator for humans to evaluate AI's suggestions. However, AI may exhibit overconfidence or underconfidence--its expressed confidence is higher or lower than its actual performance--which may lead humans to mistakenly evaluate AI advice. Our study investigates the influences of AI's overconfidence and underconfidence on human trust, their acceptance of AI suggestions, and collaboration outcomes. Our study reveal that disclosing AI confidence levels and performance feedback facilitates better recognition of AI confidence misalignments. However, participants tend to withhold their trust as perceiving such misalignments, leading to a rejection of AI suggestions and subsequently poorer performance in collaborative tasks. Conversely, without su
&lt;/p&gt;</description></item></channel></rss>