<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>AI&#24605;&#24819;&#23545;&#20010;&#20307;&#21019;&#36896;&#21147;&#27809;&#26377;&#24433;&#21709;&#65292;&#20294;&#22686;&#21152;&#20102;&#25972;&#20307;&#24605;&#24819;&#22810;&#26679;&#24615;&#30340;&#25968;&#37327;&#21644;&#21464;&#21270;&#36895;&#29575;&#12290;</title><link>http://arxiv.org/abs/2401.13481</link><description>&lt;p&gt;
AI&#24605;&#24819;&#22914;&#20309;&#24433;&#21709;&#20154;&#31867;&#24605;&#24819;&#30340;&#21019;&#36896;&#21147;&#12289;&#22810;&#26679;&#24615;&#21644;&#36827;&#21270;&#65306;&#26469;&#33258;&#19968;&#20010;&#22823;&#35268;&#27169;&#21160;&#24577;&#23454;&#39564;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
How AI Ideas Affect the Creativity, Diversity, and Evolution of Human Ideas: Evidence From a Large, Dynamic Experiment. (arXiv:2401.13481v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13481
&lt;/p&gt;
&lt;p&gt;
AI&#24605;&#24819;&#23545;&#20010;&#20307;&#21019;&#36896;&#21147;&#27809;&#26377;&#24433;&#21709;&#65292;&#20294;&#22686;&#21152;&#20102;&#25972;&#20307;&#24605;&#24819;&#22810;&#26679;&#24615;&#30340;&#25968;&#37327;&#21644;&#21464;&#21270;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#36755;&#20986;&#30340;&#25509;&#35302;&#27491;&#22312;&#36805;&#36895;&#22686;&#21152;&#12290;&#35266;&#30475;&#21040;AI&#29983;&#25104;&#30340;&#24605;&#24819;&#23558;&#22914;&#20309;&#24433;&#21709;&#20154;&#31867;&#24605;&#24819;&#65311;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#23454;&#39564;&#65288;800+&#21442;&#19982;&#32773;&#65292;40+&#20010;&#22269;&#23478;&#65289;&#65292;&#21442;&#19982;&#32773;&#35266;&#30475;&#20102;&#26469;&#33258;ChatGPT&#25110;&#20043;&#21069;&#23454;&#39564;&#21442;&#19982;&#32773;&#30340;&#21019;&#24847;&#24605;&#24819;&#65292;&#28982;&#21518;&#36827;&#34892;&#20102;&#33258;&#24049;&#30340;&#21019;&#24847;&#24605;&#32771;&#12290;&#25105;&#20204;&#21464;&#21270;&#20102;AI&#29983;&#25104;&#31034;&#20363;&#30340;&#25968;&#37327;&#65288;&#26080;&#12289;&#20302;&#12289;&#39640;&#26333;&#20809;&#65289;&#20197;&#21450;&#31034;&#20363;&#26159;&#21542;&#26631;&#35760;&#20026;&#8220;AI&#8221;&#65288;&#25259;&#38706;&#65289;&#12290;&#25105;&#20204;&#30340;&#21160;&#24577;&#23454;&#39564;&#35774;&#35745; - &#22312;&#21516;&#19968;&#23454;&#39564;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;&#20043;&#21069;&#21442;&#19982;&#32773;&#30340;&#24605;&#24819;&#20316;&#20026;&#26410;&#26469;&#21442;&#19982;&#32773;&#30340;&#21050;&#28608; - &#27169;&#25311;&#20102;&#25991;&#21270;&#21019;&#36896;&#30340;&#30456;&#20114;&#20381;&#36182;&#36807;&#31243;&#65306;&#21019;&#36896;&#24615;&#24605;&#24819;&#24314;&#31435;&#22312;&#20043;&#21069;&#30340;&#24605;&#24819;&#22522;&#30784;&#19978;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25429;&#25417;&#21040;&#20102;LLM&#8220;&#22312;&#25991;&#21270;&#24490;&#29615;&#20013;&#8221;&#30340;&#22797;&#21512;&#25928;&#24212;&#12290;&#25105;&#20204;&#21457;&#29616;&#39640;AI&#26333;&#20809;&#65288;&#20294;&#19981;&#26159;&#20302;AI&#26333;&#20809;&#65289;&#24182;&#27809;&#26377;&#24433;&#21709;&#20010;&#20154;&#24605;&#24819;&#30340;&#21019;&#36896;&#21147;&#65292;&#20294;&#22686;&#21152;&#20102;&#25972;&#20307;&#24605;&#24819;&#22810;&#26679;&#24615;&#30340;&#24179;&#22343;&#25968;&#37327;&#21644;&#21464;&#21270;&#36895;&#29575;&#12290;AI&#20351;&#24605;&#24819;&#22810;&#26679;&#24615;&#30340;&#32047;&#31215;&#25928;&#24212;&#22686;&#24378;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Exposure to large language model output is rapidly increasing. How will seeing AI-generated ideas affect human ideas? We conducted an experiment (800+ participants, 40+ countries) where participants viewed creative ideas that were from ChatGPT or prior experimental participants and then brainstormed their own idea. We varied the number of AI-generated examples (none, low, or high exposure) and if the examples were labeled as 'AI' (disclosure). Our dynamic experiment design -- ideas from prior participants in an experimental condition are used as stimuli for future participants in the same experimental condition -- mimics the interdependent process of cultural creation: creative ideas are built upon prior ideas. Hence, we capture the compounding effects of having LLMs 'in the culture loop'. We find that high AI exposure (but not low AI exposure) did not affect the creativity of individual ideas but did increase the average amount and rate of change of collective idea diversity. AI made 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102; ChatGPT &#21644; GPT-4 &#20004;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#23454;&#38469;&#24773;&#20917;&#19979;&#30340;&#36816;&#29992;&#21644;&#24615;&#33021;&#34920;&#29616;&#65292;&#36890;&#36807;&#20197;&#20154;&#26426;&#20132;&#20114;&#39046;&#22495;&#30340;&#30740;&#31350;&#25361;&#25112;&#20026;&#20363;&#65292;&#32467;&#35770;&#26159; ChatGPT &#21644; GPT-4 &#30340;&#32452;&#21512;&#26159;&#20998;&#26512;&#25991;&#26412;&#35821;&#26009;&#24211;&#30340;&#19968;&#31181;&#38750;&#24120;&#39640;&#25928;&#19988;&#33410;&#30465;&#25104;&#26412;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2306.05036</link><description>&lt;p&gt;
HCI&#25361;&#25112;&#30340;&#26144;&#23556;&#65306;ChatGPT&#21644;GPT-4&#22312;&#25104;&#26412;&#25928;&#30410;&#38382;&#31572;&#20013;&#30340;&#24212;&#29992;&#19982;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Mapping the Challenges of HCI: An Application and Evaluation of ChatGPT and GPT-4 for Cost-Efficient Question Answering. (arXiv:2306.05036v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05036
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102; ChatGPT &#21644; GPT-4 &#20004;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#23454;&#38469;&#24773;&#20917;&#19979;&#30340;&#36816;&#29992;&#21644;&#24615;&#33021;&#34920;&#29616;&#65292;&#36890;&#36807;&#20197;&#20154;&#26426;&#20132;&#20114;&#39046;&#22495;&#30340;&#30740;&#31350;&#25361;&#25112;&#20026;&#20363;&#65292;&#32467;&#35770;&#26159; ChatGPT &#21644; GPT-4 &#30340;&#32452;&#21512;&#26159;&#20998;&#26512;&#25991;&#26412;&#35821;&#26009;&#24211;&#30340;&#19968;&#31181;&#38750;&#24120;&#39640;&#25928;&#19988;&#33410;&#30465;&#25104;&#26412;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22914;ChatGPT&#21644;GPT-4&#27491;&#22312;&#24191;&#27867;&#24212;&#29992;&#20110;&#23454;&#38469;&#24773;&#20917;&#12290;&#20294;&#26159;&#65292;&#36825;&#20004;&#31181;LLM&#26159;&#38381;&#28304;&#30340;&#65292;&#24182;&#19988;&#24456;&#23569;&#26377;&#20851;&#20110;&#23427;&#20204;&#22312;&#23454;&#38469;&#20351;&#29992;&#26696;&#20363;&#20013;&#30340;&#24615;&#33021;&#30340;&#20102;&#35299;&#12290;&#22312;&#23398;&#26415;&#30028;&#20013;&#65292;LLM&#30340;&#24615;&#33021;&#36890;&#24120;&#26159;&#22312;&#22522;&#20934;&#27979;&#35797;&#20013;&#27979;&#37327;&#30340;&#65292;&#36825;&#20123;&#22522;&#20934;&#27979;&#35797;&#21487;&#33021;&#24050;&#27844;&#28431;&#21040;ChatGPT&#21644;GPT-4&#30340;&#35757;&#32451;&#25968;&#25454;&#20013;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;ChatGPT&#21644;GPT-4&#24212;&#29992;&#20110;&#25104;&#26412;&#25928;&#30410;&#38382;&#31572;&#30340;&#23454;&#38469;&#20219;&#21153;&#65292;&#20197;&#20174;2023&#24180;&#20154;&#26426;&#20132;&#20114;&#20250;&#35758;&#65288;CHI&#65289;&#30340;&#35770;&#25991;&#38598;&#20013;&#25552;&#21462;&#20154;&#26426;&#20132;&#20114;&#39046;&#22495;&#30740;&#31350;&#20154;&#21592;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#23545;LLM&#22312;&#36825;&#20010;&#23454;&#38469;&#20219;&#21153;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65292;ChatGPT&#21644;GPT-4&#30340;&#32452;&#21512;&#26159;&#20998;&#26512;&#25991;&#26412;&#35821;&#26009;&#24211;&#30340;&#26497;&#20339;&#25104;&#26412;&#25928;&#30410;&#25163;&#27573;&#12290;&#25104;&#26412;&#25928;&#29575;&#23545;&#20110;&#21407;&#22411;&#30740;&#31350;&#24819;&#27861;&#21644;&#20174;&#19981;&#21516;&#35282;&#24230;&#20998;&#26512;&#25991;&#26412;&#35821;&#26009;&#24211;&#38750;&#24120;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models (LLMs), such as ChatGPT and GPT-4, are gaining wide-spread real world use. Yet, the two LLMs are closed source, and little is known about the LLMs' performance in real-world use cases. In academia, LLM performance is often measured on benchmarks which may have leaked into ChatGPT's and GPT-4's training data. In this paper, we apply and evaluate ChatGPT and GPT-4 for the real-world task of cost-efficient extractive question answering over a text corpus that was published after the two LLMs completed training. More specifically, we extract research challenges for researchers in the field of HCI from the proceedings of the 2023 Conference on Human Factors in Computing Systems (CHI). We critically evaluate the LLMs on this practical task and conclude that the combination of ChatGPT and GPT-4 makes an excellent cost-efficient means for analyzing a text corpus at scale. Cost-efficiency is key for prototyping research ideas and analyzing text corpora from different persp
&lt;/p&gt;</description></item></channel></rss>