<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#24341;&#20837;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#40657;&#23458;&#39532;&#25289;&#26494;&#22312;&#36719;&#20214;&#34892;&#19994;&#20013;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#65292;&#24182;&#22312;&#25945;&#32946;&#39046;&#22495;&#24102;&#26469;&#20102;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2401.17434</link><description>&lt;p&gt;
&#22312;&#40657;&#23458;&#39532;&#25289;&#26494;&#20013;&#38598;&#25104;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;: &#26426;&#36935;&#65292;&#25361;&#25112;&#21644;&#25945;&#32946;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Integrating Generative AI in Hackathons: Opportunities, Challenges, and Educational Implications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17434
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#40657;&#23458;&#39532;&#25289;&#26494;&#22312;&#36719;&#20214;&#34892;&#19994;&#20013;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#65292;&#24182;&#22312;&#25945;&#32946;&#39046;&#22495;&#24102;&#26469;&#20102;&#26426;&#36935;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#40657;&#23458;&#39532;&#25289;&#26494;&#21644;&#36719;&#20214;&#31454;&#36187;&#22312;&#36719;&#20214;&#34892;&#19994;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#23427;&#20204;&#23545;&#32452;&#32455;&#21644;&#23398;&#29983;&#30340;&#21019;&#26032;&#21644;&#25216;&#33021;&#21457;&#23637;&#36215;&#21040;&#37325;&#35201;&#25512;&#21160;&#20316;&#29992;&#12290;&#36825;&#20123;&#24179;&#21488;&#20351;&#20844;&#21496;&#33021;&#22815;&#36805;&#36895;&#21407;&#22411;&#21270;&#24819;&#27861;&#65292;&#32780;&#23398;&#29983;&#21017;&#33719;&#24471;&#20016;&#23500;&#30340;&#23398;&#20064;&#32463;&#39564;&#65292;&#22686;&#24378;&#20182;&#20204;&#30340;&#23454;&#36341;&#25216;&#33021;&#12290;&#22810;&#24180;&#26469;&#65292;&#40657;&#23458;&#39532;&#25289;&#26494;&#24050;&#32463;&#20174;&#31616;&#21333;&#30340;&#31454;&#20105;&#27963;&#21160;&#36716;&#21464;&#20026;&#37325;&#35201;&#30340;&#25945;&#32946;&#24037;&#20855;&#65292;&#23558;&#29702;&#35770;&#30693;&#35782;&#19982;&#23454;&#38469;&#38382;&#39064;&#35299;&#20915;&#30456;&#32467;&#21512;&#12290;&#23558;&#40657;&#23458;&#39532;&#25289;&#26494;&#32435;&#20837;&#35745;&#31639;&#26426;&#31185;&#23398;&#21644;&#36719;&#20214;&#24037;&#31243;&#35838;&#31243;&#30340;&#25972;&#21512;&#26088;&#22312;&#22312;&#21512;&#20316;&#30340;&#29615;&#22659;&#20013;&#23545;&#40784;&#25945;&#32946;&#33021;&#21147;&#65292;&#36890;&#36807;&#20135;&#23398;&#21512;&#20316;&#20419;&#36827;&#21516;&#34892;&#20043;&#38388;&#30340;&#36830;&#25509;&#21644;&#20016;&#23500;&#23398;&#20064;&#12290;&#28982;&#32780;&#65292;&#39640;&#32423;&#25216;&#26415;&#65292;&#29305;&#21035;&#26159;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21644;&#26426;&#22120;&#23398;&#20064;&#30340;&#34701;&#21512;&#36827;&#40657;&#23458;&#39532;&#25289;&#26494;&#27491;&#22312;&#25913;&#21464;&#23427;&#20204;&#30340;&#32467;&#26500;&#21644;&#32467;&#26524;&#12290;&#36825;&#31181;&#28436;&#21464;&#24102;&#26469;&#20102;&#26426;&#36935;&#65292;&#22914;&#22686;&#24378;&#30340;&#23398;&#20064;&#20307;&#39564;&#65292;
&lt;/p&gt;
&lt;p&gt;
Hackathons and software competitions, increasingly pivotal in the software industry, serve as vital catalysts for innovation and skill development for both organizations and students. These platforms enable companies to prototype ideas swiftly, while students gain enriched learning experiences, enhancing their practical skills. Over the years, hackathons have transitioned from mere competitive events to significant educational tools, fusing theoretical knowledge with real-world problem-solving. The integration of hackathons into computer science and software engineering curricula aims to align educational proficiencies within a collaborative context, promoting peer connectivity and enriched learning via industry-academia collaborations. However, the infusion of advanced technologies, notably artificial intelligence (AI), and machine learning, into hackathons is revolutionizing their structure and outcomes. This evolution brings forth both opportunities, like enhanced learning experienc
&lt;/p&gt;</description></item></channel></rss>