<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20013;&#38754;&#20020;&#30340;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.10448</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20197;&#21450;&#31038;&#20250;&#38519;&#38449;
&lt;/p&gt;
&lt;p&gt;
Human-AI Interactions and Societal Pitfalls. (arXiv:2309.10448v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10448
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20013;&#38754;&#20020;&#30340;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#19982;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21512;&#20316;&#26102;&#65292;&#29992;&#25143;&#21487;&#33021;&#20250;&#30475;&#21040;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#65292;&#20294;AI&#29983;&#25104;&#30340;&#20869;&#23481;&#21487;&#33021;&#19981;&#23436;&#20840;&#31526;&#21512;&#20182;&#20204;&#30340;&#20559;&#22909;&#12290;&#20026;&#20102;&#30740;&#31350;&#36825;&#31181;&#24433;&#21709;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#20854;&#20013;&#24322;&#36136;&#29992;&#25143;&#36873;&#25321;&#19982;AI&#20849;&#20139;&#22810;&#23569;&#20449;&#24687;&#65292;&#38754;&#20020;&#36755;&#20986;&#20445;&#30495;&#24230;&#21644;&#36890;&#20449;&#25104;&#26412;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20123;&#20010;&#20307;&#20915;&#31574;&#19982;AI&#35757;&#32451;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#21487;&#33021;&#23548;&#33268;&#31038;&#20250;&#25361;&#25112;&#12290;&#36755;&#20986;&#21487;&#33021;&#21464;&#24471;&#26356;&#21152;&#21516;&#36136;&#21270;&#65292;&#29305;&#21035;&#26159;&#24403;AI&#22312;AI&#29983;&#25104;&#30340;&#20869;&#23481;&#19978;&#36827;&#34892;&#35757;&#32451;&#26102;&#12290;&#32780;&#20219;&#20309;AI&#30340;&#20559;&#35265;&#21487;&#33021;&#25104;&#20026;&#31038;&#20250;&#20559;&#35265;&#12290;&#35299;&#20915;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#30340;&#21150;&#27861;&#26159;&#25913;&#36827;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#30340;&#20114;&#21160;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
When working with generative artificial intelligence (AI), users may see productivity gains, but the AI-generated content may not match their preferences exactly. To study this effect, we introduce a Bayesian framework in which heterogeneous users choose how much information to share with the AI, facing a trade-off between output fidelity and communication cost. We show that the interplay between these individual-level decisions and AI training may lead to societal challenges. Outputs may become more homogenized, especially when the AI is trained on AI-generated content. And any AI bias may become societal bias. A solution to the homogenization and bias issues is to improve human-AI interactions, enabling personalized outputs without sacrificing productivity.
&lt;/p&gt;</description></item></channel></rss>