<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>GOMA&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#21521;&#30446;&#26631;&#30340;&#24515;&#26234;&#23545;&#40784;&#30340;&#21512;&#20316;&#27807;&#36890;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#26234;&#33021;&#20307;&#24515;&#26234;&#29366;&#24577;&#37096;&#20998;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24615;&#26469;&#24110;&#21161;&#23454;&#29616;&#26356;&#22909;&#30340;&#21512;&#20316;&#12290;</title><link>https://arxiv.org/abs/2403.11075</link><description>&lt;p&gt;
GOMA&#65306;&#36890;&#36807;&#38754;&#21521;&#30446;&#26631;&#30340;&#24515;&#26234;&#23545;&#40784;&#23454;&#29616;&#20027;&#21160;&#21512;&#20316;&#27807;&#36890;
&lt;/p&gt;
&lt;p&gt;
GOMA: Proactive Embodied Cooperative Communication via Goal-Oriented Mental Alignment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11075
&lt;/p&gt;
&lt;p&gt;
GOMA&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#21521;&#30446;&#26631;&#30340;&#24515;&#26234;&#23545;&#40784;&#30340;&#21512;&#20316;&#27807;&#36890;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#26234;&#33021;&#20307;&#24515;&#26234;&#29366;&#24577;&#37096;&#20998;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24615;&#26469;&#24110;&#21161;&#23454;&#29616;&#26356;&#22909;&#30340;&#21512;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21475;&#22836;&#20132;&#27969;&#22312;&#20154;&#31867;&#21512;&#20316;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#29305;&#21035;&#26159;&#24403;&#21512;&#20316;&#20249;&#20276;&#21482;&#23545;&#20219;&#21153;&#12289;&#29615;&#22659;&#21644;&#24444;&#27492;&#30340;&#24515;&#29702;&#29366;&#24577;&#20855;&#26377;&#19981;&#23436;&#25972;&#30340;&#20449;&#24687;&#26102;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21512;&#20316;&#27807;&#36890;&#26694;&#26550;&#65292;&#21363;&#38754;&#21521;&#30446;&#26631;&#30340;&#24515;&#26234;&#23545;&#40784;&#65288;GOMA&#65289;&#12290;GOMA&#23558;&#21475;&#22836;&#20132;&#27969;&#24418;&#24335;&#21270;&#20026;&#19968;&#20010;&#35268;&#21010;&#38382;&#39064;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#19982;&#30446;&#26631;&#30456;&#20851;&#30340;&#26234;&#33021;&#20307;&#24515;&#26234;&#29366;&#24577;&#37096;&#20998;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24615;&#26469;&#20419;&#36827;&#21512;&#20316;&#12290;&#36825;&#31181;&#26041;&#27861;&#20351;&#24471;&#19968;&#20010;&#20855;&#26377;&#36523;&#20307;&#30340;&#21161;&#25163;&#33021;&#22815;&#25512;&#29702;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#20197;&#33258;&#28982;&#35821;&#35328;&#20027;&#21160;&#24320;&#22987;&#19982;&#20154;&#31867;&#30340;&#21475;&#22836;&#27807;&#36890;&#65292;&#20174;&#32780;&#24110;&#21161;&#23454;&#29616;&#26356;&#22909;&#30340;&#21512;&#20316;&#12290;&#25105;&#20204;&#22312;&#20004;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#29615;&#22659;&#65292;Overcooked&#65288;&#19968;&#27454;&#22810;&#20154;&#28216;&#25103;&#65289;&#21644;VirtualHome&#65288;&#19968;&#20010;&#23478;&#24237;&#27169;&#25311;&#22120;&#65289;&#20013;&#65292;&#23545;&#25105;&#20204;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#29983;&#25104;&#22522;&#20110;&#35821;&#22659;&#30340;&#26377;&#24847;&#20041;&#27807;&#36890;&#26041;&#38754;&#23384;&#22312;&#22256;&#38590;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11075v1 Announce Type: cross  Abstract: Verbal communication plays a crucial role in human cooperation, particularly when the partners only have incomplete information about the task, environment, and each other's mental state. In this paper, we propose a novel cooperative communication framework, Goal-Oriented Mental Alignment (GOMA). GOMA formulates verbal communication as a planning problem that minimizes the misalignment between the parts of agents' mental states that are relevant to the goals. This approach enables an embodied assistant to reason about when and how to proactively initialize communication with humans verbally using natural language to help achieve better cooperation. We evaluate our approach against strong baselines in two challenging environments, Overcooked (a multiplayer game) and VirtualHome (a household simulator). Our experimental results demonstrate that large language models struggle with generating meaningful communication that is grounded in th
&lt;/p&gt;</description></item></channel></rss>