<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>ThermoHands&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#22522;&#20934;ThermoHands&#65292;&#26088;&#22312;&#35299;&#20915;&#28909;&#22270;&#20013;&#20027;&#35266;&#35270;&#35282;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#30340;&#25361;&#25112;&#65292;&#20171;&#32461;&#20102;&#19968;&#20010;&#20855;&#26377;&#21452;transformer&#27169;&#22359;&#30340;&#23450;&#21046;&#22522;&#32447;&#26041;&#27861;TheFormer&#65292;&#34920;&#26126;&#28909;&#25104;&#20687;&#22312;&#24694;&#21155;&#26465;&#20214;&#19979;&#23454;&#29616;&#31283;&#20581;&#30340;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.09871</link><description>&lt;p&gt;
ThermoHands&#65306;&#19968;&#31181;&#29992;&#20110;&#20174;&#20027;&#35266;&#35270;&#35282;&#28909;&#22270;&#20013;&#20272;&#35745;3D&#25163;&#37096;&#23039;&#21183;&#30340;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
ThermoHands: A Benchmark for 3D Hand Pose Estimation from Egocentric Thermal Image
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09871
&lt;/p&gt;
&lt;p&gt;
ThermoHands&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#22522;&#20934;ThermoHands&#65292;&#26088;&#22312;&#35299;&#20915;&#28909;&#22270;&#20013;&#20027;&#35266;&#35270;&#35282;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#30340;&#25361;&#25112;&#65292;&#20171;&#32461;&#20102;&#19968;&#20010;&#20855;&#26377;&#21452;transformer&#27169;&#22359;&#30340;&#23450;&#21046;&#22522;&#32447;&#26041;&#27861;TheFormer&#65292;&#34920;&#26126;&#28909;&#25104;&#20687;&#22312;&#24694;&#21155;&#26465;&#20214;&#19979;&#23454;&#29616;&#31283;&#20581;&#30340;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;ThermoHands&#65292;&#36825;&#26159;&#19968;&#20010;&#38024;&#23545;&#22522;&#20110;&#28909;&#22270;&#30340;&#20027;&#35266;&#35270;&#35282;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#30340;&#26032;&#22522;&#20934;&#65292;&#26088;&#22312;&#20811;&#26381;&#35832;&#22914;&#20809;&#29031;&#21464;&#21270;&#21644;&#36974;&#25377;&#65288;&#20363;&#22914;&#25163;&#37096;&#31359;&#25140;&#29289;&#65289;&#31561;&#25361;&#25112;&#12290;&#35813;&#22522;&#20934;&#21253;&#25324;&#26469;&#33258;28&#21517;&#20027;&#20307;&#36827;&#34892;&#25163;-&#29289;&#20307;&#21644;&#25163;-&#34394;&#25311;&#20132;&#20114;&#30340;&#22810;&#26679;&#25968;&#25454;&#38598;&#65292;&#32463;&#36807;&#33258;&#21160;&#21270;&#36807;&#31243;&#20934;&#30830;&#26631;&#27880;&#20102;3D&#25163;&#37096;&#23039;&#21183;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#23450;&#21046;&#30340;&#22522;&#32447;&#26041;&#27861;TheFormer&#65292;&#21033;&#29992;&#21452;transformer&#27169;&#22359;&#22312;&#28909;&#22270;&#20013;&#23454;&#29616;&#26377;&#25928;&#30340;&#20027;&#35266;&#35270;&#35282;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#31361;&#26174;&#20102;TheFormer&#30340;&#39046;&#20808;&#24615;&#33021;&#65292;&#24182;&#30830;&#35748;&#20102;&#28909;&#25104;&#20687;&#22312;&#23454;&#29616;&#24694;&#21155;&#26465;&#20214;&#19979;&#31283;&#20581;&#30340;3D&#25163;&#37096;&#23039;&#21183;&#20272;&#35745;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09871v1 Announce Type: cross  Abstract: In this work, we present ThermoHands, a new benchmark for thermal image-based egocentric 3D hand pose estimation, aimed at overcoming challenges like varying lighting and obstructions (e.g., handwear). The benchmark includes a diverse dataset from 28 subjects performing hand-object and hand-virtual interactions, accurately annotated with 3D hand poses through an automated process. We introduce a bespoken baseline method, TheFormer, utilizing dual transformer modules for effective egocentric 3D hand pose estimation in thermal imagery. Our experimental results highlight TheFormer's leading performance and affirm thermal imaging's effectiveness in enabling robust 3D hand pose estimation in adverse conditions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#22312;&#24314;&#31569;&#33021;&#28304;&#31995;&#32479;&#20013;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#23558;Shapley&#20540;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#25552;&#39640;&#20102;&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#27169;&#22411;&#30340;&#36879;&#26126;&#24615;&#21644;&#29702;&#35299;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09584</link><description>&lt;p&gt;
&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#24314;&#31569;&#33021;&#28304;&#31995;&#32479;&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#30340;&#21487;&#35299;&#37322;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Large Language Model-Based Interpretable Machine Learning Control in Building Energy Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09584
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#22312;&#24314;&#31569;&#33021;&#28304;&#31995;&#32479;&#20013;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#23558;Shapley&#20540;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#25552;&#39640;&#20102;&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#27169;&#22411;&#30340;&#36879;&#26126;&#24615;&#21644;&#29702;&#35299;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#22312;&#26262;&#36890;&#31354;&#35843;&#31995;&#32479;&#20013;&#30340;&#28508;&#21147;&#21463;&#38480;&#20110;&#20854;&#19981;&#36879;&#26126;&#30340;&#24615;&#36136;&#21644;&#25512;&#29702;&#26426;&#21046;&#65292;&#36825;&#23545;&#20110;&#29992;&#25143;&#21644;&#24314;&#27169;&#32773;&#26469;&#35828;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#65292;&#38590;&#20197;&#23436;&#20840;&#29702;&#35299;&#65292;&#26368;&#32456;&#23548;&#33268;&#23545;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#25511;&#21046;&#30340;&#20915;&#31574;&#32570;&#20047;&#20449;&#20219;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65292;&#26412;&#25991;&#30740;&#31350;&#21644;&#25506;&#32034;&#20102;&#21487;&#35299;&#37322;&#26426;&#22120;&#23398;&#20064;&#65288;IML&#65289;&#65292;&#23427;&#26159;&#26426;&#22120;&#23398;&#20064;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#21487;&#20197;&#22686;&#24378;&#27169;&#22411;&#21644;&#25512;&#29702;&#30340;&#36879;&#26126;&#24615;&#21644;&#29702;&#35299;&#24615;&#65292;&#20197;&#25552;&#39640;MLC&#21450;&#20854;&#22312;&#26262;&#36890;&#31354;&#35843;&#31995;&#32479;&#20013;&#30340;&#24037;&#19994;&#24212;&#29992;&#30340;&#21487;&#20449;&#24230;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#21019;&#26032;&#24615;&#30340;&#26694;&#26550;&#65292;&#23558;Shapley&#20540;&#30340;&#21407;&#21017;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#19978;&#19979;&#25991;&#23398;&#20064;&#29305;&#24615;&#30456;&#32467;&#21512;&#12290;&#32780;Shapley&#20540;&#22312;&#35299;&#21078;ML&#27169;&#22411;&#20013;&#21508;&#31181;&#29305;&#24449;&#30340;&#36129;&#29486;&#26041;&#38754;&#36215;&#21040;&#20102;&#37325;&#35201;&#20316;&#29992;&#65292;LLM&#21017;&#21487;&#20197;&#28145;&#20837;&#29702;&#35299;MLC&#20013;&#22522;&#20110;&#35268;&#21017;&#30340;&#37096;&#20998;&#65307;&#23558;&#23427;&#20204;&#32467;&#21512;&#36215;&#26469;&#65292;LLM&#36827;&#19968;&#27493;&#23558;&#36825;&#20123;&#27934;&#35265;&#25171;&#21253;&#21040;&#19968;&#20010;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09584v1 Announce Type: new  Abstract: The potential of Machine Learning Control (MLC) in HVAC systems is hindered by its opaque nature and inference mechanisms, which is challenging for users and modelers to fully comprehend, ultimately leading to a lack of trust in MLC-based decision-making. To address this challenge, this paper investigates and explores Interpretable Machine Learning (IML), a branch of Machine Learning (ML) that enhances transparency and understanding of models and their inferences, to improve the credibility of MLC and its industrial application in HVAC systems. Specifically, we developed an innovative framework that combines the principles of Shapley values and the in-context learning feature of Large Language Models (LLMs). While the Shapley values are instrumental in dissecting the contributions of various features in ML models, LLM provides an in-depth understanding of rule-based parts in MLC; combining them, LLM further packages these insights into a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;ChatGPT&#19982;EnergyPlus&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#36719;&#20214;&#34701;&#21512;&#30340;&#21019;&#26032;&#26041;&#27861;&#65292;&#24182;&#24378;&#35843;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#35299;&#20915;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#25361;&#25112;&#26041;&#38754;&#30340;&#28508;&#21147;&#21644;&#22810;&#31181;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.09579</link><description>&lt;p&gt;
&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25512;&#21160;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#65306;&#25506;&#32034;&#21644;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Advancing Building Energy Modeling with Large Language Models: Exploration and Case Studies
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09579
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;ChatGPT&#19982;EnergyPlus&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#36719;&#20214;&#34701;&#21512;&#30340;&#21019;&#26032;&#26041;&#27861;&#65292;&#24182;&#24378;&#35843;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#35299;&#20915;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#25361;&#25112;&#26041;&#38754;&#30340;&#28508;&#21147;&#21644;&#22810;&#31181;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#24555;&#36895;&#21457;&#23637;&#20419;&#36827;&#20102;&#20687;ChatGPT&#36825;&#26679;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20986;&#29616;&#65292;&#20026;&#19987;&#38376;&#30340;&#24037;&#31243;&#24314;&#27169;&#65288;&#23588;&#20854;&#26159;&#22522;&#20110;&#29289;&#29702;&#30340;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#65289;&#25552;&#20379;&#20102;&#28508;&#22312;&#30340;&#24212;&#29992;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#19982;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#36719;&#20214;&#65288;&#20855;&#20307;&#20026;EnergyPlus&#65289;&#34701;&#21512;&#30340;&#21019;&#26032;&#26041;&#27861;&#12290;&#39318;&#20808;&#36827;&#34892;&#20102;&#25991;&#29486;&#32508;&#36848;&#65292;&#25581;&#31034;&#20102;&#22312;&#24037;&#31243;&#24314;&#27169;&#20013;&#25972;&#21512;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#22686;&#38271;&#36235;&#21183;&#65292;&#20294;&#22312;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#20013;&#30340;&#24212;&#29992;&#30740;&#31350;&#20173;&#28982;&#26377;&#38480;&#12290;&#25105;&#20204;&#24378;&#35843;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#35299;&#20915;&#24314;&#31569;&#33021;&#28304;&#24314;&#27169;&#25361;&#25112;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#24182;&#27010;&#36848;&#20102;&#28508;&#22312;&#30340;&#24212;&#29992;&#65292;&#21253;&#25324;&#65306;1&#65289;&#27169;&#25311;&#36755;&#20837;&#29983;&#25104;&#65292;2&#65289;&#27169;&#25311;&#36755;&#20986;&#20998;&#26512;&#21644;&#21487;&#35270;&#21270;&#65292;3&#65289;&#36827;&#34892;&#38169;&#35823;&#20998;&#26512;&#65292;4&#65289;&#20849;&#27169;&#25311;&#65292;5&#65289;&#27169;&#25311;&#30693;&#35782;&#25552;&#21462;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09579v1 Announce Type: cross  Abstract: The rapid progression in artificial intelligence has facilitated the emergence of large language models like ChatGPT, offering potential applications extending into specialized engineering modeling, especially physics-based building energy modeling. This paper investigates the innovative integration of large language models with building energy modeling software, focusing specifically on the fusion of ChatGPT with EnergyPlus. A literature review is first conducted to reveal a growing trend of incorporating of large language models in engineering modeling, albeit limited research on their application in building energy modeling. We underscore the potential of large language models in addressing building energy modeling challenges and outline potential applications including 1) simulation input generation, 2) simulation output analysis and visualization, 3) conducting error analysis, 4) co-simulation, 5) simulation knowledge extraction a
&lt;/p&gt;</description></item></channel></rss>