<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#36890;&#36807;&#29992;&#25143;&#30740;&#31350;&#25506;&#35752;&#20102;&#26426;&#22120;&#23398;&#20064;&#35299;&#37322;&#24067;&#23616;&#26159;&#21542;&#20250;&#24433;&#21709;&#21442;&#19982;&#32773;&#23545;&#21253;&#21547;&#20167;&#24680;&#35328;&#35770;&#21477;&#23376;&#30340;&#35780;&#20215;&#65292;&#32467;&#26524;&#34920;&#26126;&#35299;&#37322;&#24067;&#23616;&#22312;&#35302;&#21457;&#21442;&#19982;&#32773;&#25552;&#20379;&#32416;&#27491;&#24615;&#21453;&#39304;&#21644;&#35780;&#20272;&#27169;&#22411;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;</title><link>https://arxiv.org/abs/2403.05581</link><description>&lt;p&gt;
&#35299;&#37322;&#24067;&#23616;&#21487;&#20197;&#24433;&#21709;&#20154;&#23545;&#20882;&#29359;&#24615;&#21477;&#23376;&#30340;&#24863;&#30693;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Can Interpretability Layouts Influence Human Perception of Offensive Sentences?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05581
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#29992;&#25143;&#30740;&#31350;&#25506;&#35752;&#20102;&#26426;&#22120;&#23398;&#20064;&#35299;&#37322;&#24067;&#23616;&#26159;&#21542;&#20250;&#24433;&#21709;&#21442;&#19982;&#32773;&#23545;&#21253;&#21547;&#20167;&#24680;&#35328;&#35770;&#21477;&#23376;&#30340;&#35780;&#20215;&#65292;&#32467;&#26524;&#34920;&#26126;&#35299;&#37322;&#24067;&#23616;&#22312;&#35302;&#21457;&#21442;&#19982;&#32773;&#25552;&#20379;&#32416;&#27491;&#24615;&#21453;&#39304;&#21644;&#35780;&#20272;&#27169;&#22411;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36827;&#34892;&#20102;&#19968;&#39033;&#29992;&#25143;&#30740;&#31350;&#65292;&#35780;&#20272;&#19977;&#31181;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#35299;&#37322;&#24067;&#23616;&#26159;&#21542;&#20250;&#24433;&#21709;&#21442;&#19982;&#32773;&#35780;&#20272;&#21253;&#21547;&#20167;&#24680;&#35328;&#35770;&#30340;&#21477;&#23376;&#26102;&#30340;&#35266;&#28857;&#65292;&#37325;&#28857;&#20851;&#27880;&#8220;&#21388;&#24694;&#22899;&#24615;&#8221;&#21644;&#8220;&#31181;&#26063;&#20027;&#20041;&#8221;&#20004;&#31867;&#12290;&#37492;&#20110;&#25991;&#29486;&#20013;&#23384;&#22312;&#20998;&#27495;&#30340;&#32467;&#35770;&#65292;&#25105;&#20204;&#36890;&#36807;&#32479;&#35745;&#21644;&#23450;&#24615;&#20998;&#26512;&#38382;&#21367;&#35843;&#26597;&#22238;&#24212;&#30340;&#23454;&#35777;&#35777;&#25454;&#65292;&#25506;&#35752;&#22312;&#22312;&#32447;&#31038;&#21306;&#20013;&#20351;&#29992;ML&#35299;&#37322;&#24615;&#30340;&#20248;&#21183;&#12290;&#24191;&#20041;&#21487;&#21152;&#27169;&#22411;&#20272;&#35745;&#21442;&#19982;&#32773;&#30340;&#35780;&#32423;&#65292;&#34701;&#21512;&#20102;&#32452;&#20869;&#35774;&#35745;&#21644;&#32452;&#38388;&#35774;&#35745;&#12290;&#23613;&#31649;&#25105;&#20204;&#30340;&#32479;&#35745;&#20998;&#26512;&#34920;&#26126;&#65292;&#27809;&#26377;&#20219;&#20309;&#35299;&#37322;&#24067;&#23616;&#26174;&#33879;&#24433;&#21709;&#21442;&#19982;&#32773;&#30340;&#35266;&#28857;&#65292;&#20294;&#25105;&#20204;&#30340;&#23450;&#24615;&#20998;&#26512;&#34920;&#26126;ML&#35299;&#37322;&#24615;&#30340;&#20248;&#21183;&#65306;1&#65289;&#35302;&#21457;&#21442;&#19982;&#32773;&#22312;&#20182;&#20204;&#30340;&#35266;&#28857;&#19982;&#27169;&#22411;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#26102;&#25552;&#20379;&#32416;&#27491;&#24615;&#21453;&#39304;&#65292;2&#65289;&#25552;&#20379;&#35780;&#20272;&#27169;&#22411;&#30340;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05581v1 Announce Type: cross  Abstract: This paper conducts a user study to assess whether three machine learning (ML) interpretability layouts can influence participants' views when evaluating sentences containing hate speech, focusing on the "Misogyny" and "Racism" classes. Given the existence of divergent conclusions in the literature, we provide empirical evidence on using ML interpretability in online communities through statistical and qualitative analyses of questionnaire responses. The Generalized Additive Model estimates participants' ratings, incorporating within-subject and between-subject designs. While our statistical analysis indicates that none of the interpretability layouts significantly influences participants' views, our qualitative analysis demonstrates the advantages of ML interpretability: 1) triggering participants to provide corrective feedback in case of discrepancies between their views and the model, and 2) providing insights to evaluate a model's 
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#29983;&#25104;&#30340;&#22270;&#20687;&#25551;&#36848;&#22312;&#19981;&#21516;&#35821;&#35328;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#35821;&#20041;&#24046;&#24322;&#65292;&#22810;&#35821;&#35328;&#25968;&#25454;&#26377;&#26356;&#39640;&#30340;&#35821;&#20041;&#35206;&#30422;&#29575;&#65292;&#24182;&#19988;&#22522;&#20110;&#22810;&#35821;&#35328;&#35757;&#32451;&#30340;&#27169;&#22411;&#34920;&#29616;&#26356;&#22909;&#12290;</title><link>http://arxiv.org/abs/2310.14356</link><description>&lt;p&gt;
&#25991;&#21270;&#21644;&#35821;&#35328;&#22810;&#26679;&#24615;&#25552;&#39640;&#20102;&#35270;&#35273;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Cultural and Linguistic Diversity Improves Visual Representations. (arXiv:2310.14356v1 [cs.CV] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14356
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#29983;&#25104;&#30340;&#22270;&#20687;&#25551;&#36848;&#22312;&#19981;&#21516;&#35821;&#35328;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#35821;&#20041;&#24046;&#24322;&#65292;&#22810;&#35821;&#35328;&#25968;&#25454;&#26377;&#26356;&#39640;&#30340;&#35821;&#20041;&#35206;&#30422;&#29575;&#65292;&#24182;&#19988;&#22522;&#20110;&#22810;&#35821;&#35328;&#35757;&#32451;&#30340;&#27169;&#22411;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#31639;&#26426;&#35270;&#35273;&#36890;&#24120;&#23558;&#24863;&#30693;&#35270;&#20026;&#23458;&#35266;&#30340;&#65292;&#24182;&#19988;&#36825;&#31181;&#20551;&#35774;&#22312;&#25968;&#25454;&#38598;&#25910;&#38598;&#21644;&#27169;&#22411;&#35757;&#32451;&#20013;&#24471;&#21040;&#21453;&#26144;&#12290;&#20363;&#22914;&#65292;&#19981;&#21516;&#35821;&#35328;&#30340;&#22270;&#20687;&#25551;&#36848;&#36890;&#24120;&#34987;&#20551;&#23450;&#20026;&#30456;&#21516;&#35821;&#20041;&#20869;&#23481;&#30340;&#32763;&#35793;&#12290;&#28982;&#32780;&#65292;&#36328;&#25991;&#21270;&#24515;&#29702;&#23398;&#21644;&#35821;&#35328;&#23398;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#20010;&#20307;&#30340;&#35270;&#35273;&#24863;&#30693;&#22240;&#20854;&#25991;&#21270;&#32972;&#26223;&#21644;&#25152;&#35828;&#30340;&#35821;&#35328;&#32780;&#24322;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#29983;&#25104;&#30340;&#26631;&#39064;&#20013;&#65292;&#19981;&#21516;&#35821;&#35328;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#35821;&#20041;&#20869;&#23481;&#24046;&#24322;&#12290;&#24403;&#25968;&#25454;&#26159;&#22810;&#35821;&#35328;&#32780;&#19981;&#26159;&#21333;&#35821;&#35328;&#26102;&#65292;&#26631;&#39064;&#30340;&#35821;&#20041;&#35206;&#30422;&#29575;&#24179;&#22343;&#26356;&#39640;&#65292;&#20197;&#22330;&#26223;&#22270;&#12289;&#23884;&#20837;&#21644;&#35821;&#35328;&#22797;&#26434;&#24615;&#36827;&#34892;&#27979;&#37327;&#12290;&#20363;&#22914;&#65292;&#19982;&#19968;&#32452;&#21333;&#35821;&#26631;&#39064;&#30456;&#27604;&#65292;&#22810;&#35821;&#26631;&#39064;&#24179;&#22343;&#26377;21.8&#65285;&#26356;&#22810;&#30340;&#23545;&#35937;&#65292;24.5&#65285;&#26356;&#22810;&#30340;&#20851;&#31995;&#65292;&#20197;&#21450;27.1&#65285;&#26356;&#22810;&#30340;&#23646;&#24615;&#12290;&#27492;&#22806;&#65292;&#20351;&#29992;&#26469;&#33258;&#19981;&#21516;&#35821;&#35328;&#30340;&#20869;&#23481;&#35757;&#32451;&#30340;&#27169;&#22411;&#34920;&#29616;&#26368;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
Computer vision often treats perception as objective, and this assumption gets reflected in the way that datasets are collected and models are trained. For instance, image descriptions in different languages are typically assumed to be translations of the same semantic content. However, work in cross-cultural psychology and linguistics has shown that individuals differ in their visual perception depending on their cultural background and the language they speak. In this paper, we demonstrate significant differences in semantic content across languages in both dataset and model-produced captions. When data is multilingual as opposed to monolingual, captions have higher semantic coverage on average, as measured by scene graph, embedding, and linguistic complexity. For example, multilingual captions have on average 21.8% more objects, 24.5% more relations, and 27.1% more attributes than a set of monolingual captions. Moreover, models trained on content from different languages perform bes
&lt;/p&gt;</description></item></channel></rss>