<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#22522;&#20110;AI&#30340;&#20132;&#20114;&#24335;&#24037;&#20855;CARE&#65292;&#29992;&#20110;&#25903;&#25345;&#21516;&#20394;&#36741;&#23548;&#21592;&#36890;&#36807;&#33258;&#21160;&#24314;&#35758;&#29983;&#25104;&#26469;&#25552;&#39640;&#20182;&#20204;&#30340;&#33021;&#21147;&#12290;&#21033;&#29992; Motivational Interviewing &#26694;&#26550;&#65292;CARE &#22312;&#23454;&#38469;&#22521;&#35757;&#38454;&#27573;&#24110;&#21161;&#36741;&#23548;&#21592;&#35786;&#26029;&#21738;&#31181;&#20855;&#20307;&#30340;&#36741;&#23548;&#31574;&#30053;&#26368;&#21512;&#36866;&#65292;&#24182;&#25552;&#20379;&#20010;&#24615;&#21270;&#30340;&#21709;&#24212;&#31034;&#20363;&#20316;&#20026;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2305.08982</link><description>&lt;p&gt;
&#24110;&#21161;&#24110;&#21161;&#32773;&#65306;&#36890;&#36807; AI &#24378;&#21270;&#23454;&#36341;&#21644;&#21453;&#39304;&#26469;&#25903;&#25345;&#21516;&#20394;&#36741;&#23548;&#21592;&#12290;
&lt;/p&gt;
&lt;p&gt;
Helping the Helper: Supporting Peer Counselors via AI-Empowered Practice and Feedback. (arXiv:2305.08982v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08982
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#22522;&#20110;AI&#30340;&#20132;&#20114;&#24335;&#24037;&#20855;CARE&#65292;&#29992;&#20110;&#25903;&#25345;&#21516;&#20394;&#36741;&#23548;&#21592;&#36890;&#36807;&#33258;&#21160;&#24314;&#35758;&#29983;&#25104;&#26469;&#25552;&#39640;&#20182;&#20204;&#30340;&#33021;&#21147;&#12290;&#21033;&#29992; Motivational Interviewing &#26694;&#26550;&#65292;CARE &#22312;&#23454;&#38469;&#22521;&#35757;&#38454;&#27573;&#24110;&#21161;&#36741;&#23548;&#21592;&#35786;&#26029;&#21738;&#31181;&#20855;&#20307;&#30340;&#36741;&#23548;&#31574;&#30053;&#26368;&#21512;&#36866;&#65292;&#24182;&#25552;&#20379;&#20010;&#24615;&#21270;&#30340;&#21709;&#24212;&#31034;&#20363;&#20316;&#20026;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#30334;&#19975;&#29992;&#25143;&#26469;&#21040;&#22312;&#32447;&#21516;&#20394;&#36741;&#23548;&#24179;&#21488;&#23547;&#27714;&#20851;&#20110;&#20174;&#20851;&#31995;&#21387;&#21147;&#21040;&#28966;&#34385;&#31561;&#22810;&#31181;&#20027;&#39064;&#30340;&#25903;&#25345;&#12290;&#28982;&#32780;&#65292;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#32447;&#21516;&#20394;&#25903;&#25345;&#32676;&#20307;&#24182;&#19981;&#24635;&#26159;&#20687;&#39044;&#26399;&#30340;&#37027;&#26679;&#26377;&#25928;&#65292;&#36825;&#20027;&#35201;&#26159;&#30001;&#20110;&#29992;&#25143;&#19982;&#26080;&#29992;&#30340;&#36741;&#23548;&#21592;&#20135;&#29983;&#20102;&#36127;&#38754;&#20307;&#39564;&#12290;&#21516;&#20394;&#36741;&#23548;&#21592;&#26159;&#22312;&#32447;&#21516;&#20394;&#36741;&#23548;&#24179;&#21488;&#25104;&#21151;&#30340;&#20851;&#38190;&#65292;&#20294;&#20182;&#20204;&#20013;&#30340;&#22823;&#22810;&#25968;&#36890;&#24120;&#27809;&#26377;&#31995;&#32479;&#22320;&#25509;&#25910;&#25351;&#23548;&#25110;&#30417;&#30563;&#30340;&#26041;&#24335;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461; CARE&#65306;&#19968;&#20010;&#20132;&#20114;&#24335;&#30340;&#22522;&#20110; AI &#30340;&#24037;&#20855;&#65292;&#36890;&#36807;&#33258;&#21160;&#24314;&#35758;&#29983;&#25104;&#22686;&#24378;&#21516;&#20394;&#36741;&#23548;&#21592;&#30340;&#33021;&#21147;&#12290;&#22312;&#23454;&#38469;&#22521;&#35757;&#38454;&#27573;&#65292;CARE &#24110;&#21161;&#35786;&#26029;&#22312;&#32473;&#23450;&#24773;&#22659;&#19979;&#21738;&#20123;&#20855;&#20307;&#30340;&#36741;&#23548;&#31574;&#30053;&#26368;&#21512;&#36866;&#65292;&#24182;&#25552;&#20379;&#37327;&#36523;&#23450;&#21046;&#30340;&#31034;&#20363;&#21709;&#24212;&#20316;&#20026;&#24314;&#35758;&#12290;&#36741;&#23548;&#21592;&#21487;&#20197;&#36873;&#25321;&#22312;&#22238;&#22797;&#27714;&#21161;&#32773;&#20043;&#21069;&#36873;&#25321;&#12289;&#20462;&#25913;&#25110;&#24573;&#30053;&#20219;&#20309;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
Millions of users come to online peer counseling platforms to seek support on diverse topics ranging from relationship stress to anxiety. However, studies show that online peer support groups are not always as effective as expected largely due to users' negative experiences with unhelpful counselors. Peer counselors are key to the success of online peer counseling platforms, but most of them often do not have systematic ways to receive guidelines or supervision. In this work, we introduce CARE: an interactive AI-based tool to empower peer counselors through automatic suggestion generation. During the practical training stage, CARE helps diagnose which specific counseling strategies are most suitable in the given context and provides tailored example responses as suggestions. Counselors can choose to select, modify, or ignore any suggestion before replying to the support seeker. Building upon the Motivational Interviewing framework, CARE utilizes large-scale counseling conversation data
&lt;/p&gt;</description></item></channel></rss>