<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>GhostWriter&#26159;&#19968;&#20010;AI&#22686;&#24378;&#30340;&#20889;&#20316;&#35774;&#35745;&#25506;&#38024;&#65292;&#36890;&#36807;&#20010;&#24615;&#21270;&#21644;&#20195;&#29702;&#22686;&#24378;&#29992;&#25143;&#30340;&#20889;&#20316;&#20307;&#39564;&#12290;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#38544;&#24335;&#23398;&#20064;&#29992;&#25143;&#30340;&#20889;&#20316;&#39118;&#26684;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#36890;&#36807;&#25163;&#21160;&#26679;&#24335;&#32534;&#36753;&#21644;&#25209;&#27880;&#26469;&#25511;&#21046;&#31995;&#32479;&#30340;&#20889;&#20316;&#39118;&#26684;&#12290;</title><link>https://arxiv.org/abs/2402.08855</link><description>&lt;p&gt;
GhostWriter:&#36890;&#36807;&#20010;&#24615;&#21270;&#21644;&#20195;&#29702;&#22686;&#24378;&#21327;&#20316;&#20154;&#24037;&#26234;&#33021;&#20889;&#20316;&#20307;&#39564;
&lt;/p&gt;
&lt;p&gt;
GhostWriter: Augmenting Collaborative Human-AI Writing Experiences Through Personalization and Agency
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08855
&lt;/p&gt;
&lt;p&gt;
GhostWriter&#26159;&#19968;&#20010;AI&#22686;&#24378;&#30340;&#20889;&#20316;&#35774;&#35745;&#25506;&#38024;&#65292;&#36890;&#36807;&#20010;&#24615;&#21270;&#21644;&#20195;&#29702;&#22686;&#24378;&#29992;&#25143;&#30340;&#20889;&#20316;&#20307;&#39564;&#12290;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#38544;&#24335;&#23398;&#20064;&#29992;&#25143;&#30340;&#20889;&#20316;&#39118;&#26684;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#36890;&#36807;&#25163;&#21160;&#26679;&#24335;&#32534;&#36753;&#21644;&#25209;&#27880;&#26469;&#25511;&#21046;&#31995;&#32479;&#30340;&#20889;&#20316;&#39118;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#25552;&#20379;&#19981;&#21516;&#24418;&#24335;&#30340;&#20889;&#20316;&#36741;&#21161;&#26041;&#38754;&#36234;&#26469;&#36234;&#27969;&#34892;&#65292;&#24182;&#19988;&#20855;&#26377;&#26080;&#22788;&#19981;&#22312;&#30340;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20010;&#24615;&#21270;&#21644;&#25511;&#21046;&#33021;&#21147;&#26377;&#38480;&#65292;LLM&#39537;&#21160;&#30340;&#20889;&#20316;&#31995;&#32479;&#21487;&#33021;&#20250;&#20351;&#29992;&#25143;&#24863;&#21040;&#27822;&#20007;&#65292;&#24403;&#29992;&#25143;&#32570;&#20047;&#25552;&#31034;&#24037;&#31243;&#32463;&#39564;&#26102;&#65292;&#36825;&#31181;&#24773;&#20917;&#21487;&#33021;&#21152;&#21095;&#12290;&#25105;&#20204;&#35748;&#20026;&#35774;&#35745;&#21487;&#20197;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#20043;&#19968;&#65292;&#24182;&#24341;&#20837;GhostWriter&#65292;&#36825;&#26159;&#19968;&#20010;AI&#22686;&#24378;&#30340;&#20889;&#20316;&#35774;&#35745;&#25506;&#38024;&#65292;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#22686;&#24378;&#30340;&#20195;&#29702;&#21644;&#20010;&#24615;&#21270;&#26469;&#36827;&#34892;&#20889;&#20316;&#12290;GhostWriter&#21033;&#29992;LLMs&#22312;&#29992;&#25143;&#32534;&#20889;&#30340;&#36807;&#31243;&#20013;&#38544;&#24335;&#23398;&#20064;&#29992;&#25143;&#25152;&#26399;&#26395;&#30340;&#20889;&#20316;&#39118;&#26684;&#65292;&#21516;&#26102;&#20801;&#35768;&#36890;&#36807;&#25163;&#21160;&#26679;&#24335;&#32534;&#36753;&#21644;&#25209;&#27880;&#36827;&#34892;&#26174;&#24335;&#25945;&#23398;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;18&#21517;&#21442;&#19982;&#32773;&#22312;&#20004;&#20010;&#19981;&#21516;&#30340;&#20889;&#20316;&#20219;&#21153;&#20013;&#20351;&#29992;GhostWriter&#65292;&#35266;&#23519;&#21040;&#23427;&#24110;&#21161;&#29992;&#25143;&#32534;&#20889;&#20010;&#24615;&#21270;&#30340;&#25991;&#26412;&#29983;&#25104;&#65292;&#24182;&#36890;&#36807;&#25552;&#20379;&#22810;&#31181;&#26041;&#24335;&#25511;&#21046;&#31995;&#32479;&#30340;&#20889;&#20316;&#39118;&#26684;&#26469;&#22686;&#24378;&#29992;&#25143;&#30340;&#33021;&#21147;&#12290;&#20174;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20123;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08855v1 Announce Type: cross Abstract: Large language models (LLMs) are becoming more prevalent and have found a ubiquitous use in providing different forms of writing assistance. However, LLM-powered writing systems can frustrate users due to their limited personalization and control, which can be exacerbated when users lack experience with prompt engineering. We see design as one way to address these challenges and introduce GhostWriter, an AI-enhanced writing design probe where users can exercise enhanced agency and personalization. GhostWriter leverages LLMs to learn the user's intended writing style implicitly as they write, while allowing explicit teaching moments through manual style edits and annotations. We study 18 participants who use GhostWriter on two different writing tasks, observing that it helps users craft personalized text generations and empowers them by providing multiple ways to control the system's writing style. From this study, we present insights re
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20013;&#38754;&#20020;&#30340;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.10448</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20197;&#21450;&#31038;&#20250;&#38519;&#38449;
&lt;/p&gt;
&lt;p&gt;
Human-AI Interactions and Societal Pitfalls. (arXiv:2309.10448v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10448
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20013;&#38754;&#20020;&#30340;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#19982;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21512;&#20316;&#26102;&#65292;&#29992;&#25143;&#21487;&#33021;&#20250;&#30475;&#21040;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#65292;&#20294;AI&#29983;&#25104;&#30340;&#20869;&#23481;&#21487;&#33021;&#19981;&#23436;&#20840;&#31526;&#21512;&#20182;&#20204;&#30340;&#20559;&#22909;&#12290;&#20026;&#20102;&#30740;&#31350;&#36825;&#31181;&#24433;&#21709;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#20854;&#20013;&#24322;&#36136;&#29992;&#25143;&#36873;&#25321;&#19982;AI&#20849;&#20139;&#22810;&#23569;&#20449;&#24687;&#65292;&#38754;&#20020;&#36755;&#20986;&#20445;&#30495;&#24230;&#21644;&#36890;&#20449;&#25104;&#26412;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20123;&#20010;&#20307;&#20915;&#31574;&#19982;AI&#35757;&#32451;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#21487;&#33021;&#23548;&#33268;&#31038;&#20250;&#25361;&#25112;&#12290;&#36755;&#20986;&#21487;&#33021;&#21464;&#24471;&#26356;&#21152;&#21516;&#36136;&#21270;&#65292;&#29305;&#21035;&#26159;&#24403;AI&#22312;AI&#29983;&#25104;&#30340;&#20869;&#23481;&#19978;&#36827;&#34892;&#35757;&#32451;&#26102;&#12290;&#32780;&#20219;&#20309;AI&#30340;&#20559;&#35265;&#21487;&#33021;&#25104;&#20026;&#31038;&#20250;&#20559;&#35265;&#12290;&#35299;&#20915;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#30340;&#21150;&#27861;&#26159;&#25913;&#36827;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#30340;&#20114;&#21160;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
When working with generative artificial intelligence (AI), users may see productivity gains, but the AI-generated content may not match their preferences exactly. To study this effect, we introduce a Bayesian framework in which heterogeneous users choose how much information to share with the AI, facing a trade-off between output fidelity and communication cost. We show that the interplay between these individual-level decisions and AI training may lead to societal challenges. Outputs may become more homogenized, especially when the AI is trained on AI-generated content. And any AI bias may become societal bias. A solution to the homogenization and bias issues is to improve human-AI interactions, enabling personalized outputs without sacrificing productivity.
&lt;/p&gt;</description></item></channel></rss>