<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#29983;&#25104;&#20449;&#24687;&#20016;&#23500;&#30340;&#23884;&#20837;&#65292;&#20197;&#25581;&#31034;&#39640;&#32500;&#25968;&#25454;&#20013;&#30340;&#32858;&#31867;&#32467;&#26500;&#12290;&#36890;&#36807;&#32447;&#24615;&#32452;&#21512;&#23545;&#27604;PCA&#21644;&#23792;&#24230;&#25237;&#24433;&#36861;&#36394;&#20004;&#20010;&#30446;&#26631;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#25490;&#38500;&#20808;&#39564;&#20449;&#24687;&#30456;&#20851;&#30340;&#32467;&#26500;&#24182;&#23454;&#29616;&#26377;&#24847;&#20041;&#30340;&#25968;&#25454;&#20998;&#31163;&#12290;</title><link>http://arxiv.org/abs/2309.14857</link><description>&lt;p&gt;
&#20351;&#29992;&#20449;&#24687;&#27969;&#24418;&#25237;&#24433;&#36827;&#34892;&#32858;&#31867;&#25506;&#32034;
&lt;/p&gt;
&lt;p&gt;
Cluster Exploration using Informative Manifold Projections. (arXiv:2309.14857v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14857
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#29983;&#25104;&#20449;&#24687;&#20016;&#23500;&#30340;&#23884;&#20837;&#65292;&#20197;&#25581;&#31034;&#39640;&#32500;&#25968;&#25454;&#20013;&#30340;&#32858;&#31867;&#32467;&#26500;&#12290;&#36890;&#36807;&#32447;&#24615;&#32452;&#21512;&#23545;&#27604;PCA&#21644;&#23792;&#24230;&#25237;&#24433;&#36861;&#36394;&#20004;&#20010;&#30446;&#26631;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#25490;&#38500;&#20808;&#39564;&#20449;&#24687;&#30456;&#20851;&#30340;&#32467;&#26500;&#24182;&#23454;&#29616;&#26377;&#24847;&#20041;&#30340;&#25968;&#25454;&#20998;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38477;&#32500;&#26159;&#21487;&#35270;&#21270;&#25506;&#32034;&#39640;&#32500;&#25968;&#25454;&#21644;&#21457;&#29616;&#20854;&#22312;&#20108;&#32500;&#25110;&#19977;&#32500;&#31354;&#38388;&#20013;&#30340;&#32858;&#31867;&#32467;&#26500;&#30340;&#20851;&#38190;&#24037;&#20855;&#20043;&#19968;&#12290;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#22823;&#37096;&#20998;&#38477;&#32500;&#26041;&#27861;&#24182;&#26410;&#32771;&#34385;&#23454;&#36341;&#32773;&#21487;&#33021;&#23545;&#25152;&#32771;&#34385;&#25968;&#25454;&#38598;&#30340;&#20219;&#20309;&#20808;&#39564;&#30693;&#35782;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#29983;&#25104;&#20449;&#24687;&#20016;&#23500;&#30340;&#23884;&#20837;&#65292;&#19981;&#20165;&#25490;&#38500;&#19982;&#20808;&#39564;&#30693;&#35782;&#30456;&#20851;&#30340;&#32467;&#26500;&#65292;&#32780;&#19988;&#26088;&#22312;&#25581;&#31034;&#20219;&#20309;&#21097;&#20313;&#30340;&#28508;&#22312;&#32467;&#26500;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#20004;&#20010;&#30446;&#26631;&#30340;&#32447;&#24615;&#32452;&#21512;&#65306;&#39318;&#20808;&#26159;&#23545;&#27604;PCA&#65292;&#33021;&#22815;&#28040;&#38500;&#19982;&#20808;&#39564;&#20449;&#24687;&#30456;&#20851;&#30340;&#32467;&#26500;&#65292;&#20854;&#27425;&#26159;&#23792;&#24230;&#25237;&#24433;&#36861;&#36394;&#65292;&#21487;&#20197;&#30830;&#20445;&#22312;&#24471;&#21040;&#30340;&#23884;&#20837;&#20013;&#26377;&#24847;&#20041;&#30340;&#25968;&#25454;&#20998;&#31163;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#20219;&#21153;&#23450;&#20041;&#20026;&#27969;&#24418;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#22312;&#32771;&#34385;&#19977;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#20808;&#39564;&#30693;&#35782;&#30340;&#21508;&#31181;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#23454;&#35777;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dimensionality reduction (DR) is one of the key tools for the visual exploration of high-dimensional data and uncovering its cluster structure in two- or three-dimensional spaces. The vast majority of DR methods in the literature do not take into account any prior knowledge a practitioner may have regarding the dataset under consideration. We propose a novel method to generate informative embeddings which not only factor out the structure associated with different kinds of prior knowledge but also aim to reveal any remaining underlying structure. To achieve this, we employ a linear combination of two objectives: firstly, contrastive PCA that discounts the structure associated with the prior information, and secondly, kurtosis projection pursuit which ensures meaningful data separation in the obtained embeddings. We formulate this task as a manifold optimization problem and validate it empirically across a variety of datasets considering three distinct types of prior knowledge. Lastly, 
&lt;/p&gt;</description></item></channel></rss>