<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#21033;&#29992;&#20915;&#31574;&#26641;&#35299;&#37322;&#22522;&#20110;&#29983;&#29289;&#26631;&#24535;&#29289;&#30340;&#35786;&#26029;&#27169;&#22411;&#65292;&#24110;&#21161;&#20020;&#24202;&#21307;&#29983;&#25552;&#39640;&#35782;&#21035;&#19981;&#20934;&#30830;&#39044;&#27979;&#30340;&#33021;&#21147;&#65292;&#20174;&#32780;&#22686;&#24378;&#21307;&#23398;&#35786;&#26029;&#27169;&#22411;&#30340;&#21487;&#38752;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.12394</link><description>&lt;p&gt;
&#21033;&#29992;&#29983;&#29289;&#26631;&#24535;&#29289;&#25552;&#39640;&#27169;&#22411;&#30340;&#35299;&#37322;&#24615;&#21644;&#21487;&#38752;&#24615;
&lt;/p&gt;
&lt;p&gt;
Improving Model's Interpretability and Reliability using Biomarkers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12394
&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#20915;&#31574;&#26641;&#35299;&#37322;&#22522;&#20110;&#29983;&#29289;&#26631;&#24535;&#29289;&#30340;&#35786;&#26029;&#27169;&#22411;&#65292;&#24110;&#21161;&#20020;&#24202;&#21307;&#29983;&#25552;&#39640;&#35782;&#21035;&#19981;&#20934;&#30830;&#39044;&#27979;&#30340;&#33021;&#21147;&#65292;&#20174;&#32780;&#22686;&#24378;&#21307;&#23398;&#35786;&#26029;&#27169;&#22411;&#30340;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#19988;&#20855;&#26377;&#35299;&#37322;&#24615;&#30340;&#35786;&#26029;&#27169;&#22411;&#22312;&#21307;&#23398;&#36825;&#20010;&#23433;&#20840;&#20851;&#38190;&#39046;&#22495;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#22522;&#20110;&#29983;&#29289;&#26631;&#24535;&#29289;&#30340;&#32954;&#37096;&#36229;&#22768;&#35786;&#26029;&#27969;&#31243;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#20197;&#22686;&#24378;&#20020;&#24202;&#21307;&#29983;&#30340;&#35786;&#26029;&#33021;&#21147;&#12290;&#26412;&#30740;&#31350;&#30340;&#30446;&#26631;&#26159;&#35780;&#20272;&#20915;&#31574;&#26641;&#20998;&#31867;&#22120;&#21033;&#29992;&#29983;&#29289;&#26631;&#24535;&#29289;&#25552;&#20379;&#30340;&#35299;&#37322;&#26159;&#21542;&#33021;&#22815;&#25913;&#21892;&#29992;&#25143;&#35782;&#21035;&#27169;&#22411;&#19981;&#20934;&#30830;&#39044;&#27979;&#33021;&#21147;&#65292;&#19982;&#20256;&#32479;&#30340;&#26174;&#33879;&#24615;&#22270;&#30456;&#27604;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#34920;&#26126;&#65292;&#22522;&#20110;&#20020;&#24202;&#24314;&#31435;&#30340;&#29983;&#29289;&#26631;&#24535;&#29289;&#30340;&#20915;&#31574;&#26641;&#35299;&#37322;&#33021;&#22815;&#24110;&#21161;&#20020;&#24202;&#21307;&#29983;&#26816;&#27979;&#21040;&#20551;&#38451;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#21307;&#23398;&#35786;&#26029;&#27169;&#22411;&#30340;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12394v1 Announce Type: cross  Abstract: Accurate and interpretable diagnostic models are crucial in the safety-critical field of medicine. We investigate the interpretability of our proposed biomarker-based lung ultrasound diagnostic pipeline to enhance clinicians' diagnostic capabilities. The objective of this study is to assess whether explanations from a decision tree classifier, utilizing biomarkers, can improve users' ability to identify inaccurate model predictions compared to conventional saliency maps. Our findings demonstrate that decision tree explanations, based on clinically established biomarkers, can assist clinicians in detecting false positives, thus improving the reliability of diagnostic models in medicine.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;ClusterNet&#65292;&#19968;&#31181;&#22522;&#20110;&#24863;&#30693;&#30340;&#20998;&#24067;&#24335;&#25968;&#25454;&#32858;&#31867;&#27169;&#22411;&#65292;&#21033;&#29992;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#21644;&#22522;&#20110;&#28857;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#21453;&#26144;&#20154;&#31867;&#24863;&#30693;&#30340;&#32858;&#31867;&#21487;&#20998;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.14185</link><description>&lt;p&gt;
ClusterNet&#65306;&#19968;&#31181;&#22522;&#20110;&#24863;&#30693;&#30340;&#20998;&#24067;&#24335;&#25968;&#25454;&#32858;&#31867;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
ClusterNet: A Perception-Based Clustering Model for Scattered Data. (arXiv:2304.14185v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14185
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;ClusterNet&#65292;&#19968;&#31181;&#22522;&#20110;&#24863;&#30693;&#30340;&#20998;&#24067;&#24335;&#25968;&#25454;&#32858;&#31867;&#27169;&#22411;&#65292;&#21033;&#29992;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#21644;&#22522;&#20110;&#28857;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#21453;&#26144;&#20154;&#31867;&#24863;&#30693;&#30340;&#32858;&#31867;&#21487;&#20998;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25955;&#28857;&#22270;&#20013;&#30340;&#32858;&#31867;&#20998;&#31163;&#26159;&#19968;&#20010;&#36890;&#24120;&#30001;&#24191;&#27867;&#20351;&#29992;&#30340;&#32858;&#31867;&#25216;&#26415;&#65288;&#20363;&#22914;k-means&#25110;DBSCAN&#65289;&#26469;&#35299;&#20915;&#30340;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#36825;&#20123;&#31639;&#27861;&#22522;&#20110;&#38750;&#24863;&#30693;&#24230;&#37327;&#65292;&#23427;&#20204;&#30340;&#36755;&#20986;&#32463;&#24120;&#19981;&#33021;&#21453;&#26144;&#20986;&#20154;&#31867;&#32858;&#31867;&#24863;&#30693;&#12290;&#20026;&#20102;&#24357;&#21512;&#20154;&#31867;&#32858;&#31867;&#24863;&#30693;&#21644;&#26426;&#22120;&#35745;&#31639;&#32858;&#31867;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#30452;&#25509;&#22788;&#29702;&#20998;&#24067;&#24335;&#25968;&#25454;&#30340;&#23398;&#20064;&#31574;&#30053;&#12290;&#20026;&#20102;&#22312;&#36825;&#20123;&#25968;&#25454;&#19978;&#23398;&#20064;&#24863;&#30693;&#32858;&#31867;&#20998;&#31163;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#20247;&#21253;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#30340;&#24037;&#20316;&#65292;&#20854;&#20013;&#21253;&#25324;384&#20010;&#20154;&#32676;&#24037;&#20316;&#32773;&#23545;&#21452;&#21464;&#37327;&#25968;&#25454;&#30340;7,320&#20010;&#28857;&#32858;&#31867;&#20174;&#23646;&#36827;&#34892;&#20102;&#26631;&#35760;&#12290;&#22522;&#20110;&#36825;&#20123;&#25968;&#25454;&#65292;&#25105;&#20204;&#33021;&#22815;&#35757;&#32451;ClusterNet&#65292;&#36825;&#26159;&#19968;&#20010;&#22522;&#20110;&#28857;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#34987;&#35757;&#32451;&#25104;&#21453;&#26144;&#20154;&#31867;&#24863;&#30693;&#30340;&#32858;&#31867;&#21487;&#20998;&#24615;&#12290;&#20026;&#20102;&#22312;&#20154;&#31867;&#27880;&#37322;&#30340;&#25968;&#25454;&#19978;&#35757;&#32451;ClusterNet&#65292;&#25105;&#20204;&#30465;&#30053;&#20102;&#22312;2D&#30011;&#24067;&#19978;&#28210;&#26579;&#25955;&#28857;&#22270;&#65292;&#32780;&#26159;&#20351;&#29992;&#20102;&#19968;&#20010;PointNet++&#26550;&#26500;&#65292;&#20351;&#20854;&#33021;&#22815;&#30452;&#25509;&#25512;&#29702;&#28857;&#20113;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#31181;&#22522;&#20110;&#24863;&#30693;&#30340;&#20998;&#24067;&#24335;&#25968;&#25454;&#32858;&#31867;&#27169;&#22411;&#65292;ClusterNet&#12290;
&lt;/p&gt;
&lt;p&gt;
Cluster separation in scatterplots is a task that is typically tackled by widely used clustering techniques, such as for instance k-means or DBSCAN. However, as these algorithms are based on non-perceptual metrics, their output often does not reflect human cluster perception. To bridge the gap between human cluster perception and machine-computed clusters, we propose a learning strategy which directly operates on scattered data. To learn perceptual cluster separation on this data, we crowdsourced a large scale dataset, consisting of 7,320 point-wise cluster affiliations for bivariate data, which has been labeled by 384 human crowd workers. Based on this data, we were able to train ClusterNet, a point-based deep learning model, trained to reflect human perception of cluster separability. In order to train ClusterNet on human annotated data, we omit rendering scatterplots on a 2D canvas, but rather use a PointNet++ architecture enabling inference on point clouds directly. In this work, w
&lt;/p&gt;</description></item></channel></rss>