<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#29436;&#20154;&#28216;&#25103;&#27169;&#25311;&#24179;&#21488;&#35780;&#20272;&#20102;&#22823;&#35821;&#35328;&#27169;&#22411;&#30340;&#35266;&#28857;&#39046;&#23548;&#20316;&#29992;&#65292;&#24182;&#24320;&#21457;&#20102;&#20004;&#20010;&#26032;&#30340;&#35780;&#20272;&#25351;&#26631;&#12290;</title><link>https://arxiv.org/abs/2404.01602</link><description>&lt;p&gt;
&#22823;&#35821;&#35328;&#27169;&#22411;&#22312;&#29436;&#20154;&#28216;&#25103;&#20013;&#30340;&#33333;&#25163;&#65311;&#35780;&#20272;&#20854;&#35266;&#28857;&#24341;&#39046;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Helmsman of the Masses? Evaluate the Opinion Leadership of Large Language Models in the Werewolf Game
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01602
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#29436;&#20154;&#28216;&#25103;&#27169;&#25311;&#24179;&#21488;&#35780;&#20272;&#20102;&#22823;&#35821;&#35328;&#27169;&#22411;&#30340;&#35266;&#28857;&#39046;&#23548;&#20316;&#29992;&#65292;&#24182;&#24320;&#21457;&#20102;&#20004;&#20010;&#26032;&#30340;&#35780;&#20272;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#31038;&#20132;&#25512;&#29702;&#28216;&#25103;&#20013;&#23637;&#29616;&#20986;&#20196;&#20154;&#38590;&#24536;&#30340;&#25112;&#30053;&#34892;&#20026;&#12290;&#28982;&#32780;&#65292;LLM&#20195;&#29702;&#25152;&#23637;&#31034;&#30340;&#35266;&#28857;&#39046;&#23548;&#21147;&#30340;&#37325;&#35201;&#24615;&#34987;&#24573;&#35270;&#20102;&#65292;&#32780;&#36825;&#23545;&#20110;&#22810;&#26234;&#33021;&#20307;&#21644;&#20154;&#24037;&#26234;&#33021;&#20132;&#20114;&#35774;&#32622;&#20013;&#30340;&#23454;&#38469;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#27492;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#29436;&#20154;&#28216;&#25103;&#20316;&#20026;&#27169;&#25311;&#24179;&#21488;&#65292;&#35780;&#20272;LLMs&#30340;&#35266;&#28857;&#24341;&#39046;&#20316;&#29992;&#12290;&#35813;&#28216;&#25103;&#20013;&#26377;&#35686;&#38271;&#35282;&#33394;&#65292;&#36127;&#36131;&#24635;&#32467;&#35770;&#25454;&#24182;&#25512;&#33616;&#20915;&#31574;&#36873;&#39033;&#65292;&#22240;&#27492;&#21487;&#20316;&#20026;&#35266;&#28857;&#39046;&#34966;&#30340;&#21487;&#20449;&#20195;&#29702;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#25972;&#21512;&#20102;&#35686;&#38271;&#35282;&#33394;&#30340;&#26694;&#26550;&#65292;&#24182;&#35774;&#35745;&#20102;&#20004;&#20010;&#22522;&#20110;&#35266;&#28857;&#39046;&#34966;&#20851;&#38190;&#29305;&#24449;&#30340;&#26032;&#25351;&#26631;&#36827;&#34892;&#35780;&#20272;&#12290;&#31532;&#19968;&#20010;&#24230;&#37327;&#26631;&#20934;&#34913;&#37327;&#35266;&#28857;&#39046;&#34966;&#30340;&#21487;&#38752;&#24615;&#65292;&#31532;&#20108;&#20010;&#35780;&#20272;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01602v1 Announce Type: cross  Abstract: Large language models (LLMs) have exhibited memorable strategic behaviors in social deductive games. However, the significance of opinion leadership exhibited by LLM-based agents has been overlooked, which is crucial for practical applications in multi-agent and human-AI interaction settings. Opinion leaders are individuals who have a noticeable impact on the beliefs and behaviors of others within a social group. In this work, we employ the Werewolf game as a simulation platform to assess the opinion leadership of LLMs. The game features the role of the Sheriff, tasked with summarizing arguments and recommending decision options, and therefore serves as a credible proxy for an opinion leader. We develop a framework integrating the Sheriff role and devise two novel metrics for evaluation based on the critical characteristics of opinion leaders. The first metric measures the reliability of the opinion leader, and the second assesses the 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;PsychoGAT&#65288;&#24515;&#29702;&#28216;&#25103;&#20195;&#29702;&#65289;&#20197;&#23454;&#29616;&#24515;&#29702;&#35780;&#20272;&#30340;&#36890;&#29992;&#28216;&#25103;&#21270;&#65292;&#36890;&#36807;&#23558;&#24378;&#22823;&#30340;LLM&#20195;&#29702;&#32435;&#20837;&#35282;&#33394;&#65292;&#23558;&#26631;&#20934;&#37327;&#34920;&#36716;&#21270;&#20026;&#20010;&#24615;&#21270;&#19988;&#20855;&#26377;&#21560;&#24341;&#21147;&#30340;&#20114;&#21160;&#23567;&#35828;&#28216;&#25103;&#12290;</title><link>https://arxiv.org/abs/2402.12326</link><description>&lt;p&gt;
&#22522;&#20110;LLM&#30340;&#24515;&#29702;&#23398;&#26234;&#33021;&#20195;&#29702;&#65306;&#19968;&#39033;&#20851;&#20110;&#28216;&#25103;&#21270;&#35780;&#20272;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
LLM Agents for Psychology: A Study on Gamified Assessments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12326
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;PsychoGAT&#65288;&#24515;&#29702;&#28216;&#25103;&#20195;&#29702;&#65289;&#20197;&#23454;&#29616;&#24515;&#29702;&#35780;&#20272;&#30340;&#36890;&#29992;&#28216;&#25103;&#21270;&#65292;&#36890;&#36807;&#23558;&#24378;&#22823;&#30340;LLM&#20195;&#29702;&#32435;&#20837;&#35282;&#33394;&#65292;&#23558;&#26631;&#20934;&#37327;&#34920;&#36716;&#21270;&#20026;&#20010;&#24615;&#21270;&#19988;&#20855;&#26377;&#21560;&#24341;&#21147;&#30340;&#20114;&#21160;&#23567;&#35828;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24515;&#29702;&#27979;&#37327;&#23545;&#20110;&#31934;&#31070;&#20581;&#24247;&#12289;&#33258;&#25105;&#29702;&#35299;&#21644;&#20010;&#20154;&#21457;&#23637;&#33267;&#20851;&#37325;&#35201;&#12290;&#20256;&#32479;&#26041;&#27861;&#65292;&#22914;&#33258;&#25105;&#25253;&#21578;&#37327;&#34920;&#21644;&#24515;&#29702;&#23398;&#23478;&#35775;&#35848;&#65292;&#24120;&#24120;&#38754;&#20020;&#21442;&#19982;&#24230;&#21644;&#21487;&#33719;&#24471;&#24615;&#26041;&#38754;&#30340;&#25361;&#25112;&#12290;&#34429;&#28982;&#24050;&#32463;&#25506;&#35752;&#20102;&#22522;&#20110;&#28216;&#25103;&#21644;LLM&#30340;&#24037;&#20855;&#26469;&#25552;&#39640;&#29992;&#25143;&#20852;&#36259;&#24182;&#33258;&#21160;&#21270;&#35780;&#20272;&#65292;&#20294;&#23427;&#20204;&#38590;&#20197;&#24179;&#34913;&#21442;&#19982;&#24230;&#21644;&#26222;&#36866;&#24615;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;PsychoGAT&#65288;&#24515;&#29702;&#28216;&#25103;&#20195;&#29702;&#65289;&#65292;&#20197;&#23454;&#29616;&#24515;&#29702;&#35780;&#20272;&#30340;&#36890;&#29992;&#28216;&#25103;&#21270;&#12290;&#20027;&#35201;&#27934;&#23519;&#26159;&#24378;&#22823;&#30340;LLM&#26082;&#21487;&#20197;&#20805;&#24403;&#29087;&#32451;&#30340;&#24515;&#29702;&#23398;&#23478;&#65292;&#20063;&#21487;&#20197;&#26159;&#21019;&#26032;&#30340;&#28216;&#25103;&#35774;&#35745;&#24072;&#12290;&#36890;&#36807;&#23558;LLM&#20195;&#29702;&#32435;&#20837;&#25351;&#23450;&#35282;&#33394;&#24182;&#31934;&#24515;&#31649;&#29702;&#23427;&#20204;&#30340;&#20114;&#21160;&#65292;PsychoGAT&#21487;&#20197;&#23558;&#20219;&#20309;&#26631;&#20934;&#37327;&#34920;&#36716;&#21270;&#20026;&#20010;&#24615;&#21270;&#19988;&#20855;&#26377;&#21560;&#24341;&#21147;&#30340;&#20114;&#21160;&#23567;&#35828;&#28216;&#25103;&#12290;&#20026;&#39564;&#35777;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#36827;&#34892;&#24515;&#29702;&#24230;&#37327;&#35780;&#20272;&#20197;&#35780;&#20272;&#20854;&#26377;&#25928;&#24615;&#65292;&#24182;&#20351;&#29992;&#20154;&#31867;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12326v1 Announce Type: new  Abstract: Psychological measurement is essential for mental health, self-understanding, and personal development. Traditional methods, such as self-report scales and psychologist interviews, often face challenges with engagement and accessibility. While game-based and LLM-based tools have been explored to improve user interest and automate assessment, they struggle to balance engagement with generalizability. In this work, we propose PsychoGAT (Psychological Game AgenTs) to achieve a generic gamification of psychological assessment. The main insight is that powerful LLMs can function both as adept psychologists and innovative game designers. By incorporating LLM agents into designated roles and carefully managing their interactions, PsychoGAT can transform any standardized scales into personalized and engaging interactive fiction games. To validate the proposed method, we conduct psychometric evaluations to assess its effectiveness and employ huma
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65292;&#20026;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#21644;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#25552;&#20379;&#25351;&#23548;&#12290;</title><link>https://arxiv.org/abs/2402.07926</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#21019;&#24314;&#32773;&#21040;&#25968;&#25454;&#37325;&#29992;&#32773;&#65306;&#36317;&#31163;&#30340;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;
From Data Creator to Data Reuser: Distance Matters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07926
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65292;&#20026;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#21644;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#25552;&#20379;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#20139;&#30740;&#31350;&#25968;&#25454;&#26159;&#22797;&#26434;&#12289;&#21171;&#21160;&#23494;&#38598;&#12289;&#26114;&#36149;&#30340;&#65292;&#38656;&#35201;&#22810;&#20010;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#22522;&#30784;&#35774;&#26045;&#25237;&#36164;&#12290;&#24320;&#25918;&#31185;&#23398;&#25919;&#31574;&#20391;&#37325;&#20110;&#25968;&#25454;&#21457;&#24067;&#32780;&#19981;&#26159;&#25968;&#25454;&#37325;&#29992;&#65292;&#28982;&#32780;&#37325;&#29992;&#20063;&#26159;&#22256;&#38590;&#12289;&#26114;&#36149;&#30340;&#65292;&#21487;&#33021;&#27704;&#36828;&#19981;&#20250;&#21457;&#29983;&#12290;&#36890;&#36807;&#32771;&#34385;&#35841;&#21487;&#33021;&#37325;&#29992;&#25968;&#25454;&#65292;&#22914;&#20309;&#37325;&#29992;&#25968;&#25454;&#65292;&#20026;&#20309;&#37325;&#29992;&#25968;&#25454;&#65292;&#20197;&#21450;&#20309;&#26102;&#37325;&#29992;&#25968;&#25454;&#31561;&#22240;&#32032;&#65292;&#21487;&#20197;&#26356;&#26126;&#26234;&#22320;&#36827;&#34892;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#12290;&#25968;&#25454;&#21019;&#36896;&#32773;&#26080;&#27861;&#39044;&#35265;&#25152;&#26377;&#21487;&#33021;&#30340;&#37325;&#29992;&#25110;&#37325;&#29992;&#32773;&#65307;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#30830;&#23450;&#21487;&#33021;&#26377;&#21161;&#20110;&#21033;&#30410;&#30456;&#20851;&#32773;&#20915;&#23450;&#22914;&#20309;&#25237;&#36164;&#30740;&#31350;&#25968;&#25454;&#65292;&#22914;&#20309;&#30830;&#23450;&#28508;&#22312;&#30340;&#37325;&#29992;&#21644;&#37325;&#29992;&#32773;&#65292;&#20197;&#21450;&#22914;&#20309;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#30340;&#22240;&#32032;&#12290;&#22522;&#20110;&#25968;&#25454;&#20849;&#20139;&#21644;&#37325;&#29992;&#30340;&#23454;&#35777;&#30740;&#31350;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65306;&#39046;&#22495;&#12289;&#26041;&#27861;&#12289;&#21512;&#20316;&#12289;&#31574;&#21010;&#12289;&#30446;&#30340;&#21644;&#26102;&#38388;&#24615;&#12290;&#36825;&#20123;&#32500;&#24230;&#20027;&#35201;&#26159;
&lt;/p&gt;
&lt;p&gt;
Sharing research data is complex, labor-intensive, expensive, and requires infrastructure investments by multiple stakeholders. Open science policies focus on data release rather than on data reuse, yet reuse is also difficult, expensive, and may never occur. Investments in data management could be made more wisely by considering who might reuse data, how, why, for what purposes, and when. Data creators cannot anticipate all possible reuses or reusers; our goal is to identify factors that may aid stakeholders in deciding how to invest in research data, how to identify potential reuses and reusers, and how to improve data exchange processes. Drawing upon empirical studies of data sharing and reuse, we develop the theoretical construct of distance between data creator and data reuser, identifying six distance dimensions that influence the ability to transfer knowledge effectively: domain, methods, collaboration, curation, purposes, and time and temporality. These dimensions are primarily
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#35774;&#35745;&#12289;&#23454;&#29616;&#21644;&#35780;&#20272;&#20102;&#19968;&#31181;&#22522;&#20110;LLM&#30340;&#20250;&#35758;&#24635;&#32467;&#31995;&#32479;&#65292;&#36890;&#36807;&#20943;&#23569;&#20010;&#20154;&#20250;&#35758;&#36127;&#25285;&#21644;&#22686;&#21152;&#20250;&#35758;&#36755;&#20986;&#30340;&#28165;&#26224;&#24230;&#21644;&#19968;&#33268;&#24615;&#65292;&#25552;&#39640;&#20102;&#20250;&#35758;&#20307;&#39564;&#12290;</title><link>http://arxiv.org/abs/2307.15793</link><description>&lt;p&gt;
&#27010;&#35201;&#12289;&#20142;&#28857;&#21644;&#34892;&#21160;&#39033;&#30446;&#65306;&#35774;&#35745;&#12289;&#23454;&#29616;&#21644;&#35780;&#20272;&#22522;&#20110;LLM&#30340;&#20250;&#35758;&#24635;&#32467;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Summaries, Highlights, and Action items: Design, implementation and evaluation of an LLM-powered meeting recap system. (arXiv:2307.15793v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15793
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#35774;&#35745;&#12289;&#23454;&#29616;&#21644;&#35780;&#20272;&#20102;&#19968;&#31181;&#22522;&#20110;LLM&#30340;&#20250;&#35758;&#24635;&#32467;&#31995;&#32479;&#65292;&#36890;&#36807;&#20943;&#23569;&#20010;&#20154;&#20250;&#35758;&#36127;&#25285;&#21644;&#22686;&#21152;&#20250;&#35758;&#36755;&#20986;&#30340;&#28165;&#26224;&#24230;&#21644;&#19968;&#33268;&#24615;&#65292;&#25552;&#39640;&#20102;&#20250;&#35758;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20250;&#35758;&#22312;&#24037;&#20316;&#21327;&#35843;&#20013;&#21457;&#25381;&#30528;&#20851;&#38190;&#30340;&#22522;&#30784;&#35774;&#26045;&#20316;&#29992;&#12290;&#36817;&#24180;&#26469;&#65292;&#30001;&#20110;&#21521;&#28151;&#21512;&#21644;&#36828;&#31243;&#24037;&#20316;&#30340;&#36716;&#21464;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#20250;&#35758;&#27491;&#22312;&#36716;&#31227;&#21040;&#22312;&#32447;&#35745;&#31639;&#26426;&#23186;&#20307;&#31354;&#38388;&#12290;&#36825;&#23548;&#33268;&#20102;&#26032;&#30340;&#38382;&#39064;&#65288;&#20363;&#22914;&#22312;&#26356;&#19981;&#21560;&#24341;&#20154;&#30340;&#20250;&#35758;&#19978;&#33457;&#36153;&#26356;&#22810;&#30340;&#26102;&#38388;&#65289;&#21644;&#26032;&#30340;&#26426;&#20250;&#65288;&#20363;&#22914;&#33258;&#21160;&#36716;&#24405;/&#23383;&#24149;&#21644;&#24635;&#32467;&#25903;&#25345;&#65289;&#12290;&#26368;&#36817;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#23545;&#35805;&#24635;&#32467;&#26041;&#38754;&#21462;&#24471;&#20102;&#36827;&#23637;&#65292;&#36890;&#36807;&#20943;&#23569;&#20010;&#20154;&#30340;&#20250;&#35758;&#36127;&#25285;&#21644;&#22686;&#21152;&#20250;&#35758;&#36755;&#20986;&#30340;&#28165;&#26224;&#24230;&#21644;&#19968;&#33268;&#24615;&#65292;&#26377;&#21487;&#33021;&#25552;&#39640;&#20250;&#35758;&#20307;&#39564;&#12290;&#23613;&#31649;&#23384;&#22312;&#36825;&#31181;&#28508;&#21147;&#65292;&#20294;&#30001;&#20110;&#38271;&#31687;&#36716;&#24405;&#21644;&#26080;&#27861;&#26681;&#25454;&#29992;&#25143;&#30340;&#19978;&#19979;&#25991;&#25429;&#25417;&#21040;&#22810;&#26679;&#30340;&#24635;&#32467;&#38656;&#27714;&#65292;&#23427;&#20204;&#38754;&#20020;&#30528;&#25216;&#26415;&#38480;&#21046;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#20123;&#24046;&#36317;&#65292;&#25105;&#20204;&#35774;&#35745;&#12289;&#23454;&#29616;&#24182;&#22312;&#19978;&#19979;&#25991;&#20013;&#35780;&#20272;&#20102;&#19968;&#31181;&#20250;&#35758;&#24635;&#32467;&#31995;&#32479;&#12290;&#25105;&#20204;&#39318;&#20808;&#26500;&#24605;&#20102;&#20004;&#20010;&#26126;&#26174;&#30340;&#24635;&#32467;&#34920;&#31034;&#26041;&#24335;&#8212;&#8212;&#37325;&#35201;&#20142;&#28857;&#21644;&#32467;&#26500;&#21270;&#30340;&#20998;&#32423;&#20250;&#35758;&#32426;&#35201;&#35270;&#22270;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#31995;&#32479;&#26469;&#23454;&#29616;&#36825;&#20123;&#34920;&#31034;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Meetings play a critical infrastructural role in the coordination of work. In recent years, due to shift to hybrid and remote work, more meetings are moving to online Computer Mediated Spaces. This has led to new problems (e.g. more time spent in less engaging meetings) and new opportunities (e.g. automated transcription/captioning and recap support). Recent advances in large language models (LLMs) for dialog summarization have the potential to improve the experience of meetings by reducing individuals' meeting load and increasing the clarity and alignment of meeting outputs. Despite this potential, they face technological limitation due to long transcripts and inability to capture diverse recap needs based on user's context. To address these gaps, we design, implement and evaluate in-context a meeting recap system. We first conceptualize two salient recap representations -- important highlights, and a structured, hierarchical minutes view. We develop a system to operationalize the rep
&lt;/p&gt;</description></item></channel></rss>