<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#24515;&#29702;&#20581;&#24247;&#39046;&#22495;&#26377;&#26395;&#25552;&#20379;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#24212;&#27880;&#24847;&#20854;&#24212;&#29992;&#21487;&#33021;&#24102;&#26469;&#30340;&#39118;&#38505;&#65292;&#24182;&#31215;&#26497;&#37319;&#21462;&#31574;&#30053;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#12290;</title><link>https://arxiv.org/abs/2403.14814</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#24515;&#29702;&#20581;&#24247;&#39046;&#22495;&#30340;&#26426;&#20250;&#21644;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
The opportunities and risks of large language models in mental health
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14814
&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#24515;&#29702;&#20581;&#24247;&#39046;&#22495;&#26377;&#26395;&#25552;&#20379;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#24212;&#27880;&#24847;&#20854;&#24212;&#29992;&#21487;&#33021;&#24102;&#26469;&#30340;&#39118;&#38505;&#65292;&#24182;&#31215;&#26497;&#37319;&#21462;&#31574;&#30053;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#24515;&#29702;&#20581;&#24247;&#38382;&#39064;&#30340;&#21457;&#29983;&#29575;&#27491;&#22312;&#19978;&#21319;&#65292;&#20154;&#20204;&#36234;&#26469;&#36234;&#24847;&#35782;&#21040;&#29616;&#26377;&#30340;&#24515;&#29702;&#20445;&#20581;&#27169;&#24335;&#26080;&#27861;&#20805;&#20998;&#25193;&#23637;&#20197;&#28385;&#36275;&#38656;&#27714;&#12290;&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#20986;&#29616;&#65292;&#20154;&#20204;&#23545;&#23427;&#20204;&#20855;&#26377;&#21019;&#36896;&#26032;&#39062;&#12289;&#22823;&#35268;&#27169;&#35299;&#20915;&#26041;&#26696;&#20197;&#25903;&#25345;&#24515;&#29702;&#20581;&#24247;&#30340;&#25215;&#35834;&#24863;&#21040;&#20048;&#35266;&#12290;&#23613;&#31649;&#23427;&#20204;&#36824;&#22788;&#20110;&#21021;&#26399;&#38454;&#27573;&#65292;LLMs&#24050;&#34987;&#24212;&#29992;&#20110;&#19982;&#24515;&#29702;&#20581;&#24247;&#30456;&#20851;&#30340;&#20219;&#21153;&#12290;&#26412;&#32508;&#36848;&#24635;&#32467;&#20102;&#24050;&#26377;&#25991;&#29486;&#20013;&#20851;&#20110;&#21033;&#29992;LLMs&#25552;&#20379;&#24515;&#29702;&#20581;&#24247;&#25945;&#32946;&#12289;&#35780;&#20272;&#21644;&#24178;&#39044;&#30340;&#21162;&#21147;&#65292;&#24182;&#31361;&#20986;&#20102;&#27599;&#20010;&#39046;&#22495;&#20013;&#20135;&#29983;&#31215;&#26497;&#24433;&#21709;&#30340;&#20851;&#38190;&#26426;&#20250;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#23558;LLMs&#24212;&#29992;&#20110;&#24515;&#29702;&#20581;&#24247;&#39046;&#22495;&#25152;&#20276;&#38543;&#30340;&#39118;&#38505;&#65292;&#24182;&#40723;&#21169;&#37319;&#29992;&#31574;&#30053;&#26469;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#12290;&#23545;&#20110;&#24515;&#29702;&#20581;&#24247;&#25903;&#25345;&#30340;&#36843;&#20999;&#38656;&#27714;&#24517;&#39035;&#19982;&#36127;&#36131;&#20219;&#30340;&#24515;&#29702;&#20581;&#24247;LLMs&#30340;&#24320;&#21457;&#12289;&#27979;&#35797;&#21644;&#37096;&#32626;&#30456;&#24179;&#34913;&#12290;&#29305;&#21035;&#20851;&#38190;&#30340;&#26159;&#30830;&#20445;&#24515;&#29702;&#20581;&#24247;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14814v1 Announce Type: cross  Abstract: Global rates of mental health concerns are rising and there is increasing realization that existing models of mental healthcare will not adequately expand to meet the demand. With the emergence of large language models (LLMs) has come great optimism regarding their promise to create novel, large-scale solutions to support mental health. Despite their nascence, LLMs have already been applied to mental health-related tasks. In this review, we summarize the extant literature on efforts to use LLMs to provide mental health education, assessment, and intervention and highlight key opportunities for positive impact in each area. We then highlight risks associated with LLMs application to mental health and encourage adoption of strategies to mitigate these risks. The urgent need for mental health support must be balanced with responsible development, testing, and deployment of mental health LLMs. Especially critical is ensuring that mental he
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;(&#20154;&#31867;+AI)&#26041;&#27861;HyEnA&#65292;&#29992;&#20110;&#20174;&#24847;&#35265;&#25991;&#26412;&#20013;&#25552;&#21462;&#35770;&#28857;&#65292;&#32467;&#21512;&#20102;&#33258;&#21160;&#21270;&#22788;&#29702;&#36895;&#24230;&#21644;&#20154;&#31867;&#29702;&#35299;&#25512;&#29702;&#33021;&#21147;&#65292;&#22312;&#20844;&#27665;&#21453;&#39304;&#35821;&#26009;&#24211;&#19978;&#21462;&#24471;&#20102;&#26356;&#39640;&#30340;&#35206;&#30422;&#29575;&#21644;&#20934;&#30830;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.09713</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#35770;&#35777;&#25366;&#25496;&#30340;&#28151;&#21512;&#26234;&#33021;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Hybrid Intelligence Method for Argument Mining
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09713
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;(&#20154;&#31867;+AI)&#26041;&#27861;HyEnA&#65292;&#29992;&#20110;&#20174;&#24847;&#35265;&#25991;&#26412;&#20013;&#25552;&#21462;&#35770;&#28857;&#65292;&#32467;&#21512;&#20102;&#33258;&#21160;&#21270;&#22788;&#29702;&#36895;&#24230;&#21644;&#20154;&#31867;&#29702;&#35299;&#25512;&#29702;&#33021;&#21147;&#65292;&#22312;&#20844;&#27665;&#21453;&#39304;&#35821;&#26009;&#24211;&#19978;&#21462;&#24471;&#20102;&#26356;&#39640;&#30340;&#35206;&#30422;&#29575;&#21644;&#20934;&#30830;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#35843;&#26597;&#24037;&#20855;&#33021;&#22815;&#25910;&#38598;&#20844;&#27665;&#21453;&#39304;&#24847;&#35265;&#35821;&#26009;&#24211;&#12290;&#20174;&#24222;&#22823;&#19988;&#22024;&#26434;&#30340;&#24847;&#35265;&#38598;&#20013;&#25552;&#21462;&#20851;&#38190;&#35770;&#28857;&#26377;&#21161;&#20110;&#24555;&#36895;&#20934;&#30830;&#22320;&#29702;&#35299;&#24847;&#35265;&#12290;&#23436;&#20840;&#33258;&#21160;&#21270;&#30340;&#26041;&#27861;&#21487;&#20197;&#25552;&#21462;&#35770;&#28857;&#65292;&#20294;(1)&#38656;&#35201;&#22823;&#35268;&#27169;&#26631;&#35760;&#25968;&#25454;&#38598;&#65292;&#23548;&#33268;&#36739;&#39640;&#30340;&#27880;&#37322;&#25104;&#26412;; (2)&#23545;&#24050;&#30693;&#35266;&#28857;&#25928;&#26524;&#33391;&#22909;&#65292;&#20294;&#23545;&#26032;&#39062;&#35266;&#28857;&#25928;&#26524;&#27424;&#20339;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;HyEnA&#65292;&#19968;&#31181;&#28151;&#21512;(&#20154;&#31867;+AI)&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#20027;&#35266;&#25991;&#26412;&#20013;&#25552;&#21462;&#35770;&#28857;&#65292;&#32467;&#21512;&#20102;&#33258;&#21160;&#21270;&#22788;&#29702;&#30340;&#36895;&#24230;&#21644;&#20154;&#31867;&#30340;&#29702;&#35299;&#21644;&#25512;&#29702;&#33021;&#21147;&#12290;&#25105;&#20204;&#22312;&#19977;&#20010;&#20844;&#27665;&#21453;&#39304;&#35821;&#26009;&#24211;&#19978;&#35780;&#20272;&#20102;HyEnA&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#19968;&#26041;&#38754;&#65292;&#19982;&#19968;&#32452;&#21508;&#31181;&#24847;&#35265;&#36827;&#34892;&#27604;&#36739;&#26102;&#65292;HyEnA&#22312;&#39640;&#35206;&#30422;&#29575;&#21644;&#20934;&#30830;&#29575;&#26041;&#38754;&#20248;&#20110;&#26368;&#20808;&#36827;&#30340;&#33258;&#21160;&#21270;&#26041;&#27861;&#65292;&#35777;&#23454;&#20102;&#20154;&#31867;&#27934;&#23519;&#30340;&#24517;&#35201;&#24615;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;HyEnA&#38656;&#35201;&#36739;&#23569;&#30340;&#20154;&#21147;&#24037;&#20316;&#37327;&#65292;&#19988;&#19981;&#20250;&#29306;&#29298;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09713v1 Announce Type: new  Abstract: Large-scale survey tools enable the collection of citizen feedback in opinion corpora. Extracting the key arguments from a large and noisy set of opinions helps in understanding the opinions quickly and accurately. Fully automated methods can extract arguments but (1) require large labeled datasets that induce large annotation costs and (2) work well for known viewpoints, but not for novel points of view. We propose HyEnA, a hybrid (human + AI) method for extracting arguments from opinionated texts, combining the speed of automated processing with the understanding and reasoning capabilities of humans. We evaluate HyEnA on three citizen feedback corpora. We find that, on the one hand, HyEnA achieves higher coverage and precision than a state-of-the-art automated method when compared to a common set of diverse opinions, justifying the need for human insight. On the other hand, HyEnA requires less human effort and does not compromise quali
&lt;/p&gt;</description></item><item><title>&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#26159;&#21542;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26159;&#23548;&#33268;&#31639;&#27861;&#21388;&#24694;&#29616;&#35937;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;</title><link>https://arxiv.org/abs/2402.15418</link><description>&lt;p&gt;
&#22768;&#35465;&#31639;&#27861;&#21388;&#24694;
&lt;/p&gt;
&lt;p&gt;
Reputational Algorithm Aversion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15418
&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#26159;&#21542;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26159;&#23548;&#33268;&#31639;&#27861;&#21388;&#24694;&#29616;&#35937;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#20204;&#24120;&#24120;&#19981;&#24895;&#23558;&#31639;&#27861;&#20135;&#29983;&#30340;&#20449;&#24687;&#32435;&#20837;&#33258;&#24049;&#30340;&#20915;&#31574;&#20013;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#31639;&#27861;&#21388;&#24694;&#26159;&#22914;&#20309;&#20135;&#29983;&#30340;&#65292;&#24403;&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26102;&#12290;&#25105;&#24314;&#31435;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#24037;&#20316;&#32773;&#26681;&#25454;&#33258;&#24049;&#30340;&#31169;&#20154;&#20449;&#24687;&#21644;&#31639;&#27861;&#30340;&#20449;&#21495;&#23545;&#38543;&#26426;&#32467;&#26524;&#36827;&#34892;&#39044;&#27979;&#12290;&#20302;&#25216;&#33021;&#24037;&#20316;&#32773;&#25509;&#25910;&#21040;&#27604;&#31639;&#27861;&#26356;&#24046;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#24212;&#22987;&#32456;&#36981;&#24490;&#31639;&#27861;&#30340;&#20449;&#21495;&#65292;&#32780;&#39640;&#25216;&#33021;&#24037;&#20316;&#32773;&#25509;&#25910;&#21040;&#27604;&#31639;&#27861;&#26356;&#22909;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#26377;&#26102;&#24212;&#35813;&#35206;&#30422;&#31639;&#27861;&#30340;&#20915;&#31574;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22768;&#35465;&#19978;&#30340;&#32771;&#34385;&#65292;&#20302;&#25216;&#33021;&#24037;&#20316;&#32773;&#20250;&#19981;&#21512;&#29702;&#22320;&#35206;&#30422;&#31639;&#27861;&#65292;&#20197;&#22686;&#21152;&#34987;&#35270;&#20026;&#39640;&#25216;&#33021;&#30340;&#21487;&#33021;&#24615;&#12290;&#35813;&#27169;&#22411;&#20026;&#19982;AI&#31995;&#32479;&#21487;&#33021;&#20250;&#21462;&#20195;&#35768;&#22810;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#30340;&#24191;&#27867;&#20851;&#27880;&#25552;&#20379;&#20102;&#23436;&#20840;&#29702;&#24615;&#30340;&#24494;&#35266;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15418v1 Announce Type: cross  Abstract: People are often reluctant to incorporate information produced by algorithms into their decisions, a phenomenon called "algorithm aversion". This paper shows how algorithm aversion arises when the choice to follow an algorithm conveys information about a human's ability. I develop a model in which workers make forecasts of a random outcome based on their own private information and an algorithm's signal. Low-skill workers receive worse information than the algorithm and hence should always follow the algorithm's signal, while high-skill workers receive better information than the algorithm and should sometimes override it. However, due to reputational concerns, low-skill workers inefficiently override the algorithm to increase the likelihood they are perceived as high-skill. The model provides a fully rational microfoundation for algorithm aversion that aligns with the broad concern that AI systems will displace many types of workers.
&lt;/p&gt;</description></item><item><title>DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#23545;&#27431;&#30431;&#20843;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#21069;100&#22825;&#25552;&#20132;&#30340;&#23457;&#26680;&#34892;&#21160;&#25968;&#25454;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#36825;&#20123;&#24179;&#21488;&#22312;&#23457;&#26680;&#34892;&#21160;&#26041;&#38754;&#30340;&#37096;&#20998;&#36981;&#24490;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2312.10269</link><description>&lt;p&gt;
DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#65306;&#31038;&#20132;&#23186;&#20307;&#33258;&#25105;&#25253;&#21578;&#30340;&#23457;&#26680;&#34892;&#21160;
&lt;/p&gt;
&lt;p&gt;
The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media. (arXiv:2312.10269v2 [cs.SI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.10269
&lt;/p&gt;
&lt;p&gt;
DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#23545;&#27431;&#30431;&#20843;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#21069;100&#22825;&#25552;&#20132;&#30340;&#23457;&#26680;&#34892;&#21160;&#25968;&#25454;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#36825;&#20123;&#24179;&#21488;&#22312;&#23457;&#26680;&#34892;&#21160;&#26041;&#38754;&#30340;&#37096;&#20998;&#36981;&#24490;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;2023&#24180;9&#26376;&#24320;&#22987;&#65292;&#25968;&#23383;&#26381;&#21153;&#27861;&#26696;(DSA)&#35201;&#27714;&#22823;&#22411;&#22312;&#32447;&#24179;&#21488;&#21521;DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#25552;&#20132;&#20851;&#20110;&#20182;&#20204;&#22312;&#27431;&#30431;&#20869;&#37319;&#21462;&#30340;&#27599;&#20010;&#23457;&#26680;&#34892;&#21160;&#30340;&#35814;&#32454;&#25968;&#25454;&#12290;&#20174;&#19968;&#24320;&#22987;&#65292;&#36825;&#20010;&#38598;&#20013;&#24335;&#25968;&#25454;&#24211;&#23601;&#24341;&#36215;&#20102;&#23398;&#26415;&#30028;&#30340;&#20852;&#36259;&#65292;&#22240;&#20026;&#23427;&#26159;&#29616;&#23454;&#19990;&#30028;&#22312;&#32447;&#23457;&#26680;&#25968;&#25454;&#30340;&#19968;&#20010;&#21069;&#25152;&#26410;&#26377;&#30340;&#12289;&#21487;&#33021;&#26159;&#29420;&#29305;&#30340;&#23453;&#24211;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#28145;&#20837;&#20998;&#26512;&#20102;&#27431;&#30431;&#20843;&#20010;&#26368;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#25968;&#25454;&#24211;&#30340;&#21069;100&#22825;&#25552;&#20132;&#30340;&#25152;&#26377;3.53&#20159;&#26465;&#35760;&#24405;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23545;&#24179;&#21488;&#20043;&#38388;&#36827;&#34892;&#20102;&#27604;&#36739;&#30740;&#31350;&#65292;&#21253;&#25324;&#65306;&#23457;&#26680;&#34892;&#21160;&#30340;&#25968;&#37327;&#12289;&#20915;&#31574;&#20381;&#25454;&#12289;&#24212;&#29992;&#30340;&#38480;&#21046;&#31867;&#22411;&#12289;&#23457;&#26680;&#20869;&#23481;&#31867;&#22411;&#12289;&#23457;&#26680;&#34892;&#21160;&#30340;&#21450;&#26102;&#24615;&#21644;&#25552;&#20132;&#24773;&#20917;&#65292;&#20197;&#21450;&#20351;&#29992;&#30340;&#33258;&#21160;&#21270;&#31243;&#24230;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#31995;&#32479;&#22320;&#19982;&#24179;&#21488;&#33258;&#24049;&#30340;&#36879;&#26126;&#25253;&#21578;&#36827;&#34892;&#20102;&#20869;&#23481;&#20132;&#21449;&#26816;&#26597;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20197;&#19979;&#32467;&#26524;&#12290;(i)&#24179;&#21488;&#21482;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#36981;&#24490;&#20102;&#23457;&#26680;&#34892;&#21160;&#30340;&#21746;&#23398;&#21644;&#26041;&#27861;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since September 2023, the Digital Services Act (DSA) obliges large online platforms to submit detailed data on each moderation action they take within the European Union (EU) to the DSA Transparency Database. From its inception, this centralized database has sparked scholarly interest as an unprecedented and potentially unique trove of data on real-world online moderation. Here, we thoroughly analyze all 353.12M records submitted by the eight largest social media platforms in the EU during the first 100 days of the database. Specifically, we conduct a platform-wise comparative study of their: volume of moderation actions, grounds for decision, types of applied restrictions, types of moderated content, timeliness in undertaking and submitting moderation actions, and use of automation. Furthermore, we systematically cross-check the contents of the database with the platforms' own transparency reports. Our analyses reveal that (i) the platforms adhered only in part to the philosophy and s
&lt;/p&gt;</description></item></channel></rss>