<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>Hands-Free VR &#26159;&#19968;&#31181;&#26080;&#38656;&#25163;&#37096;&#25805;&#20316;&#30340;&#34394;&#25311;&#29616;&#23454;&#31995;&#32479;&#65292;&#36890;&#36807;&#35821;&#38899;&#21629;&#20196;&#23454;&#29616;&#65292;&#20855;&#26377;&#33521;&#35821;&#21475;&#38899;&#40065;&#26834;&#24615;&#65292;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#23545;&#25991;&#26412;&#30340;&#36716;&#25442;&#21644;&#25191;&#34892;&#12290;</title><link>https://arxiv.org/abs/2402.15083</link><description>&lt;p&gt;
&#26080;&#38656;&#25163;&#37096;&#25805;&#20316;&#30340;&#34394;&#25311;&#29616;&#23454;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Hands-Free VR
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15083
&lt;/p&gt;
&lt;p&gt;
Hands-Free VR &#26159;&#19968;&#31181;&#26080;&#38656;&#25163;&#37096;&#25805;&#20316;&#30340;&#34394;&#25311;&#29616;&#23454;&#31995;&#32479;&#65292;&#36890;&#36807;&#35821;&#38899;&#21629;&#20196;&#23454;&#29616;&#65292;&#20855;&#26377;&#33521;&#35821;&#21475;&#38899;&#40065;&#26834;&#24615;&#65292;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#23545;&#25991;&#26412;&#30340;&#36716;&#25442;&#21644;&#25191;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Hands-Free VR&#30340;&#22522;&#20110;&#35821;&#38899;&#30340;&#33258;&#28982;&#35821;&#35328;&#34394;&#25311;&#29616;&#23454;&#30028;&#38754;&#12290;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#35821;&#38899;&#21457;&#20986;&#21629;&#20196;&#65292;&#20854;&#35821;&#38899;&#38899;&#39057;&#25968;&#25454;&#32463;&#36807;&#19968;&#20010;&#38024;&#23545;&#21333;&#35789;&#38899;&#32032;&#30456;&#20284;&#24615;&#21644;&#33521;&#35821;&#21475;&#38899;&#30340;&#40065;&#26834;&#24615;&#36827;&#34892;&#24494;&#35843;&#30340;&#35821;&#38899;&#35782;&#21035;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#36716;&#25442;&#20026;&#25991;&#26412;&#65292;&#28982;&#21518;&#21033;&#29992;&#19968;&#20010;&#23545;&#33258;&#28982;&#35821;&#35328;&#22810;&#26679;&#24615;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23558;&#25991;&#26412;&#26144;&#23556;&#20026;&#21487;&#25191;&#34892;&#30340;&#34394;&#25311;&#29616;&#23454;&#21629;&#20196;&#12290;Hands-Free VR&#22312;&#19968;&#20010;&#21463;&#25511;&#30340;&#34987;&#35797;&#30740;&#31350;&#20013;&#65288;N = 22&#65289;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#35201;&#27714;&#21442;&#19982;&#32773;&#25214;&#21040;&#29305;&#23450;&#29289;&#20307;&#24182;&#20197;&#21508;&#31181;&#37197;&#32622;&#25918;&#32622;&#23427;&#20204;&#12290;&#22312;&#23545;&#29031;&#26465;&#20214;&#19979;&#65292;&#21442;&#19982;&#32773;&#20351;&#29992;&#20256;&#32479;&#30340;&#34394;&#25311;&#29616;&#23454;&#29992;&#25143;&#30028;&#38754;&#36890;&#36807;&#25163;&#25345;&#25511;&#21046;&#22120;&#25235;&#21462;&#12289;&#25644;&#36816;&#21644;&#23450;&#20301;&#29289;&#20307;&#12290;&#22312;&#23454;&#39564;&#26465;&#20214;&#19979;&#65292;&#21442;&#19982;&#32773;&#20351;&#29992;Hands-Free VR&#12290;&#32467;&#26524;&#34920;&#26126;&#65306;&#65288;1&#65289;Hands-Free VR&#23545;&#33521;&#35821;&#21475;&#38899;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#22240;&#20026;&#22312;&#25105;&#20204;&#30340;20&#21517;&#21442;&#19982;&#32773;&#20013;&#65292;&#33521;&#35821;&#19981;&#26159;&#20182;&#20204;&#30340;&#39318;&#36873;&#35821;&#35328;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15083v1 Announce Type: cross  Abstract: The paper introduces Hands-Free VR, a voice-based natural-language interface for VR. The user gives a command using their voice, the speech audio data is converted to text using a speech-to-text deep learning model that is fine-tuned for robustness to word phonetic similarity and to spoken English accents, and the text is mapped to an executable VR command using a large language model that is robust to natural language diversity. Hands-Free VR was evaluated in a controlled within-subjects study (N = 22) that asked participants to find specific objects and to place them in various configurations. In the control condition participants used a conventional VR user interface to grab, carry, and position the objects using the handheld controllers. In the experimental condition participants used Hands-Free VR. The results confirm that: (1) Hands-Free VR is robust to spoken English accents, as for 20 of our participants English was not their f
&lt;/p&gt;</description></item></channel></rss>