<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#38754;&#37096;&#27880;&#37322;&#26631;&#27880;&#32773;&#30340;&#21051;&#26495;&#21360;&#35937;&#21644;&#20010;&#20154;&#29305;&#24449;&#20250;&#24433;&#21709;&#20854;&#25968;&#25454;&#26631;&#27880;&#30340;&#20844;&#27491;&#24615;&#65292;&#24378;&#35843;&#38656;&#35201;&#23545;&#25972;&#20010;&#20154;&#24037;&#26234;&#33021;&#22521;&#35757;&#36807;&#31243;&#20445;&#25345;&#39640;&#24230;&#36879;&#26126;&#20197;&#23613;&#26089;&#35782;&#21035;&#21644;&#32416;&#27491;&#20559;&#35265;&#12290;</title><link>http://arxiv.org/abs/2301.09902</link><description>&lt;p&gt;
&#25506;&#31350;&#38754;&#37096;&#27880;&#37322;&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#26631;&#27880;&#32773;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
Investigating Labeler Bias in Face Annotation for Machine Learning. (arXiv:2301.09902v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09902
&lt;/p&gt;
&lt;p&gt;
&#38754;&#37096;&#27880;&#37322;&#26631;&#27880;&#32773;&#30340;&#21051;&#26495;&#21360;&#35937;&#21644;&#20010;&#20154;&#29305;&#24449;&#20250;&#24433;&#21709;&#20854;&#25968;&#25454;&#26631;&#27880;&#30340;&#20844;&#27491;&#24615;&#65292;&#24378;&#35843;&#38656;&#35201;&#23545;&#25972;&#20010;&#20154;&#24037;&#26234;&#33021;&#22521;&#35757;&#36807;&#31243;&#20445;&#25345;&#39640;&#24230;&#36879;&#26126;&#20197;&#23613;&#26089;&#35782;&#21035;&#21644;&#32416;&#27491;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#20010;&#36234;&#26469;&#36234;&#20381;&#36182;&#20154;&#24037;&#26234;&#33021;&#30340;&#19990;&#30028;&#20013;&#65292;&#32771;&#34385;&#20154;&#24037;&#26234;&#33021;&#23545;&#20154;&#31867;&#30340;&#20262;&#29702;&#24433;&#21709;&#21464;&#24471;&#27604;&#20197;&#24448;&#20219;&#20309;&#26102;&#20505;&#37117;&#26356;&#21152;&#37325;&#35201;&#12290;&#19968;&#20010;&#23578;&#26410;&#20805;&#20998;&#25506;&#35752;&#30340;&#20851;&#38190;&#25361;&#25112;&#26159;&#26631;&#27880;&#32773;&#20559;&#35265;&#65292;&#36825;&#21487;&#33021;&#20250;&#20026;&#35757;&#32451;&#21019;&#24314;&#26412;&#36136;&#19978;&#24102;&#26377;&#20559;&#35265;&#30340;&#25968;&#25454;&#38598;&#65292;&#24182;&#38543;&#21518;&#23548;&#33268;&#22312;&#21307;&#30103;&#20445;&#20581;&#12289;&#23601;&#19994;&#12289;&#25945;&#32946;&#21644;&#25191;&#27861;&#31561;&#39046;&#22495;&#20013;&#20986;&#29616;&#19981;&#20934;&#30830;&#25110;&#19981;&#20844;&#24179;&#30340;&#20915;&#31574;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#30740;&#31350;&#65292;&#20351;&#29992;&#26469;&#33258;&#19981;&#21516;&#31181;&#26063;&#21644;&#24615;&#21035;&#30340;&#20154;&#30340;&#22270;&#20687;&#36827;&#34892;&#26631;&#35760;&#20219;&#21153;&#65292;&#20197;&#35843;&#26597;&#21644;&#34913;&#37327;&#26631;&#27880;&#32773;&#20559;&#35265;&#30340;&#23384;&#22312;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#21442;&#19982;&#32773;&#25317;&#26377;&#24433;&#21709;&#20854;&#20915;&#31574;&#36807;&#31243;&#30340;&#21051;&#26495;&#21360;&#35937;&#65292;&#24182;&#19988;&#26631;&#27880;&#32773;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#23545;&#25152;&#20998;&#37197;&#30340;&#27880;&#37322;&#26631;&#31614;&#20135;&#29983;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#26631;&#27880;&#32773;&#20559;&#35265;&#22914;&#20309;&#24433;&#21709;&#25968;&#25454;&#38598;&#65292;&#38543;&#21518;&#24433;&#21709;&#25152;&#35757;&#32451;&#30340;&#27169;&#22411;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#22312;&#25972;&#20010;&#20154;&#24037;&#26234;&#33021;&#22521;&#35757;&#36807;&#31243;&#20013;&#24517;&#39035;&#20445;&#25345;&#39640;&#24230;&#36879;&#26126;&#65292;&#23613;&#26089;&#35782;&#21035;&#21644;&#32416;&#27491;&#25968;&#25454;&#20013;&#30340;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a world increasingly reliant on artificial intelligence, it is more important than ever to consider the ethical implications of artificial intelligence on humanity. One key under-explored challenge is labeler bias, which can create inherently biased datasets for training and subsequently lead to inaccurate or unfair decisions in healthcare, employment, education, and law enforcement. Hence, we conducted a study to investigate and measure the existence of labeler bias using images of people from different ethnicities and sexes in a labeling task. Our results show that participants possess stereotypes that influence their decision-making process and that labeler demographics impact assigned labels. We also discuss how labeler bias influences datasets and, subsequently, the models trained on them. Overall, a high degree of transparency must be maintained throughout the entire artificial intelligence training process to identify and correct biases in the data as early as possible.
&lt;/p&gt;</description></item></channel></rss>