<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#25552;&#20986;&#20102;&#20154;&#24037;&#26234;&#33021;&#21644;&#20154;&#31867;&#30340;&#36777;&#35770;&#26694;&#26550;&#65292;&#36890;&#36807;LLM&#22686;&#24378;&#30340;&#36777;&#35770;&#20154;&#24037;&#26234;&#33021;&#20419;&#36827;&#20154;&#31867;&#21453;&#24605;&#21644;&#35752;&#35770;&#20915;&#31574;&#20013;&#30340;&#24847;&#35265;&#20998;&#27495;&#12290;</title><link>https://arxiv.org/abs/2403.16812</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#21644;&#20154;&#31867;&#30340;&#36777;&#35770;&#65306;LLM&#22686;&#24378;&#30340;&#36777;&#35770;&#20154;&#24037;&#26234;&#33021;&#35774;&#35745;&#19982;&#35780;&#20272;&#65292;&#29992;&#20110;&#20154;&#24037;&#26234;&#33021;&#36741;&#21161;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Towards Human-AI Deliberation: Design and Evaluation of LLM-Empowered Deliberative AI for AI-Assisted Decision-Making
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16812
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#20154;&#24037;&#26234;&#33021;&#21644;&#20154;&#31867;&#30340;&#36777;&#35770;&#26694;&#26550;&#65292;&#36890;&#36807;LLM&#22686;&#24378;&#30340;&#36777;&#35770;&#20154;&#24037;&#26234;&#33021;&#20419;&#36827;&#20154;&#31867;&#21453;&#24605;&#21644;&#35752;&#35770;&#20915;&#31574;&#20013;&#30340;&#24847;&#35265;&#20998;&#27495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20154;&#24037;&#26234;&#33021;&#36741;&#21161;&#20915;&#31574;&#20013;&#65292;&#20154;&#31867;&#36890;&#24120;&#34987;&#21160;&#22320;&#23457;&#26597;&#20154;&#24037;&#26234;&#33021;&#30340;&#24314;&#35758;&#65292;&#28982;&#21518;&#20915;&#23450;&#26159;&#21542;&#20840;&#30424;&#25509;&#21463;&#25110;&#25298;&#32477;&#12290;&#22312;&#36825;&#26679;&#30340;&#33539;&#24335;&#20013;&#65292;&#21457;&#29616;&#20154;&#31867;&#24456;&#23569;&#28608;&#21457;&#20998;&#26512;&#24605;&#32500;&#65292;&#19988;&#22312;&#21457;&#29983;&#20998;&#27495;&#26102;&#38590;&#20197;&#23558;&#30683;&#30462;&#24847;&#35265;&#30340;&#32454;&#24494;&#24046;&#21035;&#20256;&#36798;&#32473;&#20154;&#24037;&#26234;&#33021;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20154;&#24037;&#26234;&#33021;&#21644;&#20154;&#31867;&#30340;&#36777;&#35770;&#65292;&#36825;&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#26088;&#22312;&#20419;&#36827;&#20154;&#31867;&#22312;&#20915;&#31574;&#36807;&#31243;&#20013;&#23545;&#20154;&#24037;&#26234;&#33021;&#24847;&#35265;&#20998;&#27495;&#36827;&#34892;&#21453;&#24605;&#21644;&#35752;&#35770;&#12290;&#22522;&#20110;&#20154;&#31867;&#36777;&#35770;&#29702;&#35770;&#65292;&#35813;&#26694;&#26550;&#36890;&#36807;&#32500;&#24230;&#32423;&#24847;&#35265;&#24449;&#38598;&#12289;&#36777;&#35770;&#35752;&#35770;&#21644;&#20915;&#31574;&#26356;&#26032;&#65292;&#23558;&#20154;&#31867;&#21644;&#20154;&#24037;&#26234;&#33021;&#36827;&#34892;&#20114;&#21160;&#12290;&#20026;&#20102;&#36171;&#20104;&#20154;&#24037;&#26234;&#33021;&#36777;&#35770;&#33021;&#21147;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#36777;&#35770;&#20154;&#24037;&#26234;&#33021;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#20316;&#20026;&#20154;&#31867;&#21644;&#39046;&#22495;&#29305;&#23450;&#27169;&#22411;&#20043;&#38388;&#30340;&#26725;&#26753;&#65292;&#23454;&#29616;&#28789;&#27963;&#30340;&#23545;&#35805;&#20132;&#20114;&#21644;&#24544;&#23454;&#30340;&#20449;&#24687;&#25552;&#20379;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16812v1 Announce Type: cross  Abstract: In AI-assisted decision-making, humans often passively review AI's suggestion and decide whether to accept or reject it as a whole. In such a paradigm, humans are found to rarely trigger analytical thinking and face difficulties in communicating the nuances of conflicting opinions to the AI when disagreements occur. To tackle this challenge, we propose Human-AI Deliberation, a novel framework to promote human reflection and discussion on conflicting human-AI opinions in decision-making. Based on theories in human deliberation, this framework engages humans and AI in dimension-level opinion elicitation, deliberative discussion, and decision updates. To empower AI with deliberative capabilities, we designed Deliberative AI, which leverages large language models (LLMs) as a bridge between humans and domain-specific models to enable flexible conversational interactions and faithful information provision. An exploratory evaluation on a grad
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;AI&#26234;&#33021;&#22330;&#26223;&#25551;&#36848;&#24212;&#29992;&#22312;&#30450;&#20154;&#21644;&#20302;&#35270;&#21147;&#20154;&#32676;&#20013;&#30340;&#20351;&#29992;&#24773;&#20917;&#65292;&#21457;&#29616;&#29992;&#25143;&#20027;&#35201;&#29992;&#20110;&#35782;&#21035;&#24050;&#30693;&#23545;&#35937;&#30340;&#35270;&#35273;&#29305;&#24449;&#20197;&#21450;&#36991;&#20813;&#19982;&#21361;&#38505;&#29289;&#20307;&#25509;&#35302;&#65292;&#24182;&#19988;&#29992;&#25143;&#23545;&#25551;&#36848;&#30340;&#28385;&#24847;&#24230;&#35780;&#20998;&#30456;&#23545;&#36739;&#20302;&#12290;</title><link>https://arxiv.org/abs/2403.15604</link><description>&lt;p&gt;
&#30740;&#31350;AI&#26234;&#33021;&#22330;&#26223;&#25551;&#36848;&#24212;&#29992;&#22312;&#30450;&#20154;&#21644;&#20302;&#35270;&#21147;&#20154;&#32676;&#20013;&#30340;&#20351;&#29992;&#24773;&#20917;
&lt;/p&gt;
&lt;p&gt;
Investigating Use Cases of AI-Powered Scene Description Applications for Blind and Low Vision People
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15604
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;AI&#26234;&#33021;&#22330;&#26223;&#25551;&#36848;&#24212;&#29992;&#22312;&#30450;&#20154;&#21644;&#20302;&#35270;&#21147;&#20154;&#32676;&#20013;&#30340;&#20351;&#29992;&#24773;&#20917;&#65292;&#21457;&#29616;&#29992;&#25143;&#20027;&#35201;&#29992;&#20110;&#35782;&#21035;&#24050;&#30693;&#23545;&#35937;&#30340;&#35270;&#35273;&#29305;&#24449;&#20197;&#21450;&#36991;&#20813;&#19982;&#21361;&#38505;&#29289;&#20307;&#25509;&#35302;&#65292;&#24182;&#19988;&#29992;&#25143;&#23545;&#25551;&#36848;&#30340;&#28385;&#24847;&#24230;&#35780;&#20998;&#30456;&#23545;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#8220;&#22330;&#26223;&#25551;&#36848;&#8221;&#24212;&#29992;&#31243;&#24207;&#21487;&#20197;&#24110;&#21161;&#30450;&#20154;&#21644;&#20302;&#35270;&#21147;&#20154;&#22763;&#22312;&#26085;&#24120;&#29983;&#27963;&#20013;&#29702;&#35299;&#29031;&#29255;&#20013;&#30340;&#35270;&#35273;&#20869;&#23481;&#12290;&#30740;&#31350;&#20154;&#21592;&#24050;&#32463;&#30740;&#31350;&#20102;&#36825;&#20123;&#24212;&#29992;&#30340;&#20351;&#29992;&#24773;&#20917;&#65292;&#20294;&#20182;&#20204;&#21482;&#30740;&#31350;&#20102;&#21033;&#29992;&#36828;&#31243;&#26377;&#35270;&#21147;&#21161;&#25163;&#30340;&#24212;&#29992;&#65292;&#23545;&#20110;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#29983;&#25104;&#25551;&#36848;&#30340;&#24212;&#29992;&#30693;&#20043;&#29978;&#23569;&#12290;&#22240;&#27492;&#65292;&#20026;&#20102;&#35843;&#26597;&#20854;&#20351;&#29992;&#24773;&#20917;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#20026;&#26399;&#20004;&#21608;&#30340;&#26085;&#35760;&#30740;&#31350;&#65292;&#22312;&#27492;&#26399;&#38388;&#65292;16&#21517;&#30450;&#20154;&#21644;&#20302;&#35270;&#21147;&#21442;&#19982;&#32773;&#20351;&#29992;&#20102;&#25105;&#20204;&#35774;&#35745;&#30340;AI&#26234;&#33021;&#22330;&#26223;&#25551;&#36848;&#24212;&#29992;&#12290;&#36890;&#36807;&#20182;&#20204;&#30340;&#26085;&#35760;&#35760;&#24405;&#21644;&#21518;&#32493;&#35775;&#35848;&#65292;&#29992;&#25143;&#20998;&#20139;&#20102;&#20182;&#20204;&#30340;&#20449;&#24687;&#30446;&#26631;&#20197;&#21450;&#20182;&#20204;&#25910;&#21040;&#30340;&#35270;&#35273;&#25551;&#36848;&#30340;&#35780;&#20272;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#36825;&#20123;&#35760;&#24405;&#65292;&#24182;&#21457;&#29616;&#20102;&#24120;&#35265;&#30340;&#20351;&#29992;&#24773;&#20917;&#65292;&#27604;&#22914;&#35782;&#21035;&#24050;&#30693;&#23545;&#35937;&#30340;&#35270;&#35273;&#29305;&#24449;&#65292;&#20197;&#21450;&#19968;&#20123;&#20196;&#20154;&#24778;&#35766;&#30340;&#24773;&#20917;&#65292;&#27604;&#22914;&#36991;&#20813;&#25509;&#35302;&#21361;&#38505;&#29289;&#20307;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#29992;&#25143;&#23545;&#36825;&#20123;&#25551;&#36848;&#30340;&#28385;&#24847;&#24230;&#35780;&#20998;&#30456;&#23545;&#36739;&#20302;&#65292;&#24179;&#22343;&#20026;2.76&#65288;&#26631;&#20934;&#24046;=1.49&#65289;&#65292;&#23545;&#28385;&#24847;&#24230;&#30340;&#35780;&#20998;&#20026;2.43&#65288;&#26631;&#20934;&#24046;=1&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15604v1 Announce Type: cross  Abstract: "Scene description" applications that describe visual content in a photo are useful daily tools for blind and low vision (BLV) people. Researchers have studied their use, but they have only explored those that leverage remote sighted assistants; little is known about applications that use AI to generate their descriptions. Thus, to investigate their use cases, we conducted a two-week diary study where 16 BLV participants used an AI-powered scene description application we designed. Through their diary entries and follow-up interviews, users shared their information goals and assessments of the visual descriptions they received. We analyzed the entries and found frequent use cases, such as identifying visual features of known objects, and surprising ones, such as avoiding contact with dangerous objects. We also found users scored the descriptions relatively low on average, 2.76 out of 5 (SD=1.49) for satisfaction and 2.43 out of 4 (SD=1
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#32508;&#21512;&#26041;&#27861;&#65292;&#29992;&#20110;&#39564;&#35777;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#29983;&#25104;&#30340;&#25991;&#26412;&#20013;&#23637;&#31034;&#30340;&#20154;&#26684;&#29305;&#36136;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#37096;&#20998;LLMs&#22312;&#29305;&#23450;&#25552;&#31034;&#37197;&#32622;&#19979;&#27169;&#25311;&#30340;&#20154;&#26684;&#21487;&#38752;&#19988;&#26377;&#25928;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#26356;&#22823;&#21644;&#32463;&#36807;&#25351;&#23548;&#24494;&#35843;&#30340;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;LLMs&#30340;&#36755;&#20986;&#20013;&#30340;&#20154;&#26684;&#29305;&#36136;&#21487;&#20197;&#26681;&#25454;&#38656;&#35201;&#36827;&#34892;&#22609;&#36896;&#12290;</title><link>http://arxiv.org/abs/2307.00184</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20013;&#30340;&#20154;&#26684;&#29305;&#36136;
&lt;/p&gt;
&lt;p&gt;
Personality Traits in Large Language Models. (arXiv:2307.00184v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00184
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#32508;&#21512;&#26041;&#27861;&#65292;&#29992;&#20110;&#39564;&#35777;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#29983;&#25104;&#30340;&#25991;&#26412;&#20013;&#23637;&#31034;&#30340;&#20154;&#26684;&#29305;&#36136;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#37096;&#20998;LLMs&#22312;&#29305;&#23450;&#25552;&#31034;&#37197;&#32622;&#19979;&#27169;&#25311;&#30340;&#20154;&#26684;&#21487;&#38752;&#19988;&#26377;&#25928;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#26356;&#22823;&#21644;&#32463;&#36807;&#25351;&#23548;&#24494;&#35843;&#30340;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;LLMs&#30340;&#36755;&#20986;&#20013;&#30340;&#20154;&#26684;&#29305;&#36136;&#21487;&#20197;&#26681;&#25454;&#38656;&#35201;&#36827;&#34892;&#22609;&#36896;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#20986;&#29616;&#24443;&#24213;&#25913;&#21464;&#20102;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65292;&#20351;&#24471;&#33021;&#22815;&#29983;&#25104;&#36830;&#36143;&#19988;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#25991;&#26412;&#12290;&#38543;&#30528;LLMs&#36234;&#26469;&#36234;&#22810;&#22320;&#29992;&#20110;&#39537;&#21160;&#23545;&#35805;&#20195;&#29702;&#65292;&#36825;&#20123;&#27169;&#22411;&#36890;&#36807;&#35757;&#32451;&#22823;&#37327;&#20154;&#24037;&#29983;&#25104;&#30340;&#25968;&#25454;&#33719;&#24471;&#30340;&#20154;&#26684;&#29305;&#36136;&#24341;&#36215;&#20102;&#20154;&#20204;&#30340;&#20851;&#27880;&#12290;&#30001;&#20110;&#20154;&#26684;&#26159;&#20915;&#23450;&#20132;&#27969;&#25928;&#26524;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20840;&#38754;&#30340;&#26041;&#27861;&#26469;&#36827;&#34892;&#39564;&#35777;&#30340;&#24515;&#29702;&#27979;&#37327;&#27979;&#35797;&#65292;&#24182;&#23545;&#20174;&#24191;&#27867;&#20351;&#29992;&#30340;LLMs&#29983;&#25104;&#30340;&#25991;&#26412;&#20013;&#23637;&#31034;&#30340;&#20154;&#26684;&#29305;&#36136;&#36827;&#34892;&#37327;&#21270;&#12289;&#20998;&#26512;&#21644;&#22609;&#36896;&#12290;&#25105;&#20204;&#21457;&#29616;&#65306;1&#65289;&#26576;&#20123;LLMs&#30340;&#36755;&#20986;&#20013;&#27169;&#25311;&#30340;&#20154;&#26684;&#65288;&#22312;&#29305;&#23450;&#30340;&#25552;&#31034;&#37197;&#32622;&#19979;&#65289;&#26159;&#21487;&#38752;&#21644;&#26377;&#25928;&#30340;&#65307;2&#65289;LLM&#27169;&#25311;&#30340;&#20154;&#26684;&#30340;&#21487;&#38752;&#24615;&#21644;&#26377;&#25928;&#24615;&#30340;&#35777;&#25454;&#23545;&#20110;&#26356;&#22823;&#30340;&#21644;&#32463;&#36807;&#25351;&#23548;&#24494;&#35843;&#30340;&#27169;&#22411;&#26356;&#24378;&#65307;3&#65289;LLM&#36755;&#20986;&#20013;&#30340;&#20154;&#26684;&#21487;&#20197;&#26681;&#25454;&#38656;&#35201;&#30340;&#32500;&#24230;&#36827;&#34892;&#22609;&#36896;&#65292;&#20197;&#27169;&#20223;&#29305;&#23450;&#30340;&#20154;&#26684;&#29305;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
The advent of large language models (LLMs) has revolutionized natural language processing, enabling the generation of coherent and contextually relevant text. As LLMs increasingly power conversational agents, the synthesized personality embedded in these models by virtue of their training on large amounts of human-generated data draws attention. Since personality is an important factor determining the effectiveness of communication, we present a comprehensive method for administering validated psychometric tests and quantifying, analyzing, and shaping personality traits exhibited in text generated from widely-used LLMs. We find that: 1) personality simulated in the outputs of some LLMs (under specific prompting configurations) is reliable and valid; 2) evidence of reliability and validity of LLM-simulated personality is stronger for larger and instruction fine-tuned models; and 3) personality in LLM outputs can be shaped along desired dimensions to mimic specific personality profiles. 
&lt;/p&gt;</description></item></channel></rss>