<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#24314;&#31435;&#20102;&#20840;&#38754;&#30340;&#29702;&#35770;&#22522;&#30784;&#65292;&#27010;&#24565;&#21270;&#20114;&#34917;&#24615;&#65292;&#24182;&#30830;&#23450;&#20102;&#35299;&#37322;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#21327;&#20316;&#20013;&#20114;&#34917;&#22242;&#38431;&#32489;&#25928;&#65288;CTP&#65289;&#30340;&#26469;&#28304;&#12290;</title><link>https://arxiv.org/abs/2404.00029</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#21327;&#20316;&#20013;&#30340;&#20114;&#34917;&#24615;&#65306;&#27010;&#24565;&#12289;&#26469;&#28304;&#21644;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Complementarity in Human-AI Collaboration: Concept, Sources, and Evidence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00029
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24314;&#31435;&#20102;&#20840;&#38754;&#30340;&#29702;&#35770;&#22522;&#30784;&#65292;&#27010;&#24565;&#21270;&#20114;&#34917;&#24615;&#65292;&#24182;&#30830;&#23450;&#20102;&#35299;&#37322;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#21327;&#20316;&#20013;&#20114;&#34917;&#22242;&#38431;&#32489;&#25928;&#65288;CTP&#65289;&#30340;&#26469;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21487;&#20197;&#25552;&#39640;&#21508;&#20010;&#24212;&#29992;&#39046;&#22495;&#20013;&#20154;&#31867;&#20915;&#31574;&#30340;&#33021;&#21147;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#20154;&#31867;&#21644;AI&#20043;&#38388;&#30340;&#21327;&#20316;&#24212;&#35813;&#23548;&#33268;&#20114;&#34917;&#30340;&#22242;&#38431;&#32489;&#25928;&#65288;CTP&#65289;--&#19968;&#31181;&#26082;&#19981;&#26159;&#20182;&#20204;&#20010;&#20307;&#25152;&#33021;&#36798;&#21040;&#30340;&#32489;&#25928;&#27700;&#24179;&#12290;&#28982;&#32780;&#65292;&#36804;&#20170;&#20026;&#27490;&#65292;&#24456;&#23569;&#35266;&#23519;&#21040;CTP&#65292;&#36825;&#34920;&#26126;&#23545;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#30340;&#20114;&#34917;&#32452;&#20998;&#30340;&#29702;&#35299;&#19981;&#22815;&#65292;&#36825;&#20123;&#32452;&#20998;&#21487;&#20197;&#20419;&#36827;&#20915;&#31574;&#20013;&#30340;CTP&#12290;&#26412;&#30740;&#31350;&#20026;&#29702;&#35299;&#21644;&#21457;&#23637;&#20154;&#24037;&#26234;&#33021;&#20114;&#34917;&#24615;&#22880;&#23450;&#20102;&#20840;&#38754;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#21644;&#24418;&#24335;&#21270;&#20114;&#34917;&#24615;&#28508;&#21147;&#21450;&#20854;&#23454;&#29616;&#30340;&#27010;&#24565;&#65292;&#27010;&#24565;&#21270;&#20114;&#34917;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30830;&#23450;&#24182;&#27010;&#36848;&#20102;&#35299;&#37322;CTP&#30340;&#26469;&#28304;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#20004;&#39033;&#23454;&#35777;&#30740;&#31350;&#20013;&#24212;&#29992;&#25105;&#20204;&#30340;&#27010;&#24565;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#27010;&#24565;&#12290;&#22312;&#31532;&#19968;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20851;&#27880;&#20449;&#24687;&#19981;&#23545;&#31216;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00029v1 Announce Type: cross  Abstract: Artificial intelligence (AI) can improve human decision-making in various application areas. Ideally, collaboration between humans and AI should lead to complementary team performance (CTP) -- a level of performance that neither of them can attain individually. So far, however, CTP has rarely been observed, suggesting an insufficient understanding of the complementary constituents in human-AI collaboration that can contribute to CTP in decision-making. This work establishes a holistic theoretical foundation for understanding and developing human-AI complementarity. We conceptualize complementarity by introducing and formalizing the notion of complementarity potential and its realization. Moreover, we identify and outline sources that explain CTP. We illustrate our conceptualization by applying it in two empirical studies exploring two different sources of complementarity potential. In the first study, we focus on information asymmetry 
&lt;/p&gt;</description></item></channel></rss>