<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;AutoTRIZ&#65292;&#19968;&#31181;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#33258;&#21160;&#21270;&#21644;&#22686;&#24378;TRIZ&#26041;&#27861;&#30340;&#20154;&#24037;&#21019;&#24847;&#24037;&#20855;&#65292;&#20026;&#35774;&#35745;&#33258;&#21160;&#21270;&#21644;&#21487;&#35299;&#37322;&#21019;&#24847;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#39062;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.13002</link><description>&lt;p&gt;
AutoTRIZ&#65306;&#21033;&#29992;TRIZ&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20154;&#24037;&#21019;&#24847;
&lt;/p&gt;
&lt;p&gt;
AutoTRIZ: Artificial Ideation with TRIZ and Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13002
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;AutoTRIZ&#65292;&#19968;&#31181;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#33258;&#21160;&#21270;&#21644;&#22686;&#24378;TRIZ&#26041;&#27861;&#30340;&#20154;&#24037;&#21019;&#24847;&#24037;&#20855;&#65292;&#20026;&#35774;&#35745;&#33258;&#21160;&#21270;&#21644;&#21487;&#35299;&#37322;&#21019;&#24847;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#39062;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20154;&#21592;&#21644;&#21019;&#26032;&#32773;&#22312;&#24320;&#21457;&#24605;&#32500;&#26041;&#27861;&#26041;&#38754;&#20570;&#20986;&#20102;&#24040;&#22823;&#21162;&#21147;&#65292;&#27604;&#22914;&#24418;&#24577;&#20998;&#26512;&#21644;&#31867;&#27604;&#35774;&#35745;&#65292;&#20197;&#36741;&#21161;&#24037;&#31243;&#35774;&#35745;&#21019;&#24847;&#65292;&#35299;&#20915;&#38382;&#39064;&#21644;&#25512;&#21160;&#21019;&#26032;&#12290;&#22312;&#36825;&#20123;&#26041;&#27861;&#20013;&#65292;TRIZ&#20316;&#20026;&#26368;&#33879;&#21517;&#30340;&#26041;&#27861;&#33073;&#39062;&#32780;&#20986;&#65292;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#31995;&#32479;&#21270;&#21019;&#26032;&#12290;&#28982;&#32780;&#65292;TRIZ&#36164;&#28304;&#21644;&#27010;&#24565;&#30340;&#22797;&#26434;&#24615;&#65292;&#20197;&#21450;&#20854;&#23545;&#29992;&#25143;&#30693;&#35782;&#12289;&#32463;&#39564;&#21644;&#25512;&#29702;&#33021;&#21147;&#30340;&#20381;&#36182;&#65292;&#38480;&#21046;&#20102;&#20854;&#23454;&#29992;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;AutoTRIZ&#65292;&#19968;&#31181;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#33258;&#21160;&#21270;&#21644;&#22686;&#24378;TRIZ&#26041;&#27861;&#30340;&#20154;&#24037;&#21019;&#24847;&#24037;&#20855;&#12290;&#36890;&#36807;&#21033;&#29992;LLMs&#30340;&#24191;&#27867;&#30693;&#35782;&#21644;&#20808;&#36827;&#25512;&#29702;&#33021;&#21147;&#65292;AutoTRIZ&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#36827;&#34892;&#35774;&#35745;&#33258;&#21160;&#21270;&#21644;&#21487;&#35299;&#37322;&#21019;&#24847;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#30683;&#30462;&#26816;&#27979;&#21644;&#27604;&#36739;&#26041;&#38754;&#30340;&#19968;&#33268;&#24615;&#23454;&#39564;&#26469;&#35777;&#26126;&#24182;&#35780;&#20272;AutoTRIZ&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13002v1 Announce Type: cross  Abstract: Researchers and innovators have made enormous efforts in developing ideation methods, such as morphological analysis and design-by-analogy, to aid engineering design ideation for problem solving and innovation. Among these, TRIZ stands out as the most well-known approach, widely applied for systematic innovation. However, the complexity of TRIZ resources and concepts, coupled with its reliance on users' knowledge, experience, and reasoning capabilities, limits its practicability. This paper proposes AutoTRIZ, an artificial ideation tool that leverages large language models (LLMs) to automate and enhance the TRIZ methodology. By leveraging the broad knowledge and advanced reasoning capabilities of LLMs, AutoTRIZ offers a novel approach to design automation and interpretable ideation with artificial intelligence. We demonstrate and evaluate the effectiveness of AutoTRIZ through consistency experiments in contradiction detection and compa
&lt;/p&gt;</description></item><item><title>GhostWriter&#26159;&#19968;&#20010;AI&#22686;&#24378;&#30340;&#20889;&#20316;&#35774;&#35745;&#25506;&#38024;&#65292;&#36890;&#36807;&#20010;&#24615;&#21270;&#21644;&#20195;&#29702;&#22686;&#24378;&#29992;&#25143;&#30340;&#20889;&#20316;&#20307;&#39564;&#12290;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#38544;&#24335;&#23398;&#20064;&#29992;&#25143;&#30340;&#20889;&#20316;&#39118;&#26684;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#36890;&#36807;&#25163;&#21160;&#26679;&#24335;&#32534;&#36753;&#21644;&#25209;&#27880;&#26469;&#25511;&#21046;&#31995;&#32479;&#30340;&#20889;&#20316;&#39118;&#26684;&#12290;</title><link>https://arxiv.org/abs/2402.08855</link><description>&lt;p&gt;
GhostWriter:&#36890;&#36807;&#20010;&#24615;&#21270;&#21644;&#20195;&#29702;&#22686;&#24378;&#21327;&#20316;&#20154;&#24037;&#26234;&#33021;&#20889;&#20316;&#20307;&#39564;
&lt;/p&gt;
&lt;p&gt;
GhostWriter: Augmenting Collaborative Human-AI Writing Experiences Through Personalization and Agency
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08855
&lt;/p&gt;
&lt;p&gt;
GhostWriter&#26159;&#19968;&#20010;AI&#22686;&#24378;&#30340;&#20889;&#20316;&#35774;&#35745;&#25506;&#38024;&#65292;&#36890;&#36807;&#20010;&#24615;&#21270;&#21644;&#20195;&#29702;&#22686;&#24378;&#29992;&#25143;&#30340;&#20889;&#20316;&#20307;&#39564;&#12290;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#38544;&#24335;&#23398;&#20064;&#29992;&#25143;&#30340;&#20889;&#20316;&#39118;&#26684;&#65292;&#24182;&#20801;&#35768;&#29992;&#25143;&#36890;&#36807;&#25163;&#21160;&#26679;&#24335;&#32534;&#36753;&#21644;&#25209;&#27880;&#26469;&#25511;&#21046;&#31995;&#32479;&#30340;&#20889;&#20316;&#39118;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#25552;&#20379;&#19981;&#21516;&#24418;&#24335;&#30340;&#20889;&#20316;&#36741;&#21161;&#26041;&#38754;&#36234;&#26469;&#36234;&#27969;&#34892;&#65292;&#24182;&#19988;&#20855;&#26377;&#26080;&#22788;&#19981;&#22312;&#30340;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20010;&#24615;&#21270;&#21644;&#25511;&#21046;&#33021;&#21147;&#26377;&#38480;&#65292;LLM&#39537;&#21160;&#30340;&#20889;&#20316;&#31995;&#32479;&#21487;&#33021;&#20250;&#20351;&#29992;&#25143;&#24863;&#21040;&#27822;&#20007;&#65292;&#24403;&#29992;&#25143;&#32570;&#20047;&#25552;&#31034;&#24037;&#31243;&#32463;&#39564;&#26102;&#65292;&#36825;&#31181;&#24773;&#20917;&#21487;&#33021;&#21152;&#21095;&#12290;&#25105;&#20204;&#35748;&#20026;&#35774;&#35745;&#21487;&#20197;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#20043;&#19968;&#65292;&#24182;&#24341;&#20837;GhostWriter&#65292;&#36825;&#26159;&#19968;&#20010;AI&#22686;&#24378;&#30340;&#20889;&#20316;&#35774;&#35745;&#25506;&#38024;&#65292;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#22686;&#24378;&#30340;&#20195;&#29702;&#21644;&#20010;&#24615;&#21270;&#26469;&#36827;&#34892;&#20889;&#20316;&#12290;GhostWriter&#21033;&#29992;LLMs&#22312;&#29992;&#25143;&#32534;&#20889;&#30340;&#36807;&#31243;&#20013;&#38544;&#24335;&#23398;&#20064;&#29992;&#25143;&#25152;&#26399;&#26395;&#30340;&#20889;&#20316;&#39118;&#26684;&#65292;&#21516;&#26102;&#20801;&#35768;&#36890;&#36807;&#25163;&#21160;&#26679;&#24335;&#32534;&#36753;&#21644;&#25209;&#27880;&#36827;&#34892;&#26174;&#24335;&#25945;&#23398;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;18&#21517;&#21442;&#19982;&#32773;&#22312;&#20004;&#20010;&#19981;&#21516;&#30340;&#20889;&#20316;&#20219;&#21153;&#20013;&#20351;&#29992;GhostWriter&#65292;&#35266;&#23519;&#21040;&#23427;&#24110;&#21161;&#29992;&#25143;&#32534;&#20889;&#20010;&#24615;&#21270;&#30340;&#25991;&#26412;&#29983;&#25104;&#65292;&#24182;&#36890;&#36807;&#25552;&#20379;&#22810;&#31181;&#26041;&#24335;&#25511;&#21046;&#31995;&#32479;&#30340;&#20889;&#20316;&#39118;&#26684;&#26469;&#22686;&#24378;&#29992;&#25143;&#30340;&#33021;&#21147;&#12290;&#20174;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20123;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08855v1 Announce Type: cross Abstract: Large language models (LLMs) are becoming more prevalent and have found a ubiquitous use in providing different forms of writing assistance. However, LLM-powered writing systems can frustrate users due to their limited personalization and control, which can be exacerbated when users lack experience with prompt engineering. We see design as one way to address these challenges and introduce GhostWriter, an AI-enhanced writing design probe where users can exercise enhanced agency and personalization. GhostWriter leverages LLMs to learn the user's intended writing style implicitly as they write, while allowing explicit teaching moments through manual style edits and annotations. We study 18 participants who use GhostWriter on two different writing tasks, observing that it helps users craft personalized text generations and empowers them by providing multiple ways to control the system's writing style. From this study, we present insights re
&lt;/p&gt;</description></item></channel></rss>