<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20302;&#25104;&#26412;&#25216;&#26415;&#35299;&#20915;&#26041;&#26696;MindArm&#65292;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23558;&#22823;&#33041;&#20449;&#21495;&#32763;&#35793;&#25104;&#20551;&#32930;&#36816;&#21160;&#65292;&#24110;&#21161;&#24739;&#32773;&#25191;&#34892;&#21508;&#31181;&#27963;&#21160;</title><link>https://arxiv.org/abs/2403.19992</link><description>&lt;p&gt;
MindArm: &#26426;&#26800;&#26234;&#33021;&#38750;&#20405;&#20837;&#24335;&#31070;&#32463;&#39537;&#21160;&#20551;&#32930;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
MindArm: Mechanized Intelligent Non-Invasive Neuro-Driven Prosthetic Arm System
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19992
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20302;&#25104;&#26412;&#25216;&#26415;&#35299;&#20915;&#26041;&#26696;MindArm&#65292;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23558;&#22823;&#33041;&#20449;&#21495;&#32763;&#35793;&#25104;&#20551;&#32930;&#36816;&#21160;&#65292;&#24110;&#21161;&#24739;&#32773;&#25191;&#34892;&#21508;&#31181;&#27963;&#21160;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#65292;&#27531;&#30142;&#25110;&#38590;&#20197;&#31227;&#21160;&#25163;&#33218;&#30340;&#20154;&#65288;&#31616;&#31216;&#8220;&#24739;&#32773;&#8221;&#65289;&#22312;&#26377;&#25928;&#35299;&#20915;&#29983;&#29702;&#38480;&#21046;&#26041;&#38754;&#26377;&#38750;&#24120;&#26377;&#38480;&#30340;&#25216;&#26415;&#35299;&#20915;&#26041;&#26696;&#12290;&#36825;&#20027;&#35201;&#26159;&#30001;&#20110;&#20004;&#20010;&#21407;&#22240;&#65306;&#19968;&#26159;&#20687;&#20197;&#24605;&#32500;&#25511;&#21046;&#20026;&#20027;&#30340;&#20551;&#32930;&#35774;&#22791;&#36890;&#24120;&#38750;&#24120;&#26114;&#36149;&#24182;&#38656;&#35201;&#26114;&#36149;&#30340;&#32500;&#25252;&#65307;&#20108;&#26159;&#20854;&#20182;&#35299;&#20915;&#26041;&#26696;&#38656;&#35201;&#26114;&#36149;&#30340;&#20405;&#20837;&#24615;&#33041;&#37096;&#25163;&#26415;&#65292;&#36825;&#31181;&#25163;&#26415;&#39118;&#38505;&#39640;&#65292;&#26114;&#36149;&#19988;&#32500;&#25252;&#22256;&#38590;&#12290;&#22240;&#27492;&#65292;&#24403;&#21069;&#30340;&#25216;&#26415;&#35299;&#20915;&#26041;&#26696;&#24182;&#19981;&#36866;&#29992;&#20110;&#20855;&#26377;&#19981;&#21516;&#36130;&#21153;&#32972;&#26223;&#30340;&#25152;&#26377;&#24739;&#32773;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20302;&#25104;&#26412;&#25216;&#26415;&#35299;&#20915;&#26041;&#26696;&#65292;&#21517;&#20026;MindArm&#65292;&#21363;&#19968;&#31181;&#26426;&#26800;&#26234;&#33021;&#38750;&#20405;&#20837;&#24335;&#31070;&#32463;&#39537;&#21160;&#20551;&#32930;&#31995;&#32479;&#12290;&#25105;&#20204;&#30340;MindArm&#31995;&#32479;&#37319;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#24341;&#25806;&#23558;&#22823;&#33041;&#20449;&#21495;&#32763;&#35793;&#25104;&#39044;&#26399;&#30340;&#20551;&#32930;&#36816;&#21160;&#65292;&#20174;&#32780;&#24110;&#21161;&#24739;&#32773;&#23454;&#26045;&#35768;&#22810;&#27963;&#21160;&#65292;&#23613;&#31649;&#20182;&#20204;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19992v1 Announce Type: new  Abstract: Currently, people with disability or difficulty to move their arms (referred to as "patients") have very limited technological solutions to efficiently address their physiological limitations. It is mainly due to two reasons: (1) the non-invasive solutions like mind-controlled prosthetic devices are typically very costly and require expensive maintenance; and (2) other solutions require costly invasive brain surgery, which is high risk to perform, expensive, and difficult to maintain. Therefore, current technological solutions are not accessible for all patients with different financial backgrounds. Toward this, we propose a low-cost technological solution called MindArm, a mechanized intelligent non-invasive neuro-driven prosthetic arm system. Our MindArm system employs a deep neural network (DNN) engine to translate brain signals into the intended prosthetic arm motion, thereby helping patients to perform many activities despite their 
&lt;/p&gt;</description></item></channel></rss>