<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>PAPER-HILT&#26159;&#38024;&#23545;&#20154;&#26426;&#21327;&#21516;&#31995;&#32479;&#20013;&#38544;&#31169;&#20445;&#25252;&#30340;&#21019;&#26032;&#33258;&#36866;&#24212;&#24378;&#21270;&#23398;&#20064;&#31574;&#30053;&#65292;&#36890;&#36807;&#25552;&#21069;&#36864;&#20986;&#26041;&#27861;&#21160;&#24577;&#35843;&#25972;&#38544;&#31169;&#20445;&#25252;&#21644;&#31995;&#32479;&#25928;&#29992;&#65292;&#20197;&#36866;&#24212;&#20010;&#20307;&#34892;&#20026;&#27169;&#24335;&#21644;&#20559;&#22909;&#12290;</title><link>https://arxiv.org/abs/2403.05864</link><description>&lt;p&gt;
PAPER-HILT&#65306;&#20010;&#24615;&#21270;&#21644;&#33258;&#36866;&#24212;&#38544;&#31169;&#24863;&#30693;&#30340;&#24378;&#21270;&#23398;&#20064;&#25552;&#21069;&#36864;&#20986;&#22312;&#20154;&#26426;&#21327;&#21516;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
PAPER-HILT: Personalized and Adaptive Privacy-Aware Early-Exit for Reinforcement Learning in Human-in-the-Loop Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05864
&lt;/p&gt;
&lt;p&gt;
PAPER-HILT&#26159;&#38024;&#23545;&#20154;&#26426;&#21327;&#21516;&#31995;&#32479;&#20013;&#38544;&#31169;&#20445;&#25252;&#30340;&#21019;&#26032;&#33258;&#36866;&#24212;&#24378;&#21270;&#23398;&#20064;&#31574;&#30053;&#65292;&#36890;&#36807;&#25552;&#21069;&#36864;&#20986;&#26041;&#27861;&#21160;&#24577;&#35843;&#25972;&#38544;&#31169;&#20445;&#25252;&#21644;&#31995;&#32479;&#25928;&#29992;&#65292;&#20197;&#36866;&#24212;&#20010;&#20307;&#34892;&#20026;&#27169;&#24335;&#21644;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#26085;&#30410;&#25104;&#20026;&#20154;&#26426;&#21327;&#21516;&#65288;HITL&#65289;&#24212;&#29992;&#20013;&#30340;&#39318;&#36873;&#26041;&#27861;&#65292;&#22240;&#20854;&#36866;&#24212;&#20110;&#20154;&#31867;&#20132;&#20114;&#30340;&#21160;&#24577;&#29305;&#24615;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#29615;&#22659;&#20013;&#25972;&#21512;RL&#20250;&#24102;&#26469;&#37325;&#22823;&#30340;&#38544;&#31169;&#38382;&#39064;&#65292;&#21487;&#33021;&#20250;&#19981;&#32463;&#24847;&#22320;&#26292;&#38706;&#25935;&#24863;&#29992;&#25143;&#20449;&#24687;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#30340;&#35770;&#25991;&#19987;&#27880;&#20110;&#24320;&#21457;PAPER-HILT&#65292;&#19968;&#31181;&#21019;&#26032;&#30340;&#33258;&#36866;&#24212;RL&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#19987;&#20026;HITL&#29615;&#22659;&#20013;&#38544;&#31169;&#20445;&#25252;&#35774;&#35745;&#30340;&#25552;&#21069;&#36864;&#20986;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21160;&#24577;&#35843;&#25972;&#38544;&#31169;&#20445;&#25252;&#21644;&#31995;&#32479;&#25928;&#29992;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#20351;&#20854;&#25805;&#20316;&#36866;&#24212;&#20010;&#20154;&#34892;&#20026;&#27169;&#24335;&#21644;&#20559;&#22909;&#12290;&#25105;&#20204;&#20027;&#35201;&#24378;&#35843;&#38754;&#20020;&#22788;&#29702;&#20154;&#31867;&#34892;&#20026;&#30340;&#21487;&#21464;&#21644;&#19981;&#26029;&#21457;&#23637;&#30340;&#25361;&#25112;&#65292;&#20351;&#24471;&#38745;&#24577;&#38544;&#31169;&#27169;&#22411;&#22833;&#25928;&#12290;&#36890;&#36807;&#20854;&#24212;&#29992;&#65292;&#35780;&#20272;&#20102;PAPER-HILT&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05864v1 Announce Type: new  Abstract: Reinforcement Learning (RL) has increasingly become a preferred method over traditional rule-based systems in diverse human-in-the-loop (HITL) applications due to its adaptability to the dynamic nature of human interactions. However, integrating RL in such settings raises significant privacy concerns, as it might inadvertently expose sensitive user information. Addressing this, our paper focuses on developing PAPER-HILT, an innovative, adaptive RL strategy through exploiting an early-exit approach designed explicitly for privacy preservation in HITL environments. This approach dynamically adjusts the tradeoff between privacy protection and system utility, tailoring its operation to individual behavioral patterns and preferences. We mainly highlight the challenge of dealing with the variable and evolving nature of human behavior, which renders static privacy models ineffective. PAPER-HILT's effectiveness is evaluated through its applicati
&lt;/p&gt;</description></item></channel></rss>