<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#36890;&#36807;&#35266;&#23519;NFT&#24904;&#21892;&#31609;&#27454;&#27963;&#21160;&#20013;&#25424;&#21161;&#20154;&#36141;&#20080;NFT&#23545;&#20854;&#21518;&#32493;&#24066;&#22330;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#30495;&#35802;&#19982;&#31574;&#30053;&#24615;&#24951;&#24936;&#34892;&#20026;&#23545;&#24066;&#22330;&#30340;&#22238;&#24212;&#65292;&#24182;&#21457;&#29616;&#20102;&#26126;&#30830;&#30340;&#24322;&#36136;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2401.12064</link><description>&lt;p&gt;
&#30495;&#35802;&#19982;&#31574;&#30053;&#24615;&#24951;&#24936;&#34892;&#20026;&#23545;&#24066;&#22330;&#30340;&#22238;&#24212;&#65306;&#23545;NFT&#24904;&#21892;&#31609;&#27454;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Market Responses to Genuine Versus Strategic Generosity: An Empirical Examination of NFT Charity Fundraisers. (arXiv:2401.12064v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12064
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#35266;&#23519;NFT&#24904;&#21892;&#31609;&#27454;&#27963;&#21160;&#20013;&#25424;&#21161;&#20154;&#36141;&#20080;NFT&#23545;&#20854;&#21518;&#32493;&#24066;&#22330;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#30495;&#35802;&#19982;&#31574;&#30053;&#24615;&#24951;&#24936;&#34892;&#20026;&#23545;&#24066;&#22330;&#30340;&#22238;&#24212;&#65292;&#24182;&#21457;&#29616;&#20102;&#26126;&#30830;&#30340;&#24322;&#36136;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#25424;&#36192;&#29616;&#22312;&#21344;&#25454;&#20840;&#29699;&#24904;&#21892;&#25424;&#36192;&#30340;&#37325;&#35201;&#20221;&#39069;&#12290;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#65288;NFT&#65289;&#24904;&#21892;&#31609;&#27454;&#20316;&#20026;&#19968;&#31181;&#26032;&#30340;&#21457;&#23637;&#26041;&#24335;&#65292;&#22312;&#36825;&#20010;&#39046;&#22495;&#20013;&#20986;&#29616;&#20102;&#12290;NFT&#24904;&#21892;&#31609;&#27454;&#30340;&#19968;&#20010;&#29420;&#29305;&#20043;&#22788;&#22312;&#20110;&#25424;&#21161;&#20154;&#26377;&#21487;&#33021;&#20174;&#25152;&#36141;&#20080;&#30340;NFT&#19978;&#21319;&#20540;&#20013;&#33719;&#24471;&#32463;&#27982;&#21033;&#30410;&#12290;&#23545;&#20110;&#36825;&#20123;&#24904;&#21892;&#31609;&#27454;&#30340;&#25424;&#21161;&#20154;&#21160;&#26426;&#21487;&#33021;&#20250;&#20135;&#29983;&#36127;&#38754;&#30340;&#31038;&#20250;&#24418;&#35937;&#12290;&#22240;&#27492;&#65292;NFT&#24904;&#21892;&#31609;&#27454;&#25552;&#20379;&#20102;&#19968;&#20010;&#20102;&#35299;&#25424;&#21161;&#20154;&#31038;&#20250;&#24418;&#35937;&#32463;&#27982;&#21518;&#26524;&#30340;&#29420;&#29305;&#26426;&#20250;&#12290;&#25105;&#20204;&#36890;&#36807;&#21033;&#29992;&#21306;&#22359;&#38142;&#19978;&#20132;&#26131;&#22788;&#29702;&#26102;&#38388;&#30340;&#38543;&#26426;&#21464;&#21160;&#65292;&#30740;&#31350;&#20102;&#19968;&#20010;&#22823;&#22411;NFT&#24904;&#21892;&#31609;&#27454;&#27963;&#21160;&#20013;&#36141;&#20080;NFT&#23545;&#25424;&#21161;&#20154;&#21518;&#32493;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#26126;&#30830;&#30340;&#24322;&#36136;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Crypto donations now represent a significant fraction of charitable giving worldwide. Nonfungible token (NFT) charity fundraisers, which involve the sale of NFTs of artistic works with the proceeds donated to philanthropic causes, have emerged as a novel development in this space. A unique aspect of NFT charity fundraisers is the significant potential for donors to reap financial gains from the rising value of purchased NFTs. Questions may arise about the motivations of donors in these charity fundraisers, resulting in a negative social image. NFT charity fundraisers thus offer a unique opportunity to understand the economic consequences of a donor's social image. We investigate these effects in the context of a large NFT charity fundraiser. We identify the causal effect of purchasing an NFT within the charity fundraiser on a donor's later market outcomes by leveraging random variation in transaction processing times on the blockchain. Further, we demonstrate a clear pattern of heterog
&lt;/p&gt;</description></item></channel></rss>