<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#30524;&#31185;&#36136;&#37327;&#35780;&#20272;&#31995;&#32479;&#65292;&#21487;&#20197;&#24110;&#21161;&#36828;&#31243;&#30524;&#31185;&#21672;&#35810;&#65292;&#23588;&#20854;&#26159;&#22312;&#20302;&#25910;&#20837;&#21644;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#12290;&#35813;&#31995;&#32479;&#33021;&#22815;&#21363;&#26102;&#21453;&#39304;&#29992;&#25143;&#25293;&#25668;&#30340;&#30524;&#37096;&#22270;&#20687;&#30340;&#36136;&#37327;&#65292;&#35299;&#20915;&#20102;&#24403;&#21069;&#29992;&#25143;&#25293;&#25668;&#22270;&#20687;&#36136;&#37327;&#19981;&#20339;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.07118</link><description>&lt;p&gt;
&#19979;&#19968;&#20195;&#36828;&#31243;&#30524;&#31185;&#35786;&#30103;&#65306;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#36136;&#37327;&#35780;&#20272;&#24110;&#21161;&#36828;&#31243;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#21672;&#35810;
&lt;/p&gt;
&lt;p&gt;
Next-Generation Teleophthalmology: AI-enabled Quality Assessment Aiding Remote Smartphone-based Consultation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07118
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#30524;&#31185;&#36136;&#37327;&#35780;&#20272;&#31995;&#32479;&#65292;&#21487;&#20197;&#24110;&#21161;&#36828;&#31243;&#30524;&#31185;&#21672;&#35810;&#65292;&#23588;&#20854;&#26159;&#22312;&#20302;&#25910;&#20837;&#21644;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#12290;&#35813;&#31995;&#32479;&#33021;&#22815;&#21363;&#26102;&#21453;&#39304;&#29992;&#25143;&#25293;&#25668;&#30340;&#30524;&#37096;&#22270;&#20687;&#30340;&#36136;&#37327;&#65292;&#35299;&#20915;&#20102;&#24403;&#21069;&#29992;&#25143;&#25293;&#25668;&#22270;&#20687;&#36136;&#37327;&#19981;&#20339;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22833;&#26126;&#21644;&#20854;&#20182;&#30524;&#37096;&#30142;&#30149;&#26159;&#20840;&#29699;&#20851;&#27880;&#30340;&#20581;&#24247;&#38382;&#39064;&#65292;&#23588;&#20854;&#26159;&#22312;&#21360;&#24230;&#31561;&#20302;&#25910;&#20837;&#21644;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#65292;&#36828;&#31243;&#30524;&#31185;&#35786;&#30103;&#25104;&#20026;&#19968;&#31181;&#29983;&#21629;&#32447;&#65292;&#24182;&#19988;&#26234;&#33021;&#25163;&#26426;&#30524;&#37096;&#25104;&#20687;&#30340; Grabi &#38468;&#20214;&#24471;&#21040;&#20102;&#24191;&#27867;&#20351;&#29992;&#12290;&#28982;&#32780;&#65292;&#29992;&#25143;&#25293;&#25668;&#30340;&#22270;&#29255;&#36136;&#37327;&#24448;&#24448;&#19981;&#22815;&#22909;&#65292;&#38656;&#35201;&#21307;&#29983;&#23457;&#26680;&#24182;&#19988;&#20250;&#24310;&#35823;&#26102;&#38388;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#36136;&#37327;&#35780;&#20272;&#31995;&#32479;&#65292;&#33021;&#22815;&#27169;&#25311;&#21307;&#29983;&#30340;&#21028;&#26029;&#24182;&#19988;&#33021;&#22815;&#21363;&#26102;&#21453;&#39304;&#65292;&#25105;&#20204;&#23545;&#24739;&#32773;&#25293;&#25668;&#30340;&#22270;&#20687;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#23558;&#22797;&#26434;&#38382;&#39064;&#23618;&#27425;&#21270;&#65292;&#25105;&#20204;&#22312;&#27492;&#35299;&#20915;&#20102;&#19968;&#20010;&#38750;&#24120;&#37325;&#35201;&#30340;&#37096;&#20998;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#27010;&#24565;&#30340;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blindness and other eye diseases are a global health concern, particularly in low- and middle-income countries like India. In this regard, during the COVID-19 pandemic, teleophthalmology became a lifeline, and the Grabi attachment for smartphone-based eye imaging gained in use. However, quality of user-captured image often remained inadequate, requiring clinician vetting and delays. In this backdrop, we propose an AI-based quality assessment system with instant feedback mimicking clinicians' judgments and tested on patient-captured images. Dividing the complex problem hierarchically, here we tackle a nontrivial part, and demonstrate a proof of the concept.
&lt;/p&gt;</description></item></channel></rss>