<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20132;&#20114;&#24335;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#22823;&#22411;&#25991;&#26412;&#38598;&#21512;&#20013;&#25581;&#31034;&#28508;&#22312;&#30340;&#12289;&#34987;&#39046;&#22495;&#19987;&#23478;&#35270;&#20026;&#30456;&#20851;&#30340;&#27010;&#24565;&#65292;&#26082;&#23454;&#29616;&#20102;&#33258;&#21160;&#21270;&#21448;&#20943;&#23569;&#20102;&#25163;&#21160;&#32534;&#30721;&#30340;&#24037;&#20316;&#37327;&#12290;</title><link>http://arxiv.org/abs/2305.05094</link><description>&lt;p&gt;
&#22823;&#22411;&#25991;&#26412;&#38598;&#21512;&#20013;&#30340;&#20132;&#20114;&#24335;&#27010;&#24565;&#23398;&#20064;&#29992;&#20110;&#25581;&#31034;&#28508;&#22312;&#20027;&#39064;
&lt;/p&gt;
&lt;p&gt;
Interactive Concept Learning for Uncovering Latent Themes in Large Text Collections. (arXiv:2305.05094v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05094
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20132;&#20114;&#24335;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#22823;&#22411;&#25991;&#26412;&#38598;&#21512;&#20013;&#25581;&#31034;&#28508;&#22312;&#30340;&#12289;&#34987;&#39046;&#22495;&#19987;&#23478;&#35270;&#20026;&#30456;&#20851;&#30340;&#27010;&#24565;&#65292;&#26082;&#23454;&#29616;&#20102;&#33258;&#21160;&#21270;&#21448;&#20943;&#23569;&#20102;&#25163;&#21160;&#32534;&#30721;&#30340;&#24037;&#20316;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#36234;&#19981;&#21516;&#23398;&#31185;&#39046;&#22495;&#30340;&#19987;&#23478;&#20204;&#36890;&#24120;&#26377;&#20852;&#36259;&#29702;&#35299;&#22823;&#22411;&#25991;&#26412;&#38598;&#21512;&#12290;&#20256;&#32479;&#19978;&#65292;&#36825;&#20010;&#25361;&#25112;&#21487;&#20197;&#36890;&#36807;&#22024;&#26434;&#30340;&#26080;&#30417;&#30563;&#25216;&#26415;&#65288;&#22914;&#20027;&#39064;&#27169;&#22411;&#65289;&#25110;&#25163;&#21160;&#20027;&#39064;&#21457;&#29616;&#27969;&#31243;&#26469;&#22788;&#29702;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25193;&#23637;&#20102;&#20027;&#39064;&#30340;&#23450;&#20041;&#65292;&#19981;&#20165;&#32771;&#34385;&#35789;&#20998;&#24067;&#65292;&#36824;&#21253;&#25324;&#34987;&#39046;&#22495;&#19987;&#23478;&#35270;&#20026;&#30456;&#20851;&#30340;&#27010;&#24565;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20132;&#20114;&#24335;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#25277;&#35937;&#32423;&#21035;&#19978;&#25509;&#25910;&#21644;&#32534;&#30721;&#19987;&#23478;&#21453;&#39304;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#33258;&#21160;&#21270;&#21644;&#25163;&#21160;&#32534;&#30721;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#65292;&#20801;&#35768;&#19987;&#23478;&#25511;&#21046;&#20182;&#20204;&#30340;&#30740;&#31350;&#65292;&#21516;&#26102;&#20943;&#23569;&#25152;&#38656;&#30340;&#25163;&#21160;&#24037;&#20316;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Experts across diverse disciplines are often interested in making sense of large text collections. Traditionally, this challenge is approached either by noisy unsupervised techniques such as topic models, or by following a manual theme discovery process. In this paper, we expand the definition of a theme to account for more than just a word distribution, and include generalized concepts deemed relevant by domain experts. Then, we propose an interactive framework that receives and encodes expert feedback at different levels of abstraction. Our framework strikes a balance between automation and manual coding, allowing experts to maintain control of their study while reducing the manual effort required.
&lt;/p&gt;</description></item></channel></rss>