<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#35774;&#35745;&#20102;&#19968;&#27454;&#21517;&#20026;ClarifAI&#30340;&#33258;&#21160;&#21270;&#23459;&#20256;&#26816;&#27979;&#24037;&#20855;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26816;&#27979;&#26032;&#38395;&#20013;&#30340;&#23459;&#20256;&#24182;&#25552;&#20379;&#20016;&#23500;&#35299;&#37322;&#65292;&#20197;&#28608;&#21457;&#26356;&#22810;&#25209;&#21028;&#24615;&#38405;&#35835;&#65292;&#23454;&#39564;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#65292;&#24378;&#35843;&#20102;&#35299;&#37322;&#23545;&#20110;&#22521;&#20859;&#25209;&#21028;&#24615;&#24605;&#32500;&#30340;&#37325;&#35201;&#24615;</title><link>https://arxiv.org/abs/2402.19135</link><description>&lt;p&gt;
&#24555;&#36895;&#24605;&#32771;&#65292;&#24930;&#36895;&#24605;&#32771;&#65292;&#25209;&#21028;&#24615;&#24605;&#32771;&#65306;&#35774;&#35745;&#19968;&#27454;&#33258;&#21160;&#21270;&#30123;&#24773;&#26816;&#27979;&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;
Think Fast, Think Slow, Think Critical: Designing an Automated Propaganda Detection Tool
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19135
&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20102;&#19968;&#27454;&#21517;&#20026;ClarifAI&#30340;&#33258;&#21160;&#21270;&#23459;&#20256;&#26816;&#27979;&#24037;&#20855;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26816;&#27979;&#26032;&#38395;&#20013;&#30340;&#23459;&#20256;&#24182;&#25552;&#20379;&#20016;&#23500;&#35299;&#37322;&#65292;&#20197;&#28608;&#21457;&#26356;&#22810;&#25209;&#21028;&#24615;&#38405;&#35835;&#65292;&#23454;&#39564;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#65292;&#24378;&#35843;&#20102;&#35299;&#37322;&#23545;&#20110;&#22521;&#20859;&#25209;&#21028;&#24615;&#24605;&#32500;&#30340;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24403;&#20170;&#25968;&#23383;&#21270;&#26102;&#20195;&#65292;&#24555;&#36895;&#30340;&#26032;&#38395;&#28040;&#36153;&#21644;&#26085;&#30410;&#23545;&#23459;&#20256;&#30340;&#33030;&#24369;&#24615;&#25104;&#20026;&#29305;&#28857;&#65292;&#22521;&#20859;&#20844;&#27665;&#30340;&#25209;&#21028;&#24615;&#24605;&#32500;&#23545;&#20110;&#31283;&#23450;&#30340;&#27665;&#20027;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;ClarifAI&#30340;&#35774;&#35745;&#65292;&#36825;&#26159;&#19968;&#27454;&#26032;&#39062;&#30340;&#33258;&#21160;&#21270;&#23459;&#20256;&#26816;&#27979;&#24037;&#20855;&#65292;&#26088;&#22312;&#36890;&#36807;&#28608;&#27963;&#20998;&#26512;&#24615;&#24605;&#32500;&#27169;&#24335;&#65292;&#36981;&#24490;&#24247;&#26364;&#30340;&#35748;&#30693;&#21452;&#31995;&#32479;&#29702;&#35770;&#65292;&#25512;&#21160;&#35835;&#32773;&#26356;&#21152;&#25209;&#21028;&#24615;&#22320;&#28040;&#36153;&#26032;&#38395;&#12290;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;ClarifAI&#21487;&#20197;&#26816;&#27979;&#26032;&#38395;&#25991;&#31456;&#20013;&#30340;&#23459;&#20256;&#65292;&#24182;&#25552;&#20379;&#20016;&#23500;&#30340;&#32972;&#26223;&#35299;&#37322;&#65292;&#22686;&#24378;&#29992;&#25143;&#30340;&#29702;&#35299;&#21644;&#25209;&#21028;&#24615;&#24605;&#32500;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26377;&#19977;&#20010;&#26041;&#38754;&#65306;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;ClarifAI&#30340;&#35774;&#35745;&#65307;&#20854;&#27425;&#65292;&#22312;&#19968;&#39033;&#22312;&#32447;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#36825;&#19968;&#35774;&#35745;&#26377;&#25928;&#22320;&#40723;&#21169;&#26032;&#38395;&#35835;&#32773;&#26356;&#22810;&#22320;&#36827;&#34892;&#25209;&#21028;&#24615;&#38405;&#35835;&#65307;&#31532;&#19977;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#35299;&#37322;&#23545;&#20110;&#22521;&#20859;&#25209;&#21028;&#24615;&#24605;&#32500;&#30340;&#20215;&#20540;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#26082;&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#65292;&#21448;&#25552;&#20379;&#20102;&#23454;&#39564;&#32467;&#26524;&#25903;&#25745;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19135v1 Announce Type: cross  Abstract: In today's digital age, characterized by rapid news consumption and increasing vulnerability to propaganda, fostering citizens' critical thinking is crucial for stable democracies. This paper introduces the design of ClarifAI, a novel automated propaganda detection tool designed to nudge readers towards more critical news consumption by activating the analytical mode of thinking, following Kahneman's dual-system theory of cognition. Using Large Language Models, ClarifAI detects propaganda in news articles and provides context-rich explanations, enhancing users' understanding and critical thinking. Our contribution is threefold: first, we propose the design of ClarifAI; second, in an online experiment, we demonstrate that this design effectively encourages news readers to engage in more critical reading; and third, we emphasize the value of explanations for fostering critical thinking. The study thus offers both a practical tool and use
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#32508;&#36848;&#20102;&#20154;&#24037;&#26234;&#33021;&#22312;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#20013;&#30340;&#24212;&#29992;&#65292;&#23588;&#20854;&#20851;&#27880;&#20102;&#22312;&#31579;&#36873;&#21644;&#25552;&#21462;&#38454;&#27573;&#30340;&#21322;&#33258;&#21160;&#21270;&#36807;&#31243;&#12290;&#35813;&#30740;&#31350;&#20351;&#29992;&#19968;&#20010;&#21253;&#25324;&#20256;&#32479;&#29305;&#24449;&#21644;&#20154;&#24037;&#26234;&#33021;&#29305;&#24449;&#30340;&#26694;&#26550;&#26469;&#32771;&#23519;21&#20010;&#39046;&#20808;&#30340;&#25991;&#29486;&#32508;&#36848;&#24037;&#20855;&#65292;&#24182;&#20998;&#26512;&#20102;11&#20010;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#25991;&#29486;&#25628;&#32034;&#21644;&#23398;&#26415;&#20889;&#20316;&#36741;&#21161;&#30340;&#26368;&#26032;&#24037;&#20855;&#12290;&#26368;&#21518;&#65292;&#35770;&#25991;&#35752;&#35770;&#20102;&#35813;&#39046;&#22495;&#30340;&#24403;&#21069;&#36235;&#21183;&#12289;&#20027;&#35201;&#30740;&#31350;&#25361;&#25112;&#21644;&#21457;&#23637;&#26041;&#21521;&#12290;</title><link>https://arxiv.org/abs/2402.08565</link><description>&lt;p&gt;
&#25991;&#29486;&#32508;&#36848;&#20013;&#30340;&#20154;&#24037;&#26234;&#33021;&#65306;&#26426;&#36935;&#19982;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence for Literature Reviews: Opportunities and Challenges
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08565
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#32508;&#36848;&#20102;&#20154;&#24037;&#26234;&#33021;&#22312;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#20013;&#30340;&#24212;&#29992;&#65292;&#23588;&#20854;&#20851;&#27880;&#20102;&#22312;&#31579;&#36873;&#21644;&#25552;&#21462;&#38454;&#27573;&#30340;&#21322;&#33258;&#21160;&#21270;&#36807;&#31243;&#12290;&#35813;&#30740;&#31350;&#20351;&#29992;&#19968;&#20010;&#21253;&#25324;&#20256;&#32479;&#29305;&#24449;&#21644;&#20154;&#24037;&#26234;&#33021;&#29305;&#24449;&#30340;&#26694;&#26550;&#26469;&#32771;&#23519;21&#20010;&#39046;&#20808;&#30340;&#25991;&#29486;&#32508;&#36848;&#24037;&#20855;&#65292;&#24182;&#20998;&#26512;&#20102;11&#20010;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#25991;&#29486;&#25628;&#32034;&#21644;&#23398;&#26415;&#20889;&#20316;&#36741;&#21161;&#30340;&#26368;&#26032;&#24037;&#20855;&#12290;&#26368;&#21518;&#65292;&#35770;&#25991;&#35752;&#35770;&#20102;&#35813;&#39046;&#22495;&#30340;&#24403;&#21069;&#36235;&#21183;&#12289;&#20027;&#35201;&#30740;&#31350;&#25361;&#25112;&#21644;&#21457;&#23637;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20154;&#24037;&#26234;&#33021;&#22312;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#65288;SLR&#65289;&#20013;&#30340;&#24212;&#29992;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#32508;&#36848;&#12290;SLR&#26159;&#19968;&#31181;&#20005;&#35880;&#26377;&#24207;&#30340;&#26041;&#27861;&#35770;&#65292;&#29992;&#20110;&#35780;&#20272;&#21644;&#25972;&#21512;&#20851;&#20110;&#29305;&#23450;&#20027;&#39064;&#30340;&#20808;&#21069;&#30740;&#31350;&#12290;&#35768;&#22810;&#24037;&#20855;&#24050;&#34987;&#24320;&#21457;&#29992;&#20110;&#36741;&#21161;&#21644;&#37096;&#20998;&#33258;&#21160;&#21270;SLR&#36807;&#31243;&#12290;&#20154;&#24037;&#26234;&#33021;&#22312;&#36825;&#20010;&#39046;&#22495;&#30340;&#26085;&#30410;&#37325;&#35201;&#35282;&#33394;&#26174;&#31034;&#20102;&#20026;&#30740;&#31350;&#20154;&#21592;&#25552;&#20379;&#26356;&#26377;&#25928;&#25903;&#25345;&#30340;&#24040;&#22823;&#28508;&#21147;&#65292;&#26397;&#30528;&#25991;&#29486;&#32508;&#36848;&#30340;&#21322;&#33258;&#21160;&#21270;&#21019;&#24314;&#26041;&#21521;&#21457;&#23637;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#37325;&#28857;&#20851;&#27880;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#22312;SLR&#30340;&#21322;&#33258;&#21160;&#21270;&#20013;&#30340;&#24212;&#29992;&#65292;&#29305;&#21035;&#26159;&#22312;&#31579;&#36873;&#21644;&#25552;&#21462;&#38454;&#27573;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#23558;23&#20010;&#20256;&#32479;&#29305;&#24449;&#19982;11&#20010;&#20154;&#24037;&#26234;&#33021;&#29305;&#24449;&#30456;&#32467;&#21512;&#30340;&#26694;&#26550;&#65292;&#23545;21&#20010;&#39046;&#20808;&#30340;SLR&#24037;&#20855;&#36827;&#34892;&#20102;&#32771;&#23519;&#12290;&#25105;&#20204;&#36824;&#20998;&#26512;&#20102;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#25991;&#29486;&#25628;&#32034;&#21644;&#36741;&#21161;&#23398;&#26415;&#20889;&#20316;&#30340;11&#20010;&#26368;&#26032;&#24037;&#20855;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#35752;&#35770;&#20102;&#35813;&#39046;&#22495;&#30340;&#24403;&#21069;&#36235;&#21183;&#65292;&#27010;&#36848;&#20102;&#20027;&#35201;&#30340;&#30740;&#31350;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#21457;&#23637;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
This manuscript presents a comprehensive review of the use of Artificial Intelligence (AI) in Systematic Literature Reviews (SLRs). A SLR is a rigorous and organised methodology that assesses and integrates previous research on a given topic. Numerous tools have been developed to assist and partially automate the SLR process. The increasing role of AI in this field shows great potential in providing more effective support for researchers, moving towards the semi-automatic creation of literature reviews. Our study focuses on how AI techniques are applied in the semi-automation of SLRs, specifically in the screening and extraction phases. We examine 21 leading SLR tools using a framework that combines 23 traditional features with 11 AI features. We also analyse 11 recent tools that leverage large language models for searching the literature and assisting academic writing. Finally, the paper discusses current trends in the field, outlines key research challenges, and suggests directions f
&lt;/p&gt;</description></item></channel></rss>