<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#23545;&#20154;&#31867;&#22996;&#25176;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#26174;&#33879;&#25552;&#39640;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#22242;&#38431;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#22996;&#25176;&#34892;&#20026;&#22312;&#19981;&#21516;&#19978;&#19979;&#25991;&#20449;&#24687;&#19979;&#21457;&#29983;&#26174;&#33879;&#21464;&#21270;&#12290;&#36825;&#39033;&#30740;&#31350;&#25512;&#36827;&#20102;&#23545;&#20154;&#24037;&#26234;&#33021;&#22996;&#25176;&#20013;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#35774;&#35745;&#26356;&#26377;&#25928;&#30340;&#21327;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2401.04729</link><description>&lt;p&gt;
&#20851;&#20110;&#19978;&#19979;&#25991;&#20449;&#24687;&#23545;&#20154;&#31867;&#22312;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#30340;&#22996;&#25176;&#34892;&#20026;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
On the Effect of Contextual Information on Human Delegation Behavior in Human-AI collaboration. (arXiv:2401.04729v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04729
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#23545;&#20154;&#31867;&#22996;&#25176;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#26174;&#33879;&#25552;&#39640;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#22242;&#38431;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#22996;&#25176;&#34892;&#20026;&#22312;&#19981;&#21516;&#19978;&#19979;&#25991;&#20449;&#24687;&#19979;&#21457;&#29983;&#26174;&#33879;&#21464;&#21270;&#12290;&#36825;&#39033;&#30740;&#31350;&#25512;&#36827;&#20102;&#23545;&#20154;&#24037;&#26234;&#33021;&#22996;&#25176;&#20013;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#35774;&#35745;&#26356;&#26377;&#25928;&#30340;&#21327;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#19981;&#26029;&#22686;&#24378;&#33021;&#21147;&#20026;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#30340;&#21327;&#20316;&#24102;&#26469;&#20102;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#21033;&#29992;&#29616;&#26377;&#30340;&#20114;&#34917;&#33021;&#21147;&#65292;&#35753;&#20154;&#20204;&#23558;&#20010;&#21035;&#23454;&#20363;&#22996;&#25176;&#32473;&#20154;&#24037;&#26234;&#33021;&#26159;&#19968;&#31181;&#26377;&#21069;&#26223;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#20351;&#20154;&#20204;&#26377;&#25928;&#22320;&#22996;&#25176;&#23454;&#20363;&#38656;&#35201;&#20182;&#20204;&#35780;&#20272;&#33258;&#24049;&#21644;&#20154;&#24037;&#26234;&#33021;&#22312;&#32473;&#23450;&#20219;&#21153;&#30340;&#32972;&#26223;&#19979;&#30340;&#33021;&#21147;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#20154;&#31867;&#20915;&#23450;&#23558;&#23454;&#20363;&#22996;&#25176;&#32473;&#20154;&#24037;&#26234;&#33021;&#26102;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#30340;&#25928;&#26524;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#26174;&#33879;&#25552;&#39640;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#22242;&#38431;&#30340;&#34920;&#29616;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#24403;&#21442;&#19982;&#32773;&#25509;&#25910;&#21040;&#19981;&#21516;&#31867;&#22411;&#30340;&#19978;&#19979;&#25991;&#20449;&#24687;&#26102;&#65292;&#22996;&#25176;&#34892;&#20026;&#20250;&#21457;&#29983;&#26174;&#33879;&#21464;&#21270;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#36825;&#39033;&#30740;&#31350;&#25512;&#36827;&#20102;&#20154;&#24037;&#26234;&#33021;&#22996;&#25176;&#20013;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#35774;&#35745;&#26356;&#26377;&#25928;&#30340;&#21327;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#21487;&#34892;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
The constantly increasing capabilities of artificial intelligence (AI) open new possibilities for human-AI collaboration. One promising approach to leverage existing complementary capabilities is allowing humans to delegate individual instances to the AI. However, enabling humans to delegate instances effectively requires them to assess both their own and the AI's capabilities in the context of the given task. In this work, we explore the effects of providing contextual information on human decisions to delegate instances to an AI. We find that providing participants with contextual information significantly improves the human-AI team performance. Additionally, we show that the delegation behavior changes significantly when participants receive varying types of contextual information. Overall, this research advances the understanding of human-AI interaction in human delegation and provides actionable insights for designing more effective collaborative systems.
&lt;/p&gt;</description></item></channel></rss>