<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;FEDI&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#29992;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#12289;&#29992;&#25143;&#24773;&#32490;&#21644;&#38544;&#21547;&#21453;&#39304;&#23545;&#20219;&#21153;&#23548;&#21521;&#30340;&#25991;&#26723;&#23545;&#35805;&#36827;&#34892;&#27880;&#37322;&#30340;&#33521;&#25991;&#23545;&#35805;&#25968;&#25454;&#38598;&#65292;&#23454;&#39564;&#35777;&#26126;&#36825;&#20123;&#25968;&#25454;&#26377;&#28508;&#21147;&#25913;&#21892;&#20219;&#21153;&#23436;&#25104;&#24773;&#20917;&#12289;&#29983;&#25104;&#21709;&#24212;&#30340;&#20107;&#23454;&#19968;&#33268;&#24615;&#21644;&#29992;&#25143;&#25509;&#21463;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2401.09248</link><description>&lt;p&gt;
&#20174;&#24773;&#32490;&#12289;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#21644;&#38544;&#21547;&#29992;&#25143;&#21453;&#39304;&#20013;&#23398;&#20064;&#20219;&#21153;&#23548;&#21521;&#30340;&#25991;&#26723;&#23545;&#35805;
&lt;/p&gt;
&lt;p&gt;
Learning from Emotions, Demographic Information and Implicit User Feedback in Task-Oriented Document-Grounded Dialogues. (arXiv:2401.09248v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09248
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;FEDI&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#29992;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#12289;&#29992;&#25143;&#24773;&#32490;&#21644;&#38544;&#21547;&#21453;&#39304;&#23545;&#20219;&#21153;&#23548;&#21521;&#30340;&#25991;&#26723;&#23545;&#35805;&#36827;&#34892;&#27880;&#37322;&#30340;&#33521;&#25991;&#23545;&#35805;&#25968;&#25454;&#38598;&#65292;&#23454;&#39564;&#35777;&#26126;&#36825;&#20123;&#25968;&#25454;&#26377;&#28508;&#21147;&#25913;&#21892;&#20219;&#21153;&#23436;&#25104;&#24773;&#20917;&#12289;&#29983;&#25104;&#21709;&#24212;&#30340;&#20107;&#23454;&#19968;&#33268;&#24615;&#21644;&#29992;&#25143;&#25509;&#21463;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20219;&#21153;&#23548;&#21521;&#21644;&#25991;&#26723;&#23545;&#35805;&#31995;&#32479;&#30340;&#25104;&#21151;&#21462;&#20915;&#20110;&#29992;&#25143;&#25509;&#21463;&#21644;&#20139;&#21463;&#20351;&#29992;&#23427;&#20204;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#20154;&#26426;&#20132;&#20114;&#39046;&#22495;&#30340;&#26368;&#26032;&#30740;&#31350;&#34920;&#26126;&#65292;&#32771;&#34385;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#12289;&#29992;&#25143;&#24773;&#32490;&#24182;&#20174;&#20182;&#20204;&#30340;&#35805;&#35821;&#20013;&#23398;&#20064;&#38544;&#21547;&#21453;&#39304;&#30340;&#32452;&#21512;&#23588;&#20026;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#21457;&#29616;&#23578;&#26410;&#36716;&#31227;&#21040;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#39046;&#22495;&#65292;&#36825;&#20123;&#25968;&#25454;&#20027;&#35201;&#26159;&#20998;&#21035;&#30740;&#31350;&#30340;&#12290;&#22240;&#27492;&#65292;&#30446;&#21069;&#27809;&#26377;&#36275;&#22815;&#27880;&#37322;&#30340;&#25968;&#25454;&#38598;&#21487;&#29992;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;FEDI&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#29992;&#20154;&#21475;&#32479;&#35745;&#20449;&#24687;&#12289;&#29992;&#25143;&#24773;&#32490;&#21644;&#38544;&#21547;&#21453;&#39304;&#23545;&#20219;&#21153;&#23548;&#21521;&#30340;&#25991;&#26723;&#23545;&#35805;&#36827;&#34892;&#27880;&#37322;&#30340;&#33521;&#25991;&#23545;&#35805;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#20351;&#29992;FLAN-T5&#12289;GPT-2&#21644;LLaMA-2&#36827;&#34892;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;&#36825;&#20123;&#25968;&#25454;&#26377;&#28508;&#21147;&#25913;&#21892;&#20219;&#21153;&#23436;&#25104;&#24773;&#20917;&#12289;&#29983;&#25104;&#21709;&#24212;&#30340;&#20107;&#23454;&#19968;&#33268;&#24615;&#21644;&#29992;&#25143;&#25509;&#21463;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
The success of task-oriented and document-grounded dialogue systems depends on users accepting and enjoying using them. To achieve this, recently published work in the field of Human-Computer Interaction suggests that the combination of considering demographic information, user emotions and learning from the implicit feedback in their utterances, is particularly important. However, these findings have not yet been transferred to the field of Natural Language Processing, where these data are primarily studied separately. Accordingly, no sufficiently annotated dataset is available. To address this gap, we introduce FEDI, the first English dialogue dataset for task-oriented document-grounded dialogues annotated with demographic information, user emotions and implicit feedback. Our experiments with FLAN-T5, GPT-2 and LLaMA-2 show that these data have the potential to improve task completion and the factual consistency of the generated responses and user acceptance.
&lt;/p&gt;</description></item></channel></rss>