<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#36890;&#36807;&#32473;&#29616;&#20195;&#20154;&#24037;&#26234;&#33021;&#27169;&#22411;&#28155;&#21152;&#33258;&#21160;&#21270;&#20154;&#31867;&#24418;&#24335;&#30340;&#35777;&#26126;&#26816;&#26597;&#22120;&#65292;&#25105;&#20204;&#21487;&#20197;&#20174;&#23427;&#20204;&#37027;&#37324;&#33719;&#21462;&#20808;&#39564;&#25968;&#23398;&#30693;&#35782;&#65292;&#21363;&#20351;&#36825;&#20123;&#26426;&#22120;&#23436;&#20840;&#23545;&#25105;&#20204;&#19981;&#36879;&#26126;&#12290;</title><link>https://arxiv.org/abs/2403.15437</link><description>&lt;p&gt;
&#22312;&#35745;&#31639;&#19981;&#36879;&#26126;&#26102;&#20195;&#30340;&#20808;&#39564;&#30693;&#35782;&#65306;&#20154;&#24037;&#26234;&#33021;&#22312;&#25968;&#23398;&#21457;&#29616;&#20013;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Apriori Knowledge in an Era of Computational Opacity: The Role of AI in Mathematical Discovery
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15437
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#32473;&#29616;&#20195;&#20154;&#24037;&#26234;&#33021;&#27169;&#22411;&#28155;&#21152;&#33258;&#21160;&#21270;&#20154;&#31867;&#24418;&#24335;&#30340;&#35777;&#26126;&#26816;&#26597;&#22120;&#65292;&#25105;&#20204;&#21487;&#20197;&#20174;&#23427;&#20204;&#37027;&#37324;&#33719;&#21462;&#20808;&#39564;&#25968;&#23398;&#30693;&#35782;&#65292;&#21363;&#20351;&#36825;&#20123;&#26426;&#22120;&#23436;&#20840;&#23545;&#25105;&#20204;&#19981;&#36879;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#31639;&#22312;&#24403;&#20195;&#25968;&#23398;&#20013;&#36215;&#30528;&#26680;&#24515;&#20316;&#29992;&#12290;&#35768;&#22810;&#20154;&#35748;&#20026;&#65292;&#25105;&#20204;&#21487;&#20197;&#20174;Appel&#21644;Haken&#30340;&#31243;&#24207;&#20013;&#33719;&#24471;&#22235;&#33394;&#23450;&#29702;&#30340;&#30495;&#27491;&#25968;&#23398;&#30693;&#35782;&#65292;&#22240;&#20026;&#36825;&#21482;&#26159;&#19968;&#31181;&#37325;&#22797;&#24212;&#29992;&#20154;&#31867;&#24418;&#24335;&#30340;&#25968;&#23398;&#25512;&#29702;&#12290;&#28982;&#32780;&#65292;&#30456;&#27604;&#20043;&#19979;&#65292;&#29616;&#20195;LLMs / DNNs&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#23545;&#25105;&#20204;&#19981;&#36879;&#26126;&#65292;&#36825;&#22312;&#20174;&#23427;&#20204;&#37027;&#37324;&#33719;&#21462;&#25968;&#23398;&#30693;&#35782;&#26041;&#38754;&#20135;&#29983;&#20102;&#38556;&#30861;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#22914;&#26524;&#32473;&#36825;&#20123;&#26426;&#22120;&#28155;&#21152;&#33258;&#21160;&#21270;&#20154;&#31867;&#24418;&#24335;&#30340;&#35777;&#26126;&#26816;&#26597;&#22120;&#65292;&#37027;&#20040;&#25105;&#20204;&#21487;&#20197;&#20174;&#20013;&#33719;&#24471;&#20808;&#39564;&#25968;&#23398;&#30693;&#35782;&#65292;&#21363;&#20351;&#21407;&#22987;&#26426;&#22120;&#23545;&#25105;&#20204;&#23436;&#20840;&#19981;&#36879;&#26126;&#65292;&#23427;&#20204;&#36755;&#20986;&#30340;&#35777;&#26126;&#20063;&#26080;&#27861;&#30001;&#20154;&#31867;&#26597;&#30475;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15437v1 Announce Type: new  Abstract: Computation is central to contemporary mathematics. Many accept that we can acquire genuine mathematical knowledge of the Four Color Theorem from Appel and Haken's program insofar as it is simply a repetitive application of human forms of mathematical reasoning. Modern LLMs / DNNs are, by contrast, opaque to us in significant ways, and this creates obstacles in obtaining mathematical knowledge from them. We argue, however, that if a proof-checker automating human forms of proof-checking is attached to such machines, then we can obtain apriori mathematical knowledge from them, even though the original machines are entirely opaque to us and the proofs they output are not human-surveyable.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#23545;&#20849;&#24773;&#26816;&#27979;&#39046;&#22495;&#30340;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#36827;&#34892;&#20102;&#32508;&#36848;&#21644;&#20998;&#26512;&#65292;&#21253;&#25324;&#25991;&#26412;&#12289;&#35270;&#21548;&#12289;&#38899;&#39057;&#21644;&#29983;&#29702;&#20449;&#21495;&#22235;&#31181;&#36755;&#20837;&#27169;&#24577;&#30340;&#22788;&#29702;&#21644;&#32593;&#32476;&#35774;&#35745;&#65292;&#20197;&#21450;&#35780;&#20272;&#21327;&#35758;&#21644;&#25968;&#25454;&#38598;&#30340;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2311.00721</link><description>&lt;p&gt;
&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#22312;&#25991;&#26412;&#12289;&#35270;&#21548;&#12289;&#38899;&#39057;&#25110;&#29983;&#29702;&#20449;&#21495;&#19978;&#36827;&#34892;&#20849;&#24773;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Empathy Detection Using Machine Learning on Text, Audiovisual, Audio or Physiological Signals. (arXiv:2311.00721v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00721
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#23545;&#20849;&#24773;&#26816;&#27979;&#39046;&#22495;&#30340;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#36827;&#34892;&#20102;&#32508;&#36848;&#21644;&#20998;&#26512;&#65292;&#21253;&#25324;&#25991;&#26412;&#12289;&#35270;&#21548;&#12289;&#38899;&#39057;&#21644;&#29983;&#29702;&#20449;&#21495;&#22235;&#31181;&#36755;&#20837;&#27169;&#24577;&#30340;&#22788;&#29702;&#21644;&#32593;&#32476;&#35774;&#35745;&#65292;&#20197;&#21450;&#35780;&#20272;&#21327;&#35758;&#21644;&#25968;&#25454;&#38598;&#30340;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#24773;&#26159;&#19968;&#20010;&#31038;&#20132;&#25216;&#33021;&#65292;&#34920;&#26126;&#19968;&#20010;&#20010;&#20307;&#29702;&#35299;&#20182;&#20154;&#30340;&#33021;&#21147;&#12290;&#36817;&#24180;&#26469;&#65292;&#20849;&#24773;&#24341;&#36215;&#20102;&#21253;&#25324;&#24773;&#24863;&#35745;&#31639;&#12289;&#35748;&#30693;&#31185;&#23398;&#21644;&#24515;&#29702;&#23398;&#22312;&#20869;&#30340;&#21508;&#20010;&#23398;&#31185;&#30340;&#20851;&#27880;&#12290;&#20849;&#24773;&#26159;&#19968;&#20010;&#20381;&#36182;&#20110;&#19978;&#19979;&#25991;&#30340;&#26415;&#35821;&#65292;&#22240;&#27492;&#26816;&#27979;&#25110;&#35782;&#21035;&#20849;&#24773;&#22312;&#31038;&#20250;&#12289;&#21307;&#30103;&#21644;&#25945;&#32946;&#31561;&#39046;&#22495;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#12290;&#23613;&#31649;&#20849;&#24773;&#26816;&#27979;&#39046;&#22495;&#28041;&#21450;&#33539;&#22260;&#24191;&#27867;&#19988;&#26377;&#37325;&#21472;&#65292;&#20294;&#20174;&#25972;&#20307;&#25991;&#29486;&#35282;&#24230;&#26469;&#30475;&#65292;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#30340;&#20849;&#24773;&#26816;&#27979;&#30740;&#31350;&#20173;&#28982;&#30456;&#23545;&#36739;&#23569;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#31995;&#32479;&#25910;&#38598;&#21644;&#31579;&#36873;&#20102;&#26469;&#33258;10&#20010;&#30693;&#21517;&#25968;&#25454;&#24211;&#30340;801&#31687;&#35770;&#25991;&#65292;&#24182;&#20998;&#26512;&#20102;&#36873;&#23450;&#30340;54&#31687;&#35770;&#25991;&#12290;&#25105;&#20204;&#26681;&#25454;&#20849;&#24773;&#26816;&#27979;&#31995;&#32479;&#30340;&#36755;&#20837;&#27169;&#24577;&#65292;&#21363;&#25991;&#26412;&#12289;&#35270;&#21548;&#12289;&#38899;&#39057;&#21644;&#29983;&#29702;&#20449;&#21495;&#65292;&#23545;&#35770;&#25991;&#36827;&#34892;&#20998;&#32452;&#12290;&#25105;&#20204;&#20998;&#21035;&#30740;&#31350;&#20102;&#29305;&#23450;&#27169;&#24577;&#30340;&#39044;&#22788;&#29702;&#21644;&#32593;&#32476;&#26550;&#26500;&#35774;&#35745;&#21327;&#35758;&#12289;&#24120;&#35265;&#25968;&#25454;&#38598;&#30340;&#25551;&#36848;&#21644;&#21487;&#29992;&#24615;&#35814;&#24773;&#65292;&#20197;&#21450;&#35780;&#20272;&#21327;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
Empathy is a social skill that indicates an individual's ability to understand others. Over the past few years, empathy has drawn attention from various disciplines, including but not limited to Affective Computing, Cognitive Science and Psychology. Empathy is a context-dependent term; thus, detecting or recognising empathy has potential applications in society, healthcare and education. Despite being a broad and overlapping topic, the avenue of empathy detection studies leveraging Machine Learning remains underexplored from a holistic literature perspective. To this end, we systematically collect and screen 801 papers from 10 well-known databases and analyse the selected 54 papers. We group the papers based on input modalities of empathy detection systems, i.e., text, audiovisual, audio and physiological signals. We examine modality-specific pre-processing and network architecture design protocols, popular dataset descriptions and availability details, and evaluation protocols. We fur
&lt;/p&gt;</description></item></channel></rss>