<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#20013;&#20107;&#23454;&#30693;&#35782;&#30340;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#27169;&#22411;&#22823;&#23567;&#12289;&#35821;&#35328;&#37197;&#23545;&#31561;&#22240;&#32032;&#21457;&#29616;&#20102;&#24433;&#21709;&#19968;&#33268;&#24615;&#30340;&#22240;&#32032;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22686;&#21152;&#27169;&#22411;&#22823;&#23567;&#21487;&#20197;&#25552;&#39640;&#20934;&#30830;&#24615;&#65292;&#20294;&#19981;&#20250;&#25913;&#21892;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.10378</link><description>&lt;p&gt;
&#36328;&#35821;&#35328;&#22810;&#35821;&#35328;&#27169;&#22411;&#20013;&#20107;&#23454;&#30693;&#35782;&#30340;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;
&lt;/p&gt;
&lt;p&gt;
Cross-Lingual Consistency of Factual Knowledge in Multilingual Language Models. (arXiv:2310.10378v2 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10378
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#20013;&#20107;&#23454;&#30693;&#35782;&#30340;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#27169;&#22411;&#22823;&#23567;&#12289;&#35821;&#35328;&#37197;&#23545;&#31561;&#22240;&#32032;&#21457;&#29616;&#20102;&#24433;&#21709;&#19968;&#33268;&#24615;&#30340;&#22240;&#32032;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22686;&#21152;&#27169;&#22411;&#22823;&#23567;&#21487;&#20197;&#25552;&#39640;&#20934;&#30830;&#24615;&#65292;&#20294;&#19981;&#20250;&#25913;&#21892;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#35821;&#35328;&#22823;&#35268;&#27169;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#65288;PLM&#65289;&#26174;&#31034;&#23384;&#20648;&#20102;&#22823;&#37327;&#30340;&#20107;&#23454;&#30693;&#35782;&#65292;&#20294;&#22312;&#19981;&#21516;&#35821;&#35328;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#30340;&#21464;&#21270;&#12290;&#20026;&#20102;&#30830;&#20445;&#19981;&#21516;&#35821;&#35328;&#32972;&#26223;&#30340;&#29992;&#25143;&#20174;&#21516;&#19968;&#20010;&#27169;&#22411;&#20013;&#33719;&#24471;&#19968;&#33268;&#30340;&#21453;&#39304;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21508;&#31181;&#22810;&#35821;&#35328;PLM&#20013;&#20107;&#23454;&#30693;&#35782;&#30340;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;&#65288;CLC&#65289;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25490;&#24207;&#30340;&#19968;&#33268;&#24615;&#65288;RankC&#65289;&#24230;&#37327;&#65292;&#29992;&#20110;&#29420;&#31435;&#20110;&#20934;&#30830;&#24615;&#35780;&#20272;&#36328;&#35821;&#35328;&#38388;&#30340;&#30693;&#35782;&#19968;&#33268;&#24615;&#12290;&#21033;&#29992;&#36825;&#20010;&#24230;&#37327;&#26041;&#27861;&#65292;&#25105;&#20204;&#23545;&#20915;&#23450;CLC&#30340;&#22240;&#32032;&#36827;&#34892;&#20102;&#28145;&#20837;&#20998;&#26512;&#65292;&#21253;&#25324;&#27169;&#22411;&#23618;&#38754;&#21644;&#35821;&#35328;&#23545;&#23618;&#38754;&#12290;&#22312;&#20854;&#20182;&#32467;&#26524;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#22686;&#21152;&#27169;&#22411;&#22823;&#23567;&#21487;&#20197;&#25552;&#39640;&#22823;&#22810;&#25968;&#35821;&#35328;&#20013;&#30340;&#20107;&#23454;&#25506;&#27979;&#20934;&#30830;&#24615;&#65292;&#20294;&#19981;&#33021;&#25913;&#21892;&#36328;&#35821;&#35328;&#19968;&#33268;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#27169;&#22411;&#32534;&#36753;&#22312;PLMs&#20013;&#25554;&#20837;&#26032;&#30340;&#20107;&#23454;&#20851;&#32852;&#36827;&#34892;&#20102;&#19968;&#20010;CLC&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;&#23545;&#19968;&#23567;&#37096;&#20998;&#20107;&#23454;&#36827;&#34892;&#20102;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multilingual large-scale Pretrained Language Models (PLMs) have been shown to store considerable amounts of factual knowledge, but large variations are observed across languages. With the ultimate goal of ensuring that users with different language backgrounds obtain consistent feedback from the same model, we study the cross-lingual consistency (CLC) of factual knowledge in various multilingual PLMs. To this end, we propose a Ranking-based Consistency (RankC) metric to evaluate knowledge consistency across languages independently from accuracy. Using this metric, we conduct an in-depth analysis of the determining factors for CLC, both at model level and at language-pair level. Among other results, we find that increasing model size leads to higher factual probing accuracy in most languages, but does not improve cross-lingual consistency. Finally, we conduct a case study on CLC when new factual associations are inserted in the PLMs via model editing. Results on a small sample of facts 
&lt;/p&gt;</description></item><item><title>PlanFitting&#26159;&#19968;&#20010;&#23545;&#35805;&#22411;&#20154;&#24037;&#26234;&#33021;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#29983;&#25104;&#33021;&#21147;&#24110;&#21161;&#29992;&#25143;&#23450;&#21046;&#20010;&#24615;&#21270;&#30340;&#36816;&#21160;&#35745;&#21010;&#65292;&#24182;&#22312;&#29992;&#25143;&#30740;&#31350;&#20013;&#35777;&#26126;&#20102;&#23427;&#29983;&#25104;&#20010;&#24615;&#21270;&#12289;&#21487;&#25805;&#20316;&#21644;&#26377;&#25454;&#21487;&#20381;&#30340;&#36816;&#21160;&#35745;&#21010;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.12555</link><description>&lt;p&gt;
PlanFitting&#65306;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23450;&#21046;&#20010;&#24615;&#21270;&#30340;&#36816;&#21160;&#35745;&#21010;
&lt;/p&gt;
&lt;p&gt;
PlanFitting: Tailoring Personalized Exercise Plans with Large Language Models. (arXiv:2309.12555v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12555
&lt;/p&gt;
&lt;p&gt;
PlanFitting&#26159;&#19968;&#20010;&#23545;&#35805;&#22411;&#20154;&#24037;&#26234;&#33021;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#29983;&#25104;&#33021;&#21147;&#24110;&#21161;&#29992;&#25143;&#23450;&#21046;&#20010;&#24615;&#21270;&#30340;&#36816;&#21160;&#35745;&#21010;&#65292;&#24182;&#22312;&#29992;&#25143;&#30740;&#31350;&#20013;&#35777;&#26126;&#20102;&#23427;&#29983;&#25104;&#20010;&#24615;&#21270;&#12289;&#21487;&#25805;&#20316;&#21644;&#26377;&#25454;&#21487;&#20381;&#30340;&#36816;&#21160;&#35745;&#21010;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20010;&#24615;&#21270;&#30340;&#36816;&#21160;&#35745;&#21010;&#23545;&#20110;&#30830;&#20445;&#36275;&#22815;&#30340;&#20307;&#32946;&#27963;&#21160;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#30001;&#20110;&#20154;&#20204;&#30340;&#22797;&#26434;&#26085;&#31243;&#21644;&#32771;&#34385;&#22240;&#32032;&#20197;&#21450;&#35745;&#21010;&#30340;&#21019;&#24314;&#36890;&#24120;&#38656;&#35201;&#19982;&#19987;&#23478;&#30340;&#21453;&#22797;&#27807;&#36890;&#65292;&#36825;&#19968;&#36807;&#31243;&#21464;&#24471;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;PlanFitting&#65292;&#23427;&#26159;&#19968;&#20010;&#23545;&#35805;&#22411;&#20154;&#24037;&#26234;&#33021;&#65292;&#21487;&#20197;&#36741;&#21161;&#20010;&#24615;&#21270;&#30340;&#36816;&#21160;&#35745;&#21010;&#12290;&#36890;&#36807;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#29983;&#25104;&#33021;&#21147;&#65292;PlanFitting&#20351;&#29992;&#25143;&#33021;&#22815;&#29992;&#33258;&#28982;&#35821;&#35328;&#25551;&#36848;&#21508;&#31181;&#32422;&#26463;&#21644;&#26597;&#35810;&#65292;&#20174;&#32780;&#20415;&#20110;&#21019;&#24314;&#21644;&#20248;&#21270;&#36866;&#21512;&#20854;&#29305;&#23450;&#24773;&#20917;&#30340;&#27599;&#21608;&#36816;&#21160;&#35745;&#21010;&#65292;&#24182;&#20445;&#25345;&#22522;&#26412;&#21407;&#21017;&#30340;&#25166;&#26681;&#12290;&#36890;&#36807;&#19968;&#39033;&#29992;&#25143;&#30740;&#31350;&#65292;&#21442;&#19982;&#32773;&#65288;N=18&#65289;&#20351;&#29992;PlanFitting&#29983;&#25104;&#20010;&#24615;&#21270;&#30340;&#36816;&#21160;&#35745;&#21010;&#65292;&#32780;&#19987;&#23478;&#35268;&#21010;&#32773;&#65288;N=3&#65289;&#23545;&#36825;&#20123;&#35745;&#21010;&#36827;&#34892;&#35780;&#20272;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;PlanFitting&#22312;&#29983;&#25104;&#20010;&#24615;&#21270;&#12289;&#21487;&#25805;&#20316;&#21644;&#26377;&#25454;&#21487;&#20381;&#30340;&#36816;&#21160;&#35745;&#21010;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;AI&#21161;&#25163;&#22312;&#21019;&#24314;&#35745;&#21010;&#26041;&#38754;&#30340;&#26410;&#26469;&#35774;&#35745;&#26426;&#36935;&#12290;
&lt;/p&gt;
&lt;p&gt;
A personally tailored exercise regimen is crucial to ensuring sufficient physical activities, yet challenging to create as people have complex schedules and considerations and the creation of plans often requires iterations with experts. We present PlanFitting, a conversational AI that assists in personalized exercise planning. Leveraging generative capabilities of large language models, PlanFitting enables users to describe various constraints and queries in natural language, thereby facilitating the creation and refinement of their weekly exercise plan to suit their specific circumstances while staying grounded in foundational principles. Through a user study where participants (N=18) generated a personalized exercise plan using PlanFitting and expert planners (N=3) evaluated these plans, we identified the potential of PlanFitting in generating personalized, actionable, and evidence-based exercise plans. We discuss future design opportunities for AI assistants in creating plans that 
&lt;/p&gt;</description></item></channel></rss>