<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#26159;&#39318;&#20010;&#22823;&#35268;&#27169;&#30340;&#35760;&#24518;&#24615;&#30740;&#31350;&#65292;&#21457;&#29616;&#24191;&#21578;&#30340;&#38271;&#26399;&#35760;&#24518;&#24615;&#23545;&#20110;&#24066;&#22330;&#33829;&#38144;&#38750;&#24120;&#37325;&#35201;&#65292;&#20294;&#22312;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#20013;&#19968;&#30452;&#32570;&#20047;&#30456;&#20851;&#30740;&#31350;&#12290;&#36890;&#36807;&#20998;&#26512;&#22823;&#37327;&#21442;&#19982;&#32773;&#21644;&#24191;&#21578;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#20851;&#20110;&#20160;&#20040;&#20351;&#24191;&#21578;&#35760;&#24518;&#28145;&#21051;&#30340;&#26377;&#36259;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2309.00378</link><description>&lt;p&gt;
&#24191;&#21578;&#30340;&#38271;&#26399;&#35760;&#24518;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Long-Term Memorability On Advertisements. (arXiv:2309.00378v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00378
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26159;&#39318;&#20010;&#22823;&#35268;&#27169;&#30340;&#35760;&#24518;&#24615;&#30740;&#31350;&#65292;&#21457;&#29616;&#24191;&#21578;&#30340;&#38271;&#26399;&#35760;&#24518;&#24615;&#23545;&#20110;&#24066;&#22330;&#33829;&#38144;&#38750;&#24120;&#37325;&#35201;&#65292;&#20294;&#22312;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#20013;&#19968;&#30452;&#32570;&#20047;&#30456;&#20851;&#30740;&#31350;&#12290;&#36890;&#36807;&#20998;&#26512;&#22823;&#37327;&#21442;&#19982;&#32773;&#21644;&#24191;&#21578;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#20851;&#20110;&#20160;&#20040;&#20351;&#24191;&#21578;&#35760;&#24518;&#28145;&#21051;&#30340;&#26377;&#36259;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#33829;&#38144;&#20154;&#21592;&#33457;&#36153;&#25968;&#21313;&#20159;&#32654;&#20803;&#22312;&#24191;&#21578;&#19978;&#65292;&#20294;&#26159;&#25237;&#20837;&#21040;&#24191;&#21578;&#19978;&#30340;&#37329;&#38065;&#33021;&#36215;&#22810;&#22823;&#20316;&#29992;&#21602;&#65311;&#24403;&#39038;&#23458;&#22312;&#36141;&#20080;&#26102;&#26080;&#27861;&#36776;&#35748;&#20986;&#20182;&#20204;&#30475;&#36807;&#30340;&#21697;&#29260;&#30340;&#35805;&#65292;&#33457;&#22312;&#24191;&#21578;&#19978;&#30340;&#38065;&#22522;&#26412;&#19978;&#23601;&#34987;&#28010;&#36153;&#20102;&#12290;&#23613;&#31649;&#22312;&#33829;&#38144;&#20013;&#24456;&#37325;&#35201;&#65292;&#20294;&#36804;&#20170;&#20026;&#27490;&#65292;&#22312;&#26426;&#22120;&#23398;&#20064;&#30340;&#25991;&#29486;&#20013;&#36824;&#27809;&#26377;&#20851;&#20110;&#24191;&#21578;&#35760;&#24518;&#21147;&#30340;&#30740;&#31350;&#12290;&#22823;&#22810;&#25968;&#30740;&#31350;&#37117;&#26159;&#23545;&#29305;&#23450;&#20869;&#23481;&#31867;&#22411;&#65288;&#22914;&#29289;&#20307;&#21644;&#21160;&#20316;&#35270;&#39057;&#65289;&#36827;&#34892;&#30701;&#26399;&#22238;&#24518;&#65288;&lt;5&#20998;&#38047;&#65289;&#30340;&#30740;&#31350;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#24191;&#21578;&#34892;&#19994;&#21482;&#20851;&#24515;&#38271;&#26399;&#35760;&#24518;&#65288;&#20960;&#20010;&#23567;&#26102;&#25110;&#26356;&#38271;&#26102;&#38388;&#65289;&#65292;&#32780;&#19988;&#24191;&#21578;&#20960;&#20046;&#24635;&#26159;&#39640;&#24230;&#22810;&#27169;&#24335;&#21270;&#65292;&#36890;&#36807;&#19981;&#21516;&#30340;&#24418;&#24335;&#65288;&#25991;&#26412;&#12289;&#22270;&#20687;&#21644;&#35270;&#39057;&#65289;&#26469;&#35762;&#25925;&#20107;&#12290;&#22522;&#20110;&#36825;&#19968;&#21160;&#26426;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#39318;&#20010;&#22823;&#35268;&#27169;&#35760;&#24518;&#24615;&#30740;&#31350;&#65292;&#20849;&#26377;1203&#21517;&#21442;&#19982;&#32773;&#21644;2205&#20010;&#24191;&#21578;&#28085;&#30422;&#20102;276&#20010;&#21697;&#29260;&#12290;&#22312;&#19981;&#21516;&#21442;&#19982;&#32773;&#23376;&#32676;&#20307;&#21644;&#24191;&#21578;&#31867;&#22411;&#19978;&#36827;&#34892;&#32479;&#35745;&#27979;&#35797;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#35768;&#22810;&#26377;&#20851;&#20160;&#20040;&#20351;&#24191;&#21578;&#38590;&#24536;&#30340;&#26377;&#36259;&#35265;&#35299;-&#26080;&#35770;&#26159;&#20869;&#23481;&#36824;&#26159;
&lt;/p&gt;
&lt;p&gt;
Marketers spend billions of dollars on advertisements but to what end? At the purchase time, if customers cannot recognize a brand for which they saw an ad, the money spent on the ad is essentially wasted. Despite its importance in marketing, until now, there has been no study on the memorability of ads in the ML literature. Most studies have been conducted on short-term recall (&lt;5 mins) on specific content types like object and action videos. On the other hand, the advertising industry only cares about long-term memorability (a few hours or longer), and advertisements are almost always highly multimodal, depicting a story through its different modalities (text, images, and videos). With this motivation, we conduct the first large scale memorability study consisting of 1203 participants and 2205 ads covering 276 brands. Running statistical tests over different participant subpopulations and ad-types, we find many interesting insights into what makes an ad memorable - both content and h
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#22810;&#31181;&#32908;&#32905;&#29305;&#24449;&#30340;&#26080;&#30417;&#30563;&#20272;&#35745;&#65292;&#26377;&#25928;&#22320;&#35780;&#20272;&#20102;&#28041;&#21450;&#22810;&#32908;&#32905;&#21327;&#35843;&#36816;&#21160;&#30340;&#30130;&#21171;&#65292;&#20026;&#21046;&#23450;&#24247;&#22797;&#21644;&#35757;&#32451;&#35745;&#21010;&#25552;&#20379;&#20102;&#37325;&#35201;&#20381;&#25454;&#12290;</title><link>http://arxiv.org/abs/2303.17614</link><description>&lt;p&gt;
&#35780;&#20272;&#22810;&#32908;&#32905;&#21327;&#35843;&#36816;&#21160;&#30340;&#25345;&#32493;&#32908;&#32905;&#30130;&#21171;&#65306;&#19968;&#39033;&#35797;&#28857;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Estimating Continuous Muscle Fatigue For Multi-Muscle Coordinated Exercise: A Pilot Study. (arXiv:2303.17614v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.17614
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#22810;&#31181;&#32908;&#32905;&#29305;&#24449;&#30340;&#26080;&#30417;&#30563;&#20272;&#35745;&#65292;&#26377;&#25928;&#22320;&#35780;&#20272;&#20102;&#28041;&#21450;&#22810;&#32908;&#32905;&#21327;&#35843;&#36816;&#21160;&#30340;&#30130;&#21171;&#65292;&#20026;&#21046;&#23450;&#24247;&#22797;&#21644;&#35757;&#32451;&#35745;&#21010;&#25552;&#20379;&#20102;&#37325;&#35201;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35780;&#20272;&#26085;&#24120;&#38203;&#28860;&#20013;&#32908;&#32905;&#30130;&#21171;&#31243;&#24230;&#20026;&#31934;&#30830;&#23450;&#21046;&#24247;&#22797;&#21644;&#20010;&#24615;&#21270;&#35757;&#32451;&#21058;&#37327;&#25552;&#20379;&#37325;&#35201;&#25351;&#26631;&#65292;&#29305;&#21035;&#26159;&#22312;Metaverse&#30340;&#32972;&#26223;&#19979;&#12290;&#35780;&#20272;&#28041;&#21450;&#22810;&#32908;&#32905;&#21327;&#35843;&#36816;&#21160;&#30340;&#30130;&#21171;&#38656;&#35201;&#34920;&#31034;&#22810;&#32908;&#32905;&#26102;&#31354;&#36866;&#24212;&#30340;&#30130;&#21171;&#29305;&#24449;&#21644;&#25429;&#25417;&#30130;&#21171;&#26102;&#38388;&#28436;&#21464;&#36827;&#31243;&#30340;&#20272;&#35745;&#22120;&#30340;&#31070;&#32463;&#32908;&#32905;&#29305;&#24449;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#36807;&#32908;&#32905;&#34917;&#20607;&#21644;&#33034;&#39635;&#27169;&#22359;&#28608;&#27963;&#21464;&#21270;&#30340;&#29305;&#24449;&#26469;&#25551;&#36848;&#30130;&#21171;&#65292;&#24182;&#36890;&#36807;&#29983;&#29702;&#22522;&#30784;&#27169;&#22411;&#20272;&#35745;&#25345;&#32493;&#24615;&#30130;&#21171;&#12290;&#25105;&#20204;&#25552;&#21462;&#20102;&#32908;&#32905;&#21327;&#21516;&#20998;&#25968;&#21644;&#33034;&#39635;&#27169;&#22359;&#23574;&#23792;&#20540;&#26041;&#24046;&#20316;&#20026;&#30130;&#21171;&#35825;&#23548;&#31070;&#32463;&#32908;&#32905;&#36866;&#24212;&#30340;&#29305;&#24449;&#65292;&#24182;&#23558;&#36825;&#20123;&#29305;&#24449;&#35270;&#20026;&#35266;&#27979;&#20540;&#65292;&#24320;&#21457;&#20102;&#36125;&#21494;&#26031;&#39640;&#26031;&#36807;&#31243;&#29992;&#20110;&#25429;&#25417;&#26102;&#38388;&#28436;&#21464;&#36807;&#31243;&#12290;&#25105;&#20204;&#37319;&#29992;&#26080;&#30417;&#30563;&#20272;&#35745;&#31574;&#30053;&#35299;&#20915;&#20102;&#35757;&#32451;&#25968;&#25454;&#20013;&#32570;&#20047;&#30417;&#30563;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#22312;8&#21517;&#20581;&#24247;&#21442;&#19982;&#32773;&#36827;&#34892;&#20102;&#19968;&#39033;&#35797;&#28857;&#30740;&#31350;&#65292;&#21442;&#19982;&#32773;&#36827;&#34892;&#20102;&#19968;&#31995;&#21015;&#21327;&#21516;&#25260;&#33151;&#32451;&#20064;&#65292;&#32467;&#26524;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#26681;&#25454;&#31070;&#32463;&#32908;&#32905;&#29305;&#24449;&#26377;&#25928;&#22320;&#20272;&#35745;&#20102;&#25345;&#32493;&#24615;&#30130;&#21171;&#12290;
&lt;/p&gt;
&lt;p&gt;
Assessing the progression of muscle fatigue for daily exercises provides vital indicators for precise rehabilitation, personalized training dose, especially under the context of Metaverse. Assessing fatigue of multi-muscle coordination-involved daily exercises requires the neuromuscular features that represent the fatigue-induced characteristics of spatiotemporal adaptions of multiple muscles and the estimator that captures the time-evolving progression of fatigue. In this paper, we propose to depict fatigue by the features of muscle compensation and spinal module activation changes and estimate continuous fatigue by a physiological rationale model. First, we extract muscle synergy fractionation and the variance of spinal module spikings as features inspired by the prior of fatigue-induced neuromuscular adaptations. Second, we treat the features as observations and develop a Bayesian Gaussian process to capture the time-evolving progression. Third, we solve the issue of lacking supervi
&lt;/p&gt;</description></item></channel></rss>