<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;COMPASS&#30340;&#26032;&#26694;&#26550;&#65292;&#36890;&#36807;&#20998;&#26512;&#24515;&#29702;&#27835;&#30103;&#20250;&#35805;&#20013;&#30340;&#33258;&#28982;&#35821;&#35328;&#65292;&#30452;&#25509;&#25512;&#26029;&#27835;&#30103;&#24037;&#20316;&#32852;&#30431;&#65292;&#20026;&#20020;&#24202;&#31934;&#31070;&#30149;&#23398;&#25552;&#20379;&#20102;&#21487;&#35299;&#37322;&#24615;&#65292;&#24182;&#22312;&#35782;&#21035;&#19982;&#27491;&#22312;&#27835;&#30103;&#30340;&#30142;&#30149;&#30456;&#20851;&#30340;&#26032;&#20852;&#27169;&#24335;&#26041;&#38754;&#21457;&#25381;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.14701</link><description>&lt;p&gt;
COMPASS&#65306;&#21033;&#29992;&#35821;&#35328;&#24314;&#27169;&#23545;&#24739;&#32773;-&#27835;&#30103;&#24072;&#32852;&#30431;&#31574;&#30053;&#36827;&#34892;&#35745;&#31639;&#26144;&#23556;
&lt;/p&gt;
&lt;p&gt;
COMPASS: Computational Mapping of Patient-Therapist Alliance Strategies with Language Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14701
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;COMPASS&#30340;&#26032;&#26694;&#26550;&#65292;&#36890;&#36807;&#20998;&#26512;&#24515;&#29702;&#27835;&#30103;&#20250;&#35805;&#20013;&#30340;&#33258;&#28982;&#35821;&#35328;&#65292;&#30452;&#25509;&#25512;&#26029;&#27835;&#30103;&#24037;&#20316;&#32852;&#30431;&#65292;&#20026;&#20020;&#24202;&#31934;&#31070;&#30149;&#23398;&#25552;&#20379;&#20102;&#21487;&#35299;&#37322;&#24615;&#65292;&#24182;&#22312;&#35782;&#21035;&#19982;&#27491;&#22312;&#27835;&#30103;&#30340;&#30142;&#30149;&#30456;&#20851;&#30340;&#26032;&#20852;&#27169;&#24335;&#26041;&#38754;&#21457;&#25381;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27835;&#30103;&#24037;&#20316;&#32852;&#30431;&#26159;&#39044;&#27979;&#24515;&#29702;&#27835;&#30103;&#27835;&#30103;&#25104;&#21151;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;&#20256;&#32479;&#19978;&#65292;&#24037;&#20316;&#32852;&#30431;&#35780;&#20272;&#20381;&#36182;&#20110;&#27835;&#30103;&#24072;&#21644;&#24739;&#32773;&#22635;&#20889;&#30340;&#38382;&#21367;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;COMPASS&#65292;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#21487;&#30452;&#25509;&#20174;&#24515;&#29702;&#27835;&#30103;&#35838;&#31243;&#20013;&#20351;&#29992;&#30340;&#33258;&#28982;&#35821;&#35328;&#20013;&#25512;&#26029;&#27835;&#30103;&#24037;&#20316;&#32852;&#30431;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#20808;&#36827;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20998;&#26512;&#24515;&#29702;&#27835;&#30103;&#20250;&#35805;&#30340;&#36716;&#24405;&#65292;&#24182;&#23558;&#20854;&#19982;&#24037;&#20316;&#32852;&#30431;&#28165;&#21333;&#20013;&#38472;&#36848;&#30340;&#20998;&#24067;&#24335;&#34920;&#31034;&#36827;&#34892;&#27604;&#36739;&#12290;&#36890;&#36807;&#20998;&#26512;&#28085;&#30422;&#22810;&#31181;&#31934;&#31070;&#30142;&#30149;&#30340;&#36229;&#36807;950&#20010;&#20250;&#35805;&#30340;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26174;&#24494;&#22320;&#26144;&#23556;&#24739;&#32773;-&#27835;&#30103;&#24072;&#23545;&#40784;&#36712;&#36857;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#20026;&#20020;&#24202;&#31934;&#31070;&#30149;&#23398;&#25552;&#20379;&#35299;&#37322;&#24615;&#65292;&#24182;&#22312;&#35782;&#21035;&#19982;&#27491;&#22312;&#27835;&#30103;&#30340;&#30142;&#30149;&#30456;&#20851;&#30340;&#26032;&#20852;&#27169;&#24335;&#26041;&#38754;&#25552;&#20379;&#21487;&#35299;&#37322;&#24615;&#12290;&#36890;&#36807;&#20351;&#29992;&#21508;&#31181;&#31070;&#32463;&#20027;&#39064;&#27169;&#24335;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14701v1 Announce Type: cross  Abstract: The therapeutic working alliance is a critical factor in predicting the success of psychotherapy treatment. Traditionally, working alliance assessment relies on questionnaires completed by both therapists and patients. In this paper, we present COMPASS, a novel framework to directly infer the therapeutic working alliance from the natural language used in psychotherapy sessions. Our approach utilizes advanced large language models to analyze transcripts of psychotherapy sessions and compare them with distributed representations of statements in the working alliance inventory. Analyzing a dataset of over 950 sessions covering diverse psychiatric conditions, we demonstrate the effectiveness of our method in microscopically mapping patient-therapist alignment trajectories and providing interpretability for clinical psychiatry and in identifying emerging patterns related to the condition being treated. By employing various neural topic mode
&lt;/p&gt;</description></item><item><title>MobileGPT&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#22522;&#20110;LLM&#30340;&#31227;&#21160;&#20219;&#21153;&#33258;&#21160;&#21270;&#24037;&#20855;&#65292;&#36890;&#36807;&#31867;&#20154;&#24212;&#29992;&#35760;&#24518;&#27169;&#25311;&#20154;&#31867;&#19982;&#31227;&#21160;&#24212;&#29992;&#30340;&#35748;&#30693;&#36807;&#31243;&#65292;&#23454;&#29616;&#20219;&#21153;&#31243;&#24207;&#30340;&#31934;&#30830;&#39640;&#25928;&#23398;&#20064;&#12290;</title><link>https://arxiv.org/abs/2312.03003</link><description>&lt;p&gt;
&#25506;&#32034;&#12289;&#36873;&#25321;&#12289;&#25512;&#23548;&#21644;&#22238;&#24518;&#65306;&#20026;&#31227;&#21160;&#20219;&#21153;&#33258;&#21160;&#21270;&#22686;&#21152;&#31867;&#20154;&#35760;&#24518;&#30340;LLM
&lt;/p&gt;
&lt;p&gt;
Explore, Select, Derive, and Recall: Augmenting LLM with Human-like Memory for Mobile Task Automation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.03003
&lt;/p&gt;
&lt;p&gt;
MobileGPT&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#22522;&#20110;LLM&#30340;&#31227;&#21160;&#20219;&#21153;&#33258;&#21160;&#21270;&#24037;&#20855;&#65292;&#36890;&#36807;&#31867;&#20154;&#24212;&#29992;&#35760;&#24518;&#27169;&#25311;&#20154;&#31867;&#19982;&#31227;&#21160;&#24212;&#29992;&#30340;&#35748;&#30693;&#36807;&#31243;&#65292;&#23454;&#29616;&#20219;&#21153;&#31243;&#24207;&#30340;&#31934;&#30830;&#39640;&#25928;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#20986;&#29616;&#20026;&#31227;&#21160;&#20219;&#21153;&#33258;&#21160;&#21270;&#39046;&#22495;&#24102;&#26469;&#20102;&#26032;&#30340;&#26426;&#36935;&#12290;&#23427;&#20204;&#20248;&#36234;&#30340;&#35821;&#35328;&#29702;&#35299;&#21644;&#25512;&#29702;&#33021;&#21147;&#20351;&#29992;&#25143;&#33021;&#22815;&#33258;&#21160;&#25191;&#34892;&#22797;&#26434;&#21644;&#37325;&#22797;&#30340;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;LLMs&#22266;&#26377;&#30340;&#19981;&#21487;&#38752;&#24615;&#21644;&#39640;&#36816;&#34892;&#25104;&#26412;&#65292;&#23427;&#20204;&#30340;&#23454;&#38469;&#36866;&#29992;&#24615;&#30456;&#24403;&#26377;&#38480;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;MobileGPT&#65292;&#36825;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#22522;&#20110;LLM&#30340;&#31227;&#21160;&#20219;&#21153;&#33258;&#21160;&#21270;&#24037;&#20855;&#65292;&#37197;&#22791;&#20102;&#31867;&#20154;&#24212;&#29992;&#35760;&#24518;&#12290;MobileGPT&#27169;&#25311;&#20102;&#20154;&#31867;&#19982;&#31227;&#21160;&#24212;&#29992;&#20132;&#20114;&#30340;&#35748;&#30693;&#36807;&#31243;--&#25506;&#32034;&#12289;&#36873;&#25321;&#12289;&#25512;&#23548;&#21644;&#22238;&#24518;&#12290;&#36825;&#31181;&#26041;&#27861;&#36890;&#36807;&#23558;&#20219;&#21153;&#31243;&#24207;&#20998;&#35299;&#20026;&#26356;&#23567;&#12289;&#27169;&#22359;&#21270;&#30340;&#23376;&#20219;&#21153;&#65292;&#20801;&#35768;&#26356;&#31934;&#30830;&#12289;&#39640;&#25928;&#22320;&#23398;&#20064;&#20219;&#21153;&#27969;&#31243;&#65292;&#20174;&#32780;&#23454;&#29616;&#23376;&#20219;&#21153;&#30340;&#37325;&#22797;&#20351;&#29992;&#12289;&#37325;&#26032;&#25490;&#21015;&#21644;&#36866;&#24212;&#21508;&#31181;&#30446;&#26631;&#12290;&#25105;&#20204;&#20351;&#29992;&#22312;&#32447;LLM&#26381;&#21153;&#65288;GPT-3.5&#21644;GPT-4&#65289;&#23454;&#29616;&#20102;MobileGPT&#65292;&#24182;&#22312;&#19968;&#32452;&#25968;&#25454;&#19978;&#35780;&#20272;&#20102;&#20854;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.03003v2 Announce Type: replace-cross  Abstract: The advent of large language models (LLMs) has opened up new opportunities in the field of mobile task automation. Their superior language understanding and reasoning capabilities allow users to automate complex and repetitive tasks. However, due to the inherent unreliability and high operational cost of LLMs, their practical applicability is quite limited. To address these issues, this paper introduces MobileGPT, an innovative LLM-based mobile task automator equipped with a human-like app memory. MobileGPT emulates the cognitive process of humans interacting with a mobile app -- explore, select, derive, and recall. This approach allows for a more precise and efficient learning of a task's procedure by breaking it down into smaller, modular sub-tasks that can be re-used, re-arranged, and adapted for various objectives. We implement MobileGPT using online LLMs services (GPT-3.5 and GPT-4) and evaluate its performance on a datase
&lt;/p&gt;</description></item><item><title>&#23545;&#27169;&#22411;&#35299;&#37322;&#30340;&#29992;&#25143;&#30740;&#31350;&#32508;&#36848;&#21457;&#29616;&#65292;&#21487;&#35299;&#37322;&#22411;&#20154;&#24037;&#26234;&#33021;&#65288;XAI&#65289;&#27491;&#22312;&#26576;&#20123;&#24212;&#29992;&#39046;&#22495;&#24555;&#36895;&#25193;&#25955;&#65292;&#20294;&#29992;&#25143;&#35780;&#20272;&#20173;&#28982;&#31232;&#32570;&#19988;&#20960;&#20046;&#19981;&#28041;&#21450;&#35748;&#30693;&#25110;&#31038;&#20250;&#31185;&#23398;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2210.11584</link><description>&lt;p&gt;
&#26397;&#30528;&#20197;&#20154;&#20026;&#20013;&#24515;&#30340;&#21487;&#35299;&#37322;&#22411;&#20154;&#24037;&#26234;&#33021;&#65306;&#23545;&#27169;&#22411;&#35299;&#37322;&#30340;&#29992;&#25143;&#30740;&#31350;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Towards Human-centered Explainable AI: A Survey of User Studies for Model Explanations. (arXiv:2210.11584v3 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.11584
&lt;/p&gt;
&lt;p&gt;
&#23545;&#27169;&#22411;&#35299;&#37322;&#30340;&#29992;&#25143;&#30740;&#31350;&#32508;&#36848;&#21457;&#29616;&#65292;&#21487;&#35299;&#37322;&#22411;&#20154;&#24037;&#26234;&#33021;&#65288;XAI&#65289;&#27491;&#22312;&#26576;&#20123;&#24212;&#29992;&#39046;&#22495;&#24555;&#36895;&#25193;&#25955;&#65292;&#20294;&#29992;&#25143;&#35780;&#20272;&#20173;&#28982;&#31232;&#32570;&#19988;&#20960;&#20046;&#19981;&#28041;&#21450;&#35748;&#30693;&#25110;&#31038;&#20250;&#31185;&#23398;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21487;&#35299;&#37322;&#22411;&#20154;&#24037;&#26234;&#33021;&#65288;XAI&#65289;&#34987;&#24191;&#27867;&#35748;&#20026;&#26159;&#19981;&#26029;&#25193;&#23637;&#30340;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#30340;&#24517;&#38656;&#26465;&#20214;&#12290;&#23545;XAI&#29992;&#25143;&#38656;&#27714;&#30340;&#26356;&#22909;&#29702;&#35299;&#20197;&#21450;&#21487;&#35299;&#37322;&#27169;&#22411;&#30340;&#20154;&#26412;&#35780;&#20272;&#26082;&#26159;&#24517;&#35201;&#24615;&#20063;&#26159;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#31995;&#32479;&#24615;&#25991;&#29486;&#32508;&#36848;&#30740;&#31350;&#20102;HCI&#21644;AI&#30740;&#31350;&#20154;&#21592;&#22914;&#20309;&#36827;&#34892;XAI&#24212;&#29992;&#30340;&#29992;&#25143;&#30740;&#31350;&#12290;&#36890;&#36807;&#23545;&#36807;&#21435;&#20116;&#24180;&#20013;&#22522;&#20110;&#20154;&#31867;&#30340;XAI&#35780;&#20272;&#30340;97&#31687;&#26680;&#24515;&#35770;&#25991;&#36827;&#34892;&#35782;&#21035;&#21644;&#28145;&#20837;&#20998;&#26512;&#65292;&#25105;&#20204;&#23558;&#20854;&#25353;&#29031;&#35299;&#37322;&#26041;&#27861;&#30340;&#27979;&#37327;&#29305;&#24449;&#65288;&#20449;&#20219;&#12289;&#29702;&#35299;&#12289;&#21487;&#29992;&#24615;&#21644;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#30340;&#21512;&#20316;&#34920;&#29616;&#65289;&#36827;&#34892;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;XAI&#22312;&#26576;&#20123;&#24212;&#29992;&#39046;&#22495;&#65288;&#22914;&#25512;&#33616;&#31995;&#32479;&#65289;&#25193;&#25955;&#26356;&#36805;&#36895;&#65292;&#20294;&#29992;&#25143;&#35780;&#20272;&#20173;&#30456;&#24403;&#31232;&#32570;&#65292;&#24182;&#19988;&#20960;&#20046;&#27809;&#26377;&#34701;&#20837;&#35748;&#30693;&#25110;&#31038;&#20250;&#31185;&#23398;&#30340;&#20219;&#20309;&#35265;&#35299;&#12290;&#22522;&#20110;&#32508;&#21512;&#35752;&#35770;&#30340;&#26368;&#20339;&#23454;&#36341;&#65292;&#21363;&#24120;&#35265;&#27169;&#22411;&#12289;&#35774;&#35745;&#36873;&#25321;&#21644;&#24230;&#37327;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Explainable AI (XAI) is widely viewed as a sine qua non for ever-expanding AI research. A better understanding of the needs of XAI users, as well as human-centered evaluations of explainable models are both a necessity and a challenge. In this paper, we explore how HCI and AI researchers conduct user studies in XAI applications based on a systematic literature review. After identifying and thoroughly analyzing 97core papers with human-based XAI evaluations over the past five years, we categorize them along the measured characteristics of explanatory methods, namely trust, understanding, usability, and human-AI collaboration performance. Our research shows that XAI is spreading more rapidly in certain application domains, such as recommender systems than in others, but that user evaluations are still rather sparse and incorporate hardly any insights from cognitive or social sciences. Based on a comprehensive discussion of best practices, i.e., common models, design choices, and measures
&lt;/p&gt;</description></item></channel></rss>