<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;Velostat&#30340;&#26234;&#33021;&#21387;&#21147;&#30005;&#23376;&#22443;&#31995;&#32479;&#65292;&#21487;&#29992;&#20110;&#35782;&#21035;&#20154;&#20307;&#23039;&#21183;&#21644;&#36816;&#21160;&#65292;&#20855;&#26377;&#39640;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2305.11367</link><description>&lt;p&gt;
&#26234;&#33021;&#21387;&#21147;&#30005;&#23376;&#22443;&#29992;&#20110;&#20154;&#31867;&#30561;&#30496;&#23039;&#21183;&#21644;&#21160;&#24577;&#27963;&#21160;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Smart Pressure e-Mat for Human Sleeping Posture and Dynamic Activity Recognition. (arXiv:2305.11367v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11367
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;Velostat&#30340;&#26234;&#33021;&#21387;&#21147;&#30005;&#23376;&#22443;&#31995;&#32479;&#65292;&#21487;&#29992;&#20110;&#35782;&#21035;&#20154;&#20307;&#23039;&#21183;&#21644;&#36816;&#21160;&#65292;&#20855;&#26377;&#39640;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24378;&#35843;&#21307;&#30103;&#20445;&#20581;&#12289;&#26089;&#26399;&#25945;&#32946;&#21644;&#20581;&#36523;&#26041;&#38754;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#38750;&#20405;&#20837;&#24335;&#27979;&#37327;&#21644;&#35782;&#21035;&#26041;&#27861;&#21463;&#21040;&#20851;&#27880;&#12290;&#21387;&#21147;&#24863;&#24212;&#30001;&#20110;&#20854;&#31616;&#21333;&#30340;&#32467;&#26500;&#12289;&#26131;&#20110;&#35775;&#38382;&#12289;&#21487;&#35270;&#21270;&#24212;&#29992;&#21644;&#26080;&#23475;&#24615;&#32780;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21387;&#25935;&#26448;&#26009;Velostat&#30340;&#26234;&#33021;&#21387;&#21147;&#30005;&#23376;&#22443;(SP e-Mat)&#31995;&#32479;&#65292;&#29992;&#20110;&#20154;&#20307;&#30417;&#27979;&#24212;&#29992;&#65292;&#21253;&#25324;&#30561;&#30496;&#23039;&#21183;&#12289;&#36816;&#21160;&#21644;&#29788;&#20285;&#35782;&#21035;&#12290;&#22312;&#23376;&#31995;&#32479;&#25195;&#25551;&#30005;&#23376;&#22443;&#35835;&#25968;&#24182;&#22788;&#29702;&#20449;&#21495;&#21518;&#65292;&#23427;&#29983;&#25104;&#19968;&#20010;&#21387;&#21147;&#22270;&#20687;&#27969;&#12290;&#37319;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNNs)&#26469;&#25311;&#21512;&#21644;&#35757;&#32451;&#21387;&#21147;&#22270;&#20687;&#27969;&#65292;&#24182;&#35782;&#21035;&#30456;&#24212;&#30340;&#20154;&#31867;&#34892;&#20026;&#12290;&#22235;&#31181;&#30561;&#30496;&#23039;&#21183;&#21644;&#21463;Nintendo Switch Ring Fit Adventure(RFA)&#21551;&#21457;&#30340;&#20116;&#31181;&#21160;&#24577;&#27963;&#21160;&#34987;&#29992;&#20316;&#25311;&#35758;&#30340;SPeM&#31995;&#32479;&#30340;&#21021;&#27493;&#39564;&#35777;&#12290;SPeM&#31995;&#32479;&#22312;&#20004;&#31181;&#24212;&#29992;&#20013;&#22343;&#36798;&#21040;&#20102;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#65292;&#36825;&#35777;&#26126;&#20102;&#20854;&#39640;&#31934;&#24230;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the emphasis on healthcare, early childhood education, and fitness, non-invasive measurement and recognition methods have received more attention. Pressure sensing has been extensively studied due to its advantages of simple structure, easy access, visualization application, and harmlessness. This paper introduces a smart pressure e-mat (SPeM) system based on a piezoresistive material Velostat for human monitoring applications, including sleeping postures, sports, and yoga recognition. After a subsystem scans e-mat readings and processes the signal, it generates a pressure image stream. Deep neural networks (DNNs) are used to fit and train the pressure image stream and recognize the corresponding human behavior. Four sleeping postures and five dynamic activities inspired by Nintendo Switch Ring Fit Adventure (RFA) are used as a preliminary validation of the proposed SPeM system. The SPeM system achieves high accuracies on both applications, which demonstrates the high accuracy and
&lt;/p&gt;</description></item></channel></rss>