<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#30740;&#31350;&#25506;&#32034;&#20102;&#22312;&#21327;&#20316;&#35013;&#37197;&#22330;&#26223;&#20013;&#65292;Cobot&#30340;&#29983;&#20135;&#33410;&#22863;&#23545;&#21442;&#19982;&#32773;&#30340;&#32463;&#39564;&#24615;&#23450;&#20301;&#25511;&#21046;&#21644;&#24773;&#32490;&#29366;&#24577;&#30340;&#24433;&#21709;&#12290;&#34429;&#28982;&#22312;&#24773;&#32490;&#29366;&#24577;&#21644;&#23450;&#20301;&#25511;&#21046;&#26041;&#38754;&#26410;&#21457;&#29616;&#24046;&#24322;&#65292;&#20294;&#32771;&#34385;&#21040;&#20854;&#20182;&#24515;&#29702;&#21464;&#37327;&#65292;&#32467;&#26524;&#34920;&#26126;&#38656;&#35201;&#32771;&#34385;&#20010;&#20307;&#30340;&#24515;&#29702;&#29305;&#24449;&#26469;&#25552;&#20379;&#26356;&#22909;&#30340;&#20114;&#21160;&#20307;&#39564;&#12290;</title><link>https://arxiv.org/abs/2402.00808</link><description>&lt;p&gt;
&#22312;&#21327;&#20316;&#35013;&#37197;&#22330;&#26223;&#20013;&#65292;&#25506;&#32034;Cobot&#30340;&#29983;&#20135;&#33410;&#22863;&#12289;&#25511;&#21046;&#23450;&#20301;&#21644;&#24773;&#32490;&#29366;&#24577;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Exploring the Dynamics between Cobot's Production Rhythm, Locus of Control and Emotional State in a Collaborative Assembly Scenario
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00808
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#32034;&#20102;&#22312;&#21327;&#20316;&#35013;&#37197;&#22330;&#26223;&#20013;&#65292;Cobot&#30340;&#29983;&#20135;&#33410;&#22863;&#23545;&#21442;&#19982;&#32773;&#30340;&#32463;&#39564;&#24615;&#23450;&#20301;&#25511;&#21046;&#21644;&#24773;&#32490;&#29366;&#24577;&#30340;&#24433;&#21709;&#12290;&#34429;&#28982;&#22312;&#24773;&#32490;&#29366;&#24577;&#21644;&#23450;&#20301;&#25511;&#21046;&#26041;&#38754;&#26410;&#21457;&#29616;&#24046;&#24322;&#65292;&#20294;&#32771;&#34385;&#21040;&#20854;&#20182;&#24515;&#29702;&#21464;&#37327;&#65292;&#32467;&#26524;&#34920;&#26126;&#38656;&#35201;&#32771;&#34385;&#20010;&#20307;&#30340;&#24515;&#29702;&#29305;&#24449;&#26469;&#25552;&#20379;&#26356;&#22909;&#30340;&#20114;&#21160;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24037;&#19994;&#22330;&#26223;&#20013;&#65292;&#21327;&#20316;&#26426;&#22120;&#20154;&#65288;cobots&#65289;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#24182;&#19988;&#23545;&#35780;&#20272;&#21644;&#27979;&#37327;cobots&#30340;&#26576;&#20123;&#29305;&#24449;&#23545;&#20154;&#30340;&#24433;&#21709;&#20135;&#29983;&#20102;&#26085;&#30410;&#22686;&#38271;&#30340;&#20852;&#36259;&#12290;&#22312;&#26412;&#27425;&#35797;&#28857;&#30740;&#31350;&#20013;&#65292;&#30740;&#31350;&#20102;&#19968;&#20010;cobots&#30340;&#29983;&#20135;&#33410;&#22863;&#65288;C1-&#24930;&#12289;C2-&#24555;&#12289;C3-&#26681;&#25454;&#21442;&#19982;&#32773;&#30340;&#27493;&#35843;&#35843;&#25972;&#65289;&#23545;31&#21517;&#21442;&#19982;&#32773;&#30340;&#32463;&#39564;&#24615;&#23450;&#20301;&#25511;&#21046;&#65288;ELoC&#65289;&#21644;&#24773;&#32490;&#29366;&#24577;&#30340;&#24433;&#21709;&#12290;&#36824;&#32771;&#34385;&#20102;&#25805;&#20316;&#20154;&#21592;&#30340;&#32489;&#25928;&#12289;&#22522;&#26412;&#20869;&#37096;&#23450;&#20301;&#25511;&#21046;&#31243;&#24230;&#21644;&#23545;&#26426;&#22120;&#20154;&#30340;&#24577;&#24230;&#12290;&#20851;&#20110;&#24773;&#32490;&#29366;&#24577;&#21644;ELoC&#65292;&#22312;&#19977;&#31181;&#26465;&#20214;&#19979;&#27809;&#26377;&#21457;&#29616;&#24046;&#24322;&#65292;&#20294;&#32771;&#34385;&#21040;&#20854;&#20182;&#24515;&#29702;&#21464;&#37327;&#65292;&#20986;&#29616;&#20102;&#26356;&#22797;&#26434;&#30340;&#24773;&#20917;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#32467;&#26524;&#20284;&#20046;&#34920;&#26126;&#38656;&#35201;&#32771;&#34385;&#20010;&#20307;&#30340;&#24515;&#29702;&#29305;&#24449;&#65292;&#20197;&#25552;&#20379;&#19981;&#21516;&#21644;&#26368;&#20339;&#30340;&#20114;&#21160;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
In industrial scenarios, there is widespread use of collaborative robots (cobots), and growing interest is directed at evaluating and measuring the impact of some characteristics of the cobot on the human factor. In the present pilot study, the effect that the production rhythm (C1 - Slow, C2 - Fast, C3 - Adapted to the participant's pace) of a cobot has on the Experiential Locus of Control (ELoC) and the emotional state of 31 participants has been examined. The operators' performance, the degree of basic internal Locus of Control, and the attitude towards the robots were also considered. No difference was found regarding the emotional state and the ELoC in the three conditions, but considering the other psychological variables, a more complex situation emerges. Overall, results seem to indicate a need to consider the person's psychological characteristics to offer a differentiated and optimal interaction experience.
&lt;/p&gt;</description></item><item><title>UINav&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28436;&#31034;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35757;&#32451;&#36866;&#21512;&#31227;&#21160;&#35774;&#22791;&#30340;&#33258;&#21160;&#21270;&#20195;&#29702;&#65292;&#25104;&#21151;&#29575;&#39640;&#65292;&#35757;&#32451;&#25968;&#25454;&#23569;&#12290;</title><link>https://arxiv.org/abs/2312.10170</link><description>&lt;p&gt;
UINav&#65306;&#19968;&#31181;&#35757;&#32451;&#35774;&#22791;&#31471;&#33258;&#21160;&#21270;&#20195;&#29702;&#30340;&#23454;&#29992;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
UINav: A Practical Approach to Train On-Device Automation Agents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.10170
&lt;/p&gt;
&lt;p&gt;
UINav&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28436;&#31034;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35757;&#32451;&#36866;&#21512;&#31227;&#21160;&#35774;&#22791;&#30340;&#33258;&#21160;&#21270;&#20195;&#29702;&#65292;&#25104;&#21151;&#29575;&#39640;&#65292;&#35757;&#32451;&#25968;&#25454;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#33258;&#20027;&#39537;&#21160;&#24212;&#29992;&#31243;&#24207;&#29992;&#25143;&#30028;&#38754;&#20197;&#23436;&#25104;&#29992;&#25143;&#20219;&#21153;&#30340;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#23588;&#20854;&#26159;&#24403;&#29992;&#25143;&#22788;&#20110;&#24773;&#22659;&#24615;&#25110;&#27704;&#20037;&#24615;&#21463;&#25439;&#26102;&#65292;&#20855;&#26377;&#24040;&#22823;&#30340;&#30410;&#22788;&#12290;&#20043;&#21069;&#30340;&#33258;&#21160;&#21270;&#31995;&#32479;&#19981;&#33021;&#20135;&#29983;&#20855;&#26377;&#26222;&#36941;&#36866;&#29992;&#24615;&#30340;&#27169;&#22411;&#65292;&#32780;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#33258;&#21160;&#21270;&#20195;&#29702;&#20165;&#22312;&#31616;&#21333;&#30340;&#25163;&#24037;&#21046;&#20316;&#24212;&#29992;&#31243;&#24207;&#20013;&#21487;&#38752;&#24037;&#20316;&#65292;&#25110;&#32773;&#20250;&#20135;&#29983;&#39640;&#35745;&#31639;&#25104;&#26412;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;UINav&#65292;&#36825;&#26159;&#19968;&#31181;&#22522;&#20110;&#28436;&#31034;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35757;&#32451;&#36866;&#21512;&#31227;&#21160;&#35774;&#22791;&#30340;&#33258;&#21160;&#21270;&#20195;&#29702;&#65292;&#21516;&#26102;&#21487;&#20197;&#22312;&#28436;&#31034;&#25968;&#37327;&#19981;&#22810;&#30340;&#24773;&#20917;&#19979;&#23454;&#29616;&#39640;&#25104;&#21151;&#29575;&#12290;&#20026;&#20102;&#20943;&#23569;&#28436;&#31034;&#30340;&#24037;&#20316;&#37327;&#65292;UINav&#20351;&#29992;&#20102;&#19968;&#20010;&#35009;&#21028;&#27169;&#22411;&#65292;&#22312;&#20195;&#29702;&#22833;&#36133;&#30340;&#20219;&#21153;&#19978;&#20026;&#29992;&#25143;&#25552;&#20379;&#21363;&#26102;&#21453;&#39304;&#65292;&#24182;&#33258;&#21160;&#22686;&#21152;&#20154;&#31867;&#28436;&#31034;&#20197;&#22686;&#21152;&#35757;&#32451;&#25968;&#25454;&#30340;&#22810;&#26679;&#24615;&#12290;&#25105;&#20204;&#30340;&#35780;&#20272;&#34920;&#26126;&#65292;&#20165;&#38656;10&#27425;&#28436;&#31034;&#65292;UINav&#23601;&#21487;&#20197;&#23454;&#29616;70%&#30340;&#20934;&#30830;&#29575;&#65292;&#32780;&#26377;&#36275;&#22815;&#22810;&#27425;&#28436;&#31034;&#26102;&#65292;&#23427;&#21487;&#20197;&#36229;&#36807;90%&#30340;&#20934;&#30830;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.10170v2 Announce Type: replace-cross  Abstract: Automation systems that can autonomously drive application user interfaces to complete user tasks are of great benefit, especially when users are situationally or permanently impaired. Prior automation systems do not produce generalizable models while AI-based automation agents work reliably only in simple, hand-crafted applications or incur high computation costs. We propose UINav, a demonstration-based approach to train automation agents that fit mobile devices, yet achieving high success rates with modest numbers of demonstrations. To reduce the demonstration overhead, UINav uses a referee model that provides users with immediate feedback on tasks where the agent fails, and automatically augments human demonstrations to increase diversity in training data. Our evaluation shows that with only 10 demonstrations UINav can achieve 70% accuracy, and that with enough demonstrations it can surpass 90% accuracy.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#22312;&#29289;&#32852;&#32593;&#20581;&#24247;&#25252;&#29702;&#20013;&#21033;&#29992;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#39537;&#21160;&#30340;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#30340;&#24212;&#29992;&#12290;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#20316;&#20026;&#22810;&#21151;&#33021;&#12289;&#29983;&#21160;&#30340;&#20154;&#31867;&#25968;&#23383;&#27979;&#35797;&#24179;&#21488;&#65292;&#21487;&#20197;&#27169;&#25311;&#32467;&#26524;&#24182;&#25351;&#23548;&#23454;&#38469;&#27835;&#30103;&#65292;&#20174;&#32780;&#25552;&#39640;&#29289;&#32852;&#32593;&#20581;&#24247;&#25252;&#29702;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2401.13699</link><description>&lt;p&gt;
&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#39537;&#21160;&#30340;&#29289;&#32852;&#32593;&#20581;&#24247;&#25252;&#29702;&#20013;&#30340;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#65306;&#19968;&#39033;&#32508;&#21512;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Generative AI-Driven Human Digital Twin in IoT-Healthcare: A Comprehensive Survey. (arXiv:2401.13699v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13699
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#22312;&#29289;&#32852;&#32593;&#20581;&#24247;&#25252;&#29702;&#20013;&#21033;&#29992;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#39537;&#21160;&#30340;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#30340;&#24212;&#29992;&#12290;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#20316;&#20026;&#22810;&#21151;&#33021;&#12289;&#29983;&#21160;&#30340;&#20154;&#31867;&#25968;&#23383;&#27979;&#35797;&#24179;&#21488;&#65292;&#21487;&#20197;&#27169;&#25311;&#32467;&#26524;&#24182;&#25351;&#23548;&#23454;&#38469;&#27835;&#30103;&#65292;&#20174;&#32780;&#25552;&#39640;&#29289;&#32852;&#32593;&#20581;&#24247;&#25252;&#29702;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#32852;&#32593;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#20154;&#31867;&#29983;&#27963;&#30340;&#36136;&#37327;&#65292;&#29305;&#21035;&#26159;&#22312;&#20581;&#24247;&#25252;&#29702;&#26041;&#38754;&#21560;&#24341;&#20102;&#24191;&#27867;&#30340;&#20851;&#27880;&#12290;&#21516;&#26102;&#65292;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#34987;&#25552;&#20986;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#33539;&#24335;&#65292;&#21487;&#20197;&#20840;&#38754;&#22320;&#25551;&#36848;&#20010;&#20307;&#20154;&#20307;&#22312;&#25968;&#23383;&#19990;&#30028;&#20013;&#30340;&#22797;&#21046;&#65292;&#24182;&#23454;&#26102;&#21453;&#26144;&#20854;&#29289;&#29702;&#29366;&#20917;&#12290;&#33258;&#28982;&#22320;&#65292;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#34987;&#35774;&#24819;&#20026;&#36890;&#36807;&#20805;&#24403;&#22810;&#21151;&#33021;&#12289;&#29983;&#21160;&#30340;&#20154;&#31867;&#25968;&#23383;&#27979;&#35797;&#24179;&#21488;&#26469;&#22686;&#24378;&#29289;&#32852;&#32593;&#20581;&#24247;&#25252;&#29702;&#30340;&#33021;&#21147;&#65292;&#27169;&#25311;&#32467;&#26524;&#24182;&#25351;&#23548;&#23454;&#38469;&#27835;&#30103;&#12290;&#28982;&#32780;&#65292;&#25104;&#21151;&#24314;&#31435;&#20154;&#31867;&#25968;&#23383;&#23402;&#29983;&#38656;&#35201;&#39640;&#20445;&#30495;&#24230;&#30340;&#34394;&#25311;&#24314;&#27169;&#21644;&#24378;&#22823;&#30340;&#20449;&#24687;&#20132;&#20114;&#65292;&#20294;&#21487;&#33021;&#23384;&#22312;&#31232;&#32570;&#12289;&#20559;&#20506;&#21644;&#22122;&#22768;&#25968;&#25454;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#26368;&#36817;&#27969;&#34892;&#30340;&#19968;&#31181;&#21517;&#20026;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#65288;GAI&#65289;&#30340;&#25216;&#26415;&#21487;&#33021;&#26159;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#22240;&#20026;&#23427;&#21487;&#20197;&#21033;&#29992;&#20808;&#36827;&#30340;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#33258;&#21160;&#29983;&#25104;&#12289;&#25805;&#20316;&#21644;&#20462;&#25913;&#28176;&#21464;&#35270;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Internet of things (IoT) can significantly enhance the quality of human life, specifically in healthcare, attracting extensive attentions to IoT-healthcare services. Meanwhile, the human digital twin (HDT) is proposed as an innovative paradigm that can comprehensively characterize the replication of the individual human body in the digital world and reflect its physical status in real time. Naturally, HDT is envisioned to empower IoT-healthcare beyond the application of healthcare monitoring by acting as a versatile and vivid human digital testbed, simulating the outcomes and guiding the practical treatments. However, successfully establishing HDT requires high-fidelity virtual modeling and strong information interactions but possibly with scarce, biased and noisy data. Fortunately, a recent popular technology called generative artificial intelligence (GAI) may be a promising solution because it can leverage advanced AI algorithms to automatically create, manipulate, and modify val
&lt;/p&gt;</description></item></channel></rss>