<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#35843;&#26597;&#20102;&#22823;&#22411;&#39044;&#35757;&#32451;&#27169;&#22411;&#19982;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#37325;&#35201;&#24615;&#65292;&#24378;&#35843;&#20102;&#36825;&#20123;&#27169;&#22411;&#22914;&#20309;&#36229;&#36234;&#20256;&#32479;&#26041;&#27861;&#22686;&#24378;&#21327;&#20316;&#26234;&#33021;&#65292;&#24182;&#25506;&#35752;&#20102;&#20854;&#22312;&#22686;&#24378;&#20154;&#31867;&#33021;&#21147;&#12289;&#25913;&#21892;AI&#27169;&#22411;&#12289;&#26377;&#25928;&#22242;&#38431;&#21512;&#20316;&#12289;&#36947;&#24503;&#32771;&#34385;&#20197;&#21450;&#22312;&#21508;&#20010;&#39046;&#22495;&#24191;&#27867;&#24212;&#29992;&#26041;&#38754;&#30340;&#28508;&#22312;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.04931</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#22823;&#22411;&#39044;&#35757;&#32451;&#27169;&#22411;&#21512;&#20316;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
A Survey on Human-AI Teaming with Large Pre-Trained Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04931
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35843;&#26597;&#20102;&#22823;&#22411;&#39044;&#35757;&#32451;&#27169;&#22411;&#19982;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#37325;&#35201;&#24615;&#65292;&#24378;&#35843;&#20102;&#36825;&#20123;&#27169;&#22411;&#22914;&#20309;&#36229;&#36234;&#20256;&#32479;&#26041;&#27861;&#22686;&#24378;&#21327;&#20316;&#26234;&#33021;&#65292;&#24182;&#25506;&#35752;&#20102;&#20854;&#22312;&#22686;&#24378;&#20154;&#31867;&#33021;&#21147;&#12289;&#25913;&#21892;AI&#27169;&#22411;&#12289;&#26377;&#25928;&#22242;&#38431;&#21512;&#20316;&#12289;&#36947;&#24503;&#32771;&#34385;&#20197;&#21450;&#22312;&#21508;&#20010;&#39046;&#22495;&#24191;&#27867;&#24212;&#29992;&#26041;&#38754;&#30340;&#28508;&#22312;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#36805;&#36895;&#21457;&#23637;&#30340;&#26223;&#35266;&#20013;&#65292;&#20154;&#31867;&#26234;&#33021;&#21644;AI&#31995;&#32479;&#20043;&#38388;&#30340;&#21327;&#20316;&#65292;&#21363;&#20154;&#24037;&#26234;&#33021;&#65288;HAI&#65289;&#21512;&#20316;&#65292;&#24050;&#25104;&#20026;&#25512;&#36827;&#38382;&#39064;&#35299;&#20915;&#21644;&#20915;&#31574;&#36807;&#31243;&#30340;&#22522;&#30707;&#12290;&#22823;&#22411;&#39044;&#35757;&#32451;&#27169;&#22411;&#65288;LPtM&#65289;&#30340;&#20986;&#29616;&#26174;&#33879;&#25913;&#21464;&#20102;&#36825;&#19968;&#26223;&#35266;&#65292;&#36890;&#36807;&#21033;&#29992;&#22823;&#37327;&#25968;&#25454;&#26469;&#29702;&#35299;&#21644;&#39044;&#27979;&#22797;&#26434;&#27169;&#24335;&#65292;&#20026;&#20154;&#31867;&#25552;&#20379;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#33021;&#21147;&#12290;&#26412;&#25991;&#35843;&#26597;&#20102;LPtMs&#19982;HAI&#30340;&#20851;&#38190;&#25972;&#21512;&#65292;&#24378;&#35843;&#20102;&#36825;&#20123;&#27169;&#22411;&#22914;&#20309;&#36229;&#36234;&#20256;&#32479;&#26041;&#27861;&#22686;&#24378;&#21327;&#20316;&#26234;&#33021;&#12290;&#37325;&#28857;&#25506;&#35752;&#20102;LPtMs&#22312;&#22686;&#24378;&#20154;&#31867;&#33021;&#21147;&#26041;&#38754;&#30340;&#21327;&#21516;&#28508;&#21147;&#65292;&#35752;&#35770;&#20102;&#36825;&#31181;&#21327;&#20316;&#23545;AI&#27169;&#22411;&#25913;&#36827;&#12289;&#26377;&#25928;&#30340;&#22242;&#38431;&#21512;&#20316;&#12289;&#36947;&#24503;&#32771;&#34385;&#20197;&#21450;&#22312;&#21508;&#20010;&#39046;&#22495;&#30340;&#24191;&#27867;&#24212;&#29992;&#24433;&#21709;&#12290;&#36890;&#36807;&#36825;&#19968;&#25506;&#32034;&#65292;&#30740;&#31350;&#25581;&#31034;&#20102;LPtM&#22686;&#24378;HAI&#30340;&#21464;&#38761;&#24615;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04931v1 Announce Type: new  Abstract: In the rapidly evolving landscape of artificial intelligence (AI), the collaboration between human intelligence and AI systems, known as Human-AI (HAI) Teaming, has emerged as a cornerstone for advancing problem-solving and decision-making processes. The advent of Large Pre-trained Models (LPtM) has significantly transformed this landscape, offering unprecedented capabilities by leveraging vast amounts of data to understand and predict complex patterns. This paper surveys the pivotal integration of LPtMs with HAI, emphasizing how these models enhance collaborative intelligence beyond traditional approaches. It examines the synergistic potential of LPtMs in augmenting human capabilities, discussing this collaboration for AI model improvements, effective teaming, ethical considerations, and their broad applied implications in various sectors. Through this exploration, the study sheds light on the transformative impact of LPtM-enhanced HAI 
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20004;&#39033;&#30740;&#31350;&#65292;&#25581;&#31034;&#20102;MAP-Elites&#22312;&#20154;&#26426;&#21327;&#21516;&#35774;&#35745;&#20013;&#23545;&#25628;&#32034;&#31354;&#38388;&#30340;&#20316;&#29992;&#12290;&#36825;&#20123;&#30740;&#31350;&#20351;&#29992;&#20102;&#22522;&#20110;&#36827;&#21270;&#31639;&#27861;&#30340;&#35774;&#35745;&#24037;&#20855;&#65292;&#20197;&#23454;&#29616;&#35774;&#35745;&#25512;&#33616;&#23545;&#35774;&#35745;&#36807;&#31243;&#30340;&#24433;&#21709;&#30340;&#29702;&#35299;&#12290;</title><link>https://arxiv.org/abs/2402.07911</link><description>&lt;p&gt;
MAP-Elites&#24212;&#29992;&#20110;&#20154;&#26426;&#21327;&#21516;&#35774;&#35745;&#20013;&#65292;&#26174;&#29616;&#25628;&#32034;&#31354;&#38388;&#30340;&#20316;&#29992;&#65306;&#19968;&#39033;&#22823;&#35268;&#27169;&#29992;&#25143;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Does mapping elites illuminate search spaces? A large-scale user study of MAP--Elites applied to human--AI collaborative design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07911
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20004;&#39033;&#30740;&#31350;&#65292;&#25581;&#31034;&#20102;MAP-Elites&#22312;&#20154;&#26426;&#21327;&#21516;&#35774;&#35745;&#20013;&#23545;&#25628;&#32034;&#31354;&#38388;&#30340;&#20316;&#29992;&#12290;&#36825;&#20123;&#30740;&#31350;&#20351;&#29992;&#20102;&#22522;&#20110;&#36827;&#21270;&#31639;&#27861;&#30340;&#35774;&#35745;&#24037;&#20855;&#65292;&#20197;&#23454;&#29616;&#35774;&#35745;&#25512;&#33616;&#23545;&#35774;&#35745;&#36807;&#31243;&#30340;&#24433;&#21709;&#30340;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#20102;&#35299;&#35774;&#35745;&#24314;&#35758;&#23545;&#35774;&#35745;&#36807;&#31243;&#30340;&#24433;&#21709;&#65292;&#36827;&#34892;&#20102;&#20004;&#39033;&#20154;&#24037;&#26234;&#33021;&#21327;&#21516;&#35774;&#35745;&#24037;&#20855;&#30340;&#30740;&#31350;&#12290;&#25152;&#30740;&#31350;&#30340;&#24037;&#20855;&#22522;&#20110;&#36827;&#21270;&#31639;&#27861;&#65292;&#26088;&#22312;&#35774;&#35745;&#19968;&#36742;&#22312;&#22266;&#23450;&#26102;&#38388;&#20869;&#34892;&#39542;&#26368;&#36828;&#30340;&#34394;&#25311;&#27773;&#36710;&#12290;&#21442;&#19982;&#32773;&#21487;&#20197;&#35774;&#35745;&#33258;&#24049;&#30340;&#27773;&#36710;&#65292;&#21521;&#31639;&#27861;&#25552;&#20986;&#24314;&#35758;&#65292;&#24182;&#26597;&#30475;&#31639;&#27861;&#25552;&#20379;&#30340;&#19968;&#31995;&#21015;&#24314;&#35758;&#12290;&#31639;&#27861;&#25552;&#20379;&#30340;&#35774;&#35745;&#26159;&#20043;&#21069;&#32463;&#36807;&#27979;&#35797;&#30340;&#35774;&#35745;&#65307;&#20854;&#20013;&#19968;&#20123;&#26159;&#38543;&#26426;&#36873;&#25321;&#30340;&#65292;&#21478;&#19968;&#20123;&#26159;&#20351;&#29992;MAP-Elites&#36873;&#25321;&#30340;&#12290;&#22312;&#31532;&#19968;&#39033;&#30740;&#31350;&#20013;&#65292;&#20316;&#20026;&#31185;&#23398;&#26222;&#21450;&#35745;&#21010;&#30340;&#19968;&#37096;&#20998;&#65292;&#35760;&#24405;&#20102;808&#27425;&#35774;&#35745;&#20250;&#35805;&#65292;&#27599;&#27425;&#20250;&#35805;&#37117;&#26377;&#21442;&#19982;&#32773;&#20351;&#29992;&#24037;&#20855;&#30340;&#20998;&#26512;&#25968;&#25454;&#12290;&#20026;&#20102;&#25552;&#20379;&#23450;&#37327;&#25968;&#25454;&#30340;&#32972;&#26223;&#20449;&#24687;&#65292;&#36824;&#36827;&#34892;&#20102;&#19968;&#39033;&#21253;&#21547;12&#20301;&#21442;&#19982;&#32773;&#30340;&#21452;&#30450;&#23454;&#39564;&#23460;&#30740;&#31350;&#12290;&#22312;&#23454;&#39564;&#23460;&#30740;&#31350;&#20013;&#65292;&#25910;&#38598;&#20102;&#19982;&#22823;&#35268;&#27169;&#30740;&#31350;&#30340;&#30456;&#21516;&#23450;&#37327;&#25968;&#25454;&#65292;&#24182;&#25910;&#38598;&#20102;&#23545;&#35775;&#35848;&#38382;&#39064;&#30340;&#22238;&#31572;&#12290;
&lt;/p&gt;
&lt;p&gt;
Two studies of a human-AI collaborative design tool were carried out in order to understand the influence design recommendations have on the design process. The tool investigated is based on an evolutionary algorithm attempting to design a virtual car to travel as far as possible in a fixed time. Participants were able to design their own cars, make recommendations to the algorithm and view sets of recommendations from the algorithm. The algorithm-recommended sets were designs which had been previously tested; some sets were simply randomly picked and other sets were picked using MAP-Elites. In the first study 808 design sessions were recorded as part of a science outreach program, each with analytical data of how each participant used the tool. To provide context to this quantitative data, a smaller double-blind lab study was also carried out with 12 participants. In the lab study the same quantitative data from the large scale study was collected alongside responses to interview ques
&lt;/p&gt;</description></item></channel></rss>