<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#29992;&#20110;&#26426;&#22120;&#23398;&#20064;&#30446;&#30340;&#30340;VR&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;108&#21517;&#21442;&#19982;&#32773;&#22312;VR&#20013;&#23398;&#20064;&#32452;&#35013;&#20004;&#31181;&#19981;&#21516;&#20840;&#23610;&#23544;&#32467;&#26500;&#30340;&#25968;&#25454;&#65292;&#24182;&#25506;&#35752;&#20102;&#26410;&#26469;&#30740;&#31350;&#20154;&#21592;&#22914;&#20309;&#21033;&#29992;&#36825;&#20010;&#25968;&#25454;&#38598;&#12290;</title><link>https://arxiv.org/abs/2403.08969</link><description>&lt;p&gt;
&#20840;&#23610;&#23544;&#35013;&#37197;&#27169;&#25311;&#27979;&#35797;&#21488;&#65288;FAST&#65289;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
The Full-scale Assembly Simulation Testbed (FAST) Dataset
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08969
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#29992;&#20110;&#26426;&#22120;&#23398;&#20064;&#30446;&#30340;&#30340;VR&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;108&#21517;&#21442;&#19982;&#32773;&#22312;VR&#20013;&#23398;&#20064;&#32452;&#35013;&#20004;&#31181;&#19981;&#21516;&#20840;&#23610;&#23544;&#32467;&#26500;&#30340;&#25968;&#25454;&#65292;&#24182;&#25506;&#35752;&#20102;&#26410;&#26469;&#30740;&#31350;&#20154;&#21592;&#22914;&#20309;&#21033;&#29992;&#36825;&#20010;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#35768;&#22810;&#30740;&#31350;&#20154;&#21592;&#24050;&#32463;&#24320;&#22987;&#30740;&#31350;&#34394;&#25311;&#29616;&#23454;&#65288;VR&#65289;&#36319;&#36394;&#21644;&#20132;&#20114;&#25968;&#25454;&#22914;&#20309;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#30446;&#30340;&#65292;&#21253;&#25324;&#29992;&#25143;&#35782;&#21035;&#12289;&#39044;&#27979;&#32593;&#32476;&#26197;&#21160;&#30151;&#21644;&#20272;&#31639;&#23398;&#20064;&#22686;&#30410;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#20844;&#24320;&#25968;&#25454;&#38598;&#65292;&#35813;&#25968;&#25454;&#38598;&#26159;&#20351;&#29992;&#25105;&#20204;&#30340;&#22522;&#20110;VR&#30340;&#20840;&#23610;&#23544;&#35013;&#37197;&#27169;&#25311;&#27979;&#35797;&#21488;&#65288;FAST&#65289;&#25429;&#33719;&#30340;&#12290;&#36825;&#20010;&#25968;&#25454;&#38598;&#21253;&#25324;&#20174;108&#21517;&#21442;&#19982;&#32773;&#65288;50&#21517;&#22899;&#24615;&#65292;56&#21517;&#30007;&#24615;&#65292;2&#21517;&#38750;&#20108;&#20803;&#24615;&#21035;&#65289;&#23398;&#20064;&#22914;&#20309;&#22312;VR&#20013;&#32452;&#35013;&#20004;&#31181;&#19981;&#21516;&#20840;&#23610;&#23544;&#32467;&#26500;&#26102;&#25910;&#38598;&#30340;&#25968;&#25454;&#12290;&#38500;&#20102;&#35299;&#37322;&#25968;&#25454;&#38598;&#26159;&#22914;&#20309;&#25910;&#38598;&#30340;&#24182;&#25551;&#36848;&#21253;&#21547;&#30340;&#25968;&#25454;&#22806;&#65292;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#26410;&#26469;&#30740;&#31350;&#20154;&#21592;&#22914;&#20309;&#20351;&#29992;&#36825;&#20010;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08969v1 Announce Type: cross  Abstract: In recent years, numerous researchers have begun investigating how virtual reality (VR) tracking and interaction data can be used for a variety of machine learning purposes, including user identification, predicting cybersickness, and estimating learning gains. One constraint for this research area is the dearth of open datasets. In this paper, we present a new open dataset captured with our VR-based Full-scale Assembly Simulation Testbed (FAST). This dataset consists of data collected from 108 participants (50 females, 56 males, 2 non-binary) learning how to assemble two distinct full-scale structures in VR. In addition to explaining how the dataset was collected and describing the data included, we discuss how the dataset may be used by future researchers.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#33402;&#26415;&#23478;&#19982;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#21019;&#24847;&#32534;&#31243;&#20013;&#30340;&#33402;&#26415;&#28508;&#21147;&#65292;&#24182;&#27604;&#36739;&#20102;&#20004;&#31181;&#21512;&#20316;&#26041;&#24335;&#12290;&#30740;&#31350;&#21457;&#29616;&#21453;&#24605;&#31867;&#22411;&#19982;&#29992;&#25143;&#34920;&#29616;&#12289;&#29992;&#25143;&#28385;&#24847;&#24230;&#21644;&#20027;&#35266;&#20307;&#39564;&#30456;&#20851;&#12290;&#36890;&#36807;&#23454;&#39564;&#25968;&#25454;&#21644;&#23450;&#24615;&#35775;&#35848;&#65292;&#25105;&#20204;&#20174;&#33402;&#26415;&#23478;&#30340;&#35282;&#24230;&#25552;&#20379;&#20102;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#25209;&#21028;&#24615;&#35270;&#35282;&#21644;&#35774;&#35745;&#24314;&#35758;&#12290;</title><link>https://arxiv.org/abs/2402.09750</link><description>&lt;p&gt;
&#25506;&#32034;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#33402;&#26415;&#21019;&#20316;&#20013;&#30340;&#28508;&#21147;&#65306;&#33402;&#26415;&#23478;&#19982;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#20013;&#30340;&#21019;&#24847;&#32534;&#31243;&#21644;&#21453;&#24605;
&lt;/p&gt;
&lt;p&gt;
Exploring the Potential of Large Language Models in Artistic Creation: Collaboration and Reflection on Creative Programming
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09750
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#33402;&#26415;&#23478;&#19982;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#21019;&#24847;&#32534;&#31243;&#20013;&#30340;&#33402;&#26415;&#28508;&#21147;&#65292;&#24182;&#27604;&#36739;&#20102;&#20004;&#31181;&#21512;&#20316;&#26041;&#24335;&#12290;&#30740;&#31350;&#21457;&#29616;&#21453;&#24605;&#31867;&#22411;&#19982;&#29992;&#25143;&#34920;&#29616;&#12289;&#29992;&#25143;&#28385;&#24847;&#24230;&#21644;&#20027;&#35266;&#20307;&#39564;&#30456;&#20851;&#12290;&#36890;&#36807;&#23454;&#39564;&#25968;&#25454;&#21644;&#23450;&#24615;&#35775;&#35848;&#65292;&#25105;&#20204;&#20174;&#33402;&#26415;&#23478;&#30340;&#35282;&#24230;&#25552;&#20379;&#20102;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#25209;&#21028;&#24615;&#35270;&#35282;&#21644;&#35774;&#35745;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#36741;&#21161;&#32534;&#31243;&#26041;&#38754;&#30340;&#28508;&#21147;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#30740;&#31350;&#27809;&#26377;&#25506;&#32034;LLMs&#22312;&#33402;&#26415;&#23478;&#19982;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#21019;&#36896;&#24615;&#32534;&#31243;&#20013;&#30340;&#33402;&#26415;&#28508;&#21147;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#25506;&#32034;&#20102;&#22312;&#36825;&#31181;&#21512;&#20316;&#36807;&#31243;&#20013;&#33402;&#26415;&#23478;&#30340;&#21453;&#24605;&#31867;&#22411;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#20004;&#31181;&#24120;&#35265;&#30340;&#21512;&#20316;&#26041;&#24335;&#65306;&#35843;&#29992;&#25972;&#20010;&#31243;&#24207;&#21644;&#22810;&#20010;&#23376;&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#23637;&#31034;&#20102;&#33402;&#26415;&#23478;&#22312;&#20004;&#31181;&#19981;&#21516;&#26041;&#27861;&#20013;&#19981;&#21516;&#30340;&#21050;&#28608;&#24615;&#21453;&#24605;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#36824;&#26174;&#31034;&#20102;&#21453;&#24605;&#31867;&#22411;&#19982;&#29992;&#25143;&#34920;&#29616;&#12289;&#29992;&#25143;&#28385;&#24847;&#24230;&#21644;&#20027;&#35266;&#20307;&#39564;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#36890;&#36807;&#36827;&#34892;&#20004;&#31181;&#26041;&#27861;&#65292;&#21253;&#25324;&#23454;&#39564;&#25968;&#25454;&#21644;&#23450;&#24615;&#35775;&#35848;&#12290;&#22312;&#36825;&#20010;&#24847;&#20041;&#19978;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#25581;&#31034;&#20102;LLM&#22312;&#21019;&#24847;&#32534;&#31243;&#20013;&#30340;&#33402;&#26415;&#28508;&#21147;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#20174;&#33402;&#26415;&#23478;&#30340;&#35282;&#24230;&#25552;&#20379;&#20102;&#20154;&#24037;&#26234;&#33021;&#21512;&#20316;&#30340;&#25209;&#21028;&#24615;&#35270;&#35282;&#65292;&#24182;&#38416;&#36848;&#20102;&#35774;&#35745;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09750v1 Announce Type: cross  Abstract: Recently, the potential of large language models (LLMs) has been widely used in assisting programming. However, current research does not explore the artist potential of LLMs in creative coding within artist and AI collaboration. Our work probes the reflection type of artists in the creation process with such collaboration. We compare two common collaboration approaches: invoking the entire program and multiple subtasks. Our findings exhibit artists' different stimulated reflections in two different methods. Our finding also shows the correlation of reflection type with user performance, user satisfaction, and subjective experience in two collaborations through conducting two methods, including experimental data and qualitative interviews. In this sense, our work reveals the artistic potential of LLM in creative coding. Meanwhile, we provide a critical lens of human-AI collaboration from the artists' perspective and expound design sugg
&lt;/p&gt;</description></item></channel></rss>