<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#36825;&#39033;&#30740;&#31350;&#27604;&#36739;&#20102;&#22312;&#30693;&#35782;&#23494;&#38598;&#22411;&#29615;&#22659;&#20013;&#22522;&#20110;LLM&#30340;&#35748;&#30693;&#21161;&#25163;&#21644;&#22522;&#20110;&#24847;&#22270;&#30340;&#31995;&#32479;&#65292;&#24182;&#21457;&#29616;&#22522;&#20110;LLM&#30340;&#35748;&#30693;&#21161;&#25163;&#22312;&#29992;&#25143;&#20307;&#39564;&#12289;&#20219;&#21153;&#23436;&#25104;&#29575;&#12289;&#21487;&#29992;&#24615;&#21644;&#20010;&#20154;&#25928;&#33021;&#26041;&#38754;&#34920;&#29616;&#26356;&#22909;&#12290;</title><link>https://arxiv.org/abs/2402.04955</link><description>&lt;p&gt;
&#22312;&#30693;&#35782;&#23494;&#38598;&#22411;&#29615;&#22659;&#20013;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#65306;&#27604;&#36739;&#24847;&#22270;&#21644;&#22522;&#20110;LLM&#30340;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Chatbots in Knowledge-Intensive Contexts: Comparing Intent and LLM-Based Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04955
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#27604;&#36739;&#20102;&#22312;&#30693;&#35782;&#23494;&#38598;&#22411;&#29615;&#22659;&#20013;&#22522;&#20110;LLM&#30340;&#35748;&#30693;&#21161;&#25163;&#21644;&#22522;&#20110;&#24847;&#22270;&#30340;&#31995;&#32479;&#65292;&#24182;&#21457;&#29616;&#22522;&#20110;LLM&#30340;&#35748;&#30693;&#21161;&#25163;&#22312;&#29992;&#25143;&#20307;&#39564;&#12289;&#20219;&#21153;&#23436;&#25104;&#29575;&#12289;&#21487;&#29992;&#24615;&#21644;&#20010;&#20154;&#25928;&#33021;&#26041;&#38754;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35748;&#30693;&#21161;&#25163;&#26159;&#22312;&#30693;&#35782;&#23494;&#38598;&#22411;&#20219;&#21153;&#20013;&#20026;&#20154;&#31867;&#24037;&#20316;&#32773;&#25552;&#20379;&#19978;&#19979;&#25991;&#24863;&#30693;&#25903;&#25345;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#12290;&#20256;&#32479;&#19978;&#65292;&#35748;&#30693;&#21161;&#25163;&#20197;&#29305;&#23450;&#26041;&#24335;&#22238;&#24212;&#39044;&#23450;&#20041;&#30340;&#29992;&#25143;&#24847;&#22270;&#21644;&#23545;&#35805;&#27169;&#24335;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#21018;&#24615;&#23545;&#33258;&#28982;&#35821;&#35328;&#30340;&#22810;&#26679;&#24615;&#22788;&#29702;&#19981;&#22909;&#12290;&#26368;&#36817;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#36827;&#23637;&#65292;&#22914;GPT-4&#12289;Llama2&#21644;Gemini&#31561;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#65292;&#21487;&#33021;&#20351;&#35748;&#30693;&#21161;&#25163;&#33021;&#22815;&#20197;&#26356;&#28789;&#27963;&#12289;&#26356;&#20687;&#20154;&#31867;&#30340;&#26041;&#24335;&#36827;&#34892;&#23545;&#35805;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#39069;&#22806;&#30340;&#33258;&#30001;&#24230;&#21487;&#33021;&#20250;&#20135;&#29983;&#24847;&#24819;&#19981;&#21040;&#30340;&#21518;&#26524;&#65292;&#29305;&#21035;&#26159;&#22312;&#20934;&#30830;&#24615;&#33267;&#20851;&#37325;&#35201;&#30340;&#30693;&#35782;&#23494;&#38598;&#22411;&#29615;&#22659;&#20013;&#12290;&#20026;&#20102;&#35780;&#20272;&#22312;&#36825;&#20123;&#29615;&#22659;&#20013;&#20351;&#29992;LLM&#30340;&#28508;&#21147;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#29992;&#25143;&#30740;&#31350;&#65292;&#27604;&#36739;&#20102;&#22522;&#20110;LLM&#30340;&#35748;&#30693;&#21161;&#25163;&#21644;&#22522;&#20110;&#24847;&#22270;&#30340;&#31995;&#32479;&#22312;&#20132;&#20114;&#25928;&#29575;&#12289;&#29992;&#25143;&#20307;&#39564;&#12289;&#24037;&#20316;&#37327;&#21644;&#21487;&#29992;&#24615;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22522;&#20110;LLM&#30340;&#35748;&#30693;&#21161;&#25163;&#22312;&#29992;&#25143;&#20307;&#39564;&#12289;&#20219;&#21153;&#23436;&#25104;&#29575;&#12289;&#21487;&#29992;&#24615;&#21644;&#20010;&#20154;&#25928;&#33021;&#26041;&#38754;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cognitive assistants (CA) are chatbots that provide context-aware support to human workers in knowledge-intensive tasks. Traditionally, cognitive assistants respond in specific ways to predefined user intents and conversation patterns. However, this rigidness does not handle the diversity of natural language well. Recent advances in natural language processing (NLP), powering large language models (LLM) such as GPT-4, Llama2, and Gemini, could enable CAs to converse in a more flexible, human-like manner. However, the additional degrees of freedom may have unforeseen consequences, especially in knowledge-intensive contexts where accuracy is crucial. As a preliminary step to assessing the potential of using LLMs in these contexts, we conducted a user study comparing an LLM-based CA to an intent-based system regarding interaction efficiency, user experience, workload, and usability. This revealed that LLM-based CAs exhibited better user experience, task completion rate, usability, and per
&lt;/p&gt;</description></item></channel></rss>