<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>BlendScape&#36890;&#36807;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#23454;&#29616;&#20102;&#29992;&#25143;&#23450;&#21046;&#35270;&#39057;&#20250;&#35758;&#29615;&#22659;&#65292;&#25903;&#25345;&#28789;&#27963;&#30340;&#20219;&#21153;&#31354;&#38388;&#34920;&#31034;&#21644;&#22810;&#27169;&#20132;&#20114;&#25216;&#26415;&#65292;&#20351;&#29992;&#25143;&#33021;&#22815;&#24555;&#36895;&#34920;&#36798;&#35774;&#35745;&#24847;&#22270;&#24182;&#35774;&#24819;&#26410;&#26469;&#20250;&#35758;&#20013;&#30340;&#21327;&#20316;&#32467;&#26500;&#12290;</title><link>https://arxiv.org/abs/2403.13947</link><description>&lt;p&gt;
BlendScape: &#36890;&#36807;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#23454;&#29616;&#32479;&#19968;&#21644;&#20010;&#24615;&#21270;&#35270;&#39057;&#20250;&#35758;&#29615;&#22659;
&lt;/p&gt;
&lt;p&gt;
BlendScape: Enabling Unified and Personalized Video-Conferencing Environments through Generative AI
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13947
&lt;/p&gt;
&lt;p&gt;
BlendScape&#36890;&#36807;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#23454;&#29616;&#20102;&#29992;&#25143;&#23450;&#21046;&#35270;&#39057;&#20250;&#35758;&#29615;&#22659;&#65292;&#25903;&#25345;&#28789;&#27963;&#30340;&#20219;&#21153;&#31354;&#38388;&#34920;&#31034;&#21644;&#22810;&#27169;&#20132;&#20114;&#25216;&#26415;&#65292;&#20351;&#29992;&#25143;&#33021;&#22815;&#24555;&#36895;&#34920;&#36798;&#35774;&#35745;&#24847;&#22270;&#24182;&#35774;&#24819;&#26410;&#26469;&#20250;&#35758;&#20013;&#30340;&#21327;&#20316;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20170;&#30340;&#35270;&#39057;&#20250;&#35758;&#24037;&#20855;&#25903;&#25345;&#20016;&#23500;&#30340;&#19987;&#19994;&#21644;&#31038;&#20132;&#27963;&#21160;&#65292;&#20294;&#23427;&#20204;&#30340;&#36890;&#29992;&#12289;&#22522;&#20110;&#32593;&#26684;&#30340;&#29615;&#22659;&#26080;&#27861;&#36731;&#26494;&#22320;&#36866;&#24212;&#20998;&#24067;&#24335;&#21512;&#20316;&#32773;&#30340;&#21508;&#31181;&#38656;&#27714;&#12290;&#20026;&#20102;&#23454;&#29616;&#26368;&#32456;&#29992;&#25143;&#23450;&#21046;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;BlendScape&#65292;&#36825;&#26159;&#19968;&#20010;&#31995;&#32479;&#65292;&#36890;&#36807;&#21033;&#29992;AI&#22270;&#20687;&#29983;&#25104;&#25216;&#26415;&#65292;&#20801;&#35768;&#20250;&#35758;&#21442;&#19982;&#32773;&#26500;&#24314;&#26681;&#25454;&#20182;&#20204;&#30340;&#21327;&#20316;&#32972;&#26223;&#23450;&#21046;&#30340;&#35270;&#39057;&#20250;&#35758;&#29615;&#22659;&#12290;BlendScape&#36890;&#36807;&#23558;&#29992;&#25143;&#30340;&#29289;&#29702;&#25110;&#34394;&#25311;&#32972;&#26223;&#34701;&#21512;&#21040;&#32479;&#19968;&#29615;&#22659;&#20013;&#25903;&#25345;&#20219;&#21153;&#31354;&#38388;&#30340;&#28789;&#27963;&#34920;&#31034;&#65292;&#24182;&#23454;&#29616;&#20102;&#22810;&#27169;&#20132;&#20114;&#25216;&#26415;&#20197;&#24341;&#23548;&#29983;&#25104;&#36807;&#31243;&#12290;&#36890;&#36807;&#19982;15&#21517;&#26368;&#32456;&#29992;&#25143;&#30340;&#35780;&#20272;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#20182;&#20204;&#23545;&#24037;&#20316;&#21644;&#31038;&#20132;&#22330;&#26223;&#30340;&#23450;&#21046;&#20559;&#22909;&#12290;&#21442;&#19982;&#32773;&#21487;&#20197;&#24555;&#36895;&#34920;&#36798;&#20182;&#20204;&#23545;BlendScape&#30340;&#35774;&#35745;&#24847;&#22270;&#65292;&#24182;&#35774;&#24819;&#20351;&#29992;&#35813;&#31995;&#32479;&#26469;&#32452;&#32455;&#26410;&#26469;&#20250;&#35758;&#20013;&#30340;&#21327;&#20316;&#65292;&#20294;&#20063;&#36935;&#21040;&#20102;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13947v1 Announce Type: cross  Abstract: Today's video-conferencing tools support a rich range of professional and social activities, but their generic, grid-based environments cannot be easily adapted to meet the varying needs of distributed collaborators. To enable end-user customization, we developed BlendScape, a system for meeting participants to compose video-conferencing environments tailored to their collaboration context by leveraging AI image generation techniques. BlendScape supports flexible representations of task spaces by blending users' physical or virtual backgrounds into unified environments and implements multimodal interaction techniques to steer the generation. Through an evaluation with 15 end-users, we investigated their customization preferences for work and social scenarios. Participants could rapidly express their design intentions with BlendScape and envisioned using the system to structure collaboration in future meetings, but experienced challenge
&lt;/p&gt;</description></item><item><title>&#26681;&#25454; &#8220;&#19977;&#24605;&#32780;&#21518;&#35821;&#8221; &#34892;&#20026;&#21551;&#21457;&#65292;&#25552;&#20986;&#19968;&#31181;&#20004;&#38454;&#27573;&#23545;&#35805;&#20195;&#29702;&#29992;&#20110;&#29983;&#25104;&#24773;&#24863;&#23545;&#35805;&#65292;&#35813;&#20195;&#29702;&#22312;&#24773;&#24863;&#29983;&#25104;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#27169;&#22411;&#65292;&#24182;&#20445;&#25345;&#20102;&#35821;&#20041;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2301.04907</link><description>&lt;p&gt;
Think Twice&#65306;&#19968;&#31181;&#20154;&#31867;&#21270;&#30340;&#20004;&#38454;&#27573;&#23545;&#35805;&#20195;&#29702;&#29992;&#20110;&#29983;&#25104;&#24773;&#24863;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Think Twice: A Human-like Two-stage Conversational Agent for Emotional Response Generation. (arXiv:2301.04907v2 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.04907
&lt;/p&gt;
&lt;p&gt;
&#26681;&#25454; &#8220;&#19977;&#24605;&#32780;&#21518;&#35821;&#8221; &#34892;&#20026;&#21551;&#21457;&#65292;&#25552;&#20986;&#19968;&#31181;&#20004;&#38454;&#27573;&#23545;&#35805;&#20195;&#29702;&#29992;&#20110;&#29983;&#25104;&#24773;&#24863;&#23545;&#35805;&#65292;&#35813;&#20195;&#29702;&#22312;&#24773;&#24863;&#29983;&#25104;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#27169;&#22411;&#65292;&#24182;&#20445;&#25345;&#20102;&#35821;&#20041;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#20154;&#31867;&#21270;&#30340;&#23545;&#35805;&#31995;&#32479;&#65292;&#30446;&#21069;&#24773;&#24863;&#23545;&#35805;&#26041;&#27861;&#37319;&#29992;&#32479;&#19968;&#30340;&#31070;&#32463;&#32593;&#32476;&#32852;&#21512;&#27169;&#22411;&#24773;&#24863;&#21644;&#35821;&#20041;&#12290;&#36825;&#31181;&#31574;&#30053;&#30001;&#20110;&#24773;&#24863;&#21644;&#35821;&#20041;&#20043;&#38388;&#30340;&#30456;&#20114;&#38480;&#21046;&#24448;&#24448;&#20250;&#20135;&#29983;&#23433;&#20840;&#30340;&#21709;&#24212;&#65292;&#24182;&#19988;&#38656;&#35201;&#32597;&#35265;&#30340;&#24773;&#24863;&#26631;&#27880;&#22823;&#35268;&#27169;&#23545;&#35805;&#35821;&#26009;&#24211;&#12290;&#21463;&#21040;&#20154;&#31867;&#23545;&#35805;&#20013;&#8220;&#19977;&#24605;&#32780;&#21518;&#35821;&#8221;&#30340;&#34892;&#20026;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#24773;&#24863;&#23545;&#35805;&#30340;&#20004;&#38454;&#27573;&#23545;&#35805;&#20195;&#29702;&#12290;&#39318;&#20808;&#65292;&#19968;&#20010;&#27809;&#26377;&#20351;&#29992;&#24773;&#24863;&#26631;&#27880;&#23545;&#35805;&#35821;&#26009;&#24211;&#35757;&#32451;&#30340;&#23545;&#35805;&#27169;&#22411;&#29983;&#25104;&#31526;&#21512;&#19978;&#19979;&#25991;&#35821;&#20041;&#30340;&#21407;&#22411;&#21709;&#24212;&#12290;&#20854;&#27425;&#65292;&#31532;&#19968;&#38454;&#27573;&#21407;&#22411;&#23558;&#36890;&#36807;&#19968;&#20010;&#21487;&#25511;&#30340;&#24773;&#24863;&#20248;&#21270;&#22120;&#19982;&#20849;&#24773;&#20551;&#35774;&#36827;&#34892;&#20462;&#25913;&#12290;&#22312;DailyDialog&#21644;EmpatheticDialogues&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#23545;&#35805;&#20195;&#29702;&#22312;&#24773;&#24863;&#29983;&#25104;&#26041;&#38754;&#20248;&#20110;&#27604;&#36739;&#27169;&#22411;&#65292;&#24182;&#22312;&#33258;&#21160;&#21644;&#20154;&#31867;&#35780;&#20272;&#20013;&#20445;&#25345;&#20102;&#35821;&#20041;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Towards human-like dialogue systems, current emotional dialogue approaches jointly model emotion and semantics with a unified neural network. This strategy tends to generate safe responses due to the mutual restriction between emotion and semantics, and requires rare emotion-annotated large-scale dialogue corpus. Inspired by the "think twice" behavior in human dialogue, we propose a two-stage conversational agent for the generation of emotional dialogue. Firstly, a dialogue model trained without the emotion-annotated dialogue corpus generates a prototype response that meets the contextual semantics. Secondly, the first-stage prototype is modified by a controllable emotion refiner with the empathy hypothesis. Experimental results on the DailyDialog and EmpatheticDialogues datasets demonstrate that the proposed conversational outperforms the comparison models in emotion generation and maintains the semantic performance in automatic and human evaluations.
&lt;/p&gt;</description></item></channel></rss>