<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#25552;&#20986;&#20102;&#20004;&#20010;&#20114;&#34917;&#30340;&#26041;&#21521;&#24863;&#30693;&#25439;&#22833;&#39033;&#65292;&#24378;&#35843;&#25968;&#25454;&#30340;&#26102;&#38388;&#26041;&#38754;&#65292;&#24341;&#23548;&#20248;&#21270;&#21644;&#32467;&#26524;&#23884;&#20837;&#20197;&#23637;&#31034;&#21487;&#33021;&#34987;&#24573;&#30053;&#30340;&#26102;&#38388;&#27169;&#24335;&#12290;</title><link>https://arxiv.org/abs/2403.19040</link><description>&lt;p&gt;
&#20351;&#29992;&#26041;&#21521;&#24863;&#30693;t-SNE&#21487;&#35270;&#21270;&#39640;&#32500;&#26102;&#38388;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Visualizing High-Dimensional Temporal Data Using Direction-Aware t-SNE
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19040
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#20004;&#20010;&#20114;&#34917;&#30340;&#26041;&#21521;&#24863;&#30693;&#25439;&#22833;&#39033;&#65292;&#24378;&#35843;&#25968;&#25454;&#30340;&#26102;&#38388;&#26041;&#38754;&#65292;&#24341;&#23548;&#20248;&#21270;&#21644;&#32467;&#26524;&#23884;&#20837;&#20197;&#23637;&#31034;&#21487;&#33021;&#34987;&#24573;&#30053;&#30340;&#26102;&#38388;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#29616;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#21253;&#21547;&#26102;&#38388;&#32452;&#20214;&#25110;&#28041;&#21450;&#20174;&#19968;&#20010;&#29366;&#24577;&#21040;&#21478;&#19968;&#20010;&#29366;&#24577;&#30340;&#36716;&#21464;&#12290;&#20026;&#20102;&#36827;&#34892;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#65292;&#25105;&#20204;&#21487;&#20197;&#23558;&#36825;&#20123;&#39640;&#32500;&#25968;&#25454;&#38598;&#34920;&#31034;&#20026;&#20108;&#32500;&#22320;&#22270;&#65292;&#20351;&#29992;&#25968;&#25454;&#23545;&#35937;&#30340;&#23884;&#20837;&#36827;&#34892;&#25506;&#32034;&#65292;&#24182;&#29992;&#26377;&#21521;&#36793;&#34920;&#31034;&#23427;&#20204;&#30340;&#26102;&#38388;&#20851;&#31995;&#12290;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;&#38477;&#32500;&#25216;&#26415;&#65292;&#22914;t-SNE&#21644;UMAP&#65292;&#22312;&#26500;&#24314;&#23884;&#20837;&#26102;&#26410;&#32771;&#34385;&#25968;&#25454;&#30340;&#26102;&#38388;&#24615;&#25110;&#20851;&#31995;&#24615;&#65292;&#23548;&#33268;&#26102;&#38388;&#19978;&#26434;&#20081;&#30340;&#21487;&#35270;&#21270;&#65292;&#20351;&#28508;&#22312;&#26377;&#36259;&#30340;&#27169;&#24335;&#21464;&#24471;&#27169;&#31946;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#22312;t-SNE&#30340;&#20248;&#21270;&#20989;&#25968;&#20013;&#25552;&#20986;&#20102;&#20004;&#20010;&#20114;&#34917;&#30340;&#26041;&#21521;&#24863;&#30693;&#25439;&#22833;&#39033;&#65292;&#24378;&#35843;&#25968;&#25454;&#30340;&#26102;&#38388;&#26041;&#38754;&#65292;&#24341;&#23548;&#20248;&#21270;&#21644;&#32467;&#26524;&#23884;&#20837;&#20197;&#23637;&#31034;&#21487;&#33021;&#34987;&#24573;&#30053;&#30340;&#26102;&#38388;&#27169;&#24335;&#12290;&#23450;&#21521;&#19968;&#33268;&#25439;&#22833;&#65288;DCL&#65289;&#40723;&#21169;&#38468;&#36817;&#30340;&#31661;&#22836;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19040v1 Announce Type: new  Abstract: Many real-world data sets contain a temporal component or involve transitions from state to state. For exploratory data analysis, we can represent these high-dimensional data sets in two-dimensional maps, using embeddings of the data objects under exploration and representing their temporal relationships with directed edges. Most existing dimensionality reduction techniques, such as t-SNE and UMAP, do not take into account the temporal or relational nature of the data when constructing the embeddings, resulting in temporally cluttered visualizations that obscure potentially interesting patterns. To address this problem, we propose two complementary, direction-aware loss terms in the optimization function of t-SNE that emphasize the temporal aspects of the data, guiding the optimization and the resulting embedding to reveal temporal patterns that might otherwise go unnoticed. The Directional Coherence Loss (DCL) encourages nearby arrows c
&lt;/p&gt;</description></item></channel></rss>