<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;EgoPoser&#65292;&#19968;&#31181;&#33021;&#22815;&#22312;&#22823;&#22330;&#26223;&#20013;&#40065;&#26834;&#22320;&#23454;&#26102;&#20272;&#35745;&#33258;&#25105;&#36523;&#20307;&#23039;&#21183;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#37325;&#26032;&#24605;&#32771;&#36755;&#20837;&#34920;&#31034;&#12289;&#24341;&#20837;&#26032;&#30340;&#36816;&#21160;&#20998;&#35299;&#26041;&#27861;&#20197;&#21450;&#24314;&#27169;&#36523;&#20307;&#23039;&#21183;&#65292;EgoPoser&#22312;&#23450;&#24615;&#21644;&#23450;&#37327;&#19978;&#22343;&#34920;&#29616;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#24182;&#20855;&#26377;&#36739;&#39640;&#30340;&#25512;&#29702;&#36895;&#24230;&#12290;</title><link>http://arxiv.org/abs/2308.06493</link><description>&lt;p&gt;
EgoPoser&#65306;&#22823;&#22330;&#26223;&#19979;&#40065;&#26834;&#30340;&#23454;&#26102;&#33258;&#25105;&#36523;&#20307;&#23039;&#21183;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
EgoPoser: Robust Real-Time Ego-Body Pose Estimation in Large Scenes. (arXiv:2308.06493v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06493
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;EgoPoser&#65292;&#19968;&#31181;&#33021;&#22815;&#22312;&#22823;&#22330;&#26223;&#20013;&#40065;&#26834;&#22320;&#23454;&#26102;&#20272;&#35745;&#33258;&#25105;&#36523;&#20307;&#23039;&#21183;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#37325;&#26032;&#24605;&#32771;&#36755;&#20837;&#34920;&#31034;&#12289;&#24341;&#20837;&#26032;&#30340;&#36816;&#21160;&#20998;&#35299;&#26041;&#27861;&#20197;&#21450;&#24314;&#27169;&#36523;&#20307;&#23039;&#21183;&#65292;EgoPoser&#22312;&#23450;&#24615;&#21644;&#23450;&#37327;&#19978;&#22343;&#34920;&#29616;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#24182;&#20855;&#26377;&#36739;&#39640;&#30340;&#25512;&#29702;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22836;&#37096;&#21644;&#25163;&#37096;&#23039;&#21183;&#20165;&#36890;&#36807;&#23436;&#25972;&#36523;&#20307;&#33258;&#25105;&#23039;&#21183;&#20272;&#35745;&#24050;&#25104;&#20026;&#30740;&#31350;&#30340;&#19968;&#20010;&#28909;&#28857;&#39046;&#22495;&#65292;&#20197;&#20026;&#22836;&#25140;&#24335;&#24179;&#21488;&#19978;&#30340;&#34394;&#25311;&#35282;&#33394;&#34920;&#36798;&#25552;&#20379;&#21160;&#21147;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#36807;&#20110;&#20381;&#36182;&#25968;&#25454;&#38598;&#35760;&#24405;&#26102;&#30340;&#36816;&#21160;&#25429;&#25417;&#31354;&#38388;&#30340;&#38480;&#21046;&#65292;&#21516;&#26102;&#20551;&#35774;&#36830;&#32493;&#25429;&#25417;&#20851;&#33410;&#36816;&#21160;&#21644;&#22343;&#21248;&#36523;&#20307;&#23610;&#23544;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;EgoPoser&#65292;&#36890;&#36807;&#20197;&#19979;&#26041;&#24335;&#20811;&#26381;&#20102;&#36825;&#20123;&#38480;&#21046;&#65306;1&#65289;&#37325;&#26032;&#24605;&#32771;&#22522;&#20110;&#22836;&#25140;&#24335;&#24179;&#21488;&#30340;&#33258;&#25105;&#23039;&#21183;&#20272;&#35745;&#30340;&#36755;&#20837;&#34920;&#31034;&#65292;&#24182;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#36816;&#21160;&#20998;&#35299;&#26041;&#27861;&#26469;&#39044;&#27979;&#19982;&#20840;&#23616;&#20301;&#32622;&#26080;&#20851;&#30340;&#23436;&#25972;&#36523;&#20307;&#23039;&#21183;&#65292;2&#65289;&#20174;&#22836;&#25140;&#24335;&#35774;&#22791;&#35270;&#37326;&#20869;&#30340;&#38388;&#27463;&#24615;&#25163;&#37096;&#23039;&#21183;&#36319;&#36394;&#20013;&#40065;&#26834;&#22320;&#24314;&#27169;&#36523;&#20307;&#23039;&#21183;&#65292;3&#65289;&#38024;&#23545;&#19981;&#21516;&#29992;&#25143;&#30340;&#21508;&#31181;&#36523;&#20307;&#23610;&#23544;&#36827;&#34892;&#36890;&#29992;&#21270;&#25512;&#24191;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;EgoPoser&#22312;&#23450;&#24615;&#21644;&#23450;&#37327;&#19978;&#20248;&#20110;&#29616;&#26377;&#30340;&#26041;&#27861;&#65292;&#24182;&#20445;&#25345;&#36739;&#39640;&#30340;&#25512;&#29702;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Full-body ego-pose estimation from head and hand poses alone has become an active area of research to power articulate avatar representation on headset-based platforms. However, existing methods over-rely on the confines of the motion-capture spaces in which datasets were recorded, while simultaneously assuming continuous capture of joint motions and uniform body dimensions. In this paper, we propose EgoPoser, which overcomes these limitations by 1) rethinking the input representation for headset-based ego-pose estimation and introducing a novel motion decomposition method that predicts full-body pose independent of global positions, 2) robustly modeling body pose from intermittent hand position and orientation tracking only when inside a headset's field of view, and 3) generalizing across various body sizes for different users. Our experiments show that EgoPoser outperforms state-of-the-art methods both qualitatively and quantitatively, while maintaining a high inference speed of over
&lt;/p&gt;</description></item></channel></rss>