<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>Loop Copilot&#26159;&#19968;&#31181;&#26032;&#22411;&#30340;AI&#38899;&#20048;&#21512;&#22863;&#31995;&#32479;&#65292;&#33021;&#22815;&#36890;&#36807;&#20132;&#20114;&#24335;&#22810;&#36718;&#23545;&#35805;&#30028;&#38754;&#29983;&#25104;&#21644;&#36845;&#20195;&#25913;&#36827;&#38899;&#20048;&#65292;&#36890;&#36807;&#36873;&#25321;&#36866;&#24403;&#30340;AI&#27169;&#22411;&#25191;&#34892;&#20219;&#21153;&#65292;&#24182;&#22312;&#19968;&#20010;&#38598;&#20013;&#30340;&#34920;&#20013;&#20445;&#25345;&#20851;&#38190;&#23646;&#24615;&#20197;&#30830;&#20445;&#38899;&#20048;&#30340;&#36830;&#36143;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.12404</link><description>&lt;p&gt;
Loop Copilot: &#29992;&#20110;&#38899;&#20048;&#29983;&#25104;&#21644;&#36845;&#20195;&#32534;&#36753;&#30340;AI&#21512;&#22863;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Loop Copilot: Conducting AI Ensembles for Music Generation and Iterative Editing. (arXiv:2310.12404v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12404
&lt;/p&gt;
&lt;p&gt;
Loop Copilot&#26159;&#19968;&#31181;&#26032;&#22411;&#30340;AI&#38899;&#20048;&#21512;&#22863;&#31995;&#32479;&#65292;&#33021;&#22815;&#36890;&#36807;&#20132;&#20114;&#24335;&#22810;&#36718;&#23545;&#35805;&#30028;&#38754;&#29983;&#25104;&#21644;&#36845;&#20195;&#25913;&#36827;&#38899;&#20048;&#65292;&#36890;&#36807;&#36873;&#25321;&#36866;&#24403;&#30340;AI&#27169;&#22411;&#25191;&#34892;&#20219;&#21153;&#65292;&#24182;&#22312;&#19968;&#20010;&#38598;&#20013;&#30340;&#34920;&#20013;&#20445;&#25345;&#20851;&#38190;&#23646;&#24615;&#20197;&#30830;&#20445;&#38899;&#20048;&#30340;&#36830;&#36143;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21019;&#24314;&#38899;&#20048;&#26159;&#19968;&#20010;&#36845;&#20195;&#36807;&#31243;&#65292;&#27599;&#20010;&#38454;&#27573;&#37117;&#38656;&#35201;&#19981;&#21516;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;AI&#38899;&#20048;&#31995;&#32479;&#22312;&#32452;&#32455;&#22810;&#20010;&#23376;&#31995;&#32479;&#20197;&#28385;&#36275;&#19981;&#21516;&#38656;&#27714;&#26041;&#38754;&#23384;&#22312;&#19981;&#36275;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Loop Copilot&#65292;&#36825;&#26159;&#19968;&#20010;&#33021;&#22815;&#36890;&#36807;&#20132;&#20114;&#24335;&#12289;&#22810;&#36718;&#23545;&#35805;&#30028;&#38754;&#29983;&#25104;&#21644;&#36845;&#20195;&#25913;&#36827;&#38899;&#20048;&#30340;&#26032;&#22411;&#31995;&#32479;&#12290;&#35813;&#31995;&#32479;&#20351;&#29992;&#19968;&#31181;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26469;&#35299;&#37322;&#29992;&#25143;&#24847;&#22270;&#65292;&#24182;&#36873;&#25321;&#36866;&#24403;&#30340;AI&#27169;&#22411;&#36827;&#34892;&#20219;&#21153;&#25191;&#34892;&#12290;&#27599;&#20010;&#21518;&#31471;&#27169;&#22411;&#37117;&#19987;&#38376;&#38024;&#23545;&#29305;&#23450;&#20219;&#21153;&#65292;&#24182;&#23558;&#23427;&#20204;&#30340;&#36755;&#20986;&#32858;&#21512;&#36215;&#26469;&#20197;&#28385;&#36275;&#29992;&#25143;&#30340;&#35201;&#27714;&#12290;&#20026;&#20102;&#30830;&#20445;&#38899;&#20048;&#30340;&#36830;&#36143;&#24615;&#65292;&#20851;&#38190;&#23646;&#24615;&#34987;&#20445;&#30041;&#22312;&#19968;&#20010;&#38598;&#20013;&#30340;&#34920;&#20013;&#12290;&#25105;&#20204;&#36890;&#36807;&#21322;&#32467;&#26500;&#21270;&#30340;&#35775;&#35848;&#21644;&#38382;&#21367;&#35843;&#26597;&#35780;&#20272;&#20102;&#25152;&#25552;&#20986;&#30340;&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#65292;&#31361;&#20986;&#20102;&#23427;&#22312;&#20419;&#36827;&#38899;&#20048;&#21019;&#20316;&#26041;&#38754;&#30340;&#23454;&#29992;&#24615;&#65292;&#20197;&#21450;&#23427;&#22312;&#26356;&#24191;&#27867;&#24212;&#29992;&#20013;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Creating music is iterative, requiring varied methods at each stage. However, existing AI music systems fall short in orchestrating multiple subsystems for diverse needs. To address this gap, we introduce Loop Copilot, a novel system that enables users to generate and iteratively refine music through an interactive, multi-round dialogue interface. The system uses a large language model to interpret user intentions and select appropriate AI models for task execution. Each backend model is specialized for a specific task, and their outputs are aggregated to meet the user's requirements. To ensure musical coherence, essential attributes are maintained in a centralized table. We evaluate the effectiveness of the proposed system through semi-structured interviews and questionnaires, highlighting its utility not only in facilitating music creation but also its potential for broader applications.
&lt;/p&gt;</description></item><item><title>EEGMatch&#26159;&#19968;&#31181;&#21322;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65292;&#21487;&#29992;&#20110;&#33041;&#30005;&#24773;&#32490;&#35782;&#21035;&#12290;&#36890;&#36807;&#22522;&#20110;EEG-Mixup&#30340;&#25968;&#25454;&#22686;&#24378;&#26041;&#27861;&#21644;&#21322;&#30417;&#30563;&#22810;&#22495;&#33258;&#36866;&#24212;&#26041;&#27861;&#65292;&#21487;&#20197;&#26377;&#25928;&#25552;&#39640;&#24773;&#32490;&#35782;&#21035;&#20934;&#30830;&#24615;&#21644;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.06496</link><description>&lt;p&gt;
EEGMatch: &#23398;&#20064;&#19981;&#23436;&#25972;&#26631;&#35760;&#30340;&#21322;&#30417;&#30563;&#33041;&#30005;&#24773;&#32490;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
EEGMatch: Learning with Incomplete Labels for Semi-Supervised EEG-based Cross-Subject Emotion Recognition. (arXiv:2304.06496v1 [eess.SP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06496
&lt;/p&gt;
&lt;p&gt;
EEGMatch&#26159;&#19968;&#31181;&#21322;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65292;&#21487;&#29992;&#20110;&#33041;&#30005;&#24773;&#32490;&#35782;&#21035;&#12290;&#36890;&#36807;&#22522;&#20110;EEG-Mixup&#30340;&#25968;&#25454;&#22686;&#24378;&#26041;&#27861;&#21644;&#21322;&#30417;&#30563;&#22810;&#22495;&#33258;&#36866;&#24212;&#26041;&#27861;&#65292;&#21487;&#20197;&#26377;&#25928;&#25552;&#39640;&#24773;&#32490;&#35782;&#21035;&#20934;&#30830;&#24615;&#21644;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33041;&#30005;&#22270;&#65288;EEG&#65289;&#26159;&#24773;&#32490;&#35782;&#21035;&#30340;&#23458;&#35266;&#24037;&#20855;&#65292;&#24182;&#26174;&#31034;&#20986;&#33391;&#22909;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#26631;&#31614;&#31232;&#32570;&#38382;&#39064;&#26159;&#35813;&#39046;&#22495;&#30340;&#20027;&#35201;&#25361;&#25112;&#65292;&#38480;&#21046;&#20102;&#22522;&#20110;EEG&#30340;&#24773;&#32490;&#35782;&#21035;&#30340;&#24191;&#27867;&#24212;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21322;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65288;EEGMatch&#65289;&#65292;&#20197;&#21033;&#29992;&#26631;&#35760;&#21644;&#26410;&#26631;&#35760;&#30340;EEG&#25968;&#25454;&#12290;&#39318;&#20808;&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;EEG-Mixup&#25968;&#25454;&#22686;&#24378;&#26041;&#27861;&#65292;&#20197;&#29983;&#25104;&#26356;&#22810;&#29992;&#20110;&#27169;&#22411;&#23398;&#20064;&#30340;&#26377;&#25928;&#26679;&#26412;&#12290;&#20854;&#27425;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#30417;&#30563;&#30340;&#20004;&#27493;&#25104;&#23545;&#23398;&#20064;&#26041;&#27861;&#65292;&#23558;&#21407;&#22411;&#24335;&#21644;&#23454;&#20363;&#21270;&#24335;&#25104;&#23545;&#23398;&#20064;&#36830;&#25509;&#36215;&#26469;&#65292;&#20854;&#20013;&#21407;&#22411;&#24335;&#25104;&#23545;&#23398;&#20064;&#34913;&#37327;EEG&#25968;&#25454;&#19982;&#27599;&#20010;&#24773;&#24863;&#31867;&#21035;&#30340;&#21407;&#22411;&#34920;&#31034;&#20043;&#38388;&#30340;&#20840;&#23616;&#20851;&#31995;&#65292;&#32780;&#23454;&#20363;&#21270;&#24335;&#25104;&#23545;&#23398;&#20064;&#25429;&#25417;EEG&#25968;&#25454;&#20043;&#38388;&#30340;&#23616;&#37096;&#20869;&#22312;&#20851;&#31995;&#12290;&#31532;&#19977;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21322;&#30417;&#30563;&#30340;&#22810;&#22495;&#33258;&#36866;&#24212;&#65292;&#20197;&#23545;&#40784;&#22810;&#20010;&#22495;&#65288;&#26631;&#35760;&#30340;&#21644;&#26410;&#26631;&#35760;&#30340;&#25968;&#25454;&#38598;&#65289;&#20043;&#38388;&#30340;&#25968;&#25454;&#34920;&#31034;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;EEGMatch&#22312;&#24773;&#32490;&#35782;&#21035;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#27604;&#29616;&#26377;&#30340;&#21322;&#30417;&#30563;&#26041;&#27861;&#26356;&#39640;&#30340;&#20934;&#30830;&#24615;&#21644;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Electroencephalography (EEG) is an objective tool for emotion recognition and shows promising performance. However, the label scarcity problem is a main challenge in this field, which limits the wide application of EEG-based emotion recognition. In this paper, we propose a novel semi-supervised learning framework (EEGMatch) to leverage both labeled and unlabeled EEG data. First, an EEG-Mixup based data augmentation method is developed to generate more valid samples for model learning. Second, a semi-supervised two-step pairwise learning method is proposed to bridge prototype-wise and instance-wise pairwise learning, where the prototype-wise pairwise learning measures the global relationship between EEG data and the prototypical representation of each emotion class and the instance-wise pairwise learning captures the local intrinsic relationship among EEG data. Third, a semi-supervised multi-domain adaptation is introduced to align the data representation among multiple domains (labeled
&lt;/p&gt;</description></item></channel></rss>