<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>Prismatic&#26159;&#19968;&#20010;&#38598;&#25104;&#21382;&#21490;&#25968;&#25454;&#20998;&#26512;&#21644;&#19994;&#21153;&#20851;&#31995;&#30693;&#35782;&#30340;&#20132;&#20114;&#24335;&#22810;&#35270;&#35282;&#27010;&#24565;&#32929;&#38598;&#32676;&#20998;&#26512;&#31995;&#32479;&#65292;&#36890;&#36807;&#22810;&#35270;&#35282;&#38598;&#32676;&#20998;&#26512;&#26041;&#27861;&#65292;&#20016;&#23500;&#20102;&#25968;&#25454;&#39537;&#21160;&#30340;&#38598;&#32676;&#65292;&#24182;&#25552;&#20379;&#20102;&#32454;&#33268;&#30340;&#19994;&#21153;&#30456;&#20851;&#24615;&#29702;&#35299;&#12290;</title><link>https://arxiv.org/abs/2402.08978</link><description>&lt;p&gt;
Prismatic:&#20132;&#20114;&#24335;&#22810;&#35270;&#35282;&#27010;&#24565;&#32929;&#38598;&#32676;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Prismatic: Interactive Multi-View Cluster Analysis of Concept Stocks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08978
&lt;/p&gt;
&lt;p&gt;
Prismatic&#26159;&#19968;&#20010;&#38598;&#25104;&#21382;&#21490;&#25968;&#25454;&#20998;&#26512;&#21644;&#19994;&#21153;&#20851;&#31995;&#30693;&#35782;&#30340;&#20132;&#20114;&#24335;&#22810;&#35270;&#35282;&#27010;&#24565;&#32929;&#38598;&#32676;&#20998;&#26512;&#31995;&#32479;&#65292;&#36890;&#36807;&#22810;&#35270;&#35282;&#38598;&#32676;&#20998;&#26512;&#26041;&#27861;&#65292;&#20016;&#23500;&#20102;&#25968;&#25454;&#39537;&#21160;&#30340;&#38598;&#32676;&#65292;&#24182;&#25552;&#20379;&#20102;&#32454;&#33268;&#30340;&#19994;&#21153;&#30456;&#20851;&#24615;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08978v1 &#20844;&#21578;&#31867;&#22411;:&#36328;&#39046;&#22495; &#25688;&#35201;:&#37329;&#34701;&#38598;&#32676;&#20998;&#26512;&#20351;&#25237;&#36164;&#32773;&#33021;&#22815;&#21457;&#29616;&#25237;&#36164;&#26367;&#20195;&#21697;&#65292;&#24182;&#36991;&#20813;&#25215;&#25285;&#36807;&#39640;&#30340;&#39118;&#38505;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#20998;&#26512;&#20219;&#21153;&#38754;&#20020;&#35768;&#22810;&#25361;&#25112;&#65292;&#22914;&#22823;&#37327;&#30340;&#20004;&#20004;&#27604;&#36739;&#12289;&#26102;&#38388;&#36328;&#24230;&#30340;&#21160;&#24577;&#30456;&#20851;&#24615;&#20197;&#21450;&#20174;&#19994;&#21153;&#20851;&#31995;&#30693;&#35782;&#20013;&#24471;&#20986;&#25512;&#35770;&#30340;&#27169;&#31946;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;Prismatic&#65292;&#19968;&#31181;&#21487;&#35270;&#21270;&#20998;&#26512;&#31995;&#32479;&#65292;&#23427;&#25972;&#21512;&#20102;&#21382;&#21490;&#24615;&#33021;&#30340;&#23450;&#37327;&#20998;&#26512;&#21644;&#19994;&#21153;&#20851;&#31995;&#30693;&#35782;&#30340;&#23450;&#24615;&#20998;&#26512;&#65292;&#20197;&#20132;&#20114;&#26041;&#24335;&#23545;&#30456;&#20851;&#19994;&#21153;&#36827;&#34892;&#38598;&#32676;&#20998;&#26512;&#12290;Prismatic&#20855;&#26377;&#19977;&#20010;&#38598;&#32676;&#29983;&#25104;&#36807;&#31243;&#65306;&#21160;&#24577;&#38598;&#32676;&#29983;&#25104;&#12289;&#22522;&#20110;&#30693;&#35782;&#30340;&#38598;&#32676;&#25506;&#32034;&#21644;&#22522;&#20110;&#30456;&#20851;&#24615;&#30340;&#38598;&#32676;&#39564;&#35777;&#12290;&#21033;&#29992;&#22810;&#35270;&#35282;&#38598;&#32676;&#20998;&#26512;&#26041;&#27861;&#65292;&#23427;&#36890;&#36807;&#30693;&#35782;&#39537;&#21160;&#30340;&#30456;&#20284;&#24615;&#20016;&#23500;&#20102;&#25968;&#25454;&#39537;&#21160;&#30340;&#38598;&#32676;&#65292;&#25552;&#20379;&#20102;&#23545;&#19994;&#21153;&#30456;&#20851;&#24615;&#30340;&#32454;&#33268;&#29702;&#35299;&#12290;&#36890;&#36807;&#33391;&#22909;&#21327;&#35843;&#30340;&#21487;&#35270;&#21270;&#35270;&#22270;&#65292;Prismatic&#20415;&#20110;&#20102;&#35299;&#20225;&#19994;&#30340;&#20851;&#32852;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08978v1 Announce Type: cross Abstract: Financial cluster analysis allows investors to discover investment alternatives and avoid undertaking excessive risks. However, this analytical task faces substantial challenges arising from many pairwise comparisons, the dynamic correlations across time spans, and the ambiguity in deriving implications from business relational knowledge. We propose Prismatic, a visual analytics system that integrates quantitative analysis of historical performance and qualitative analysis of business relational knowledge to cluster correlated businesses interactively. Prismatic features three clustering processes: dynamic cluster generation, knowledge-based cluster exploration, and correlation-based cluster validation. Utilizing a multi-view clustering approach, it enriches data-driven clusters with knowledge-driven similarity, providing a nuanced understanding of business correlations. Through well-coordinated visual views, Prismatic facilitates a com
&lt;/p&gt;</description></item></channel></rss>