<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#21487;&#35299;&#37322;&#30340;AI&#25216;&#26415;&#23545;&#20110;&#35299;&#20915;&#33258;&#21160;&#39550;&#39542;&#20013;&#30340;&#23433;&#20840;&#38382;&#39064;&#21644;&#20449;&#20219;&#38382;&#39064;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#36890;&#36807;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#30340;&#26041;&#24335;&#65292;&#20998;&#26512;&#20102;&#21487;&#35299;&#37322;&#30340;AI&#26041;&#27861;&#22312;&#28385;&#36275;&#33258;&#21160;&#39550;&#39542;&#35201;&#27714;&#26041;&#38754;&#30340;&#20851;&#38190;&#36129;&#29486;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#35299;&#37322;&#30340;&#35774;&#35745;&#12289;&#21487;&#35299;&#37322;&#30340;&#26367;&#20195;&#27169;&#22411;&#12289;&#21487;&#35299;&#37322;&#30340;&#30417;&#25511;&#12289;&#36741;&#21161;&#25216;&#26415;&#21644;&#35299;&#37322;&#30340;&#21487;&#35270;&#21270;&#31561;&#20116;&#20010;&#26041;&#38754;&#30340;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.10086</link><description>&lt;p&gt;
&#21487;&#35299;&#37322;&#30340;&#20154;&#24037;&#26234;&#33021;&#22312;&#23433;&#20840;&#21487;&#20449;&#30340;&#33258;&#21160;&#39550;&#39542;&#20013;&#30340;&#24212;&#29992;&#65306;&#19968;&#39033;&#31995;&#32479;&#24615;&#35780;&#36848;
&lt;/p&gt;
&lt;p&gt;
Explainable AI for Safe and Trustworthy Autonomous Driving: A Systematic Review
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10086
&lt;/p&gt;
&lt;p&gt;
&#21487;&#35299;&#37322;&#30340;AI&#25216;&#26415;&#23545;&#20110;&#35299;&#20915;&#33258;&#21160;&#39550;&#39542;&#20013;&#30340;&#23433;&#20840;&#38382;&#39064;&#21644;&#20449;&#20219;&#38382;&#39064;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#36890;&#36807;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#30340;&#26041;&#24335;&#65292;&#20998;&#26512;&#20102;&#21487;&#35299;&#37322;&#30340;AI&#26041;&#27861;&#22312;&#28385;&#36275;&#33258;&#21160;&#39550;&#39542;&#35201;&#27714;&#26041;&#38754;&#30340;&#20851;&#38190;&#36129;&#29486;&#65292;&#24182;&#25552;&#20986;&#20102;&#21487;&#35299;&#37322;&#30340;&#35774;&#35745;&#12289;&#21487;&#35299;&#37322;&#30340;&#26367;&#20195;&#27169;&#22411;&#12289;&#21487;&#35299;&#37322;&#30340;&#30417;&#25511;&#12289;&#36741;&#21161;&#25216;&#26415;&#21644;&#35299;&#37322;&#30340;&#21487;&#35270;&#21270;&#31561;&#20116;&#20010;&#26041;&#38754;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#20854;&#22312;&#24863;&#30693;&#21644;&#35268;&#21010;&#20219;&#21153;&#20013;&#30456;&#23545;&#20256;&#32479;&#26041;&#27861;&#20855;&#26377;&#26356;&#20248;&#24322;&#30340;&#24615;&#33021;&#65292;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#23545;&#20110;&#33258;&#21160;&#39550;&#39542;&#65288;AD&#65289;&#30340;&#24212;&#29992;&#26174;&#31034;&#20986;&#20102;&#24456;&#22823;&#30340;&#28508;&#21147;&#12290;&#28982;&#32780;&#65292;&#38590;&#20197;&#29702;&#35299;&#30340;AI&#31995;&#32479;&#21152;&#21095;&#20102;&#23545;AD&#23433;&#20840;&#20445;&#35777;&#30340;&#29616;&#26377;&#25361;&#25112;&#12290;&#32531;&#35299;&#36825;&#19968;&#25361;&#25112;&#30340;&#19968;&#31181;&#26041;&#27861;&#26159;&#21033;&#29992;&#21487;&#35299;&#37322;&#30340;AI&#65288;XAI&#65289;&#25216;&#26415;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#39318;&#27425;&#25552;&#20986;&#20102;&#20851;&#20110;&#21487;&#35299;&#37322;&#26041;&#27861;&#22312;&#23433;&#20840;&#21487;&#20449;&#30340;AD&#20013;&#30340;&#20840;&#38754;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#12290;&#25105;&#20204;&#39318;&#20808;&#20998;&#26512;&#20102;&#22312;AD&#32972;&#26223;&#19979;AI&#30340;&#35201;&#27714;&#65292;&#37325;&#28857;&#20851;&#27880;&#25968;&#25454;&#12289;&#27169;&#22411;&#21644;&#26426;&#26500;&#36825;&#19977;&#20010;&#20851;&#38190;&#26041;&#38754;&#12290;&#25105;&#20204;&#21457;&#29616;XAI&#23545;&#20110;&#28385;&#36275;&#36825;&#20123;&#35201;&#27714;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#22522;&#20110;&#27492;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;AI&#20013;&#35299;&#37322;&#30340;&#26469;&#28304;&#65292;&#24182;&#25551;&#36848;&#20102;&#19968;&#31181;XAI&#30340;&#20998;&#31867;&#23398;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;XAI&#22312;&#23433;&#20840;&#21487;&#20449;&#30340;AD&#20013;&#30340;&#20116;&#20010;&#20027;&#35201;&#36129;&#29486;&#65292;&#21253;&#25324;&#21487;&#35299;&#37322;&#30340;&#35774;&#35745;&#12289;&#21487;&#35299;&#37322;&#30340;&#26367;&#20195;&#27169;&#22411;&#12289;&#21487;&#35299;&#37322;&#30340;&#30417;&#25511;&#65292;&#36741;&#21161;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10086v1 Announce Type: cross  Abstract: Artificial Intelligence (AI) shows promising applications for the perception and planning tasks in autonomous driving (AD) due to its superior performance compared to conventional methods. However, inscrutable AI systems exacerbate the existing challenge of safety assurance of AD. One way to mitigate this challenge is to utilize explainable AI (XAI) techniques. To this end, we present the first comprehensive systematic literature review of explainable methods for safe and trustworthy AD. We begin by analyzing the requirements for AI in the context of AD, focusing on three key aspects: data, model, and agency. We find that XAI is fundamental to meeting these requirements. Based on this, we explain the sources of explanations in AI and describe a taxonomy of XAI. We then identify five key contributions of XAI for safe and trustworthy AI in AD, which are interpretable design, interpretable surrogate models, interpretable monitoring, auxil
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#30740;&#31350;&#22810;&#21464;&#37327;&#32593;&#32476;&#30340;&#35270;&#35273;&#20998;&#26512;&#24037;&#20316;&#27969;&#31243;&#65292;&#20854;&#20013;&#21253;&#25324;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#38454;&#27573;&#12289;&#38477;&#32500;&#21644;&#20248;&#21270;&#38454;&#27573;&#20197;&#21450;&#29992;&#25143;&#20132;&#20114;&#24335;&#21487;&#35270;&#21270;&#25509;&#21475;&#36827;&#34892;&#35299;&#37322;&#12290;&#20851;&#38190;&#30340;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#27493;&#39588;&#23558;&#38750;&#32447;&#24615;&#29305;&#24449;&#37325;&#22609;&#20026;&#32447;&#24615;&#29305;&#24449;&#65292;&#20197;&#26041;&#20415;&#26816;&#26597;&#21644;&#29702;&#35299;&#12290;&#26696;&#20363;&#30740;&#31350;&#34920;&#26126;&#35813;&#24037;&#20316;&#27969;&#31243;&#20855;&#26377;&#26377;&#25928;&#24615;&#21644;&#21487;&#29702;&#35299;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.09590</link><description>&lt;p&gt;
&#29992;&#34920;&#31034;&#23398;&#20064;&#21644;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#22810;&#21464;&#37327;&#32593;&#32476;&#30340;&#35270;&#35273;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Visual Analytics of Multivariate Networks with Representation Learning and Composite Variable Construction. (arXiv:2303.09590v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09590
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#30740;&#31350;&#22810;&#21464;&#37327;&#32593;&#32476;&#30340;&#35270;&#35273;&#20998;&#26512;&#24037;&#20316;&#27969;&#31243;&#65292;&#20854;&#20013;&#21253;&#25324;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#38454;&#27573;&#12289;&#38477;&#32500;&#21644;&#20248;&#21270;&#38454;&#27573;&#20197;&#21450;&#29992;&#25143;&#20132;&#20114;&#24335;&#21487;&#35270;&#21270;&#25509;&#21475;&#36827;&#34892;&#35299;&#37322;&#12290;&#20851;&#38190;&#30340;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#27493;&#39588;&#23558;&#38750;&#32447;&#24615;&#29305;&#24449;&#37325;&#22609;&#20026;&#32447;&#24615;&#29305;&#24449;&#65292;&#20197;&#26041;&#20415;&#26816;&#26597;&#21644;&#29702;&#35299;&#12290;&#26696;&#20363;&#30740;&#31350;&#34920;&#26126;&#35813;&#24037;&#20316;&#27969;&#31243;&#20855;&#26377;&#26377;&#25928;&#24615;&#21644;&#21487;&#29702;&#35299;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#21464;&#37327;&#32593;&#32476;&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#25968;&#25454;&#39537;&#21160;&#24212;&#29992;&#20013;&#32463;&#24120;&#34987;&#21457;&#29616;&#12290;&#21457;&#25496;&#21644;&#29702;&#35299;&#22810;&#21464;&#37327;&#32593;&#32476;&#20013;&#30340;&#20851;&#31995;&#24182;&#19981;&#26159;&#19968;&#39033;&#31616;&#21333;&#30340;&#20219;&#21153;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#30740;&#31350;&#22810;&#21464;&#37327;&#32593;&#32476;&#20197;&#25552;&#21462;&#32593;&#32476;&#19981;&#21516;&#32467;&#26500;&#21644;&#35821;&#20041;&#29305;&#24449;&#20043;&#38388;&#20851;&#32852;&#30340;&#35270;&#35273;&#20998;&#26512;&#24037;&#20316;&#27969;&#31243;&#65288;&#20363;&#22914;&#65292;&#20160;&#20040;&#26159;&#22312;&#31038;&#20132;&#32593;&#32476;&#23494;&#24230;&#26041;&#38754;&#19982;&#19981;&#21516;&#23646;&#24615;&#30340;&#32452;&#21512;&#20851;&#31995;&#65289;&#12290;&#35813;&#24037;&#20316;&#27969;&#31243;&#21253;&#25324;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#23398;&#20064;&#38454;&#27573;&#65292;&#26681;&#25454;&#25152;&#36873;&#36755;&#20837;&#21644;&#36755;&#20986;&#23646;&#24615;&#26469;&#23545;&#25968;&#25454;&#36827;&#34892;&#20998;&#31867;&#65292;&#38477;&#32500;&#21644;&#20248;&#21270;&#38454;&#27573;&#20197;&#20135;&#29983;&#19968;&#20010;&#31616;&#21270;&#30340;&#32467;&#26524;&#38598;&#21512;&#20197;&#20415;&#26816;&#26597;&#65292;&#26368;&#21518;&#36890;&#36807;&#29992;&#25143;&#20132;&#20114;&#24335;&#21487;&#35270;&#21270;&#25509;&#21475;&#36827;&#34892;&#35299;&#37322;&#38454;&#27573;&#30340;&#25805;&#20316;&#12290;&#25105;&#20204;&#35774;&#35745;&#30340;&#19968;&#20010;&#20851;&#38190;&#37096;&#20998;&#26159;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#27493;&#39588;&#65292;&#35813;&#27493;&#39588;&#23558;&#30001;&#31070;&#32463;&#32593;&#32476;&#33719;&#24471;&#30340;&#38750;&#32447;&#24615;&#29305;&#24449;&#37325;&#22609;&#20026;&#30452;&#35266;&#35299;&#37322;&#30340;&#32447;&#24615;&#29305;&#24449;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#22823;&#22411;&#32452;&#32455;&#21592;&#24037;&#20043;&#38388;&#30340;&#30005;&#23376;&#37038;&#20214;&#36890;&#20449;&#25968;&#25454;&#38598;&#36827;&#34892;&#26696;&#20363;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#24037;&#20316;&#27969;&#31243;&#30340;&#26377;&#25928;&#24615;&#21644;&#21487;&#29702;&#35299;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multivariate networks are commonly found in real-world data-driven applications. Uncovering and understanding the relations of interest in multivariate networks is not a trivial task. This paper presents a visual analytics workflow for studying multivariate networks to extract associations between different structural and semantic characteristics of the networks (e.g., what are the combinations of attributes largely relating to the density of a social network?). The workflow consists of a neural-network-based learning phase to classify the data based on the chosen input and output attributes, a dimensionality reduction and optimization phase to produce a simplified set of results for examination, and finally an interpreting phase conducted by the user through an interactive visualization interface. A key part of our design is a composite variable construction step that remodels nonlinear features obtained by neural networks into linear features that are intuitive to interpret. We demon
&lt;/p&gt;</description></item></channel></rss>