<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#24378;&#35843;&#20102;Evidence Theory&#22312;&#31038;&#20250;&#19982;&#29983;&#21629;&#31185;&#23398;&#20013;&#30340;&#28508;&#21147;&#65292;&#21487;&#20197;&#34920;&#36798;&#26469;&#33258;&#26410;&#30830;&#23450;&#20107;&#20214;&#21487;&#33021;&#23454;&#29616;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#32780;&#19982;&#20043;&#23545;&#27604;&#30340;Probability Theory&#21482;&#33021;&#38480;&#20110;&#20915;&#31574;&#32773;&#24403;&#21069;&#35774;&#24819;&#30340;&#21487;&#33021;&#24615;&#12290;&#26412;&#25991;&#36824;&#35752;&#35770;&#20102;Evidence Theory&#19982;Probability Theory&#30340;&#20851;&#31995;&#20197;&#21450;Evidence Theory&#22312;&#20449;&#24687;&#35770;&#20013;&#30340;&#24212;&#29992;&#22686;&#24378;&#25928;&#26524;&#65292;&#24182;&#36890;&#36807;&#23457;&#35745;&#32451;&#20064;&#26696;&#20363;&#36827;&#19968;&#27493;&#35828;&#26126;&#20102;Evidence Theory&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2309.03222</link><description>&lt;p&gt;
Sherlock Holmes&#19981;&#29609;&#39600;&#23376;&#65306;Evidence Theory&#23545;&#31038;&#20250;&#19982;&#29983;&#21629;&#31185;&#23398;&#30340;&#24847;&#20041;
&lt;/p&gt;
&lt;p&gt;
Sherlock Holmes Doesn't Play Dice: The significance of Evidence Theory for the Social and Life Sciences. (arXiv:2309.03222v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03222
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24378;&#35843;&#20102;Evidence Theory&#22312;&#31038;&#20250;&#19982;&#29983;&#21629;&#31185;&#23398;&#20013;&#30340;&#28508;&#21147;&#65292;&#21487;&#20197;&#34920;&#36798;&#26469;&#33258;&#26410;&#30830;&#23450;&#20107;&#20214;&#21487;&#33021;&#23454;&#29616;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#32780;&#19982;&#20043;&#23545;&#27604;&#30340;Probability Theory&#21482;&#33021;&#38480;&#20110;&#20915;&#31574;&#32773;&#24403;&#21069;&#35774;&#24819;&#30340;&#21487;&#33021;&#24615;&#12290;&#26412;&#25991;&#36824;&#35752;&#35770;&#20102;Evidence Theory&#19982;Probability Theory&#30340;&#20851;&#31995;&#20197;&#21450;Evidence Theory&#22312;&#20449;&#24687;&#35770;&#20013;&#30340;&#24212;&#29992;&#22686;&#24378;&#25928;&#26524;&#65292;&#24182;&#36890;&#36807;&#23457;&#35745;&#32451;&#20064;&#26696;&#20363;&#36827;&#19968;&#27493;&#35828;&#26126;&#20102;Evidence Theory&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;Evidence Theory&#65288;Demster-Shafer Theory&#65292;Belief Functions Theory&#65289;&#22312;&#25968;&#25454;&#34701;&#21512;&#20013;&#24471;&#21040;&#36234;&#26469;&#36234;&#22810;&#30340;&#24212;&#29992;&#65292;&#20294;&#20854;&#22312;&#31038;&#20250;&#19982;&#29983;&#21629;&#31185;&#23398;&#20013;&#30340;&#28508;&#21147;&#24120;&#24120;&#34987;&#20154;&#20204;&#23545;&#20854;&#29420;&#29305;&#29305;&#28857;&#30340;&#32570;&#20047;&#35748;&#35782;&#25152;&#25513;&#30422;&#12290;&#26412;&#25991;&#24378;&#35843;&#65292;Evidence Theory&#21487;&#20197;&#34920;&#36798;&#26469;&#33258;&#20110;&#20154;&#20204;&#26410;&#33021;&#30830;&#23450;&#30340;&#20107;&#20214;&#21487;&#33021;&#23454;&#29616;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#32780;Probability Theory&#24517;&#39035;&#20165;&#38480;&#20110;&#20915;&#31574;&#32773;&#24403;&#21069;&#25152;&#35774;&#24819;&#30340;&#21487;&#33021;&#24615;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#35828;&#26126;&#20102;Dempster-Shafer&#30340;&#32452;&#21512;&#35268;&#21017;&#22914;&#20309;&#19982;&#21508;&#31181;&#29256;&#26412;&#30340;Probability Theory&#30340;&#36125;&#21494;&#26031;&#23450;&#29702;&#30456;&#20851;&#65292;&#24182;&#35752;&#35770;&#20102;&#21738;&#20123;&#20449;&#24687;&#35770;&#30340;&#24212;&#29992;&#21487;&#20197;&#36890;&#36807;Evidence Theory&#24471;&#21040;&#22686;&#24378;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26696;&#20363;&#38416;&#36848;&#20102;&#20351;&#29992;Evidence Theory&#26469;&#29702;&#35299;&#23457;&#35745;&#32451;&#20064;&#20013;&#20986;&#29616;&#30340;&#37096;&#20998;&#37325;&#21472;&#12289;&#37096;&#20998;&#30456;&#20114;&#30683;&#30462;&#30340;&#35299;&#20915;&#26041;&#26696;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
While Evidence Theory (Demster-Shafer Theory, Belief Functions Theory) is being increasingly used in data fusion, its potentialities in the Social and Life Sciences are often obscured by lack of awareness of its distinctive features. With this paper we stress that Evidence Theory can express the uncertainty deriving from the fear that events may materialize, that one has not been able to figure out. By contrast, Probability Theory must limit itself to the possibilities that a decision-maker is currently envisaging.  Subsequently, we illustrate how Dempster-Shafer's combination rule relates to Bayes' Theorem for various versions of Probability Theory and discuss which applications of Information Theory can be enhanced by Evidence Theory. Finally, we illustrate our claims with an example where Evidence Theory is used to make sense of the partially overlapping, partially contradictory solutions that appear in an auditing exercise.
&lt;/p&gt;</description></item></channel></rss>