<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#36890;&#36807;&#19968;&#39033;&#24863;&#30693;&#30740;&#31350;&#65292;&#35780;&#20272;&#20102;&#20154;&#20204;&#22312;&#26085;&#24120;&#29983;&#27963;&#20013;&#23545;&#21512;&#25104;&#22270;&#20687;&#12289;&#38899;&#39057;&#12289;&#35270;&#39057;&#21644;&#38899;&#35270;&#39057;&#21050;&#28608;&#19982;&#30495;&#23454;&#30340;&#21306;&#20998;&#33021;&#21147;&#65292;&#20197;&#25506;&#35752;&#20154;&#31867;&#23545;&#27450;&#39575;&#24615;&#21512;&#25104;&#23186;&#20307;&#30340;&#26131;&#21463;&#31243;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.16760</link><description>&lt;p&gt;
&#21644;&#25243;&#30828;&#24065;&#19968;&#26679;&#22909;&#65306;&#20154;&#31867;&#23545;AI&#29983;&#25104;&#30340;&#22270;&#20687;&#12289;&#35270;&#39057;&#12289;&#38899;&#39057;&#21644;&#38899;&#35270;&#39057;&#21050;&#28608;&#30340;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
As Good As A Coin Toss Human detection of AI-generated images, videos, audio, and audiovisual stimuli
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16760
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#19968;&#39033;&#24863;&#30693;&#30740;&#31350;&#65292;&#35780;&#20272;&#20102;&#20154;&#20204;&#22312;&#26085;&#24120;&#29983;&#27963;&#20013;&#23545;&#21512;&#25104;&#22270;&#20687;&#12289;&#38899;&#39057;&#12289;&#35270;&#39057;&#21644;&#38899;&#35270;&#39057;&#21050;&#28608;&#19982;&#30495;&#23454;&#30340;&#21306;&#20998;&#33021;&#21147;&#65292;&#20197;&#25506;&#35752;&#20154;&#31867;&#23545;&#27450;&#39575;&#24615;&#21512;&#25104;&#23186;&#20307;&#30340;&#26131;&#21463;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21512;&#25104;&#23186;&#20307;&#21464;&#24471;&#36234;&#26469;&#36234;&#36924;&#30495;&#65292;&#20351;&#29992;&#23427;&#30340;&#38556;&#30861;&#19981;&#26029;&#38477;&#20302;&#65292;&#36825;&#39033;&#25216;&#26415;&#36234;&#26469;&#36234;&#34987;&#24694;&#24847;&#21033;&#29992;&#65292;&#20174;&#37329;&#34701;&#27450;&#35784;&#21040;&#38750;&#33258;&#24895;&#33394;&#24773;&#12290;&#20170;&#22825;&#65292;&#23545;&#25239;&#34987;&#21512;&#25104;&#23186;&#20307;&#35823;&#23548;&#30340;&#20027;&#35201;&#38450;&#24481;&#20381;&#36182;&#20110;&#20154;&#31867;&#35266;&#23519;&#32773;&#22312;&#35270;&#35273;&#21644;&#21548;&#35273;&#19978;&#21306;&#20998;&#30495;&#20551;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#20154;&#20204;&#22312;&#26085;&#24120;&#29983;&#27963;&#20013;&#23454;&#38469;&#19978;&#23545;&#27450;&#39575;&#24615;&#21512;&#25104;&#23186;&#20307;&#26377;&#22810;&#33030;&#24369;&#20173;&#19981;&#28165;&#26970;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#21253;&#21547;1276&#21517;&#21442;&#19982;&#32773;&#30340;&#24863;&#30693;&#30740;&#31350;&#65292;&#35780;&#20272;&#20154;&#20204;&#22312;&#21306;&#20998;&#21512;&#25104;&#22270;&#20687;&#12289;&#20165;&#38899;&#39057;&#12289;&#20165;&#35270;&#39057;&#21644;&#38899;&#35270;&#39057;&#21050;&#28608;&#19982;&#30495;&#23454;&#30340;&#20934;&#30830;&#24615;&#22914;&#20309;&#12290;&#20026;&#20102;&#21453;&#26144;&#20154;&#20204;&#22312;&#37326;&#22806;&#21487;&#33021;&#36935;&#21040;&#21512;&#25104;&#23186;&#20307;&#30340;&#24773;&#20917;&#65292;&#27979;&#35797;&#26465;&#20214;&#21644;&#21050;&#28608;&#27169;&#25311;&#20102;&#20856;&#22411;&#30340;&#22312;&#32447;&#24179;&#21488;&#65292;&#32780;&#35843;&#26597;&#20013;&#20351;&#29992;&#30340;&#25152;&#26377;&#21512;&#25104;&#23186;&#20307;&#22343;&#26469;&#33258;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16760v1 Announce Type: cross  Abstract: As synthetic media becomes progressively more realistic and barriers to using it continue to lower, the technology has been increasingly utilized for malicious purposes, from financial fraud to nonconsensual pornography. Today, the principal defense against being misled by synthetic media relies on the ability of the human observer to visually and auditorily discern between real and fake. However, it remains unclear just how vulnerable people actually are to deceptive synthetic media in the course of their day to day lives. We conducted a perceptual study with 1276 participants to assess how accurate people were at distinguishing synthetic images, audio only, video only, and audiovisual stimuli from authentic. To reflect the circumstances under which people would likely encounter synthetic media in the wild, testing conditions and stimuli emulated a typical online platform, while all synthetic media used in the survey was sourced from 
&lt;/p&gt;</description></item><item><title>&#20276;&#20387;&#32842;&#22825;&#26426;&#22120;&#20154;&#20351;&#29992;&#32773;&#34920;&#31034;&#36825;&#20123;&#20851;&#31995;&#26377;&#30410;&#20110;&#20182;&#20204;&#30340;&#31038;&#20250;&#20581;&#24247;&#65292;&#19982;&#39044;&#26399;&#30456;&#21453;&#65292;&#38750;&#20351;&#29992;&#32773;&#21017;&#35748;&#20026;&#26377;&#23475;</title><link>https://arxiv.org/abs/2311.10599</link><description>&lt;p&gt;
&#32842;&#22825;&#26426;&#22120;&#20154;&#20316;&#20026;&#31038;&#20132;&#20276;&#20387;&#65306;&#20154;&#20204;&#22914;&#20309;&#30475;&#24453;&#26426;&#22120;&#20013;&#30340;&#24847;&#35782;&#12289;&#20154;&#31867;&#30456;&#20284;&#24615;&#21644;&#31038;&#20250;&#20581;&#24247;&#31119;&#21033;
&lt;/p&gt;
&lt;p&gt;
Chatbots as social companions: How people perceive consciousness, human likeness, and social health benefits in machines
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.10599
&lt;/p&gt;
&lt;p&gt;
&#20276;&#20387;&#32842;&#22825;&#26426;&#22120;&#20154;&#20351;&#29992;&#32773;&#34920;&#31034;&#36825;&#20123;&#20851;&#31995;&#26377;&#30410;&#20110;&#20182;&#20204;&#30340;&#31038;&#20250;&#20581;&#24247;&#65292;&#19982;&#39044;&#26399;&#30456;&#21453;&#65292;&#38750;&#20351;&#29992;&#32773;&#21017;&#35748;&#20026;&#26377;&#23475;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#30340;&#26222;&#21450;&#65292;&#19968;&#20010;&#38382;&#39064;&#26159;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#22914;&#20309;&#24433;&#21709;&#20154;&#38469;&#20851;&#31995;&#12290;&#20363;&#22914;&#65292;&#32842;&#22825;&#26426;&#22120;&#20154;&#36234;&#26469;&#36234;&#34987;&#29992;&#20316;&#31038;&#20132;&#20276;&#20387;&#65292;&#23613;&#31649;&#26377;&#24456;&#22810;&#29468;&#27979;&#65292;&#20294;&#23545;&#20182;&#20204;&#30340;&#20351;&#29992;&#22914;&#20309;&#24433;&#21709;&#20154;&#38469;&#20851;&#31995;&#30693;&#20043;&#29978;&#23569;&#12290;&#20154;&#20204;&#26222;&#36941;&#35748;&#20026;&#19982;&#20276;&#20387;&#32842;&#22825;&#26426;&#22120;&#20154;&#30340;&#20851;&#31995;&#23545;&#31038;&#20250;&#20581;&#24247;&#26377;&#23475;&#65292;&#20294;&#36825;&#31181;&#20551;&#35774;&#21487;&#33021;&#36807;&#20110;&#31616;&#21333;&#65292;&#29305;&#21035;&#32771;&#34385;&#21040;&#29992;&#25143;&#30340;&#31038;&#20250;&#38656;&#27714;&#21644;&#20182;&#20204;&#29616;&#26377;&#20154;&#38469;&#20851;&#31995;&#30340;&#20581;&#24247;&#12290;&#20026;&#20102;&#20102;&#35299;&#19982;&#20276;&#20387;&#32842;&#22825;&#26426;&#22120;&#20154;&#30340;&#20851;&#31995;&#22914;&#20309;&#24433;&#21709;&#31038;&#20250;&#20581;&#24247;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#23450;&#26399;&#20351;&#29992;&#20276;&#20387;&#32842;&#22825;&#26426;&#22120;&#20154;&#21644;&#19981;&#20351;&#29992;&#23427;&#20204;&#30340;&#20154;&#12290;&#19982;&#26399;&#26395;&#30456;&#21453;&#65292;&#20276;&#20387;&#32842;&#22825;&#26426;&#22120;&#20154;&#29992;&#25143;&#34920;&#31034;&#36825;&#20123;&#20851;&#31995;&#23545;&#20182;&#20204;&#30340;&#31038;&#20250;&#20581;&#24247;&#26377;&#30410;&#65292;&#32780;&#38750;&#29992;&#25143;&#21017;&#35748;&#20026;&#23427;&#20204;&#26377;&#23475;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.10599v3 Announce Type: replace-cross  Abstract: As artificial intelligence (AI) becomes more widespread, one question that arises is how human-AI interaction might impact human-human interaction. Chatbots, for example, are increasingly used as social companions, and while much is speculated, little is known empirically about how their use impacts human relationships. A common hypothesis is that relationships with companion chatbots are detrimental to social health by harming or replacing human interaction, but this hypothesis may be too simplistic, especially considering the social needs of users and the health of their preexisting human relationships. To understand how relationships with companion chatbots impact social health, we studied people who regularly used companion chatbots and people who did not use them. Contrary to expectations, companion chatbot users indicated that these relationships were beneficial to their social health, whereas non-users viewed them as har
&lt;/p&gt;</description></item></channel></rss>