<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#25552;&#20986;&#22522;&#20110;&#20154;&#20307;&#27979;&#37327;&#30340;&#23478;&#20855;&#23610;&#23544;&#36866;&#21512;&#22823;&#23398;&#29983;&#65292;&#20197;&#25913;&#21892;&#35745;&#31639;&#26426;&#23454;&#39564;&#23460;&#20154;&#20307;&#24037;&#31243;&#23398;&#65292;&#30740;&#31350;&#21457;&#29616;&#20854;&#19982;&#29616;&#26377;&#23478;&#20855;&#23610;&#23544;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#24182;&#26356;&#21152;&#20860;&#23481;</title><link>https://arxiv.org/abs/2403.05589</link><description>&lt;p&gt;
&#20248;&#21270;&#22823;&#23398;&#35745;&#31639;&#26426;&#23454;&#39564;&#23460;&#20154;&#20307;&#24037;&#31243;&#23398;&#65306;&#19968;&#20010;&#20851;&#20110;&#20154;&#20307;&#27979;&#37327;&#12289;&#23478;&#20855;&#35774;&#35745;&#21644;ANOVA&#27979;&#35797;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimizing Computer Lab Ergonomics in Universities: A Study on Anthropometric Measurements, Furniture Design, and ANOVA Test
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05589
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#22522;&#20110;&#20154;&#20307;&#27979;&#37327;&#30340;&#23478;&#20855;&#23610;&#23544;&#36866;&#21512;&#22823;&#23398;&#29983;&#65292;&#20197;&#25913;&#21892;&#35745;&#31639;&#26426;&#23454;&#39564;&#23460;&#20154;&#20307;&#24037;&#31243;&#23398;&#65292;&#30740;&#31350;&#21457;&#29616;&#20854;&#19982;&#29616;&#26377;&#23478;&#20855;&#23610;&#23544;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#24182;&#26356;&#21152;&#20860;&#23481;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#30740;&#31350;&#34920;&#26126;&#65292;&#20154;&#20307;&#24037;&#31243;&#23398;&#35774;&#35745;&#30340;&#23478;&#20855;&#33021;&#25552;&#39640;&#24037;&#20316;&#25928;&#29575;&#21644;&#36523;&#24515;&#20581;&#24247;&#12290;&#38543;&#30528;&#35745;&#31639;&#26426;&#25104;&#20026;&#23398;&#29983;&#23398;&#26415;&#29983;&#27963;&#30340;&#19968;&#37096;&#20998;&#65292;&#23427;&#20204;&#22312;&#26410;&#26469;&#23558;&#36827;&#19968;&#27493;&#26222;&#21450;&#12290;&#25105;&#20204;&#25552;&#20986;&#22522;&#20110;&#20154;&#20307;&#27979;&#37327;&#30340;&#23478;&#20855;&#23610;&#23544;&#65292;&#36866;&#21512;&#22823;&#23398;&#29983;&#20197;&#25913;&#21892;&#35745;&#31639;&#26426;&#23454;&#39564;&#23460;&#30340;&#20154;&#20307;&#24037;&#31243;&#23398;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;380&#21517;&#21442;&#19982;&#32773;&#30340;&#25968;&#25454;&#65292;&#20998;&#26512;&#20102;11&#39033;&#20154;&#20307;&#27979;&#37327;&#65292;&#24182;&#23558;&#23427;&#20204;&#19982;11&#39033;&#23478;&#20855;&#23610;&#23544;&#36827;&#34892;&#20102;&#30456;&#20851;&#24615;&#20998;&#26512;&#12290;&#30740;&#31350;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#23478;&#20855;&#65306;&#38750;&#21487;&#35843;&#26885;&#23376;&#19982;&#38750;&#21487;&#35843;&#26700;&#23376;&#65292;&#20197;&#21450;&#21487;&#35843;&#26885;&#23376;&#19982;&#38750;&#21487;&#35843;&#26700;&#23376;&#12290;&#19981;&#21305;&#37197;&#35745;&#31639;&#26174;&#31034;&#23478;&#20855;&#23610;&#23544;&#19982;&#20154;&#20307;&#27979;&#37327;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;&#26174;&#33879;&#27700;&#24179;&#20026;5%&#30340;&#21333;&#22240;&#32032;&#26041;&#24046;&#20998;&#26512;&#27979;&#35797;&#36824;&#26174;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#21644;&#29616;&#26377;&#30340;&#23478;&#20855;&#23610;&#23544;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;&#21457;&#29616;&#25152;&#25552;&#20986;&#30340;&#23610;&#23544;&#26356;&#21152;&#20860;&#23481;&#65292;&#20943;&#23569;&#20102;&#19981;&#21305;&#37197;&#30334;&#20998;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05589v1 Announce Type: cross  Abstract: Many studies have shown how ergonomically designed furniture improves productivity and well-being. As computers have become a part of students' academic lives, they will grow further in the future. We propose anthropometric-based furniture dimensions suitable for university students to improve computer laboratory ergonomics. We collected data from 380 participants and analyzed 11 anthropometric measurements, correlating them to 11 furniture dimensions. Two types of furniture were studied: a non-adjustable chair with a non-adjustable table and an adjustable chair with a non-adjustable table. The mismatch calculation showed a significant difference between furniture dimensions and anthropometric measurements. The one-way ANOVA test with a significance level of 5% also showed a significant difference between proposed and existing furniture dimensions. The proposed dimensions were found to be more compatible and reduced mismatch percentage
&lt;/p&gt;</description></item></channel></rss>