<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#25552;&#20986;&#20102;RASP&#65292;&#19968;&#20010;&#21487;&#22312;25&#31186;&#20869;&#33258;&#20027;&#26356;&#25442;&#20256;&#24863;&#22120;&#21644;&#25191;&#34892;&#22120;&#30340;&#27169;&#22359;&#21270;&#21644;&#21487;&#37325;&#26500;&#20256;&#24863;&#21644;&#20316;&#21160;&#24179;&#21488;&#65292;&#20351;&#26080;&#20154;&#26426;&#33021;&#24555;&#36895;&#36866;&#24212;&#21508;&#31181;&#20219;&#21153;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#30340;&#20010;&#20154;&#21161;&#29702;&#31995;&#32479;&#26550;&#26500;&#12290;</title><link>https://arxiv.org/abs/2403.12853</link><description>&lt;p&gt;
&#22522;&#20110;&#26080;&#20154;&#26426;&#30340;&#29615;&#22659;&#26234;&#33021;&#31995;&#32479;&#30340;&#21487;&#37325;&#26500;&#20316;&#21160;&#21644;&#20256;&#24863;&#24179;&#21488;RASP
&lt;/p&gt;
&lt;p&gt;
RASP: A Drone-based Reconfigurable Actuation and Sensing Platform Towards Ambient Intelligent Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12853
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;RASP&#65292;&#19968;&#20010;&#21487;&#22312;25&#31186;&#20869;&#33258;&#20027;&#26356;&#25442;&#20256;&#24863;&#22120;&#21644;&#25191;&#34892;&#22120;&#30340;&#27169;&#22359;&#21270;&#21644;&#21487;&#37325;&#26500;&#20256;&#24863;&#21644;&#20316;&#21160;&#24179;&#21488;&#65292;&#20351;&#26080;&#20154;&#26426;&#33021;&#24555;&#36895;&#36866;&#24212;&#21508;&#31181;&#20219;&#21153;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#21033;&#29992;&#22823;&#35268;&#27169;&#35821;&#35328;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#30340;&#20010;&#20154;&#21161;&#29702;&#31995;&#32479;&#26550;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#29616;&#28040;&#36153;&#32423;&#26080;&#20154;&#26426;&#19982;&#25105;&#20204;&#23478;&#20013;&#30340;&#21560;&#23576;&#26426;&#22120;&#20154;&#25110;&#26085;&#24120;&#29983;&#27963;&#20013;&#30340;&#20010;&#20154;&#26234;&#33021;&#25163;&#26426;&#19968;&#26679;&#26377;&#29992;&#65292;&#38656;&#35201;&#26080;&#20154;&#26426;&#33021;&#24863;&#30693;&#12289;&#39537;&#21160;&#21644;&#21709;&#24212;&#21487;&#33021;&#20986;&#29616;&#30340;&#19968;&#33324;&#24773;&#20917;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#24895;&#26223;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;RASP&#65292;&#19968;&#20010;&#27169;&#22359;&#21270;&#21644;&#21487;&#37325;&#26500;&#30340;&#20256;&#24863;&#21644;&#20316;&#21160;&#24179;&#21488;&#65292;&#20801;&#35768;&#26080;&#20154;&#26426;&#22312;&#20165;25&#31186;&#20869;&#33258;&#20027;&#26356;&#25442;&#26426;&#36733;&#20256;&#24863;&#22120;&#21644;&#25191;&#34892;&#22120;&#65292;&#20351;&#21333;&#20010;&#26080;&#20154;&#26426;&#33021;&#22815;&#24555;&#36895;&#36866;&#24212;&#21508;&#31181;&#20219;&#21153;&#12290;RASP&#21253;&#25324;&#19968;&#20010;&#26426;&#26800;&#23618;&#65292;&#29992;&#20110;&#29289;&#29702;&#26356;&#25442;&#20256;&#24863;&#22120;&#27169;&#22359;&#65292;&#19968;&#20010;&#30005;&#27668;&#23618;&#65292;&#29992;&#20110;&#32500;&#25252;&#20256;&#24863;&#22120;/&#25191;&#34892;&#22120;&#30340;&#30005;&#28304;&#21644;&#36890;&#20449;&#32447;&#36335;&#65292;&#20197;&#21450;&#19968;&#20010;&#36719;&#20214;&#23618;&#65292;&#29992;&#20110;&#22312;&#26080;&#20154;&#26426;&#21644;&#25105;&#20204;&#24179;&#21488;&#19978;&#30340;&#20219;&#20309;&#20256;&#24863;&#22120;&#27169;&#22359;&#20043;&#38388;&#32500;&#25252;&#19968;&#20010;&#20844;&#20849;&#25509;&#21475;&#12290;&#21033;&#29992;&#26368;&#36817;&#22312;&#22823;&#22411;&#35821;&#35328;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#26041;&#38754;&#30340;&#36827;&#23637;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;RASP&#30340;&#20010;&#20154;&#21161;&#29702;&#31995;&#32479;&#30340;&#26550;&#26500;&#12289;&#23454;&#29616;&#21644;&#29616;&#23454;&#19990;&#30028;&#37096;&#32626;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12853v1 Announce Type: cross  Abstract: Realizing consumer-grade drones that are as useful as robot vacuums throughout our homes or personal smartphones in our daily lives requires drones to sense, actuate, and respond to general scenarios that may arise. Towards this vision, we propose RASP, a modular and reconfigurable sensing and actuation platform that allows drones to autonomously swap onboard sensors and actuators in only 25 seconds, allowing a single drone to quickly adapt to a diverse range of tasks. RASP consists of a mechanical layer to physically swap sensor modules, an electrical layer to maintain power and communication lines to the sensor/actuator, and a software layer to maintain a common interface between the drone and any sensor module in our platform. Leveraging recent advances in large language and visual language models, we further introduce the architecture, implementation, and real-world deployments of a personal assistant system utilizing RASP. We demo
&lt;/p&gt;</description></item></channel></rss>