<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#36710;&#20869;&#20154;&#26426;&#20132;&#20114;&#30340;&#29616;&#29366;&#21644;&#26032;&#20852;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#20102;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#21253;&#23481;&#24615;HCI&#35774;&#35745;&#21407;&#21017;&#65292;&#26088;&#22312;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#12290;</title><link>http://arxiv.org/abs/2401.14571</link><description>&lt;p&gt;
&#21521;&#21253;&#23481;&#24615;&#39537;&#21160;&#65306;&#37325;&#26032;&#23457;&#35270;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#30340;&#36710;&#20869;&#20132;&#20114;
&lt;/p&gt;
&lt;p&gt;
Driving Towards Inclusion: Revisiting In-Vehicle Interaction in Autonomous Vehicles. (arXiv:2401.14571v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14571
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#36710;&#20869;&#20154;&#26426;&#20132;&#20114;&#30340;&#29616;&#29366;&#21644;&#26032;&#20852;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#20102;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#21253;&#23481;&#24615;HCI&#35774;&#35745;&#21407;&#21017;&#65292;&#26088;&#22312;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#30446;&#21069;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#36710;&#20869;&#20154;&#26426;&#20132;&#20114;&#65288;HCI&#65289;&#30340;&#29616;&#29366;&#65292;&#29305;&#21035;&#20851;&#27880;&#21253;&#23481;&#24615;&#21644;&#21487;&#35775;&#38382;&#24615;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#32771;&#23519;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#21253;&#23481;&#24615;HCI&#30340;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#35774;&#35745;&#21407;&#21017;&#65292;&#35780;&#20272;&#29616;&#26377;HCI&#31995;&#32479;&#65292;&#24182;&#30830;&#23450;&#21487;&#33021;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#30340;&#26032;&#20852;&#25216;&#26415;&#12290;&#26412;&#25991;&#39318;&#20808;&#27010;&#36848;&#20102;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#25216;&#26415;&#30340;&#29616;&#29366;&#65292;&#28982;&#21518;&#23545;&#36825;&#19968;&#32972;&#26223;&#19979;HCI&#30340;&#37325;&#35201;&#24615;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;&#25509;&#19979;&#26469;&#65292;&#26412;&#25991;&#32508;&#36848;&#20102;&#21253;&#23481;&#24615;HCI&#35774;&#35745;&#21407;&#21017;&#30340;&#29616;&#26377;&#25991;&#29486;&#65292;&#24182;&#35780;&#20272;&#20102;&#24403;&#21069;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;HCI&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#12290;&#26412;&#25991;&#36824;&#30830;&#23450;&#20102;&#21487;&#33021;&#22686;&#24378;&#20056;&#23458;&#20307;&#39564;&#30340;&#26032;&#20852;&#25216;&#26415;&#65292;&#22914;&#35821;&#38899;&#28608;&#27963;&#30028;&#38754;&#12289;&#35302;&#35273;&#21453;&#39304;&#31995;&#32479;&#21644;&#22686;&#24378;&#29616;&#23454;&#26174;&#31034;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#24635;&#32467;&#20102;&#30740;&#31350;&#30340;&#37325;&#35201;&#21457;&#29616;&#65292;&#24182;&#35752;&#35770;&#20102;&#26410;&#26469;&#30340;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a comprehensive literature review of the current state of in-vehicle human-computer interaction (HCI) in the context of self-driving vehicles, with a specific focus on inclusion and accessibility. This study's aim is to examine the user-centered design principles for inclusive HCI in self-driving vehicles, evaluate existing HCI systems, and identify emerging technologies that have the potential to enhance the passenger experience. The paper begins by providing an overview of the current state of self-driving vehicle technology, followed by an examination of the importance of HCI in this context. Next, the paper reviews the existing literature on inclusive HCI design principles and evaluates the effectiveness of current HCI systems in self-driving vehicles. The paper also identifies emerging technologies that have the potential to enhance the passenger experience, such as voice-activated interfaces, haptic feedback systems, and augmented reality displays. Finally, th
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#23545;&#20154;&#31867;&#22996;&#25176;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#26174;&#33879;&#25552;&#39640;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#22242;&#38431;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#22996;&#25176;&#34892;&#20026;&#22312;&#19981;&#21516;&#19978;&#19979;&#25991;&#20449;&#24687;&#19979;&#21457;&#29983;&#26174;&#33879;&#21464;&#21270;&#12290;&#36825;&#39033;&#30740;&#31350;&#25512;&#36827;&#20102;&#23545;&#20154;&#24037;&#26234;&#33021;&#22996;&#25176;&#20013;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#35774;&#35745;&#26356;&#26377;&#25928;&#30340;&#21327;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2401.04729</link><description>&lt;p&gt;
&#20851;&#20110;&#19978;&#19979;&#25991;&#20449;&#24687;&#23545;&#20154;&#31867;&#22312;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#30340;&#22996;&#25176;&#34892;&#20026;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
On the Effect of Contextual Information on Human Delegation Behavior in Human-AI collaboration. (arXiv:2401.04729v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04729
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#20154;&#24037;&#26234;&#33021;&#21327;&#20316;&#20013;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#23545;&#20154;&#31867;&#22996;&#25176;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#26174;&#33879;&#25552;&#39640;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#22242;&#38431;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#22996;&#25176;&#34892;&#20026;&#22312;&#19981;&#21516;&#19978;&#19979;&#25991;&#20449;&#24687;&#19979;&#21457;&#29983;&#26174;&#33879;&#21464;&#21270;&#12290;&#36825;&#39033;&#30740;&#31350;&#25512;&#36827;&#20102;&#23545;&#20154;&#24037;&#26234;&#33021;&#22996;&#25176;&#20013;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#35774;&#35745;&#26356;&#26377;&#25928;&#30340;&#21327;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#19981;&#26029;&#22686;&#24378;&#33021;&#21147;&#20026;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#30340;&#21327;&#20316;&#24102;&#26469;&#20102;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#21033;&#29992;&#29616;&#26377;&#30340;&#20114;&#34917;&#33021;&#21147;&#65292;&#35753;&#20154;&#20204;&#23558;&#20010;&#21035;&#23454;&#20363;&#22996;&#25176;&#32473;&#20154;&#24037;&#26234;&#33021;&#26159;&#19968;&#31181;&#26377;&#21069;&#26223;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#20351;&#20154;&#20204;&#26377;&#25928;&#22320;&#22996;&#25176;&#23454;&#20363;&#38656;&#35201;&#20182;&#20204;&#35780;&#20272;&#33258;&#24049;&#21644;&#20154;&#24037;&#26234;&#33021;&#22312;&#32473;&#23450;&#20219;&#21153;&#30340;&#32972;&#26223;&#19979;&#30340;&#33021;&#21147;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#20154;&#31867;&#20915;&#23450;&#23558;&#23454;&#20363;&#22996;&#25176;&#32473;&#20154;&#24037;&#26234;&#33021;&#26102;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#30340;&#25928;&#26524;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#25552;&#20379;&#19978;&#19979;&#25991;&#20449;&#24687;&#26174;&#33879;&#25552;&#39640;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#22242;&#38431;&#30340;&#34920;&#29616;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#24403;&#21442;&#19982;&#32773;&#25509;&#25910;&#21040;&#19981;&#21516;&#31867;&#22411;&#30340;&#19978;&#19979;&#25991;&#20449;&#24687;&#26102;&#65292;&#22996;&#25176;&#34892;&#20026;&#20250;&#21457;&#29983;&#26174;&#33879;&#21464;&#21270;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#36825;&#39033;&#30740;&#31350;&#25512;&#36827;&#20102;&#20154;&#24037;&#26234;&#33021;&#22996;&#25176;&#20013;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#29702;&#35299;&#65292;&#24182;&#20026;&#35774;&#35745;&#26356;&#26377;&#25928;&#30340;&#21327;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#21487;&#34892;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
The constantly increasing capabilities of artificial intelligence (AI) open new possibilities for human-AI collaboration. One promising approach to leverage existing complementary capabilities is allowing humans to delegate individual instances to the AI. However, enabling humans to delegate instances effectively requires them to assess both their own and the AI's capabilities in the context of the given task. In this work, we explore the effects of providing contextual information on human decisions to delegate instances to an AI. We find that providing participants with contextual information significantly improves the human-AI team performance. Additionally, we show that the delegation behavior changes significantly when participants receive varying types of contextual information. Overall, this research advances the understanding of human-AI interaction in human delegation and provides actionable insights for designing more effective collaborative systems.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#25506;&#32034;&#20102;LLMs&#26159;&#21542;&#21487;&#20197;&#22797;&#21046;&#26356;&#22797;&#26434;&#30340;&#20247;&#21253;&#27969;&#27700;&#32447;&#65292;&#24182;&#21457;&#29616;&#29616;&#20195;LLMs&#22312;&#27169;&#25311;&#20154;&#31867;&#35745;&#31639;&#31639;&#27861;&#20013;&#30340;&#33021;&#21147;&#19978;&#26377;&#19968;&#23450;&#30340;&#25104;&#21151;&#65292;&#20294;&#21463;&#22810;&#31181;&#22240;&#32032;&#24433;&#21709;&#12290;&#25991;&#31456;&#24378;&#35843;&#20102;&#20026;LLMs&#25552;&#20379;&#20154;&#31867;&#38754;&#21521;&#30340;&#23433;&#20840;&#20445;&#38556;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#35757;&#32451;&#20154;&#31867;&#21644;LLMs&#20114;&#34917;&#25216;&#33021;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2307.10168</link><description>&lt;p&gt;
LLM&#20316;&#20026;&#20154;-&#35745;&#31639;&#31639;&#27861;&#20013;&#30340;&#24037;&#20316;&#32773;&#65311;&#29992;LLM&#22797;&#21046;&#20247;&#21253;&#27969;&#27700;&#32447;&#12290;
&lt;/p&gt;
&lt;p&gt;
LLMs as Workers in Human-Computational Algorithms? Replicating Crowdsourcing Pipelines with LLMs. (arXiv:2307.10168v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10168
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#25506;&#32034;&#20102;LLMs&#26159;&#21542;&#21487;&#20197;&#22797;&#21046;&#26356;&#22797;&#26434;&#30340;&#20247;&#21253;&#27969;&#27700;&#32447;&#65292;&#24182;&#21457;&#29616;&#29616;&#20195;LLMs&#22312;&#27169;&#25311;&#20154;&#31867;&#35745;&#31639;&#31639;&#27861;&#20013;&#30340;&#33021;&#21147;&#19978;&#26377;&#19968;&#23450;&#30340;&#25104;&#21151;&#65292;&#20294;&#21463;&#22810;&#31181;&#22240;&#32032;&#24433;&#21709;&#12290;&#25991;&#31456;&#24378;&#35843;&#20102;&#20026;LLMs&#25552;&#20379;&#20154;&#31867;&#38754;&#21521;&#30340;&#23433;&#20840;&#20445;&#38556;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#35757;&#32451;&#20154;&#31867;&#21644;LLMs&#20114;&#34917;&#25216;&#33021;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
LLM&#24050;&#32463;&#26174;&#31034;&#20986;&#22312;&#20247;&#21253;&#20219;&#21153;&#20013;&#22797;&#21046;&#20154;&#31867;&#34892;&#20026;&#30340;&#28508;&#21147;&#65292;&#32780;&#36825;&#20123;&#20219;&#21153;&#20197;&#21069;&#34987;&#35748;&#20026;&#21482;&#26377;&#20154;&#31867;&#25165;&#33021;&#23436;&#25104;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#31616;&#21333;&#30340;&#21407;&#23376;&#20219;&#21153;&#19978;&#12290;&#25105;&#20204;&#25506;&#32034;LLM&#26159;&#21542;&#21487;&#20197;&#22797;&#21046;&#26356;&#22797;&#26434;&#30340;&#20247;&#21253;&#27969;&#27700;&#32447;&#12290;&#25105;&#20204;&#21457;&#29616;&#29616;&#20195;LLM&#21487;&#20197;&#27169;&#25311;&#26576;&#20123;&#20247;&#21253;&#24037;&#20316;&#32773;&#22312;&#36825;&#20123;&#8220;&#20154;&#31867;&#35745;&#31639;&#31639;&#27861;&#8221;&#20013;&#30340;&#33021;&#21147;&#65292;&#20294;&#25104;&#21151;&#30340;&#31243;&#24230;&#26159;&#21487;&#21464;&#30340;&#65292;&#24182;&#21463;&#21040;&#35831;&#27714;&#32773;&#23545;LLM&#33021;&#21147;&#30340;&#29702;&#35299;&#12289;&#23376;&#20219;&#21153;&#25152;&#38656;&#30340;&#29305;&#23450;&#25216;&#33021;&#20197;&#21450;&#25191;&#34892;&#36825;&#20123;&#23376;&#20219;&#21153;&#30340;&#26368;&#20339;&#20132;&#20114;&#26041;&#24335;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21453;&#24605;&#20102;&#20154;&#31867;&#21644;LLM&#23545;&#25351;&#31034;&#30340;&#19981;&#21516;&#25935;&#24863;&#24615;&#65292;&#24378;&#35843;&#20026;LLM&#25552;&#20379;&#38754;&#21521;&#20154;&#31867;&#30340;&#23433;&#20840;&#20445;&#38556;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#35757;&#32451;&#20855;&#26377;&#20114;&#34917;&#25216;&#33021;&#30340;&#20154;&#31867;&#21644;LLM&#30340;&#28508;&#21147;&#12290;&#20851;&#38190;&#26159;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22797;&#21046;&#20247;&#21253;&#27969;&#27700;&#32447;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#20215;&#20540;&#30340;&#24179;&#21488;&#26469;&#30740;&#31350;LLM&#22312;&#19981;&#21516;&#20219;&#21153;&#19978;&#30340;&#30456;&#23545;&#20248;&#21183;&#65288;&#36890;&#36807;&#20132;&#21449;&#39564;&#35777;
&lt;/p&gt;
&lt;p&gt;
LLMs have shown promise in replicating human-like behavior in crowdsourcing tasks that were previously thought to be exclusive to human abilities. However, current efforts focus mainly on simple atomic tasks. We explore whether LLMs can replicate more complex crowdsourcing pipelines. We find that modern LLMs can simulate some of crowdworkers' abilities in these "human computation algorithms," but the level of success is variable and influenced by requesters' understanding of LLM capabilities, the specific skills required for sub-tasks, and the optimal interaction modality for performing these sub-tasks. We reflect on human and LLMs' different sensitivities to instructions, stress the importance of enabling human-facing safeguards for LLMs, and discuss the potential of training humans and LLMs with complementary skill sets. Crucially, we show that replicating crowdsourcing pipelines offers a valuable platform to investigate (1) the relative strengths of LLMs on different tasks (by cross
&lt;/p&gt;</description></item></channel></rss>