<rss version="2.0"><channel><title>Chat Arxiv cs.HC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.HC</description><item><title>&#21033;&#29992;&#27169;&#25311;&#22270;&#20687;&#24341;&#23548;&#30340;&#20197;&#22806;&#31185;&#21307;&#29983;&#20026;&#20013;&#24515;&#30340;&#33258;&#20027;&#26426;&#22120;&#20154;&#23398;&#24466;&#31995;&#32479;&#65292;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#21644;&#27169;&#20223;&#23398;&#20064;&#20195;&#29702;&#22312;&#30524;&#31185;&#30333;&#20869;&#38556;&#25163;&#26415;&#20013;&#36866;&#24212;&#22806;&#31185;&#21307;&#29983;&#30340;&#25216;&#33021;&#27700;&#24179;&#21644;&#22806;&#31185;&#25163;&#26415;&#20559;&#22909;&#12290;</title><link>https://arxiv.org/abs/2311.17693</link><description>&lt;p&gt;
&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#21644;&#27169;&#20223;&#23398;&#20064;&#30340;&#22806;&#31185;&#21307;&#29983;&#21442;&#19982;&#30524;&#31185;&#26426;&#22120;&#20154;&#23398;&#24466;&#31995;&#32479;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Toward a Surgeon-in-the-Loop Ophthalmic Robotic Apprentice using Reinforcement and Imitation Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.17693
&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#27169;&#25311;&#22270;&#20687;&#24341;&#23548;&#30340;&#20197;&#22806;&#31185;&#21307;&#29983;&#20026;&#20013;&#24515;&#30340;&#33258;&#20027;&#26426;&#22120;&#20154;&#23398;&#24466;&#31995;&#32479;&#65292;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#21644;&#27169;&#20223;&#23398;&#20064;&#20195;&#29702;&#22312;&#30524;&#31185;&#30333;&#20869;&#38556;&#25163;&#26415;&#20013;&#36866;&#24212;&#22806;&#31185;&#21307;&#29983;&#30340;&#25216;&#33021;&#27700;&#24179;&#21644;&#22806;&#31185;&#25163;&#26415;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#20154;&#36741;&#21161;&#25163;&#26415;&#31995;&#32479;&#22312;&#25552;&#39640;&#25163;&#26415;&#31934;&#30830;&#24230;&#21644;&#20943;&#23569;&#20154;&#20026;&#38169;&#35823;&#26041;&#38754;&#23637;&#31034;&#20102;&#26174;&#33879;&#28508;&#21147;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#31995;&#32479;&#32570;&#20047;&#36866;&#24212;&#20010;&#21035;&#22806;&#31185;&#21307;&#29983;&#30340;&#29420;&#29305;&#20559;&#22909;&#21644;&#35201;&#27714;&#30340;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;&#23427;&#20204;&#20027;&#35201;&#38598;&#20013;&#22312;&#26222;&#36890;&#25163;&#26415;&#65288;&#22914;&#33145;&#33108;&#38236;&#25163;&#26415;&#65289;&#65292;&#19981;&#36866;&#29992;&#20110;&#38750;&#24120;&#31934;&#23494;&#30340;&#24494;&#21019;&#25163;&#26415;&#65292;&#22914;&#30524;&#31185;&#25163;&#26415;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#25311;&#22270;&#20687;&#24341;&#23548;&#30340;&#20197;&#22806;&#31185;&#21307;&#29983;&#20026;&#20013;&#24515;&#30340;&#33258;&#20027;&#26426;&#22120;&#20154;&#23398;&#24466;&#31995;&#32479;&#65292;&#21487;&#22312;&#30524;&#31185;&#30333;&#20869;&#38556;&#25163;&#26415;&#36807;&#31243;&#20013;&#36866;&#24212;&#20010;&#21035;&#22806;&#31185;&#21307;&#29983;&#30340;&#25216;&#33021;&#27700;&#24179;&#21644;&#39318;&#36873;&#22806;&#31185;&#25163;&#26415;&#25216;&#26415;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#27169;&#25311;&#29615;&#22659;&#26469;&#35757;&#32451;&#20197;&#22270;&#20687;&#25968;&#25454;&#20026;&#25351;&#23548;&#30340;&#24378;&#21270;&#23398;&#20064;&#21644;&#27169;&#20223;&#23398;&#20064;&#20195;&#29702;&#65292;&#20197;&#25191;&#34892;&#30333;&#20869;&#38556;&#25163;&#26415;&#30340;&#20999;&#21475;&#38454;&#27573;&#25152;&#26377;&#20219;&#21153;&#12290;&#36890;&#36807;&#23558;&#22806;&#31185;&#21307;&#29983;&#30340;&#21160;&#20316;&#21644;&#20559;&#22909;&#25972;&#21512;&#21040;&#35757;&#32451;&#36807;&#31243;&#20013;&#65292;&#35753;&#22806;&#31185;&#21307;&#29983;&#21442;&#19982;&#20854;&#20013;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#36798;&#21040;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.17693v2 Announce Type: replace-cross  Abstract: Robotic-assisted surgical systems have demonstrated significant potential in enhancing surgical precision and minimizing human errors. However, existing systems lack the ability to accommodate the unique preferences and requirements of individual surgeons. Additionally, they primarily focus on general surgeries (e.g., laparoscopy) and are not suitable for highly precise microsurgeries, such as ophthalmic procedures. Thus, we propose a simulation-based image-guided approach for surgeon-centered autonomous agents that can adapt to the individual surgeon's skill level and preferred surgical techniques during ophthalmic cataract surgery. Our approach utilizes a simulated environment to train reinforcement and imitation learning agents guided by image data to perform all tasks of the incision phase of cataract surgery. By integrating the surgeon's actions and preferences into the training process with the surgeon-in-the-loop, our ap
&lt;/p&gt;</description></item></channel></rss>