<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>LLMind&#26159;&#19968;&#20010;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#20316;&#20026;&#20013;&#22830;&#21327;&#35843;&#22120;&#30340;AI&#26694;&#26550;&#65292;&#23558;LLMs&#19982;&#39046;&#22495;&#29305;&#23450;&#30340;AI&#27169;&#22359;&#25972;&#21512;&#65292;&#20351;&#24471;&#29289;&#32852;&#32593;&#35774;&#22791;&#33021;&#22815;&#26377;&#25928;&#21327;&#21516;&#25191;&#34892;&#22797;&#26434;&#20219;&#21153;&#12290;</title><link>http://arxiv.org/abs/2312.09007</link><description>&lt;p&gt;
LLMind: &#20026;&#22797;&#26434;&#20219;&#21153;&#25191;&#34892;&#19982;AI&#21644;&#29289;&#32852;&#32593;&#36827;&#34892;&#21327;&#35843;&#30340;LLM&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
LLMind: Orchestrating AI and IoT with LLMs for Complex Task Execution. (arXiv:2312.09007v2 [cs.IT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.09007
&lt;/p&gt;
&lt;p&gt;
LLMind&#26159;&#19968;&#20010;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#20316;&#20026;&#20013;&#22830;&#21327;&#35843;&#22120;&#30340;AI&#26694;&#26550;&#65292;&#23558;LLMs&#19982;&#39046;&#22495;&#29305;&#23450;&#30340;AI&#27169;&#22359;&#25972;&#21512;&#65292;&#20351;&#24471;&#29289;&#32852;&#32593;&#35774;&#22791;&#33021;&#22815;&#26377;&#25928;&#21327;&#21516;&#25191;&#34892;&#22797;&#26434;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;LLMind&#65292;&#36825;&#26159;&#19968;&#20010;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#20316;&#20026;&#20013;&#22830;&#21327;&#35843;&#22120;&#30340;AI&#26694;&#26550;&#12290;&#35813;&#26694;&#26550;&#23558;LLMs&#19982;&#39046;&#22495;&#29305;&#23450;&#30340;AI&#27169;&#22359;&#25972;&#21512;&#65292;&#20351;&#24471;&#29289;&#32852;&#32593;&#35774;&#22791;&#33021;&#22815;&#26377;&#25928;&#21327;&#21516;&#25191;&#34892;&#22797;&#26434;&#20219;&#21153;&#12290;LLMs&#36890;&#36807;&#29992;&#25143;&#21451;&#22909;&#30340;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19982;&#29992;&#25143;&#36827;&#34892;&#33258;&#28982;&#23545;&#35805;&#65292;&#25552;&#20986;&#25191;&#34892;&#22797;&#26434;&#20219;&#21153;&#30340;&#35745;&#21010;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#22797;&#26434;&#20219;&#21153;&#30340;&#25191;&#34892;&#26159;&#36890;&#36807;&#25511;&#21046;&#33050;&#26412;&#23454;&#29616;&#30340;&#65292;&#36825;&#21487;&#33021;&#28041;&#21450;&#22810;&#20010;&#39046;&#22495;&#29305;&#23450;&#30340;AI&#27169;&#22359;&#21644;&#29289;&#32852;&#32593;&#35774;&#22791;&#30340;&#21327;&#20316;&#12290;LLMs&#20351;&#29992;&#22522;&#20110;&#26377;&#38480;&#29366;&#24577;&#26426;&#65288;FSMs&#65289;&#30340;&#35821;&#35328;&#32534;&#30721;&#36716;&#25442;&#26041;&#27861;&#29983;&#25104;&#25511;&#21046;&#33050;&#26412;&#12290;&#35813;&#26694;&#26550;&#36824;&#32467;&#21512;&#20102;&#35821;&#20041;&#20998;&#26512;&#21644;&#21709;&#24212;&#20248;&#21270;&#25216;&#26415;&#65292;&#20197;&#25552;&#39640;&#36895;&#24230;&#21644;&#25928;&#26524;&#12290;&#26368;&#32456;&#65292;&#35813;&#26694;&#26550;&#30340;&#35774;&#35745;&#19981;&#20165;&#26088;&#22312;&#21019;&#26032;&#29289;&#32852;&#32593;&#35774;&#22791;&#25511;&#21046;&#21644;&#20016;&#23500;&#29992;&#25143;&#20307;&#39564;&#65292;&#36824;&#20419;&#36827;&#26234;&#33021;&#21644;&#38598;&#25104;&#30340;&#29289;&#32852;&#32593;&#35774;&#22791;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we introduce LLMind, an AI framework that utilizes large language models (LLMs) as a central orchestrator. The framework integrates LLMs with domain-specific AI modules, enabling IoT devices to collaborate effectively in executing complex tasks. The LLM engages in natural conversations with human users via a user-friendly social media platform to come up with a plan to execute complex tasks. In particular, the execution of a complex task, which may involve the collaborations of multiple domain-specific AI modules and IoT devices, is realized through a control script. The LLM generates the control script using a Language-Code transformation approach based on finite-state machines (FSMs). The framework also incorporates semantic analysis and response optimization techniques to enhance speed and effectiveness. Ultimately, this framework is designed not only to innovate IoT device control and enrich user experiences but also to foster an intelligent and integrated IoT device
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#20010;&#25308;&#21344;&#24237;&#40065;&#26834;&#12289;&#36890;&#20449;&#39640;&#25928;&#21644;&#31169;&#23494;&#30340;&#31639;&#27861;(Subspace-Median)&#26469;&#35299;&#20915;&#22312;&#32852;&#37030;&#29615;&#22659;&#20013;&#20272;&#35745;&#23545;&#31216;&#30697;&#38453;&#20027;&#23376;&#31354;&#38388;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#36824;&#30740;&#31350;&#20102;&#32852;&#37030;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#21644;&#27700;&#24179;&#32852;&#37030;&#20302;&#31209;&#21015;&#24863;&#30693;&#65288;LRCCS&#65289;&#30340;&#29305;&#27530;&#24773;&#20917;&#65292;&#24182;&#23637;&#31034;&#20102;Subspace-Median&#31639;&#27861;&#30340;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2309.14512</link><description>&lt;p&gt;
&#25308;&#21344;&#24237;&#40065;&#26834;&#30340;&#32852;&#37030;PCA&#21644;&#20302;&#31209;&#30697;&#38453;&#24674;&#22797;
&lt;/p&gt;
&lt;p&gt;
Byzantine-Resilient Federated PCA and Low Rank Matrix Recovery. (arXiv:2309.14512v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14512
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#20010;&#25308;&#21344;&#24237;&#40065;&#26834;&#12289;&#36890;&#20449;&#39640;&#25928;&#21644;&#31169;&#23494;&#30340;&#31639;&#27861;(Subspace-Median)&#26469;&#35299;&#20915;&#22312;&#32852;&#37030;&#29615;&#22659;&#20013;&#20272;&#35745;&#23545;&#31216;&#30697;&#38453;&#20027;&#23376;&#31354;&#38388;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#36824;&#30740;&#31350;&#20102;&#32852;&#37030;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#21644;&#27700;&#24179;&#32852;&#37030;&#20302;&#31209;&#21015;&#24863;&#30693;&#65288;LRCCS&#65289;&#30340;&#29305;&#27530;&#24773;&#20917;&#65292;&#24182;&#23637;&#31034;&#20102;Subspace-Median&#31639;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#32852;&#37030;&#29615;&#22659;&#20013;&#20272;&#35745;&#23545;&#31216;&#30697;&#38453;&#30340;&#20027;&#23376;&#31354;&#38388;&#65288;&#21069;r&#20010;&#22855;&#24322;&#21521;&#37327;&#30340;&#24352;&#25104;&#65289;&#30340;&#38382;&#39064;&#65292;&#24403;&#27599;&#20010;&#33410;&#28857;&#37117;&#21487;&#20197;&#35775;&#38382;&#23545;&#36825;&#20010;&#30697;&#38453;&#30340;&#20272;&#35745;&#26102;&#12290;&#25105;&#20204;&#30740;&#31350;&#22914;&#20309;&#20351;&#36825;&#20010;&#38382;&#39064;&#20855;&#26377;&#25308;&#21344;&#24237;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21487;&#35777;&#26126;&#30340;&#25308;&#21344;&#24237;&#40065;&#26834;&#12289;&#36890;&#20449;&#39640;&#25928;&#21644;&#31169;&#23494;&#30340;&#31639;&#27861;&#65292;&#31216;&#20026;&#23376;&#31354;&#38388;&#20013;&#20540;&#31639;&#27861;&#65288;Subspace-Median&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#30340;&#26368;&#33258;&#28982;&#30340;&#35299;&#27861;&#65292;&#22522;&#20110;&#20960;&#20309;&#20013;&#20540;&#30340;&#20462;&#25913;&#30340;&#32852;&#37030;&#24130;&#26041;&#27861;&#65292;&#24182;&#35299;&#37322;&#20026;&#20160;&#20040;&#23427;&#26159;&#26080;&#29992;&#30340;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#40065;&#26834;&#23376;&#31354;&#38388;&#20272;&#35745;&#20803;&#38382;&#39064;&#30340;&#20004;&#20010;&#29305;&#27530;&#24773;&#20917; - &#32852;&#37030;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#21644;&#27700;&#24179;&#32852;&#37030;&#20302;&#31209;&#21015;&#24863;&#30693;&#65288;LRCCS&#65289;&#30340;&#35889;&#21021;&#22987;&#21270;&#27493;&#39588;&#12290;&#23545;&#20110;&#36825;&#20004;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#23376;&#31354;&#38388;&#20013;&#20540;&#31639;&#27861;&#25552;&#20379;&#20102;&#26082;&#20855;&#26377;&#40065;&#26834;&#24615;&#21448;&#20855;&#26377;&#39640;&#36890;&#20449;&#25928;&#29575;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#22343;&#20540;&#30340;&#20013;&#20301;&#25968;&#25193;&#23637;&#20063;&#34987;&#24320;&#21457;&#20986;&#26469;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work we consider the problem of estimating the principal subspace (span of the top r singular vectors) of a symmetric matrix in a federated setting, when each node has access to estimates of this matrix. We study how to make this problem Byzantine resilient. We introduce a novel provably Byzantine-resilient, communication-efficient, and private algorithm, called Subspace-Median, to solve it. We also study the most natural solution for this problem, a geometric median based modification of the federated power method, and explain why it is not useful. We consider two special cases of the resilient subspace estimation meta-problem - federated principal components analysis (PCA) and the spectral initialization step of horizontally federated low rank column-wise sensing (LRCCS) in this work. For both these problems we show how Subspace Median provides a resilient solution that is also communication-efficient. Median of Means extensions are developed for both problems. Extensive simu
&lt;/p&gt;</description></item></channel></rss>