<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#21521;&#24037;&#19994;&#29289;&#32852;&#32593;&#29992;&#25143;&#35774;&#22791;&#65288;IIoT UEs&#65289;&#30340;&#24847;&#22270;&#24863;&#30693;DRL&#19978;&#34892;&#21160;&#24577;&#35843;&#24230;&#22120;&#65292;&#36890;&#36807;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;DRL&#65289;&#23398;&#20064;&#22914;&#20309;&#35843;&#24230;&#36890;&#20449;&#36164;&#28304;&#65292;&#24182;&#21033;&#29992;&#22270;&#32467;&#26500;&#30340;&#31616;&#21270;&#26041;&#26696;&#21152;&#36895;&#25910;&#25947;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#35843;&#24230;&#26041;&#26696;&#65292;&#33021;&#26377;&#25928;&#20445;&#35777;IIoT UEs&#30340;&#24847;&#22270;&#34920;&#36798;&#12290;</title><link>https://arxiv.org/abs/2403.18364</link><description>&lt;p&gt;
&#38754;&#21521;5G-NR&#30340;&#24847;&#22270;&#24863;&#30693;DRL&#19978;&#34892;&#21160;&#24577;&#35843;&#24230;&#22120;
&lt;/p&gt;
&lt;p&gt;
Intent-Aware DRL-Based Uplink Dynamic Scheduler for 5G-NR
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18364
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#21521;&#24037;&#19994;&#29289;&#32852;&#32593;&#29992;&#25143;&#35774;&#22791;&#65288;IIoT UEs&#65289;&#30340;&#24847;&#22270;&#24863;&#30693;DRL&#19978;&#34892;&#21160;&#24577;&#35843;&#24230;&#22120;&#65292;&#36890;&#36807;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;DRL&#65289;&#23398;&#20064;&#22914;&#20309;&#35843;&#24230;&#36890;&#20449;&#36164;&#28304;&#65292;&#24182;&#21033;&#29992;&#22270;&#32467;&#26500;&#30340;&#31616;&#21270;&#26041;&#26696;&#21152;&#36895;&#25910;&#25947;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#35843;&#24230;&#26041;&#26696;&#65292;&#33021;&#26377;&#25928;&#20445;&#35777;IIoT UEs&#30340;&#24847;&#22270;&#34920;&#36798;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25903;&#25345;&#24037;&#19994;&#29289;&#32852;&#32593;&#29992;&#25143;&#35774;&#22791;&#65288;IIoT UEs&#65289;&#20855;&#26377;&#24847;&#22270;&#65288;&#21363;&#25152;&#35831;&#27714;&#30340;&#26381;&#21153;&#36136;&#37327;&#65288;QoS&#65289;&#65289;&#21644;&#38543;&#26426;&#27969;&#37327;&#21040;&#36798;&#30340;&#38382;&#39064;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;DRL&#65289;&#30340;&#38598;&#20013;&#21160;&#24577;&#35843;&#24230;&#22120;&#65292;&#29992;&#20110;&#23398;&#20064;&#22914;&#20309;&#22312;IIoT UEs&#20043;&#38388;&#35843;&#24230;&#21487;&#29992;&#36890;&#20449;&#36164;&#28304;&#30340;&#26102;&#38388;&#39057;&#29575;&#36164;&#28304;&#12290;&#25152;&#25552;&#20986;&#30340;&#35843;&#24230;&#22120;&#21033;&#29992;RL&#26694;&#26550;&#26469;&#36866;&#24212;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#21644;&#27969;&#37327;&#21040;&#36798;&#20013;&#30340;&#21160;&#24577;&#21464;&#21270;&#12290;&#27492;&#22806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#30340;&#31616;&#21270;&#26041;&#26696;&#65292;&#20197;&#20943;&#23569;RL&#26694;&#26550;&#30340;&#29366;&#24577;&#21644;&#21160;&#20316;&#31354;&#38388;&#65292;&#20197;&#23454;&#29616;&#24555;&#36895;&#25910;&#25947;&#21644;&#26356;&#22909;&#30340;&#23398;&#20064;&#31574;&#30053;&#12290;&#20223;&#30495;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#20960;&#31181;&#20256;&#32479;&#35843;&#24230;&#26041;&#26696;&#65288;&#22914;&#36718;&#35810;&#12289;&#21322;&#38745;&#24577;&#21644;&#21551;&#21457;&#24335;&#26041;&#27861;&#65289;&#30456;&#27604;&#65292;&#25152;&#25552;&#20986;&#30340;&#26234;&#33021;&#35843;&#24230;&#22120;&#22312;&#20445;&#35777;IIoT UEs&#25152;&#34920;&#36798;&#30340;&#24847;&#22270;&#26041;&#38754;&#20855;&#26377;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18364v1 Announce Type: cross  Abstract: We investigate the problem of supporting Industrial Internet of Things user equipment (IIoT UEs) with intent (i.e., requested quality of service (QoS)) and random traffic arrival. A deep reinforcement learning (DRL) based centralized dynamic scheduler for time-frequency resources is proposed to learn how to schedule the available communication resources among the IIoT UEs. The proposed scheduler leverages an RL framework to adapt to the dynamic changes in the wireless communication system and traffic arrivals. Moreover, a graph-based reduction scheme is proposed to reduce the state and action space of the RL framework to allow fast convergence and a better learning strategy. Simulation results demonstrate the effectiveness of the proposed intelligent scheduler in guaranteeing the expressed intent of IIoT UEs compared to several traditional scheduling schemes, such as round-robin, semi-static, and heuristic approaches. The proposed sche
&lt;/p&gt;</description></item></channel></rss>