<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#33258;&#30417;&#30563;&#28151;&#21512;&#28145;&#24230;&#23398;&#20064;&#32593;&#32476;&#29992;&#20110;&#20581;&#22766;&#27874;&#26463;&#25104;&#24418;&#65292;&#33021;&#22815;&#22312;&#20004;&#31181;&#19981;&#21516;&#30340;&#25968;&#25454;&#38598;&#21644;&#21508;&#31181;&#22330;&#26223;&#20013;&#34920;&#29616;&#20986;&#26356;&#24378;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.12653</link><description>&lt;p&gt;
&#33258;&#30417;&#30563;&#28151;&#21512;&#28145;&#24230;&#23398;&#20064;&#23454;&#29616;&#20581;&#22766;&#20840;&#24687;&#27627;&#31859;&#27874;&#27874;&#26463;&#25104;&#24418;
&lt;/p&gt;
&lt;p&gt;
Robust Holographic mmWave Beamforming by Self-Supervised Hybrid Deep Learning. (arXiv:2303.12653v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12653
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#33258;&#30417;&#30563;&#28151;&#21512;&#28145;&#24230;&#23398;&#20064;&#32593;&#32476;&#29992;&#20110;&#20581;&#22766;&#27874;&#26463;&#25104;&#24418;&#65292;&#33021;&#22815;&#22312;&#20004;&#31181;&#19981;&#21516;&#30340;&#25968;&#25454;&#38598;&#21644;&#21508;&#31181;&#22330;&#26223;&#20013;&#34920;&#29616;&#20986;&#26356;&#24378;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#22823;&#35268;&#27169;&#22825;&#32447;&#38453;&#21015;&#30340;&#27874;&#26463;&#25104;&#24418;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;5G&#21644;&#21363;&#23558;&#25512;&#20986;&#30340;6G&#20013;&#65292;&#22240;&#27492;&#21508;&#31181;&#25216;&#26415;&#34987;&#21033;&#29992;&#26469;&#25552;&#39640;&#20854;&#24615;&#33021;&#65292;&#20363;&#22914;&#28145;&#24230;&#23398;&#20064;&#12289;&#39640;&#32423;&#20248;&#21270;&#31639;&#27861;&#31561;&#12290;&#23613;&#31649;&#22312;&#35768;&#22810;&#20855;&#26377;&#28145;&#24230;&#23398;&#20064;&#30340;&#20808;&#21069;&#30740;&#31350;&#26041;&#26696;&#20013;&#20854;&#24615;&#33021;&#30456;&#24403;&#21560;&#24341;&#20154;&#65292;&#20294;&#36890;&#24120;&#24403;&#29615;&#22659;&#25110;&#25968;&#25454;&#38598;&#21457;&#29983;&#21464;&#21270;&#26102;&#65292;&#20854;&#24615;&#33021;&#20250;&#36805;&#36895;&#19979;&#38477;&#12290;&#22240;&#27492;&#65292;&#35774;&#35745;&#20855;&#26377;&#24378;&#22823;&#40065;&#26834;&#24615;&#30340;&#26377;&#25928;&#27874;&#26463;&#25104;&#24418;&#32593;&#32476;&#26159;&#26234;&#33021;&#26080;&#32447;&#36890;&#20449;&#30340;&#19968;&#20010;&#24320;&#25918;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20581;&#22766;&#30340;&#27874;&#26463;&#25104;&#24418;&#33258;&#30417;&#30563;&#32593;&#32476;&#65292;&#24182;&#22312;&#20004;&#31181;&#19981;&#21516;&#25968;&#25454;&#38598;&#21644;&#21508;&#31181;&#22330;&#26223;&#19979;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;&#20223;&#30495;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#20855;&#26377;&#28151;&#21512;&#23398;&#20064;&#30340;&#33258;&#30417;&#30563;&#32593;&#32476;&#22312;&#32463;&#20856;&#30340;DeepMIMO&#21644;&#26032;&#30340;WAIR-D&#25968;&#25454;&#38598;&#19978;&#20855;&#26377;&#24378;&#22823;&#30340;&#40065;&#26834;&#24615;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#29615;&#22659;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#21407;&#29702;&#26469;&#35299;&#37322;&#36825;&#20010;&#32763;&#35793;&#30340;&#21512;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Beamforming with large-scale antenna arrays has been widely used in recent years, which is acknowledged as an important part in 5G and incoming 6G. Thus, various techniques are leveraged to improve its performance, e.g., deep learning, advanced optimization algorithms, etc. Although its performance in many previous research scenarios with deep learning is quite attractive, usually it drops rapidly when the environment or dataset is changed. Therefore, designing effective beamforming network with strong robustness is an open issue for the intelligent wireless communications. In this paper, we propose a robust beamforming self-supervised network, and verify it in two kinds of different datasets with various scenarios. Simulation results show that the proposed self-supervised network with hybrid learning performs well in both classic DeepMIMO and new WAIR-D dataset with the strong robustness under the various environments. Also, we present the principle to explain the rationality of this 
&lt;/p&gt;</description></item></channel></rss>