<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#25552;&#20986;&#20102;&#35299;&#20915;&#26368;&#20339;&#33218;&#35782;&#21035;&#38382;&#39064;&#20013;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#25361;&#25112;&#30340;&#26368;&#20248;Top-Two&#31639;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.09123</link><description>&lt;p&gt;
&#26368;&#20339;&#33218;&#35782;&#21035;&#21644;&#27969;&#20307;&#20998;&#26512;&#30340;&#26368;&#20248;Top-Two&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Optimal Top-Two Method for Best Arm Identification and Fluid Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09123
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#35299;&#20915;&#26368;&#20339;&#33218;&#35782;&#21035;&#38382;&#39064;&#20013;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#25361;&#25112;&#30340;&#26368;&#20248;Top-Two&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Top-2&#26041;&#27861;&#22312;&#35299;&#20915;&#26368;&#20339;&#33218;&#35782;&#21035;&#65288;BAI&#65289;&#38382;&#39064;&#20013;&#21464;&#24471;&#27969;&#34892;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#19968;&#20010;&#31639;&#27861;&#35782;&#21035;&#26368;&#20339;&#33218;&#65292;&#21363;&#22312;&#26377;&#38480;&#25968;&#37327;&#33218;&#20013;&#20855;&#26377;&#26368;&#22823;&#22343;&#20540;&#30340;&#33218;&#65292;&#35813;&#31639;&#27861;&#22312;&#20219;&#20309;&#39034;&#24207;&#27493;&#39588;&#20013;&#29420;&#31435;&#22320;&#20197;&#22266;&#23450;&#27010;&#29575; &#946; &#25289;&#21160;&#32463;&#39564;&#26368;&#20339;&#33218;&#65292;&#24182;&#22312;&#20854;&#20182;&#24773;&#20917;&#19979;&#25289;&#21160;&#26368;&#20339;&#25361;&#25112;&#32773;&#33218;&#12290;&#36873;&#25321;&#38169;&#35823;&#30340;&#27010;&#29575;&#20445;&#35777;&#22312;&#25351;&#23450;&#30340;&#948; &gt;0&#20197;&#19979;&#12290;&#23545;&#20110;BAI&#38382;&#39064;&#65292;&#24050;&#30693;&#20449;&#24687;&#29702;&#35770;&#19979;&#30028;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#65292;&#24182;&#22312;&#948; &#8594; 0&#26102;&#19982;&#35745;&#31639;&#35201;&#27714;&#39640;&#30340;&#25554;&#20214;&#26041;&#27861;&#28176;&#36817;&#21305;&#37197;&#12290; &#23545;&#20110;&#20219;&#20309; &#946; &#8712;&#65288;0,1&#65289;&#30340;&#19978;&#36848;Top 2&#31639;&#27861;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#22987;&#32456;&#20445;&#25345;&#22312;&#19979;&#30028;&#30340;&#24120;&#25968;&#33539;&#22260;&#20869;&#12290;&#28982;&#32780;&#65292;&#30830;&#23450;&#19982;&#19979;&#30028;&#21305;&#37197;&#30340;&#26368;&#20339; &#946; &#24050;&#34987;&#35777;&#26126;&#22256;&#38590;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#38382;&#39064;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#26368;&#20248;&#30340;Top-2&#31867;&#22411;&#31639;&#27861;&#12290;&#25105;&#20204;&#32771;&#34385;&#20998;&#37197;&#38170;&#28857;&#30340;&#19968;&#20010;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09123v1 Announce Type: new  Abstract: Top-$2$ methods have become popular in solving the best arm identification (BAI) problem. The best arm, or the arm with the largest mean amongst finitely many, is identified through an algorithm that at any sequential step independently pulls the empirical best arm, with a fixed probability $\beta$, and pulls the best challenger arm otherwise. The probability of incorrect selection is guaranteed to lie below a specified $\delta &gt;0$. Information theoretic lower bounds on sample complexity are well known for BAI problem and are matched asymptotically as $\delta \rightarrow 0$ by computationally demanding plug-in methods. The above top 2 algorithm for any $\beta \in (0,1)$ has sample complexity within a constant of the lower bound. However, determining the optimal $\beta$ that matches the lower bound has proven difficult. In this paper, we address this and propose an optimal top-2 type algorithm. We consider a function of allocations anchor
&lt;/p&gt;</description></item></channel></rss>