<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;LIGHTCODE&#36731;&#37327;&#32423;&#31070;&#32463;&#32534;&#30721;&#26041;&#26696;&#65292;&#22312;&#20855;&#22791;&#35299;&#37322;&#24615;&#30340;&#22522;&#30784;&#19978;&#65292;&#22312;&#20302;&#20449;&#22122;&#27604;&#21306;&#22495;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#21487;&#38752;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.10751</link><description>&lt;p&gt;
LIGHTCODE&#65306;&#20855;&#26377;&#21453;&#39304;&#36890;&#36947;&#30340;&#20809;&#35299;&#26512;&#21644;&#31070;&#32463;&#32534;&#30721;
&lt;/p&gt;
&lt;p&gt;
LIGHTCODE: Light Analytical and Neural Codes for Channels with Feedback
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10751
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;LIGHTCODE&#36731;&#37327;&#32423;&#31070;&#32463;&#32534;&#30721;&#26041;&#26696;&#65292;&#22312;&#20855;&#22791;&#35299;&#37322;&#24615;&#30340;&#22522;&#30784;&#19978;&#65292;&#22312;&#20302;&#20449;&#22122;&#27604;&#21306;&#22495;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36947;&#21453;&#39304;&#20013;&#21487;&#38752;&#19988;&#39640;&#25928;&#30340;&#32534;&#30721;&#26041;&#26696;&#35774;&#35745;&#19968;&#30452;&#26159;&#36890;&#20449;&#29702;&#35770;&#20013;&#19968;&#39033;&#38271;&#26399;&#25361;&#25112;&#12290;&#34429;&#28982;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#65292;&#31070;&#32463;&#32534;&#30721;&#24448;&#24448;&#38754;&#20020;&#35745;&#31639;&#25104;&#26412;&#39640;&#12289;&#32570;&#20047;&#21487;&#35299;&#37322;&#24615;&#20197;&#21450;&#22312;&#36164;&#28304;&#21463;&#38480;&#29615;&#22659;&#20013;&#30340;&#23454;&#29992;&#24615;&#26377;&#38480;&#31561;&#38382;&#39064;&#12290;&#26412;&#25991;&#26088;&#22312;&#35774;&#35745;&#35299;&#37322;&#24615;&#24378;&#19988;&#26356;&#36866;&#29992;&#20110;&#36890;&#20449;&#31995;&#32479;&#30340;&#20302;&#22797;&#26434;&#24230;&#32534;&#30721;&#26041;&#26696;&#12290;&#25105;&#20204;&#20808;&#36827;&#20102;&#35299;&#26512;&#32534;&#30721;&#21644;&#31070;&#32463;&#32534;&#30721;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;POWERBLAST&#65292;&#19968;&#31181;&#21463;Schalkwijk-Kailath&#65288;SK&#65289;&#21644;Gallager-Nakiboglu&#65288;GN&#65289;&#26041;&#26696;&#21551;&#21457;&#30340;&#35299;&#26512;&#32534;&#30721;&#26041;&#26696;&#65292;&#22312;&#39640;&#20449;&#22122;&#27604;&#65288;SNR&#65289;&#21306;&#22495;&#23454;&#29616;&#20102;&#26126;&#26174;&#30340;&#21487;&#38752;&#24615;&#25913;&#36827;&#65292;&#32988;&#36807;&#31070;&#32463;&#32534;&#30721;&#12290;&#25509;&#19979;&#26469;&#65292;&#20026;&#20102;&#22686;&#24378;&#20302;SNR&#21306;&#22495;&#30340;&#21487;&#38752;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;LIGHTCODE&#65292;&#19968;&#31181;&#36731;&#37327;&#32423;&#31070;&#32463;&#32534;&#30721;&#65292;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10751v1 Announce Type: cross  Abstract: The design of reliable and efficient codes for channels with feedback remains a longstanding challenge in communication theory. While significant improvements have been achieved by leveraging deep learning techniques, neural codes often suffer from high computational costs, a lack of interpretability, and limited practicality in resource-constrained settings. We focus on designing low-complexity coding schemes that are interpretable and more suitable for communication systems. We advance both analytical and neural codes. First, we demonstrate that POWERBLAST, an analytical coding scheme inspired by Schalkwijk-Kailath (SK) and Gallager-Nakiboglu (GN) schemes, achieves notable reliability improvements over both SK and GN schemes, outperforming neural codes in high signal-to-noise ratio (SNR) regions. Next, to enhance reliability in low-SNR regions, we propose LIGHTCODE, a lightweight neural code that achieves state-of-the-art reliability
&lt;/p&gt;</description></item></channel></rss>