<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>Spectrum Breathing&#26159;&#19968;&#31181;&#20445;&#25252;&#31354;&#20013;&#32852;&#21512;&#23398;&#20064;&#20813;&#21463;&#24178;&#25200;&#30340;&#23454;&#38469;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#38543;&#26426;&#26799;&#24230;&#21098;&#26525;&#21644;&#25193;&#39057;&#32423;&#32852;&#36215;&#26469;&#65292;&#20197;&#21387;&#21046;&#24178;&#25200;&#32780;&#26080;&#38656;&#25193;&#23637;&#24102;&#23485;&#12290;&#20195;&#20215;&#26159;&#22686;&#21152;&#30340;&#23398;&#20064;&#24310;&#36831;&#12290;</title><link>http://arxiv.org/abs/2305.05933</link><description>&lt;p&gt;
Spectrum Breathing&#65306;&#20445;&#25252;&#31354;&#20013;&#32852;&#21512;&#23398;&#20064;&#20813;&#21463;&#24178;&#25200;
&lt;/p&gt;
&lt;p&gt;
Spectrum Breathing: Protecting Over-the-Air Federated Learning Against Interference. (arXiv:2305.05933v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05933
&lt;/p&gt;
&lt;p&gt;
Spectrum Breathing&#26159;&#19968;&#31181;&#20445;&#25252;&#31354;&#20013;&#32852;&#21512;&#23398;&#20064;&#20813;&#21463;&#24178;&#25200;&#30340;&#23454;&#38469;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#38543;&#26426;&#26799;&#24230;&#21098;&#26525;&#21644;&#25193;&#39057;&#32423;&#32852;&#36215;&#26469;&#65292;&#20197;&#21387;&#21046;&#24178;&#25200;&#32780;&#26080;&#38656;&#25193;&#23637;&#24102;&#23485;&#12290;&#20195;&#20215;&#26159;&#22686;&#21152;&#30340;&#23398;&#20064;&#24310;&#36831;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#23398;&#20064;&#26159;&#19968;&#31181;&#20174;&#20998;&#24067;&#24335;&#31227;&#21160;&#25968;&#25454;&#20013;&#33976;&#39311;&#20154;&#24037;&#26234;&#33021;&#30340;&#24191;&#27867;&#24212;&#29992;&#33539;&#20363;&#12290;&#20294;&#32852;&#21512;&#23398;&#20064;&#22312;&#31227;&#21160;&#32593;&#32476;&#20013;&#30340;&#37096;&#32626;&#21487;&#33021;&#20250;&#21463;&#21040;&#37051;&#36817;&#21333;&#20803;&#25110;&#24178;&#25200;&#28304;&#30340;&#24178;&#25200;&#32780;&#21463;&#25439;&#12290;&#29616;&#26377;&#30340;&#24178;&#25200;&#25233;&#21046;&#25216;&#26415;&#38656;&#35201;&#22810;&#21333;&#20803;&#21512;&#20316;&#25110;&#33267;&#23569;&#38656;&#35201;&#26114;&#36149;&#30340;&#24178;&#25200;&#36890;&#36947;&#29366;&#24577;&#20449;&#24687;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#23558;&#24178;&#25200;&#35270;&#20026;&#22122;&#22768;&#36827;&#34892;&#21151;&#29575;&#25511;&#21046;&#21487;&#33021;&#24182;&#19981;&#26377;&#25928;&#65292;&#30001;&#20110;&#39044;&#31639;&#38480;&#21046;&#65292;&#20063;&#30001;&#20110;&#36825;&#31181;&#26426;&#21046;&#21487;&#33021;&#20250;&#35302;&#21457;&#24178;&#25200;&#28304;&#30340;&#21453;&#21046;&#25514;&#26045;&#12290;&#20316;&#20026;&#20445;&#25252;&#31354;&#20013;&#32852;&#21512;&#23398;&#20064;&#20813;&#21463;&#24178;&#25200;&#30340;&#23454;&#38469;&#26041;&#27861;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Spectrum Breathing&#65292;&#23427;&#23558;&#38543;&#26426;&#26799;&#24230;&#21098;&#26525;&#21644;&#25193;&#39057;&#32423;&#32852;&#36215;&#26469;&#65292;&#20197;&#21387;&#21046;&#24178;&#25200;&#32780;&#26080;&#38656;&#25193;&#23637;&#24102;&#23485;&#12290;&#20195;&#20215;&#26159;&#36890;&#36807;&#21033;&#29992;&#21098;&#26525;&#23548;&#33268;&#23398;&#20064;&#36895;&#24230;&#20248;&#38597;&#38477;&#20302;&#32780;&#22686;&#21152;&#30340;&#23398;&#20064;&#24310;&#36831;&#12290;&#25105;&#20204;&#23558;&#20004;&#20010;&#25805;&#20316;&#21516;&#27493;&#65292;&#20197;&#20445;&#35777;&#23427;&#20204;&#30340;&#32423;&#21035;&#26159;&#30456;&#20114;&#23545;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated Learning (FL) is a widely embraced paradigm for distilling artificial intelligence from distributed mobile data. However, the deployment of FL in mobile networks can be compromised by exposure to interference from neighboring cells or jammers. Existing interference mitigation techniques require multi-cell cooperation or at least interference channel state information, which is expensive in practice. On the other hand, power control that treats interference as noise may not be effective due to limited power budgets, and also that this mechanism can trigger countermeasures by interference sources. As a practical approach for protecting FL against interference, we propose Spectrum Breathing, which cascades stochastic-gradient pruning and spread spectrum to suppress interference without bandwidth expansion. The cost is higher learning latency by exploiting the graceful degradation of learning speed due to pruning. We synchronize the two operations such that their levels are contr
&lt;/p&gt;</description></item></channel></rss>