<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#26102;&#21464;&#32447;&#24615;&#24178;&#25200;&#20449;&#36947;&#19978;&#22522;&#20110;&#22240;&#23376;&#22270;&#30340;&#30450;&#20449;&#36947;&#20272;&#35745;&#21644;&#32852;&#21512;&#31526;&#21495;&#26816;&#27979;&#26041;&#27861;&#12290;&#36890;&#36807;&#20351;&#29992;&#32622;&#20449;&#20256;&#25773;&#31639;&#27861;&#21644;&#26399;&#26395;&#26368;&#22823;&#21270;&#31639;&#27861;&#30456;&#20114;&#20132;&#32455;&#30340;&#36845;&#20195;&#65292;&#21487;&#20197;&#38477;&#20302;&#22797;&#26434;&#24230;&#24182;&#25552;&#39640;&#24615;&#33021;&#12290;&#36890;&#36807;&#24341;&#20837;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#65292;&#31639;&#27861;&#22312;&#31163;&#32447;&#35757;&#32451;&#26679;&#26412;&#25968;&#37327;&#36739;&#23569;&#30340;&#24773;&#20917;&#19979;&#20063;&#33021;&#21462;&#24471;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;</title><link>http://arxiv.org/abs/2401.12627</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#22240;&#23376;&#22270;&#30340;&#30450;&#20449;&#36947;&#20272;&#35745;&#21644;&#32852;&#21512;&#31526;&#21495;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Blind Channel Estimation and Joint Symbol Detection with Data-Driven Factor Graphs. (arXiv:2401.12627v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12627
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#26102;&#21464;&#32447;&#24615;&#24178;&#25200;&#20449;&#36947;&#19978;&#22522;&#20110;&#22240;&#23376;&#22270;&#30340;&#30450;&#20449;&#36947;&#20272;&#35745;&#21644;&#32852;&#21512;&#31526;&#21495;&#26816;&#27979;&#26041;&#27861;&#12290;&#36890;&#36807;&#20351;&#29992;&#32622;&#20449;&#20256;&#25773;&#31639;&#27861;&#21644;&#26399;&#26395;&#26368;&#22823;&#21270;&#31639;&#27861;&#30456;&#20114;&#20132;&#32455;&#30340;&#36845;&#20195;&#65292;&#21487;&#20197;&#38477;&#20302;&#22797;&#26434;&#24230;&#24182;&#25552;&#39640;&#24615;&#33021;&#12290;&#36890;&#36807;&#24341;&#20837;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#65292;&#31639;&#27861;&#22312;&#31163;&#32447;&#35757;&#32451;&#26679;&#26412;&#25968;&#37327;&#36739;&#23569;&#30340;&#24773;&#20917;&#19979;&#20063;&#33021;&#21462;&#24471;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#26102;&#21464;&#32447;&#24615;&#24178;&#25200;&#20449;&#36947;&#19978;&#30450;&#32852;&#21512;&#20449;&#36947;&#20272;&#35745;&#21644;&#31526;&#21495;&#26816;&#27979;&#30340;&#22240;&#23376;&#22270;&#26694;&#26550;&#30340;&#24212;&#29992;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#26399;&#26395;&#26368;&#22823;&#21270;&#65288;EM&#65289;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#36890;&#24120;&#30001;&#20110;&#38656;&#35201;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#35745;&#31639;&#36880;&#31526;&#21495;&#21518;&#39564;&#20998;&#24067;&#32780;&#23548;&#33268;&#35745;&#31639;&#22797;&#26434;&#24230;&#39640;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#36866;&#24403;&#30340;&#22240;&#23376;&#22270;&#19978;&#20351;&#29992;&#32622;&#20449;&#20256;&#25773;&#65288;BP&#65289;&#31639;&#27861;&#26469;&#26377;&#25928;&#22320;&#36924;&#36817;&#21518;&#39564;&#20998;&#24067;&#65292;&#20174;&#32780;&#35299;&#20915;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;&#36890;&#36807;&#20132;&#32455;BP&#21644;EM&#30340;&#36845;&#20195;&#65292;&#26816;&#27979;&#22797;&#26434;&#24230;&#36827;&#19968;&#27493;&#20943;&#23569;&#21040;&#27599;&#20010;EM&#27493;&#39588;&#21482;&#38656;&#35201;&#19968;&#27425;BP&#36845;&#20195;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25105;&#20204;&#31639;&#27861;&#30340;&#25968;&#25454;&#39537;&#21160;&#29256;&#26412;&#65292;&#23427;&#24341;&#20837;&#20102;BP&#26356;&#26032;&#30340;&#21160;&#37327;&#65292;&#24182;&#23398;&#20064;&#20102;&#36866;&#24403;&#30340;EM&#21442;&#25968;&#26356;&#26032;&#35745;&#21010;&#65292;&#20174;&#32780;&#22312;&#20165;&#26377;&#23569;&#37327;&#31163;&#32447;&#35757;&#32451;&#26679;&#26412;&#30340;&#24773;&#20917;&#19979;&#26174;&#33879;&#25913;&#21892;&#20102;&#24615;&#33021;-&#22797;&#26434;&#24230;&#26435;&#34913;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#20986;&#33394;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the application of the factor graph framework for blind joint channel estimation and symbol detection on time-variant linear inter-symbol interference channels. In particular, we consider the expectation maximization (EM) algorithm for maximum likelihood estimation, which typically suffers from high complexity as it requires the computation of the symbol-wise posterior distributions in every iteration. We address this issue by efficiently approximating the posteriors using the belief propagation (BP) algorithm on a suitable factor graph. By interweaving the iterations of BP and EM, the detection complexity can be further reduced to a single BP iteration per EM step. In addition, we propose a data-driven version of our algorithm that introduces momentum in the BP updates and learns a suitable EM parameter update schedule, thereby significantly improving the performance-complexity tradeoff with a few offline training samples. Our numerical experiments demonstrate the excel
&lt;/p&gt;</description></item></channel></rss>