<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#31232;&#30095;&#25110;&#29983;&#25104;&#30340;&#20808;&#39564;&#30693;&#35782;&#65292;&#35299;&#20915;&#20102;&#20174;&#20840;&#31209;&#30697;&#38453;&#30340;&#20108;&#27425;&#31995;&#32479;&#20013;&#24674;&#22797;&#20449;&#21495;&#30340;&#38382;&#39064;&#12290;&#20854;&#20013;&#65292;&#36890;&#36807;&#24341;&#20837;&#38408;&#20540;Wirtinger&#27969;&#31639;&#27861;&#65288;TWF&#65289;&#26469;&#22788;&#29702;&#31232;&#30095;&#20449;&#21495;&#65292;&#24182;&#20351;&#29992;&#35889;&#21021;&#22987;&#21270;&#21644;&#38408;&#20540;&#26799;&#24230;&#19979;&#38477;&#26041;&#27861;&#65292;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#23454;&#29616;&#20102;&#36739;&#23567;&#30340;&#27979;&#37327;&#25968;&#37327;&#12290;</title><link>http://arxiv.org/abs/2309.09032</link><description>&lt;p&gt;
&#20351;&#29992;&#31232;&#30095;&#25110;&#29983;&#25104;&#30340;&#20808;&#39564;&#35299;&#20915;&#20840;&#31209;&#30697;&#38453;&#30340;&#20108;&#27425;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Solving Quadratic Systems with Full-Rank Matrices Using Sparse or Generative Priors. (arXiv:2309.09032v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09032
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#31232;&#30095;&#25110;&#29983;&#25104;&#30340;&#20808;&#39564;&#30693;&#35782;&#65292;&#35299;&#20915;&#20102;&#20174;&#20840;&#31209;&#30697;&#38453;&#30340;&#20108;&#27425;&#31995;&#32479;&#20013;&#24674;&#22797;&#20449;&#21495;&#30340;&#38382;&#39064;&#12290;&#20854;&#20013;&#65292;&#36890;&#36807;&#24341;&#20837;&#38408;&#20540;Wirtinger&#27969;&#31639;&#27861;&#65288;TWF&#65289;&#26469;&#22788;&#29702;&#31232;&#30095;&#20449;&#21495;&#65292;&#24182;&#20351;&#29992;&#35889;&#21021;&#22987;&#21270;&#21644;&#38408;&#20540;&#26799;&#24230;&#19979;&#38477;&#26041;&#27861;&#65292;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#23454;&#29616;&#20102;&#36739;&#23567;&#30340;&#27979;&#37327;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#20855;&#26377;&#20840;&#31209;&#30697;&#38453;&#30340;&#20108;&#27425;&#31995;&#32479;&#20013;&#24674;&#22797;&#20449;&#21495;x&#22312;&#24212;&#29992;&#20013;&#32463;&#24120;&#20986;&#29616;&#65292;&#27604;&#22914;&#26410;&#20998;&#37197;&#30340;&#36317;&#31163;&#20960;&#20309;&#21644;&#20122;&#27874;&#38271;&#25104;&#20687;&#12290;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#23545;x&#30340;&#20808;&#39564;&#30693;&#35782;&#65292;&#38024;&#23545;&#39640;&#32500;&#24773;&#20917;&#65288;m &lt;&lt; n&#65289;&#65292;&#20351;&#29992;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#26631;&#20934;&#39640;&#26031;&#30697;&#38453;&#35299;&#20915;&#20102;&#35813;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#32771;&#34385;k-&#31232;&#30095;&#30340;x&#65292;&#24341;&#20837;&#20102;TWF&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#19981;&#38656;&#35201;&#31232;&#30095;&#27700;&#24179;k&#12290;TWF&#21253;&#25324;&#20004;&#20010;&#27493;&#39588;&#65306;&#35889;&#21021;&#22987;&#21270;&#65292;&#24403;m = O(k^2log n)&#26102;&#65292;&#30830;&#23450;&#20102;&#19968;&#20010;&#36317;&#31163;x&#36275;&#22815;&#36817;&#30340;&#28857;&#65288;&#21487;&#33021;&#20250;&#26377;&#31526;&#21495;&#32763;&#36716;&#65289;&#65292;&#20197;&#21450;&#20855;&#26377;&#24456;&#22909;&#21021;&#22987;&#21270;&#30340;&#38408;&#20540;&#26799;&#24230;&#19979;&#38477;&#65292;&#35813;&#19979;&#38477;&#20135;&#29983;&#20102;&#19968;&#20010;&#32447;&#24615;&#25910;&#25947;&#21040;x&#30340;&#24207;&#21015;&#65292;&#29992;m = O(klog n)&#20010;&#27979;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
The problem of recovering a signal $\boldsymbol{x} \in \mathbb{R}^n$ from a quadratic system $\{y_i=\boldsymbol{x}^\top\boldsymbol{A}_i\boldsymbol{x},\ i=1,\ldots,m\}$ with full-rank matrices $\boldsymbol{A}_i$ frequently arises in applications such as unassigned distance geometry and sub-wavelength imaging. With i.i.d. standard Gaussian matrices $\boldsymbol{A}_i$, this paper addresses the high-dimensional case where $m\ll n$ by incorporating prior knowledge of $\boldsymbol{x}$. First, we consider a $k$-sparse $\boldsymbol{x}$ and introduce the thresholded Wirtinger flow (TWF) algorithm that does not require the sparsity level $k$. TWF comprises two steps: the spectral initialization that identifies a point sufficiently close to $\boldsymbol{x}$ (up to a sign flip) when $m=O(k^2\log n)$, and the thresholded gradient descent (with a good initialization) that produces a sequence linearly converging to $\boldsymbol{x}$ with $m=O(k\log n)$ measurements. Second, we explore the generative p
&lt;/p&gt;</description></item></channel></rss>