<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#20013;&#65292;&#20801;&#35768;&#20449;&#24687;&#27844;&#28431;&#21644;&#36817;&#20284;&#20056;&#27861;&#30340;&#24773;&#20917;&#19979;&#65292;&#24403;&#35802;&#23454;&#33410;&#28857;&#25968;&#37327;&#20026;&#23569;&#25968;&#26102;&#65292;&#24046;&#20998;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2309.16105</link><description>&lt;p&gt;
&#24046;&#20998;&#38544;&#31169;&#23433;&#20840;&#20056;&#27861;&#65306;&#22312;&#22122;&#22768;&#20013;&#38544;&#34255;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Differentially Private Secure Multiplication: Hiding Information in the Rubble of Noise. (arXiv:2309.16105v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16105
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#20013;&#65292;&#20801;&#35768;&#20449;&#24687;&#27844;&#28431;&#21644;&#36817;&#20284;&#20056;&#27861;&#30340;&#24773;&#20917;&#19979;&#65292;&#24403;&#35802;&#23454;&#33410;&#28857;&#25968;&#37327;&#20026;&#23569;&#25968;&#26102;&#65292;&#24046;&#20998;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#31169;&#23494;&#20998;&#24067;&#24335;&#22810;&#26041;&#20056;&#27861;&#30340;&#38382;&#39064;&#12290;&#24050;&#32463;&#30830;&#35748;&#65292;Shamir&#31192;&#23494;&#20849;&#20139;&#32534;&#30721;&#31574;&#30053;&#21487;&#20197;&#36890;&#36807;Ben Or&#65292;Goldwasser&#65292;Wigderson&#31639;&#27861;&#65288;&#8220;BGW&#31639;&#27861;&#8221;&#65289;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#20013;&#23454;&#29616;&#23436;&#32654;&#30340;&#20449;&#24687;&#29702;&#35770;&#38544;&#31169;&#12290;&#28982;&#32780;&#65292;&#23436;&#32654;&#30340;&#38544;&#31169;&#21644;&#20934;&#30830;&#24615;&#38656;&#35201;&#19968;&#20010;&#35802;&#23454;&#30340;&#22810;&#25968;&#65292;&#21363;&#38656;&#35201;$N \geq 2t+1$&#20010;&#35745;&#31639;&#33410;&#28857;&#20197;&#30830;&#20445;&#23545;&#25239;&#24615;&#33410;&#28857;&#30340;&#38544;&#31169;&#12290;&#25105;&#20204;&#36890;&#36807;&#20801;&#35768;&#19968;&#23450;&#37327;&#30340;&#20449;&#24687;&#27844;&#28431;&#21644;&#36817;&#20284;&#20056;&#27861;&#26469;&#30740;&#31350;&#22312;&#35802;&#23454;&#33410;&#28857;&#25968;&#37327;&#20026;&#23569;&#25968;&#26102;&#30340;&#32534;&#30721;&#26041;&#26696;&#65292;&#21363;$N&lt; 2t+1$&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#24046;&#20998;&#38544;&#31169;&#32780;&#19981;&#26159;&#23436;&#32654;&#38544;&#31169;&#26469;&#27979;&#37327;&#20449;&#24687;&#27844;&#28431;&#65292;&#24182;&#20351;&#29992;&#22343;&#26041;&#35823;&#24046;&#24230;&#37327;&#20934;&#30830;&#24615;&#65292;&#23545;$N &lt; 2t+1$&#30340;&#24773;&#20917;&#19979;&#30340;&#38544;&#31169;-&#20934;&#30830;&#24615;&#26435;&#34913;&#36827;&#34892;&#20102;&#32039;&#23494;&#30340;&#21051;&#30011;&#12290;&#19968;&#20010;&#26032;&#39062;&#30340;&#25216;&#26415;&#26041;&#38754;&#26159;&#22797;&#26434;&#22320;&#25511;&#21046;&#20449;&#24687;&#27844;&#28431;&#30340;&#32454;&#33410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of private distributed multi-party multiplication. It is well-established that Shamir secret-sharing coding strategies can enable perfect information-theoretic privacy in distributed computation via the celebrated algorithm of Ben Or, Goldwasser and Wigderson (the "BGW algorithm"). However, perfect privacy and accuracy require an honest majority, that is, $N \geq 2t+1$ compute nodes are required to ensure privacy against any $t$ colluding adversarial nodes. By allowing for some controlled amount of information leakage and approximate multiplication instead of exact multiplication, we study coding schemes for the setting where the number of honest nodes can be a minority, that is $N&lt; 2t+1.$ We develop a tight characterization privacy-accuracy trade-off for cases where $N &lt; 2t+1$ by measuring information leakage using {differential} privacy instead of perfect privacy, and using the mean squared error metric for accuracy. A novel technical aspect is an intricately 
&lt;/p&gt;</description></item></channel></rss>