<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23574;&#23792;&#21327;&#26041;&#24046;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#24046;&#20998;&#38544;&#31169;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#21327;&#26041;&#24046;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#39640;&#25928;&#30340;&#24046;&#20998;&#38544;&#31169;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#26368;&#23567;&#26368;&#22823;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.03820</link><description>&lt;p&gt;
&#22312;&#24102;&#26377;&#23574;&#23792;&#21327;&#26041;&#24046;&#30697;&#38453;&#20013;&#30340;&#26368;&#20248;&#24046;&#20998;&#38544;&#31169;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Optimal Differentially Private PCA and Estimation for Spiked Covariance Matrices. (arXiv:2401.03820v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03820
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23574;&#23792;&#21327;&#26041;&#24046;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#24046;&#20998;&#38544;&#31169;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#21327;&#26041;&#24046;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#39640;&#25928;&#30340;&#24046;&#20998;&#38544;&#31169;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#26368;&#23567;&#26368;&#22823;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24403;&#20195;&#32479;&#35745;&#23398;&#20013;&#65292;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#21450;&#20854;&#30456;&#20851;&#30340;&#20027;&#25104;&#20998;&#26159;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#12290;&#23613;&#31649;&#24050;&#24320;&#21457;&#20986;&#20855;&#26377;&#33391;&#22909;&#24615;&#36136;&#30340;&#26368;&#20248;&#20272;&#35745;&#31243;&#24207;&#65292;&#20294;&#23545;&#38544;&#31169;&#20445;&#25252;&#30340;&#22686;&#21152;&#38656;&#27714;&#32473;&#36825;&#20010;&#32463;&#20856;&#38382;&#39064;&#24341;&#20837;&#20102;&#26032;&#30340;&#22797;&#26434;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23574;&#23792;&#21327;&#26041;&#24046;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#24046;&#20998;&#38544;&#31169;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#21644;&#21327;&#26041;&#24046;&#20272;&#35745;&#12290;&#25105;&#20204;&#31934;&#30830;&#22320;&#21051;&#30011;&#20102;&#22312;&#35813;&#27169;&#22411;&#19979;&#29305;&#24449;&#20540;&#21644;&#29305;&#24449;&#21521;&#37327;&#30340;&#25935;&#24863;&#24615;&#65292;&#24182;&#24314;&#31435;&#20102;&#20272;&#35745;&#20027;&#25104;&#20998;&#21644;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#26368;&#23567;&#26368;&#22823;&#25910;&#25947;&#29575;&#12290;&#36825;&#20123;&#25910;&#25947;&#29575;&#21253;&#25324;&#19968;&#33324;&#30340;Schatten&#33539;&#25968;&#65292;&#21253;&#25324;&#35889;&#33539;&#25968;&#65292;Frobenius&#33539;&#25968;&#21644;&#26680;&#33539;&#25968;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#35745;&#31639;&#39640;&#25928;&#30340;&#24046;&#20998;&#38544;&#31169;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#23427;&#20204;&#30340;&#26368;&#23567;&#26368;&#22823;&#24615;&#65292;&#30452;&#21040;&#23545;&#25968;&#22240;&#23376;&#12290;&#21478;&#22806;&#65292;&#21305;&#37197;&#30340;minimax&#26368;&#23567;&#26368;&#22823;&#29575;&#20063;&#24471;&#21040;&#20102;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimating a covariance matrix and its associated principal components is a fundamental problem in contemporary statistics. While optimal estimation procedures have been developed with well-understood properties, the increasing demand for privacy preservation introduces new complexities to this classical problem. In this paper, we study optimal differentially private Principal Component Analysis (PCA) and covariance estimation within the spiked covariance model.  We precisely characterize the sensitivity of eigenvalues and eigenvectors under this model and establish the minimax rates of convergence for estimating both the principal components and covariance matrix. These rates hold up to logarithmic factors and encompass general Schatten norms, including spectral norm, Frobenius norm, and nuclear norm as special cases.  We introduce computationally efficient differentially private estimators and prove their minimax optimality, up to logarithmic factors. Additionally, matching minimax l
&lt;/p&gt;</description></item></channel></rss>