<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#24191;&#20041;&#27491;&#20132;Procrustes&#38382;&#39064;&#22312;&#22810;&#20010;&#31185;&#23398;&#39046;&#22495;&#20013;&#36215;&#21040;&#22522;&#30784;&#24615;&#20316;&#29992;&#12290;SDR&#21487;&#20197;&#31934;&#30830;&#24674;&#22797;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#65292;&#32780;&#36866;&#24403;&#21021;&#22987;&#21270;&#19979;&#30340;&#24191;&#20041;&#21151;&#29575;&#26041;&#27861;&#20197;&#32447;&#24615;&#26041;&#24335;&#25910;&#25947;&#20110;SDR&#30340;&#20840;&#23616;&#26368;&#23567;&#21270;&#22120;&#12290;</title><link>http://arxiv.org/abs/2106.15493</link><description>&lt;p&gt;
&#20219;&#24847;&#23545;&#25163;&#19979;&#30340;&#24191;&#20041;&#27491;&#20132;Procrustes&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Generalized Orthogonal Procrustes Problem under Arbitrary Adversaries. (arXiv:2106.15493v2 [cs.IT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.15493
&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#27491;&#20132;Procrustes&#38382;&#39064;&#22312;&#22810;&#20010;&#31185;&#23398;&#39046;&#22495;&#20013;&#36215;&#21040;&#22522;&#30784;&#24615;&#20316;&#29992;&#12290;SDR&#21487;&#20197;&#31934;&#30830;&#24674;&#22797;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#65292;&#32780;&#36866;&#24403;&#21021;&#22987;&#21270;&#19979;&#30340;&#24191;&#20041;&#21151;&#29575;&#26041;&#27861;&#20197;&#32447;&#24615;&#26041;&#24335;&#25910;&#25947;&#20110;SDR&#30340;&#20840;&#23616;&#26368;&#23567;&#21270;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#27491;&#20132;Procrustes&#38382;&#39064;&#65288;Generalized Orthogonal Procrustes Problem&#65292;GOPP&#65289;&#22312;&#32479;&#35745;&#23398;&#12289;&#25104;&#20687;&#31185;&#23398;&#21644;&#35745;&#31639;&#26426;&#35270;&#35273;&#31561;&#22810;&#20010;&#31185;&#23398;&#39046;&#22495;&#20013;&#37117;&#20855;&#26377;&#22522;&#30784;&#24615;&#20316;&#29992;&#12290;&#23613;&#31649;&#20854;&#22312;&#23454;&#38469;&#20013;&#20855;&#26377;&#24040;&#22823;&#30340;&#37325;&#35201;&#24615;&#65292;&#20294;&#36890;&#24120;&#24456;&#38590;&#25214;&#21040;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#30340; NP-hard &#38382;&#39064;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21322;&#23450;&#26494;&#24347;&#65288;Semidefinite Relaxation&#65292;SDR&#65289;&#21644;&#19968;&#31181;&#21517;&#20026;&#24191;&#20041;&#21151;&#29575;&#26041;&#27861;&#65288;Generalized Power Method&#65292;GPM&#65289;&#30340;&#36845;&#20195;&#26041;&#27861;&#65292;&#20197;&#23547;&#25214;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#65292;&#24182;&#30740;&#31350;&#20102;&#22312;&#20449;&#21495;&#21152;&#22122;&#22768;&#27169;&#22411;&#19979;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;SDR&#21487;&#20197;&#31934;&#30830;&#24674;&#22797;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#65292;&#24182;&#19988;&#22312;&#36866;&#24403;&#30340;&#21021;&#22987;&#21270;&#19979;&#65292;&#24191;&#20041;&#21151;&#29575;&#26041;&#27861;&#20197;&#32447;&#24615;&#26041;&#24335;&#25910;&#25947;&#20110;SDR&#30340;&#20840;&#23616;&#26368;&#23567;&#21270;&#22120;&#65292;&#21069;&#25552;&#26159;&#20449;&#22122;&#27604;&#36739;&#22823;&#12290;&#20027;&#35201;&#25216;&#26415;&#22522;&#20110;&#23637;&#31034;GPM&#20013;&#28041;&#21450;&#30340;&#38750;&#32447;&#24615;&#26144;&#23556;&#26412;&#36136;&#19978;&#26159;&#23616;&#37096;&#25910;&#32553;&#26144;&#23556;&#65292;&#28982;&#21518;&#24212;&#29992;&#33879;&#21517;&#30340;Banach&#19981;&#21160;&#28857;&#23450;&#29702;&#23436;&#25104;&#35777;&#26126;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#20998;&#26512;&#20102;&#20302;&#31209;&#20998;&#35299;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The generalized orthogonal Procrustes problem (GOPP) plays a fundamental role in several scientific disciplines including statistics, imaging science and computer vision. Despite its tremendous practical importance, it is generally an NP-hard problem to find the least squares estimator. We study the semidefinite relaxation (SDR) and an iterative method named generalized power method (GPM) to find the least squares estimator, and investigate the performance under a signal-plus-noise model. We show that the SDR recovers the least squares estimator exactly and moreover the generalized power method with a proper initialization converges linearly to the global minimizer to the SDR, provided that the signal-to-noise ratio is large. The main technique follows from showing the nonlinear mapping involved in the GPM is essentially a local contraction mapping and then applying the well-known Banach fixed-point theorem finishes the proof. In addition, we analyze the low-rank factorization algorith
&lt;/p&gt;</description></item></channel></rss>