<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>Transformers&#36890;&#36807;&#26799;&#24230;&#19979;&#38477;&#23398;&#20064;&#22240;&#26524;&#32467;&#26500;&#30340;&#36807;&#31243;&#20013;&#65292;&#20851;&#38190;&#30340;&#35777;&#25454;&#26159;&#27880;&#24847;&#21147;&#30697;&#38453;&#30340;&#26799;&#24230;&#32534;&#30721;&#20102;token&#20043;&#38388;&#30340;&#20114;&#20449;&#24687;</title><link>https://arxiv.org/abs/2402.14735</link><description>&lt;p&gt;
Transformers&#22914;&#20309;&#36890;&#36807;&#26799;&#24230;&#19979;&#38477;&#23398;&#20064;&#22240;&#26524;&#32467;&#26500;
&lt;/p&gt;
&lt;p&gt;
How Transformers Learn Causal Structure with Gradient Descent
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14735
&lt;/p&gt;
&lt;p&gt;
Transformers&#36890;&#36807;&#26799;&#24230;&#19979;&#38477;&#23398;&#20064;&#22240;&#26524;&#32467;&#26500;&#30340;&#36807;&#31243;&#20013;&#65292;&#20851;&#38190;&#30340;&#35777;&#25454;&#26159;&#27880;&#24847;&#21147;&#30697;&#38453;&#30340;&#26799;&#24230;&#32534;&#30721;&#20102;token&#20043;&#38388;&#30340;&#20114;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Transformers&#22312;&#24207;&#21015;&#24314;&#27169;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#20196;&#20154;&#38590;&#20197;&#32622;&#20449;&#30340;&#25104;&#21151;&#65292;&#36825;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#24402;&#21151;&#20110;&#33258;&#27880;&#24847;&#26426;&#21046;&#65292;&#23427;&#20801;&#35768;&#20449;&#24687;&#22312;&#24207;&#21015;&#30340;&#19981;&#21516;&#37096;&#20998;&#20043;&#38388;&#20256;&#36882;&#12290;&#33258;&#27880;&#24847;&#26426;&#21046;&#20351;&#24471;transformers&#33021;&#22815;&#32534;&#30721;&#22240;&#26524;&#32467;&#26500;&#65292;&#20174;&#32780;&#20351;&#20854;&#29305;&#21035;&#36866;&#21512;&#24207;&#21015;&#24314;&#27169;&#12290;&#28982;&#32780;&#65292;transformers&#36890;&#36807;&#26799;&#24230;&#35757;&#32451;&#31639;&#27861;&#23398;&#20064;&#36825;&#31181;&#22240;&#26524;&#32467;&#26500;&#30340;&#36807;&#31243;&#20173;&#28982;&#19981;&#22826;&#28165;&#26970;&#12290;&#20026;&#20102;&#26356;&#22909;&#22320;&#29702;&#35299;&#36825;&#20010;&#36807;&#31243;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#38656;&#35201;&#23398;&#20064;&#28508;&#22312;&#22240;&#26524;&#32467;&#26500;&#30340;&#19978;&#19979;&#25991;&#23398;&#20064;&#20219;&#21153;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#31616;&#21270;&#30340;&#20004;&#23618;transformer&#19978;&#30340;&#26799;&#24230;&#19979;&#38477;&#21487;&#20197;&#23398;&#20250;&#35299;&#20915;&#36825;&#20010;&#20219;&#21153;&#65292;&#36890;&#36807;&#22312;&#31532;&#19968;&#23618;&#27880;&#24847;&#21147;&#20013;&#32534;&#30721;&#28508;&#22312;&#22240;&#26524;&#22270;&#26469;&#23436;&#25104;&#12290;&#25105;&#20204;&#35777;&#26126;&#30340;&#20851;&#38190;&#27934;&#23519;&#26159;&#27880;&#24847;&#21147;&#30697;&#38453;&#30340;&#26799;&#24230;&#32534;&#30721;&#20102;token&#20043;&#38388;&#30340;&#20114;&#20449;&#24687;&#12290;&#30001;&#20110;&#25968;&#25454;&#22788;&#29702;&#19981;&#31561;&#24335;&#30340;&#32467;&#26524;&#65292;&#27880;&#24847;&#21147;&#30697;&#38453;&#20013;&#26368;&#22823;&#30340;&#26465;&#30446;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14735v1 Announce Type: new  Abstract: The incredible success of transformers on sequence modeling tasks can be largely attributed to the self-attention mechanism, which allows information to be transferred between different parts of a sequence. Self-attention allows transformers to encode causal structure which makes them particularly suitable for sequence modeling. However, the process by which transformers learn such causal structure via gradient-based training algorithms remains poorly understood. To better understand this process, we introduce an in-context learning task that requires learning latent causal structure. We prove that gradient descent on a simplified two-layer transformer learns to solve this task by encoding the latent causal graph in the first attention layer. The key insight of our proof is that the gradient of the attention matrix encodes the mutual information between tokens. As a consequence of the data processing inequality, the largest entries of th
&lt;/p&gt;</description></item></channel></rss>