<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#26368;&#20248;&#20256;&#36865;&#20013;&#20351;&#29992;&#24418;&#24335;&#20026;$\mathsf{c}(x, y) = \mathsf{u}(x^{\mathfrak{t}}y)$&#30340;&#36153;&#29992;&#20989;&#25968;&#26102;&#30340;&#38646;&#21644;&#38750;&#36127;MTW&#24352;&#37327;&#30340;&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;MTW&#24352;&#37327;&#22312;&#38646;&#21521;&#37327;&#19978;&#20026;&#38646;&#30340;&#26465;&#20214;&#20197;&#21450;&#30456;&#24212;&#30340;&#32447;&#24615;ODE&#30340;&#31616;&#21270;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#36824;&#32473;&#20986;&#20102;&#36870;&#20989;&#25968;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#20197;&#21450;&#19968;&#20123;&#20855;&#20307;&#30340;&#24212;&#29992;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2401.00953</link><description>&lt;p&gt;
&#25317;&#26377;&#38646;&#21644;&#38750;&#36127;MTW&#24352;&#37327;&#30340;&#36153;&#29992;&#26063;&#22312;&#26368;&#20248;&#20256;&#36865;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Families of costs with zero and nonnegative MTW tensor in optimal transport. (arXiv:2401.00953v1 [math.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.00953
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#26368;&#20248;&#20256;&#36865;&#20013;&#20351;&#29992;&#24418;&#24335;&#20026;$\mathsf{c}(x, y) = \mathsf{u}(x^{\mathfrak{t}}y)$&#30340;&#36153;&#29992;&#20989;&#25968;&#26102;&#30340;&#38646;&#21644;&#38750;&#36127;MTW&#24352;&#37327;&#30340;&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;MTW&#24352;&#37327;&#22312;&#38646;&#21521;&#37327;&#19978;&#20026;&#38646;&#30340;&#26465;&#20214;&#20197;&#21450;&#30456;&#24212;&#30340;&#32447;&#24615;ODE&#30340;&#31616;&#21270;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#36824;&#32473;&#20986;&#20102;&#36870;&#20989;&#25968;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#20197;&#21450;&#19968;&#20123;&#20855;&#20307;&#30340;&#24212;&#29992;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35745;&#31639;&#20102;&#22312;$\mathbb{R}^n$&#19978;&#20855;&#26377;&#24418;&#24335;$\mathsf{c}(x, y) = \mathsf{u}(x^{\mathfrak{t}}y)$&#30340;&#36153;&#29992;&#20989;&#25968;&#30340;&#26368;&#20248;&#20256;&#36865;&#38382;&#39064;&#30340;MTW&#24352;&#37327;&#65288;&#25110;&#20132;&#21449;&#26354;&#29575;&#65289;&#12290;&#20854;&#20013;&#65292;$\mathsf{u}$&#26159;&#19968;&#20010;&#20855;&#26377;&#36870;&#20989;&#25968;$\mathsf{s}$&#30340;&#26631;&#37327;&#20989;&#25968;&#65292;$x^{\ft}y$&#26159;&#23646;&#20110;$\mathbb{R}^n$&#24320;&#23376;&#38598;&#30340;&#21521;&#37327;$x&#65292;y$&#30340;&#38750;&#36864;&#21270;&#21452;&#32447;&#24615;&#37197;&#23545;&#12290;MTW&#24352;&#37327;&#22312;Kim-McCann&#24230;&#37327;&#19979;&#23545;&#20110;&#38646;&#21521;&#37327;&#30340;&#26465;&#20214;&#26159;&#19968;&#20010;&#22235;&#38454;&#38750;&#32447;&#24615;ODE&#65292;&#21487;&#20197;&#34987;&#31616;&#21270;&#20026;&#20855;&#26377;&#24120;&#25968;&#31995;&#25968;$P$&#21644;$S$&#30340;&#24418;&#24335;&#20026;$\mathsf{s}^{(2)} - S\mathsf{s}^{(1)} + P\mathsf{s} = 0$&#30340;&#32447;&#24615;ODE&#12290;&#26368;&#32456;&#24471;&#21040;&#30340;&#36870;&#20989;&#25968;&#21253;&#25324;Lambert&#21644;&#24191;&#20041;&#21453;&#21452;&#26354;/&#19977;&#35282;&#20989;&#25968;&#12290;&#24179;&#26041;&#27431;&#27663;&#24230;&#37327;&#21644;$\log$&#22411;&#36153;&#29992;&#26159;&#36825;&#20123;&#35299;&#30340;&#23454;&#20363;&#12290;&#36825;&#20010;&#23478;&#26063;&#30340;&#26368;&#20248;&#26144;&#23556;&#20063;&#26159;&#26174;&#24335;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We compute explicitly the MTW tensor (or cross curvature) for the optimal transport problem on $\mathbb{R}^n$ with a cost function of form $\mathsf{c}(x, y) = \mathsf{u}(x^{\mathfrak{t}}y)$, where $\mathsf{u}$ is a scalar function with inverse $\mathsf{s}$, $x^{\ft}y$ is a nondegenerate bilinear pairing of vectors $x, y$ belonging to an open subset of $\mathbb{R}^n$. The condition that the MTW-tensor vanishes on null vectors under the Kim-McCann metric is a fourth-order nonlinear ODE, which could be reduced to a linear ODE of the form $\mathsf{s}^{(2)} - S\mathsf{s}^{(1)} + P\mathsf{s} = 0$ with constant coefficients $P$ and $S$. The resulting inverse functions include {\it Lambert} and {\it generalized inverse hyperbolic\slash trigonometric} functions. The square Euclidean metric and $\log$-type costs are equivalent to instances of these solutions. The optimal map for the family is also explicit. For cost functions of a similar form on a hyperboloid model of the hyperbolic space and u
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24322;&#27493;&#32852;&#37030;&#23398;&#20064;&#30340;&#35843;&#24230;&#31574;&#30053;&#21644;&#32858;&#21512;&#21152;&#26435;&#35774;&#35745;&#65292;&#36890;&#36807;&#37319;&#29992;&#22522;&#20110;&#20449;&#36947;&#24863;&#30693;&#25968;&#25454;&#37325;&#35201;&#24615;&#30340;&#35843;&#24230;&#31574;&#30053;&#21644;&#8220;&#24180;&#40836;&#24863;&#30693;&#8221;&#30340;&#32858;&#21512;&#21152;&#26435;&#35774;&#35745;&#26469;&#35299;&#20915;FL&#31995;&#32479;&#20013;&#30340;&#8220;&#25302;&#27795;&#8221;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#20223;&#30495;&#35777;&#23454;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2212.07356</link><description>&lt;p&gt;
&#24322;&#27493;&#32852;&#37030;&#23398;&#20064;&#22312;&#26080;&#32447;&#32593;&#32476;&#20013;&#30340;&#35843;&#24230;&#21644;&#32858;&#21512;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Scheduling and Aggregation Design for Asynchronous Federated Learning over Wireless Networks. (arXiv:2212.07356v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.07356
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24322;&#27493;&#32852;&#37030;&#23398;&#20064;&#30340;&#35843;&#24230;&#31574;&#30053;&#21644;&#32858;&#21512;&#21152;&#26435;&#35774;&#35745;&#65292;&#36890;&#36807;&#37319;&#29992;&#22522;&#20110;&#20449;&#36947;&#24863;&#30693;&#25968;&#25454;&#37325;&#35201;&#24615;&#30340;&#35843;&#24230;&#31574;&#30053;&#21644;&#8220;&#24180;&#40836;&#24863;&#30693;&#8221;&#30340;&#32858;&#21512;&#21152;&#26435;&#35774;&#35745;&#26469;&#35299;&#20915;FL&#31995;&#32479;&#20013;&#30340;&#8220;&#25302;&#27795;&#8221;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#20223;&#30495;&#35777;&#23454;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#26159;&#19968;&#31181;&#21327;&#20316;&#30340;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#26694;&#26550;&#65292;&#23427;&#32467;&#21512;&#20102;&#35774;&#22791;&#19978;&#30340;&#35757;&#32451;&#21644;&#22522;&#20110;&#26381;&#21153;&#22120;&#30340;&#32858;&#21512;&#26469;&#22312;&#20998;&#24067;&#24335;&#20195;&#29702;&#38388;&#35757;&#32451;&#36890;&#29992;&#30340;ML&#27169;&#22411;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24322;&#27493;FL&#35774;&#35745;&#65292;&#37319;&#29992;&#21608;&#26399;&#24615;&#30340;&#32858;&#21512;&#26469;&#35299;&#20915;FL&#31995;&#32479;&#20013;&#30340;&#8220;&#25302;&#27795;&#8221;&#38382;&#39064;&#12290;&#32771;&#34385;&#21040;&#26377;&#38480;&#30340;&#26080;&#32447;&#36890;&#20449;&#36164;&#28304;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#35843;&#24230;&#31574;&#30053;&#21644;&#32858;&#21512;&#35774;&#35745;&#23545;&#25910;&#25947;&#24615;&#33021;&#30340;&#24433;&#21709;&#12290;&#22522;&#20110;&#38477;&#20302;&#32858;&#21512;&#27169;&#22411;&#26356;&#26032;&#30340;&#20559;&#24046;&#21644;&#26041;&#24046;&#30340;&#37325;&#35201;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#35843;&#24230;&#31574;&#30053;&#65292;&#23427;&#21516;&#26102;&#32771;&#34385;&#20102;&#29992;&#25143;&#35774;&#22791;&#30340;&#20449;&#36947;&#36136;&#37327;&#21644;&#35757;&#32451;&#25968;&#25454;&#34920;&#31034;&#12290;&#36890;&#36807;&#20223;&#30495;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#22522;&#20110;&#20449;&#36947;&#24863;&#30693;&#25968;&#25454;&#37325;&#35201;&#24615;&#30340;&#35843;&#24230;&#31574;&#30053;&#30456;&#23545;&#20110;&#21516;&#27493;&#32852;&#37030;&#23398;&#20064;&#25552;&#20986;&#30340;&#29616;&#26377;&#26368;&#26032;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#19968;&#31181;&#8220;&#24180;&#40836;&#24863;&#30693;&#8221;&#30340;&#32858;&#21512;&#21152;&#26435;&#35774;&#35745;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#23398;&#20064;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated Learning (FL) is a collaborative machine learning (ML) framework that combines on-device training and server-based aggregation to train a common ML model among distributed agents. In this work, we propose an asynchronous FL design with periodic aggregation to tackle the straggler issue in FL systems. Considering limited wireless communication resources, we investigate the effect of different scheduling policies and aggregation designs on the convergence performance. Driven by the importance of reducing the bias and variance of the aggregated model updates, we propose a scheduling policy that jointly considers the channel quality and training data representation of user devices. The effectiveness of our channel-aware data-importance-based scheduling policy, compared with state-of-the-art methods proposed for synchronous FL, is validated through simulations. Moreover, we show that an ``age-aware'' aggregation weighting design can significantly improve the learning performance i
&lt;/p&gt;</description></item></channel></rss>