<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#30450;&#24402;&#19968;&#21270;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;&#30340;&#26816;&#27979;&#22120;&#65292;&#29992;&#20110;&#35299;&#20915;&#26234;&#33021;&#22823;&#35268;&#27169;&#38543;&#26426;&#25509;&#20837;&#20013;&#30340;&#21069;&#23548;&#30896;&#25758;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#24320;&#21457;&#25913;&#36827;Hadamard&#21464;&#25442;&#21644;&#35774;&#35745;&#22359;MHT&#23618;&#26469;&#25552;&#39640;&#26816;&#27979;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2403.18846</link><description>&lt;p&gt;
&#22522;&#20110;&#30450;&#24402;&#19968;&#21270;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;&#30340;&#26234;&#33021;&#22823;&#35268;&#27169;&#38543;&#26426;&#25509;&#20837;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
The Blind Normalized Stein Variational Gradient Descent-Based Detection for Intelligent Massive Random Access
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18846
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#30450;&#24402;&#19968;&#21270;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;&#30340;&#26816;&#27979;&#22120;&#65292;&#29992;&#20110;&#35299;&#20915;&#26234;&#33021;&#22823;&#35268;&#27169;&#38543;&#26426;&#25509;&#20837;&#20013;&#30340;&#21069;&#23548;&#30896;&#25758;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#24320;&#21457;&#25913;&#36827;Hadamard&#21464;&#25442;&#21644;&#35774;&#35745;&#22359;MHT&#23618;&#26469;&#25552;&#39640;&#26816;&#27979;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32570;&#20047;&#39640;&#25928;&#30340;&#21069;&#23548;&#26816;&#27979;&#31639;&#27861;&#20173;&#28982;&#26159;&#35299;&#20915;&#23454;&#38469;&#36890;&#20449;&#22330;&#26223;&#20013;&#26234;&#33021;&#22823;&#35268;&#27169;&#38543;&#26426;&#25509;&#20837;(RA)&#20013;&#21069;&#23548;&#30896;&#25758;&#38382;&#39064;&#30340;&#25361;&#25112;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;(MLE)&#27169;&#22411;&#30340;&#26089;&#26399;&#21069;&#23548;&#26816;&#27979;&#26041;&#26696;&#65292;&#22312;&#25480;&#20104;&#24335;RA&#27969;&#31243;&#30340;&#31532;&#19968;&#27493;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#30450;&#24402;&#19968;&#21270;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;(SVGD)&#30340;&#26816;&#27979;&#22120;&#65292;&#20197;&#33719;&#24471;MLE&#27169;&#22411;&#30340;&#36817;&#20284;&#35299;&#12290;&#39318;&#20808;&#65292;&#36890;&#36807;&#25506;&#32034;Hadamard&#21464;&#25442;&#21644;&#23567;&#27874;&#21464;&#25442;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#25913;&#36827;Hadamard&#21464;&#25442;(MHT)&#65292;&#20351;&#29992;&#20108;&#38454;&#23548;&#25968;&#28388;&#27874;&#22120;&#23558;&#39640;&#39057;&#20998;&#31163;&#20986;&#37325;&#35201;&#37096;&#20998;&#12290;&#25509;&#19979;&#26469;&#65292;&#20026;&#20102;&#28040;&#38500;SVGD&#26816;&#27979;&#22120;&#20013;&#30340;&#22122;&#22768;&#24182;&#20943;&#36731;&#26799;&#24230;&#28040;&#22833;&#38382;&#39064;&#65292;&#35774;&#35745;&#20102;&#22522;&#20110;MHT&#30340;&#22359;MHT&#23618;&#65292;&#35813;&#23618;&#22522;&#20110;MHT&#12289;&#32553;&#25918;&#23618;&#12289;&#36719;&#38408;&#20540;&#23618;&#26500;&#24314;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18846v1 Announce Type: cross  Abstract: The lack of an efficient preamble detection algorithm remains a challenge for solving preamble collision problems in intelligent massive random access (RA) in practical communication scenarios. To solve this problem, we present a novel early preamble detection scheme based on a maximum likelihood estimation (MLE) model at the first step of the grant-based RA procedure. A novel blind normalized Stein variational gradient descent (SVGD)-based detector is proposed to obtain an approximate solution to the MLE model. First, by exploring the relationship between the Hadamard transform and wavelet transform, a new modified Hadamard transform (MHT) is developed to separate high-frequencies from important components using the second-order derivative filter. Next, to eliminate noise and mitigate the vanishing gradients problem in the SVGD-based detectors, the block MHT layer is designed based on the MHT, scaling layer, soft-thresholding layer, i
&lt;/p&gt;</description></item></channel></rss>