<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>FedStruct&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#28145;&#23618;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#22312;&#20114;&#32852;&#22270;&#19978;&#36827;&#34892;&#32852;&#21512;&#35299;&#32806;&#23398;&#20064;&#65292;&#26377;&#25928;&#22320;&#32500;&#25252;&#38544;&#31169;&#24182;&#25429;&#25417;&#33410;&#28857;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2402.19163</link><description>&lt;p&gt;
FedStruct&#65306;&#32852;&#21512;&#35299;&#32806;&#23398;&#20064;&#22312;&#20114;&#32852;&#22270;&#19978;
&lt;/p&gt;
&lt;p&gt;
FedStruct: Federated Decoupled Learning over Interconnected Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19163
&lt;/p&gt;
&lt;p&gt;
FedStruct&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#28145;&#23618;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#22312;&#20114;&#32852;&#22270;&#19978;&#36827;&#34892;&#32852;&#21512;&#35299;&#32806;&#23398;&#20064;&#65292;&#26377;&#25928;&#22320;&#32500;&#25252;&#38544;&#31169;&#24182;&#25429;&#25417;&#33410;&#28857;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35299;&#20915;&#20102;&#20998;&#24067;&#22312;&#22810;&#20010;&#23458;&#25143;&#31471;&#19978;&#30340;&#22270;&#32467;&#26500;&#25968;&#25454;&#19978;&#30340;&#32852;&#21512;&#23398;&#20064;&#25361;&#25112;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#20851;&#27880;&#20114;&#32852;&#23376;&#22270;&#30340;&#26222;&#36941;&#24773;&#20917;&#65292;&#20854;&#20013;&#19981;&#21516;&#23458;&#25143;&#31471;&#20043;&#38388;&#30340;&#30456;&#20114;&#36830;&#25509;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#38024;&#23545;&#36825;&#31181;&#24773;&#20917;&#30340;&#19968;&#31181;&#26032;&#39062;&#26694;&#26550;&#65292;&#21517;&#20026;FedStruct&#65292;&#23427;&#21033;&#29992;&#28145;&#23618;&#32467;&#26500;&#20381;&#36182;&#20851;&#31995;&#12290;&#20026;&#20102;&#32500;&#25252;&#38544;&#31169;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#19981;&#21516;&#65292;FedStruct&#28040;&#38500;&#20102;&#22312;&#23458;&#25143;&#31471;&#20043;&#38388;&#20849;&#20139;&#25110;&#29983;&#25104;&#25935;&#24863;&#33410;&#28857;&#29305;&#24449;&#25110;&#23884;&#20837;&#30340;&#24517;&#35201;&#24615;&#12290;&#30456;&#21453;&#65292;&#23427;&#21033;&#29992;&#26174;&#24335;&#20840;&#23616;&#22270;&#32467;&#26500;&#20449;&#24687;&#26469;&#25429;&#25417;&#33410;&#28857;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#20845;&#20010;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#30340;&#23454;&#39564;&#32467;&#26524;&#39564;&#35777;&#20102;FedStruct&#30340;&#26377;&#25928;&#24615;&#65292;&#23637;&#31034;&#20102;&#22312;&#21508;&#31181;&#24773;&#20917;&#19979;&#65288;&#21253;&#25324;&#19981;&#21516;&#25968;&#25454;&#20998;&#21306;&#26041;&#27861;&#12289;&#19981;&#21516;&#26631;&#31614;&#21487;&#29992;&#24615;&#20197;&#21450;&#23458;&#25143;&#20010;&#25968;&#30340;&#65289;&#25509;&#36817;&#20110;&#38598;&#20013;&#24335;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19163v1 Announce Type: new  Abstract: We address the challenge of federated learning on graph-structured data distributed across multiple clients. Specifically, we focus on the prevalent scenario of interconnected subgraphs, where inter-connections between different clients play a critical role. We present a novel framework for this scenario, named FedStruct, that harnesses deep structural dependencies. To uphold privacy, unlike existing methods, FedStruct eliminates the necessity of sharing or generating sensitive node features or embeddings among clients. Instead, it leverages explicit global graph structure information to capture inter-node dependencies. We validate the effectiveness of FedStruct through experimental results conducted on six datasets for semi-supervised node classification, showcasing performance close to the centralized approach across various scenarios, including different data partitioning methods, varying levels of label availability, and number of cl
&lt;/p&gt;</description></item></channel></rss>