<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#20108;&#27425;Littlewood-Offord&#38382;&#39064;&#30340;&#32479;&#35745;&#40065;&#26834;&#24615;&#65292;&#20272;&#35745;&#20102;&#23545;&#25239;&#24615;&#22122;&#22768;&#23545;&#20108;&#27425;Radamecher&#28151;&#27788;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#20108;&#27425;&#21644;&#21452;&#32447;&#24615;Rademacher&#28151;&#27788;&#30340;&#32479;&#35745;&#40065;&#26834;&#24615;&#30340;&#19979;&#38480;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2402.10504</link><description>&lt;p&gt;
&#20108;&#27425;Littlewood-Offord&#38382;&#39064;&#30340;&#24377;&#24615;
&lt;/p&gt;
&lt;p&gt;
Resilience of the quadratic Littlewood-Offord problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10504
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#20108;&#27425;Littlewood-Offord&#38382;&#39064;&#30340;&#32479;&#35745;&#40065;&#26834;&#24615;&#65292;&#20272;&#35745;&#20102;&#23545;&#25239;&#24615;&#22122;&#22768;&#23545;&#20108;&#27425;Radamecher&#28151;&#27788;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#20108;&#27425;&#21644;&#21452;&#32447;&#24615;Rademacher&#28151;&#27788;&#30340;&#32479;&#35745;&#40065;&#26834;&#24615;&#30340;&#19979;&#38480;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#39640;&#32500;&#25968;&#25454;&#30340;&#32479;&#35745;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#25552;&#20379;&#20102;&#20851;&#20110;&#23545;&#25239;&#24615;&#22122;&#22768;&#23545;&#20108;&#27425;Radamecher&#28151;&#27788;$\boldsymbol{\xi}^{\mathsf{T}} M \boldsymbol{\xi}$&#21453;&#38598;&#20013;&#29305;&#24615;&#30340;&#24433;&#21709;&#30340;&#20272;&#35745;&#65292;&#20854;&#20013;$M$&#26159;&#19968;&#20010;&#22266;&#23450;&#30340;&#65288;&#39640;&#32500;&#65289;&#30697;&#38453;&#65292;$\boldsymbol{\xi}$&#26159;&#19968;&#20010;&#20849;&#24418;Rademacher&#21521;&#37327;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;$\boldsymbol{\xi}$&#33021;&#22815;&#25215;&#21463;&#22810;&#23569;&#23545;&#25239;&#24615;&#31526;&#21495;&#32763;&#36716;&#32780;&#19981;&#8220;&#33192;&#32960;&#8221;$\sup_{x\in \mathbb{R}} \mathbb{P} \left\{\boldsymbol{\xi}^{\mathsf{T}} M \boldsymbol{\xi} = x\right\}$&#65292;&#20174;&#32780;&#8220;&#21435;&#38500;&#8221;&#21407;&#22987;&#20998;&#24067;&#23548;&#33268;&#26356;&#8220;&#26377;&#31890;&#24230;&#8221;&#21644;&#23545;&#25239;&#24615;&#20559;&#20506;&#30340;&#20998;&#24067;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#20026;&#20108;&#27425;&#21644;&#21452;&#32447;&#24615;Rademacher&#28151;&#27788;&#30340;&#32479;&#35745;&#40065;&#26834;&#24615;&#25552;&#20379;&#20102;&#19979;&#38480;&#20272;&#35745;&#65307;&#36825;&#20123;&#32467;&#26524;&#22312;&#20851;&#38190;&#21306;&#22495;&#34987;&#35777;&#26126;&#26159;&#28176;&#36817;&#32039;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10504v1 Announce Type: cross  Abstract: We study the statistical resilience of high-dimensional data. Our results provide estimates as to the effects of adversarial noise over the anti-concentration properties of the quadratic Radamecher chaos $\boldsymbol{\xi}^{\mathsf{T}} M \boldsymbol{\xi}$, where $M$ is a fixed (high-dimensional) matrix and $\boldsymbol{\xi}$ is a conformal Rademacher vector. Specifically, we pursue the question of how many adversarial sign-flips can $\boldsymbol{\xi}$ sustain without "inflating" $\sup_{x\in \mathbb{R}} \mathbb{P} \left\{\boldsymbol{\xi}^{\mathsf{T}} M \boldsymbol{\xi} = x\right\}$ and thus "de-smooth" the original distribution resulting in a more "grainy" and adversarially biased distribution. Our results provide lower bound estimations for the statistical resilience of the quadratic and bilinear Rademacher chaos; these are shown to be asymptotically tight across key regimes.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#39118;&#38505;&#25935;&#24863;&#30340;&#24180;&#40836;&#24230;&#37327;&#26368;&#23567;&#21270;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#27010;&#24565;&#21644;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;&#20004;&#31181;&#39118;&#38505;&#25935;&#24863;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2401.10265</link><description>&lt;p&gt;
&#26368;&#20339;&#26356;&#26032;&#26102;&#38388;&#65306;&#22522;&#20110;&#39118;&#38505;&#25935;&#24863;&#30340;&#24180;&#40836;&#24230;&#37327;&#26368;&#23567;&#21270;
&lt;/p&gt;
&lt;p&gt;
The Best Time for an Update: Risk-Sensitive Minimization of Age-Based Metrics. (arXiv:2401.10265v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10265
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#39118;&#38505;&#25935;&#24863;&#30340;&#24180;&#40836;&#24230;&#37327;&#26368;&#23567;&#21270;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#27010;&#24565;&#21644;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;&#20004;&#31181;&#39118;&#38505;&#25935;&#24863;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#34892;&#30340;&#37327;&#21270;&#20256;&#36755;&#25968;&#25454;&#36136;&#37327;&#30340;&#26041;&#27861;&#21253;&#25324;&#20449;&#24687;&#24180;&#40836;&#65288;Age of Information&#65292;AoI&#65289;&#65292;&#26597;&#35810;&#20449;&#24687;&#24180;&#40836;&#65288;Query Age of Information&#65292;QAoI&#65289;&#21644;&#19981;&#27491;&#30830;&#20449;&#24687;&#24180;&#40836;&#65288;Age of Incorrect Information&#65292;AoII&#65289;&#12290;&#25105;&#20204;&#32771;&#34385;&#22312;&#28857;&#23545;&#28857;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#20013;&#20351;&#29992;&#36825;&#20123;&#24230;&#37327;&#65292;&#21457;&#36865;&#26041;&#30417;&#35270;&#19968;&#20010;&#36827;&#31243;&#24182;&#21521;&#25509;&#25910;&#26041;&#21457;&#36865;&#29366;&#24577;&#26356;&#26032;&#12290;&#25105;&#20204;&#30340;&#25361;&#25112;&#26159;&#20915;&#23450;&#26356;&#26032;&#30340;&#26368;&#20339;&#26102;&#38388;&#65292;&#24179;&#34913;&#20256;&#36755;&#33021;&#37327;&#21644;&#25509;&#25910;&#26041;&#30340;&#24180;&#40836;&#24230;&#37327;&#12290;&#30001;&#20110;&#39640;&#24180;&#40836;&#24230;&#37327;&#20540;&#24341;&#36215;&#30340;&#19981;&#31283;&#23450;&#31995;&#32479;&#29366;&#24577;&#31561;&#38382;&#39064;&#30340;&#22266;&#26377;&#39118;&#38505;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#30340;&#27010;&#24565;&#26469;&#34920;&#31034;&#24180;&#40836;&#24230;&#37327;&#39640;&#30340;&#29366;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#20010;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#27010;&#24565;&#26469;&#37327;&#21270;&#21644;&#26368;&#23567;&#21270;&#39640;&#24180;&#40836;&#24230;&#37327;&#30340;&#39118;&#38505;&#65292;&#36890;&#36807;&#30452;&#25509;&#23548;&#20986;&#39118;&#38505;&#29366;&#24577;&#30340;&#39057;&#29575;&#20316;&#20026;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#20004;&#31181;&#38024;&#23545;AoI&#65292;QAoI&#21644;AoII&#30340;&#39118;&#38505;&#25935;&#24863;&#31574;&#30053;&#12290;&#31532;&#19968;&#31181;&#31574;&#30053;&#20351;&#29992;&#31995;&#32479;&#30693;&#35782;&#65292;
&lt;/p&gt;
&lt;p&gt;
Popular methods to quantify transmitted data quality are the Age of Information (AoI), the Query Age of Information (QAoI), and the Age of Incorrect Information (AoII). We consider these metrics in a point-to-point wireless communication system, where the transmitter monitors a process and sends status updates to a receiver. The challenge is to decide on the best time for an update, balancing the transmission energy and the age-based metric at the receiver. Due to the inherent risk of high age-based metric values causing complications such as unstable system states, we introduce the new concept of risky states to denote states with high age-based metric. We use this new notion of risky states to quantify and minimize this risk of experiencing high age-based metrics by directly deriving the frequency of risky states as a novel risk-metric. Building on this foundation, we introduce two risk-sensitive strategies for AoI, QAoI and AoII. The first strategy uses system knowledge, i.e., chann
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;Nystr\"om $M$-Hilbert-Schmidt&#29420;&#31435;&#20934;&#21017;&#65292;&#38024;&#23545;&#22823;&#35268;&#27169;&#24212;&#29992;&#30340;&#20108;&#27425;&#35745;&#31639;&#29942;&#39048;&#38382;&#39064;&#36827;&#34892;&#20102;&#35299;&#20915;&#65292;&#24182;&#20860;&#39038;&#20102;&#22810;&#20010;&#38543;&#26426;&#21464;&#37327;&#30340;&#25512;&#24191;&#24773;&#20917;&#21644;&#29702;&#35770;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2302.09930</link><description>&lt;p&gt;
Nystr\"om $M$-Hilbert-Schmidt&#29420;&#31435;&#20934;&#21017;
&lt;/p&gt;
&lt;p&gt;
Nystr\"om $M$-Hilbert-Schmidt Independence Criterion. (arXiv:2302.09930v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09930
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;Nystr\"om $M$-Hilbert-Schmidt&#29420;&#31435;&#20934;&#21017;&#65292;&#38024;&#23545;&#22823;&#35268;&#27169;&#24212;&#29992;&#30340;&#20108;&#27425;&#35745;&#31639;&#29942;&#39048;&#38382;&#39064;&#36827;&#34892;&#20102;&#35299;&#20915;&#65292;&#24182;&#20860;&#39038;&#20102;&#22810;&#20010;&#38543;&#26426;&#21464;&#37327;&#30340;&#25512;&#24191;&#24773;&#20917;&#21644;&#29702;&#35770;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26680;&#25216;&#26415;&#26159;&#25968;&#25454;&#31185;&#23398;&#20013;&#26368;&#21463;&#27426;&#36814;&#21644;&#24378;&#22823;&#30340;&#26041;&#27861;&#20043;&#19968;&#12290;&#26680;&#30340;&#24191;&#27867;&#24212;&#29992;&#30340;&#20851;&#38190;&#29305;&#24615;&#21253;&#25324;&#65306;(i) &#23427;&#20204;&#38024;&#23545;&#30340;&#39046;&#22495;&#25968;&#37327;&#22810;&#65292;(ii) &#19982;&#26680;&#30456;&#20851;&#30340;&#20989;&#25968;&#31867;&#20855;&#26377;Hilbert&#32467;&#26500;&#65292;&#20415;&#20110;&#32479;&#35745;&#20998;&#26512;&#65292;&#20197;&#21450;(iii) &#23427;&#20204;&#33021;&#22815;&#20197;&#19981;&#20002;&#22833;&#20449;&#24687;&#30340;&#26041;&#24335;&#34920;&#31034;&#27010;&#29575;&#20998;&#24067;&#12290;&#36825;&#20123;&#29305;&#24615;&#23548;&#33268;&#20102;Hilbert-Schmidt&#29420;&#31435;&#20934;&#21017;(HSIC)&#30340;&#24040;&#22823;&#25104;&#21151;&#65292;&#35813;&#20934;&#21017;&#33021;&#22815;&#22312;&#28201;&#21644;&#26465;&#20214;&#19979;&#25429;&#25417;&#38543;&#26426;&#21464;&#37327;&#30340;&#32852;&#21512;&#29420;&#31435;&#24615;&#65292;&#24182;&#20801;&#35768;&#20855;&#26377;&#20108;&#27425;&#35745;&#31639;&#22797;&#26434;&#24615;&#30340;&#38381;&#24335;&#20272;&#35745;&#22120;(&#30456;&#23545;&#20110;&#26679;&#26412;&#22823;&#23567;)&#12290;&#20026;&#20102;&#35299;&#20915;&#22823;&#35268;&#27169;&#24212;&#29992;&#20013;&#30340;&#20108;&#27425;&#35745;&#31639;&#29942;&#39048;&#38382;&#39064;&#65292;&#24050;&#32463;&#25552;&#20986;&#20102;&#22810;&#20010;HSIC&#36817;&#20284;&#20272;&#35745;&#22120;&#65292;&#28982;&#32780;&#36825;&#20123;&#20272;&#35745;&#22120;&#38480;&#21046;&#20110;$M=2$&#20010;&#38543;&#26426;&#21464;&#37327;&#65292;&#19981;&#33021;&#33258;&#28982;&#22320;&#25512;&#24191;&#21040;$M \geq 2$&#30340;&#24773;&#20917;&#65292;&#24182;&#19988;&#32570;&#20047;&#29702;&#35770;&#20445;&#35777;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;Nystr\"om $M$-Hilbert-Schmidt&#29420;&#31435;&#20934;&#21017;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Kernel techniques are among the most popular and powerful approaches of data science. Among the key features that make kernels ubiquitous are (i) the number of domains they have been designed for, (ii) the Hilbert structure of the function class associated to kernels facilitating their statistical analysis, and (iii) their ability to represent probability distributions without loss of information. These properties give rise to the immense success of Hilbert-Schmidt independence criterion (HSIC) which is able to capture joint independence of random variables under mild conditions, and permits closed-form estimators with quadratic computational complexity (w.r.t. the sample size). In order to alleviate the quadratic computational bottleneck in large-scale applications, multiple HSIC approximations have been proposed, however these estimators are restricted to $M=2$ random variables, do not extend naturally to the $M\ge 2$ case, and lack theoretical guarantees. In this work, we propose an
&lt;/p&gt;</description></item></channel></rss>