<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#35813;&#35770;&#25991;&#35777;&#26126;&#20102;&#23545;&#20110;&#20855;&#26377;&#29420;&#31435;&#20110;&#948;&#30340;&#22797;&#26434;&#24230;&#30340;Occam&#31639;&#27861;&#65292;&#20854;&#37096;&#20998;&#36870;&#21629;&#39064;&#36866;&#29992;&#20110;&#38381;&#21512;&#20110;&#20363;&#22806;&#21015;&#34920;&#30340;&#27010;&#24565;&#31867;&#65292;&#20174;&#32780;&#20026;&#30456;&#20851;&#30340;&#29702;&#35770;&#32467;&#26524;&#21644;&#31639;&#27861;&#35774;&#35745;&#26041;&#27861;&#25552;&#20379;&#20102;&#20107;&#21518;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;</title><link>http://arxiv.org/abs/2308.05906</link><description>&lt;p&gt;
&#20851;&#20110;Occam&#31639;&#27861;&#30340;&#31561;&#20215;&#24615;
&lt;/p&gt;
&lt;p&gt;
On the equivalence of Occam algorithms. (arXiv:2308.05906v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.05906
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35777;&#26126;&#20102;&#23545;&#20110;&#20855;&#26377;&#29420;&#31435;&#20110;&#948;&#30340;&#22797;&#26434;&#24230;&#30340;Occam&#31639;&#27861;&#65292;&#20854;&#37096;&#20998;&#36870;&#21629;&#39064;&#36866;&#29992;&#20110;&#38381;&#21512;&#20110;&#20363;&#22806;&#21015;&#34920;&#30340;&#27010;&#24565;&#31867;&#65292;&#20174;&#32780;&#20026;&#30456;&#20851;&#30340;&#29702;&#35770;&#32467;&#26524;&#21644;&#31639;&#27861;&#35774;&#35745;&#26041;&#27861;&#25552;&#20379;&#20102;&#20107;&#21518;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Blumer&#31561;&#20154;&#65288;1987&#24180;&#12289;1989&#24180;&#65289;&#35777;&#26126;&#20102;&#20219;&#20309;&#21487;&#20197;&#30001;Occam&#31639;&#27861;&#23398;&#20064;&#30340;&#27010;&#24565;&#31867;&#37117;&#26159;PAC&#21487;&#23398;&#20064;&#30340;&#12290;Board&#21644;Pitt&#65288;1990&#24180;&#65289;&#35777;&#26126;&#20102;&#36825;&#20010;&#23450;&#29702;&#30340;&#19968;&#20010;&#37096;&#20998;&#36870;&#21629;&#39064;&#65306;&#23545;&#20110;&#38381;&#21512;&#20110;&#20363;&#22806;&#21015;&#34920;&#30340;&#27010;&#24565;&#31867;&#65292;&#20219;&#20309;&#21487;&#20197;PAC&#23398;&#20064;&#30340;&#31867;&#37117;&#21487;&#20197;&#36890;&#36807;Occam&#31639;&#27861;&#23398;&#20064;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;Occam&#31639;&#27861;&#36755;&#20986;&#30340;&#20551;&#35774;&#22797;&#26434;&#24230;&#20381;&#36182;&#20110;&#948;&#65292;&#36825;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#38480;&#21046;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20182;&#20204;&#30340;&#37096;&#20998;&#36870;&#21629;&#39064;&#20063;&#36866;&#29992;&#20110;&#20855;&#26377;&#29420;&#31435;&#20110;&#948;&#30340;&#22797;&#26434;&#24230;&#30340;Occam&#31639;&#27861;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20026;&#20351;&#29992;&#37096;&#20998;&#36870;&#21629;&#39064;&#20316;&#20026;&#20854;&#24037;&#20316;&#22522;&#30784;&#30340;&#21508;&#31181;&#29702;&#35770;&#32467;&#26524;&#21644;&#31639;&#27861;&#35774;&#35745;&#26041;&#27861;&#25552;&#20379;&#20102;&#20107;&#21518;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blumer et al. (1987, 1989) showed that any concept class that is learnable by Occam algorithms is PAC learnable. Board and Pitt (1990) showed a partial converse of this theorem: for concept classes that are closed under exception lists, any class that is PAC learnable is learnable by an Occam algorithm. However, their Occam algorithm outputs a hypothesis whose complexity is $\delta$-dependent, which is an important limitation. In this paper, we show that their partial converse applies to Occam algorithms with $\delta$-independent complexities as well. Thus, we provide a posteriori justification of various theoretical results and algorithm design methods which use the partial converse as a basis for their work.
&lt;/p&gt;</description></item></channel></rss>