<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LiNGAM-MMI&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22686;&#24378;LiNGAM&#27169;&#22411;&#20197;&#22788;&#29702;&#28151;&#28102;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#20351;&#29992;KL&#25955;&#24230;&#37327;&#21270;&#28151;&#28102;&#31243;&#24230;&#65292;&#24182;&#36890;&#36807;&#26368;&#30701;&#36335;&#24452;&#38382;&#39064;&#35299;&#20915;&#26041;&#26696;&#39640;&#25928;&#22320;&#30830;&#23450;&#21464;&#37327;&#39034;&#24207;&#65292;&#19981;&#35770;&#26159;&#21542;&#23384;&#22312;&#28151;&#28102;&#24773;&#20917;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;LiNGAM-MMI&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#35782;&#21035;&#27491;&#30830;&#30340;&#21464;&#37327;&#39034;&#24207;&#12290;</title><link>http://arxiv.org/abs/2401.16661</link><description>&lt;p&gt;
&#20801;&#35768;&#28151;&#28102;&#30340;LiNGAM&#30340;&#27867;&#21270;
&lt;/p&gt;
&lt;p&gt;
Generalization of LiNGAM that allows confounding. (arXiv:2401.16661v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16661
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LiNGAM-MMI&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22686;&#24378;LiNGAM&#27169;&#22411;&#20197;&#22788;&#29702;&#28151;&#28102;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#20351;&#29992;KL&#25955;&#24230;&#37327;&#21270;&#28151;&#28102;&#31243;&#24230;&#65292;&#24182;&#36890;&#36807;&#26368;&#30701;&#36335;&#24452;&#38382;&#39064;&#35299;&#20915;&#26041;&#26696;&#39640;&#25928;&#22320;&#30830;&#23450;&#21464;&#37327;&#39034;&#24207;&#65292;&#19981;&#35770;&#26159;&#21542;&#23384;&#22312;&#28151;&#28102;&#24773;&#20917;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;LiNGAM-MMI&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#35782;&#21035;&#27491;&#30830;&#30340;&#21464;&#37327;&#39034;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
LiNGAM&#20351;&#29992;&#21152;&#24615;&#22122;&#22768;&#27169;&#22411;&#26469;&#30830;&#23450;&#22240;&#26524;&#20851;&#31995;&#30340;&#21464;&#37327;&#39034;&#24207;&#65292;&#20294;&#22312;&#28151;&#28102;&#26041;&#38754;&#38754;&#20020;&#25361;&#25112;&#12290;&#20808;&#21069;&#30340;&#26041;&#27861;&#22312;&#20445;&#25345;LiNGAM&#30340;&#22522;&#26412;&#32467;&#26500;&#30340;&#21516;&#26102;&#65292;&#35797;&#22270;&#35782;&#21035;&#21644;&#22788;&#29702;&#21463;&#28151;&#28102;&#24433;&#21709;&#30340;&#21464;&#37327;&#12290;&#32467;&#26524;&#26159;&#65292;&#19981;&#35770;&#26159;&#21542;&#23384;&#22312;&#28151;&#28102;&#65292;&#36825;&#20123;&#26041;&#27861;&#37117;&#38656;&#35201;&#22823;&#37327;&#30340;&#35745;&#31639;&#36164;&#28304;&#65292;&#24182;&#19988;&#19981;&#33021;&#30830;&#20445;&#26816;&#27979;&#21040;&#25152;&#26377;&#30340;&#28151;&#28102;&#31867;&#22411;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;LiNGAM-MMI&#23545;LiNGAM&#36827;&#34892;&#20102;&#22686;&#24378;&#65292;&#35813;&#26041;&#27861;&#20351;&#29992;KL&#25955;&#24230;&#37327;&#21270;&#28151;&#28102;&#31243;&#24230;&#65292;&#24182;&#23433;&#25490;&#21464;&#37327;&#20197;&#26368;&#23567;&#21270;&#20854;&#24433;&#21709;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#30701;&#36335;&#24452;&#38382;&#39064;&#30340;&#24418;&#24335;&#39640;&#25928;&#22320;&#23454;&#29616;&#20840;&#23616;&#26368;&#20248;&#30340;&#21464;&#37327;&#39034;&#24207;&#12290;&#22312;&#26080;&#28151;&#28102;&#30340;&#24773;&#20917;&#19979;&#65292;LiNGAM-MMI&#30340;&#22788;&#29702;&#25968;&#25454;&#25928;&#29575;&#19982;&#20256;&#32479;LiNGAM&#30456;&#24403;&#65292;&#21516;&#26102;&#26377;&#25928;&#22788;&#29702;&#28151;&#28102;&#24773;&#20917;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;LiNGAM-MMI&#26356;&#20934;&#30830;&#22320;&#30830;&#23450;&#20102;&#27491;&#30830;&#30340;&#21464;&#37327;&#39034;&#24207;...
&lt;/p&gt;
&lt;p&gt;
LiNGAM determines the variable order from cause to effect using additive noise models, but it faces challenges with confounding. Previous methods maintained LiNGAM's fundamental structure while trying to identify and address variables affected by confounding. As a result, these methods required significant computational resources regardless of the presence of confounding, and they did not ensure the detection of all confounding types. In contrast, this paper enhances LiNGAM by introducing LiNGAM-MMI, a method that quantifies the magnitude of confounding using KL divergence and arranges the variables to minimize its impact. This method efficiently achieves a globally optimal variable order through the shortest path problem formulation. LiNGAM-MMI processes data as efficiently as traditional LiNGAM in scenarios without confounding while effectively addressing confounding situations. Our experimental results suggest that LiNGAM-MMI more accurately determines the correct variable order, bo
&lt;/p&gt;</description></item></channel></rss>