<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#20351;&#29992;&#27973;&#23618;&#38543;&#26426;&#37327;&#23376;&#30005;&#36335;&#26469;&#23398;&#20064;&#37327;&#23376;&#24615;&#36136;&#65292;&#25552;&#20986;&#20102;&#20581;&#22766;&#30340;&#27973;&#24433;&#21327;&#35758;&#65292;&#21033;&#29992;&#36125;&#21494;&#26031;&#25512;&#26029;&#26469;&#35299;&#20915;&#37327;&#23376;&#22122;&#22768;&#21644;&#20559;&#24046;&#25361;&#25112;</title><link>https://arxiv.org/abs/2402.17911</link><description>&lt;p&gt;
&#29992;&#27973;&#24433;&#23398;&#20064;&#23637;&#31034;&#20581;&#22766;&#39640;&#25928;&#30340;&#37327;&#23376;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Demonstration of Robust and Efficient Quantum Property Learning with Shallow Shadows
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17911
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#27973;&#23618;&#38543;&#26426;&#37327;&#23376;&#30005;&#36335;&#26469;&#23398;&#20064;&#37327;&#23376;&#24615;&#36136;&#65292;&#25552;&#20986;&#20102;&#20581;&#22766;&#30340;&#27973;&#24433;&#21327;&#35758;&#65292;&#21033;&#29992;&#36125;&#21494;&#26031;&#25512;&#26029;&#26469;&#35299;&#20915;&#37327;&#23376;&#22122;&#22768;&#21644;&#20559;&#24046;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#37327;&#23376;&#31995;&#32479;&#20013;&#39640;&#25928;&#25552;&#21462;&#20449;&#24687;&#26159;&#37327;&#23376;&#20449;&#24687;&#22788;&#29702;&#20219;&#21153;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#12290;&#38543;&#26426;&#21270;&#27979;&#37327;&#65292;&#25110;&#31216;&#32463;&#20856;&#38452;&#24433;&#65292;&#33021;&#22815;&#20351;&#29992;&#23569;&#37327;&#27979;&#37327;&#26469;&#39044;&#27979;&#20219;&#24847;&#37327;&#23376;&#24577;&#30340;&#35768;&#22810;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17911v1 Announce Type: cross  Abstract: Extracting information efficiently from quantum systems is a major component of quantum information processing tasks. Randomized measurements, or classical shadows, enable predicting many properties of arbitrary quantum states using few measurements. While random single qubit measurements are experimentally friendly and suitable for learning low-weight Pauli observables, they perform poorly for nonlocal observables. Prepending a shallow random quantum circuit before measurements maintains this experimental friendliness, but also has favorable sample complexities for observables beyond low-weight Paulis, including high-weight Paulis and global low-rank properties such as fidelity. However, in realistic scenarios, quantum noise accumulated with each additional layer of the shallow circuit biases the results. To address these challenges, we propose the robust shallow shadows protocol. Our protocol uses Bayesian inference to learn the expe
&lt;/p&gt;</description></item></channel></rss>