<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#29369;&#35947;&#27169;&#31946;&#38598;&#30340;&#22810;&#31181;&#21253;&#21547;&#20851;&#31995;&#23450;&#20041;&#12289;&#29369;&#35947;&#27169;&#31946;&#20449;&#24687;&#31995;&#32479;&#30340;&#22522;&#30784;&#21629;&#39064;&#21644;&#22522;&#20110;&#22810;&#24378;&#24230;&#26234;&#33021;&#20998;&#31867;&#22120;&#30340;&#20581;&#24247;&#29366;&#24577;&#35786;&#26029;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2311.04256</link><description>&lt;p&gt;
&#29369;&#35947;&#27169;&#31946;&#38598;&#21450;&#20854;&#24212;&#29992;&#20110;&#22810;&#24378;&#24230;&#26234;&#33021;&#20998;&#31867;&#22120;&#30340;&#22522;&#30784;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Foundational theories of hesitant fuzzy sets and hesitant fuzzy information systems and their applications for multi-strength intelligent classifiers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.04256
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#29369;&#35947;&#27169;&#31946;&#38598;&#30340;&#22810;&#31181;&#21253;&#21547;&#20851;&#31995;&#23450;&#20041;&#12289;&#29369;&#35947;&#27169;&#31946;&#20449;&#24687;&#31995;&#32479;&#30340;&#22522;&#30784;&#21629;&#39064;&#21644;&#22522;&#20110;&#22810;&#24378;&#24230;&#26234;&#33021;&#20998;&#31867;&#22120;&#30340;&#20581;&#24247;&#29366;&#24577;&#35786;&#26029;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29369;&#35947;&#27169;&#31946;&#38598;&#22312;&#26576;&#20123;&#19981;&#30830;&#23450;&#21644;&#29369;&#35947;&#30340;&#24773;&#20917;&#19979;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#22312;&#38598;&#21512;&#20013;&#65292;&#21253;&#21547;&#20851;&#31995;&#26159;&#19968;&#20010;&#37325;&#35201;&#19988;&#22522;&#30784;&#30340;&#23450;&#20041;&#12290;&#22240;&#27492;&#65292;&#20316;&#20026;&#19968;&#31181;&#38598;&#21512;&#65292;&#29369;&#35947;&#27169;&#31946;&#38598;&#38656;&#35201;&#19968;&#20010;&#26126;&#30830;&#30340;&#21253;&#21547;&#20851;&#31995;&#23450;&#20041;&#12290;&#22522;&#20110;&#31163;&#25955;&#24418;&#24335;&#30340;&#29369;&#35947;&#27169;&#31946;&#38582;&#23646;&#24230;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#20960;&#31181;&#36866;&#29992;&#20110;&#29369;&#35947;&#27169;&#31946;&#38598;&#30340;&#21253;&#21547;&#20851;&#31995;&#12290;&#38543;&#21518;&#65292;&#20171;&#32461;&#20102;&#19968;&#20123;&#29369;&#35947;&#27169;&#31946;&#38598;&#30340;&#22522;&#30784;&#21629;&#39064;&#65292;&#20197;&#21450;&#29369;&#35947;&#27169;&#31946;&#38598;&#26063;&#30340;&#21629;&#39064;&#12290;&#38024;&#23545;&#21442;&#25968;&#20943;&#23569;&#65292;&#25552;&#20986;&#20102;&#29369;&#35947;&#27169;&#31946;&#20449;&#24687;&#31995;&#32479;&#30340;&#19968;&#20123;&#22522;&#30784;&#21629;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#19968;&#20010;&#31034;&#20363;&#21644;&#31639;&#27861;&#26469;&#35828;&#26126;&#21442;&#25968;&#20943;&#23569;&#30340;&#36807;&#31243;&#12290;&#26368;&#21518;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#24378;&#24230;&#26234;&#33021;&#20998;&#31867;&#22120;&#65292;&#29992;&#20110;&#23545;&#22797;&#26434;&#31995;&#32479;&#36827;&#34892;&#20581;&#24247;&#29366;&#24577;&#35786;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.04256v3 Announce Type: replace  Abstract: Hesitant fuzzy sets are widely used in certain instances of uncertainty and hesitation. In sets, the inclusion relationship is an important and foundational definition. Thus, as a kind of set, hesitant fuzzy sets require an explicit definition of inclusion relationship. Based on the hesitant fuzzy membership degree of discrete form, several kinds of inclusion relationships for hesitant fuzzy sets are proposed in this work. Then, some foundational propositions of hesitant fuzzy sets are presented, along with propositions of families of hesitant fuzzy sets. Some foundational propositions of hesitant fuzzy information systems are proposed with respect to parameter reductions and an example and an algorithm are given to illustrate the processes of parameter reduction. Finally, a multi-strength intelligent classifier is proposed to make health state diagnoses for complex systems.
&lt;/p&gt;</description></item></channel></rss>