<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#26080;&#32447;&#31995;&#32479;&#30340;DGD&#31639;&#27861;&#65292;&#36890;&#36807;&#26080;&#30456;&#24178;&#31354;&#20013;&#20849;&#35782;&#26041;&#26696;&#23454;&#29616;&#26080;&#38656;&#26234;&#33021;&#20307;&#21327;&#35843;&#12289;&#25299;&#25169;&#20449;&#24687;&#25110;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#12290;</title><link>https://arxiv.org/abs/2211.10777</link><description>&lt;p&gt;
&#26080;&#30456;&#24178;&#31354;&#20013;&#20998;&#24067;&#24335;&#26799;&#24230;&#19979;&#38477;
&lt;/p&gt;
&lt;p&gt;
Non-Coherent Over-the-Air Decentralized Gradient Descent
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2211.10777
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#26080;&#32447;&#31995;&#32479;&#30340;DGD&#31639;&#27861;&#65292;&#36890;&#36807;&#26080;&#30456;&#24178;&#31354;&#20013;&#20849;&#35782;&#26041;&#26696;&#23454;&#29616;&#26080;&#38656;&#26234;&#33021;&#20307;&#21327;&#35843;&#12289;&#25299;&#25169;&#20449;&#24687;&#25110;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#24067;&#24335;&#26799;&#24230;&#19979;&#38477;&#65288;DGD&#65289;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#35832;&#22914;&#36828;&#31243;&#24863;&#30693;&#12289;&#20998;&#24067;&#24335;&#25512;&#26029;&#12289;&#22810;&#26234;&#33021;&#20307;&#21327;&#35843;&#21644;&#32852;&#37030;&#23398;&#20064;&#31561;&#21508;&#31181;&#39046;&#22495;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#22312;&#21463;&#21040;&#22122;&#22768;&#12289;&#34928;&#33853;&#21644;&#24102;&#23485;&#21463;&#38480;&#30340;&#26080;&#32447;&#31995;&#32479;&#19978;&#25191;&#34892;DGD&#20250;&#24102;&#26469;&#25361;&#25112;&#65292;&#38656;&#35201;&#35843;&#24230;&#20256;&#36755;&#20197;&#20943;&#36731;&#24178;&#25200;&#65292;&#24182;&#33719;&#21462;&#25299;&#25169;&#21644;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#65292;&#36825;&#22312;&#26080;&#32447;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#26159;&#22797;&#26434;&#30340;&#20219;&#21153;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19987;&#20026;&#26080;&#32447;&#31995;&#32479;&#23450;&#21046;&#30340;DGD&#31639;&#27861;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#19981;&#21516;&#65292;&#23427;&#22312;&#26080;&#38656;&#36827;&#34892;&#26234;&#33021;&#20307;&#21327;&#35843;&#12289;&#25299;&#25169;&#20449;&#24687;&#25110;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#36816;&#34892;&#12290;&#20854;&#26680;&#24515;&#26159;&#19968;&#31181;&#26080;&#30456;&#24178;&#31354;&#20013;&#65288;NCOTA&#65289;&#20849;&#35782;&#26041;&#26696;&#65292;&#21033;&#29992;&#20102;&#26080;&#32447;&#20449;&#36947;&#30340;&#22122;&#22768;&#33021;&#37327;&#21472;&#21152;&#29305;&#24615;&#12290;&#36890;&#36807;&#38543;&#26426;&#21270;&#20256;&#36755;&#31574;&#30053;&#26469;&#36866;&#24212;&#21322;&#21452;&#24037;&#25805;&#20316;&#65292;&#21457;&#23556;&#26426;&#23558;&#20301;&#32622;&#26144;&#23556;&#21040;
&lt;/p&gt;
&lt;p&gt;
arXiv:2211.10777v2 Announce Type: replace-cross  Abstract: Decentralized Gradient Descent (DGD) is a popular algorithm used to solve decentralized optimization problems in diverse domains such as remote sensing, distributed inference, multi-agent coordination, and federated learning. Yet, executing DGD over wireless systems affected by noise, fading and limited bandwidth presents challenges, requiring scheduling of transmissions to mitigate interference and the acquisition of topology and channel state information -- complex tasks in wireless decentralized systems. This paper proposes a DGD algorithm tailored to wireless systems. Unlike existing approaches, it operates without inter-agent coordination, topology information, or channel state information. Its core is a Non-Coherent Over-The-Air (NCOTA) consensus scheme, exploiting a noisy energy superposition property of wireless channels. With a randomized transmission strategy to accommodate half-duplex operation, transmitters map loca
&lt;/p&gt;</description></item></channel></rss>