<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26522;&#20030;&#30340;&#21487;&#21387;&#32553;&#24615;&#23545;&#20110;&#35745;&#31639;&#21487;&#26522;&#20030;&#38598;&#21512;&#30340;&#30456;&#23545;Kolmogorov&#22797;&#26434;&#24230;&#30340;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#20219;&#20309;&#35745;&#31639;&#21487;&#26522;&#20030;&#38598;&#21512;&#37117;&#21487;&#20197;&#36827;&#34892;&#24378;&#21387;&#32553;&#21644;&#26080;&#22686;&#30410;&#24369;&#21387;&#32553;&#12290;</title><link>http://arxiv.org/abs/2304.03030</link><description>&lt;p&gt;
&#26522;&#20030;&#21387;&#32553;&#19982;&#22686;&#30410;
&lt;/p&gt;
&lt;p&gt;
Compression of enumerations and gain. (arXiv:2304.03030v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03030
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26522;&#20030;&#30340;&#21487;&#21387;&#32553;&#24615;&#23545;&#20110;&#35745;&#31639;&#21487;&#26522;&#20030;&#38598;&#21512;&#30340;&#30456;&#23545;Kolmogorov&#22797;&#26434;&#24230;&#30340;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#20219;&#20309;&#35745;&#31639;&#21487;&#26522;&#20030;&#38598;&#21512;&#37117;&#21487;&#20197;&#36827;&#34892;&#24378;&#21387;&#32553;&#21644;&#26080;&#22686;&#30410;&#24369;&#21387;&#32553;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#26522;&#20030;&#30340;&#21487;&#21387;&#32553;&#24615;&#65292;&#20197;&#21450;&#20854;&#22312;&#35745;&#31639;&#21487;&#26522;&#20030;&#38598;&#21512;&#30340;&#30456;&#23545;Kolmogorov&#22797;&#26434;&#24230;&#20013;&#23494;&#24230;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;&#25105;&#20204;&#20851;&#27880;&#20102;&#24378;&#21387;&#32553;&#21644;&#24369;&#21387;&#32553;&#65292;&#20197;&#21450;&#21387;&#32553;&#26522;&#20030;&#20013;&#23884;&#20837;&#30340;&#38468;&#21152;&#20449;&#24687;&#30340;&#25968;&#37327;&#65306;&#22686;&#30410;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20219;&#20309;&#35745;&#31639;&#21487;&#26522;&#20030;&#38598;&#21512;&#37117;&#21487;&#20197;&#36827;&#34892;&#24378;&#21387;&#32553;&#21644;&#26080;&#22686;&#30410;&#24369;&#21387;&#32553;&#65292;&#24182;&#30740;&#31350;&#20102;&#20301;&#32622;&#28216;&#25103;&#20197;&#29702;&#35299;&#24378;&#26080;&#22686;&#30410;&#21387;&#32553;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the compressibility of enumerations, and its role in the relative Kolmogorov complexity of computably enumerable sets, with respect to density. With respect to a strong and a weak form of compression, we examine the gain: the amount of auxiliary information embedded in the compressed enumeration. Strong compression and weak gainless compression is shown for any computably enumerable set, and a positional game is studied toward understanding strong gainless compression.
&lt;/p&gt;</description></item></channel></rss>