<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#36890;&#36807;&#20248;&#21270;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#31616;&#21270;&#30340;&#21327;&#35758;&#65292;&#29992;&#20110;&#36870;&#36716;&#26410;&#30693;&#37327;&#23376;&#27604;&#29305;&#37193;&#25805;&#20316;&#65292;&#23558;&#36741;&#21161;&#27604;&#29305;&#24320;&#38144;&#20943;&#23569;&#21040;3&#65292;&#26174;&#31034;&#20102;&#37327;&#23376;&#26803;&#32467;&#26500;&#30340;&#23454;&#29992;&#24615;&#21644;PQComb&#22312;&#35299;&#20915;&#22797;&#26434;&#37327;&#23376;&#20219;&#21153;&#20013;&#30340;&#28508;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.03761</link><description>&lt;p&gt;
&#21442;&#25968;&#21270;&#37327;&#23376;&#26803;&#21644;&#31616;&#21270;&#30005;&#36335;&#29992;&#20110;&#36870;&#36716;&#26410;&#30693;&#37327;&#23376;&#27604;&#29305;-&#37193;&#25805;&#20316;
&lt;/p&gt;
&lt;p&gt;
Parameterized quantum comb and simpler circuits for reversing unknown qubit-unitary operations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03761
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20248;&#21270;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#31616;&#21270;&#30340;&#21327;&#35758;&#65292;&#29992;&#20110;&#36870;&#36716;&#26410;&#30693;&#37327;&#23376;&#27604;&#29305;&#37193;&#25805;&#20316;&#65292;&#23558;&#36741;&#21161;&#27604;&#29305;&#24320;&#38144;&#20943;&#23569;&#21040;3&#65292;&#26174;&#31034;&#20102;&#37327;&#23376;&#26803;&#32467;&#26500;&#30340;&#23454;&#29992;&#24615;&#21644;PQComb&#22312;&#35299;&#20915;&#22797;&#26434;&#37327;&#23376;&#20219;&#21153;&#20013;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Quantum comb&#26159;&#37327;&#23376;&#20449;&#24687;&#22788;&#29702;&#20013;&#34920;&#24449;&#22797;&#26434;&#37327;&#23376;&#21327;&#35758;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;PQComb&#65292;&#19968;&#20010;&#21033;&#29992;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#25506;&#32034;&#37327;&#23376;&#26803;&#22312;&#19968;&#33324;&#37327;&#23376;&#36807;&#31243;&#36716;&#25442;&#20219;&#21153;&#21450;&#20854;&#20182;&#26041;&#38754;&#33021;&#21147;&#30340;&#26694;&#26550;&#12290;&#36890;&#36807;&#20248;&#21270;PQComb&#36827;&#34892;&#26410;&#30693;&#37193;&#28436;&#21270;&#30340;&#26102;&#38388;&#21453;&#28446;&#27169;&#25311;&#65292;&#25105;&#20204;&#24320;&#21457;&#20986;&#20102;&#19968;&#31181;&#26356;&#31616;&#21333;&#30340;&#26410;&#30693;&#37327;&#23376;&#27604;&#29305;&#37193;&#21453;&#28436;&#21327;&#35758;&#65292;&#23558;&#27604;&#29616;&#26377;&#26041;&#27861;[Yoshida, Soeda, Murao, PRL 131, 120602, 2023]&#30340;&#36741;&#21161;&#27604;&#29305;&#24320;&#38144;&#20174;6&#20943;&#23569;&#21040;3&#12290;&#36825;&#23637;&#31034;&#20102;&#37327;&#23376;&#26803;&#32467;&#26500;&#30340;&#23454;&#29992;&#24615;&#65292;&#23637;&#31034;&#20102;PQComb&#22312;&#35299;&#20915;&#22797;&#26434;&#37327;&#23376;&#20219;&#21153;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#20026;PQComb&#22312;&#37327;&#23376;&#35745;&#31639;&#21644;&#37327;&#23376;&#20449;&#24687;&#20013;&#26356;&#24191;&#27867;&#30340;&#24212;&#29992;&#38138;&#24179;&#20102;&#36947;&#36335;&#65292;&#24378;&#35843;&#20102;&#23427;&#22312;&#35299;&#20915;&#37327;&#23376;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#22810;&#26679;&#38382;&#39064;&#26102;&#30340;&#22810;&#21151;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03761v1 Announce Type: cross  Abstract: Quantum comb is an essential tool for characterizing complex quantum protocols in quantum information processing. In this work, we introduce PQComb, a framework leveraging parameterized quantum circuits to explore the capabilities of quantum combs for general quantum process transformation tasks and beyond. By optimizing PQComb for time-reversal simulations of unknown unitary evolutions, we develop a simpler protocol for unknown qubit unitary inversion that reduces the ancilla qubit overhead from 6 to 3 compared to the existing method in [Yoshida, Soeda, Murao, PRL 131, 120602, 2023]. This demonstrates the utility of quantum comb structures and showcases PQComb's potential for solving complex quantum tasks. Our results pave the way for broader PQComb applications in quantum computing and quantum information, emphasizing its versatility for tackling diverse problems in quantum machine learning.
&lt;/p&gt;</description></item></channel></rss>