<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#20174;&#25968;&#25454;&#12289;&#26234;&#33021;&#21644;&#32593;&#32476;&#30340;&#35282;&#24230;&#26469;&#23454;&#29616;6G&#21407;&#29983;AI&#30340;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;6G&#21407;&#29983;AI&#26694;&#26550;&#65292;&#21253;&#25324;&#33258;&#23450;&#20041;&#26041;&#27861;&#21644;&#20219;&#21153;&#23548;&#21521;&#30340;AI&#24037;&#20855;&#21253;&#65292;&#20197;&#21450;&#26032;&#30340;&#20113;&#36793;&#32536;&#21327;&#21516;&#21512;&#20316;&#33539;&#24335;&#12290;</title><link>http://arxiv.org/abs/2310.17471</link><description>&lt;p&gt;
&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;6G&#21407;&#29983;AI&#26694;&#26550;&#19982;&#20113;&#36793;&#32536;&#21327;&#21516;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Foundation Model Based Native AI Framework in 6G with Cloud-Edge-End Collaboration. (arXiv:2310.17471v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17471
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#20174;&#25968;&#25454;&#12289;&#26234;&#33021;&#21644;&#32593;&#32476;&#30340;&#35282;&#24230;&#26469;&#23454;&#29616;6G&#21407;&#29983;AI&#30340;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;6G&#21407;&#29983;AI&#26694;&#26550;&#65292;&#21253;&#25324;&#33258;&#23450;&#20041;&#26041;&#27861;&#21644;&#20219;&#21153;&#23548;&#21521;&#30340;AI&#24037;&#20855;&#21253;&#65292;&#20197;&#21450;&#26032;&#30340;&#20113;&#36793;&#32536;&#21327;&#21516;&#21512;&#20316;&#33539;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26410;&#26469;&#30340;&#26080;&#32447;&#36890;&#20449;&#32593;&#32476;&#26377;&#26395;&#36229;&#36234;&#20197;&#25968;&#25454;&#20026;&#20013;&#24515;&#12289;&#20197;&#35774;&#22791;&#20026;&#23548;&#21521;&#30340;&#36830;&#25509;&#26041;&#24335;&#65292;&#25552;&#20379;&#22522;&#20110;&#20219;&#21153;&#23548;&#21521;&#36830;&#25509;&#30340;&#26234;&#33021;&#27785;&#28024;&#24335;&#20307;&#39564;&#65292;&#29305;&#21035;&#26159;&#22312;&#39044;&#35757;&#32451;&#22522;&#30784;&#27169;&#22411;&#65288;PFM&#65289;&#30340;&#24555;&#36895;&#21457;&#23637;&#21644;6G&#21407;&#29983;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30340;&#21457;&#23637;&#24895;&#26223;&#19979;&#12290;&#22240;&#27492;&#65292;&#22312;6G&#20013;&#65292;&#37325;&#26032;&#23450;&#20041;&#35774;&#22791;&#21644;&#26381;&#21153;&#22120;&#20043;&#38388;&#30340;&#21327;&#20316;&#27169;&#24335;&#65292;&#26500;&#24314;&#21407;&#29983;&#26234;&#33021;&#24211;&#21464;&#24471;&#38750;&#24120;&#37325;&#35201;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20174;&#25968;&#25454;&#12289;&#26234;&#33021;&#21644;&#32593;&#32476;&#30340;&#35282;&#24230;&#20998;&#26512;&#20102;&#23454;&#29616;6G&#21407;&#29983;AI&#30340;&#25361;&#25112;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#25552;&#20986;&#20102;&#19968;&#20010;6G&#21407;&#29983;AI&#26694;&#26550;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#24847;&#22270;&#24863;&#30693;PFM&#30340;&#23450;&#21046;&#26041;&#27861;&#65292;&#23637;&#31034;&#20102;&#19968;&#20010;&#38754;&#21521;&#20219;&#21153;&#30340;AI&#24037;&#20855;&#21253;&#30340;&#26500;&#24314;&#65292;&#24182;&#27010;&#36848;&#20102;&#19968;&#31181;&#20840;&#26032;&#30340;&#20113;&#36793;&#32536;&#21327;&#21516;&#21512;&#20316;&#33539;&#24335;&#12290;&#20316;&#20026;&#19968;&#20010;&#23454;&#38469;&#30340;&#20351;&#29992;&#26696;&#20363;&#65292;&#25105;&#20204;&#23558;&#35813;&#26694;&#26550;&#24212;&#29992;&#20110;&#32534;&#25490;&#65292;&#23454;&#29616;&#20102;&#26080;&#32447;&#36890;&#20449;&#20013;&#30340;&#26368;&#22823;&#36895;&#29575;&#20043;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;
Future wireless communication networks are in a position to move beyond data-centric, device-oriented connectivity and offer intelligent, immersive experiences based on task-oriented connections, especially in the context of the thriving development of pre-trained foundation models (PFM) and the evolving vision of 6G native artificial intelligence (AI). Therefore, redefining modes of collaboration between devices and servers and constructing native intelligence libraries become critically important in 6G. In this paper, we analyze the challenges of achieving 6G native AI from the perspectives of data, intelligence, and networks. Then, we propose a 6G native AI framework based on foundation models, provide a customization approach for intent-aware PFM, present a construction of a task-oriented AI toolkit, and outline a novel cloud-edge-end collaboration paradigm. As a practical use case, we apply this framework for orchestration, achieving the maximum sum rate within a wireless communic
&lt;/p&gt;</description></item></channel></rss>