<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#26080;&#32447;&#31995;&#32479;&#30340;DGD&#31639;&#27861;&#65292;&#36890;&#36807;&#26080;&#30456;&#24178;&#31354;&#20013;&#20849;&#35782;&#26041;&#26696;&#23454;&#29616;&#26080;&#38656;&#26234;&#33021;&#20307;&#21327;&#35843;&#12289;&#25299;&#25169;&#20449;&#24687;&#25110;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#12290;</title><link>https://arxiv.org/abs/2211.10777</link><description>&lt;p&gt;
&#26080;&#30456;&#24178;&#31354;&#20013;&#20998;&#24067;&#24335;&#26799;&#24230;&#19979;&#38477;
&lt;/p&gt;
&lt;p&gt;
Non-Coherent Over-the-Air Decentralized Gradient Descent
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2211.10777
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#26080;&#32447;&#31995;&#32479;&#30340;DGD&#31639;&#27861;&#65292;&#36890;&#36807;&#26080;&#30456;&#24178;&#31354;&#20013;&#20849;&#35782;&#26041;&#26696;&#23454;&#29616;&#26080;&#38656;&#26234;&#33021;&#20307;&#21327;&#35843;&#12289;&#25299;&#25169;&#20449;&#24687;&#25110;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#24067;&#24335;&#26799;&#24230;&#19979;&#38477;&#65288;DGD&#65289;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#35832;&#22914;&#36828;&#31243;&#24863;&#30693;&#12289;&#20998;&#24067;&#24335;&#25512;&#26029;&#12289;&#22810;&#26234;&#33021;&#20307;&#21327;&#35843;&#21644;&#32852;&#37030;&#23398;&#20064;&#31561;&#21508;&#31181;&#39046;&#22495;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#22312;&#21463;&#21040;&#22122;&#22768;&#12289;&#34928;&#33853;&#21644;&#24102;&#23485;&#21463;&#38480;&#30340;&#26080;&#32447;&#31995;&#32479;&#19978;&#25191;&#34892;DGD&#20250;&#24102;&#26469;&#25361;&#25112;&#65292;&#38656;&#35201;&#35843;&#24230;&#20256;&#36755;&#20197;&#20943;&#36731;&#24178;&#25200;&#65292;&#24182;&#33719;&#21462;&#25299;&#25169;&#21644;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#65292;&#36825;&#22312;&#26080;&#32447;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#26159;&#22797;&#26434;&#30340;&#20219;&#21153;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19987;&#20026;&#26080;&#32447;&#31995;&#32479;&#23450;&#21046;&#30340;DGD&#31639;&#27861;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#19981;&#21516;&#65292;&#23427;&#22312;&#26080;&#38656;&#36827;&#34892;&#26234;&#33021;&#20307;&#21327;&#35843;&#12289;&#25299;&#25169;&#20449;&#24687;&#25110;&#20449;&#36947;&#29366;&#24577;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#36816;&#34892;&#12290;&#20854;&#26680;&#24515;&#26159;&#19968;&#31181;&#26080;&#30456;&#24178;&#31354;&#20013;&#65288;NCOTA&#65289;&#20849;&#35782;&#26041;&#26696;&#65292;&#21033;&#29992;&#20102;&#26080;&#32447;&#20449;&#36947;&#30340;&#22122;&#22768;&#33021;&#37327;&#21472;&#21152;&#29305;&#24615;&#12290;&#36890;&#36807;&#38543;&#26426;&#21270;&#20256;&#36755;&#31574;&#30053;&#26469;&#36866;&#24212;&#21322;&#21452;&#24037;&#25805;&#20316;&#65292;&#21457;&#23556;&#26426;&#23558;&#20301;&#32622;&#26144;&#23556;&#21040;
&lt;/p&gt;
&lt;p&gt;
arXiv:2211.10777v2 Announce Type: replace-cross  Abstract: Decentralized Gradient Descent (DGD) is a popular algorithm used to solve decentralized optimization problems in diverse domains such as remote sensing, distributed inference, multi-agent coordination, and federated learning. Yet, executing DGD over wireless systems affected by noise, fading and limited bandwidth presents challenges, requiring scheduling of transmissions to mitigate interference and the acquisition of topology and channel state information -- complex tasks in wireless decentralized systems. This paper proposes a DGD algorithm tailored to wireless systems. Unlike existing approaches, it operates without inter-agent coordination, topology information, or channel state information. Its core is a Non-Coherent Over-The-Air (NCOTA) consensus scheme, exploiting a noisy energy superposition property of wireless channels. With a randomized transmission strategy to accommodate half-duplex operation, transmitters map loca
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;FedGT&#26694;&#26550;&#65292;&#36890;&#36807;&#32676;&#20307;&#27979;&#35797;&#30340;&#26041;&#27861;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35782;&#21035;&#24182;&#21024;&#38500;&#24694;&#24847;&#23458;&#25143;&#65292;&#20174;&#32780;&#24179;&#34913;&#20102;&#38544;&#31169;&#21644;&#23433;&#20840;&#65292;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#24182;&#25552;&#39640;&#20102;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2305.05506</link><description>&lt;p&gt;
&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#24179;&#34913;&#38544;&#31169;&#19982;&#23433;&#20840;&#65306;FedGT&#30340;&#32676;&#20307;&#27979;&#35797;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Balancing Privacy and Security in Federated Learning with FedGT: A Group Testing Framework. (arXiv:2305.05506v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05506
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;FedGT&#26694;&#26550;&#65292;&#36890;&#36807;&#32676;&#20307;&#27979;&#35797;&#30340;&#26041;&#27861;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35782;&#21035;&#24182;&#21024;&#38500;&#24694;&#24847;&#23458;&#25143;&#65292;&#20174;&#32780;&#24179;&#34913;&#20102;&#38544;&#31169;&#21644;&#23433;&#20840;&#65292;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#24182;&#25552;&#39640;&#20102;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;FedGT&#65292;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#32852;&#37030;&#23398;&#20064;&#20013;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#24182;&#36827;&#34892;&#23433;&#20840;&#32858;&#21512;&#12290;&#21463;&#21040;&#32676;&#20307;&#27979;&#35797;&#30340;&#21551;&#21457;&#65292;&#35813;&#26694;&#26550;&#21033;&#29992;&#37325;&#21472;&#30340;&#23458;&#25143;&#32452;&#26469;&#26816;&#27979;&#24694;&#24847;&#23458;&#25143;&#30340;&#23384;&#22312;&#65292;&#24182;&#36890;&#36807;&#35793;&#30721;&#25805;&#20316;&#35782;&#21035;&#23427;&#20204;&#12290;&#28982;&#21518;&#65292;&#23558;&#36825;&#20123;&#34987;&#35782;&#21035;&#30340;&#23458;&#25143;&#20174;&#27169;&#22411;&#30340;&#35757;&#32451;&#20013;&#21024;&#38500;&#65292;&#24182;&#22312;&#20854;&#20313;&#23458;&#25143;&#20043;&#38388;&#25191;&#34892;&#35757;&#32451;&#12290;FedGT&#22312;&#38544;&#31169;&#21644;&#23433;&#20840;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#65292;&#20801;&#35768;&#25913;&#36827;&#35782;&#21035;&#33021;&#21147;&#21516;&#26102;&#20173;&#20445;&#25252;&#25968;&#25454;&#38544;&#31169;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#26381;&#21153;&#22120;&#23398;&#20064;&#27599;&#20010;&#32452;&#20013;&#23458;&#25143;&#30340;&#32858;&#21512;&#27169;&#22411;&#12290;&#36890;&#36807;&#23545;MNIST&#21644;CIFAR-10&#25968;&#25454;&#38598;&#36827;&#34892;&#22823;&#37327;&#23454;&#39564;&#65292;&#35777;&#26126;&#20102;FedGT&#30340;&#26377;&#25928;&#24615;&#65292;&#23637;&#31034;&#20102;&#20854;&#35782;&#21035;&#24694;&#24847;&#23458;&#25143;&#30340;&#33021;&#21147;&#65292;&#20855;&#26377;&#20302;&#35823;&#26816;&#21644;&#34394;&#35686;&#27010;&#29575;&#65292;&#20135;&#29983;&#39640;&#27169;&#22411;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose FedGT, a novel framework for identifying malicious clients in federated learning with secure aggregation. Inspired by group testing, the framework leverages overlapping groups of clients to detect the presence of malicious clients in the groups and to identify them via a decoding operation. The identified clients are then removed from the training of the model, which is performed over the remaining clients. FedGT strikes a balance between privacy and security, allowing for improved identification capabilities while still preserving data privacy. Specifically, the server learns the aggregated model of the clients in each group. The effectiveness of FedGT is demonstrated through extensive experiments on the MNIST and CIFAR-10 datasets, showing its ability to identify malicious clients with low misdetection and false alarm probabilities, resulting in high model utility.
&lt;/p&gt;</description></item></channel></rss>