<rss version="2.0"><channel><title>Chat Arxiv cs.IT</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IT</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#26041;&#27861;&#21407;&#21017;&#30340;&#36890;&#29992;&#21333;&#21464;&#37327;&#20449;&#21495;&#21435;&#21367;&#31215;&#26041;&#27861;&#12290;&#36890;&#36807;&#35745;&#31639;&#8220;&#36890;&#29992;&#20998;&#24067;&#8221;&#30340;&#20272;&#35745;&#26469;&#29420;&#31435;&#20110;&#27010;&#29575;&#20998;&#24067;&#22320;&#26500;&#24314;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#65292;&#24182;&#22522;&#20110;&#20449;&#24687;&#35770;&#21644;&#31639;&#27861;&#27010;&#29575;&#30340;&#22810;&#32500;&#31354;&#38388;&#37325;&#26500;&#65292;&#25506;&#32034;&#38750;&#38543;&#26426;&#25968;&#25454;&#20013;&#20851;&#20110;&#29289;&#29702;&#24615;&#36136;&#30340;&#20449;&#24687;&#32534;&#30721;&#12290;&#35813;&#26041;&#27861;&#22312;&#32534;&#30721;&#29702;&#35770;&#23588;&#20854;&#26159;&#38646;&#22833;&#30495;&#21387;&#32553;&#26041;&#38754;&#26377;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2303.16045</link><description>&lt;p&gt;
&#22823;&#35268;&#27169;&#29983;&#25104;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#31354;&#38388;&#21435;&#21367;&#31215;&#21644;&#20449;&#24687;&#37325;&#24314;
&lt;/p&gt;
&lt;p&gt;
Optimal Spatial Deconvolution and Message Reconstruction from a Large Generative Model of Models. (arXiv:2303.16045v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16045
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#26041;&#27861;&#21407;&#21017;&#30340;&#36890;&#29992;&#21333;&#21464;&#37327;&#20449;&#21495;&#21435;&#21367;&#31215;&#26041;&#27861;&#12290;&#36890;&#36807;&#35745;&#31639;&#8220;&#36890;&#29992;&#20998;&#24067;&#8221;&#30340;&#20272;&#35745;&#26469;&#29420;&#31435;&#20110;&#27010;&#29575;&#20998;&#24067;&#22320;&#26500;&#24314;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#65292;&#24182;&#22522;&#20110;&#20449;&#24687;&#35770;&#21644;&#31639;&#27861;&#27010;&#29575;&#30340;&#22810;&#32500;&#31354;&#38388;&#37325;&#26500;&#65292;&#25506;&#32034;&#38750;&#38543;&#26426;&#25968;&#25454;&#20013;&#20851;&#20110;&#29289;&#29702;&#24615;&#36136;&#30340;&#20449;&#24687;&#32534;&#30721;&#12290;&#35813;&#26041;&#27861;&#22312;&#32534;&#30721;&#29702;&#35770;&#23588;&#20854;&#26159;&#38646;&#22833;&#30495;&#21387;&#32553;&#26041;&#38754;&#26377;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#26041;&#27861;&#21407;&#21017;&#30340;&#36890;&#29992;&#21333;&#21464;&#37327;&#20449;&#21495;&#21435;&#21367;&#31215;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#24314;&#31435;&#20102;&#19968;&#20010;&#27169;&#22411;&#29983;&#25104;&#27169;&#22411;&#65292;&#20381;&#36182;&#20110;&#20449;&#24687;&#35770;&#21644;&#31639;&#27861;&#27010;&#29575;&#65292;&#24182;&#35745;&#31639;&#20986;&#8220;&#36890;&#29992;&#20998;&#24067;&#8221;&#30340;&#20272;&#35745;&#65292;&#20174;&#32780;&#29420;&#31435;&#20110;&#27010;&#29575;&#20998;&#24067;&#22320;&#26500;&#24314;&#20102;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#20449;&#24687;&#35770;&#21644;&#31639;&#27861;&#27010;&#29575;&#30340;&#22810;&#32500;&#31354;&#38388;&#37325;&#26500;&#65292;&#21487;&#20197;&#25506;&#31350;&#38750;&#38543;&#26426;&#25968;&#25454;&#22914;&#20309;&#32534;&#30721;&#20851;&#20110;&#29289;&#29702;&#24615;&#36136;&#30340;&#20449;&#24687;&#65292;&#20363;&#22914;&#20449;&#21495;&#25110;&#20449;&#24687;&#30340;&#32500;&#24230;&#21644;&#38271;&#24230;&#23610;&#24230;&#12290;&#35813;&#26041;&#27861;&#26159;&#19982;&#21487;&#35745;&#31639;&#25110;&#21322;&#21487;&#35745;&#31639;&#30340;&#36817;&#20284;&#26041;&#27861;&#25110;&#32534;&#30721;-&#35299;&#30721;&#26041;&#26696;&#30456;&#20851;&#20294;&#19981;&#29420;&#31435;&#30340;&#12290;&#26412;&#25991;&#30340;&#32467;&#26524;&#23545;&#32534;&#30721;&#29702;&#35770;&#23588;&#20854;&#26159;&#38646;&#22833;&#30495;&#21387;&#32553;&#26377;&#24212;&#29992;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a general-purpose univariate signal deconvolution method based on the principles of an approach to Artificial General Intelligence. This approach is based on a generative model that combines information theory and algorithmic probability that required a large calculation of an estimation of a `universal distribution' to build a general-purpose model of models independent of probability distributions. This was used to investigate how non-random data may encode information about the physical properties such as dimension and length scales in which a signal or message may have been originally encoded, embedded, or generated. This multidimensional space reconstruction method is based on information theory and algorithmic probability, and it is agnostic, but not independent, with respect to the chosen computable or semi-computable approximation method or encoding-decoding scheme. The results presented in this paper are useful for applications in coding theory, particularly in ze
&lt;/p&gt;</description></item></channel></rss>