<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19968;&#33324;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#30340;&#26368;&#23567;&#32852;&#30431;&#36923;&#36753;&#65292;&#19981;&#20855;&#22791;&#20256;&#32479;&#27169;&#22411;&#20013;&#30340;&#29420;&#31435;&#24615;&#12289;&#24207;&#21015;&#24615;&#21644;&#30830;&#23450;&#24615;&#20551;&#35774;&#65292;&#23637;&#31034;&#20102;&#20854;&#23436;&#22791;&#24615;&#24182;&#19982;&#20256;&#32479;&#27169;&#22411;&#36827;&#34892;&#20102;&#27604;&#36739;</title><link>https://arxiv.org/abs/2403.14704</link><description>&lt;p&gt;
&#19968;&#20010;&#26368;&#23567;&#32852;&#30431;&#36923;&#36753;
&lt;/p&gt;
&lt;p&gt;
A minimal coalition logic
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14704
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19968;&#33324;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#30340;&#26368;&#23567;&#32852;&#30431;&#36923;&#36753;&#65292;&#19981;&#20855;&#22791;&#20256;&#32479;&#27169;&#22411;&#20013;&#30340;&#29420;&#31435;&#24615;&#12289;&#24207;&#21015;&#24615;&#21644;&#30830;&#23450;&#24615;&#20551;&#35774;&#65292;&#23637;&#31034;&#20102;&#20854;&#23436;&#22791;&#24615;&#24182;&#19982;&#20256;&#32479;&#27169;&#22411;&#36827;&#34892;&#20102;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#30431;&#36923;&#36753;&#26159;&#25112;&#30053;&#25512;&#29702;&#30740;&#31350;&#20013;&#30340;&#19968;&#20010;&#20013;&#24515;&#36923;&#36753;&#12290;&#26412;&#25991;&#39318;&#20808;&#25351;&#20986;&#32852;&#30431;&#36923;&#36753;&#27169;&#22411;&#65292;&#21363;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#65292;&#23384;&#22312;&#19977;&#20010;&#36807;&#20110;&#24378;&#30340;&#20551;&#35774;&#12290;&#20854;&#19968;&#26159;&#20195;&#29702;&#30340;&#29420;&#31435;&#24615;&#65307;&#21363;&#65292;&#20004;&#20010;&#19981;&#21516;&#32852;&#30431;&#30340;&#20004;&#20010;&#21487;&#29992;&#32852;&#21512;&#21160;&#20316;&#30340;&#21512;&#24182;&#24635;&#26159;&#21487;&#20197;&#21512;&#24182;&#25104;&#20004;&#20010;&#32852;&#30431;&#30340;&#32852;&#30431;&#12290;&#20854;&#20108;&#26159;&#24207;&#21015;&#24615;&#65307;&#21363;&#65292;&#32852;&#30431;&#24635;&#26159;&#26377;&#21487;&#29992;&#30340;&#32852;&#21512;&#21160;&#20316;&#12290;&#20854;&#19977;&#26159;&#30830;&#23450;&#24615;&#65292;&#21363;&#65292;&#22823;&#32852;&#30431;&#30340;&#21512;&#20316;&#21160;&#20316;&#24635;&#26159;&#26377;&#21807;&#19968;&#32467;&#26524;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19968;&#33324;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#30340;&#32852;&#30431;&#36923;&#36753;&#65292;&#35813;&#27169;&#22411;&#19981;&#20855;&#22791;&#36825;&#19977;&#20010;&#20551;&#35774;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#19968;&#36923;&#36753;&#30340;&#23436;&#22791;&#24615;&#65292;&#24182;&#19982;&#32852;&#30431;&#36923;&#36753;&#36827;&#34892;&#20102;&#35814;&#32454;&#27604;&#36739;&#12290;&#22312;&#25112;&#30053;&#25512;&#29702;&#30340;&#32972;&#26223;&#19979;&#65292;&#36825;&#19968;&#36923;&#36753;&#20284;&#20046;&#26159;&#26368;&#23567;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14704v1 Announce Type: cross  Abstract: Coalition logic is a central logic in strategic reasoning studies. In this paper, we first argue that Coalition Logic models, concurrent game models, have three too-strong assumptions. The first one is the independence of agents; that is, the merge of two available joint actions of two disjoint coalitions is always available for the union of the two coalitions. The second one is seriality; that is, coalitions always have available joint actions. The third one is determinism, that is, the grand coalition's joint actions always have a unique outcome. Second, we present a coalition logic based on general concurrent game models, which do not have the three assumptions. We show the completeness of this logic and compare it with Coalition Logic in detail. This logic seems minimal in the context of strategic reasoning.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#35299;&#20915;&#20102;&#20855;&#26377;&#20840;&#23616;&#32422;&#26463;&#30340;&#19981;&#19968;&#33268;&#25968;&#25454;&#24211;&#30340;&#20462;&#22797;&#21644;&#26597;&#35810;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#31216;&#24046;&#20998;&#20462;&#22797;&#24182;&#25351;&#23450;&#39318;&#36873;&#20462;&#22797;&#34892;&#21160;&#65292;&#25193;&#23637;&#20102;&#29616;&#26377;&#30340;&#26368;&#20248;&#20462;&#22797;&#27010;&#24565;&#65292;&#24182;&#19988;&#30740;&#31350;&#20102;&#20462;&#22797;&#27010;&#24565;&#30340;&#35745;&#31639;&#23646;&#24615;&#65292;&#21516;&#26102;&#28548;&#28165;&#20102;&#19982;&#20027;&#21160;&#23436;&#25972;&#24615;&#32422;&#26463;&#26694;&#26550;&#20013;&#24341;&#20837;&#30340;&#20462;&#22797;&#27010;&#24565;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2306.03523</link><description>&lt;p&gt;
&#20855;&#26377;&#20840;&#23616;&#32422;&#26463;&#30340;&#20248;&#20808;&#25968;&#25454;&#24211;&#20013;&#30340;&#19981;&#19968;&#33268;&#24615;&#22788;&#29702;&#65306;&#22797;&#26434;&#24230;&#20998;&#26512;&#21644;&#19982;&#20027;&#21160;&#23436;&#25972;&#24615;&#32422;&#26463;&#30340;&#32852;&#31995;(arXiv:2306.03523v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
Inconsistency Handling in Prioritized Databases with Universal Constraints: Complexity Analysis and Links with Active Integrity Constraints. (arXiv:2306.03523v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03523
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#35299;&#20915;&#20102;&#20855;&#26377;&#20840;&#23616;&#32422;&#26463;&#30340;&#19981;&#19968;&#33268;&#25968;&#25454;&#24211;&#30340;&#20462;&#22797;&#21644;&#26597;&#35810;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#31216;&#24046;&#20998;&#20462;&#22797;&#24182;&#25351;&#23450;&#39318;&#36873;&#20462;&#22797;&#34892;&#21160;&#65292;&#25193;&#23637;&#20102;&#29616;&#26377;&#30340;&#26368;&#20248;&#20462;&#22797;&#27010;&#24565;&#65292;&#24182;&#19988;&#30740;&#31350;&#20102;&#20462;&#22797;&#27010;&#24565;&#30340;&#35745;&#31639;&#23646;&#24615;&#65292;&#21516;&#26102;&#28548;&#28165;&#20102;&#19982;&#20027;&#21160;&#23436;&#25972;&#24615;&#32422;&#26463;&#26694;&#26550;&#20013;&#24341;&#20837;&#30340;&#20462;&#22797;&#27010;&#24565;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#24102;&#26377;&#20840;&#23616;&#32422;&#26463;&#30340;&#19981;&#19968;&#33268;&#25968;&#25454;&#24211;&#30340;&#20462;&#22797;&#21644;&#26597;&#35810;&#38382;&#39064;&#12290;&#37319;&#29992;&#23545;&#31216;&#24046;&#20998;&#20462;&#22797;&#65292;&#21363;&#36890;&#36807;&#21024;&#38500;&#21644;&#28155;&#21152;&#20107;&#23454;&#26469;&#24674;&#22797;&#19968;&#33268;&#24615;&#65292;&#24182;&#20551;&#35774;&#36890;&#36807;&#23545;&#65288;&#21542;&#23450;&#65289;&#20107;&#23454;&#30340;&#20108;&#20803;&#20248;&#20808;&#20851;&#31995;&#26469;&#25351;&#23450;&#39318;&#36873;&#20462;&#22797;&#34892;&#21160;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#36129;&#29486;&#26159;&#23637;&#31034;&#22914;&#20309;&#36866;&#24403;&#22320;&#23558;&#29616;&#26377;&#30340;&#26368;&#20248;&#20462;&#22797;&#27010;&#24565;&#65288;&#20165;&#23545;&#22522;&#20110;&#20107;&#23454;&#21024;&#38500;&#30340;&#31616;&#21333;&#25298;&#32477;&#32422;&#26463;&#21644;&#20462;&#22797;&#23450;&#20041;&#65289;&#25193;&#23637;&#21040;&#25105;&#20204;&#26356;&#20016;&#23500;&#30340;&#35774;&#32622;&#20013;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#25152;&#24471;&#21040;&#30340;&#20462;&#22797;&#27010;&#24565;&#30340;&#35745;&#31639;&#23646;&#24615;&#65292;&#29305;&#21035;&#26159;&#20462;&#22797;&#26816;&#26597;&#21644;&#23481;&#24525;&#19981;&#19968;&#33268;&#26597;&#35810;&#30340;&#25968;&#25454;&#22797;&#26434;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#28548;&#28165;&#20102;&#20248;&#20808;&#25968;&#25454;&#24211;&#30340;&#26368;&#20248;&#20462;&#22797;&#19982;&#22312;&#20027;&#21160;&#23436;&#25972;&#24615;&#32422;&#26463;&#26694;&#26550;&#20013;&#24341;&#20837;&#30340;&#20462;&#22797;&#27010;&#24565;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#34920;&#26126;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#20462;&#22797;&#23545;&#24212;&#20110; founded&#12289;grounded &#21644; just&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper revisits the problem of repairing and querying inconsistent databases equipped with universal constraints. We adopt symmetric difference repairs, in which both deletions and additions of facts can be used to restore consistency, and suppose that preferred repair actions are specified via a binary priority relation over (negated) facts. Our first contribution is to show how existing notions of optimal repairs, defined for simpler denial constraints and repairs solely based on fact deletion, can be suitably extended to our richer setting. We next study the computational properties of the resulting repair notions, in particular, the data complexity of repair checking and inconsistency-tolerant query answering. Finally, we clarify the relationship between optimal repairs of prioritized databases and repair notions introduced in the framework of active integrity constraints. In particular, we show that Pareto-optimal repairs in our setting correspond to founded, grounded and just
&lt;/p&gt;</description></item></channel></rss>