<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#30740;&#31350;&#20998;&#26512;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#22312;&#24067;&#23572;&#30005;&#36335;&#22797;&#26434;&#24615;&#21644;&#25551;&#36848;&#24615;&#22797;&#26434;&#24615;&#26041;&#38754;&#30340;&#33021;&#21147;&#65292;&#35777;&#26126;&#20102;&#22810;&#39033;&#24335;&#35268;&#27169;&#26377;&#30028;&#28145;&#24230;&#30340;GNN&#26063;&#26063;&#21487;&#20197;&#35745;&#31639;&#30340;&#22270;&#26597;&#35810;&#27491;&#26159;&#24102;&#35745;&#25968;&#21644;&#20869;&#32622;&#20851;&#31995;&#30340;&#19968;&#38454;&#36923;&#36753;&#21463;&#20445;&#25252;&#30340;&#29255;&#26029;GFO+C&#25152;&#23450;&#20041;&#30340;&#65292;&#36825;&#23558;GNN&#25918;&#22312;&#30005;&#36335;&#22797;&#26434;&#24615;&#31867;TC^0&#20013;&#12290;</title><link>http://arxiv.org/abs/2303.04613</link><description>&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#25551;&#36848;&#24615;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Descriptive Complexity of Graph Neural Networks. (arXiv:2303.04613v2 [cs.LO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.04613
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20998;&#26512;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#22312;&#24067;&#23572;&#30005;&#36335;&#22797;&#26434;&#24615;&#21644;&#25551;&#36848;&#24615;&#22797;&#26434;&#24615;&#26041;&#38754;&#30340;&#33021;&#21147;&#65292;&#35777;&#26126;&#20102;&#22810;&#39033;&#24335;&#35268;&#27169;&#26377;&#30028;&#28145;&#24230;&#30340;GNN&#26063;&#26063;&#21487;&#20197;&#35745;&#31639;&#30340;&#22270;&#26597;&#35810;&#27491;&#26159;&#24102;&#35745;&#25968;&#21644;&#20869;&#32622;&#20851;&#31995;&#30340;&#19968;&#38454;&#36923;&#36753;&#21463;&#20445;&#25252;&#30340;&#29255;&#26029;GFO+C&#25152;&#23450;&#20041;&#30340;&#65292;&#36825;&#23558;GNN&#25918;&#22312;&#30005;&#36335;&#22797;&#26434;&#24615;&#31867;TC^0&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#30340;&#24067;&#23572;&#30005;&#36335;&#22797;&#26434;&#24615;&#21644;&#25551;&#36848;&#24615;&#22797;&#26434;&#24615;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22810;&#39033;&#24335;&#35268;&#27169;&#26377;&#30028;&#28145;&#24230;&#30340;GNN&#26063;&#26063;&#21487;&#20197;&#35745;&#31639;&#30340;&#22270;&#26597;&#35810;&#27491;&#26159;&#37027;&#20123;&#29992;&#24102;&#35745;&#25968;&#21644;&#20869;&#32622;&#20851;&#31995;&#30340;&#19968;&#38454;&#36923;&#36753;&#21463;&#20445;&#25252;&#30340;&#29255;&#26029;GFO+C&#23450;&#20041;&#30340;&#12290;&#36825;&#23558;GNN&#25918;&#22312;&#30005;&#36335;&#22797;&#26434;&#24615;&#31867;TC^0&#20013;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;GNN&#23478;&#26063;&#21487;&#20197;&#20351;&#29992;&#20219;&#24847;&#23454;&#25968;&#26435;&#20540;&#21644;&#21253;&#25324;&#26631;&#20934;ReLU&#12289;Logistic&#8220;sigmod&#8221;&#21644;&#21452;&#26354;&#27491;&#20999;&#20989;&#25968;&#22312;&#20869;&#30340;&#24191;&#27867;&#28608;&#27963;&#20989;&#25968;&#31867;&#12290;&#22914;&#26524;GNN&#34987;&#20801;&#35768;&#20351;&#29992;&#38543;&#26426;&#21021;&#22987;&#21270;&#21644;&#20840;&#23616;&#35835;&#21462;&#65288;&#36825;&#20123;&#37117;&#26159;GNN&#22312;&#23454;&#36341;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#26631;&#20934;&#21151;&#33021;&#65289;&#65292;&#23427;&#20204;&#21487;&#20197;&#35745;&#31639;&#19982;&#38408;&#38376;&#30340;&#26377;&#30028;&#28145;&#24230;&#24067;&#23572;&#30005;&#36335;&#23436;&#20840;&#30456;&#21516;&#30340;&#26597;&#35810;&#65292;&#21363;&#22312;TC^0&#20013;&#30340;&#26597;&#35810;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#24102;&#20998;&#27573;&#32447;&#24615;&#28608;&#27963;&#21644;&#26377;&#29702;&#26435;&#37325;&#30340;&#21333;&#20010;GNN&#21487;&#20197;&#22312;&#19981;&#24314;&#36896;&#20869;&#37096;&#20851;&#31995;&#30340;&#24773;&#20917;&#19979;&#30001;GFO+C&#23450;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyse the power of graph neural networks (GNNs) in terms of Boolean circuit complexity and descriptive complexity.  We prove that the graph queries that can be computed by a polynomial-size bounded-depth family of GNNs are exactly those definable in the guarded fragment GFO+C of first-order logic with counting and with built-in relations. This puts GNNs in the circuit complexity class TC^0. Remarkably, the GNN families may use arbitrary real weights and a wide class of activation functions that includes the standard ReLU, logistic "sigmod", and hyperbolic tangent functions. If the GNNs are allowed to use random initialisation and global readout (both standard features of GNNs widely used in practice), they can compute exactly the same queries as bounded depth Boolean circuits with threshold gates, that is, exactly the queries in TC^0.  Moreover, we show that queries computable by a single GNN with piecewise linear activations and rational weights are definable in GFO+C without bui
&lt;/p&gt;</description></item></channel></rss>