<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Vampire&#23450;&#29702;&#35777;&#26126;&#22120;&#20013;&#20351;&#29992;&#34584;&#34523;&#24335;&#31995;&#32479;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#26500;&#24314;&#24378;&#22823;&#26085;&#31243;&#34920;&#30340;&#38590;&#26131;&#31243;&#24230;&#20197;&#21450;&#26085;&#31243;&#27867;&#21270;&#21040;&#26410;&#30693;&#38382;&#39064;&#30340;&#24433;&#21709;&#22240;&#32032;&#12290;</title><link>https://arxiv.org/abs/2403.12869</link><description>&lt;p&gt;
&#34584;&#34523;&#24335;&#31574;&#30053;&#21457;&#29616;&#21644;&#26085;&#31243;&#26500;&#24314;&#20013;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Regularization in Spider-Style Strategy Discovery and Schedule Construction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12869
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Vampire&#23450;&#29702;&#35777;&#26126;&#22120;&#20013;&#20351;&#29992;&#34584;&#34523;&#24335;&#31995;&#32479;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#26500;&#24314;&#24378;&#22823;&#26085;&#31243;&#34920;&#30340;&#38590;&#26131;&#31243;&#24230;&#20197;&#21450;&#26085;&#31243;&#27867;&#21270;&#21040;&#26410;&#30693;&#38382;&#39064;&#30340;&#24433;&#21709;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#36798;&#21040;&#26368;&#20339;&#24615;&#33021;&#65292;&#33258;&#21160;&#23450;&#29702;&#35777;&#26126;&#22120;&#36890;&#24120;&#20381;&#36182;&#20110;&#22810;&#26679;&#30340;&#35777;&#26126;&#31574;&#30053;&#26085;&#31243;&#34920;&#65292;&#22312;&#32473;&#23450;&#38382;&#39064;&#19978;&#23581;&#35797;&#65288;&#39034;&#24207;&#25110;&#24182;&#34892;&#65289;&#12290;&#26412;&#25991;&#25253;&#21578;&#20102;&#19968;&#39033;&#38024;&#23545;Vampire&#23450;&#29702;&#35777;&#26126;&#22120;&#30340;&#31574;&#30053;&#21457;&#29616;&#30340;&#22823;&#35268;&#27169;&#23454;&#39564;&#65292;&#38024;&#23545;TPTP&#24211;&#30340;FOF&#29255;&#27573;&#24182;&#26500;&#24314;&#19968;&#20010;&#22522;&#20110;Andrei Voronkov&#30340;Spider&#31995;&#32479;&#24605;&#24819;&#30340;&#26085;&#31243;&#34920;&#12290;&#25105;&#20204;&#20174;&#21508;&#20010;&#35282;&#24230;&#23457;&#35270;&#35813;&#36807;&#31243;&#65292;&#35752;&#35770;&#20102;&#20026;CASC&#31454;&#36187;&#33719;&#24471;&#24378;&#22823;&#30340;Vampire&#26085;&#31243;&#34920;&#30340;&#38590;&#26131;&#31243;&#24230;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#20010;&#26085;&#31243;&#34920;&#33021;&#22815;&#23545;&#26410;&#30693;&#38382;&#39064;&#27867;&#21270;&#21040;&#20309;&#31181;&#31243;&#24230;&#20197;&#21450;&#24433;&#21709;&#27492;&#23646;&#24615;&#30340;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12869v1 Announce Type: new  Abstract: To achieve the best performance, automatic theorem provers often rely on schedules of diverse proving strategies to be tried out (either sequentially or in parallel) on a given problem. In this paper, we report on a large-scale experiment with discovering strategies for the Vampire prover, targeting the FOF fragment of the TPTP library and constructing a schedule for it, based on the ideas of Andrei Voronkov's system Spider. We examine the process from various angles, discuss the difficulty (or ease) of obtaining a strong Vampire schedule for the CASC competition, and establish how well a schedule can be expected to generalize to unseen problems and what factors influence this property.
&lt;/p&gt;</description></item></channel></rss>