<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>LOCALINTEL&#26159;&#19968;&#20010;&#33258;&#21160;&#21270;&#30340;&#30693;&#35782;&#19978;&#19979;&#25991;&#21270;&#31995;&#32479;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#33021;&#21147;&#65292;&#20174;&#20840;&#29699;&#21644;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#20013;&#33258;&#21160;&#29983;&#25104;&#32452;&#32455;&#30340;&#23041;&#32961;&#24773;&#25253;&#12290;</title><link>http://arxiv.org/abs/2401.10036</link><description>&lt;p&gt;
LOCALINTEL&#65306;&#20174;&#20840;&#29699;&#21644;&#26412;&#22320;&#32593;&#32476;&#30693;&#35782;&#29983;&#25104;&#32452;&#32455;&#23041;&#32961;&#24773;&#25253;
&lt;/p&gt;
&lt;p&gt;
LOCALINTEL: Generating Organizational Threat Intelligence from Global and Local Cyber Knowledge. (arXiv:2401.10036v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10036
&lt;/p&gt;
&lt;p&gt;
LOCALINTEL&#26159;&#19968;&#20010;&#33258;&#21160;&#21270;&#30340;&#30693;&#35782;&#19978;&#19979;&#25991;&#21270;&#31995;&#32479;&#65292;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#33021;&#21147;&#65292;&#20174;&#20840;&#29699;&#21644;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#20013;&#33258;&#21160;&#29983;&#25104;&#32452;&#32455;&#30340;&#23041;&#32961;&#24773;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23433;&#20840;&#25805;&#20316;&#20013;&#24515;&#65288;SoC&#65289;&#20998;&#26512;&#24072;&#20174;&#20844;&#24320;&#35775;&#38382;&#30340;&#20840;&#29699;&#23041;&#32961;&#25968;&#25454;&#24211;&#20013;&#25910;&#38598;&#23041;&#32961;&#25253;&#21578;&#65292;&#24182;&#25163;&#21160;&#33258;&#23450;&#20041;&#20197;&#36866;&#24212;&#29305;&#23450;&#32452;&#32455;&#30340;&#38656;&#27714;&#12290;&#36825;&#20123;&#20998;&#26512;&#24072;&#36824;&#20381;&#36182;&#20110;&#20869;&#37096;&#23384;&#20648;&#24211;&#65292;&#20316;&#20026;&#32452;&#32455;&#30340;&#31169;&#26377;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#12290;&#21487;&#20449;&#30340;&#32593;&#32476;&#24773;&#25253;&#12289;&#20851;&#38190;&#25805;&#20316;&#32454;&#33410;&#21644;&#30456;&#20851;&#32452;&#32455;&#20449;&#24687;&#37117;&#23384;&#20648;&#22312;&#36825;&#20123;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#20013;&#12290;&#20998;&#26512;&#24072;&#21033;&#29992;&#36825;&#20123;&#20840;&#29699;&#21644;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#20174;&#20107;&#19968;&#39033;&#32321;&#37325;&#30340;&#20219;&#21153;&#65292;&#25163;&#21160;&#21019;&#24314;&#32452;&#32455;&#29420;&#29305;&#30340;&#23041;&#32961;&#21709;&#24212;&#21644;&#32531;&#35299;&#31574;&#30053;&#12290;&#26368;&#36817;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#24050;&#32463;&#23637;&#31034;&#20102;&#39640;&#25928;&#22788;&#29702;&#22823;&#35268;&#27169;&#22810;&#26679;&#21270;&#30693;&#35782;&#28304;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#21033;&#29992;&#36825;&#31181;&#33021;&#21147;&#26469;&#22788;&#29702;&#20840;&#29699;&#21644;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#65292;&#33258;&#21160;&#21270;&#29983;&#25104;&#32452;&#32455;&#29305;&#23450;&#30340;&#23041;&#32961;&#24773;&#25253;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;LOCALINTEL&#65292;&#36825;&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#33258;&#21160;&#21270;&#30693;&#35782;&#19978;&#19979;&#25991;&#21270;&#31995;&#32479;&#65292;&#21487;&#20197;&#20174;&#20840;&#29699;&#21644;&#26412;&#22320;&#30693;&#35782;&#25968;&#25454;&#24211;&#20013;&#29983;&#25104;&#32452;&#32455;&#30340;&#23041;&#32961;&#24773;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;
Security Operations Center (SoC) analysts gather threat reports from openly accessible global threat databases and customize them manually to suit a particular organization's needs. These analysts also depend on internal repositories, which act as private local knowledge database for an organization. Credible cyber intelligence, critical operational details, and relevant organizational information are all stored in these local knowledge databases. Analysts undertake a labor intensive task utilizing these global and local knowledge databases to manually create organization's unique threat response and mitigation strategies. Recently, Large Language Models (LLMs) have shown the capability to efficiently process large diverse knowledge sources. We leverage this ability to process global and local knowledge databases to automate the generation of organization-specific threat intelligence.  In this work, we present LOCALINTEL, a novel automated knowledge contextualization system that, upon 
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#25551;&#36848;&#36923;&#36753;&#20013;&#20351;&#29992;&#21322;&#29615;&#28335;&#28304;&#30340;&#26694;&#26550;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36731;&#37327;&#32423;&#25551;&#36848;&#36923;&#36753;&#30340;&#28335;&#28304;&#35821;&#20041;&#12290;&#35770;&#25991;&#35777;&#26126;&#20102;&#22312;&#21322;&#29615;&#26045;&#21152;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#35821;&#20041;&#28385;&#36275;&#19968;&#20123;&#37325;&#35201;&#30340;&#29305;&#24615;&#65292;&#24182;&#23545;why&#28335;&#28304;&#26041;&#27861;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2310.16472</link><description>&lt;p&gt;
&#36866;&#29992;&#20110;&#36731;&#37327;&#32423;&#25551;&#36848;&#36923;&#36753;&#30340;&#21322;&#29615;&#28335;&#28304;
&lt;/p&gt;
&lt;p&gt;
Semiring Provenance for Lightweight Description Logics. (arXiv:2310.16472v1 [cs.LO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16472
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#25551;&#36848;&#36923;&#36753;&#20013;&#20351;&#29992;&#21322;&#29615;&#28335;&#28304;&#30340;&#26694;&#26550;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36731;&#37327;&#32423;&#25551;&#36848;&#36923;&#36753;&#30340;&#28335;&#28304;&#35821;&#20041;&#12290;&#35770;&#25991;&#35777;&#26126;&#20102;&#22312;&#21322;&#29615;&#26045;&#21152;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#35821;&#20041;&#28385;&#36275;&#19968;&#20123;&#37325;&#35201;&#30340;&#29305;&#24615;&#65292;&#24182;&#23545;why&#28335;&#28304;&#26041;&#27861;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#21322;&#29615;&#28335;&#28304;&#8212;&#8212;&#19968;&#31181;&#26368;&#21021;&#22312;&#20851;&#31995;&#25968;&#25454;&#24211;&#29615;&#22659;&#20013;&#23450;&#20041;&#30340;&#25104;&#21151;&#26694;&#26550;&#65292;&#29992;&#20110;&#25551;&#36848;&#36923;&#36753;&#12290;&#22312;&#27492;&#19978;&#19979;&#25991;&#20013;&#65292;&#26412;&#20307;&#20844;&#29702;&#34987;&#29992;&#20132;&#25442;&#21322;&#29615;&#30340;&#20803;&#32032;&#36827;&#34892;&#27880;&#37322;&#65292;&#24182;&#19988;&#36825;&#20123;&#27880;&#37322;&#26681;&#25454;&#23427;&#20204;&#30340;&#25512;&#23548;&#26041;&#24335;&#20256;&#25773;&#21040;&#26412;&#20307;&#30340;&#32467;&#26524;&#20013;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#28335;&#28304;&#35821;&#20041;&#65292;&#36866;&#29992;&#20110;&#21253;&#25324;&#20960;&#31181;&#36731;&#37327;&#32423;&#25551;&#36848;&#36923;&#36753;&#30340;&#35821;&#35328;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#19982;&#20026;&#24102;&#26377;&#29305;&#23450;&#31867;&#22411;&#27880;&#37322;&#65288;&#22914;&#27169;&#31946;&#24230;&#65289;&#30340;&#26412;&#20307;&#23450;&#20041;&#30340;&#20854;&#20182;&#35821;&#20041;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#23545;&#21322;&#29615;&#26045;&#21152;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#35821;&#20041;&#28385;&#36275;&#19968;&#20123;&#26399;&#26395;&#30340;&#29305;&#24615;&#65288;&#22914;&#25193;&#23637;&#20102;&#25968;&#25454;&#24211;&#20013;&#23450;&#20041;&#30340;&#21322;&#29615;&#28335;&#28304;&#65289;&#12290;&#28982;&#21518;&#25105;&#20204;&#19987;&#27880;&#20110;&#33879;&#21517;&#30340;why&#28335;&#28304;&#26041;&#27861;&#65292;&#23427;&#20801;&#35768;&#35745;&#31639;&#27599;&#20010;&#21152;&#27861;&#24130;&#31561;&#21644;&#20056;&#27861;&#24130;&#31561;&#30340;&#20132;&#25442;&#21322;&#29615;&#30340;&#21322;&#29615;&#28335;&#28304;&#65292;&#24182;&#30740;&#31350;&#20102;&#19982;&#36825;&#31181;&#28335;&#28304;&#26041;&#27861;&#30456;&#20851;&#30340;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate semiring provenance--a successful framework originally defined in the relational database setting--for description logics. In this context, the ontology axioms are annotated with elements of a commutative semiring and these annotations are propagated to the ontology consequences in a way that reflects how they are derived. We define a provenance semantics for a language that encompasses several lightweight description logics and show its relationships with semantics that have been defined for ontologies annotated with a specific kind of annotation (such as fuzzy degrees). We show that under some restrictions on the semiring, the semantics satisfies desirable properties (such as extending the semiring provenance defined for databases). We then focus on the well-known why-provenance, which allows to compute the semiring provenance for every additively and multiplicatively idempotent commutative semiring, and for which we study the complexity of problems related to the prov
&lt;/p&gt;</description></item></channel></rss>