<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#30740;&#31350;&#34920;&#26126;&#65292;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#36755;&#20986;&#23558;&#28176;&#36817;&#20110;&#19968;&#20010;&#24120;&#25968;&#20989;&#25968;&#65292;&#24182;&#38480;&#21046;&#20102;&#36825;&#20123;&#20998;&#31867;&#22120;&#30340;&#32479;&#19968;&#34920;&#36798;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.03880</link><description>&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#36755;&#20986;&#20960;&#20046;&#32943;&#23450;&#26159;&#28176;&#36817;&#24120;&#25968;
&lt;/p&gt;
&lt;p&gt;
Graph neural network outputs are almost surely asymptotically constant
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03880
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#34920;&#26126;&#65292;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#36755;&#20986;&#23558;&#28176;&#36817;&#20110;&#19968;&#20010;&#24120;&#25968;&#20989;&#25968;&#65292;&#24182;&#38480;&#21046;&#20102;&#36825;&#20123;&#20998;&#31867;&#22120;&#30340;&#32479;&#19968;&#34920;&#36798;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#26159;&#21508;&#31181;&#22270;&#23398;&#20064;&#20219;&#21153;&#20013;&#20027;&#35201;&#30340;&#26550;&#26500;&#12290;&#25105;&#20204;&#36890;&#36807;&#30740;&#31350;GNN&#30340;&#27010;&#29575;&#20998;&#31867;&#22120;&#22312;&#20174;&#26576;&#20010;&#38543;&#26426;&#22270;&#27169;&#22411;&#20013;&#32472;&#21046;&#30340;&#26356;&#22823;&#22270;&#19978;&#24212;&#29992;&#26102;&#39044;&#27979;&#22914;&#20309;&#28436;&#21464;&#65292;&#25552;&#20986;&#20102;GNN&#34920;&#36798;&#33021;&#21147;&#30340;&#26032;&#35282;&#24230;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36755;&#20986;&#25910;&#25947;&#21040;&#19968;&#20010;&#24120;&#25968;&#20989;&#25968;&#65292;&#36825;&#20010;&#20989;&#25968;&#19978;&#38480;&#20102;&#36825;&#20123;&#20998;&#31867;&#22120;&#21487;&#20197;&#32479;&#19968;&#34920;&#36798;&#30340;&#20869;&#23481;&#12290;&#36825;&#31181;&#25910;&#25947;&#29616;&#35937;&#36866;&#29992;&#20110;&#38750;&#24120;&#24191;&#27867;&#30340;GNN&#31867;&#21035;&#65292;&#21253;&#25324;&#20808;&#36827;&#27169;&#22411;&#65292;&#20854;&#20013;&#30340;&#32858;&#21512;&#21253;&#25324;&#24179;&#22343;&#20540;&#21644;&#22522;&#20110;&#27880;&#24847;&#21147;&#30340;&#22270;&#36716;&#25442;&#22120;&#26426;&#21046;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#36866;&#29992;&#20110;&#21508;&#31181;&#38543;&#26426;&#22270;&#27169;&#22411;&#65292;&#21253;&#25324;&#65288;&#31232;&#30095;&#30340;&#65289;Erd\H{o}s-R\'enyi&#27169;&#22411;&#21644;&#38543;&#26426;&#22359;&#27169;&#22411;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#35777;&#39564;&#35777;&#36825;&#20123;&#21457;&#29616;&#65292;&#35266;&#23519;&#21040;&#25910;&#25947;&#29616;&#35937;&#24050;&#32463;&#22312;&#30456;&#23545;&#36866;&#20013;&#35268;&#27169;&#30340;&#22270;&#20013;&#26174;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03880v1 Announce Type: new  Abstract: Graph neural networks (GNNs) are the predominant architectures for a variety of learning tasks on graphs. We present a new angle on the expressive power of GNNs by studying how the predictions of a GNN probabilistic classifier evolve as we apply it on larger graphs drawn from some random graph model. We show that the output converges to a constant function, which upper-bounds what these classifiers can express uniformly. This convergence phenomenon applies to a very wide class of GNNs, including state of the art models, with aggregates including mean and the attention-based mechanism of graph transformers. Our results apply to a broad class of random graph models, including the (sparse) Erd\H{o}s-R\'enyi model and the stochastic block model. We empirically validate these findings, observing that the convergence phenomenon already manifests itself on graphs of relatively modest size.
&lt;/p&gt;</description></item></channel></rss>