<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#30528;&#30524;&#20110;&#35299;&#20915;AI&#31995;&#32479;&#20013;&#30340;&#20559;&#35265;&#38382;&#39064;&#65292;&#20174;&#20449;&#24687;&#36136;&#37327;&#32500;&#24230;&#30340;&#35282;&#24230;&#20986;&#21457;&#25552;&#20986;&#20102;&#35299;&#20915;&#20559;&#35265;&#30340;&#28508;&#22312;&#25913;&#36827;&#65292;&#25552;&#20986;&#20102;&#23436;&#25972;&#24615;&#12289;&#19968;&#33268;&#24615;&#12289;&#21450;&#26102;&#24615;&#21644;&#21487;&#38752;&#24615;&#31561;&#25968;&#25454;&#36136;&#37327;&#32500;&#24230;&#12290;</title><link>http://arxiv.org/abs/2305.06967</link><description>&lt;p&gt;
&#38754;&#21521;&#20844;&#27491;AI&#30340;&#25968;&#25454;&#36136;&#37327;&#32500;&#24230;
&lt;/p&gt;
&lt;p&gt;
Data quality dimensions for fair AI. (arXiv:2305.06967v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.06967
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30528;&#30524;&#20110;&#35299;&#20915;AI&#31995;&#32479;&#20013;&#30340;&#20559;&#35265;&#38382;&#39064;&#65292;&#20174;&#20449;&#24687;&#36136;&#37327;&#32500;&#24230;&#30340;&#35282;&#24230;&#20986;&#21457;&#25552;&#20986;&#20102;&#35299;&#20915;&#20559;&#35265;&#30340;&#28508;&#22312;&#25913;&#36827;&#65292;&#25552;&#20986;&#20102;&#23436;&#25972;&#24615;&#12289;&#19968;&#33268;&#24615;&#12289;&#21450;&#26102;&#24615;&#21644;&#21487;&#38752;&#24615;&#31561;&#25968;&#25454;&#36136;&#37327;&#32500;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#24182;&#38750;&#26412;&#36136;&#19978;&#20855;&#26377;&#20013;&#31435;&#24615;&#65292;&#22240;&#27492;&#20559;&#35265;&#20250;&#28183;&#36879;&#21040;&#20219;&#20309;&#31867;&#22411;&#30340;&#25216;&#26415;&#24037;&#20855;&#20013;&#12290;&#29305;&#21035;&#26159;&#22312;&#22788;&#29702;&#20154;&#31867;&#26102;&#65292;AI&#31639;&#27861;&#20250;&#21453;&#26144;&#20986;&#28304;&#20110;&#38169;&#26631;&#35760;&#25968;&#25454;&#30340;&#25216;&#26415;&#38169;&#35823;&#12290;&#30001;&#20110;&#23427;&#20204;&#25552;&#20379;&#20102;&#38169;&#35823;&#21644;&#27495;&#35270;&#24615;&#30340;&#20998;&#31867;&#65292;&#24310;&#32493;&#20102;&#32467;&#26500;&#24615;&#31181;&#26063;&#20027;&#20041;&#21644;&#36793;&#32536;&#21270;&#29616;&#35937;&#65292;&#36825;&#20123;&#31995;&#32479;&#24182;&#26410;&#31995;&#32479;&#22320;&#38450;&#33539;&#20559;&#35265;&#12290;&#26412;&#25991;&#20174;&#20449;&#24687;&#36136;&#37327;&#32500;&#24230;&#30340;&#35282;&#24230;&#32771;&#34385;&#20102;AI&#31995;&#32479;&#20559;&#35265;&#38382;&#39064;&#65292;&#20197;&#20004;&#20010;&#36890;&#24120;&#36739;&#20026;&#22256;&#38590;&#30340;&#24773;&#22659;&#65292;&#21363;&#38750;&#20108;&#20803;&#20010;&#20307;&#30340;&#20998;&#31867;&#21644;&#36328;&#24615;&#21035;&#20010;&#20307;&#30340;&#20998;&#31867;&#20026;&#20363;&#65292;&#35828;&#26126;&#20102;&#20559;&#35265;&#32531;&#35299;&#24037;&#20855;&#30340;&#28508;&#22312;&#25913;&#36827;&#12290;&#30830;&#23450;&#35201;&#23454;&#26045;&#30340;&#25968;&#25454;&#36136;&#37327;&#32500;&#24230;&#20197;&#23454;&#29616;&#26356;&#20844;&#24179;&#30340;&#30446;&#30340;&#21487;&#33021;&#26377;&#21161;&#20110;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#22240;&#27492;&#25105;&#20204;&#25552;&#20986;&#24314;&#35758;&#22312;&#23436;&#25972;&#24615;&#12289;&#19968;&#33268;&#24615;&#12289;&#21450;&#26102;&#24615;&#21644;&#21487;&#38752;&#24615;&#31561;&#26041;&#38754;&#32771;&#34385;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20123;&#29702;&#35770;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
AI systems are not intrinsically neutral and biases trickle in any type of technological tool. In particular when dealing with people, AI algorithms reflect technical errors originating with mislabeled data. As they feed wrong and discriminatory classifications, perpetuating structural racism and marginalization, these systems are not systematically guarded against bias. In this article we consider the problem of bias in AI systems from the point of view of Information Quality dimensions. We illustrate potential improvements of a bias mitigation tool in gender classification errors, referring to two typically difficult contexts: the classification of non-binary individuals and the classification of transgender individuals. The identification of data quality dimensions to implement in bias mitigation tool may help achieve more fairness. Hence, we propose to consider this issue in terms of completeness, consistency, timeliness and reliability, and offer some theoretical results.
&lt;/p&gt;</description></item></channel></rss>