<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>Cloud Kitchen&#24179;&#21488;&#21033;&#29992;&#22522;&#20110;&#35268;&#21010;&#30340;&#22797;&#21512;AI&#20248;&#21270;&#39135;&#21697;&#37197;&#36865;&#27969;&#31243;&#65292;&#36890;&#36807;&#36710;&#36742;&#36335;&#24452;&#38382;&#39064;&#21644;&#30495;&#23454;&#21382;&#21490;&#25968;&#25454;&#38598;&#38477;&#20302;&#24310;&#36831;&#37197;&#36865;&#37327;&#65292;&#25552;&#39640;&#39038;&#23458;&#28385;&#24847;&#24230;&#12290;</title><link>https://arxiv.org/abs/2402.10725</link><description>&lt;p&gt;
&#20113;&#21416;&#25151;&#65306;&#20351;&#29992;&#22522;&#20110;&#35268;&#21010;&#30340;&#22797;&#21512;AI&#20248;&#21270;&#39135;&#21697;&#37197;&#36865;&#27969;&#31243;
&lt;/p&gt;
&lt;p&gt;
Cloud Kitchen: Using Planning-based Composite AI to Optimize Food Delivery Process
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10725
&lt;/p&gt;
&lt;p&gt;
Cloud Kitchen&#24179;&#21488;&#21033;&#29992;&#22522;&#20110;&#35268;&#21010;&#30340;&#22797;&#21512;AI&#20248;&#21270;&#39135;&#21697;&#37197;&#36865;&#27969;&#31243;&#65292;&#36890;&#36807;&#36710;&#36742;&#36335;&#24452;&#38382;&#39064;&#21644;&#30495;&#23454;&#21382;&#21490;&#25968;&#25454;&#38598;&#38477;&#20302;&#24310;&#36831;&#37197;&#36865;&#37327;&#65292;&#25552;&#39640;&#39038;&#23458;&#28385;&#24847;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#39135;&#21697;&#37197;&#36865;&#24066;&#22330;&#20026;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#26381;&#21153;&#25552;&#20379;&#20102;&#35768;&#22810;&#26426;&#20250;&#65292;&#21487;&#20197;&#25552;&#39640;&#20840;&#29699;&#20379;&#39184;&#25928;&#29575;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;Cloud Kitchen&#24179;&#21488;&#65292;&#20316;&#20026;&#19968;&#20010;&#20915;&#31574;&#24037;&#20855;&#65292;&#29992;&#20110;&#24110;&#21161;&#20855;&#26377;&#39135;&#21697;&#37197;&#36865;&#26381;&#21153;&#30340;&#39184;&#21381;&#65292;&#24182;&#25552;&#20379;&#19968;&#20010;&#27169;&#25311;&#22120;&#26469;&#35780;&#20272;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#35813;&#24179;&#21488;&#30001;&#19968;&#20010;Technology-Specific Bridge&#65288;TSB&#65289;&#32452;&#25104;&#65292;&#29992;&#20110;&#19982;&#39184;&#21381;&#25110;&#27169;&#25311;&#22120;&#36827;&#34892;&#36890;&#20449;&#12290;TSB&#20351;&#29992;PDDL&#27169;&#22411;&#34920;&#31034;&#23884;&#20837;&#22312;Unified Planning Framework&#65288;UPF&#65289;&#20013;&#30340;&#20915;&#31574;&#12290;&#20915;&#31574;&#28041;&#21450;&#23558;&#39038;&#23458;&#35746;&#21333;&#20998;&#37197;&#21040;&#36710;&#36742;&#20197;&#21450;&#20915;&#23450;&#20197;&#20160;&#20040;&#39034;&#24207;&#20026;&#39038;&#23458;&#25552;&#20379;&#26381;&#21153;&#65288;&#23545;&#20110;&#27599;&#36742;&#36710;&#65289;&#65292;&#36825;&#26159;&#36890;&#36807;&#20855;&#26377;&#26102;&#38388;&#31383;&#21475;&#30340;&#36710;&#36742;&#36335;&#24452;&#38382;&#39064;&#65288;VRPTW&#65289;&#26469;&#23436;&#25104;&#30340;&#65292;&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#26159;&#39640;&#25928;&#30340;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#24179;&#21488;&#21046;&#23450;&#30340;&#20915;&#31574;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#21382;&#21490;&#25968;&#25454;&#38598;&#20943;&#23569;&#24310;&#36831;&#37197;&#36865;&#37327;&#26469;&#25552;&#39640;&#39038;&#23458;&#28385;&#24847;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10725v1 Announce Type: new  Abstract: The global food delivery market provides many opportunities for AI-based services that can improve the efficiency of feeding the world. This paper presents the Cloud Kitchen platform as a decision-making tool for restaurants with food delivery and a simulator to evaluate the impact of the decisions. The platform consists of a Technology-Specific Bridge (TSB) that provides an interface for communicating with restaurants or the simulator. TSB uses a PDDL model to represent decisions embedded in the Unified Planning Framework (UPF). Decision-making, which concerns allocating customers' orders to vehicles and deciding in which order the customers will be served (for each vehicle), is done via a Vehicle Routing Problem with Time Windows (VRPTW), an efficient tool for this problem. We show that decisions made by our platform can improve customer satisfaction by reducing the number of delayed deliveries using a real-world historical dataset.
&lt;/p&gt;</description></item></channel></rss>