<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26102;&#38388;&#21270;&#26412;&#20307;&#20013;&#20171;&#26597;&#35810;&#20013;&#21807;&#19968;&#21487;&#29305;&#24449;&#24615;&#21644;&#21487;&#23398;&#20064;&#24615;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#30456;&#24212;&#30340;&#20256;&#36882;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.07662</link><description>&lt;p&gt;
&#26102;&#38388;&#21270;&#26412;&#20307;&#20013;&#20171;&#26597;&#35810;&#30340;&#21807;&#19968;&#21487;&#29305;&#24449;&#24615;&#21644;&#21487;&#23398;&#20064;&#24615;
&lt;/p&gt;
&lt;p&gt;
Temporalising Unique Characterisability and Learnability of Ontology-Mediated Queries. (arXiv:2306.07662v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07662
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26102;&#38388;&#21270;&#26412;&#20307;&#20013;&#20171;&#26597;&#35810;&#20013;&#21807;&#19968;&#21487;&#29305;&#24449;&#24615;&#21644;&#21487;&#23398;&#20064;&#24615;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#30456;&#24212;&#30340;&#20256;&#36882;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#36890;&#36807;&#31034;&#20363;&#26469;&#30740;&#31350;&#25968;&#25454;&#24211;&#26597;&#35810;&#30340;&#21807;&#19968;&#21487;&#29305;&#24449;&#24615;&#21644;&#21487;&#23398;&#20064;&#24615;&#24050;&#32463;&#25193;&#23637;&#21040;&#20102;&#26412;&#20307;&#20013;&#20171;&#26597;&#35810;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#33719;&#24471;&#30340;&#32467;&#26524;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#21487;&#20197;&#25552;&#21319;&#21040;&#26102;&#38388;&#21270;&#30340;&#26412;&#20307;&#20013;&#20171;&#26597;&#35810;&#12290;&#25105;&#20204;&#31995;&#32479;&#22320;&#20171;&#32461;&#20102;&#38750;&#26102;&#38388;&#21270;&#24773;&#20917;&#19979;&#30456;&#20851;&#26041;&#27861;&#65292;&#28982;&#21518;&#23637;&#31034;&#20102;&#36890;&#29992;&#30340;&#20256;&#36882;&#32467;&#26524;&#65292;&#21487;&#20197;&#30830;&#23450;&#29616;&#26377;&#32467;&#26524;&#22312;&#20309;&#31181;&#26465;&#20214;&#19979;&#21487;&#20197;&#25512;&#24191;&#21040;&#26102;&#38388;&#21270;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recently, the study of the unique characterisability and learnability of database queries by means of examples has been extended to ontology-mediated queries. Here, we study in how far the obtained results can be lifted to temporalised ontology-mediated queries. We provide a systematic introduction to the relevant approaches in the non-temporal case and then show general transfer results pinpointing under which conditions existing results can be lifted to temporalised queries.
&lt;/p&gt;</description></item></channel></rss>