<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#34913;&#37327;&#21407;&#29702;&#35770;&#25512;&#29702;&#24378;&#24230;&#21464;&#21270;&#30340;&#25439;&#22833;&#20989;&#25968;&#65292;&#24182;&#20351;&#29992;Problog&#24037;&#20855;&#35745;&#31639;&#25439;&#22833;&#24230;&#37327;&#65292;&#26368;&#32456;&#24471;&#20986;&#20102;&#20851;&#20110;&#19981;&#21516;&#36951;&#24536;&#31574;&#30053;&#24378;&#24230;&#30340;&#30740;&#31350;&#26041;&#27861;&#21644;&#23454;&#38469;&#24212;&#29992;&#31034;&#20363;&#12290;</title><link>https://arxiv.org/abs/2404.02454</link><description>&lt;p&gt;
&#34913;&#37327;&#36951;&#24536;&#31574;&#30053;&#30340;&#25512;&#29702;&#24378;&#24230;&#25216;&#26415;
&lt;/p&gt;
&lt;p&gt;
Techniques for Measuring the Inferential Strength of Forgetting Policies
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02454
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#34913;&#37327;&#21407;&#29702;&#35770;&#25512;&#29702;&#24378;&#24230;&#21464;&#21270;&#30340;&#25439;&#22833;&#20989;&#25968;&#65292;&#24182;&#20351;&#29992;Problog&#24037;&#20855;&#35745;&#31639;&#25439;&#22833;&#24230;&#37327;&#65292;&#26368;&#32456;&#24471;&#20986;&#20102;&#20851;&#20110;&#19981;&#21516;&#36951;&#24536;&#31574;&#30053;&#24378;&#24230;&#30340;&#30740;&#31350;&#26041;&#27861;&#21644;&#23454;&#38469;&#24212;&#29992;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30693;&#35782;&#34920;&#31034;&#20013;&#30340;&#36951;&#24536;&#25216;&#26415;&#34987;&#35777;&#26126;&#26159;&#19968;&#31181;&#24378;&#22823;&#19988;&#26377;&#24191;&#27867;&#24212;&#29992;&#30340;&#30693;&#35782;&#24037;&#31243;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#19981;&#21516;&#30340;&#36951;&#24536;&#31574;&#30053;&#25110;&#19981;&#21516;&#36951;&#24536;&#25805;&#20316;&#31526;&#30340;&#20351;&#29992;&#22914;&#20309;&#24433;&#21709;&#21407;&#29702;&#35770;&#30340;&#25512;&#29702;&#24378;&#24230;&#20960;&#20046;&#27809;&#26377;&#30740;&#31350;&#12290;&#26412;&#25991;&#26088;&#22312;&#26681;&#25454;&#27169;&#22411;&#35745;&#25968;&#21644;&#27010;&#29575;&#29702;&#35770;&#30340;&#30452;&#35273;&#23450;&#20041;&#29992;&#20110;&#34913;&#37327;&#25512;&#29702;&#24378;&#24230;&#21464;&#21270;&#30340;&#25439;&#22833;&#20989;&#25968;&#12290;&#30740;&#31350;&#20102;&#27492;&#31867;&#25439;&#22833;&#24230;&#37327;&#30340;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#30693;&#35782;&#24037;&#31243;&#24037;&#20855;&#65292;&#29992;&#20110;&#20351;&#29992;Problog&#35745;&#31639;&#25439;&#22833;&#24230;&#37327;&#12290;&#35770;&#25991;&#21253;&#25324;&#19968;&#20010;&#29992;&#20110;&#30740;&#31350;&#21644;&#30830;&#23450;&#19981;&#21516;&#36951;&#24536;&#31574;&#30053;&#24378;&#24230;&#30340;&#24037;&#20316;&#26041;&#27861;&#65292;&#20197;&#21450;&#23637;&#31034;&#22914;&#20309;&#21033;&#29992;Problog&#24212;&#29992;&#29702;&#35770;&#32467;&#26524;&#30340;&#20855;&#20307;&#31034;&#20363;&#12290;&#34429;&#28982;&#37325;&#28857;&#26159;&#36951;&#24536;&#65292;&#20294;&#32467;&#26524;&#26356;&#20026;&#26222;&#36941;&#65292;&#24182;&#19988;&#24212;&#20855;&#26377;&#26356;&#24191;&#27867;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02454v1 Announce Type: new  Abstract: The technique of forgetting in knowledge representation has been shown to be a powerful and useful knowledge engineering tool with widespread application. Yet, very little research has been done on how different policies of forgetting, or use of different forgetting operators, affects the inferential strength of the original theory. The goal of this paper is to define loss functions for measuring changes in inferential strength based on intuitions from model counting and probability theory. Properties of such loss measures are studied and a pragmatic knowledge engineering tool is proposed for computing loss measures using Problog. The paper includes a working methodology for studying and determining the strength of different forgetting policies, in addition to concrete examples showing how to apply the theoretical results using Problog. Although the focus is on forgetting, the results are much more general and should have wider applicati
&lt;/p&gt;</description></item></channel></rss>