<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#26597;&#35810;&#22270;&#20013;&#24120;&#37327;&#21644;&#21464;&#37327;&#20043;&#38388;&#24046;&#24322;&#65292;&#33021;&#21160;&#24577;&#27979;&#37327;&#28040;&#24687;&#37325;&#35201;&#24615;&#24182;&#25429;&#25417;&#38544;&#24335;&#36923;&#36753;&#20381;&#36182;&#20851;&#31995;&#30340;&#26465;&#20214;&#36923;&#36753;&#28040;&#24687;&#20256;&#36882;&#21464;&#21387;&#22120;&#12290;</title><link>https://arxiv.org/abs/2402.12954</link><description>&lt;p&gt;
&#29992;&#20110;&#22797;&#26434;&#26597;&#35810;&#22238;&#31572;&#30340;&#26465;&#20214;&#36923;&#36753;&#28040;&#24687;&#20256;&#36882;&#21464;&#21387;&#22120;
&lt;/p&gt;
&lt;p&gt;
Conditional Logical Message Passing Transformer for Complex Query Answering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12954
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#26597;&#35810;&#22270;&#20013;&#24120;&#37327;&#21644;&#21464;&#37327;&#20043;&#38388;&#24046;&#24322;&#65292;&#33021;&#21160;&#24577;&#27979;&#37327;&#28040;&#24687;&#37325;&#35201;&#24615;&#24182;&#25429;&#25417;&#38544;&#24335;&#36923;&#36753;&#20381;&#36182;&#20851;&#31995;&#30340;&#26465;&#20214;&#36923;&#36753;&#28040;&#24687;&#20256;&#36882;&#21464;&#21387;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30693;&#35782;&#22270;&#35889;&#65288;KGs&#65289;&#19978;&#30340;&#22797;&#26434;&#26597;&#35810;&#22238;&#31572;&#65288;CQA&#65289;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#30001;&#20110;KGs&#36890;&#24120;&#26159;&#19981;&#23436;&#25972;&#30340;&#65292;&#25552;&#20986;&#20102;&#31070;&#32463;&#27169;&#22411;&#26469;&#36890;&#36807;&#25191;&#34892;&#22810;&#36339;&#36923;&#36753;&#25512;&#29702;&#26469;&#35299;&#20915;CQA&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#27169;&#22411;&#19981;&#33021;&#21516;&#26102;&#22312;&#19968;&#36339;&#21644;&#22810;&#36339;&#26597;&#35810;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;&#26368;&#36817;&#30340;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39044;&#35757;&#32451;&#31070;&#32463;&#38142;&#25509;&#39044;&#27979;&#22120;&#30340;&#36923;&#36753;&#28040;&#24687;&#20256;&#36882;&#26426;&#21046;&#12290;&#34429;&#28982;&#22312;&#19968;&#36339;&#21644;&#22810;&#36339;&#26597;&#35810;&#19978;&#37117;&#26377;&#25928;&#65292;&#20294;&#23427;&#24573;&#30053;&#20102;&#26597;&#35810;&#22270;&#20013;&#24120;&#37327;&#21644;&#21464;&#37327;&#33410;&#28857;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#27492;&#22806;&#65292;&#22312;&#33410;&#28857;&#23884;&#20837;&#26356;&#26032;&#38454;&#27573;&#65292;&#35813;&#26426;&#21046;&#19981;&#33021;&#21160;&#24577;&#34913;&#37327;&#19981;&#21516;&#28040;&#24687;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#19988;&#23427;&#33021;&#21542;&#25429;&#25417;&#19982;&#33410;&#28857;&#21644;&#25509;&#25910;&#28040;&#24687;&#30456;&#20851;&#30340;&#38544;&#24335;&#36923;&#36753;&#20381;&#36182;&#20851;&#31995;&#20173;&#19981;&#28165;&#26970;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#26465;&#20214;&#36923;&#36753;&#28040;&#24687;&#20256;&#36882;&#21464;&#21387;&#22120;&#65288;CLMPT&#65289;&#65292;&#32771;&#34385;&#20102;&#26597;&#35810;&#22270;&#20013;&#24120;&#37327;&#21644;&#21464;&#37327;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#24182;&#19988;&#20855;&#26377;&#21160;&#24577;&#27979;&#37327;&#19981;&#21516;&#28040;&#24687;&#37325;&#35201;&#24615;&#20197;&#21450;&#25429;&#25417;&#19982;&#33410;&#28857;&#21644;&#25509;&#25910;&#28040;&#24687;&#30456;&#20851;&#30340;&#38544;&#24335;&#36923;&#36753;&#20381;&#36182;&#20851;&#31995;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12954v1 Announce Type: cross  Abstract: Complex Query Answering (CQA) over Knowledge Graphs (KGs) is a challenging task. Given that KGs are usually incomplete, neural models are proposed to solve CQA by performing multi-hop logical reasoning. However, most of them cannot perform well on both one-hop and multi-hop queries simultaneously. Recent work proposes a logical message passing mechanism based on the pre-trained neural link predictors. While effective on both one-hop and multi-hop queries, it ignores the difference between the constant and variable nodes in a query graph. In addition, during the node embedding update stage, this mechanism cannot dynamically measure the importance of different messages, and whether it can capture the implicit logical dependencies related to a node and received messages remains unclear. In this paper, we propose Conditional Logical Message Passing Transformer (CLMPT), which considers the difference between constants and variables in the c
&lt;/p&gt;</description></item></channel></rss>