<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19968;&#33324;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#30340;&#26368;&#23567;&#32852;&#30431;&#36923;&#36753;&#65292;&#19981;&#20855;&#22791;&#20256;&#32479;&#27169;&#22411;&#20013;&#30340;&#29420;&#31435;&#24615;&#12289;&#24207;&#21015;&#24615;&#21644;&#30830;&#23450;&#24615;&#20551;&#35774;&#65292;&#23637;&#31034;&#20102;&#20854;&#23436;&#22791;&#24615;&#24182;&#19982;&#20256;&#32479;&#27169;&#22411;&#36827;&#34892;&#20102;&#27604;&#36739;</title><link>https://arxiv.org/abs/2403.14704</link><description>&lt;p&gt;
&#19968;&#20010;&#26368;&#23567;&#32852;&#30431;&#36923;&#36753;
&lt;/p&gt;
&lt;p&gt;
A minimal coalition logic
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14704
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19968;&#33324;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#30340;&#26368;&#23567;&#32852;&#30431;&#36923;&#36753;&#65292;&#19981;&#20855;&#22791;&#20256;&#32479;&#27169;&#22411;&#20013;&#30340;&#29420;&#31435;&#24615;&#12289;&#24207;&#21015;&#24615;&#21644;&#30830;&#23450;&#24615;&#20551;&#35774;&#65292;&#23637;&#31034;&#20102;&#20854;&#23436;&#22791;&#24615;&#24182;&#19982;&#20256;&#32479;&#27169;&#22411;&#36827;&#34892;&#20102;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#30431;&#36923;&#36753;&#26159;&#25112;&#30053;&#25512;&#29702;&#30740;&#31350;&#20013;&#30340;&#19968;&#20010;&#20013;&#24515;&#36923;&#36753;&#12290;&#26412;&#25991;&#39318;&#20808;&#25351;&#20986;&#32852;&#30431;&#36923;&#36753;&#27169;&#22411;&#65292;&#21363;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#65292;&#23384;&#22312;&#19977;&#20010;&#36807;&#20110;&#24378;&#30340;&#20551;&#35774;&#12290;&#20854;&#19968;&#26159;&#20195;&#29702;&#30340;&#29420;&#31435;&#24615;&#65307;&#21363;&#65292;&#20004;&#20010;&#19981;&#21516;&#32852;&#30431;&#30340;&#20004;&#20010;&#21487;&#29992;&#32852;&#21512;&#21160;&#20316;&#30340;&#21512;&#24182;&#24635;&#26159;&#21487;&#20197;&#21512;&#24182;&#25104;&#20004;&#20010;&#32852;&#30431;&#30340;&#32852;&#30431;&#12290;&#20854;&#20108;&#26159;&#24207;&#21015;&#24615;&#65307;&#21363;&#65292;&#32852;&#30431;&#24635;&#26159;&#26377;&#21487;&#29992;&#30340;&#32852;&#21512;&#21160;&#20316;&#12290;&#20854;&#19977;&#26159;&#30830;&#23450;&#24615;&#65292;&#21363;&#65292;&#22823;&#32852;&#30431;&#30340;&#21512;&#20316;&#21160;&#20316;&#24635;&#26159;&#26377;&#21807;&#19968;&#32467;&#26524;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19968;&#33324;&#24182;&#21457;&#21338;&#24328;&#27169;&#22411;&#30340;&#32852;&#30431;&#36923;&#36753;&#65292;&#35813;&#27169;&#22411;&#19981;&#20855;&#22791;&#36825;&#19977;&#20010;&#20551;&#35774;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#19968;&#36923;&#36753;&#30340;&#23436;&#22791;&#24615;&#65292;&#24182;&#19982;&#32852;&#30431;&#36923;&#36753;&#36827;&#34892;&#20102;&#35814;&#32454;&#27604;&#36739;&#12290;&#22312;&#25112;&#30053;&#25512;&#29702;&#30340;&#32972;&#26223;&#19979;&#65292;&#36825;&#19968;&#36923;&#36753;&#20284;&#20046;&#26159;&#26368;&#23567;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14704v1 Announce Type: cross  Abstract: Coalition logic is a central logic in strategic reasoning studies. In this paper, we first argue that Coalition Logic models, concurrent game models, have three too-strong assumptions. The first one is the independence of agents; that is, the merge of two available joint actions of two disjoint coalitions is always available for the union of the two coalitions. The second one is seriality; that is, coalitions always have available joint actions. The third one is determinism, that is, the grand coalition's joint actions always have a unique outcome. Second, we present a coalition logic based on general concurrent game models, which do not have the three assumptions. We show the completeness of this logic and compare it with Coalition Logic in detail. This logic seems minimal in the context of strategic reasoning.
&lt;/p&gt;</description></item></channel></rss>