<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;&#27010;&#29575;&#35821;&#20041;&#26469;&#26597;&#35810;&#19981;&#19968;&#33268;&#30340;&#25551;&#36848;&#36923;&#36753;&#30693;&#35782;&#24211;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.09138</link><description>&lt;p&gt;
&#21033;&#29992;&#19981;&#30830;&#23450;&#24615;&#26597;&#35810;&#19981;&#19968;&#33268;&#30340;&#25551;&#36848;&#36923;&#36753;&#30693;&#35782;&#24211;
&lt;/p&gt;
&lt;p&gt;
Exploiting Uncertainty for Querying Inconsistent Description Logics Knowledge Bases. (arXiv:2306.09138v2 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09138
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#21033;&#29992;&#27010;&#29575;&#35821;&#20041;&#26469;&#26597;&#35810;&#19981;&#19968;&#33268;&#30340;&#25551;&#36848;&#36923;&#36753;&#30693;&#35782;&#24211;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#35821;&#20041;Web&#30340;&#37325;&#35201;&#24615;&#26085;&#30410;&#22686;&#21152;&#65292;&#31649;&#29702;&#25551;&#36848;&#36923;&#36753;&#30693;&#35782;&#24211;&#65288;KBs&#65289;&#20013;&#30340;&#19981;&#19968;&#33268;&#24615;&#21464;&#24471;&#36234;&#26469;&#36234;&#24517;&#35201;&#12290;&#36825;&#20123;&#30693;&#35782;&#24211;&#21253;&#21547;&#26469;&#33258;&#19981;&#21516;&#26469;&#28304;&#30340;&#20449;&#24687;&#65292;&#20854;&#20869;&#23481;&#32463;&#24120;&#21457;&#29983;&#21464;&#21270;&#65292;&#24182;&#19988;&#22312;&#21333;&#29420;&#32771;&#34385;&#25110;&#32508;&#21512;&#32771;&#34385;&#26102;&#21487;&#33021;&#21253;&#21547;&#30456;&#20114;&#30683;&#30462;&#30340;&#25551;&#36848;&#12290;&#20256;&#32479;&#30340;&#25512;&#29702;&#31639;&#27861;&#26080;&#27861;&#22788;&#29702;&#19981;&#19968;&#33268;&#30340;&#30693;&#35782;&#24211;&#65292;&#38656;&#35201;&#36890;&#36807;&#35843;&#35797;&#30693;&#35782;&#24211;&#26469;&#28040;&#38500;&#19981;&#19968;&#33268;&#24615;&#12290;&#26412;&#25991;&#21033;&#29992;&#19968;&#31181;&#31216;&#20026;DISPONTE&#30340;&#29616;&#26377;&#27010;&#29575;&#35821;&#20041;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#20801;&#35768;&#22312;&#19981;&#19968;&#33268;&#30340;&#30693;&#35782;&#24211;&#20013;&#36827;&#34892;&#26597;&#35810;&#12290;&#25105;&#20204;&#22312;TRILL&#21644;BUNDLE&#25512;&#29702;&#22120;&#20013;&#23454;&#29616;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#25552;&#26696;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23558;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#19982;&#20462;&#22797;&#35821;&#20041;&#36827;&#34892;&#20102;&#27491;&#24335;&#27604;&#36739;&#65292;&#21518;&#32773;&#26159;&#22312;&#32771;&#34385;DL&#25512;&#29702;&#20219;&#21153;&#26102;&#26368;&#20026;&#25104;&#29087;&#30340;&#35821;&#20041;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
The necessity to manage inconsistency in Description Logics Knowledge Bases~(KBs) has come to the fore with the increasing importance gained by the Semantic Web, where information comes from different sources that constantly change their content and may contain contradictory descriptions when considered either alone or together. Classical reasoning algorithms do not handle inconsistent KBs, forcing the debugging of the KB in order to remove the inconsistency. In this paper, we exploit an existing probabilistic semantics called DISPONTE to overcome this problem and allow queries also in case of inconsistent KBs. We implemented our approach in the reasoners TRILL and BUNDLE and empirically tested the validity of our proposal. Moreover, we formally compare the presented approach to that of the repair semantics, one of the most established semantics when considering DL reasoning tasks.
&lt;/p&gt;</description></item></channel></rss>