<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#36890;&#36807;ologs&#21644;&#25509;&#32447;&#22270;&#30340;&#27010;&#24565;&#65292;&#24314;&#31435;&#20102;&#19968;&#20010;&#37327;&#21270;&#27010;&#24565;&#31867;&#27604;&#30340;&#26694;&#26550;&#65292;&#20351;&#24471;&#33258;&#20027;&#31995;&#32479;&#33021;&#22815;&#24418;&#25104;&#25277;&#35937;&#27010;&#24565;&#65292;&#24182;&#36890;&#36807;&#22270;&#35770;&#21644;&#33539;&#30068;&#35770;&#30340;&#25216;&#26415;&#36827;&#34892;&#27604;&#36739;&#21644;&#25805;&#20316;&#65292;&#21516;&#26102;&#20351;&#29992;&#25509;&#32447;&#22270;&#25805;&#20316;&#23450;&#20041;&#20102;&#24230;&#37327;&#21644;&#22270;&#32534;&#36753;&#36317;&#31163;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01020</link><description>&lt;p&gt;
&#36890;&#36807;ologs&#21644;&#25509;&#32447;&#22270;&#37327;&#21270;&#27010;&#24565;&#30340;&#31867;&#27604;
&lt;/p&gt;
&lt;p&gt;
Quantifying analogy of concepts via ologs and wiring diagrams
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01020
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;ologs&#21644;&#25509;&#32447;&#22270;&#30340;&#27010;&#24565;&#65292;&#24314;&#31435;&#20102;&#19968;&#20010;&#37327;&#21270;&#27010;&#24565;&#31867;&#27604;&#30340;&#26694;&#26550;&#65292;&#20351;&#24471;&#33258;&#20027;&#31995;&#32479;&#33021;&#22815;&#24418;&#25104;&#25277;&#35937;&#27010;&#24565;&#65292;&#24182;&#36890;&#36807;&#22270;&#35770;&#21644;&#33539;&#30068;&#35770;&#30340;&#25216;&#26415;&#36827;&#34892;&#27604;&#36739;&#21644;&#25805;&#20316;&#65292;&#21516;&#26102;&#20351;&#29992;&#25509;&#32447;&#22270;&#25805;&#20316;&#23450;&#20041;&#20102;&#24230;&#37327;&#21644;&#22270;&#32534;&#36753;&#36317;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;Spivak&#21644;Kent&#21019;&#24314;&#30340;&#26412;&#20307;&#26085;&#24535;(ologs)&#29702;&#35770;&#30340;&#22522;&#30784;&#19978;&#65292;&#23450;&#20041;&#20102;&#19968;&#31181;&#31216;&#20026;&#25509;&#32447;&#22270;&#30340;&#27010;&#24565;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25509;&#32447;&#22270;&#26159;&#19968;&#20010;&#26377;&#38480;&#30340;&#26377;&#21521;&#26631;&#35760;&#22270;&#12290;&#26631;&#35760;&#23545;&#24212;&#20110;olog&#20013;&#30340;&#31867;&#22411;&#65307;&#23427;&#20204;&#20063;&#21487;&#20197;&#34987;&#35299;&#37322;&#20026;&#33258;&#20027;&#31995;&#32479;&#20013;&#20256;&#24863;&#22120;&#30340;&#35835;&#25968;&#12290;&#22240;&#27492;&#65292;&#25509;&#32447;&#22270;&#21487;&#20197;&#29992;&#20316;&#33258;&#20027;&#31995;&#32479;&#24418;&#25104;&#25277;&#35937;&#27010;&#24565;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22522;&#20110;&#39592;&#26550;&#25509;&#32447;&#22270;&#30340;&#22270;&#24418;&#24418;&#25104;&#19968;&#20010;&#33539;&#30068;&#12290;&#36825;&#20351;&#24471;&#39592;&#26550;&#25509;&#32447;&#22270;&#21487;&#20197;&#20351;&#29992;&#22270;&#35770;&#21644;&#33539;&#30068;&#35770;&#30340;&#25216;&#26415;&#36827;&#34892;&#27604;&#36739;&#21644;&#25805;&#20316;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#20351;&#29992;&#20165;&#36866;&#29992;&#20110;&#25509;&#32447;&#22270;&#30340;&#25805;&#20316;&#23558;&#20256;&#32479;&#30340;&#22270;&#32534;&#36753;&#36317;&#31163;&#23450;&#20041;&#25193;&#23637;&#21040;&#25509;&#32447;&#22270;&#30340;&#24773;&#20917;&#65292;&#20174;&#32780;&#24471;&#21040;&#20102;&#25152;&#26377;&#39592;&#26550;&#25509;&#32447;&#22270;&#38598;&#21512;&#19978;&#30340;&#24230;&#37327;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#35745;&#31639;&#30001;&#25509;&#32447;&#22270;&#34920;&#31034;&#30340;&#20004;&#20010;&#27010;&#24565;&#20043;&#38388;&#36317;&#31163;&#30340;&#25193;&#23637;&#31034;&#20363;&#65292;&#24182;&#35299;&#37322;&#20102;&#22914;&#20309;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#20219;&#20309;&#24212;&#29992;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We build on the theory of ontology logs (ologs) created by Spivak and Kent, and define a notion of wiring diagrams. In this article, a wiring diagram is a finite directed labelled graph. The labels correspond to types in an olog; they can also be interpreted as readings of sensors in an autonomous system. As such, wiring diagrams can be used as a framework for an autonomous system to form abstract concepts. We show that the graphs underlying skeleton wiring diagrams form a category. This allows skeleton wiring diagrams to be compared and manipulated using techniques from both graph theory and category theory. We also extend the usual definition of graph edit distance to the case of wiring diagrams by using operations only available to wiring diagrams, leading to a metric on the set of all skeleton wiring diagrams. In the end, we give an extended example on calculating the distance between two concepts represented by wiring diagrams, and explain how to apply our framework to any applica
&lt;/p&gt;</description></item></channel></rss>