<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;TPTND&#30340;&#27010;&#29575;&#31867;&#22411;&#33258;&#28982;&#28436;&#31639;&#31995;&#32479;&#65292;&#35813;&#31995;&#32479;&#33021;&#22815;&#26816;&#39564;&#24182;&#25512;&#23548;&#27010;&#29575;&#35745;&#31639;&#36807;&#31243;&#30340;&#21487;&#20449;&#24615;&#65292;&#20855;&#26377;&#21487;&#26816;&#26597;&#24615;&#30340;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2206.12934</link><description>&lt;p&gt;
&#22312;&#31867;&#22411;&#21270;&#33258;&#28982;&#28436;&#31639;&#31995;&#32479;&#20013;&#26816;&#39564;&#27010;&#29575;&#35745;&#31639;&#30340;&#21487;&#20449;&#24615;
&lt;/p&gt;
&lt;p&gt;
Checking Trustworthiness of Probabilistic Computations in a Typed Natural Deduction System. (arXiv:2206.12934v2 [cs.LO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.12934
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;TPTND&#30340;&#27010;&#29575;&#31867;&#22411;&#33258;&#28982;&#28436;&#31639;&#31995;&#32479;&#65292;&#35813;&#31995;&#32479;&#33021;&#22815;&#26816;&#39564;&#24182;&#25512;&#23548;&#27010;&#29575;&#35745;&#31639;&#36807;&#31243;&#30340;&#21487;&#20449;&#24615;&#65292;&#20855;&#26377;&#21487;&#26816;&#26597;&#24615;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026; TPTND &#30340;&#27010;&#29575;&#31867;&#22411;&#33258;&#28982;&#28436;&#31639;&#31995;&#32479;&#65292;&#35813;&#31995;&#32479;&#26088;&#22312;&#25512;&#23548;&#26377;&#20851;&#27010;&#29575;&#35745;&#31639;&#36807;&#31243;&#30340;&#21487;&#20449;&#24615;&#23646;&#24615;&#65292;&#20363;&#22914;&#24403;&#20170;&#20154;&#24037;&#26234;&#33021;&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#37027;&#20123;&#23646;&#24615;&#12290;TPTND &#20013;&#30340;&#25512;&#23548;&#34987;&#35299;&#37322;&#20026;&#20174;&#32473;&#23450;&#30340;&#20998;&#31867;&#20998;&#24067;&#20013;&#25552;&#21462; n &#20010;&#21487;&#33021;&#22797;&#26434;&#36755;&#20986;&#26679;&#26412;&#30340;&#36807;&#31243;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#36755;&#20986;&#26679;&#26412;&#30340;&#21487;&#20449;&#24615;&#24418;&#24335;&#21270;&#20026;&#19968;&#31181;&#20551;&#35774;&#27979;&#35797;&#65292;&#21363;&#35745;&#31639;&#20986;&#29616;&#26377;&#30340;&#39057;&#29575;&#19982;&#39044;&#26399;&#30340;&#27010;&#29575;&#20043;&#38388;&#30340;&#36317;&#31163;&#12290;&#36825;&#20010;&#28436;&#31639;&#31995;&#32479;&#30340;&#20027;&#35201;&#20248;&#21183;&#22312;&#20110;&#33021;&#22815;&#26816;&#26597;&#36825;&#31181;&#21487;&#20449;&#24615;&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#20026;&#25512;&#29702;&#36807;&#31243;&#20013;&#20986;&#29616;&#30340;&#39033;&#25552;&#20379;&#20102;&#35745;&#31639;&#35821;&#20041;&#65292;&#24182;&#23450;&#20041;&#20102;&#36923;&#36753;&#36816;&#31639;&#31526;&#20197;&#21450;&#20449;&#20219;&#36816;&#31639;&#31526;&#30340;&#24341;&#20837;&#21644;&#28040;&#35299;&#35268;&#21017;&#12290;&#25105;&#20204;&#37325;&#28857;&#20171;&#32461;&#20102;&#31995;&#32479;&#30340;&#32467;&#26500;&#21644;&#20803;&#29702;&#35770;&#23646;&#24615;&#65292;&#23588;&#20854;&#26159;&#33021;&#22815;&#30830;&#23450;&#21738;&#20123;&#39033;&#28436;&#21270;&#21644;&#36923;&#36753;&#35268;&#21017;&#24212;&#29992;&#26102;&#65292;&#35745;&#31639;&#20173;&#28982;&#26159;&#21487;&#20449;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we present the probabilistic typed natural deduction calculus TPTND, designed to reason about and derive trustworthiness properties of probabilistic computational processes, like those underlying current AI applications. Derivability in TPTND is interpreted as the process of extracting $n$ samples of possibly complex outputs with a certain frequency from a given categorical distribution. We formalize trust for such outputs as a form of hypothesis testing on the distance between such frequency and the intended probability. The main advantage of the calculus is to render such notion of trustworthiness checkable. We present a computational semantics for the terms over which we reason and then the semantics of TPTND, where logical operators as well as a Trust operator are defined through introduction and elimination rules. We illustrate structural and metatheoretical properties, with particular focus on the ability to establish under which term evolutions and logical rules ap
&lt;/p&gt;</description></item></channel></rss>