<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>DECIDER&#26159;&#19968;&#31181;&#21463;&#21452;&#31995;&#32479;&#35748;&#30693;&#29702;&#35770;&#21551;&#21457;&#30340;&#35268;&#21017;&#21487;&#25511;&#35299;&#30721;&#31574;&#30053;&#65292;&#36890;&#36807;&#22312;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#20013;&#24341;&#20837;&#36923;&#36753;&#25512;&#29702;&#22120;&#65292;&#26377;&#25928;&#22320;&#36981;&#24490;&#32473;&#23450;&#35268;&#21017;&#20197;&#24341;&#23548;&#29983;&#25104;&#26041;&#21521;&#26397;&#21521;&#30446;&#26631;&#12290;</title><link>https://arxiv.org/abs/2403.01954</link><description>&lt;p&gt;
DECIDERS&#65306;&#19968;&#31181;&#36890;&#36807;&#27169;&#20223;&#21452;&#31995;&#32479;&#35748;&#30693;&#29702;&#35770;&#23454;&#29616;&#35268;&#21017;&#21487;&#25511;&#35299;&#30721;&#31574;&#30053;&#30340;&#35821;&#35328;&#29983;&#25104;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DECIDER: A Rule-Controllable Decoding Strategy for Language Generation by Imitating Dual-System Cognitive Theory
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01954
&lt;/p&gt;
&lt;p&gt;
DECIDER&#26159;&#19968;&#31181;&#21463;&#21452;&#31995;&#32479;&#35748;&#30693;&#29702;&#35770;&#21551;&#21457;&#30340;&#35268;&#21017;&#21487;&#25511;&#35299;&#30721;&#31574;&#30053;&#65292;&#36890;&#36807;&#22312;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#20013;&#24341;&#20837;&#36923;&#36753;&#25512;&#29702;&#22120;&#65292;&#26377;&#25928;&#22320;&#36981;&#24490;&#32473;&#23450;&#35268;&#21017;&#20197;&#24341;&#23548;&#29983;&#25104;&#26041;&#21521;&#26397;&#21521;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35789;&#20856;&#32422;&#26463;&#35299;&#30721;&#26041;&#27861;&#26088;&#22312;&#36890;&#36807;&#26576;&#20123;&#30446;&#26631;&#27010;&#24565;&#25511;&#21046;&#25152;&#29983;&#25104;&#25991;&#26412;&#30340;&#24847;&#20041;&#25110;&#39118;&#26684;&#12290;&#29616;&#26377;&#26041;&#27861;&#36807;&#20110;&#20851;&#27880;&#36825;&#20123;&#30446;&#26631;&#26412;&#36523;&#65292;&#23548;&#33268;&#32570;&#20047;&#20851;&#20110;&#22914;&#20309;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#30340;&#39640;&#23618;&#25512;&#29702;&#12290;&#28982;&#32780;&#65292;&#20154;&#31867;&#36890;&#24120;&#36890;&#36807;&#36981;&#24490;&#26576;&#20123;&#35268;&#21017;&#26469;&#22788;&#29702;&#20219;&#21153;&#65292;&#36825;&#20123;&#35268;&#21017;&#19981;&#20165;&#20851;&#27880;&#20110;&#30446;&#26631;&#26412;&#36523;&#65292;&#36824;&#20851;&#27880;&#20110;&#24341;&#21457;&#30446;&#26631;&#21457;&#29983;&#30340;&#35821;&#20041;&#30456;&#20851;&#27010;&#24565;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;DECIDER&#65292;&#36825;&#26159;&#19968;&#31181;&#21463;&#21040;&#21452;&#31995;&#32479;&#35748;&#30693;&#29702;&#35770;&#21551;&#21457;&#30340;&#32422;&#26463;&#35821;&#35328;&#29983;&#25104;&#30340;&#35268;&#21017;&#21487;&#25511;&#35299;&#30721;&#31574;&#30053;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#22312;DECIDER&#20013;&#65292;&#19968;&#20010;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#65288;PLM&#65289;&#37197;&#22791;&#20102;&#19968;&#20010;&#36923;&#36753;&#25512;&#29702;&#22120;&#65292;&#20197;&#39640;&#23618;&#35268;&#21017;&#20316;&#20026;&#36755;&#20837;&#12290;&#28982;&#21518;&#65292;DECIDER&#20801;&#35768;&#35268;&#21017;&#20449;&#21495;&#22312;&#27599;&#20010;&#35299;&#30721;&#27493;&#39588;&#20013;&#27969;&#20837;PLM&#12290;&#24191;&#27867;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;DECIDER&#33021;&#22815;&#26377;&#25928;&#22320;&#36981;&#24490;&#32473;&#23450;&#30340;&#35268;&#21017;&#65292;&#24341;&#23548;&#29983;&#25104;&#26041;&#21521;&#26397;&#21521;&#30446;&#26631;&#36827;&#34892;&#29983;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01954v1 Announce Type: cross  Abstract: Lexicon-based constrained decoding approaches aim to control the meaning or style of the generated text through certain target concepts. Existing approaches over-focus the targets themselves, leading to a lack of high-level reasoning about how to achieve them. However, human usually tackles tasks by following certain rules that not only focuses on the targets but also on semantically relevant concepts that induce the occurrence of targets. In this work, we present DECIDER, a rule-controllable decoding strategy for constrained language generation inspired by dual-system cognitive theory. Specifically, in DECIDER, a pre-trained language model (PLM) is equiped with a logic reasoner that takes high-level rules as input. Then, the DECIDER allows rule signals to flow into the PLM at each decoding step. Extensive experimental results demonstrate that DECIDER can effectively follow given rules to guide generation direction toward the targets i
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25253;&#21578;&#20102;&#20851;&#20110;&#27491;&#24335;&#21270;&#26465;&#20214;&#25512;&#29702;&#30340;&#30740;&#31350;&#32467;&#26524;&#65292;&#21253;&#25324;Aqvist&#30340;&#26465;&#20214;&#20041;&#21153;&#31995;&#32479;E&#30340;&#26426;&#26800;&#21270;&#21644;&#20262;&#29702;&#35770;&#25454;&#35780;&#20272;&#30340;&#24037;&#20855;&#30340;&#24320;&#21457;&#12290;</title><link>http://arxiv.org/abs/2308.10686</link><description>&lt;p&gt;
&#24635;&#25324;&#33655;&#23572;&#33945;&#20307;&#31995;&#20316;&#20026;HOL&#30340;&#19968;&#20010;&#29255;&#27573;
&lt;/p&gt;
&lt;p&gt;
Normative Conditional Reasoning as a Fragment of HOL. (arXiv:2308.10686v2 [cs.LO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10686
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25253;&#21578;&#20102;&#20851;&#20110;&#27491;&#24335;&#21270;&#26465;&#20214;&#25512;&#29702;&#30340;&#30740;&#31350;&#32467;&#26524;&#65292;&#21253;&#25324;Aqvist&#30340;&#26465;&#20214;&#20041;&#21153;&#31995;&#32479;E&#30340;&#26426;&#26800;&#21270;&#21644;&#20262;&#29702;&#35770;&#25454;&#35780;&#20272;&#30340;&#24037;&#20855;&#30340;&#24320;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25253;&#21578;&#20102;&#20851;&#20110;&#27491;&#24335;&#21270;&#65288;&#22522;&#20110;&#20559;&#22909;&#30340;&#65289;&#26465;&#20214;&#25512;&#29702;&#30340;&#19968;&#20123;&#32467;&#26524;&#12290;&#25105;&#20204;&#20851;&#27880;&#30340;&#26159;Aqvist&#30340;&#26465;&#20214;&#20041;&#21153;&#31995;&#32479;E&#65288;&#21450;&#20854;&#25193;&#23637;&#65289;&#12290;&#25105;&#20204;&#36890;&#36807;Isabelle/HOL&#20013;&#30340;&#27973;&#34920;&#35821;&#20041;&#23884;&#20837;&#26469;&#23454;&#29616;&#25105;&#20204;&#30340;&#27491;&#24335;&#21270;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#35813;&#26694;&#26550;&#30340;&#20004;&#31181;&#21487;&#33021;&#29992;&#36884;&#12290;&#31532;&#19968;&#31181;&#26159;&#20316;&#20026;&#23545;&#25152;&#32771;&#34385;&#36923;&#36753;&#36827;&#34892;&#20803;&#25512;&#29702;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#23558;&#20854;&#29992;&#20110;&#33258;&#21160;&#39564;&#35777;&#26435;&#21033;&#20041;&#21153;&#23545;&#24212;&#20851;&#31995;&#65288;&#24191;&#20041;&#19978;&#29702;&#35299;&#65289;&#21450;&#30456;&#20851;&#20107;&#39033;&#65292;&#31867;&#20284;&#20110;&#20043;&#21069;&#23545;&#27169;&#24577;&#36923;&#36753;&#31435;&#26041;&#20307;&#25152;&#21462;&#24471;&#30340;&#25104;&#26524;&#12290;&#31532;&#20108;&#31181;&#29992;&#36884;&#26159;&#20316;&#20026;&#20262;&#29702;&#35770;&#25454;&#35780;&#20272;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20154;&#21475;&#20262;&#29702;&#23398;&#20013;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#24726;&#35770;Parfit&#30340;&#20196;&#20154;&#21388;&#24694;&#30340;&#32467;&#35770;&#30340;&#35745;&#31639;&#26426;&#32534;&#30721;&#12290;&#22914;&#20309;&#36890;&#36807;&#36825;&#20010;&#32534;&#30721;&#22686;&#21152;&#25110;&#20943;&#23569;&#20196;&#20154;&#21388;&#24694;&#30340;&#32467;&#35770;&#30340;&#21560;&#24341;&#21147;&#21644;&#35828;&#26381;&#21147;&#26159;&#19968;&#20010;&#25105;&#20204;&#24076;&#26395;&#21521;&#21746;&#23398;&#21644;&#20262;&#29702;&#23398;&#25552;&#20986;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We report some results regarding the mechanization of normative (preference-based) conditional reasoning. Our focus is on Aqvist's system E for conditional obligation (and its extensions). Our mechanization is achieved via a shallow semantical embedding in Isabelle/HOL. We consider two possible uses of the framework. The first one is as a tool for meta-reasoning about the considered logic. We employ it for the automated verification of deontic correspondences (broadly conceived) and related matters, analogous to what has been previously achieved for the modal logic cube. The second use is as a tool for assessing ethical arguments. We provide a computer encoding of a well-known paradox in population ethics, Parfit's repugnant conclusion. Whether the presented encoding increases or decreases the attractiveness and persuasiveness of the repugnant conclusion is a question we would like to pass on to philosophy and ethics.
&lt;/p&gt;</description></item></channel></rss>