<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#33539;&#30068;&#35770;&#35821;&#20041;&#30340;&#26041;&#27861;CatE&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#39640;&#25928;&#22320;&#23558;&#26412;&#20307;&#20844;&#29702;&#25237;&#24433;&#21040;&#22270;&#24418;&#20013;&#65292;&#24182;&#29983;&#25104;&#26412;&#20307;&#35770;&#30340;&#23884;&#20837;&#65292;&#20174;&#32780;&#22312;&#30693;&#35782;&#22270;&#35889;&#30340;&#38142;&#25509;&#39044;&#27979;&#20219;&#21153;&#19978;&#21462;&#24471;&#26356;&#22909;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2305.07163</link><description>&lt;p&gt;
CatE&#65306;&#20351;&#29992;&#33539;&#30068;&#35770;&#35821;&#20041;&#23884;&#20837;$\mathcal{ALC}$&#26412;&#20307;&#35770;
&lt;/p&gt;
&lt;p&gt;
CatE: Embedding $\mathcal{ALC}$ ontologies using category-theoretical semantics. (arXiv:2305.07163v1 [cs.LO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.07163
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#33539;&#30068;&#35770;&#35821;&#20041;&#30340;&#26041;&#27861;CatE&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#39640;&#25928;&#22320;&#23558;&#26412;&#20307;&#20844;&#29702;&#25237;&#24433;&#21040;&#22270;&#24418;&#20013;&#65292;&#24182;&#29983;&#25104;&#26412;&#20307;&#35770;&#30340;&#23884;&#20837;&#65292;&#20174;&#32780;&#22312;&#30693;&#35782;&#22270;&#35889;&#30340;&#38142;&#25509;&#39044;&#27979;&#20219;&#21153;&#19978;&#21462;&#24471;&#26356;&#22909;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19982;&#35821;&#20041;Web&#26412;&#20307;&#19968;&#36215;&#36827;&#34892;&#26426;&#22120;&#23398;&#20064;&#36981;&#24490;&#20960;&#20010;&#31574;&#30053;&#20043;&#19968;&#65292;&#20854;&#20013;&#21253;&#25324;&#23558;&#26412;&#20307;&#25237;&#24433;&#21040;&#22270;&#24418;&#32467;&#26500;&#20013;&#65292;&#24182;&#23558;&#22270;&#24418;&#23884;&#20837;&#25110;&#22522;&#20110;&#22270;&#24418;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#24212;&#29992;&#20110;&#29983;&#25104;&#30340;&#22270;&#24418;&#12290;&#24050;&#32463;&#24320;&#21457;&#20986;&#20102;&#20960;&#31181;&#23558;&#26412;&#20307;&#20844;&#29702;&#25237;&#24433;&#21040;&#22270;&#24418;&#20013;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#23427;&#20204;&#21487;&#20197;&#25237;&#24433;&#30340;&#20844;&#29702;&#31867;&#22411;&#65288;&#20840;&#38754;&#24615;&#65289;&#12289;&#23427;&#20204;&#26159;&#21542;&#21487;&#36870;&#65288;&#21333;&#23556;&#24615;&#65289;&#20197;&#21450;&#23427;&#20204;&#22914;&#20309;&#21033;&#29992;&#35821;&#20041;&#20449;&#24687;&#26041;&#38754;&#23384;&#22312;&#23616;&#38480;&#24615;&#12290;&#36825;&#20123;&#38480;&#21046;&#38480;&#21046;&#20102;&#23427;&#20204;&#21487;&#20197;&#24212;&#29992;&#30340;&#20219;&#21153;&#31867;&#22411;&#12290;&#36923;&#36753;&#35821;&#35328;&#30340;&#33539;&#30068;&#35770;&#35821;&#20041;&#20197;&#33539;&#30068;&#32780;&#19981;&#26159;&#38598;&#21512;&#30340;&#24418;&#24335;&#24418;&#24335;&#21270;&#35299;&#37322;&#65292;&#24182;&#19988;&#33539;&#30068;&#20855;&#26377;&#31867;&#20284;&#20110;&#22270;&#24418;&#30340;&#32467;&#26500;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;CatE&#65292;&#23427;&#20351;&#29992;$\mathcal{ALC}$&#25551;&#36848;&#36923;&#36753;&#30340;&#33539;&#30068;&#35770;&#20844;&#24335;&#26469;&#29983;&#25104;&#26412;&#20307;&#20844;&#29702;&#30340;&#22270;&#24418;&#34920;&#31034;&#12290;CatE&#25237;&#24433;&#20855;&#26377;&#20840;&#38754;&#24615;&#21644;&#21333;&#23556;&#24615;&#65292;&#22240;&#27492;&#20811;&#26381;&#20102;&#20854;&#20182;&#22522;&#20110;&#22270;&#24418;&#26412;&#20307;&#35770;&#30340;&#26041;&#27861;&#30340;&#38480;&#21046;&#12290;CatE&#36824;&#36890;&#36807;&#23558;$\mathcal{ALC}$&#30340;&#35821;&#27861;&#32534;&#30721;&#20026;&#19968;&#31181;&#33539;&#30068;&#26469;&#21033;&#29992;&#35821;&#20041;&#20449;&#24687;&#65292;&#36825;&#20351;&#25105;&#20204;&#33021;&#22815;&#20026;&#26412;&#20307;&#35770;&#29983;&#25104;&#23884;&#20837;&#12290;&#25105;&#20204;&#22312;&#30693;&#35782;&#22270;&#35889;&#30340;&#38142;&#25509;&#39044;&#27979;&#20219;&#21153;&#19978;&#35780;&#20272;&#20102;CatE&#65292;&#24182;&#34920;&#26126;&#23427;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning with Semantic Web ontologies follows several strategies, one of which involves projecting ontologies into graph structures and applying graph embeddings or graph-based machine learning methods to the resulting graphs. Several methods have been developed that project ontology axioms into graphs. However, these methods are limited in the type of axioms they can project (totality), whether they are invertible (injectivity), and how they exploit semantic information. These limitations restrict the kind of tasks to which they can be applied. Category-theoretical semantics of logic languages formalizes interpretations using categories instead of sets, and categories have a graph-like structure. We developed CatE, which uses the category-theoretical formulation of the semantics of the Description Logic $\mathcal{ALC}$ to generate a graph representation for ontology axioms. The CatE projection is total and injective, and therefore overcomes limitations of other graph-based ont
&lt;/p&gt;</description></item></channel></rss>