<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>FlexFringe&#25552;&#20379;&#20102;&#39640;&#25928;&#30340;&#27010;&#29575;&#26377;&#38480;&#33258;&#21160;&#26426;&#23398;&#20064;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#24314;&#27169;&#36719;&#20214;&#34892;&#20026;&#12290;&#35813;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#36890;&#36807;&#23454;&#29616;&#25913;&#36827;&#30340;&#29366;&#24577;&#21512;&#24182;&#31574;&#30053;&#23454;&#29616;&#20102;&#26174;&#33879;&#24615;&#33021;&#25552;&#21319;&#65292;&#24182;&#19988;&#33021;&#22815;&#20174;&#36719;&#20214;&#26085;&#24535;&#20013;&#23398;&#20064;&#21487;&#35299;&#37322;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#24322;&#24120;&#26816;&#27979;&#12290;&#19982;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#35299;&#20915;&#26041;&#26696;&#30456;&#27604;&#65292;&#23398;&#20064;&#26356;&#23567;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#33021;&#22815;&#25552;&#39640;FlexFringe&#22312;&#24322;&#24120;&#26816;&#27979;&#20013;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2203.16331</link><description>&lt;p&gt;
FlexFringe:&#36890;&#36807;&#23398;&#20064;&#27010;&#29575;&#26377;&#38480;&#33258;&#21160;&#26426;&#26469;&#24314;&#27169;&#36719;&#20214;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
FlexFringe: Modeling Software Behavior by Learning Probabilistic Automata. (arXiv:2203.16331v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.16331
&lt;/p&gt;
&lt;p&gt;
FlexFringe&#25552;&#20379;&#20102;&#39640;&#25928;&#30340;&#27010;&#29575;&#26377;&#38480;&#33258;&#21160;&#26426;&#23398;&#20064;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#24314;&#27169;&#36719;&#20214;&#34892;&#20026;&#12290;&#35813;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#36890;&#36807;&#23454;&#29616;&#25913;&#36827;&#30340;&#29366;&#24577;&#21512;&#24182;&#31574;&#30053;&#23454;&#29616;&#20102;&#26174;&#33879;&#24615;&#33021;&#25552;&#21319;&#65292;&#24182;&#19988;&#33021;&#22815;&#20174;&#36719;&#20214;&#26085;&#24535;&#20013;&#23398;&#20064;&#21487;&#35299;&#37322;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#24322;&#24120;&#26816;&#27979;&#12290;&#19982;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#35299;&#20915;&#26041;&#26696;&#30456;&#27604;&#65292;&#23398;&#20064;&#26356;&#23567;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#33021;&#22815;&#25552;&#39640;FlexFringe&#22312;&#24322;&#24120;&#26816;&#27979;&#20013;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;FlexFringe&#20013;&#21487;&#29992;&#30340;&#27010;&#29575;&#30830;&#23450;&#24615;&#26377;&#38480;&#33258;&#21160;&#26426;&#23398;&#20064;&#26041;&#27861;&#30340;&#39640;&#25928;&#23454;&#29616;&#12290;&#36825;&#20123;&#23454;&#29616;&#20102;&#20247;&#25152;&#21608;&#30693;&#30340;&#29366;&#24577;&#21512;&#24182;&#31574;&#30053;&#65292;&#21253;&#25324;&#20960;&#31181;&#20462;&#25913;&#20197;&#25552;&#39640;&#23427;&#20204;&#22312;&#23454;&#36341;&#20013;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#36825;&#20123;&#31639;&#27861;&#33021;&#22815;&#33719;&#24471;&#26377;&#31454;&#20105;&#21147;&#30340;&#32467;&#26524;&#65292;&#24182;&#22312;&#40664;&#35748;&#23454;&#29616;&#19978;&#23454;&#29616;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;FlexFringe&#20174;&#36719;&#20214;&#26085;&#24535;&#20013;&#23398;&#20064;&#21487;&#35299;&#37322;&#30340;&#27169;&#22411;&#65292;&#24182;&#23558;&#20854;&#29992;&#20110;&#24322;&#24120;&#26816;&#27979;&#12290;&#34429;&#28982;&#36825;&#20123;&#27169;&#22411;&#36739;&#38590;&#35299;&#37322;&#65292;&#20294;&#25105;&#20204;&#23637;&#31034;&#20102;&#23398;&#20064;&#26356;&#23567;&#12289;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#22914;&#20309;&#25552;&#39640;FlexFringe&#22312;&#24322;&#24120;&#26816;&#27979;&#20013;&#30340;&#24615;&#33021;&#65292;&#20248;&#20110;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#29616;&#26377;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present the efficient implementations of probabilistic deterministic finite automaton learning methods available in FlexFringe. These implement well-known strategies for state-merging including several modifications to improve their performance in practice. We show experimentally that these algorithms obtain competitive results and significant improvements over a default implementation. We also demonstrate how to use FlexFringe to learn interpretable models from software logs and use these for anomaly detection. Although less interpretable, we show that learning smaller more convoluted models improves the performance of FlexFringe on anomaly detection, outperforming an existing solution based on neural nets.
&lt;/p&gt;</description></item></channel></rss>