<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#24418;&#24335;&#36923;&#36753;&#20026;&#22522;&#30784;&#30340;&#31243;&#24207;&#21512;&#25104;&#21644;LLM&#20869;&#23481;&#29983;&#25104;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#26102;&#38388;&#27969;&#36923;&#36753;&#65288;TSL&#65289;&#23545;&#29983;&#25104;&#24335;&#20195;&#29702;&#26045;&#21152;&#26102;&#38388;&#32422;&#26463;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#20195;&#29702;&#34892;&#20026;&#30340;&#20445;&#35777;&#27700;&#24179;&#12289;&#31995;&#32479;&#30340;&#35299;&#37322;&#24615;&#21644;&#20195;&#29702;&#30340;&#27169;&#22359;&#21270;&#26500;&#24314;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.16905</link><description>&lt;p&gt;
&#21033;&#29992;&#21453;&#24212;&#21512;&#25104;&#23545;&#29983;&#25104;&#24335;&#20195;&#29702;&#34892;&#20026;&#26045;&#21152;&#26102;&#38388;&#32422;&#26463;
&lt;/p&gt;
&lt;p&gt;
Enforcing Temporal Constraints on Generative Agent Behavior with Reactive Synthesis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16905
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#24418;&#24335;&#36923;&#36753;&#20026;&#22522;&#30784;&#30340;&#31243;&#24207;&#21512;&#25104;&#21644;LLM&#20869;&#23481;&#29983;&#25104;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#26102;&#38388;&#27969;&#36923;&#36753;&#65288;TSL&#65289;&#23545;&#29983;&#25104;&#24335;&#20195;&#29702;&#26045;&#21152;&#26102;&#38388;&#32422;&#26463;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#20195;&#29702;&#34892;&#20026;&#30340;&#20445;&#35777;&#27700;&#24179;&#12289;&#31995;&#32479;&#30340;&#35299;&#37322;&#24615;&#21644;&#20195;&#29702;&#30340;&#27169;&#22359;&#21270;&#26500;&#24314;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30340;&#27969;&#34892;&#24341;&#21457;&#20102;&#23545;&#21019;&#24314;&#20132;&#20114;&#20195;&#29702;&#26032;&#26041;&#27861;&#30340;&#25506;&#32034;&#12290;&#28982;&#32780;&#65292;&#22312;&#20114;&#21160;&#36807;&#31243;&#20013;&#31649;&#29702;&#36825;&#20123;&#20195;&#29702;&#30340;&#26102;&#38388;&#34892;&#20026;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#24418;&#24335;&#36923;&#36753;&#20026;&#22522;&#30784;&#30340;&#31243;&#24207;&#21512;&#25104;&#19982;LLM&#20869;&#23481;&#29983;&#25104;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#20197;&#21019;&#24314;&#36981;&#23432;&#26102;&#38388;&#32422;&#26463;&#30340;&#29983;&#25104;&#24335;&#20195;&#29702;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;&#26102;&#38388;&#27969;&#36923;&#36753;&#65288;Temporal Stream Logic&#65292;TSL&#65289;&#29983;&#25104;&#19968;&#20010;&#33258;&#21160;&#26426;&#65292;&#23545;&#20195;&#29702;&#26045;&#21152;&#26102;&#38388;&#32467;&#26500;&#65292;&#24182;&#23558;&#27599;&#20010;&#21160;&#20316;&#30340;&#32454;&#33410;&#30041;&#32473;LLM&#12290;&#36890;&#36807;&#20351;&#29992;TSL&#65292;&#25105;&#20204;&#33021;&#22815;&#22686;&#24378;&#29983;&#25104;&#20195;&#29702;&#65292;&#20351;&#29992;&#25143;&#22312;&#34892;&#20026;&#19978;&#26377;&#26356;&#39640;&#30340;&#20445;&#35777;&#27700;&#24179;&#65292;&#31995;&#32479;&#26356;&#26131;&#35299;&#37322;&#65292;&#24182;&#19988;&#26356;&#33021;&#20197;&#27169;&#22359;&#21270;&#26041;&#24335;&#26500;&#24314;&#20195;&#29702;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#8230;&#8230;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16905v1 Announce Type: new  Abstract: The surge in popularity of Large Language Models (LLMs) has opened doors for new approaches to the creation of interactive agents. However, managing the temporal behavior of such agents over the course of an interaction remains challenging. The stateful, long-term horizon and quantitative reasoning required for coherent agent behavior does not fit well into the LLM paradigm. We propose a combination of formal logic-based program synthesis and LLM content generation to create generative agents that adhere to temporal constraints. Our approach uses Temporal Stream Logic (TSL) to generate an automaton that enforces a temporal structure on an agent and leaves the details of each action for a moment in time to an LLM. By using TSL, we are able to augment the generative agent where users have a higher level of guarantees on behavior, better interpretability of the system, and more ability to build agents in a modular way. We evaluate our appro
&lt;/p&gt;</description></item></channel></rss>