<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;Mathlib4&#30340;&#35821;&#20041;&#25628;&#32034;&#24341;&#25806;&#65292;&#33021;&#22815;&#25509;&#21463;&#38750;&#27491;&#24335;&#26597;&#35810;&#24182;&#25214;&#21040;&#30456;&#20851;&#23450;&#29702;&#65292;&#20026;&#35299;&#20915;&#22312;mathlib4&#20013;&#25628;&#32034;&#22256;&#38590;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.13310</link><description>&lt;p&gt;
&#19968;&#20010;&#29992;&#20110;Mathlib4&#30340;&#35821;&#20041;&#25628;&#32034;&#24341;&#25806;
&lt;/p&gt;
&lt;p&gt;
A Semantic Search Engine for Mathlib4
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13310
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;Mathlib4&#30340;&#35821;&#20041;&#25628;&#32034;&#24341;&#25806;&#65292;&#33021;&#22815;&#25509;&#21463;&#38750;&#27491;&#24335;&#26597;&#35810;&#24182;&#25214;&#21040;&#30456;&#20851;&#23450;&#29702;&#65292;&#20026;&#35299;&#20915;&#22312;mathlib4&#20013;&#25628;&#32034;&#22256;&#38590;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20132;&#20114;&#24335;&#23450;&#29702;&#35777;&#26126;&#22120;Lean&#20351;&#24471;&#21487;&#20197;&#39564;&#35777;&#27491;&#24335;&#25968;&#23398;&#35777;&#26126;&#65292;&#24182;&#19988;&#24471;&#21040;&#19968;&#20010;&#19981;&#26029;&#25193;&#22823;&#30340;&#31038;&#21306;&#30340;&#25903;&#25345;&#12290;&#35813;&#29983;&#24577;&#31995;&#32479;&#30340;&#26680;&#24515;&#26159;&#20854;&#25968;&#23398;&#24211;mathlib4&#65292;&#20026;&#25193;&#23637;&#33539;&#22260;&#30340;&#25968;&#23398;&#29702;&#35770;&#30340;&#24418;&#24335;&#21270;&#22880;&#23450;&#20102;&#22522;&#30784;&#12290;&#28982;&#32780;&#65292;&#22312;mathlib4&#20013;&#25628;&#32034;&#23450;&#29702;&#21487;&#33021;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#20026;&#20102;&#25104;&#21151;&#22312;mathlib4&#20013;&#25628;&#32034;&#65292;&#29992;&#25143;&#36890;&#24120;&#38656;&#35201;&#29087;&#24713;&#20854;&#21629;&#21517;&#32422;&#23450;&#25110;&#25991;&#26723;&#23383;&#31526;&#20018;&#12290;&#22240;&#27492;&#65292;&#21019;&#24314;&#19968;&#20010;&#35821;&#20041;&#25628;&#32034;&#24341;&#25806;&#65292;&#21487;&#20197;&#26041;&#20415;&#22320;&#34987;&#20855;&#26377;&#19981;&#21516;&#29087;&#24713;&#31243;&#24230;&#30340;mathlib4&#30340;&#20010;&#20154;&#20351;&#29992;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;mathlib4&#30340;&#35821;&#20041;&#25628;&#32034;&#24341;&#25806;&#65292;&#21487;&#20197;&#25509;&#21463;&#38750;&#27491;&#24335;&#26597;&#35810;&#24182;&#25214;&#21040;&#30456;&#20851;&#23450;&#29702;&#12290;&#25105;&#20204;&#36824;&#24314;&#31435;&#20102;&#19968;&#20010;&#29992;&#20110;&#35780;&#20272;&#21508;&#31181;mathlib4&#25628;&#32034;&#24341;&#25806;&#24615;&#33021;&#30340;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13310v1 Announce Type: cross  Abstract: The interactive theorem prover, Lean, enables the verification of formal mathematical proofs and is backed by an expanding community. Central to this ecosystem is its mathematical library, mathlib4, which lays the groundwork for the formalization of an expanding range of mathematical theories. However, searching for theorems in mathlib4 can be challenging. To successfully search in mathlib4, users often need to be familiar with its naming conventions or documentation strings. Therefore, creating a semantic search engine that can be used easily by individuals with varying familiarity with mathlib4 is very important. In this paper, we present a semantic search engine for mathlib4 that accepts informal queries and finds the relevant theorems. We also establish a benchmark for assessing the performance of various search engines for mathlib4.
&lt;/p&gt;</description></item></channel></rss>