<rss version="2.0"><channel><title>Chat Arxiv cs.LO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LO</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;Notation3&#19982;&#23384;&#22312;&#35268;&#21017;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#23558;&#37096;&#20998;Notation3&#30452;&#25509;&#26144;&#23556;&#21040;&#23384;&#22312;&#35268;&#21017;&#30340;&#26041;&#27861;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;Notation3&#25512;&#29702;&#30340;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2308.07332</link><description>&lt;p&gt;
Notation3&#20316;&#20026;&#19968;&#31181;&#23384;&#22312;&#35268;&#21017;&#35821;&#35328;
&lt;/p&gt;
&lt;p&gt;
Notation3 as an Existential Rule Language. (arXiv:2308.07332v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07332
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Notation3&#19982;&#23384;&#22312;&#35268;&#21017;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#23558;&#37096;&#20998;Notation3&#30452;&#25509;&#26144;&#23556;&#21040;&#23384;&#22312;&#35268;&#21017;&#30340;&#26041;&#27861;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;Notation3&#25512;&#29702;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Notation3&#36923;&#36753;&#65288;\nthree&#65289;&#26159;RDF&#30340;&#25193;&#23637;&#65292;&#20801;&#35768;&#29992;&#25143;&#32534;&#20889;&#24341;&#20837;&#26032;&#30340;&#31354;&#30333;&#33410;&#28857;&#21040;RDF&#22270;&#20013;&#30340;&#35268;&#21017;&#12290;&#35768;&#22810;&#24212;&#29992;&#31243;&#24207;&#65288;&#20363;&#22914;&#26412;&#20307;&#26144;&#23556;&#65289;&#20381;&#36182;&#20110;&#27492;&#21151;&#33021;&#65292;&#22240;&#20026;&#31354;&#30333;&#33410;&#28857;&#22312;Web&#19978;&#24191;&#27867;&#23384;&#22312;&#65292;&#30452;&#25509;&#20351;&#29992;&#25110;&#20316;&#20026;&#36741;&#21161;&#32467;&#26500;&#12290;&#28982;&#32780;&#65292;&#28085;&#30422;&#35813;&#36923;&#36753;&#38750;&#24120;&#37325;&#35201;&#21151;&#33021;&#30340;&#24555;&#36895;\nthree&#25512;&#29702;&#22120;&#30340;&#25968;&#37327;&#30456;&#23545;&#26377;&#38480;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#20687;VLog&#25110;Nemo&#20043;&#31867;&#30340;&#24341;&#25806;&#19981;&#30452;&#25509;&#25903;&#25345;&#35821;&#20041;Web&#35268;&#21017;&#26684;&#24335;&#65292;&#20294;&#26159;&#23427;&#20204;&#26159;&#20026;&#38750;&#24120;&#30456;&#20284;&#30340;&#26500;&#36896;&#65288;&#23384;&#22312;&#35268;&#21017;&#65289;&#24320;&#21457;&#21644;&#20248;&#21270;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#31354;&#30333;&#33410;&#28857;&#30340;\nthree&#35268;&#21017;&#19982;&#23384;&#22312;&#35268;&#21017;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20010;&#21487;&#20197;&#30452;&#25509;&#26144;&#23556;&#21040;&#23384;&#22312;&#35268;&#21017;&#30340;\nthree&#23376;&#38598;&#65292;&#24182;&#23450;&#20041;&#20102;&#36825;&#26679;&#19968;&#20010;&#26144;&#23556;&#65292;&#20445;&#25345;&#20102;\nthree&#20844;&#24335;&#30340;&#31561;&#20215;&#24615;&#12290;&#20026;&#20102;&#36827;&#19968;&#27493;&#35828;&#26126;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;\nthree&#25512;&#29702;&#21487;&#20197;&#21463;&#30410;&#20110;&#25105;&#20204;&#30340;&#36716;&#25442;&#65292;&#25105;&#20204;&#20351;&#29992;&#35813;&#26144;&#23556;&#36827;&#34892;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Notation3 Logic (\nthree) is an extension of RDF that allows the user to write rules introducing new blank nodes to RDF graphs. Many applications (e.g., ontology mapping) rely on this feature as blank nodes -- used directly or in auxiliary constructs -- are omnipresent on the Web. However, the number of fast \nthree reasoners covering this very important feature of the logic is rather limited. On the other hand, there are engines like VLog or Nemo which do not directly support Semantic Web rule formats but which are developed and optimized for very similar constructs: existential rules. In this paper, we investigate the relation between \nthree rules with blank nodes in their heads and existential rules. We identify a subset of \nthree which can be mapped directly to existential rules and define such a mapping preserving the equivalence of \nthree formulae. In order to also illustrate that in some cases \nthree reasoning could benefit from our translation, we then employ this mapping i
&lt;/p&gt;</description></item></channel></rss>