<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#23558;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#21644;&#21608;&#22260;&#29615;&#22659;&#35270;&#20026;&#20849;&#21516;&#28436;&#21270;&#30340;&#31995;&#32479;&#65292;&#25552;&#20986;&#26234;&#33021;&#20307;-&#29615;&#22659;&#21327;&#21516;&#20248;&#21270;&#38382;&#39064;&#24182;&#24320;&#21457;&#21327;&#35843;&#31639;&#27861;&#65292;&#20197;&#25913;&#36827;&#21435;&#20013;&#24515;&#21270;&#22810;&#26234;&#33021;&#20307;&#23548;&#33322;&#34920;&#29616;&#12290;</title><link>https://arxiv.org/abs/2403.14583</link><description>&lt;p&gt;
&#20026;&#21435;&#20013;&#24515;&#21270;&#22810;&#26234;&#33021;&#20307;&#23548;&#33322;&#30340;&#29615;&#22659;&#21644;&#25919;&#31574;&#36827;&#34892;&#21327;&#21516;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Co-Optimization of Environment and Policies for Decentralized Multi-Agent Navigation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14583
&lt;/p&gt;
&lt;p&gt;
&#23558;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#21644;&#21608;&#22260;&#29615;&#22659;&#35270;&#20026;&#20849;&#21516;&#28436;&#21270;&#30340;&#31995;&#32479;&#65292;&#25552;&#20986;&#26234;&#33021;&#20307;-&#29615;&#22659;&#21327;&#21516;&#20248;&#21270;&#38382;&#39064;&#24182;&#24320;&#21457;&#21327;&#35843;&#31639;&#27861;&#65292;&#20197;&#25913;&#36827;&#21435;&#20013;&#24515;&#21270;&#22810;&#26234;&#33021;&#20307;&#23548;&#33322;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#23558;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#21450;&#20854;&#21608;&#22260;&#29615;&#22659;&#35270;&#20026;&#19968;&#20010;&#20849;&#21516;&#28436;&#21270;&#30340;&#31995;&#32479;&#65292;&#20854;&#20013;&#19968;&#20010;&#30340;&#34892;&#20026;&#20250;&#24433;&#21709;&#21478;&#19968;&#20010;&#12290;&#20854;&#30446;&#26631;&#26159;&#23558;&#26234;&#33021;&#20307;&#34892;&#20026;&#21644;&#29615;&#22659;&#37197;&#32622;&#37117;&#35270;&#20026;&#20915;&#31574;&#21464;&#37327;&#65292;&#24182;&#20197;&#21327;&#35843;&#30340;&#26041;&#24335;&#20248;&#21270;&#36825;&#20004;&#20010;&#32452;&#20214;&#65292;&#20197;&#25913;&#36827;&#26576;&#20123;&#24863;&#20852;&#36259;&#30340;&#24230;&#37327;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#25317;&#25380;&#29615;&#22659;&#20013;&#30340;&#21435;&#20013;&#24515;&#21270;&#22810;&#26234;&#33021;&#20307;&#23548;&#33322;&#38382;&#39064;&#12290;&#36890;&#36807;&#24341;&#20837;&#22810;&#26234;&#33021;&#20307;&#23548;&#33322;&#21644;&#29615;&#22659;&#20248;&#21270;&#30340;&#20004;&#20010;&#23376;&#30446;&#26631;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#8220;&#26234;&#33021;&#20307;-&#29615;&#22659;&#21327;&#21516;&#20248;&#21270;&#8221;&#38382;&#39064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#8220;&#21327;&#35843;&#31639;&#27861;&#8221;&#65292;&#22312;&#36825;&#20004;&#20010;&#23376;&#30446;&#26631;&#20043;&#38388;&#20132;&#26367;&#20197;&#23547;&#25214;&#26234;&#33021;&#20307;&#34892;&#20026;&#21644;&#38556;&#30861;&#29289;&#29615;&#22659;&#37197;&#32622;&#30340;&#26368;&#20339;&#32508;&#21512;&#65307;&#26368;&#32456;&#25552;&#39640;&#20102;&#23548;&#33322;&#24615;&#33021;&#12290;&#30001;&#20110;&#26126;&#30830;&#24314;&#27169;&#26234;&#33021;&#20307;&#12289;&#29615;&#22659;&#21644;&#24615;&#33021;&#20043;&#38388;&#20851;&#31995;&#30340;&#25361;&#25112;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14583v1 Announce Type: cross  Abstract: This work views the multi-agent system and its surrounding environment as a co-evolving system, where the behavior of one affects the other. The goal is to take both agent actions and environment configurations as decision variables, and optimize these two components in a coordinated manner to improve some measure of interest. Towards this end, we consider the problem of decentralized multi-agent navigation in cluttered environments. By introducing two sub-objectives of multi-agent navigation and environment optimization, we propose an $\textit{agent-environment co-optimization}$ problem and develop a $\textit{coordinated algorithm}$ that alternates between these sub-objectives to search for an optimal synthesis of agent actions and obstacle configurations in the environment; ultimately, improving the navigation performance. Due to the challenge of explicitly modeling the relation between agents, environment and performance, we leverag
&lt;/p&gt;</description></item></channel></rss>