<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;EDGE&#30340;&#26032;&#39062;&#30340;&#22522;&#20110;&#22270;&#30340;&#24773;&#24863;&#22686;&#24378;&#22810;&#27169;&#24577;&#35773;&#21050;&#35299;&#37322;&#26694;&#26550;&#65292;&#26088;&#22312;&#20026;&#28041;&#21450;&#22810;&#31181;&#27169;&#24577;&#30340;&#35773;&#21050;&#23545;&#35805;&#29983;&#25104;&#33258;&#28982;&#35821;&#35328;&#35299;&#37322;&#12290;&#35813;&#26694;&#26550;&#20811;&#26381;&#20102;&#35805;&#35821;&#35760;&#21495;&#23545;&#24773;&#24863;&#30340;&#22810;&#26679;&#25928;&#24212;&#12289;&#35270;&#39057;&#38899;&#39057;&#24773;&#24863;&#20449;&#21495;&#19982;BART&#23884;&#20837;&#31354;&#38388;&#20043;&#38388;&#30340;&#24046;&#36317;&#20197;&#21450;&#35805;&#35821;&#12289;&#35805;&#35821;&#24773;&#24863;&#21644;&#35270;&#39057;&#38899;&#39057;&#24773;&#24863;&#20043;&#38388;&#30340;&#19981;&#21516;&#20851;&#31995;&#31561;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2402.03658</link><description>&lt;p&gt;
&#22312;&#23545;&#35805;&#20013;&#22686;&#24378;&#24773;&#24863;&#30340;&#22522;&#20110;&#22270;&#30340;&#35773;&#21050;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Sentiment-enhanced Graph-based Sarcasm Explanation in Dialogue
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03658
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;EDGE&#30340;&#26032;&#39062;&#30340;&#22522;&#20110;&#22270;&#30340;&#24773;&#24863;&#22686;&#24378;&#22810;&#27169;&#24577;&#35773;&#21050;&#35299;&#37322;&#26694;&#26550;&#65292;&#26088;&#22312;&#20026;&#28041;&#21450;&#22810;&#31181;&#27169;&#24577;&#30340;&#35773;&#21050;&#23545;&#35805;&#29983;&#25104;&#33258;&#28982;&#35821;&#35328;&#35299;&#37322;&#12290;&#35813;&#26694;&#26550;&#20811;&#26381;&#20102;&#35805;&#35821;&#35760;&#21495;&#23545;&#24773;&#24863;&#30340;&#22810;&#26679;&#25928;&#24212;&#12289;&#35270;&#39057;&#38899;&#39057;&#24773;&#24863;&#20449;&#21495;&#19982;BART&#23884;&#20837;&#31354;&#38388;&#20043;&#38388;&#30340;&#24046;&#36317;&#20197;&#21450;&#35805;&#35821;&#12289;&#35805;&#35821;&#24773;&#24863;&#21644;&#35270;&#39057;&#38899;&#39057;&#24773;&#24863;&#20043;&#38388;&#30340;&#19981;&#21516;&#20851;&#31995;&#31561;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#35805;&#20013;&#30340;&#35773;&#21050;&#35299;&#37322;&#65288;SED&#65289;&#26159;&#19968;&#39033;&#26032;&#32780;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#65292;&#26088;&#22312;&#20026;&#28041;&#21450;&#22810;&#31181;&#27169;&#24577;&#65288;&#21363;&#35805;&#35821;&#12289;&#35270;&#39057;&#21644;&#38899;&#39057;&#65289;&#30340;&#35773;&#21050;&#23545;&#35805;&#29983;&#25104;&#33258;&#28982;&#35821;&#35328;&#35299;&#37322;&#12290;&#23613;&#31649;&#29616;&#26377;&#30340;&#30740;&#31350;&#22522;&#20110;&#29983;&#25104;&#24335;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;BART&#21462;&#24471;&#20102;&#24040;&#22823;&#25104;&#21151;&#65292;&#20294;&#23427;&#20204;&#24573;&#35270;&#20102;&#35805;&#35821;&#12289;&#35270;&#39057;&#21644;&#38899;&#39057;&#20013;&#23384;&#22312;&#30340;&#24773;&#24863;&#65292;&#32780;&#36825;&#20123;&#24773;&#24863;&#26159;&#35773;&#21050;&#35299;&#37322;&#20013;&#30340;&#37325;&#35201;&#32447;&#32034;&#12290;&#20107;&#23454;&#19978;&#65292;&#30001;&#20110;&#20197;&#19979;&#19977;&#20010;&#20027;&#35201;&#25361;&#25112;&#65306;1&#65289;&#35805;&#35821;&#35760;&#21495;&#23545;&#24773;&#24863;&#30340;&#22810;&#26679;&#25928;&#24212;&#65307;2&#65289;&#35270;&#39057;&#38899;&#39057;&#24773;&#24863;&#20449;&#21495;&#19982;BART&#30340;&#23884;&#20837;&#31354;&#38388;&#20043;&#38388;&#30340;&#24046;&#36317;&#65307;3&#65289;&#35805;&#35821;&#12289;&#35805;&#35821;&#24773;&#24863;&#21644;&#35270;&#39057;&#38899;&#39057;&#24773;&#24863;&#20043;&#38388;&#30340;&#19981;&#21516;&#20851;&#31995;&#65292;&#23558;&#24773;&#24863;&#34701;&#20837;&#20197;&#25552;&#21319;SED&#24615;&#33021;&#26159;&#19968;&#39033;&#38750;&#24120;&#22797;&#26434;&#30340;&#20219;&#21153;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#22270;&#30340;&#22686;&#24378;&#24773;&#24863;&#30340;&#22810;&#27169;&#24577;&#35773;&#21050;&#35299;&#37322;&#26694;&#26550;&#65292;&#21629;&#21517;&#20026;EDGE&#12290;
&lt;/p&gt;
&lt;p&gt;
Sarcasm Explanation in Dialogue (SED) is a new yet challenging task, which aims to generate a natural language explanation for the given sarcastic dialogue that involves multiple modalities (i.e., utterance, video, and audio). Although existing studies have achieved great success based on the generative pretrained language model BART, they overlook exploiting the sentiments residing in the utterance, video and audio, which are vital clues for sarcasm explanation. In fact, it is non-trivial to incorporate sentiments for boosting SED performance, due to three main challenges: 1) diverse effects of utterance tokens on sentiments; 2) gap between video-audio sentiment signals and the embedding space of BART; and 3) various relations among utterances, utterance sentiments, and video-audio sentiments. To tackle these challenges, we propose a novel sEntiment-enhanceD Graph-based multimodal sarcasm Explanation framework, named EDGE. In particular, we first propose a lexicon-guided utterance sen
&lt;/p&gt;</description></item></channel></rss>