<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38480;&#21046;&#25968;&#25454;&#19979;&#31038;&#20132;&#26426;&#22120;&#23398;&#20064;&#30340;&#27010;&#29575;&#35823;&#24046;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24378;&#30340;&#19968;&#33268;&#24615;&#35757;&#32451;&#26465;&#20214;&#65292;&#25512;&#23548;&#20986;&#20102;&#20004;&#31181;&#20219;&#21153;&#30340;&#27010;&#29575;&#35823;&#24046;&#19978;&#30028;&#12290;</title><link>http://arxiv.org/abs/2306.09397</link><description>&lt;p&gt;
&#38480;&#21046;&#25968;&#25454;&#19979;&#31038;&#20132;&#26426;&#22120;&#23398;&#20064;&#30340;&#38750;&#28176;&#36827;&#24615;&#33021;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Non-Asymptotic Performance of Social Machine Learning Under Limited Data. (arXiv:2306.09397v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09397
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38480;&#21046;&#25968;&#25454;&#19979;&#31038;&#20132;&#26426;&#22120;&#23398;&#20064;&#30340;&#27010;&#29575;&#35823;&#24046;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24378;&#30340;&#19968;&#33268;&#24615;&#35757;&#32451;&#26465;&#20214;&#65292;&#25512;&#23548;&#20986;&#20102;&#20004;&#31181;&#20219;&#21153;&#30340;&#27010;&#29575;&#35823;&#24046;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31038;&#20132;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#20013;&#19982;&#38169;&#35823;&#27010;&#29575;&#30456;&#20851;&#30340;&#38382;&#39064;&#65292;&#35813;&#26694;&#26550;&#28041;&#21450;&#29420;&#31435;&#30340;&#35757;&#32451;&#38454;&#27573;&#65292;&#38543;&#21518;&#22312;&#22270;&#19978;&#36827;&#34892;&#21327;&#20316;&#20915;&#31574;&#38454;&#27573;&#12290;&#35813;&#26694;&#26550;&#35299;&#20915;&#20102;&#20998;&#24067;&#24335;&#20998;&#31867;&#26410;&#26631;&#35760;&#25968;&#25454;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#31181;&#20998;&#31867;&#20219;&#21153;&#65292;&#20998;&#21035;&#20026;&#32479;&#35745;&#20998;&#31867;&#21644;&#21333;&#26679;&#26412;&#20998;&#31867;&#65292;&#21516;&#26102;&#32771;&#34385;&#20102;&#39044;&#27979;&#38454;&#27573;&#25968;&#25454;&#35266;&#27979;&#21463;&#38480;&#30340;&#24773;&#20917;&#12290;&#23545;&#20110;&#27599;&#20010;&#20219;&#21153;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#20998;&#24067;&#24335;&#23398;&#20064;&#35268;&#21017;&#65292;&#24182;&#30456;&#24212;&#20998;&#26512;&#20102;&#38169;&#35823;&#27010;&#29575;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#39318;&#20808;&#24341;&#20837;&#20102;&#19968;&#20010;&#26356;&#24378;&#30340;&#19968;&#33268;&#24615;&#35757;&#32451;&#26465;&#20214;&#65292;&#35813;&#26465;&#20214;&#28041;&#21450;&#35757;&#32451;&#20998;&#31867;&#22120;&#29983;&#25104;&#30340;&#36793;&#32536;&#20998;&#24067;&#12290;&#22522;&#20110;&#27492;&#26465;&#20214;&#65292;&#25105;&#20204;&#20026;&#20004;&#31181;&#20219;&#21153;&#25512;&#23548;&#20986;&#20102;&#27010;&#29575;&#35823;&#24046;&#30340;&#19978;&#30028;&#65292;&#35813;&#19978;&#30028;&#21462;&#20915;&#20110;&#25968;&#25454;&#30340;&#32479;&#35745;&#29305;&#24615;&#21644;&#29992;&#20110;&#32452;&#21512;&#20998;&#24067;&#24335;&#20998;&#31867;&#22120;&#30340;&#32452;&#21512;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the probability of error associated with the social machine learning framework, which involves an independent training phase followed by a cooperative decision-making phase over a graph. This framework addresses the problem of classifying a stream of unlabeled data in a distributed manner. We consider two kinds of classification tasks with limited observations in the prediction phase, namely, the statistical classification task and the single-sample classification task. For each task, we describe the distributed learning rule and analyze the probability of error accordingly. To do so, we first introduce a stronger consistent training condition that involves the margin distributions generated by the trained classifiers. Based on this condition, we derive an upper bound on the probability of error for both tasks, which depends on the statistical properties of the data and the combination policy used to combine the distributed classifiers. For the statistical classifica
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#20998;&#25955;&#24335;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#36710;&#32852;&#32593;&#26381;&#21153;&#25552;&#20379;&#20013;&#30340;&#20219;&#21153;&#37096;&#32626;&#21644;&#36793;&#32536;&#36164;&#28304;&#30340;&#25193;&#23637;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.09832</link><description>&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#36793;&#32536;&#36164;&#28304;&#20219;&#21153;&#37096;&#32626;&#21644;&#25193;&#23637;&#26041;&#27861;&#29992;&#20110;&#36710;&#36733;&#32593;&#32476;&#26381;&#21153;&#25552;&#20379;
&lt;/p&gt;
&lt;p&gt;
A Deep RL Approach on Task Placement and Scaling of Edge Resources for Cellular Vehicle-to-Network Service Provisioning. (arXiv:2305.09832v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09832
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#20998;&#25955;&#24335;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#36710;&#32852;&#32593;&#26381;&#21153;&#25552;&#20379;&#20013;&#30340;&#20219;&#21153;&#37096;&#32626;&#21644;&#36793;&#32536;&#36164;&#28304;&#30340;&#25193;&#23637;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#8220;&#36710;&#32852;&#32593;&#8221;&#27491;&#22788;&#20110;&#25105;&#20204;&#31038;&#20250;&#25968;&#23383;&#21270;&#36716;&#22411;&#30340;&#21069;&#27839;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#25955;&#24335;&#26041;&#27861;&#29992;&#20110;&#25552;&#20379;&#36710;&#36742;&#36890;&#32852;&#32593;&#65288;C-V2N&#65289;&#26381;&#21153;&#65292;&#35299;&#20915;&#26381;&#21153;&#20219;&#21153;&#37096;&#32626;&#21644;&#36793;&#32536;&#36164;&#28304;&#30340;&#25193;&#23637;&#38382;&#39064;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20010;&#32852;&#21512;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#20010;&#38382;&#39064;&#30340;&#32852;&#25509;&#26041;&#24335;&#65292;&#37319;&#29992;&#20102;&#22522;&#20110;&#36138;&#24515;&#31639;&#27861;&#30340;&#20851;&#20110;&#20219;&#21153;&#37096;&#32626;&#30340;&#26041;&#27861;&#21644;&#22522;&#20110; Deep Deterministic Policy Gradient (DDPG) &#30340;&#25193;&#23637;&#26041;&#27861;&#12290;&#26412;&#25991;&#36824;&#23545;&#25105;&#20204;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#22522;&#20934;&#27979;&#35797;&#65292;&#37325;&#28857;&#20851;&#27880;&#20102;&#25193;&#23637;&#20195;&#29702;&#19982;&#22810;&#20010;&#29366;&#24577;&#19979;&#26368;&#20808;&#36827;&#30340;&#25193;&#23637;&#26041;&#27861;&#30340;&#24615;&#33021;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cellular-Vehicle-to-Everything (C-V2X) is currently at the forefront of the digital transformation of our society. By enabling vehicles to communicate with each other and with the traffic environment using cellular networks, we redefine transportation, improving road safety and transportation services, increasing efficiency of traffic flows, and reducing environmental impact. This paper proposes a decentralized approach for provisioning Cellular Vehicular-to-Network (C-V2N) services, addressing the coupled problems of service task placement and scaling of edge resources. We formalize the joint problem and prove its complexity. We propose an approach to tackle it, linking the two problems, employing decentralized decision-making using (i) a greedy approach for task placement and (ii) a Deep Deterministic Policy Gradient (DDPG) based approach for scaling. We benchmark the performance of our approach, focusing on the scaling agent, against several State-of-the-Art (SoA) scaling approaches
&lt;/p&gt;</description></item></channel></rss>