<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#30340;&#28508;&#22312;&#26102;&#38388;&#31232;&#30095;&#21327;&#35843;&#22270;&#65292;&#33021;&#22815;&#26377;&#25928;&#22788;&#29702;&#26234;&#33021;&#20307;&#20043;&#38388;&#30340;&#21327;&#20316;&#20851;&#31995;&#24182;&#21033;&#29992;&#21382;&#21490;&#35266;&#27979;&#26469;&#36827;&#34892;&#30693;&#35782;&#20132;&#25442;</title><link>https://arxiv.org/abs/2403.19253</link><description>&lt;p&gt;
&#25512;&#26029;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#30340;&#28508;&#22312;&#26102;&#38388;&#31232;&#30095;&#21327;&#35843;&#22270;
&lt;/p&gt;
&lt;p&gt;
Inferring Latent Temporal Sparse Coordination Graph for Multi-Agent Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19253
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#30340;&#28508;&#22312;&#26102;&#38388;&#31232;&#30095;&#21327;&#35843;&#22270;&#65292;&#33021;&#22815;&#26377;&#25928;&#22788;&#29702;&#26234;&#33021;&#20307;&#20043;&#38388;&#30340;&#21327;&#20316;&#20851;&#31995;&#24182;&#21033;&#29992;&#21382;&#21490;&#35266;&#27979;&#26469;&#36827;&#34892;&#30693;&#35782;&#20132;&#25442;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#25928;&#30340;&#26234;&#33021;&#20307;&#21327;&#35843;&#23545;&#20110;&#21512;&#20316;&#24335;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;(MARL)&#33267;&#20851;&#37325;&#35201;&#12290;&#24403;&#21069;MARL&#20013;&#30340;&#22270;&#23398;&#20064;&#26041;&#27861;&#23616;&#38480;&#24615;&#36739;&#22823;&#65292;&#20165;&#20165;&#20381;&#36182;&#19968;&#27493;&#35266;&#23519;&#65292;&#24573;&#30053;&#20102;&#37325;&#35201;&#30340;&#21382;&#21490;&#32463;&#39564;&#65292;&#23548;&#33268;&#29983;&#25104;&#30340;&#22270;&#23384;&#22312;&#32570;&#38519;&#65292;&#20419;&#36827;&#20102;&#20887;&#20313;&#25110;&#26377;&#23475;&#20449;&#24687;&#20132;&#25442;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25512;&#26029;&#29992;&#20110;MARL&#30340;&#28508;&#22312;&#26102;&#38388;&#31232;&#30095;&#21327;&#35843;&#22270;&#65288;LTS-CG&#65289;&#12290;LTS-CG&#21033;&#29992;&#26234;&#33021;&#20307;&#30340;&#21382;&#21490;&#35266;&#27979;&#26469;&#35745;&#31639;&#26234;&#33021;&#20307;&#23545;&#27010;&#29575;&#30697;&#38453;&#65292;&#20174;&#20013;&#25277;&#21462;&#31232;&#30095;&#22270;&#24182;&#29992;&#20110;&#26234;&#33021;&#20307;&#20043;&#38388;&#30340;&#30693;&#35782;&#20132;&#25442;&#65292;&#20174;&#32780;&#21516;&#26102;&#25429;&#25417;&#26234;&#33021;&#20307;&#30340;&#20381;&#36182;&#20851;&#31995;&#21644;&#20851;&#31995;&#19981;&#30830;&#23450;&#24615;&#12290;&#35813;&#36807;&#31243;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#20165;&#19982;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19253v1 Announce Type: new  Abstract: Effective agent coordination is crucial in cooperative Multi-Agent Reinforcement Learning (MARL). While agent cooperation can be represented by graph structures, prevailing graph learning methods in MARL are limited. They rely solely on one-step observations, neglecting crucial historical experiences, leading to deficient graphs that foster redundant or detrimental information exchanges. Additionally, high computational demands for action-pair calculations in dense graphs impede scalability. To address these challenges, we propose inferring a Latent Temporal Sparse Coordination Graph (LTS-CG) for MARL. The LTS-CG leverages agents' historical observations to calculate an agent-pair probability matrix, where a sparse graph is sampled from and used for knowledge exchange between agents, thereby simultaneously capturing agent dependencies and relation uncertainty. The computational complexity of this procedure is only related to the number o
&lt;/p&gt;</description></item></channel></rss>