<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#20013;&#30340;&#30693;&#35782;&#31561;&#20215;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#27169;&#22411;&#19982;&#29289;&#29702;&#31995;&#32479;&#20043;&#38388;&#21516;&#27493;&#30693;&#35782;&#30340;&#26032;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2204.07481</link><description>&lt;p&gt;
&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#20013;&#30340;&#30693;&#35782;&#31561;&#20215;&#24615;
&lt;/p&gt;
&lt;p&gt;
Knowledge Equivalence in Digital Twins of Intelligent Systems. (arXiv:2204.07481v2 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.07481
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#20013;&#30340;&#30693;&#35782;&#31561;&#20215;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#27169;&#22411;&#19982;&#29289;&#29702;&#31995;&#32479;&#20043;&#38388;&#21516;&#27493;&#30693;&#35782;&#30340;&#26032;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#21253;&#21547;&#20102;&#23545;&#25152;&#30740;&#31350;&#30340;&#29289;&#29702;&#19990;&#30028;&#36827;&#34892;&#23454;&#26102;&#25968;&#25454;&#39537;&#21160;&#24314;&#27169;&#30340;&#27169;&#22411;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#27169;&#25311;&#26469;&#20248;&#21270;&#29289;&#29702;&#19990;&#30028;&#12290;&#28982;&#32780;&#65292;&#25968;&#23383;&#23402;&#29983;&#25152;&#20570;&#30340;&#20998;&#26512;&#21482;&#26377;&#22312;&#27169;&#22411;&#19982;&#23454;&#38469;&#29289;&#29702;&#19990;&#30028;&#31561;&#20215;&#30340;&#24773;&#20917;&#19979;&#25165;&#26159;&#26377;&#25928;&#21644;&#21487;&#38752;&#30340;&#12290;&#22312;&#29289;&#29702;&#31995;&#32479;&#26159;&#26234;&#33021;&#21644;&#33258;&#20027;&#30340;&#24773;&#20917;&#19979;&#65292;&#20445;&#25345;&#36825;&#26679;&#19968;&#20010;&#31561;&#20215;&#27169;&#22411;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#29305;&#21035;&#20851;&#27880;&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#27169;&#22411;&#65292;&#20854;&#20013;&#31995;&#32479;&#20855;&#26377;&#30693;&#35782;&#24863;&#30693;&#33021;&#21147;&#20294;&#33021;&#21147;&#26377;&#38480;&#12290;&#25968;&#23383;&#23402;&#29983;&#36890;&#36807;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#31215;&#32047;&#26356;&#22810;&#30693;&#35782;&#65292;&#20174;&#20803;&#23618;&#38754;&#19978;&#25913;&#36827;&#20102;&#29289;&#29702;&#31995;&#32479;&#30340;&#34892;&#20026;&#12290;&#22312;&#34394;&#25311;&#31354;&#38388;&#20013;&#22797;&#21046;&#36825;&#26679;&#19968;&#20010;&#26234;&#33021;&#29289;&#29702;&#31995;&#32479;&#30340;&#30693;&#35782;&#24863;&#30693;&#33021;&#21147;&#38656;&#35201;&#37319;&#29992;&#26032;&#39062;&#30340;&#31561;&#20215;&#24615;&#32500;&#25252;&#25216;&#26415;&#65292;&#29305;&#21035;&#26159;&#22312;&#27169;&#22411;&#19982;&#29289;&#29702;&#31995;&#32479;&#20043;&#38388;&#21516;&#27493;&#30693;&#35782;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#30693;&#35782;&#31561;&#20215;&#24615;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
A digital twin contains up-to-date data-driven models of the physical world being studied and can use simulation to optimise the physical world. However, the analysis made by the digital twin is valid and reliable only when the model is equivalent to the physical world. Maintaining such an equivalent model is challenging, especially when the physical systems being modelled are intelligent and autonomous. The paper focuses in particular on digital twin models of intelligent systems where the systems are knowledge-aware but with limited capability. The digital twin improves the acting of the physical system at a meta-level by accumulating more knowledge in the simulated environment. The modelling of such an intelligent physical system requires replicating the knowledge-awareness capability in the virtual space. Novel equivalence maintaining techniques are needed, especially in synchronising the knowledge between the model and the physical system. This paper proposes the notion of knowled
&lt;/p&gt;</description></item></channel></rss>