<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>MIntRec2.0&#20171;&#32461;&#20102;&#19968;&#20010;&#26088;&#22312;&#35299;&#20915;&#22810;&#27169;&#24577;&#24847;&#22270;&#35782;&#21035;&#21644;&#23545;&#35805;&#20013;&#22330;&#22806;&#26816;&#27979;&#25361;&#25112;&#30340;&#22823;&#35268;&#27169;&#22522;&#20934;&#25968;&#25454;&#38598;&#12290;&#35813;&#25968;&#25454;&#38598;&#21253;&#21547;30&#20010;&#32454;&#31890;&#24230;&#31867;&#21035;&#30340;1,245&#20010;&#23545;&#35805;&#21644;15,040&#20010;&#26679;&#26412;&#65292;&#20854;&#20013;&#21253;&#25324;&#36924;&#30495;&#30340;&#22330;&#22806;&#26679;&#26412;&#65292;&#24182;&#20016;&#23500;&#20102;&#21457;&#35328;&#32773;&#20449;&#24687;&#20197;&#25903;&#25345;&#22810;&#26041;&#23545;&#35805;&#30740;&#31350;&#12290;</title><link>https://arxiv.org/abs/2403.10943</link><description>&lt;p&gt;
MIntRec2.0&#65306;&#29992;&#20110;&#22810;&#27169;&#24577;&#24847;&#22270;&#35782;&#21035;&#21644;&#23545;&#35805;&#20013;&#22330;&#22806;&#26816;&#27979;&#30340;&#22823;&#35268;&#27169;&#22522;&#20934;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
MIntRec2.0: A Large-scale Benchmark Dataset for Multimodal Intent Recognition and Out-of-scope Detection in Conversations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10943
&lt;/p&gt;
&lt;p&gt;
MIntRec2.0&#20171;&#32461;&#20102;&#19968;&#20010;&#26088;&#22312;&#35299;&#20915;&#22810;&#27169;&#24577;&#24847;&#22270;&#35782;&#21035;&#21644;&#23545;&#35805;&#20013;&#22330;&#22806;&#26816;&#27979;&#25361;&#25112;&#30340;&#22823;&#35268;&#27169;&#22522;&#20934;&#25968;&#25454;&#38598;&#12290;&#35813;&#25968;&#25454;&#38598;&#21253;&#21547;30&#20010;&#32454;&#31890;&#24230;&#31867;&#21035;&#30340;1,245&#20010;&#23545;&#35805;&#21644;15,040&#20010;&#26679;&#26412;&#65292;&#20854;&#20013;&#21253;&#25324;&#36924;&#30495;&#30340;&#22330;&#22806;&#26679;&#26412;&#65292;&#24182;&#20016;&#23500;&#20102;&#21457;&#35328;&#32773;&#20449;&#24687;&#20197;&#25903;&#25345;&#22810;&#26041;&#23545;&#35805;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#27169;&#24577;&#24847;&#22270;&#35782;&#21035;&#38754;&#20020;&#37325;&#22823;&#25361;&#25112;&#65292;&#38656;&#35201;&#25972;&#21512;&#26469;&#33258;&#29616;&#23454;&#19990;&#30028;&#32972;&#26223;&#30340;&#38750;&#35821;&#35328;&#24418;&#24335;&#65292;&#20197;&#22686;&#24378;&#23545;&#20154;&#31867;&#24847;&#22270;&#30340;&#29702;&#35299;&#12290;&#29616;&#26377;&#30340;&#22522;&#20934;&#25968;&#25454;&#38598;&#22312;&#35268;&#27169;&#19978;&#21463;&#38480;&#65292;&#24182;&#19988;&#22312;&#22788;&#29702;&#22810;&#36718;&#23545;&#35805;&#20114;&#21160;&#20013;&#20986;&#29616;&#30340;&#22330;&#22806;&#26679;&#26412;&#26102;&#23384;&#22312;&#22256;&#38590;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;MIntRec2.0&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#22810;&#26041;&#23545;&#35805;&#20013;&#30340;&#22810;&#27169;&#24577;&#24847;&#22270;&#35782;&#21035;&#30340;&#22823;&#35268;&#27169;&#22522;&#20934;&#25968;&#25454;&#38598;&#12290;&#23427;&#21253;&#21547;1,245&#20010;&#23545;&#35805;&#65292;15,040&#20010;&#26679;&#26412;&#65292;&#27599;&#20010;&#26679;&#26412;&#22312;30&#20010;&#32454;&#31890;&#24230;&#31867;&#21035;&#30340;&#26032;&#24847;&#22270;&#20998;&#31867;&#20013;&#36827;&#34892;&#20102;&#27880;&#37322;&#12290;&#38500;&#20102;9,304&#20010;&#22330;&#20869;&#26679;&#26412;&#22806;&#65292;&#36824;&#21253;&#25324;5,736&#20010;&#20986;&#29616;&#22312;&#22810;&#36718;&#19978;&#19979;&#25991;&#20013;&#30340;&#22330;&#22806;&#26679;&#26412;&#65292;&#36825;&#22312;&#29616;&#23454;&#22330;&#26223;&#20013;&#33258;&#28982;&#21457;&#29983;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#27599;&#20010;&#35805;&#35821;&#20013;&#21457;&#35328;&#32773;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#20016;&#23500;&#20102;&#23427;&#22312;&#22810;&#26041;&#23545;&#35805;&#30740;&#31350;&#20013;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10943v1 Announce Type: cross  Abstract: Multimodal intent recognition poses significant challenges, requiring the incorporation of non-verbal modalities from real-world contexts to enhance the comprehension of human intentions. Existing benchmark datasets are limited in scale and suffer from difficulties in handling out-of-scope samples that arise in multi-turn conversational interactions. We introduce MIntRec2.0, a large-scale benchmark dataset for multimodal intent recognition in multi-party conversations. It contains 1,245 dialogues with 15,040 samples, each annotated within a new intent taxonomy of 30 fine-grained classes. Besides 9,304 in-scope samples, it also includes 5,736 out-of-scope samples appearing in multi-turn contexts, which naturally occur in real-world scenarios. Furthermore, we provide comprehensive information on the speakers in each utterance, enriching its utility for multi-party conversational research. We establish a general framework supporting the o
&lt;/p&gt;</description></item></channel></rss>