<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24322;&#26500;&#22270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#21644;&#20132;&#36890;&#29702;&#35770;&#30340;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#65292;&#36890;&#36807;&#23558;&#36710;&#36742;&#32534;&#38431;&#21644;&#20132;&#36890;&#20449;&#21495;&#25511;&#21046;&#20316;&#20026;&#19981;&#21516;&#30340;&#24378;&#21270;&#23398;&#20064;&#26234;&#33021;&#20307;&#65292;&#24182;&#32467;&#21512;&#22270;&#31070;&#32463;&#32593;&#32476;&#23454;&#29616;&#21327;&#35843;&#65292;&#20197;&#20248;&#21270;&#20132;&#36890;&#27969;&#37327;&#21644;&#32531;&#35299;&#22478;&#24066;&#25317;&#22581;&#12290;</title><link>http://arxiv.org/abs/2310.10948</link><description>&lt;p&gt;
&#36890;&#36807;&#21327;&#20316;&#35299;&#20915;&#22478;&#24066;&#25317;&#22581;&#65306;&#22522;&#20110;&#24322;&#26500;GNN&#30340;&#21327;&#35843;&#32534;&#38431;&#21644;&#20132;&#36890;&#20449;&#21495;&#25511;&#21046;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Combat Urban Congestion via Collaboration: Heterogeneous GNN-based MARL for Coordinated Platooning and Traffic Signal Control. (arXiv:2310.10948v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10948
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24322;&#26500;&#22270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#21644;&#20132;&#36890;&#29702;&#35770;&#30340;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#65292;&#36890;&#36807;&#23558;&#36710;&#36742;&#32534;&#38431;&#21644;&#20132;&#36890;&#20449;&#21495;&#25511;&#21046;&#20316;&#20026;&#19981;&#21516;&#30340;&#24378;&#21270;&#23398;&#20064;&#26234;&#33021;&#20307;&#65292;&#24182;&#32467;&#21512;&#22270;&#31070;&#32463;&#32593;&#32476;&#23454;&#29616;&#21327;&#35843;&#65292;&#20197;&#20248;&#21270;&#20132;&#36890;&#27969;&#37327;&#21644;&#32531;&#35299;&#22478;&#24066;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#24180;&#26469;&#65292;&#24378;&#21270;&#23398;&#20064;&#24050;&#32463;&#25104;&#20026;&#19968;&#31181;&#27969;&#34892;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#29420;&#31435;&#25110;&#20998;&#23618;&#26041;&#24335;&#24320;&#21457;&#20449;&#21495;&#25511;&#21046;&#21644;&#36710;&#36742;&#32534;&#38431;&#31574;&#30053;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#26102;&#20013;&#32852;&#21512;&#25511;&#21046;&#36825;&#20004;&#32773;&#20197;&#20943;&#36731;&#20132;&#36890;&#25317;&#22581;&#24102;&#26469;&#20102;&#26032;&#30340;&#25361;&#25112;&#65292;&#22914;&#20449;&#21495;&#25511;&#21046;&#21644;&#32534;&#38431;&#20043;&#38388;&#22266;&#26377;&#30340;&#29289;&#29702;&#21644;&#34892;&#20026;&#24322;&#36136;&#24615;&#65292;&#20197;&#21450;&#23427;&#20204;&#20043;&#38388;&#30340;&#21327;&#35843;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;&#26469;&#24212;&#23545;&#36825;&#20123;&#25361;&#25112;&#65292;&#22522;&#20110;&#24322;&#26500;&#22270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#21644;&#20132;&#36890;&#29702;&#35770;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#65306;1&#65289;&#23558;&#32534;&#38431;&#21644;&#20449;&#21495;&#25511;&#21046;&#35774;&#35745;&#20026;&#19981;&#21516;&#30340;&#24378;&#21270;&#23398;&#20064;&#26234;&#33021;&#20307;&#65292;&#20855;&#26377;&#33258;&#24049;&#30340;&#35266;&#27979;&#12289;&#21160;&#20316;&#21644;&#22870;&#21169;&#20989;&#25968;&#65292;&#20197;&#20248;&#21270;&#20132;&#36890;&#27969;&#37327;&#65307;2&#65289;&#36890;&#36807;&#22312;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#20013;&#24341;&#20837;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#35774;&#35745;&#21327;&#35843;&#65292;&#20197;&#20419;&#36827;&#21306;&#22495;&#33539;&#22260;&#20869;&#26234;&#33021;&#20307;&#20043;&#38388;&#30340;&#26080;&#32541;&#20449;&#24687;&#20132;&#25442;&#12290;&#25105;&#20204;&#36890;&#36807;SUMO&#27169;&#25311;&#29615;&#22659;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Over the years, reinforcement learning has emerged as a popular approach to develop signal control and vehicle platooning strategies either independently or in a hierarchical way. However, jointly controlling both in real-time to alleviate traffic congestion presents new challenges, such as the inherent physical and behavioral heterogeneity between signal control and platooning, as well as coordination between them. This paper proposes an innovative solution to tackle these challenges based on heterogeneous graph multi-agent reinforcement learning and traffic theories. Our approach involves: 1) designing platoon and signal control as distinct reinforcement learning agents with their own set of observations, actions, and reward functions to optimize traffic flow; 2) designing coordination by incorporating graph neural networks within multi-agent reinforcement learning to facilitate seamless information exchange among agents on a regional scale. We evaluate our approach through SUMO simu
&lt;/p&gt;</description></item></channel></rss>