<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#23545;&#25239;&#24615;&#22810;&#26234;&#33021;&#20307;&#28216;&#25103;&#20013;&#24212;&#29992;&#25193;&#25955;-&#24378;&#21270;&#23398;&#20064;&#30340;&#20998;&#23618;&#36816;&#21160;&#35268;&#21010;&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#39640;&#32423;&#25193;&#25955;&#27169;&#22411;&#21644;&#20302;&#32423;RL&#31639;&#27861;&#65292;&#23454;&#29616;&#27604;&#22522;&#20934;&#26041;&#27861;&#26356;&#39640;&#25928;&#29575;&#30340;&#36816;&#21160;&#35268;&#21010;&#12290;</title><link>https://arxiv.org/abs/2403.10794</link><description>&lt;p&gt;
&#22312;&#23545;&#25239;&#24615;&#22810;&#26234;&#33021;&#20307;&#28216;&#25103;&#20013;&#30340;&#25193;&#25955;-&#24378;&#21270;&#23398;&#20064;&#20998;&#23618;&#36816;&#21160;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Diffusion-Reinforcement Learning Hierarchical Motion Planning in Adversarial Multi-agent Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10794
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#23545;&#25239;&#24615;&#22810;&#26234;&#33021;&#20307;&#28216;&#25103;&#20013;&#24212;&#29992;&#25193;&#25955;-&#24378;&#21270;&#23398;&#20064;&#30340;&#20998;&#23618;&#36816;&#21160;&#35268;&#21010;&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#39640;&#32423;&#25193;&#25955;&#27169;&#22411;&#21644;&#20302;&#32423;RL&#31639;&#27861;&#65292;&#23454;&#29616;&#27604;&#22522;&#20934;&#26041;&#27861;&#26356;&#39640;&#25928;&#29575;&#30340;&#36816;&#21160;&#35268;&#21010;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;-&#22522;&#20110;&#30340;&#36816;&#21160;&#35268;&#21010;&#26368;&#36817;&#23637;&#29616;&#20986;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#30340;&#28508;&#21147;&#65292;&#20174;&#33258;&#20027;&#23548;&#33322;&#21040;&#26426;&#22120;&#20154;&#25805;&#20316;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20851;&#27880;&#37096;&#20998;&#21487;&#35266;&#23519;&#22810;&#26234;&#33021;&#20307;&#23545;&#25239;&#36861;&#36880;&#36867;&#36991;&#28216;&#25103;&#65288;PEG&#65289;&#20013;&#23545;&#36867;&#36991;&#30446;&#26631;&#30340;&#36816;&#21160;&#35268;&#21010;&#20219;&#21153;&#12290;&#36825;&#20123;&#36861;&#36880;&#36867;&#36991;&#38382;&#39064;&#19982;&#21508;&#31181;&#24212;&#29992;&#30456;&#20851;&#65292;&#20363;&#22914;&#25628;&#32034;&#21644;&#25937;&#25588;&#34892;&#21160;&#20197;&#21450;&#30417;&#35270;&#26426;&#22120;&#20154;&#65292;&#20854;&#20013;&#26426;&#22120;&#20154;&#24517;&#39035;&#26377;&#25928;&#35268;&#21010;&#20182;&#20204;&#30340;&#34892;&#21160;&#26469;&#25910;&#38598;&#24773;&#25253;&#25110;&#23436;&#25104;&#20219;&#21153;&#65292;&#21516;&#26102;&#36991;&#20813;&#34987;&#20390;&#26597;&#25110;&#34987;&#20440;&#34383;&#33258;&#24049;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#23618;&#26550;&#26500;&#65292;&#35813;&#26550;&#26500;&#25972;&#21512;&#20102;&#19968;&#20010;&#39640;&#32423;&#25193;&#25955;&#27169;&#22411;&#65292;&#29992;&#20110;&#35268;&#21010;&#23545;&#29615;&#22659;&#25968;&#25454;&#25935;&#24863;&#30340;&#20840;&#23616;&#36335;&#24452;&#65292;&#21516;&#26102;&#20302;&#32423;RL&#31639;&#27861;&#25512;&#29702;&#38378;&#36991;&#34892;&#20026;&#19982;&#20840;&#23616;&#36335;&#24452;&#36319;&#38543;&#34892;&#20026;&#12290;&#36890;&#36807;&#21033;&#29992;&#25193;&#25955;&#27169;&#22411;&#24341;&#23548;RL&#31639;&#27861;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#27604;&#22522;&#32447;&#25552;&#39640;&#20102;51.2&#65285;&#65292;&#23454;&#29616;&#26356;&#39640;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10794v1 Announce Type: cross  Abstract: Reinforcement Learning- (RL-)based motion planning has recently shown the potential to outperform traditional approaches from autonomous navigation to robot manipulation. In this work, we focus on a motion planning task for an evasive target in a partially observable multi-agent adversarial pursuit-evasion games (PEG). These pursuit-evasion problems are relevant to various applications, such as search and rescue operations and surveillance robots, where robots must effectively plan their actions to gather intelligence or accomplish mission tasks while avoiding detection or capture themselves. We propose a hierarchical architecture that integrates a high-level diffusion model to plan global paths responsive to environment data while a low-level RL algorithm reasons about evasive versus global path-following behavior. Our approach outperforms baselines by 51.2% by leveraging the diffusion model to guide the RL algorithm for more efficien
&lt;/p&gt;</description></item></channel></rss>