<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#26469;&#23454;&#29616;&#28857;&#23545;&#28857;&#33021;&#28304;&#20132;&#26131;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#24110;&#21161;&#33258;&#21160;&#21270;&#28040;&#36153;&#32773;&#30340;&#31454;&#26631;&#21644;&#31649;&#29702;&#65292;&#24182;&#35299;&#20915;&#20102;&#21487;&#20877;&#29983;&#33021;&#28304;&#38646;&#36793;&#38469;&#25104;&#26412;&#21644;&#29289;&#29702;&#32422;&#26463;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.13947</link><description>&lt;p&gt;
&#32593;&#32476;&#21270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#29992;&#20110;&#28857;&#23545;&#28857;&#33021;&#28304;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Networked Multiagent Reinforcement Learning for Peer-to-Peer Energy Trading. (arXiv:2401.13947v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13947
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#26469;&#23454;&#29616;&#28857;&#23545;&#28857;&#33021;&#28304;&#20132;&#26131;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#24110;&#21161;&#33258;&#21160;&#21270;&#28040;&#36153;&#32773;&#30340;&#31454;&#26631;&#21644;&#31649;&#29702;&#65292;&#24182;&#35299;&#20915;&#20102;&#21487;&#20877;&#29983;&#33021;&#28304;&#38646;&#36793;&#38469;&#25104;&#26412;&#21644;&#29289;&#29702;&#32422;&#26463;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#20998;&#24067;&#24335;&#21487;&#20877;&#29983;&#33021;&#28304;&#21644;&#33021;&#37327;&#20648;&#23384;&#36164;&#28304;&#36827;&#34892;&#28857;&#23545;&#28857;&#33021;&#28304;&#20132;&#26131;&#34987;&#38271;&#26399;&#35748;&#20026;&#26159;&#25552;&#39640;&#33021;&#28304;&#31995;&#32479;&#24377;&#24615;&#21644;&#21487;&#25345;&#32493;&#24615;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#28982;&#32780;&#65292;&#28040;&#36153;&#32773;&#21644;&#33258;&#32473;&#33258;&#36275;&#32773;&#65288;&#20855;&#26377;&#33021;&#28304;&#21457;&#30005;&#36164;&#28304;&#30340;&#20154;&#65289;&#32570;&#20047;&#36827;&#34892;&#37325;&#22797;&#28857;&#23545;&#28857;&#20132;&#26131;&#30340;&#19987;&#19994;&#30693;&#35782;&#65292;&#24182;&#19988;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#38646;&#36793;&#38469;&#25104;&#26412;&#22312;&#30830;&#23450;&#20844;&#24179;&#24066;&#22330;&#20215;&#26684;&#26041;&#38754;&#23384;&#22312;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#26694;&#26550;&#65292;&#20197;&#24110;&#21161;&#33258;&#21160;&#21270;&#28040;&#36153;&#32773;&#23545;&#22826;&#38451;&#33021;&#20809;&#20239;&#21644;&#33021;&#37327;&#20648;&#23384;&#36164;&#28304;&#30340;&#31454;&#26631;&#21644;&#31649;&#29702;&#65292;&#22312;&#19968;&#31181;&#21033;&#29992;&#20379;&#38656;&#27604;&#30340;&#28857;&#23545;&#28857;&#28165;&#31639;&#26426;&#21046;&#19979;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;MARL&#26694;&#26550;&#22914;&#20309;&#25972;&#21512;&#29289;&#29702;&#32593;&#32476;&#32422;&#26463;&#20197;&#23454;&#29616;&#30005;&#21387;&#25511;&#21046;&#65292;&#20174;&#32780;&#30830;&#20445;&#28857;&#23545;&#28857;&#33021;&#28304;&#20132;&#26131;&#30340;&#29289;&#29702;&#21487;&#34892;&#24615;&#65292;&#24182;&#20026;&#30495;&#23454;&#19990;&#30028;&#30340;&#23454;&#26045;&#38138;&#24179;&#20102;&#36947;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Utilizing distributed renewable and energy storage resources in local distribution networks via peer-to-peer (P2P) energy trading has long been touted as a solution to improve energy systems' resilience and sustainability. Consumers and prosumers (those who have energy generation resources), however, do not have the expertise to engage in repeated P2P trading, and the zero-marginal costs of renewables present challenges in determining fair market prices. To address these issues, we propose multi-agent reinforcement learning (MARL) frameworks to help automate consumers' bidding and management of their solar PV and energy storage resources, under a specific P2P clearing mechanism that utilizes the so-called supply-demand ratio. In addition, we show how the MARL frameworks can integrate physical network constraints to realize voltage control, hence ensuring physical feasibility of the P2P energy trading and paving way for real-world implementations.
&lt;/p&gt;</description></item></channel></rss>