<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#25552;&#20986;&#20102;&#23433;&#20840;&#38388;&#38548;RRT*&#65288;SI-RRT*&#65289;&#20004;&#32423;&#26041;&#27861;&#65292;&#20302;&#32423;&#37319;&#29992;&#37319;&#26679;&#35268;&#21010;&#22120;&#25214;&#21040;&#21333;&#20010;&#26426;&#22120;&#20154;&#30340;&#26080;&#30896;&#25758;&#36712;&#36857;&#65292;&#39640;&#32423;&#36890;&#36807;&#20248;&#20808;&#35268;&#21010;&#25110;&#22522;&#20110;&#20914;&#31361;&#30340;&#25628;&#32034;&#35299;&#20915;&#26426;&#22120;&#20154;&#38388;&#20914;&#31361;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;SI-RRT*&#33021;&#22815;&#24555;&#36895;&#25214;&#21040;&#39640;&#36136;&#37327;&#35299;&#20915;&#26041;&#26696;</title><link>https://arxiv.org/abs/2404.01752</link><description>&lt;p&gt;
&#23433;&#20840;&#38388;&#38548;RRT*&#29992;&#20110;&#36830;&#32493;&#31354;&#38388;&#20013;&#21487;&#25193;&#23637;&#30340;&#22810;&#26426;&#22120;&#20154;&#36335;&#24452;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Safe Interval RRT* for Scalable Multi-Robot Path Planning in Continuous Space
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01752
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#23433;&#20840;&#38388;&#38548;RRT*&#65288;SI-RRT*&#65289;&#20004;&#32423;&#26041;&#27861;&#65292;&#20302;&#32423;&#37319;&#29992;&#37319;&#26679;&#35268;&#21010;&#22120;&#25214;&#21040;&#21333;&#20010;&#26426;&#22120;&#20154;&#30340;&#26080;&#30896;&#25758;&#36712;&#36857;&#65292;&#39640;&#32423;&#36890;&#36807;&#20248;&#20808;&#35268;&#21010;&#25110;&#22522;&#20110;&#20914;&#31361;&#30340;&#25628;&#32034;&#35299;&#20915;&#26426;&#22120;&#20154;&#38388;&#20914;&#31361;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;SI-RRT*&#33021;&#22815;&#24555;&#36895;&#25214;&#21040;&#39640;&#36136;&#37327;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#36830;&#32493;&#31354;&#38388;&#20013;&#35299;&#20915;&#22810;&#26426;&#22120;&#20154;&#36335;&#24452;&#35268;&#21010;&#65288;MRPP&#65289;&#38382;&#39064;&#20197;&#25214;&#21040;&#26080;&#20914;&#31361;&#36335;&#24452;&#30340;&#38382;&#39064;&#12290;&#38382;&#39064;&#30340;&#22256;&#38590;&#20027;&#35201;&#26469;&#33258;&#20004;&#20010;&#22240;&#32032;&#12290;&#39318;&#20808;&#65292;&#28041;&#21450;&#22810;&#20010;&#26426;&#22120;&#20154;&#20250;&#23548;&#33268;&#32452;&#21512;&#20915;&#31574;&#65292;&#20351;&#25628;&#32034;&#31354;&#38388;&#21576;&#25351;&#25968;&#32423;&#22686;&#38271;&#12290;&#20854;&#27425;&#65292;&#36830;&#32493;&#31354;&#38388;&#21576;&#29616;&#20986;&#28508;&#22312;&#26080;&#38480;&#30340;&#29366;&#24577;&#21644;&#21160;&#20316;&#12290;&#38024;&#23545;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#32423;&#26041;&#27861;&#65292;&#20302;&#32423;&#26159;&#22522;&#20110;&#37319;&#26679;&#30340;&#35268;&#21010;&#22120;&#23433;&#20840;&#38388;&#38548;RRT*&#65288;SI-RRT*&#65289;&#65292;&#29992;&#20110;&#25214;&#21040;&#21333;&#20010;&#26426;&#22120;&#20154;&#30340;&#26080;&#30896;&#25758;&#36712;&#36857;&#12290;&#39640;&#32423;&#21487;&#20197;&#20351;&#29992;&#33021;&#22815;&#35299;&#20915;&#26426;&#22120;&#20154;&#38388;&#20914;&#31361;&#30340;&#20219;&#20309;&#26041;&#27861;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#20004;&#31181;&#20195;&#34920;&#24615;&#26041;&#27861;&#65292;&#21363;&#20248;&#20808;&#35268;&#21010;&#65288;SI-CPP&#65289;&#21644;&#22522;&#20110;&#20914;&#31361;&#30340;&#25628;&#32034;&#65288;SI-CCBS&#65289;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;SI-RRT*&#33021;&#22815;&#24555;&#36895;&#25214;&#21040;&#39640;&#36136;&#37327;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#19988;&#25152;&#38656;&#30340;&#26679;&#26412;&#25968;&#37327;&#36739;&#23569;&#12290;SI-CPP&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#32780;SI-CCBS&#20135;&#29983;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01752v1 Announce Type: cross  Abstract: In this paper, we consider the problem of Multi-Robot Path Planning (MRPP) in continuous space to find conflict-free paths. The difficulty of the problem arises from two primary factors. First, the involvement of multiple robots leads to combinatorial decision-making, which escalates the search space exponentially. Second, the continuous space presents potentially infinite states and actions. For this problem, we propose a two-level approach where the low level is a sampling-based planner Safe Interval RRT* (SI-RRT*) that finds a collision-free trajectory for individual robots. The high level can use any method that can resolve inter-robot conflicts where we employ two representative methods that are Prioritized Planning (SI-CPP) and Conflict Based Search (SI-CCBS). Experimental results show that SI-RRT* can find a high-quality solution quickly with a small number of samples. SI-CPP exhibits improved scalability while SI-CCBS produces 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#20445;&#35777;&#26368;&#20248;&#24615;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#20998;&#24067;&#24335;&#22312;&#32447;&#23398;&#20064;&#20013;&#21516;&#26102;&#20445;&#35777;&#24046;&#20998;&#38544;&#31169;&#21644;&#23398;&#20064;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.14094</link><description>&lt;p&gt;
&#20855;&#26377;&#20445;&#35777;&#26368;&#20248;&#24615;&#30340;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#20998;&#24067;&#24335;&#22312;&#32447;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Locally Differentially Private Distributed Online Learning with Guaranteed Optimality. (arXiv:2306.14094v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14094
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#20445;&#35777;&#26368;&#20248;&#24615;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#20998;&#24067;&#24335;&#22312;&#32447;&#23398;&#20064;&#20013;&#21516;&#26102;&#20445;&#35777;&#24046;&#20998;&#38544;&#31169;&#21644;&#23398;&#20064;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#24067;&#24335;&#22312;&#32447;&#23398;&#20064;&#30001;&#20110;&#20854;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#21644;&#27969;&#25968;&#25454;&#30340;&#33021;&#21147;&#32780;&#21463;&#21040;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#12290;&#20026;&#20102;&#35299;&#20915;&#38544;&#31169;&#20445;&#25252;&#38382;&#39064;&#65292;&#24050;&#32463;&#25552;&#20986;&#20102;&#35768;&#22810;&#20010;&#20154;&#31169;&#23494;&#20998;&#24067;&#24335;&#22312;&#32447;&#23398;&#20064;&#31639;&#27861;&#65292;&#22823;&#22810;&#25968;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#65292;&#24046;&#20998;&#38544;&#31169;&#24050;&#25104;&#20026;&#38544;&#31169;&#20445;&#25252;&#30340;&#8220;&#40644;&#37329;&#26631;&#20934;&#8221;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#31639;&#27861;&#24120;&#24120;&#38754;&#20020;&#20026;&#20102;&#38544;&#31169;&#20445;&#25252;&#32780;&#29306;&#29298;&#23398;&#20064;&#20934;&#30830;&#24615;&#30340;&#22256;&#22659;&#12290;&#26412;&#25991;&#21033;&#29992;&#22312;&#32447;&#23398;&#20064;&#30340;&#29420;&#29305;&#29305;&#24449;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#19968;&#22256;&#22659;&#65292;&#24182;&#30830;&#20445;&#20998;&#24067;&#24335;&#22312;&#32447;&#23398;&#20064;&#20013;&#30340;&#24046;&#20998;&#38544;&#31169;&#21644;&#23398;&#20064;&#20934;&#30830;&#24615;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#35813;&#26041;&#27861;&#22312;&#30830;&#20445;&#39044;&#26399;&#30636;&#26102;&#36951;&#25022;&#31243;&#24230;&#36880;&#28176;&#20943;&#23567;&#30340;&#21516;&#26102;&#65292;&#36824;&#33021;&#20445;&#35777;&#26377;&#38480;&#30340;&#32047;&#31215;&#38544;&#31169;&#39044;&#31639;&#65292;&#21363;&#20351;&#22312;&#26080;&#38480;&#26102;&#38388;&#33539;&#22260;&#20869;&#12290;&#20026;&#20102;&#24212;&#23545;&#23436;&#20840;&#20998;&#24067;&#24335;&#29615;&#22659;&#65292;&#25105;&#20204;&#37319;&#29992;&#26412;&#22320;&#24046;&#20998;&#38544;&#31169;&#26694;&#26550;&#65292;&#36991;&#20813;&#20102;&#23545;&#20840;&#23616;&#25968;&#25454;&#30340;&#20381;&#36182;&#12290;
&lt;/p&gt;
&lt;p&gt;
Distributed online learning is gaining increased traction due to its unique ability to process large-scale datasets and streaming data. To address the growing public awareness and concern on privacy protection, plenty of private distributed online learning algorithms have been proposed, mostly based on differential privacy which has emerged as the ``gold standard" for privacy protection. However, these algorithms often face the dilemma of trading learning accuracy for privacy. By exploiting the unique characteristics of online learning, this paper proposes an approach that tackles the dilemma and ensures both differential privacy and learning accuracy in distributed online learning. More specifically, while ensuring a diminishing expected instantaneous regret, the approach can simultaneously ensure a finite cumulative privacy budget, even on the infinite time horizon. To cater for the fully distributed setting, we adopt the local differential-privacy framework which avoids the reliance
&lt;/p&gt;</description></item></channel></rss>