<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>AccoMontage-3&#26159;&#19968;&#31181;&#36890;&#36807;&#39034;&#24207;&#39118;&#26684;&#36716;&#25442;&#21644;&#22810;&#36712;&#36947;&#21151;&#33021;&#20808;&#39564;&#23454;&#29616;&#20840;&#38899;&#20048;&#20276;&#22863;&#32534;&#25490;&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#26681;&#25454;&#20027;&#26059;&#24459;&#19982;&#21644;&#24358;&#30340;&#36755;&#20837;&#29983;&#25104;&#22810;&#38899;&#36712;&#30340;&#20276;&#22863;&#12290;</title><link>http://arxiv.org/abs/2310.16334</link><description>&lt;p&gt;
AccoMontage-3: &#36890;&#36807;&#39034;&#24207;&#39118;&#26684;&#36716;&#25442;&#21644;&#22810;&#36712;&#36947;&#21151;&#33021;&#20808;&#39564;&#23454;&#29616;&#20840;&#38899;&#20048;&#20276;&#22863;&#32534;&#25490;
&lt;/p&gt;
&lt;p&gt;
AccoMontage-3: Full-Band Accompaniment Arrangement via Sequential Style Transfer and Multi-Track Function Prior. (arXiv:2310.16334v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16334
&lt;/p&gt;
&lt;p&gt;
AccoMontage-3&#26159;&#19968;&#31181;&#36890;&#36807;&#39034;&#24207;&#39118;&#26684;&#36716;&#25442;&#21644;&#22810;&#36712;&#36947;&#21151;&#33021;&#20808;&#39564;&#23454;&#29616;&#20840;&#38899;&#20048;&#20276;&#22863;&#32534;&#25490;&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#26681;&#25454;&#20027;&#26059;&#24459;&#19982;&#21644;&#24358;&#30340;&#36755;&#20837;&#29983;&#25104;&#22810;&#38899;&#36712;&#30340;&#20276;&#22863;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;AccoMontage-3&#65292;&#36825;&#26159;&#19968;&#20010;&#31526;&#21495;&#38899;&#20048;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#21487;&#20197;&#26681;&#25454;&#20027;&#26059;&#24459;&#19982;&#21644;&#24358;&#30340;&#36755;&#20837;&#65288;&#21363;&#24341;&#23548;&#20048;&#35889;&#65289;&#65292;&#29983;&#25104;&#22810;&#38899;&#36712;&#30340;&#20840;&#38899;&#20048;&#20276;&#22863;&#12290;&#35813;&#31995;&#32479;&#21253;&#21547;&#19977;&#20010;&#27169;&#22359;&#21270;&#32452;&#20214;&#65292;&#27599;&#20010;&#32452;&#20214;&#27169;&#25311;&#20840;&#38899;&#20048;&#20316;&#26354;&#30340;&#37325;&#35201;&#26041;&#38754;&#12290;&#31532;&#19968;&#20010;&#32452;&#20214;&#26159;&#38050;&#29748;&#32534;&#26354;&#24072;&#65292;&#36890;&#36807;&#23558;&#32441;&#29702;&#39118;&#26684;&#36716;&#25442;&#20026;&#21644;&#24358;&#65292;&#20351;&#29992;&#28508;&#22312;&#30340;&#21644;&#24358;-&#32441;&#29702;&#20998;&#31163;&#21644;&#21551;&#21457;&#24335;&#32441;&#29702;&#20379;&#24212;&#32773;&#26816;&#32034;&#65292;&#29983;&#25104;&#38050;&#29748;&#20276;&#22863;&#12290;&#31532;&#20108;&#20010;&#32452;&#20214;&#26681;&#25454;&#20010;&#21035;&#38899;&#36712;&#21151;&#33021;&#32534;&#30721;&#30340;&#31649;&#24358;&#20048;&#39118;&#26684;&#65292;&#23558;&#38050;&#29748;&#20276;&#22863;&#20048;&#35889;&#32534;&#25490;&#25104;&#20840;&#38899;&#20048;&#20276;&#22863;&#12290;&#23558;&#21069;&#20004;&#20010;&#32452;&#20214;&#36830;&#25509;&#36215;&#26469;&#30340;&#31532;&#19977;&#20010;&#32452;&#20214;&#26159;&#19968;&#20010;&#20808;&#39564;&#27169;&#22411;&#65292;&#29992;&#20110;&#25551;&#36848;&#25972;&#39318;&#38899;&#20048;&#20316;&#21697;&#19978;&#30340;&#32534;&#26354;&#39118;&#26684;&#30340;&#20840;&#23616;&#32467;&#26500;&#12290;&#25972;&#20010;&#31995;&#32479;&#20197;&#31471;&#21040;&#31471;&#30340;&#26041;&#24335;&#33258;&#25105;&#30417;&#30563;&#22320;&#23398;&#20064;&#29983;&#25104;&#20840;&#38899;&#20048;&#20276;&#22863;&#65292;&#23558;&#39118;&#26684;&#36716;&#25442;&#24212;&#29992;&#20110;&#20004;&#20010;&#23618;&#38754;&#30340;&#22810;&#22768;&#37096;&#21327;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose AccoMontage-3, a symbolic music automation system capable of generating multi-track, full-band accompaniment based on the input of a lead melody with chords (i.e., a lead sheet). The system contains three modular components, each modelling a vital aspect of full-band composition. The first component is a piano arranger that generates piano accompaniment for the lead sheet by transferring texture styles to the chords using latent chord-texture disentanglement and heuristic retrieval of texture donors. The second component orchestrates the piano accompaniment score into full-band arrangement according to the orchestration style encoded by individual track functions. The third component, which connects the previous two, is a prior model characterizing the global structure of orchestration style over the whole piece of music. From end to end, the system learns to generate full-band accompaniment in a self-supervised fashion, applying style transfer at two levels of polyphonic co
&lt;/p&gt;</description></item></channel></rss>