<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#22312;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#30340;&#25490;&#21517;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#30340;&#30028;&#38480;&#12290;&#23613;&#31649;&#19981;&#33021;&#20934;&#30830;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#65292;&#20294;&#22312;&#24050;&#30693;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#25512;&#26029;&#20986;&#22791;&#36873;&#27010;&#29575;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.11016</link><description>&lt;p&gt;
&#22312;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#25490;&#21517;&#27169;&#22411;&#20013;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#30340;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Bounding Consideration Probabilities in Consider-Then-Choose Ranking Models. (arXiv:2401.11016v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11016
&lt;/p&gt;
&lt;p&gt;
&#22312;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#30340;&#25490;&#21517;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#30340;&#30028;&#38480;&#12290;&#23613;&#31649;&#19981;&#33021;&#20934;&#30830;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#65292;&#20294;&#22312;&#24050;&#30693;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#25512;&#26029;&#20986;&#22791;&#36873;&#27010;&#29575;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#29702;&#35770;&#20013;&#19968;&#31181;&#24120;&#35265;&#30340;&#35266;&#28857;&#35748;&#20026;&#65292;&#20010;&#20307;&#22312;&#20570;&#20986;&#36873;&#25321;&#20043;&#21069;&#65292;&#20250;&#20808;&#36827;&#34892;&#20004;&#27493;&#30340;&#36807;&#31243;&#65292;&#39318;&#20808;&#36873;&#25321;&#19968;&#20123;&#22791;&#36873;&#26041;&#26696;&#36827;&#34892;&#32771;&#34385;&#65292;&#28982;&#21518;&#20174;&#25152;&#24471;&#30340;&#32771;&#34385;&#38598;&#21512;&#20013;&#36827;&#34892;&#36873;&#25321;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#8220;&#32771;&#34385;&#28982;&#21518;&#36873;&#25321;&#8221;&#30340;&#24773;&#26223;&#19979;&#25512;&#26029;&#26410;&#35266;&#23519;&#21040;&#30340;&#32771;&#34385;&#38598;&#21512;&#65288;&#25110;&#32773;&#22791;&#36873;&#26041;&#26696;&#30340;&#32771;&#34385;&#27010;&#29575;&#65289;&#38754;&#20020;&#30528;&#37325;&#22823;&#25361;&#25112;&#65292;&#22240;&#20026;&#21363;&#20351;&#26159;&#23545;&#20110;&#20855;&#26377;&#24378;&#29420;&#31435;&#24615;&#20551;&#35774;&#30340;&#31616;&#21333;&#32771;&#34385;&#27169;&#22411;&#65292;&#22312;&#24050;&#30693;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#20063;&#26080;&#27861;&#30830;&#23450;&#36523;&#20221;&#12290;&#25105;&#20204;&#32771;&#34385;&#23558;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#27169;&#22411;&#33258;&#28982;&#22320;&#25193;&#23637;&#21040;top-k&#25490;&#21517;&#30340;&#24773;&#26223;&#65292;&#20551;&#35774;&#25490;&#21517;&#26159;&#26681;&#25454;Plackett-Luce&#27169;&#22411;&#22312;&#37319;&#26679;&#20102;&#32771;&#34385;&#38598;&#21512;&#21518;&#26500;&#24314;&#30340;&#12290;&#23613;&#31649;&#22312;&#36825;&#31181;&#24773;&#26223;&#19979;&#22791;&#36873;&#26041;&#26696;&#30340;&#32771;&#34385;&#27010;&#29575;&#20173;&#26087;&#19981;&#33021;&#30830;&#23450;&#65292;&#20294;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#33719;&#24471;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#25512;&#26029;&#20986;&#22791;&#36873;&#27010;&#29575;&#30456;&#23545;&#22823;&#23567;&#30340;&#30028;&#38480;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#23545;&#26399;&#26395;&#32771;&#34385;&#38598;&#21512;&#22823;&#23567;&#30340;&#26465;&#20214;&#36827;&#34892;&#25512;&#23548;&#65292;&#25105;&#20204;&#24471;&#21040;&#32477;&#23545;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
A common theory of choice posits that individuals make choices in a two-step process, first selecting some subset of the alternatives to consider before making a selection from the resulting consideration set. However, inferring unobserved consideration sets (or item consideration probabilities) in this "consider then choose" setting poses significant challenges, because even simple models of consideration with strong independence assumptions are not identifiable, even if item utilities are known. We consider a natural extension of consider-then-choose models to a top-$k$ ranking setting, where we assume rankings are constructed according to a Plackett-Luce model after sampling a consideration set. While item consideration probabilities remain non-identified in this setting, we prove that knowledge of item utilities allows us to infer bounds on the relative sizes of consideration probabilities. Additionally, given a condition on the expected consideration set size, we derive absolute u
&lt;/p&gt;</description></item></channel></rss>