<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#25552;&#20986;&#20102;MATS-Gym&#65292;&#19968;&#20010;&#29992;&#20110;&#22312;CARLA&#20013;&#35757;&#32451;&#26234;&#33021;&#20307;&#30340;&#22810;&#26234;&#33021;&#20307;&#20132;&#36890;&#22330;&#26223;&#26694;&#26550;&#65292;&#33021;&#22815;&#33258;&#21160;&#29983;&#25104;&#20855;&#26377;&#21487;&#21464;&#26234;&#33021;&#20307;&#25968;&#37327;&#30340;&#20132;&#36890;&#22330;&#26223;&#24182;&#25972;&#21512;&#20102;&#21508;&#31181;&#29616;&#26377;&#30340;&#20132;&#36890;&#22330;&#26223;&#25551;&#36848;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.17805</link><description>&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#33258;&#20027;&#39550;&#39542;&#22330;&#26223;&#39537;&#21160;&#30340;&#35838;&#31243;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Scenario-Based Curriculum Generation for Multi-Agent Autonomous Driving
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17805
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;MATS-Gym&#65292;&#19968;&#20010;&#29992;&#20110;&#22312;CARLA&#20013;&#35757;&#32451;&#26234;&#33021;&#20307;&#30340;&#22810;&#26234;&#33021;&#20307;&#20132;&#36890;&#22330;&#26223;&#26694;&#26550;&#65292;&#33021;&#22815;&#33258;&#21160;&#29983;&#25104;&#20855;&#26377;&#21487;&#21464;&#26234;&#33021;&#20307;&#25968;&#37327;&#30340;&#20132;&#36890;&#22330;&#26223;&#24182;&#25972;&#21512;&#20102;&#21508;&#31181;&#29616;&#26377;&#30340;&#20132;&#36890;&#22330;&#26223;&#25551;&#36848;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#26679;&#21270;&#21644;&#22797;&#26434;&#35757;&#32451;&#22330;&#26223;&#30340;&#33258;&#21160;&#21270;&#29983;&#25104;&#22312;&#35768;&#22810;&#22797;&#26434;&#23398;&#20064;&#20219;&#21153;&#20013;&#26159;&#37325;&#35201;&#30340;&#12290;&#29305;&#21035;&#26159;&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#24212;&#29992;&#39046;&#22495;&#65292;&#22914;&#33258;&#20027;&#39550;&#39542;&#65292;&#33258;&#21160;&#29983;&#25104;&#35838;&#31243;&#34987;&#35748;&#20026;&#23545;&#33719;&#24471;&#24378;&#20581;&#21644;&#36890;&#29992;&#31574;&#30053;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#22312;&#20805;&#28385;&#25361;&#25112;&#30340;&#20223;&#30495;&#29615;&#22659;&#20013;&#65292;&#20026;&#20132;&#36890;&#22330;&#26223;&#20013;&#30340;&#22810;&#20010;&#24322;&#26500;&#26234;&#33021;&#20307;&#36827;&#34892;&#35774;&#35745;&#36890;&#24120;&#34987;&#35748;&#20026;&#26159;&#19968;&#39033;&#32321;&#29712;&#19988;&#32791;&#26102;&#30340;&#20219;&#21153;&#12290;&#22312;&#25105;&#20204;&#30340;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;MATS-Gym&#65292;&#19968;&#20010;&#29992;&#20110;&#22312;&#39640;&#20445;&#30495;&#39550;&#39542;&#27169;&#25311;&#22120;CARLA&#20013;&#35757;&#32451;&#26234;&#33021;&#20307;&#30340;&#22810;&#26234;&#33021;&#20307;&#20132;&#36890;&#22330;&#26223;&#26694;&#26550;&#12290;MATS-Gym&#26159;&#19968;&#20010;&#29992;&#20110;&#33258;&#20027;&#39550;&#39542;&#30340;&#22810;&#26234;&#33021;&#20307;&#35757;&#32451;&#26694;&#26550;&#65292;&#20351;&#29992;&#37096;&#20998;&#22330;&#26223;&#35268;&#33539;&#29983;&#25104;&#20855;&#26377;&#21487;&#21464;&#26234;&#33021;&#20307;&#25968;&#37327;&#30340;&#20132;&#36890;&#22330;&#26223;&#12290;&#36825;&#31687;&#35770;&#25991;&#23558;&#21508;&#31181;&#29616;&#26377;&#30340;&#20132;&#36890;&#22330;&#26223;&#25551;&#36848;&#26041;&#27861;&#32479;&#19968;&#21040;&#19968;&#20010;&#21333;&#19968;&#30340;&#35757;&#32451;&#26694;&#26550;&#20013;&#65292;&#24182;&#28436;&#31034;&#20102;&#22914;&#20309;&#23558;&#20854;&#19982;&#20854;&#20182;&#33258;&#20027;&#39550;&#39542;&#31639;&#27861;&#38598;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17805v1 Announce Type: cross  Abstract: The automated generation of diverse and complex training scenarios has been an important ingredient in many complex learning tasks. Especially in real-world application domains, such as autonomous driving, auto-curriculum generation is considered vital for obtaining robust and general policies. However, crafting traffic scenarios with multiple, heterogeneous agents is typically considered as a tedious and time-consuming task, especially in more complex simulation environments. In our work, we introduce MATS-Gym, a Multi-Agent Traffic Scenario framework to train agents in CARLA, a high-fidelity driving simulator. MATS-Gym is a multi-agent training framework for autonomous driving that uses partial scenario specifications to generate traffic scenarios with variable numbers of agents. This paper unifies various existing approaches to traffic scenario description into a single training framework and demonstrates how it can be integrated wi
&lt;/p&gt;</description></item></channel></rss>