<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>PFB-Diff &#26159;&#19968;&#20010;&#36890;&#36807;&#28176;&#36827;&#29305;&#24449;&#28151;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#25991;&#26412;&#39537;&#21160;&#30340;&#22270;&#20687;&#32534;&#36753;&#12290;&#35813;&#26041;&#27861;&#35299;&#20915;&#20102;&#25193;&#25955;&#27169;&#22411;&#22312;&#20687;&#32032;&#32423;&#28151;&#21512;&#20013;&#20135;&#29983;&#30340;&#20266;&#24433;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#22810;&#32423;&#29305;&#24449;&#28151;&#21512;&#21644;&#27880;&#24847;&#21147;&#23631;&#34109;&#26426;&#21046;&#30830;&#20445;&#20102;&#32534;&#36753;&#22270;&#20687;&#30340;&#35821;&#20041;&#36830;&#36143;&#24615;&#21644;&#39640;&#36136;&#37327;&#12290;</title><link>http://arxiv.org/abs/2306.16894</link><description>&lt;p&gt;
PFB-Diff: &#28176;&#36827;&#29305;&#24449;&#28151;&#21512;&#25193;&#25955;&#29992;&#20110;&#25991;&#26412;&#39537;&#21160;&#30340;&#22270;&#20687;&#32534;&#36753;
&lt;/p&gt;
&lt;p&gt;
PFB-Diff: Progressive Feature Blending Diffusion for Text-driven Image Editing. (arXiv:2306.16894v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16894
&lt;/p&gt;
&lt;p&gt;
PFB-Diff &#26159;&#19968;&#20010;&#36890;&#36807;&#28176;&#36827;&#29305;&#24449;&#28151;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#25991;&#26412;&#39537;&#21160;&#30340;&#22270;&#20687;&#32534;&#36753;&#12290;&#35813;&#26041;&#27861;&#35299;&#20915;&#20102;&#25193;&#25955;&#27169;&#22411;&#22312;&#20687;&#32032;&#32423;&#28151;&#21512;&#20013;&#20135;&#29983;&#30340;&#20266;&#24433;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#22810;&#32423;&#29305;&#24449;&#28151;&#21512;&#21644;&#27880;&#24847;&#21147;&#23631;&#34109;&#26426;&#21046;&#30830;&#20445;&#20102;&#32534;&#36753;&#22270;&#20687;&#30340;&#35821;&#20041;&#36830;&#36143;&#24615;&#21644;&#39640;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#23637;&#31034;&#20102;&#20854;&#21512;&#25104;&#22810;&#26679;&#24615;&#21644;&#39640;&#36136;&#37327;&#22270;&#20687;&#30340;&#21331;&#36234;&#33021;&#21147;&#65292;&#24341;&#36215;&#20102;&#20154;&#20204;&#23545;&#23558;&#20854;&#24212;&#29992;&#20110;&#23454;&#38469;&#22270;&#20687;&#32534;&#36753;&#30340;&#20852;&#36259;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#22522;&#20110;&#25193;&#25955;&#30340;&#23616;&#37096;&#22270;&#20687;&#32534;&#36753;&#26041;&#27861;&#24120;&#24120;&#22240;&#20026;&#30446;&#26631;&#22270;&#20687;&#21644;&#25193;&#25955;&#28508;&#22312;&#21464;&#37327;&#30340;&#20687;&#32032;&#32423;&#28151;&#21512;&#32780;&#20135;&#29983;&#19981;&#26399;&#26395;&#30340;&#20266;&#24433;&#65292;&#32570;&#20047;&#32500;&#25345;&#22270;&#20687;&#19968;&#33268;&#24615;&#25152;&#24517;&#38656;&#30340;&#35821;&#20041;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;PFB-Diff&#65292;&#19968;&#31181;&#36880;&#27493;&#29305;&#24449;&#28151;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22522;&#20110;&#25193;&#25955;&#30340;&#22270;&#20687;&#32534;&#36753;&#12290;&#19982;&#20197;&#24448;&#26041;&#27861;&#19981;&#21516;&#65292;PFB-Diff&#36890;&#36807;&#22810;&#32423;&#29305;&#24449;&#28151;&#21512;&#23558;&#25991;&#26412;&#24341;&#23548;&#29983;&#25104;&#30340;&#20869;&#23481;&#19982;&#30446;&#26631;&#22270;&#20687;&#26080;&#32541;&#38598;&#25104;&#22312;&#19968;&#36215;&#12290;&#28145;&#23618;&#29305;&#24449;&#20013;&#32534;&#30721;&#30340;&#20016;&#23500;&#35821;&#20041;&#21644;&#20174;&#39640;&#21040;&#20302;&#32423;&#21035;&#30340;&#28176;&#36827;&#28151;&#21512;&#26041;&#26696;&#30830;&#20445;&#20102;&#32534;&#36753;&#22270;&#20687;&#30340;&#35821;&#20041;&#36830;&#36143;&#24615;&#21644;&#39640;&#36136;&#37327;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#22312;&#20132;&#21449;&#27880;&#24847;&#21147;&#23618;&#20013;&#24341;&#20837;&#20102;&#19968;&#20010;&#27880;&#24847;&#21147;&#23631;&#34109;&#26426;&#21046;&#65292;&#20197;&#38480;&#21046;&#29305;&#23450;&#35789;&#35821;&#23545;&#32534;&#36753;&#22270;&#20687;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Diffusion models have showcased their remarkable capability to synthesize diverse and high-quality images, sparking interest in their application for real image editing. However, existing diffusion-based approaches for local image editing often suffer from undesired artifacts due to the pixel-level blending of the noised target images and diffusion latent variables, which lack the necessary semantics for maintaining image consistency. To address these issues, we propose PFB-Diff, a Progressive Feature Blending method for Diffusion-based image editing. Unlike previous methods, PFB-Diff seamlessly integrates text-guided generated content into the target image through multi-level feature blending. The rich semantics encoded in deep features and the progressive blending scheme from high to low levels ensure semantic coherence and high quality in edited images. Additionally, we introduce an attention masking mechanism in the cross-attention layers to confine the impact of specific words to 
&lt;/p&gt;</description></item></channel></rss>