<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>LLM-ABR&#21033;&#29992;&#22823;&#35821;&#35328;&#27169;&#22411;&#33258;&#20027;&#35774;&#35745;&#36866;&#29992;&#20110;&#21508;&#31181;&#32593;&#32476;&#29305;&#24615;&#30340;&#33258;&#36866;&#24212;&#30721;&#29575;&#31639;&#27861;&#65292;&#24182;&#22312;&#19981;&#21516;&#32593;&#32476;&#29615;&#22659;&#20013;&#34920;&#29616;&#20248;&#24322;&#12290;</title><link>https://arxiv.org/abs/2404.01617</link><description>&lt;p&gt;
&#21033;&#29992;&#22823;&#35821;&#35328;&#27169;&#22411;&#35774;&#35745;&#33258;&#36866;&#24212;&#30721;&#29575;&#31639;&#27861;&#30340;LLM-ABR
&lt;/p&gt;
&lt;p&gt;
LLM-ABR: Designing Adaptive Bitrate Algorithms via Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01617
&lt;/p&gt;
&lt;p&gt;
LLM-ABR&#21033;&#29992;&#22823;&#35821;&#35328;&#27169;&#22411;&#33258;&#20027;&#35774;&#35745;&#36866;&#29992;&#20110;&#21508;&#31181;&#32593;&#32476;&#29305;&#24615;&#30340;&#33258;&#36866;&#24212;&#30721;&#29575;&#31639;&#27861;&#65292;&#24182;&#22312;&#19981;&#21516;&#32593;&#32476;&#29615;&#22659;&#20013;&#34920;&#29616;&#20248;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;LLM-ABR&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#21033;&#29992;&#22823;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#29983;&#25104;&#33021;&#21147;&#26469;&#33258;&#21160;&#35774;&#35745;&#36866;&#29992;&#20110;&#19981;&#21516;&#32593;&#32476;&#29305;&#24615;&#30340;&#33258;&#36866;&#24212;&#30721;&#29575;&#65288;ABR&#65289;&#31639;&#27861;&#30340;&#31995;&#32479;&#12290;LLM-ABR&#22312;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#20869;&#36816;&#34892;&#65292;&#36171;&#20104;LLMs&#35774;&#35745;&#20851;&#38190;&#32452;&#20214;&#22914;&#29366;&#24577;&#21644;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#22312;&#21253;&#25324;&#23485;&#24102;&#12289;&#21355;&#26143;&#12289;4G&#21644;5G&#22312;&#20869;&#30340;&#19981;&#21516;&#32593;&#32476;&#35774;&#32622;&#20013;&#35780;&#20272;&#20102;LLM-ABR&#12290;LLM-ABR&#22987;&#32456;&#20248;&#20110;&#40664;&#35748;ABR&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01617v1 Announce Type: cross  Abstract: We present LLM-ABR, the first system that utilizes the generative capabilities of large language models (LLMs) to autonomously design adaptive bitrate (ABR) algorithms tailored for diverse network characteristics. Operating within a reinforcement learning framework, LLM-ABR empowers LLMs to design key components such as states and neural network architectures. We evaluate LLM-ABR across diverse network settings, including broadband, satellite, 4G, and 5G. LLM-ABR consistently outperforms default ABR algorithms.
&lt;/p&gt;</description></item></channel></rss>