<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#23398;&#26657;&#20869;&#26426;&#20250;&#22244;&#31215;&#20986;&#29616;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#30340;&#30740;&#31350;&#65292;&#27169;&#25311;&#34920;&#26126;&#22244;&#31215;&#21363;&#20351;&#22312;&#30333;&#20154;&#19981;&#25198;&#28436;&#22244;&#31215;&#32773;&#36164;&#28304;&#35282;&#33394;&#30340;&#24773;&#20917;&#19979;&#20063;&#20250;&#20986;&#29616;&#65292;&#20854;&#32972;&#21518;&#26159;&#32467;&#26500;&#24615;&#30340;&#19981;&#24179;&#31561;&#26465;&#20214;&#12290;&#36825;&#24378;&#35843;&#20102;&#22312;&#20998;&#26512;&#25945;&#32946;&#26426;&#20250;&#22404;&#26029;&#26102;&#32771;&#34385;&#32467;&#26500;&#24615;&#19981;&#24179;&#31561;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.14653</link><description>&lt;p&gt;
&#26080;&#22244;&#31215;&#32773;&#30340;&#22244;&#31215;&#65306;&#25581;&#24320;&#23398;&#26657;&#20869;&#26426;&#20250;&#22244;&#31215;&#30340;&#20986;&#29616;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Hoarding without hoarders: unpacking the emergence of opportunity hoarding within schools. (arXiv:2305.14653v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14653
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#23398;&#26657;&#20869;&#26426;&#20250;&#22244;&#31215;&#20986;&#29616;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#30340;&#30740;&#31350;&#65292;&#27169;&#25311;&#34920;&#26126;&#22244;&#31215;&#21363;&#20351;&#22312;&#30333;&#20154;&#19981;&#25198;&#28436;&#22244;&#31215;&#32773;&#36164;&#28304;&#35282;&#33394;&#30340;&#24773;&#20917;&#19979;&#20063;&#20250;&#20986;&#29616;&#65292;&#20854;&#32972;&#21518;&#26159;&#32467;&#26500;&#24615;&#30340;&#19981;&#24179;&#31561;&#26465;&#20214;&#12290;&#36825;&#24378;&#35843;&#20102;&#22312;&#20998;&#26512;&#25945;&#32946;&#26426;&#20250;&#22404;&#26029;&#26102;&#32771;&#34385;&#32467;&#26500;&#24615;&#19981;&#24179;&#31561;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25945;&#32946;&#31038;&#20250;&#23398;&#23478;&#36234;&#26469;&#36234;&#24378;&#35843;&#26426;&#20250;&#22404;&#26029;&#22312;&#40657;&#30333;&#25945;&#32946;&#19981;&#24179;&#31561;&#24418;&#25104;&#20013;&#30340;&#20316;&#29992;&#12290;&#21463;&#27492;&#25991;&#29486;&#30340;&#21551;&#21457;&#65292;&#26412;&#25991;&#25286;&#20998;&#20102;&#24517;&#35201;&#21644;&#20805;&#20998;&#30340;&#26465;&#20214;&#65292;&#20197;&#20415;&#22312;&#23398;&#26657;&#20869;&#20135;&#29983;&#25945;&#32946;&#36164;&#28304;&#22244;&#31215;&#12290;&#23427;&#24320;&#21457;&#20102;&#19968;&#20010;&#20449;&#24687;&#37327;&#20016;&#23500;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#22411;&#65292;&#25429;&#25417;&#40657;&#20154;&#21644;&#30333;&#20154;&#23398;&#29983;&#31454;&#20105;&#26377;&#20215;&#20540;&#30340;&#23398;&#26657;&#36164;&#28304;&#65306;&#39640;&#32423;&#35838;&#31243;&#12290;&#19982;&#20256;&#32479;&#35299;&#37322;&#22244;&#31215;&#26159;&#30333;&#20154;&#23558;&#26377;&#20215;&#20540;&#30340;&#36164;&#28304;&#20445;&#30041;&#22312;&#30333;&#20154;&#31038;&#32676;&#20869;&#30340;&#35266;&#28857;&#30456;&#21453;&#65292;&#27169;&#25311;&#26174;&#31034;&#20986;&#21363;&#20351;&#30333;&#20154;&#19981;&#25198;&#28436;&#22244;&#31215;&#32773;&#36164;&#28304;&#30340;&#35282;&#33394;&#65292;&#22244;&#31215;&#20063;&#20250;&#20986;&#29616;&#12290;&#36825;&#20010;&#32467;&#26524;&#32972;&#21518;&#30340;&#21407;&#22240;&#26159;&#32467;&#26500;&#24615;&#30340;&#19981;&#24179;&#31561;&#65288;&#21363;&#31038;&#20250;&#38454;&#32423;&#30340;&#31181;&#26063;&#24046;&#24322;&#65289; - &#32780;&#19981;&#26159;&#34892;&#21160;&#39537;&#21160;&#30340;&#22244;&#31215; - &#26159;&#22244;&#31215;&#20135;&#29983;&#30340;&#24517;&#35201;&#26465;&#20214;&#12290;&#22240;&#27492;&#65292;&#30740;&#31350;&#32467;&#26524;&#35828;&#26126;&#20102;&#20851;&#20110;&#22244;&#31215;&#30340;&#26222;&#36941;&#34892;&#21160;&#39537;&#21160;&#23450;&#20041;&#21644;&#35299;&#37322;&#21487;&#33021;&#26159;&#19981;&#20805;&#20998;&#30340;&#12290;&#27492;&#22806;&#65292;&#35813;&#27169;&#22411;&#24378;&#35843;&#20102;&#22312;&#20998;&#26512;&#25945;&#32946;&#26426;&#20250;&#22404;&#26029;&#26102;&#32771;&#34385;&#32467;&#26500;&#24615;&#19981;&#24179;&#31561;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sociologists of education increasingly highlight the role of opportunity hoarding in the formation of Black-White educational inequalities. Informed by this literature, this article unpacks the necessary and sufficient conditions under which the hoarding of educational resources emerges within schools. It develops a qualitatively informed agent-based model which captures Black and White students' competition for a valuable school resource: advanced coursework. In contrast to traditional accounts -- which explain the emergence of hoarding through the actions of Whites that keep valuable resources within White communities -- simulations, perhaps surprisingly, show hoarding to arise even when Whites do not play the role of hoarders of resources. Behind this result is the fact that a structural inequality (i.e., racial differences in social class) -- and not action-driven hoarding -- is the necessary condition for hoarding to emerge. Findings, therefore, illustrate that common action-drive
&lt;/p&gt;</description></item></channel></rss>