<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#22810;&#29983;&#25104;&#20195;&#29702;&#31995;&#32479;&#22312;&#22478;&#24066;&#35268;&#21010;&#20013;&#27169;&#25311;&#31038;&#21306;&#20915;&#31574;&#65292;&#21457;&#29616;&#27807;&#36890;&#26377;&#21161;&#20110;&#38598;&#20307;&#25512;&#29702;&#65292;&#32780;&#21253;&#21547;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#21644;&#29983;&#27963;&#20215;&#20540;&#23548;&#33268;&#24847;&#35265;&#20998;&#27495;&#12290;&#36825;&#20026;&#22478;&#24066;&#35268;&#21010;&#21644;&#31038;&#21306;&#21442;&#19982;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;</title><link>https://arxiv.org/abs/2402.11314</link><description>&lt;p&gt;
&#22810;&#29983;&#25104;&#20195;&#29702;&#38598;&#20307;&#20915;&#31574;&#22312;&#22478;&#24066;&#35268;&#21010;&#20013;&#30340;&#24212;&#29992;&#65306;Kendall Square&#25913;&#36896;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Multi-Generative Agent Collective Decision-Making in Urban Planning: A Case Study for Kendall Square Renovation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11314
&lt;/p&gt;
&lt;p&gt;
&#22810;&#29983;&#25104;&#20195;&#29702;&#31995;&#32479;&#22312;&#22478;&#24066;&#35268;&#21010;&#20013;&#27169;&#25311;&#31038;&#21306;&#20915;&#31574;&#65292;&#21457;&#29616;&#27807;&#36890;&#26377;&#21161;&#20110;&#38598;&#20307;&#25512;&#29702;&#65292;&#32780;&#21253;&#21547;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#21644;&#29983;&#27963;&#20215;&#20540;&#23548;&#33268;&#24847;&#35265;&#20998;&#27495;&#12290;&#36825;&#20026;&#22478;&#24066;&#35268;&#21010;&#21644;&#31038;&#21306;&#21442;&#19982;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#22810;&#29983;&#25104;&#20195;&#29702;&#31995;&#32479;&#65292;&#29992;&#20110;&#27169;&#25311; Kendall Square Volpe &#22823;&#21414;&#25913;&#36896;&#30340;&#31038;&#21306;&#20915;&#31574;&#36807;&#31243;&#12290;&#36890;&#36807;&#19982;&#24403;&#22320;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#35775;&#35848;&#65292;&#25105;&#20204;&#30340;&#27169;&#25311;&#32467;&#21512;&#20102;&#19981;&#21516;&#31243;&#24230;&#30340;&#27807;&#36890;&#12289;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#21644;&#29983;&#27963;&#20215;&#20540;&#22312;&#20195;&#29702;&#25552;&#31034;&#20013;&#30340;&#24212;&#29992;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#20195;&#29702;&#20043;&#38388;&#30340;&#27807;&#36890;&#25913;&#21892;&#20102;&#38598;&#20307;&#25512;&#29702;&#65292;&#32780;&#21253;&#21547;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#21644;&#29983;&#27963;&#20215;&#20540;&#23548;&#33268;&#20102;&#26356;&#26126;&#26174;&#30340;&#24847;&#35265;&#20998;&#27495;&#12290;&#36825;&#20123;&#21457;&#29616;&#20984;&#26174;&#20102;&#20154;&#24037;&#26234;&#33021;&#22312;&#29702;&#35299;&#22797;&#26434;&#31038;&#20250;&#20114;&#21160;&#21644;&#20915;&#31574;&#36807;&#31243;&#20013;&#30340;&#28508;&#22312;&#24212;&#29992;&#65292;&#20026;&#22478;&#24066;&#35268;&#21010;&#21644; Kendall Square &#31561;&#22810;&#26679;&#21270;&#29615;&#22659;&#20013;&#30340;&#31038;&#21306;&#21442;&#19982;&#25552;&#20379;&#20102;&#23453;&#36149;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11314v1 Announce Type: cross  Abstract: In this study, we develop a multiple-generative agent system to simulate community decision-making for the redevelopment of Kendall Square's Volpe building. Drawing on interviews with local stakeholders, our simulations incorporated varying degrees of communication, demographic data, and life values in the agent prompts. The results revealed that communication among agents improved collective reasoning, while the inclusion of demographic and life values led to more distinct opinions. These findings highlight the potential application of AI in understanding complex social interactions and decision-making processes, offering valuable insights for urban planning and community engagement in diverse settings like Kendall Square.
&lt;/p&gt;</description></item></channel></rss>