<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#32852;&#37030;&#23398;&#20064;&#22312;&#22810;&#26234;&#33021;&#20307;&#26426;&#22120;&#20154;&#25506;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#21033;&#29992;&#38544;&#24335;&#31070;&#32463;&#26144;&#23556;&#21644;&#22320;&#29699;&#25968;&#25454;&#38598;&#19978;&#30340;&#20803;&#21021;&#22987;&#21270;&#65292;&#23454;&#29616;&#20102;&#23545;&#19981;&#21516;&#39046;&#22495;&#22914;&#28779;&#26143;&#22320;&#24418;&#21644;&#20912;&#24029;&#30340;&#24378;&#27867;&#21270;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2404.02289</link><description>&lt;p&gt;
&#34892;&#26143;&#25506;&#27979;&#30340;&#32852;&#37030;&#22810;&#26234;&#33021;&#20307;&#24314;&#22270;
&lt;/p&gt;
&lt;p&gt;
Federated Multi-Agent Mapping for Planetary Exploration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02289
&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#22312;&#22810;&#26234;&#33021;&#20307;&#26426;&#22120;&#20154;&#25506;&#27979;&#20013;&#30340;&#24212;&#29992;&#65292;&#21033;&#29992;&#38544;&#24335;&#31070;&#32463;&#26144;&#23556;&#21644;&#22320;&#29699;&#25968;&#25454;&#38598;&#19978;&#30340;&#20803;&#21021;&#22987;&#21270;&#65292;&#23454;&#29616;&#20102;&#23545;&#19981;&#21516;&#39046;&#22495;&#22914;&#28779;&#26143;&#22320;&#24418;&#21644;&#20912;&#24029;&#30340;&#24378;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#26234;&#33021;&#20307;&#26426;&#22120;&#20154;&#25506;&#27979;&#20013;&#65292;&#31649;&#29702;&#21644;&#26377;&#25928;&#21033;&#29992;&#21160;&#24577;&#29615;&#22659;&#20135;&#29983;&#30340;&#22823;&#37327;&#24322;&#26500;&#25968;&#25454;&#26500;&#25104;&#20102;&#19968;&#20010;&#37325;&#35201;&#25361;&#25112;&#12290;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#26159;&#19968;&#31181;&#26377;&#21069;&#36884;&#30340;&#20998;&#24067;&#24335;&#26144;&#23556;&#26041;&#27861;&#65292;&#23427;&#35299;&#20915;&#20102;&#21327;&#20316;&#23398;&#20064;&#20013;&#21435;&#20013;&#24515;&#21270;&#25968;&#25454;&#30340;&#25361;&#25112;&#12290;FL&#20351;&#22810;&#20010;&#26234;&#33021;&#20307;&#20043;&#38388;&#21487;&#20197;&#36827;&#34892;&#32852;&#21512;&#27169;&#22411;&#35757;&#32451;&#65292;&#32780;&#26080;&#38656;&#38598;&#20013;&#21270;&#25110;&#20849;&#20139;&#21407;&#22987;&#25968;&#25454;&#65292;&#20811;&#26381;&#20102;&#24102;&#23485;&#21644;&#23384;&#20648;&#38480;&#21046;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#38544;&#24335;&#31070;&#32463;&#26144;&#23556;&#65292;&#23558;&#22320;&#22270;&#34920;&#31034;&#20026;&#30001;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#30340;&#36830;&#32493;&#20989;&#25968;&#65292;&#20197;&#20415;&#23454;&#29616;&#32039;&#20945;&#21644;&#36866;&#24212;&#24615;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#36890;&#36807;&#22312;&#22320;&#29699;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20803;&#21021;&#22987;&#21270;&#26469;&#22686;&#24378;&#36825;&#19968;&#26041;&#27861;&#65292;&#39044;&#35757;&#32451;&#32593;&#32476;&#20197;&#24555;&#36895;&#23398;&#20064;&#26032;&#30340;&#22320;&#22270;&#32467;&#26500;&#12290;&#36825;&#31181;&#32452;&#21512;&#22312;&#35832;&#22914;&#28779;&#26143;&#22320;&#24418;&#21644;&#20912;&#24029;&#31561;&#19981;&#21516;&#39046;&#22495;&#23637;&#29616;&#20102;&#36739;&#24378;&#30340;&#27867;&#21270;&#33021;&#21147;&#12290;&#25105;&#20204;&#23545;&#36825;&#19968;&#26041;&#27861;&#36827;&#34892;&#20102;&#20005;&#26684;&#35780;&#20272;&#65292;&#23637;&#31034;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02289v1 Announce Type: cross  Abstract: In multi-agent robotic exploration, managing and effectively utilizing the vast, heterogeneous data generated from dynamic environments poses a significant challenge. Federated learning (FL) is a promising approach for distributed mapping, addressing the challenges of decentralized data in collaborative learning. FL enables joint model training across multiple agents without requiring the centralization or sharing of raw data, overcoming bandwidth and storage constraints. Our approach leverages implicit neural mapping, representing maps as continuous functions learned by neural networks, for compact and adaptable representations. We further enhance this approach with meta-initialization on Earth datasets, pre-training the network to quickly learn new map structures. This combination demonstrates strong generalization to diverse domains like Martian terrain and glaciers. We rigorously evaluate this approach, demonstrating its effectiven
&lt;/p&gt;</description></item><item><title>CEDAS&#25552;&#20986;&#20102;&#19968;&#31181;&#21387;&#32553;&#20998;&#24067;&#24335;&#38543;&#26426;&#26799;&#24230;&#26041;&#27861;&#65292;&#22312;&#26080;&#20559;&#21387;&#32553;&#36816;&#31639;&#31526;&#19979;&#20855;&#26377;&#19982;&#38598;&#20013;&#24335;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#30456;&#24403;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#23454;&#29616;&#20102;&#26368;&#30701;&#30340;&#30636;&#24577;&#26102;&#38388;&#65292;&#23545;&#20809;&#28369;&#24378;&#20984;&#21644;&#38750;&#20984;&#30446;&#26631;&#20989;&#25968;&#37117;&#36866;&#29992;&#12290;</title><link>https://arxiv.org/abs/2301.05872</link><description>&lt;p&gt;
CEDAS&#65306;&#19968;&#31181;&#20855;&#26377;&#25913;&#36827;&#25910;&#25947;&#24615;&#30340;&#21387;&#32553;&#20998;&#24067;&#24335;&#38543;&#26426;&#26799;&#24230;&#27861;
&lt;/p&gt;
&lt;p&gt;
CEDAS: A Compressed Decentralized Stochastic Gradient Method with Improved Convergence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2301.05872
&lt;/p&gt;
&lt;p&gt;
CEDAS&#25552;&#20986;&#20102;&#19968;&#31181;&#21387;&#32553;&#20998;&#24067;&#24335;&#38543;&#26426;&#26799;&#24230;&#26041;&#27861;&#65292;&#22312;&#26080;&#20559;&#21387;&#32553;&#36816;&#31639;&#31526;&#19979;&#20855;&#26377;&#19982;&#38598;&#20013;&#24335;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#30456;&#24403;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#23454;&#29616;&#20102;&#26368;&#30701;&#30340;&#30636;&#24577;&#26102;&#38388;&#65292;&#23545;&#20809;&#28369;&#24378;&#20984;&#21644;&#38750;&#20984;&#30446;&#26631;&#20989;&#25968;&#37117;&#36866;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#22312;&#36890;&#20449;&#21463;&#38480;&#29615;&#22659;&#19979;&#35299;&#20915;&#22810;&#20195;&#29702;&#32593;&#32476;&#19978;&#30340;&#20998;&#24067;&#24335;&#20248;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#31216;&#20026;&#8220;&#20855;&#26377;&#33258;&#36866;&#24212;&#27493;&#38271;&#30340;&#21387;&#32553;&#31934;&#30830;&#25193;&#25955;&#65288;CEDAS&#65289;&#8221;&#30340;&#21387;&#32553;&#20998;&#24067;&#24335;&#38543;&#26426;&#26799;&#24230;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#35813;&#26041;&#27861;&#22312;&#26080;&#20559;&#21387;&#32553;&#36816;&#31639;&#31526;&#19979;&#28176;&#36817;&#22320;&#23454;&#29616;&#20102;&#19982;&#38598;&#20013;&#24335;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#65288;SGD&#65289;&#30456;&#24403;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#36866;&#29992;&#20110;&#20809;&#28369;&#24378;&#20984;&#30446;&#26631;&#20989;&#25968;&#21644;&#20809;&#28369;&#38750;&#20984;&#30446;&#26631;&#20989;&#25968;&#12290;&#29305;&#21035;&#22320;&#65292;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;CEDAS&#36804;&#20170;&#20026;&#27490;&#20197;&#20854;&#26368;&#30701;&#30340;&#30636;&#24577;&#26102;&#38388;&#65288;&#20851;&#20110;&#22270;&#30340;&#29305;&#24615;&#65289;&#23454;&#29616;&#20102;&#19982;&#38598;&#20013;&#24335;SGD&#30456;&#21516;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#20854;&#22312;&#20809;&#28369;&#24378;&#20984;&#30446;&#26631;&#20989;&#25968;&#19979;&#34920;&#29616;&#20026;$\mathcal{O}(n{C^3}/(1-\lambda_2)^{2})$&#65292;&#22312;&#20809;&#28369;&#38750;&#20984;&#30446;&#26631;&#20989;&#25968;&#19979;&#34920;&#29616;&#20026;$\mathcal{O}(n^3{C^6}/(1-\lambda_2)^4)$&#65292;&#20854;&#20013;$(1-\lambda_2)$&#34920;&#31034;&#35889;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2301.05872v2 Announce Type: replace-cross  Abstract: In this paper, we consider solving the distributed optimization problem over a multi-agent network under the communication restricted setting. We study a compressed decentralized stochastic gradient method, termed ``compressed exact diffusion with adaptive stepsizes (CEDAS)", and show the method asymptotically achieves comparable convergence rate as centralized { stochastic gradient descent (SGD)} for both smooth strongly convex objective functions and smooth nonconvex objective functions under unbiased compression operators. In particular, to our knowledge, CEDAS enjoys so far the shortest transient time (with respect to the graph specifics) for achieving the convergence rate of centralized SGD, which behaves as $\mathcal{O}(n{C^3}/(1-\lambda_2)^{2})$ under smooth strongly convex objective functions, and $\mathcal{O}(n^3{C^6}/(1-\lambda_2)^4)$ under smooth nonconvex objective functions, where $(1-\lambda_2)$ denotes the spectr
&lt;/p&gt;</description></item></channel></rss>