<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;PsychoGAT&#65288;&#24515;&#29702;&#28216;&#25103;&#20195;&#29702;&#65289;&#20197;&#23454;&#29616;&#24515;&#29702;&#35780;&#20272;&#30340;&#36890;&#29992;&#28216;&#25103;&#21270;&#65292;&#36890;&#36807;&#23558;&#24378;&#22823;&#30340;LLM&#20195;&#29702;&#32435;&#20837;&#35282;&#33394;&#65292;&#23558;&#26631;&#20934;&#37327;&#34920;&#36716;&#21270;&#20026;&#20010;&#24615;&#21270;&#19988;&#20855;&#26377;&#21560;&#24341;&#21147;&#30340;&#20114;&#21160;&#23567;&#35828;&#28216;&#25103;&#12290;</title><link>https://arxiv.org/abs/2402.12326</link><description>&lt;p&gt;
&#22522;&#20110;LLM&#30340;&#24515;&#29702;&#23398;&#26234;&#33021;&#20195;&#29702;&#65306;&#19968;&#39033;&#20851;&#20110;&#28216;&#25103;&#21270;&#35780;&#20272;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
LLM Agents for Psychology: A Study on Gamified Assessments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12326
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;PsychoGAT&#65288;&#24515;&#29702;&#28216;&#25103;&#20195;&#29702;&#65289;&#20197;&#23454;&#29616;&#24515;&#29702;&#35780;&#20272;&#30340;&#36890;&#29992;&#28216;&#25103;&#21270;&#65292;&#36890;&#36807;&#23558;&#24378;&#22823;&#30340;LLM&#20195;&#29702;&#32435;&#20837;&#35282;&#33394;&#65292;&#23558;&#26631;&#20934;&#37327;&#34920;&#36716;&#21270;&#20026;&#20010;&#24615;&#21270;&#19988;&#20855;&#26377;&#21560;&#24341;&#21147;&#30340;&#20114;&#21160;&#23567;&#35828;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24515;&#29702;&#27979;&#37327;&#23545;&#20110;&#31934;&#31070;&#20581;&#24247;&#12289;&#33258;&#25105;&#29702;&#35299;&#21644;&#20010;&#20154;&#21457;&#23637;&#33267;&#20851;&#37325;&#35201;&#12290;&#20256;&#32479;&#26041;&#27861;&#65292;&#22914;&#33258;&#25105;&#25253;&#21578;&#37327;&#34920;&#21644;&#24515;&#29702;&#23398;&#23478;&#35775;&#35848;&#65292;&#24120;&#24120;&#38754;&#20020;&#21442;&#19982;&#24230;&#21644;&#21487;&#33719;&#24471;&#24615;&#26041;&#38754;&#30340;&#25361;&#25112;&#12290;&#34429;&#28982;&#24050;&#32463;&#25506;&#35752;&#20102;&#22522;&#20110;&#28216;&#25103;&#21644;LLM&#30340;&#24037;&#20855;&#26469;&#25552;&#39640;&#29992;&#25143;&#20852;&#36259;&#24182;&#33258;&#21160;&#21270;&#35780;&#20272;&#65292;&#20294;&#23427;&#20204;&#38590;&#20197;&#24179;&#34913;&#21442;&#19982;&#24230;&#21644;&#26222;&#36866;&#24615;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;PsychoGAT&#65288;&#24515;&#29702;&#28216;&#25103;&#20195;&#29702;&#65289;&#65292;&#20197;&#23454;&#29616;&#24515;&#29702;&#35780;&#20272;&#30340;&#36890;&#29992;&#28216;&#25103;&#21270;&#12290;&#20027;&#35201;&#27934;&#23519;&#26159;&#24378;&#22823;&#30340;LLM&#26082;&#21487;&#20197;&#20805;&#24403;&#29087;&#32451;&#30340;&#24515;&#29702;&#23398;&#23478;&#65292;&#20063;&#21487;&#20197;&#26159;&#21019;&#26032;&#30340;&#28216;&#25103;&#35774;&#35745;&#24072;&#12290;&#36890;&#36807;&#23558;LLM&#20195;&#29702;&#32435;&#20837;&#25351;&#23450;&#35282;&#33394;&#24182;&#31934;&#24515;&#31649;&#29702;&#23427;&#20204;&#30340;&#20114;&#21160;&#65292;PsychoGAT&#21487;&#20197;&#23558;&#20219;&#20309;&#26631;&#20934;&#37327;&#34920;&#36716;&#21270;&#20026;&#20010;&#24615;&#21270;&#19988;&#20855;&#26377;&#21560;&#24341;&#21147;&#30340;&#20114;&#21160;&#23567;&#35828;&#28216;&#25103;&#12290;&#20026;&#39564;&#35777;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#36827;&#34892;&#24515;&#29702;&#24230;&#37327;&#35780;&#20272;&#20197;&#35780;&#20272;&#20854;&#26377;&#25928;&#24615;&#65292;&#24182;&#20351;&#29992;&#20154;&#31867;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12326v1 Announce Type: new  Abstract: Psychological measurement is essential for mental health, self-understanding, and personal development. Traditional methods, such as self-report scales and psychologist interviews, often face challenges with engagement and accessibility. While game-based and LLM-based tools have been explored to improve user interest and automate assessment, they struggle to balance engagement with generalizability. In this work, we propose PsychoGAT (Psychological Game AgenTs) to achieve a generic gamification of psychological assessment. The main insight is that powerful LLMs can function both as adept psychologists and innovative game designers. By incorporating LLM agents into designated roles and carefully managing their interactions, PsychoGAT can transform any standardized scales into personalized and engaging interactive fiction games. To validate the proposed method, we conduct psychometric evaluations to assess its effectiveness and employ huma
&lt;/p&gt;</description></item></channel></rss>