<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#65292;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#24895;&#26223;&#65292;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20026;&#31038;&#20250;&#29616;&#35937;&#25552;&#20379;&#27934;&#23519;&#12290;</title><link>https://arxiv.org/abs/2402.12327</link><description>&lt;p&gt;
&#25105;&#20204;&#24212;&#35813;&#20132;&#27969;&#21527;&#65306;&#25506;&#32034;&#31454;&#20105;LLM&#20195;&#29702;&#20043;&#38388;&#30340;&#33258;&#21457;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Shall We Talk: Exploring Spontaneous Collaborations of Competing LLM Agents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12327
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#65292;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#24895;&#26223;&#65292;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20026;&#31038;&#20250;&#29616;&#35937;&#25552;&#20379;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#36827;&#23637;&#34920;&#26126;&#65292;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#39537;&#21160;&#30340;&#20195;&#29702;&#20855;&#26377;&#27169;&#25311;&#20154;&#31867;&#34892;&#20026;&#21644;&#31038;&#20250;&#21160;&#24577;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#23578;&#26410;&#30740;&#31350;LLM&#20195;&#29702;&#22312;&#27809;&#26377;&#26126;&#30830;&#25351;&#20196;&#30340;&#24773;&#20917;&#19979;&#33258;&#21457;&#24314;&#31435;&#21512;&#20316;&#20851;&#31995;&#30340;&#28508;&#21147;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19977;&#39033;&#26696;&#20363;&#30740;&#31350;&#65292;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#12290;&#36825;&#19968;&#21457;&#29616;&#19981;&#20165;&#23637;&#31034;&#20102;LLM&#20195;&#29702;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20013;&#31454;&#20105;&#19982;&#21512;&#20316;&#30340;&#33021;&#21147;&#65292;&#20063;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#24895;&#26223;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#36825;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#24314;&#27169;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#37027;&#20123;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20174;&#32780;&#25552;&#20379;&#23545;&#31038;&#20250;&#29616;&#35937;&#30340;&#27934;&#23519;&#12290;&#36825;&#39033;&#30740;&#31350;&#30340;&#28304;&#20195;&#30721;&#21487;&#22312;https://github.com/wuzengqing001225/SABM_ShallWe &#25214;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12327v1 Announce Type: new  Abstract: Recent advancements have shown that agents powered by large language models (LLMs) possess capabilities to simulate human behaviors and societal dynamics. However, the potential for LLM agents to spontaneously establish collaborative relationships in the absence of explicit instructions has not been studied. To address this gap, we conduct three case studies, revealing that LLM agents are capable of spontaneously forming collaborations even within competitive settings. This finding not only demonstrates the capacity of LLM agents to mimic competition and cooperation in human societies but also validates a promising vision of computational social science. Specifically, it suggests that LLM agents could be utilized to model human social interactions, including those with spontaneous collaborations, thus offering insights into social phenomena. The source codes for this study are available at https://github.com/wuzengqing001225/SABM_ShallWe
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#26694;&#26550;&#65292;&#36890;&#36807;&#23398;&#20064;&#31995;&#32479;&#21644;&#20195;&#29702;&#30340;&#34920;&#31034;&#65292;&#20351;&#29992;&#26102;&#31354;&#19968;&#33268;&#24615;&#23398;&#20064;&#26469;&#25429;&#25417;&#22797;&#26434;&#36866;&#24212;&#24615;&#31995;&#32479;&#20013;&#30340;&#29616;&#35937;&#65292;&#24182;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#19981;&#33021;&#25429;&#25417;&#31354;&#38388;&#27169;&#24335;&#21644;&#24314;&#27169;&#38750;&#32447;&#24615;&#20851;&#31995;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.10300</link><description>&lt;p&gt;
&#29992;&#20110;&#22797;&#26434;&#36866;&#24212;&#24615;&#31995;&#32479;&#20013;&#30340;&#29616;&#35937;&#26816;&#27979;&#30340;&#20855;&#26377;&#26102;&#31354;&#19968;&#33268;&#24615;&#23398;&#20064;&#30340;&#20998;&#23618;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Hierarchical Framework with Spatio-Temporal Consistency Learning for Emergence Detection in Complex Adaptive Systems. (arXiv:2401.10300v1 [cs.MA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10300
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#26694;&#26550;&#65292;&#36890;&#36807;&#23398;&#20064;&#31995;&#32479;&#21644;&#20195;&#29702;&#30340;&#34920;&#31034;&#65292;&#20351;&#29992;&#26102;&#31354;&#19968;&#33268;&#24615;&#23398;&#20064;&#26469;&#25429;&#25417;&#22797;&#26434;&#36866;&#24212;&#24615;&#31995;&#32479;&#20013;&#30340;&#29616;&#35937;&#65292;&#24182;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#19981;&#33021;&#25429;&#25417;&#31354;&#38388;&#27169;&#24335;&#21644;&#24314;&#27169;&#38750;&#32447;&#24615;&#20851;&#31995;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#30001;&#20132;&#20114;&#20195;&#29702;&#32452;&#25104;&#30340;&#22797;&#26434;&#36866;&#24212;&#24615;&#31995;&#32479;&#65288;CAS&#65289;&#20013;&#65292;&#29616;&#35937;&#26159;&#19968;&#31181;&#20840;&#23616;&#23646;&#24615;&#65292;&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#21160;&#24577;&#31995;&#32479;&#20013;&#24456;&#26222;&#36941;&#65292;&#20363;&#22914;&#32593;&#32476;&#23618;&#27425;&#30340;&#20132;&#36890;&#25317;&#22581;&#12290;&#26816;&#27979;&#23427;&#30340;&#24418;&#25104;&#21644;&#28040;&#25955;&#26377;&#21161;&#20110;&#30417;&#27979;&#31995;&#32479;&#30340;&#29366;&#24577;&#65292;&#24182;&#21457;&#20986;&#26377;&#23475;&#29616;&#35937;&#30340;&#35686;&#25253;&#20449;&#21495;&#12290;&#30001;&#20110;CAS&#27809;&#26377;&#38598;&#20013;&#24335;&#25511;&#21046;&#22120;&#65292;&#22522;&#20110;&#27599;&#20010;&#20195;&#29702;&#30340;&#23616;&#37096;&#35266;&#23519;&#26469;&#26816;&#27979;&#29616;&#35937;&#26159;&#21487;&#21462;&#20294;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#29616;&#26377;&#30340;&#24037;&#20316;&#19981;&#33021;&#25429;&#25417;&#19982;&#29616;&#35937;&#30456;&#20851;&#30340;&#31354;&#38388;&#27169;&#24335;&#65292;&#24182;&#19988;&#26080;&#27861;&#24314;&#27169;&#20195;&#29702;&#20043;&#38388;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#26694;&#26550;&#65292;&#36890;&#36807;&#23398;&#20064;&#31995;&#32479;&#34920;&#31034;&#21644;&#20195;&#29702;&#34920;&#31034;&#26469;&#35299;&#20915;&#36825;&#20004;&#20010;&#38382;&#39064;&#65292;&#20854;&#20013;&#26102;&#31354;&#19968;&#33268;&#24615;&#23398;&#20064;&#22120;&#38024;&#23545;&#20195;&#29702;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#21644;&#31995;&#32479;&#30340;&#22797;&#26434;&#28436;&#21270;&#36827;&#34892;&#20102;&#23450;&#21046;&#12290;&#36890;&#36807;&#20445;&#30041;&#26368;&#26032;100&#20010;&#20195;&#29702;&#30340;&#29366;&#24577;&#21644;&#21382;&#21490;&#29366;&#24577;&#26469;&#23398;&#20064;&#20195;&#29702;&#21644;&#31995;&#32479;&#30340;&#34920;&#31034;&#65292;
&lt;/p&gt;
&lt;p&gt;
Emergence, a global property of complex adaptive systems (CASs) constituted by interactive agents, is prevalent in real-world dynamic systems, e.g., network-level traffic congestions. Detecting its formation and evaporation helps to monitor the state of a system, allowing to issue a warning signal for harmful emergent phenomena. Since there is no centralized controller of CAS, detecting emergence based on each agent's local observation is desirable but challenging. Existing works are unable to capture emergence-related spatial patterns, and fail to model the nonlinear relationships among agents. This paper proposes a hierarchical framework with spatio-temporal consistency learning to solve these two problems by learning the system representation and agent representations, respectively. Especially, spatio-temporal encoders are tailored to capture agents' nonlinear relationships and the system's complex evolution. Representations of the agents and the system are learned by preserving the
&lt;/p&gt;</description></item></channel></rss>