<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#29983;&#25104;&#25193;&#25955;&#24341;&#23548;&#26694;&#26550;&#65292;&#36890;&#36807;&#21033;&#29992;&#25193;&#25955;&#27169;&#22411;&#22312;&#21512;&#25104;&#22810;&#23186;&#20307;&#20869;&#23481;&#21516;&#26102;&#20445;&#30041;&#35821;&#20041;&#29305;&#24449;&#26041;&#38754;&#30340;&#20248;&#21183;&#65292;&#20197;&#21457;&#36865;&#39640;&#24230;&#21387;&#32553;&#30340;&#35821;&#20041;&#20449;&#24687;&#26469;&#38477;&#20302;&#24102;&#23485;&#20351;&#29992;&#65292;&#20174;&#32780;&#36229;&#36234;&#29616;&#26377;&#26041;&#27861;&#22312;&#37325;&#24314;&#36136;&#37327;&#21644;&#35821;&#20041;&#20445;&#30041;&#26041;&#38754;&#30340;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2306.04321</link><description>&lt;p&gt;
&#29983;&#25104;&#35821;&#20041;&#36890;&#35759;&#65306;&#36229;&#36234;&#27604;&#29305;&#24674;&#22797;&#30340;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Generative Semantic Communication: Diffusion Models Beyond Bit Recovery. (arXiv:2306.04321v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#29983;&#25104;&#25193;&#25955;&#24341;&#23548;&#26694;&#26550;&#65292;&#36890;&#36807;&#21033;&#29992;&#25193;&#25955;&#27169;&#22411;&#22312;&#21512;&#25104;&#22810;&#23186;&#20307;&#20869;&#23481;&#21516;&#26102;&#20445;&#30041;&#35821;&#20041;&#29305;&#24449;&#26041;&#38754;&#30340;&#20248;&#21183;&#65292;&#20197;&#21457;&#36865;&#39640;&#24230;&#21387;&#32553;&#30340;&#35821;&#20041;&#20449;&#24687;&#26469;&#38477;&#20302;&#24102;&#23485;&#20351;&#29992;&#65292;&#20174;&#32780;&#36229;&#36234;&#29616;&#26377;&#26041;&#27861;&#22312;&#37325;&#24314;&#36136;&#37327;&#21644;&#35821;&#20041;&#20445;&#30041;&#26041;&#38754;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#20041;&#36890;&#35759;&#34987;&#35748;&#20026;&#26159;&#19979;&#19968;&#20195;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#36890;&#35759;&#20013;&#30340;&#26680;&#24515;&#20043;&#19968;&#12290;&#35821;&#20041;&#36890;&#35759;&#30340;&#19968;&#20010;&#21487;&#33021;&#24615;&#26159;&#65292;&#22312;&#19981;&#24517;&#24674;&#22797;&#20256;&#36755;&#27604;&#29305;&#24207;&#21015;&#30340;&#24773;&#20917;&#19979;&#65292;&#22312;&#30446;&#26631;&#31471;&#37325;&#24314;&#19982;&#20256;&#36755;&#30340;&#22270;&#20687;&#25110;&#35270;&#39057;&#35821;&#20041;&#31561;&#25928;&#30340;&#21103;&#26412;&#12290;&#24403;&#21069;&#30340;&#35299;&#20915;&#26041;&#26696;&#20173;&#28982;&#32570;&#20047;&#20174;&#25509;&#25910;&#21040;&#30340;&#37096;&#20998;&#20449;&#24687;&#20013;&#26500;&#24314;&#22797;&#26434;&#22330;&#26223;&#30340;&#33021;&#21147;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#29983;&#25104;&#25193;&#25955;&#24341;&#23548;&#26694;&#26550;&#26469;&#24357;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#35813;&#26694;&#26550;&#21033;&#29992;&#20102;&#25193;&#25955;&#27169;&#22411;&#22312;&#21512;&#25104;&#22810;&#23186;&#20307;&#20869;&#23481;&#21516;&#26102;&#20445;&#30041;&#35821;&#20041;&#29305;&#24449;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;&#25105;&#20204;&#36890;&#36807;&#20165;&#21457;&#36865;&#39640;&#24230;&#21387;&#32553;&#30340;&#35821;&#20041;&#20449;&#24687;&#26469;&#38477;&#20302;&#24102;&#23485;&#20351;&#29992;&#12290;&#28982;&#21518;&#25509;&#25910;&#31471;&#30340;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#22810;&#23186;&#20307;&#20869;&#23481;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#26694;&#26550;&#22312;&#37325;&#24314;&#36136;&#37327;&#21644;&#35821;&#20041;&#20445;&#30041;&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Semantic communication is expected to be one of the cores of next-generation AI-based communications. One of the possibilities offered by semantic communication is the capability to regenerate, at the destination side, images or videos semantically equivalent to the transmitted ones, without necessarily recovering the transmitted sequence of bits. The current solutions still lack the ability to build complex scenes from the received partial information. Clearly, there is an unmet need to balance the effectiveness of generation methods and the complexity of the transmitted information, possibly taking into account the goal of communication. In this paper, we aim to bridge this gap by proposing a novel generative diffusion-guided framework for semantic communication that leverages the strong abilities of diffusion models in synthesizing multimedia content while preserving semantic features. We reduce bandwidth usage by sending highly-compressed semantic information only. Then, the diffus
&lt;/p&gt;</description></item></channel></rss>