<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#30740;&#31350;&#20102;&#20855;&#26377;&#35268;&#27169;&#25928;&#24212;&#30340;&#35774;&#26045;&#36873;&#22336;&#28216;&#25103;&#65292;&#25552;&#20379;&#20102;&#23545;&#20110;&#36830;&#32493;&#27604;&#20363;&#20989;&#25968;&#21644;&#20998;&#27573;&#32447;&#24615;&#27604;&#20363;&#20989;&#25968;&#30340;&#32467;&#26524;&#65292;&#36866;&#29992;&#20110;&#35768;&#22810;&#23454;&#38469;&#24773;&#26223;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;&#36817;&#20284;&#26426;&#21046;&#35774;&#35745;&#35774;&#32622;&#19979;&#20195;&#29702;&#21487;&#33021;&#19981;&#20877;&#21333;&#23792;&#20559;&#22909;&#30340;&#26465;&#20214;&#19982;&#25104;&#26412;&#36817;&#20284;&#27604;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.18908</link><description>&lt;p&gt;
&#20855;&#26377;&#35268;&#27169;&#25928;&#24212;&#30340;&#35774;&#26045;&#36873;&#22336;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Facility Location Games with Scaling Effects
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18908
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#20855;&#26377;&#35268;&#27169;&#25928;&#24212;&#30340;&#35774;&#26045;&#36873;&#22336;&#28216;&#25103;&#65292;&#25552;&#20379;&#20102;&#23545;&#20110;&#36830;&#32493;&#27604;&#20363;&#20989;&#25968;&#21644;&#20998;&#27573;&#32447;&#24615;&#27604;&#20363;&#20989;&#25968;&#30340;&#32467;&#26524;&#65292;&#36866;&#29992;&#20110;&#35768;&#22810;&#23454;&#38469;&#24773;&#26223;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;&#36817;&#20284;&#26426;&#21046;&#35774;&#35745;&#35774;&#32622;&#19979;&#20195;&#29702;&#21487;&#33021;&#19981;&#20877;&#21333;&#23792;&#20559;&#22909;&#30340;&#26465;&#20214;&#19982;&#25104;&#26412;&#36817;&#20284;&#27604;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#32463;&#20856;&#30340;&#35774;&#26045;&#36873;&#22336;&#38382;&#39064;&#30340;&#19968;&#20010;&#21464;&#31181;&#65292;&#20854;&#20013;&#27599;&#20010;&#20195;&#29702;&#30340;&#20010;&#20154;&#25104;&#26412;&#20989;&#25968;&#31561;&#20110;&#20182;&#20204;&#36317;&#31163;&#35774;&#26045;&#30340;&#36317;&#31163;&#20056;&#20197;&#19968;&#20010;&#30001;&#35774;&#26045;&#20301;&#32622;&#30830;&#23450;&#30340;&#27604;&#20363;&#22240;&#23376;&#12290;&#38500;&#20102;&#19968;&#33324;&#31867;&#21035;&#30340;&#36830;&#32493;&#27604;&#20363;&#20989;&#25968;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#36866;&#29992;&#20110;&#35768;&#22810;&#23454;&#38469;&#24773;&#26223;&#30340;&#27604;&#20363;&#20989;&#25968;&#30340;&#20998;&#27573;&#32447;&#24615;&#27604;&#20363;&#20989;&#25968;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#20851;&#27880;&#24635;&#25104;&#26412;&#21644;&#26368;&#22823;&#25104;&#26412;&#30340;&#30446;&#26631;&#65292;&#24182;&#25551;&#36848;&#20102;&#26368;&#20248;&#35299;&#30340;&#35745;&#31639;&#12290;&#28982;&#21518;&#25105;&#20204;&#36716;&#21521;&#36817;&#20284;&#26426;&#21046;&#35774;&#35745;&#35774;&#32622;&#65292;&#35266;&#23519;&#21040;&#20195;&#29702;&#30340;&#20559;&#22909;&#21487;&#33021;&#19981;&#20877;&#26159;&#21333;&#23792;&#30340;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#34920;&#24449;&#20102;&#30830;&#20445;&#20195;&#29702;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#27604;&#20363;&#20989;&#25968;&#26465;&#20214;&#12290;&#22312;&#36825;&#20123;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#33021;&#22815;&#36890;&#36807;strategyproof&#21644;anonymous me&#36798;&#21040;&#30340;&#24635;&#25104;&#26412;&#21644;&#26368;&#22823;&#25104;&#26412;&#36817;&#20284;&#27604;&#29575;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18908v1 Announce Type: cross  Abstract: We take the classic facility location problem and consider a variation, in which each agent's individual cost function is equal to their distance from the facility multiplied by a scaling factor which is determined by the facility placement. In addition to the general class of continuous scaling functions, we also provide results for piecewise linear scaling functions which can effectively approximate or model the scaling of many real world scenarios. We focus on the objectives of total and maximum cost, describing the computation of the optimal solution. We then move to the approximate mechanism design setting, observing that the agents' preferences may no longer be single-peaked. Consequently, we characterize the conditions on scaling functions which ensure that agents have single-peaked preferences. Under these conditions, we find results on the total and maximum cost approximation ratios achievable by strategyproof and anonymous me
&lt;/p&gt;</description></item></channel></rss>