<rss version="2.0"><channel><title>Chat Arxiv cs.MS</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MS</description><item><title>SMT 2.0&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#20195;&#29702;&#27169;&#22411;&#24037;&#20855;&#21253;&#65292;&#24341;&#20837;&#20102;&#22788;&#29702;&#28151;&#21512;&#21464;&#37327;&#21644;&#23618;&#27425;&#21464;&#37327;&#30340;&#33021;&#21147;&#65292;&#24182;&#36890;&#36807;&#25193;&#23637;&#37319;&#26679;&#26041;&#27861;&#12289;&#28155;&#21152;&#26032;&#30340;&#20195;&#29702;&#27169;&#22411;&#20197;&#21450;&#35745;&#31639;Kriging&#30340;&#26041;&#24046;&#21644;&#26680;&#23548;&#25968;&#26469;&#25913;&#36827;&#20102;SMT&#12290;</title><link>http://arxiv.org/abs/2305.13998</link><description>&lt;p&gt;
SMT 2.0&#65306;&#19968;&#20010;&#20851;&#27880;&#23618;&#27425;&#21644;&#28151;&#21512;&#21464;&#37327;&#39640;&#26031;&#36807;&#31243;&#30340;&#20195;&#29702;&#27169;&#22411;&#24037;&#20855;&#21253;
&lt;/p&gt;
&lt;p&gt;
SMT 2.0: A Surrogate Modeling Toolbox with a focus on Hierarchical and Mixed Variables Gaussian Processes. (arXiv:2305.13998v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13998
&lt;/p&gt;
&lt;p&gt;
SMT 2.0&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#20195;&#29702;&#27169;&#22411;&#24037;&#20855;&#21253;&#65292;&#24341;&#20837;&#20102;&#22788;&#29702;&#28151;&#21512;&#21464;&#37327;&#21644;&#23618;&#27425;&#21464;&#37327;&#30340;&#33021;&#21147;&#65292;&#24182;&#36890;&#36807;&#25193;&#23637;&#37319;&#26679;&#26041;&#27861;&#12289;&#28155;&#21152;&#26032;&#30340;&#20195;&#29702;&#27169;&#22411;&#20197;&#21450;&#35745;&#31639;Kriging&#30340;&#26041;&#24046;&#21644;&#26680;&#23548;&#25968;&#26469;&#25913;&#36827;&#20102;SMT&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Surrogate Modeling Toolbox (SMT)&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;Python&#21253;&#65292;&#25552;&#20379;&#20102;&#19968;&#31995;&#21015;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#12289;&#37319;&#26679;&#25216;&#26415;&#21644;&#19968;&#22871;&#31034;&#20363;&#38382;&#39064;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;SMT 2.0&#65292;&#36825;&#26159;SMT&#30340;&#19968;&#20010;&#37325;&#35201;&#26032;&#29256;&#26412;&#65292;&#24341;&#20837;&#20102;&#26174;&#33879;&#30340;&#21319;&#32423;&#21644;&#26032;&#21151;&#33021;&#12290;&#36825;&#20010;&#29256;&#26412;&#22686;&#21152;&#20102;&#22788;&#29702;&#28151;&#21512;&#21464;&#37327;&#20195;&#29702;&#27169;&#22411;&#21644;&#23618;&#27425;&#21464;&#37327;&#30340;&#33021;&#21147;&#12290;&#36825;&#20123;&#31867;&#22411;&#30340;&#21464;&#37327;&#22312;&#22810;&#20010;&#20195;&#29702;&#24314;&#27169;&#24212;&#29992;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;SMT 2.0&#36824;&#36890;&#36807;&#25193;&#23637;&#37319;&#26679;&#26041;&#27861;&#12289;&#28155;&#21152;&#26032;&#30340;&#20195;&#29702;&#27169;&#22411;&#20197;&#21450;&#35745;&#31639;Kriging&#30340;&#26041;&#24046;&#21644;&#26680;&#23548;&#25968;&#26469;&#25913;&#36827;&#20102;SMT&#12290;&#36825;&#20010;&#29256;&#26412;&#36824;&#21253;&#25324;&#20102;&#22788;&#29702;&#24102;&#22122;&#22768;&#21644;&#20351;&#29992;&#22810;&#20445;&#30495;&#24230;&#25968;&#25454;&#30340;&#26032;&#20989;&#25968;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;SMT 2.0&#26159;&#31532;&#19968;&#20010;&#25552;&#20986;&#23618;&#27425;&#21644;&#28151;&#21512;&#36755;&#20837;&#30340;&#24320;&#28304;&#20195;&#29702;&#24211;&#12290;&#36825;&#20010;&#24320;&#28304;&#36719;&#20214;&#37319;&#29992;New BSD&#35768;&#21487;&#35777;&#36827;&#34892;&#20998;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Surrogate Modeling Toolbox (SMT) is an open-source Python package that offers a collection of surrogate modeling methods, sampling techniques, and a set of sample problems. This paper presents SMT 2.0, a major new release of SMT that introduces significant upgrades and new features to the toolbox. This release adds the capability to handle mixed-variable surrogate models and hierarchical variables. These types of variables are becoming increasingly important in several surrogate modeling applications. SMT 2.0 also improves SMT by extending sampling methods, adding new surrogate models, and computing variance and kernel derivatives for Kriging. This release also includes new functions to handle noisy and use multifidelity data. To the best of our knowledge, SMT 2.0 is the first open-source surrogate library to propose surrogate models for hierarchical and mixed inputs. This open-source software is distributed under the New BSD license.
&lt;/p&gt;</description></item></channel></rss>