<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;LaunchpadGPT&#27169;&#22411;&#65292;&#21033;&#29992;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#38899;&#20048;&#21487;&#35270;&#21270;&#35774;&#35745;&#65292;&#24182;&#23637;&#31034;&#20986;&#20248;&#20110;&#38543;&#26426;&#29983;&#25104;&#26041;&#27861;&#30340;&#25928;&#26524;&#65292;&#20855;&#26377;&#24191;&#27867;&#30340;&#38899;&#20048;&#21487;&#35270;&#21270;&#24212;&#29992;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2307.04827</link><description>&lt;p&gt;
LaunchpadGPT: &#20197;&#35821;&#35328;&#27169;&#22411;&#20316;&#20026;&#38899;&#20048;&#21487;&#35270;&#21270;&#35774;&#35745;&#24072;&#22312;Launchpad&#19978;
&lt;/p&gt;
&lt;p&gt;
LaunchpadGPT: Language Model as Music Visualization Designer on Launchpad. (arXiv:2307.04827v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04827
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;LaunchpadGPT&#27169;&#22411;&#65292;&#21033;&#29992;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#38899;&#20048;&#21487;&#35270;&#21270;&#35774;&#35745;&#65292;&#24182;&#23637;&#31034;&#20986;&#20248;&#20110;&#38543;&#26426;&#29983;&#25104;&#26041;&#27861;&#30340;&#25928;&#26524;&#65292;&#20855;&#26377;&#24191;&#27867;&#30340;&#38899;&#20048;&#21487;&#35270;&#21270;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Launchpad&#26159;&#19968;&#31181;&#20048;&#22120;&#65292;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#25353;&#20142;&#30340;&#25353;&#38062;&#26469;&#21019;&#20316;&#21644;&#28436;&#22863;&#38899;&#20048;&#12290;&#20026;&#20102;&#36741;&#21161;&#21644;&#21551;&#21457;Launchpad&#28783;&#20809;&#25928;&#26524;&#30340;&#35774;&#35745;&#65292;&#24182;&#20026;&#21021;&#23398;&#32773;&#25552;&#20379;&#26356;&#26131;&#20110;&#20351;&#29992;&#30340;&#26041;&#27861;&#26469;&#36890;&#36807;&#36825;&#20010;&#20048;&#22120;&#21019;&#24314;&#38899;&#20048;&#21487;&#35270;&#21270;&#25928;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;LaunchpadGPT&#27169;&#22411;&#65292;&#21487;&#20197;&#33258;&#21160;&#29983;&#25104;Launchpad&#19978;&#30340;&#38899;&#20048;&#21487;&#35270;&#21270;&#35774;&#35745;&#12290;&#22522;&#20110;&#20855;&#26377;&#20986;&#33394;&#29983;&#25104;&#33021;&#21147;&#30340;&#35821;&#35328;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;LaunchpadGPT&#27169;&#22411;&#20197;&#38899;&#39057;&#38899;&#20048;&#20316;&#20026;&#36755;&#20837;&#65292;&#24182;&#36755;&#20986;&#20197;&#35270;&#39057;&#24418;&#24335;&#34920;&#29616;Launchpad&#28436;&#22863;&#30340;&#28783;&#20809;&#25928;&#26524;&#65288;Launchpad&#25773;&#25918;&#35270;&#39057;&#65289;&#12290;&#25105;&#20204;&#25910;&#38598;Launchpad&#28436;&#22863;&#35270;&#39057;&#24182;&#36827;&#34892;&#22788;&#29702;&#65292;&#20197;&#33719;&#21462;&#38899;&#20048;&#21644;&#30456;&#24212;&#30340;Launchpad&#28436;&#22863;&#35270;&#39057;&#24103;&#20316;&#20026;&#25552;&#31034;&#23436;&#25104;&#23545;&#65292;&#29992;&#20110;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#27604;&#38543;&#26426;&#29983;&#25104;&#26041;&#27861;&#21487;&#20197;&#21019;&#36896;&#20986;&#26356;&#22909;&#30340;&#38899;&#20048;&#21487;&#35270;&#21270;&#25928;&#26524;&#65292;&#24182;&#20855;&#26377;&#26356;&#24191;&#27867;&#30340;&#38899;&#20048;&#21487;&#35270;&#21270;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Launchpad is a musical instrument that allows users to create and perform music by pressing illuminated buttons. To assist and inspire the design of the Launchpad light effect, and provide a more accessible approach for beginners to create music visualization with this instrument, we proposed the LaunchpadGPT model to generate music visualization designs on Launchpad automatically. Based on the language model with excellent generation ability, our proposed LaunchpadGPT takes an audio piece of music as input and outputs the lighting effects of Launchpad-playing in the form of a video (Launchpad-playing video). We collect Launchpad-playing videos and process them to obtain music and corresponding video frame of Launchpad-playing as prompt-completion pairs, to train the language model. The experiment result shows the proposed method can create better music visualization than random generation methods and hold the potential for a broader range of music visualization applications. Our code 
&lt;/p&gt;</description></item></channel></rss>