<rss version="2.0"><channel><title>Chat Arxiv cs.MM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MM</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#30340;&#32852;&#21512;&#28304;-&#20449;&#36947;&#32534;&#30721;&#21644;&#21435;&#22122;&#25193;&#25955;&#27169;&#22411;&#22312;&#22122;&#22768;&#26080;&#32447;&#20449;&#36947;&#19978;&#36827;&#34892;&#22270;&#20687;&#20256;&#36755;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#21033;&#29992;&#33539;&#22260;-&#38646;&#31354;&#38388;&#20998;&#35299;&#21644;&#36880;&#27493;&#20248;&#21270;&#38646;&#31354;&#38388;&#20869;&#23481;&#65292;&#23454;&#29616;&#20102;&#22312;&#22833;&#30495;&#21644;&#24863;&#30693;&#36136;&#37327;&#26041;&#38754;&#30340;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2309.15889</link><description>&lt;p&gt;
&#20351;&#29992;&#21435;&#22122;&#25193;&#25955;&#27169;&#22411;&#23454;&#29616;&#39640;&#24863;&#30693;&#36136;&#37327;&#30340;&#26080;&#32447;&#22270;&#20687;&#20256;&#36755;
&lt;/p&gt;
&lt;p&gt;
High Perceptual Quality Wireless Image Delivery with Denoising Diffusion Models. (arXiv:2309.15889v1 [eess.IV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15889
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#30340;&#32852;&#21512;&#28304;-&#20449;&#36947;&#32534;&#30721;&#21644;&#21435;&#22122;&#25193;&#25955;&#27169;&#22411;&#22312;&#22122;&#22768;&#26080;&#32447;&#20449;&#36947;&#19978;&#36827;&#34892;&#22270;&#20687;&#20256;&#36755;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#21033;&#29992;&#33539;&#22260;-&#38646;&#31354;&#38388;&#20998;&#35299;&#21644;&#36880;&#27493;&#20248;&#21270;&#38646;&#31354;&#38388;&#20869;&#23481;&#65292;&#23454;&#29616;&#20102;&#22312;&#22833;&#30495;&#21644;&#24863;&#30693;&#36136;&#37327;&#26041;&#38754;&#30340;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#36890;&#36807;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#32852;&#21512;&#28304;-&#20449;&#36947;&#32534;&#30721;&#65288;DeepJSCC&#65289;&#20197;&#21450;&#25509;&#25910;&#31471;&#30340;&#21435;&#22122;&#25193;&#25955;&#27010;&#29575;&#27169;&#22411;&#65288;DDPM&#65289;&#22312;&#22122;&#22768;&#26080;&#32447;&#20449;&#36947;&#19978;&#36827;&#34892;&#22270;&#20687;&#20256;&#36755;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#22312;&#23454;&#38469;&#26377;&#38480;&#22359;&#38271;&#24230;&#30340;&#24773;&#20917;&#19979;&#30340;&#24863;&#30693;&#22833;&#30495;&#26435;&#34913;&#38382;&#39064;&#65292;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20998;&#31163;&#30340;&#28304;&#32534;&#30721;&#21644;&#20449;&#36947;&#32534;&#30721;&#21487;&#33021;&#20250;&#39640;&#24230;&#19981;&#29702;&#24819;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21033;&#29992;&#30446;&#26631;&#22270;&#20687;&#30340;&#33539;&#22260;-&#38646;&#31354;&#38388;&#20998;&#35299;&#30340;&#26032;&#26041;&#26696;&#12290;&#25105;&#20204;&#22312;&#32534;&#30721;&#21518;&#20256;&#36755;&#22270;&#20687;&#30340;&#33539;&#22260;&#31354;&#38388;&#65292;&#24182;&#20351;&#29992;DDPM&#36880;&#27493;&#20248;&#21270;&#20854;&#38646;&#31354;&#38388;&#20869;&#23481;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;&#19982;&#26631;&#20934;&#30340;DeepJSCC&#21644;&#26368;&#20808;&#36827;&#30340;&#29983;&#25104;&#24335;&#23398;&#20064;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#22312;&#37325;&#26500;&#22270;&#20687;&#30340;&#22833;&#30495;&#21644;&#24863;&#30693;&#36136;&#37327;&#26041;&#38754;&#23454;&#29616;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;&#20026;&#20102;&#20419;&#36827;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#21644;&#21487;&#37325;&#29616;&#24615;&#65292;&#25105;&#20204;&#23558;&#20844;&#24320;&#20998;&#20139;&#25105;&#20204;&#30340;&#28304;&#20195;&#30721;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the image transmission problem over a noisy wireless channel via deep learning-based joint source-channel coding (DeepJSCC) along with a denoising diffusion probabilistic model (DDPM) at the receiver. Specifically, we are interested in the perception-distortion trade-off in the practical finite block length regime, in which separate source and channel coding can be highly suboptimal. We introduce a novel scheme that utilizes the range-null space decomposition of the target image. We transmit the range-space of the image after encoding and employ DDPM to progressively refine its null space contents. Through extensive experiments, we demonstrate significant improvements in distortion and perceptual quality of reconstructed images compared to standard DeepJSCC and the state-of-the-art generative learning-based method. We will publicly share our source code to facilitate further research and reproducibility.
&lt;/p&gt;</description></item></channel></rss>