<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#36827;&#21270;&#26041;&#27861;&#30340;&#21333;&#26234;&#33021;&#20307;&#19982;&#22810;&#26234;&#33021;&#20307;&#31169;&#23494;&#20027;&#21160;&#24863;&#30693;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#20013;&#36827;&#34892;&#24322;&#24120;&#26816;&#27979;&#31034;&#20363;&#29992;&#20363;&#30340;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.10112</link><description>&lt;p&gt;
&#21333;&#26234;&#33021;&#20307;&#19982;&#22810;&#26234;&#33021;&#20307;&#30340;&#31169;&#23494;&#20027;&#21160;&#24863;&#30693;&#65306;&#28145;&#24230;&#31070;&#32463;&#36827;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Single- and Multi-Agent Private Active Sensing: A Deep Neuroevolution Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10112
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#36827;&#21270;&#26041;&#27861;&#30340;&#21333;&#26234;&#33021;&#20307;&#19982;&#22810;&#26234;&#33021;&#20307;&#31169;&#23494;&#20027;&#21160;&#24863;&#30693;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#20013;&#36827;&#34892;&#24322;&#24120;&#26816;&#27979;&#31034;&#20363;&#29992;&#20363;&#30340;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#23384;&#22312;&#31397;&#35270;&#32773;&#24773;&#20917;&#19979;&#30340;&#20027;&#21160;&#20551;&#35774;&#27979;&#35797;&#20013;&#30340;&#19968;&#20010;&#38598;&#20013;&#24335;&#38382;&#39064;&#21644;&#19968;&#20010;&#20998;&#25955;&#24335;&#38382;&#39064;&#12290;&#38024;&#23545;&#21253;&#25324;&#21333;&#20010;&#21512;&#27861;&#26234;&#33021;&#20307;&#30340;&#38598;&#20013;&#24335;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#31070;&#32463;&#36827;&#21270;&#65288;NE&#65289;&#30340;&#26032;&#26694;&#26550;&#65307;&#32780;&#38024;&#23545;&#20998;&#25955;&#24335;&#38382;&#39064;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;NE&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#21327;&#20316;&#22810;&#26234;&#33021;&#20307;&#20219;&#21153;&#65292;&#36825;&#31181;&#26041;&#27861;&#26377;&#36259;&#22320;&#20445;&#25345;&#20102;&#21333;&#19968;&#26234;&#33021;&#20307;NE&#30340;&#25152;&#26377;&#35745;&#31639;&#20248;&#21183;&#12290;&#36890;&#36807;&#23545;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#19978;&#24322;&#24120;&#26816;&#27979;&#31034;&#20363;&#29992;&#20363;&#20013;&#30340;&#25968;&#20540;&#23454;&#39564;&#65292;&#39564;&#35777;&#20102;&#25152;&#25552;&#20986;&#30340;EAHT&#26041;&#27861;&#20248;&#20110;&#20256;&#32479;&#30340;&#20027;&#21160;&#20551;&#35774;&#27979;&#35797;&#31574;&#30053;&#20197;&#21450;&#22522;&#20110;&#23398;&#20064;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10112v1 Announce Type: new  Abstract: In this paper, we focus on one centralized and one decentralized problem of active hypothesis testing in the presence of an eavesdropper. For the centralized problem including a single legitimate agent, we present a new framework based on NeuroEvolution (NE), whereas, for the decentralized problem, we develop a novel NE-based method for solving collaborative multi-agent tasks, which interestingly maintains all computational benefits of single-agent NE. The superiority of the proposed EAHT approaches over conventional active hypothesis testing policies, as well as learning-based methods, is validated through numerical investigations in an example use case of anomaly detection over wireless sensor networks.
&lt;/p&gt;</description></item></channel></rss>