<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#36825;&#31687;&#35770;&#25991;&#35843;&#26597;&#20102;&#19978;&#19979;&#25991;&#24863;&#30693;&#22810;&#20195;&#29702;&#31995;&#32479;&#30340;&#25216;&#26415;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#21457;&#23637;&#26041;&#21521;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#27010;&#36848;&#12290;&#23427;&#20171;&#32461;&#20102;&#19978;&#19979;&#25991;&#24863;&#30693;&#31995;&#32479;&#21644;&#22810;&#20195;&#29702;&#31995;&#32479;&#30340;&#29305;&#24615;&#65292;&#20197;&#21450;&#38598;&#25104;&#36825;&#20123;&#31995;&#32479;&#30340;&#36890;&#29992;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.01968</link><description>&lt;p&gt;
&#23545;&#19978;&#19979;&#25991;&#24863;&#30693;&#22810;agent&#31995;&#32479;&#30340;&#35843;&#26597;&#65306;&#25216;&#26415;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#21457;&#23637;&#26041;&#21521;
&lt;/p&gt;
&lt;p&gt;
A Survey on Context-Aware Multi-Agent Systems: Techniques, Challenges and Future Directions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01968
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#35843;&#26597;&#20102;&#19978;&#19979;&#25991;&#24863;&#30693;&#22810;&#20195;&#29702;&#31995;&#32479;&#30340;&#25216;&#26415;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#21457;&#23637;&#26041;&#21521;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#32508;&#21512;&#30340;&#27010;&#36848;&#12290;&#23427;&#20171;&#32461;&#20102;&#19978;&#19979;&#25991;&#24863;&#30693;&#31995;&#32479;&#21644;&#22810;&#20195;&#29702;&#31995;&#32479;&#30340;&#29305;&#24615;&#65292;&#20197;&#21450;&#38598;&#25104;&#36825;&#20123;&#31995;&#32479;&#30340;&#36890;&#29992;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#26032;&#20852;&#20027;&#39064;&#30340;&#20852;&#36215;&#65292;&#33258;&#20027;&#20195;&#29702;&#30340;&#30740;&#31350;&#20852;&#36259;&#27491;&#22312;&#22686;&#21152;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26174;&#33879;&#25104;&#23601;&#24050;&#32463;&#23637;&#31034;&#20102;&#22312;&#33258;&#20027;&#20195;&#29702;&#20013;&#36798;&#21040;&#20154;&#31867;&#26234;&#33021;&#30340;&#24040;&#22823;&#28508;&#21147;&#12290;&#28982;&#32780;&#65292;&#25361;&#25112;&#22312;&#20110;&#20351;&#36825;&#20123;&#20195;&#29702;&#33021;&#22815;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#23398;&#20064;&#12289;&#25512;&#29702;&#21644;&#23548;&#33322;&#19981;&#30830;&#23450;&#24615;&#12290;&#24403;&#22788;&#29702;&#21160;&#24577;&#24773;&#20917;&#26102;&#65292;&#19978;&#19979;&#25991;&#24847;&#35782;&#25104;&#20026;&#24378;&#21270;&#22810;agent&#31995;&#32479;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;&#23613;&#31649;&#29616;&#26377;&#30340;&#30740;&#31350;&#19987;&#27880;&#20110;&#19978;&#19979;&#25991;&#24863;&#30693;&#31995;&#32479;&#21644;&#22810;agent&#31995;&#32479;&#65292;&#20294;&#32570;&#20047;&#20840;&#38754;&#27010;&#36848;&#22914;&#20309;&#23558;&#19978;&#19979;&#25991;&#24863;&#30693;&#31995;&#32479;&#19982;&#22810;agent&#31995;&#32479;&#38598;&#25104;&#30340;&#32508;&#21512;&#35843;&#26597;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#20010;&#31354;&#30333;&#65292;&#26412;&#35843;&#26597;&#25552;&#20379;&#20102;&#23545;&#26368;&#20808;&#36827;&#30340;&#19978;&#19979;&#25991;&#24863;&#30693;&#22810;agent&#31995;&#32479;&#30340;&#20840;&#38754;&#27010;&#36848;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#20419;&#36827;&#36825;&#20123;&#31995;&#32479;&#20043;&#38388;&#38598;&#25104;&#30340;&#19978;&#19979;&#25991;&#24863;&#30693;&#31995;&#32479;&#21644;&#22810; agent &#31995;&#32479;&#30340;&#29305;&#24615;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#36807;&#31243;&#26469;&#24314;&#27169;&#19978;&#19979;&#25991;&#24863;&#30693;&#21644;&#22810;agent&#31995;&#32479;&#30340;&#38598;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research interest in autonomous agents is on the rise as an emerging topic. The notable achievements of Large Language Models (LLMs) have demonstrated the considerable potential to attain human-like intelligence in autonomous agents. However, the challenge lies in enabling these agents to learn, reason, and navigate uncertainties in dynamic environments. Context awareness emerges as a pivotal element in fortifying multi-agent systems when dealing with dynamic situations. Despite existing research focusing on both context-aware systems and multi-agent systems, there is a lack of comprehensive surveys outlining techniques for integrating context-aware systems with multi-agent systems. To address this gap, this survey provides a comprehensive overview of state-of-the-art context-aware multi-agent systems. First, we outline the properties of both context-aware systems and multi-agent systems that facilitate integration between these systems. Subsequently, we propose a general process for c
&lt;/p&gt;</description></item></channel></rss>