<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#30340;&#12289;&#29992;&#20110;&#22810;&#26234;&#33021;&#20307;&#20132;&#20114;&#24335;&#28023;&#27915;&#24223;&#24323;&#29289;&#28165;&#29702;&#30340;&#36890;&#20449;&#26426;&#21046;&#65292;&#20351;&#24471;&#19981;&#21516;&#20195;&#29702;&#20043;&#38388;&#21487;&#20197;&#21327;&#20316;&#31454;&#20105;&#24182;&#23454;&#29616;&#25910;&#38598;&#24223;&#24323;&#29289;&#30340;&#26368;&#22823;&#21270;&#12290;</title><link>http://arxiv.org/abs/2304.05872</link><description>&lt;p&gt;
&#22312;&#31454;&#20105;&#24615;&#22810;&#26234;&#33021;&#20307;&#29615;&#22659;&#20013;&#23398;&#20064;&#27807;&#36890;&#21644;&#21327;&#20316;&#20197;&#28165;&#29702;&#28023;&#27915;&#24223;&#24323;&#22609;&#26009;
&lt;/p&gt;
&lt;p&gt;
Learning to Communicate and Collaborate in a Competitive Multi-Agent Setup to Clean the Ocean from Macroplastics. (arXiv:2304.05872v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05872
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#30340;&#12289;&#29992;&#20110;&#22810;&#26234;&#33021;&#20307;&#20132;&#20114;&#24335;&#28023;&#27915;&#24223;&#24323;&#29289;&#28165;&#29702;&#30340;&#36890;&#20449;&#26426;&#21046;&#65292;&#20351;&#24471;&#19981;&#21516;&#20195;&#29702;&#20043;&#38388;&#21487;&#20197;&#21327;&#20316;&#31454;&#20105;&#24182;&#23454;&#29616;&#25910;&#38598;&#24223;&#24323;&#29289;&#30340;&#26368;&#22823;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#23454;&#38469;&#24212;&#29992;&#20013;&#65292;&#21327;&#20316;&#19982;&#31454;&#20105;&#20043;&#38388;&#30340;&#24179;&#34913;&#23545;&#20110;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#20351;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#24314;&#31435;&#22312;&#19968;&#20010;&#39640;&#24433;&#21709;&#38382;&#39064;&#19978;&#65292;&#36890;&#36807;&#23545;&#28023;&#27915;&#24223;&#24323;&#22609;&#26009;&#30340;&#25910;&#38598;&#23454;&#29616;&#20102;&#21327;&#20316;&#19982;&#31454;&#20105;&#30340;&#24179;&#34913;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#30340;&#36890;&#20449;&#26426;&#21046;&#65292;&#23427;&#22686;&#21152;&#20102;&#20195;&#29702;&#30340;&#35266;&#23519;&#31354;&#38388;&#12290;&#22312;&#25105;&#20204;&#33258;&#23450;&#20041;&#30340;&#29615;&#22659;&#20013;&#65292;&#20195;&#29702;&#25511;&#21046;&#30528;&#25910;&#38598;&#22609;&#26009;&#30340;&#33337;&#21482;&#12290;&#36825;&#31181;&#36890;&#20449;&#26426;&#21046;&#20351;&#20195;&#29702;&#33021;&#22815;&#20351;&#29992;&#20108;&#36827;&#21046;&#20449;&#21495;&#26469;&#24320;&#21457;&#36890;&#20449;&#21327;&#35758;&#12290;&#34429;&#28982;&#20195;&#29702;&#30340;&#38598;&#20307;&#30446;&#26631;&#26159;&#23613;&#21487;&#33021;&#22320;&#28165;&#29702;&#28023;&#27915;&#24223;&#24323;&#22609;&#26009;&#65292;&#20294;&#20195;&#29702;&#20250;&#22240;&#20010;&#20154;&#25910;&#38598;&#21040;&#30340;&#24223;&#24323;&#22609;&#26009;&#25968;&#37327;&#32780;&#33719;&#24471;&#22870;&#21169;&#12290;&#22240;&#27492;&#65292;&#20195;&#29702;&#24517;&#39035;&#23398;&#20250;&#26377;&#25928;&#22320;&#27807;&#36890;&#24182;&#20445;&#25345;&#31454;&#20105;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Finding a balance between collaboration and competition is crucial for artificial agents in many real-world applications. We investigate this using a Multi-Agent Reinforcement Learning (MARL) setup on the back of a high-impact problem. The accumulation and yearly growth of plastic in the ocean cause irreparable damage to many aspects of oceanic health and the marina system. To prevent further damage, we need to find ways to reduce macroplastics from known plastic patches in the ocean. Here we propose a Graph Neural Network (GNN) based communication mechanism that increases the agents' observation space. In our custom environment, agents control a plastic collecting vessel. The communication mechanism enables agents to develop a communication protocol using a binary signal. While the goal of the agent collective is to clean up as much as possible, agents are rewarded for the individual amount of macroplastics collected. Hence agents have to learn to communicate effectively while maintai
&lt;/p&gt;</description></item></channel></rss>