<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#33021;&#22815;&#26816;&#27979;&#12289;&#25551;&#36848;&#21644;&#36866;&#24212;&#29616;&#23454;&#29615;&#22659;&#20013;&#21019;&#26032;&#30340;&#39046;&#22495;&#29420;&#31435;AI&#20195;&#29702;&#22312;&#39640;&#20445;&#30495;&#27169;&#25311;&#24320;&#25918;&#19990;&#30028;&#20013;&#25104;&#21151;&#24212;&#29992;&#30340;&#30740;&#31350;&#12290;&#22312;&#22788;&#29702;&#26032;&#39062;&#29615;&#22659;&#24178;&#25200;&#30340;&#22810;&#26234;&#33021;&#20307;&#35268;&#21010;&#20219;&#21153;&#20013;&#65292;&#35813;&#20195;&#29702;&#24615;&#33021;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#32447;&#12290;</title><link>http://arxiv.org/abs/2306.12654</link><description>&lt;p&gt;
&#22312;&#39640;&#20445;&#30495;&#27169;&#25311;&#24320;&#25918;&#19990;&#30028;&#20013;&#32771;&#34385;&#21019;&#26032;&#30340;&#22810;&#26234;&#33021;&#20307;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Novelty Accommodating Multi-Agent Planning in High Fidelity Simulated Open World. (arXiv:2306.12654v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12654
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#33021;&#22815;&#26816;&#27979;&#12289;&#25551;&#36848;&#21644;&#36866;&#24212;&#29616;&#23454;&#29615;&#22659;&#20013;&#21019;&#26032;&#30340;&#39046;&#22495;&#29420;&#31435;AI&#20195;&#29702;&#22312;&#39640;&#20445;&#30495;&#27169;&#25311;&#24320;&#25918;&#19990;&#30028;&#20013;&#25104;&#21151;&#24212;&#29992;&#30340;&#30740;&#31350;&#12290;&#22312;&#22788;&#29702;&#26032;&#39062;&#29615;&#22659;&#24178;&#25200;&#30340;&#22810;&#26234;&#33021;&#20307;&#35268;&#21010;&#20219;&#21153;&#20013;&#65292;&#35813;&#20195;&#29702;&#24615;&#33021;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#32447;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20027;&#26234;&#33021;&#20307;&#22312;&#29616;&#23454;&#29615;&#22659;&#20013;&#34892;&#21160;&#26102;&#32463;&#24120;&#38656;&#35201;&#22788;&#29702;&#26410;&#30693;&#30340;&#21019;&#26032;&#24178;&#25200;&#20854;&#35745;&#21010;&#25191;&#34892;&#12290;&#21019;&#26032;&#26159;&#19968;&#31181;&#24847;&#22806;&#30340;&#29616;&#35937;&#65292;&#21487;&#20197;&#25913;&#21464;&#29615;&#22659;&#30340;&#26680;&#24515;&#29305;&#24449;&#12289;&#32452;&#25104;&#21644;&#21160;&#24577;&#12290;&#21019;&#26032;&#22312;&#20219;&#20309;&#36275;&#22815;&#22797;&#26434;&#30340;&#29615;&#22659;&#20013;&#30340;&#20219;&#20309;&#26102;&#38388;&#37117;&#21487;&#33021;&#21457;&#29983;&#65292;&#32780;&#27809;&#26377;&#20219;&#20309;&#20107;&#20808;&#36890;&#30693;&#25110;&#35299;&#37322;&#12290;&#20808;&#21069;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#21019;&#26032;&#23545;&#26234;&#33021;&#20307;&#30340;&#24615;&#33021;&#20135;&#29983;&#28798;&#38590;&#24615;&#24433;&#21709;&#12290;&#26234;&#33021;&#20307;&#36890;&#36807;&#19990;&#30028;&#30340;&#20869;&#22312;&#27169;&#22411;&#36827;&#34892;&#25512;&#29702;&#65292;&#20197;&#29702;&#35299;&#20854;&#29615;&#22659;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#25104;&#21151;&#25191;&#34892;&#20854;&#35745;&#21010;&#12290;&#21019;&#26032;&#36890;&#24120;&#20351;&#24471;&#20182;&#20204;&#30340;&#20869;&#37096;&#27169;&#22411;&#19981;&#20934;&#30830;&#24182;&#19988;&#29983;&#25104;&#30340;&#35745;&#21010;&#19981;&#20877;&#36866;&#29992;&#12290;&#21019;&#26032;&#29305;&#21035;&#26222;&#36941;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#65292;&#22312;&#20854;&#20013;&#39046;&#22495;&#29305;&#23450;&#29978;&#33267;&#26159;&#39044;&#27979;&#30340;&#21019;&#26032;&#29305;&#23450;&#26041;&#27861;&#34987;&#29992;&#20110;&#20943;&#36731;&#21019;&#26032;&#30340;&#24433;&#21709;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#35774;&#35745;&#29992;&#20110;&#22312;&#29616;&#23454;&#29615;&#22659;&#20013;&#26816;&#27979;&#65292;&#25551;&#32472;&#21644;&#36866;&#24212;&#21019;&#26032;&#30340;&#39046;&#22495;&#29420;&#31435;AI&#20195;&#29702;&#21487;&#20197;&#25104;&#21151;&#22320;&#23558;&#20854;&#25216;&#33021;&#36716;&#31227;&#21040;&#39640;&#20445;&#30495;&#30340;&#27169;&#25311;&#24320;&#25918;&#19990;&#30028;&#20013;&#12290;&#25105;&#20204;&#30340;&#20195;&#29702;&#22312;&#28041;&#21450;&#22788;&#29702;&#26032;&#39062;&#29615;&#22659;&#24178;&#25200;&#30340;&#22810;&#26234;&#33021;&#20307;&#35268;&#21010;&#20219;&#21153;&#20013;&#26174;&#31034;&#20986;&#20102;&#26174;&#30528;&#30340;&#25913;&#36827;&#65292;&#32780;&#19988;&#27604;&#29616;&#26377;&#30340;&#22522;&#32447;&#34920;&#29616;&#24471;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
Autonomous agents acting in real-world environments often need to reason with unknown novelties interfering with their plan execution. Novelty is an unexpected phenomenon that can alter the core characteristics, composition, and dynamics of the environment. Novelty can occur at any time in any sufficiently complex environment without any prior notice or explanation. Previous studies show that novelty has catastrophic impact on agent performance. Intelligent agents reason with an internal model of the world to understand the intricacies of their environment and to successfully execute their plans. The introduction of novelty into the environment usually renders their internal model inaccurate and the generated plans no longer applicable. Novelty is particularly prevalent in the real world where domain-specific and even predicted novelty-specific approaches are used to mitigate the novelty's impact. In this work, we demonstrate that a domain-independent AI agent designed to detect, chara
&lt;/p&gt;</description></item></channel></rss>