<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#33258;&#20027;&#20379;&#24212;&#38142;&#65288;ASC&#65289;&#30340;&#27491;&#24335;&#23450;&#20041;&#12289;&#29305;&#24449;&#21644;&#36741;&#21161;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#27010;&#24565;&#26694;&#26550;&#21644;&#20379;&#24212;&#38142;&#33258;&#27835;&#21442;&#32771;&#27169;&#22411;&#12290;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#22522;&#20110;&#36825;&#20123;&#27010;&#24565;&#30340;&#21021;&#22987;ASC&#23454;&#26045;&#12290;</title><link>http://arxiv.org/abs/2401.14183</link><description>&lt;p&gt;
&#24378;&#35843;&#33258;&#20027;&#20379;&#24212;&#38142;&#65306;&#23450;&#20041;&#12289;&#29305;&#24449;&#12289;&#27010;&#24565;&#26694;&#26550;&#21644;&#33258;&#20027;&#27700;&#24179;
&lt;/p&gt;
&lt;p&gt;
Towards Autonomous Supply Chains: Definition, Characteristics, Conceptual Framework, and Autonomy Levels. (arXiv:2401.14183v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14183
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#33258;&#20027;&#20379;&#24212;&#38142;&#65288;ASC&#65289;&#30340;&#27491;&#24335;&#23450;&#20041;&#12289;&#29305;&#24449;&#21644;&#36741;&#21161;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#27010;&#24565;&#26694;&#26550;&#21644;&#20379;&#24212;&#38142;&#33258;&#27835;&#21442;&#32771;&#27169;&#22411;&#12290;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#22522;&#20110;&#36825;&#20123;&#27010;&#24565;&#30340;&#21021;&#22987;ASC&#23454;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#20840;&#29699;&#24615;&#24178;&#25200;&#65292;&#22914;&#22823;&#27969;&#34892;&#21644;&#22320;&#32536;&#25919;&#27835;&#20914;&#31361;&#65292;&#28145;&#21051;&#26292;&#38706;&#20102;&#20256;&#32479;&#20379;&#24212;&#38142;&#30340;&#33030;&#24369;&#24615;&#65292;&#38656;&#35201;&#25506;&#32034;&#26356;&#26377;&#24377;&#24615;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#33258;&#20027;&#20379;&#24212;&#38142;&#65288;ASC&#65289;&#20316;&#20026;&#28508;&#22312;&#35299;&#20915;&#26041;&#26696;&#20986;&#29616;&#65292;&#25552;&#20379;&#20102;&#22312;&#21160;&#33633;&#30340;&#36152;&#26131;&#29615;&#22659;&#20013;&#22686;&#21152;&#21487;&#35265;&#24615;&#12289;&#28789;&#27963;&#24615;&#21644;&#24377;&#24615;&#30340;&#20248;&#21183;&#12290;&#23613;&#31649;&#24037;&#19994;&#30028;&#21644;&#23398;&#26415;&#30028;&#22810;&#24180;&#26469;&#19968;&#30452;&#22312;&#35752;&#35770;ASC&#65292;&#20294;&#32570;&#20047;&#33391;&#22909;&#24314;&#31435;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;&#26412;&#25991;&#36890;&#36807;&#25552;&#20379;ASC&#30340;&#27491;&#24335;&#23450;&#20041;&#20197;&#21450;&#20854;&#23450;&#20041;&#29305;&#24449;&#21644;&#36741;&#21161;&#27010;&#24565;&#26469;&#22635;&#34917;&#36825;&#19968;&#30740;&#31350;&#31354;&#30333;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;MIISI&#27169;&#22411;&#30340;&#20998;&#23618;&#27010;&#24565;&#26694;&#26550;&#12290;&#36890;&#36807;&#19968;&#20010;&#37325;&#28857;&#20851;&#27880;&#32905;&#31867;&#20379;&#24212;&#38142;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;&#22522;&#20110;&#36825;&#19968;&#27010;&#24565;&#27169;&#22411;&#30340;&#21021;&#22987;ASC&#23454;&#26045;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#19968;&#20010;&#19971;&#32423;&#20379;&#24212;&#38142;&#33258;&#27835;&#21442;&#32771;&#27169;&#22411;&#65292;&#25551;&#32472;&#20102;&#23454;&#29616;&#23436;&#20840;&#20379;&#24212;&#38142;&#33258;&#27835;&#30340;&#36712;&#36857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent global disruptions, such as the pandemic and geopolitical conflicts, have profoundly exposed vulnerabilities in traditional supply chains, requiring exploration of more resilient alternatives. Autonomous supply chains (ASCs) have emerged as a potential solution, offering increased visibility, flexibility, and resilience in turbulent trade environments. Despite discussions in industry and academia over several years, ASCs lack well-established theoretical foundations. This paper addresses this research gap by presenting a formal definition of ASC along with its defining characteristics and auxiliary concepts. We propose a layered conceptual framework called the MIISI model. An illustrative case study focusing on the meat supply chain demonstrates an initial ASC implementation based on this conceptual model. Additionally, we introduce a seven-level supply chain autonomy reference model, delineating a trajectory towards achieving a full supply chain autonomy. Recognising that this 
&lt;/p&gt;</description></item><item><title>&#22312;&#36164;&#28304;&#32422;&#26463;&#19979;&#30340;&#20998;&#24067;&#21442;&#25968;&#20272;&#35745;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20256;&#24863;&#22120;/&#20195;&#29702;&#25968;&#25454;&#25910;&#38598;&#21644;&#21327;&#20316;&#31574;&#30053;&#65292;&#36890;&#36807;&#26368;&#22823;&#21270;&#36153;&#33293;&#23572;&#20449;&#24687;&#25110;&#26368;&#23567;&#21270;Cramer-Rao&#30028;&#26469;&#35299;&#20915;&#20256;&#24863;&#22120;/&#20195;&#29702;&#30340;&#25968;&#25454;&#25910;&#38598;&#21644;&#21327;&#20316;&#31574;&#30053;&#35774;&#35745;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.06442</link><description>&lt;p&gt;
&#22312;&#36164;&#28304;&#32422;&#26463;&#19979;&#30340;&#20998;&#24067;&#21442;&#25968;&#20272;&#35745;&#20013;&#30340;&#21327;&#20316;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Collaboration in Distributed Parameter Estimation with Resource Constraints. (arXiv:2307.06442v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06442
&lt;/p&gt;
&lt;p&gt;
&#22312;&#36164;&#28304;&#32422;&#26463;&#19979;&#30340;&#20998;&#24067;&#21442;&#25968;&#20272;&#35745;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20256;&#24863;&#22120;/&#20195;&#29702;&#25968;&#25454;&#25910;&#38598;&#21644;&#21327;&#20316;&#31574;&#30053;&#65292;&#36890;&#36807;&#26368;&#22823;&#21270;&#36153;&#33293;&#23572;&#20449;&#24687;&#25110;&#26368;&#23567;&#21270;Cramer-Rao&#30028;&#26469;&#35299;&#20915;&#20256;&#24863;&#22120;/&#20195;&#29702;&#30340;&#25968;&#25454;&#25910;&#38598;&#21644;&#21327;&#20316;&#31574;&#30053;&#35774;&#35745;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#32771;&#34385;&#36164;&#28304;&#32422;&#26463;&#21644;&#19981;&#21516;&#20256;&#24863;&#22120;/&#20195;&#29702;&#25910;&#38598;&#30340;&#35266;&#27979;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#30340;&#21442;&#25968;&#20272;&#35745;&#30340;&#20256;&#24863;&#22120;/&#20195;&#29702;&#25968;&#25454;&#25910;&#38598;&#21644;&#21327;&#20316;&#31574;&#30053;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#32452;&#20256;&#24863;&#22120;/&#20195;&#29702;&#65292;&#27599;&#20010;&#20256;&#24863;&#22120;/&#20195;&#29702;&#26679;&#26412;&#26469;&#33258;&#22810;&#20803;&#39640;&#26031;&#20998;&#24067;&#30340;&#19981;&#21516;&#21464;&#37327;&#65292;&#24182;&#19988;&#20855;&#26377;&#19981;&#21516;&#30340;&#20272;&#35745;&#30446;&#26631;&#65292;&#25105;&#20204;&#23558;&#20256;&#24863;&#22120;/&#20195;&#29702;&#30340;&#25968;&#25454;&#25910;&#38598;&#21644;&#21327;&#20316;&#31574;&#30053;&#35774;&#35745;&#38382;&#39064;&#38416;&#36848;&#20026;&#36153;&#33293;&#23572;&#20449;&#24687;&#26368;&#22823;&#21270;&#65288;&#25110;Cramer-Rao&#30028;&#26368;&#23567;&#21270;&#65289;&#38382;&#39064;&#12290;&#24403;&#21464;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#30693;&#35782;&#21487;&#29992;&#26102;&#65292;&#25105;&#20204;&#21487;&#20197;&#20998;&#26512;&#22320;&#35782;&#21035;&#20986;&#20004;&#20010;&#29305;&#23450;&#24773;&#20917;&#65306;&#65288;1&#65289;&#19981;&#33021;&#21033;&#29992;&#26679;&#26412;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#30693;&#35782;&#36827;&#34892;&#21327;&#20316;&#20272;&#35745;&#30340;&#24773;&#20917;&#65292;&#65288;2&#65289;&#26368;&#20248;&#25968;&#25454;&#25910;&#38598;&#31574;&#30053;&#28041;&#21450;&#25237;&#36164;&#26377;&#38480;&#36164;&#28304;&#20197;&#21327;&#20316;&#37319;&#26679;&#21644;&#36716;&#31227;&#24050;&#30693;&#32479;&#35745;&#20449;&#24687;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study sensor/agent data collection and collaboration policies for parameter estimation, accounting for resource constraints and correlation between observations collected by distinct sensors/agents. Specifically, we consider a group of sensors/agents each samples from different variables of a multivariate Gaussian distribution and has different estimation objectives, and we formulate a sensor/agent's data collection and collaboration policy design problem as a Fisher information maximization (or Cramer-Rao bound minimization) problem. When the knowledge of correlation between variables is available, we analytically identify two particular scenarios: (1) where the knowledge of the correlation between samples cannot be leveraged for collaborative estimation purposes and (2) where the optimal data collection policy involves investing scarce resources to collaboratively sample and transfer information that is not of immediate interest and whose statistics are already known, with the sol
&lt;/p&gt;</description></item></channel></rss>