<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#36825;&#39033;&#32508;&#36848;&#37325;&#26032;&#24605;&#32771;&#20102;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#20013;&#39044;&#27979;&#21644;&#35268;&#21010;&#30340;&#25972;&#21512;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#23558;&#20854;&#20316;&#20026;&#30456;&#20114;&#20381;&#36182;&#30340;&#32852;&#21512;&#27493;&#39588;&#26469;&#25552;&#39640;&#23433;&#20840;&#24615;&#12289;&#25928;&#29575;&#24615;&#21644;&#33298;&#36866;&#24615;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.05731</link><description>&lt;p&gt;
&#37325;&#26032;&#24605;&#32771;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#20013;&#30340;&#39044;&#27979;&#21644;&#35268;&#21010;&#30340;&#25972;&#21512;&#65306;&#19968;&#39033;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Rethinking Integration of Prediction and Planning in Deep Learning-Based Automated Driving Systems: A Review. (arXiv:2308.05731v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.05731
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#32508;&#36848;&#37325;&#26032;&#24605;&#32771;&#20102;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#20013;&#39044;&#27979;&#21644;&#35268;&#21010;&#30340;&#25972;&#21512;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#23558;&#20854;&#20316;&#20026;&#30456;&#20114;&#20381;&#36182;&#30340;&#32852;&#21512;&#27493;&#39588;&#26469;&#25552;&#39640;&#23433;&#20840;&#24615;&#12289;&#25928;&#29575;&#24615;&#21644;&#33298;&#36866;&#24615;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#39550;&#39542;&#26377;&#21487;&#33021;&#24443;&#24213;&#25913;&#21464;&#20010;&#20154;&#12289;&#20844;&#20849;&#21644;&#36135;&#36816;&#20132;&#36890;&#30340;&#26041;&#24335;&#12290;&#38500;&#20102;&#24863;&#30693;&#29615;&#22659;&#30340;&#24040;&#22823;&#25361;&#25112;&#22806;&#65292;&#21363;&#20934;&#30830;&#22320;&#20351;&#29992;&#21487;&#29992;&#30340;&#20256;&#24863;&#22120;&#25968;&#25454;&#24863;&#30693;&#29615;&#22659;&#65292;&#33258;&#21160;&#39550;&#39542;&#36824;&#21253;&#25324;&#35268;&#21010;&#19968;&#20010;&#23433;&#20840;&#12289;&#33298;&#36866;&#21644;&#39640;&#25928;&#30340;&#36816;&#21160;&#36712;&#36857;&#12290;&#20026;&#20102;&#20419;&#36827;&#23433;&#20840;&#21644;&#36827;&#27493;&#65292;&#35768;&#22810;&#24037;&#20316;&#20381;&#36182;&#20110;&#27169;&#22359;&#21270;&#30340;&#20132;&#36890;&#26410;&#26469;&#36816;&#21160;&#30340;&#39044;&#27979;&#12290;&#27169;&#22359;&#21270;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#36890;&#24120;&#23558;&#39044;&#27979;&#21644;&#35268;&#21010;&#20316;&#20026;&#39034;&#24207;&#30340;&#29420;&#31435;&#20219;&#21153;&#22788;&#29702;&#12290;&#34429;&#28982;&#36825;&#32771;&#34385;&#20102;&#21608;&#22260;&#20132;&#36890;&#23545;&#33258;&#36710;&#30340;&#24433;&#21709;&#65292;&#20294;&#23427;&#26410;&#33021;&#39044;&#27979;&#20132;&#36890;&#21442;&#19982;&#32773;&#23545;&#33258;&#36710;&#34892;&#20026;&#30340;&#21453;&#24212;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#23558;&#39044;&#27979;&#21644;&#35268;&#21010;&#25972;&#21512;&#20026;&#30456;&#20114;&#20381;&#36182;&#30340;&#32852;&#21512;&#27493;&#39588;&#26159;&#23454;&#29616;&#23433;&#20840;&#12289;&#39640;&#25928;&#21644;&#33298;&#36866;&#39550;&#39542;&#25152;&#24517;&#38656;&#30340;&#12290;&#34429;&#28982;&#26377;&#21508;&#31181;&#27169;&#22411;&#23454;&#29616;&#20102;&#36825;&#31181;&#38598;&#25104;&#31995;&#32479;&#65292;&#20294;&#23545;&#19981;&#21516;&#21407;&#29702;&#30340;&#20840;&#38754;&#27010;&#36848;&#21644;&#29702;&#35770;&#29702;&#35299;&#20173;&#28982;&#32570;&#20047;&#12290;
&lt;/p&gt;
&lt;p&gt;
Automated driving has the potential to revolutionize personal, public, and freight mobility. Besides the enormous challenge of perception, i.e. accurately perceiving the environment using available sensor data, automated driving comprises planning a safe, comfortable, and efficient motion trajectory. To promote safety and progress, many works rely on modules that predict the future motion of surrounding traffic. Modular automated driving systems commonly handle prediction and planning as sequential separate tasks. While this accounts for the influence of surrounding traffic on the ego-vehicle, it fails to anticipate the reactions of traffic participants to the ego-vehicle's behavior. Recent works suggest that integrating prediction and planning in an interdependent joint step is necessary to achieve safe, efficient, and comfortable driving. While various models implement such integrated systems, a comprehensive overview and theoretical understanding of different principles are lacking.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20013;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;PLAYBEST&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#25193;&#25955;&#27010;&#29575;&#27169;&#22411;&#20174;&#31726;&#29699;&#27604;&#36187;&#21382;&#21490;&#25968;&#25454;&#20013;&#23398;&#20064;&#31574;&#30053;&#65292;&#29983;&#25104;&#26356;&#21152;&#30495;&#23454;&#21644;&#22810;&#26679;&#21270;&#30340;&#29699;&#21592;&#34892;&#20026;&#65292;&#20174;&#32780;&#25552;&#39640;&#29699;&#21592;&#30340;&#20915;&#31574;&#21046;&#23450;&#25928;&#26524;&#65292;&#24182;&#22312;&#23454;&#39564;&#20013;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2306.04090</link><description>&lt;p&gt;
&#36890;&#36807;&#25193;&#25955;&#35268;&#21010;&#36827;&#34892;&#32844;&#19994;&#31726;&#29699;&#36816;&#21160;&#21592;&#34892;&#20026;&#21512;&#25104;
&lt;/p&gt;
&lt;p&gt;
Professional Basketball Player Behavior Synthesis via Planning with Diffusion. (arXiv:2306.04090v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04090
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20013;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;PLAYBEST&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#25193;&#25955;&#27010;&#29575;&#27169;&#22411;&#20174;&#31726;&#29699;&#27604;&#36187;&#21382;&#21490;&#25968;&#25454;&#20013;&#23398;&#20064;&#31574;&#30053;&#65292;&#29983;&#25104;&#26356;&#21152;&#30495;&#23454;&#21644;&#22810;&#26679;&#21270;&#30340;&#29699;&#21592;&#34892;&#20026;&#65292;&#20174;&#32780;&#25552;&#39640;&#29699;&#21592;&#30340;&#20915;&#31574;&#21046;&#23450;&#25928;&#26524;&#65292;&#24182;&#22312;&#23454;&#39564;&#20013;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#20013;&#21160;&#24577;&#35268;&#21010;&#24050;&#32463;&#34987;&#24212;&#29992;&#20110;&#25913;&#21892;&#21508;&#31181;&#39046;&#22495;&#30340;&#20915;&#31574;&#21046;&#23450;&#12290;&#32844;&#19994;&#31726;&#29699;&#20316;&#20026;&#19968;&#20010;&#21253;&#21547;&#38544;&#34109;&#24615;&#25112;&#30053;&#31574;&#30053;&#21644;&#20915;&#31574;&#21046;&#23450;&#30340;&#21160;&#24577;&#26102;&#31354;&#21338;&#24328;&#30340;&#24341;&#20154;&#27880;&#30446;&#30340;&#20363;&#23376;&#12290;&#28982;&#32780;&#65292;&#22788;&#29702;&#22810;&#26679;&#30340;&#22330;&#19978;&#20449;&#21495;&#21644;&#23548;&#33322;&#28508;&#22312;&#21160;&#20316;&#21644;&#32467;&#26524;&#30340;&#24191;&#38420;&#31354;&#38388;&#20351;&#24471;&#29616;&#26377;&#26041;&#27861;&#24456;&#38590;&#36805;&#36895;&#35782;&#21035;&#21709;&#24212;&#19981;&#26029;&#21464;&#21270;&#30340;&#24773;&#20917;&#19979;&#30340;&#26368;&#20339;&#31574;&#30053;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#23558;&#24207;&#21015;&#20915;&#31574;&#21046;&#23450;&#36807;&#31243;&#23450;&#20041;&#20026;&#26465;&#20214;&#36712;&#36857;&#29983;&#25104;&#36807;&#31243;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#24341;&#20837;PLAYBEST&#65288;PLAYER BEhavior SynThesis&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#25552;&#39640;&#29699;&#21592;&#20915;&#31574;&#21046;&#23450;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25193;&#23637;&#20102;&#26368;&#20808;&#36827;&#30340;&#29983;&#25104;&#27169;&#22411;&#8212;&#8212;&#25193;&#25955;&#27010;&#29575;&#27169;&#22411;&#65292;&#20197;&#20174;&#21382;&#21490;&#30340;&#32654;&#22269;&#32844;&#19994;&#31726;&#29699;&#32852;&#36187;(NBA)&#29699;&#21592;&#36816;&#21160;&#36319;&#36394;&#25968;&#25454;&#20013;&#23398;&#20064;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#22810;&#26234;&#33021;&#20307;&#29615;&#22659;&#21160;&#24577;&#12290;&#20026;&#20102;&#34701;&#21512;&#25968;&#25454;&#39537;&#21160;&#30340;&#31574;&#30053;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#36741;&#21161;&#21464;&#37327;&#21040;PLAYBEST&#20013;&#65292;&#20197;&#36866;&#24212;&#22806;&#37096;&#36755;&#20837;&#24182;&#29983;&#25104;&#30495;&#23454;&#21644;&#22810;&#26679;&#21270;&#30340;&#29699;&#21592;&#36712;&#36857;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;PLAYBEST&#21487;&#20197;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#29699;&#21592;&#34892;&#20026;&#65292;&#24182;&#22312;&#21508;&#31181;&#35780;&#20272;&#22330;&#26223;&#20013;&#20248;&#20110;&#22522;&#32447;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamically planning in multi-agent systems has been explored to improve decision-making in various domains. Professional basketball serves as a compelling example of a dynamic spatio-temporal game, encompassing both concealed strategic policies and decision-making. However, processing the diverse on-court signals and navigating the vast space of potential actions and outcomes makes it difficult for existing approaches to swiftly identify optimal strategies in response to evolving circumstances. In this study, we first formulate the sequential decision-making process as a conditional trajectory generation process. We further introduce PLAYBEST (PLAYer BEhavior SynThesis), a method for enhancing player decision-making. We extend the state-of-the-art generative model, diffusion probabilistic model, to learn challenging multi-agent environmental dynamics from historical National Basketball Association (NBA) player motion tracking data. To incorporate data-driven strategies, an auxiliary v
&lt;/p&gt;</description></item></channel></rss>