<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19977;&#31181;&#22522;&#20110;&#21464;&#20998;&#37327;&#23376;&#32447;&#36335;&#30340;&#36827;&#21270;&#20248;&#21270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#21464;&#20307;&#65292;&#24182;&#22312;Coin Game&#29615;&#22659;&#20013;&#35777;&#26126;&#20102;&#36825;&#20123;&#26041;&#27861;&#30456;&#27604;&#20110;&#32463;&#20856;&#26041;&#27861;&#34920;&#29616;&#26174;&#33879;&#26356;&#22909;&#12290;</title><link>http://arxiv.org/abs/2311.05546</link><description>&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#37327;&#23376;&#24378;&#21270;&#23398;&#20064;&#20351;&#29992;&#36827;&#21270;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Multi-Agent Quantum Reinforcement Learning using Evolutionary Optimization. (arXiv:2311.05546v2 [quant-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.05546
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19977;&#31181;&#22522;&#20110;&#21464;&#20998;&#37327;&#23376;&#32447;&#36335;&#30340;&#36827;&#21270;&#20248;&#21270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#21464;&#20307;&#65292;&#24182;&#22312;Coin Game&#29615;&#22659;&#20013;&#35777;&#26126;&#20102;&#36825;&#20123;&#26041;&#27861;&#30456;&#27604;&#20110;&#32463;&#20856;&#26041;&#27861;&#34920;&#29616;&#26174;&#33879;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#22312;&#33258;&#21160;&#39550;&#39542;&#21644;&#20854;&#20182;&#26234;&#33021;&#20135;&#19994;&#24212;&#29992;&#26041;&#38754;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#21033;&#29992;&#37327;&#23376;&#21147;&#23398;&#30340;&#22266;&#26377;&#23646;&#24615;&#65292;&#37319;&#29992;&#26032;&#30340;&#26377;&#24076;&#26395;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#26174;&#33879;&#20943;&#23569;&#27169;&#22411;&#30340;&#21487;&#35757;&#32451;&#21442;&#25968;&#12290;&#28982;&#32780;&#65292;&#22522;&#20110;&#26799;&#24230;&#30340;&#22810;&#26234;&#33021;&#20307;&#37327;&#23376;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#24120;&#24120;&#38754;&#20020;&#36139;&#30240;&#24179;&#21488;&#38382;&#39064;&#65292;&#38459;&#30861;&#20102;&#23427;&#20204;&#19982;&#32463;&#20856;&#26041;&#27861;&#24615;&#33021;&#30340;&#21305;&#37197;&#12290;&#25105;&#20204;&#22312;&#29616;&#26377;&#30340;&#26080;&#26799;&#24230;&#37327;&#23376;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#22522;&#30784;&#19978;&#26500;&#24314;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#22522;&#20110;&#21464;&#20998;&#37327;&#23376;&#32447;&#36335;&#30340;&#36827;&#21270;&#20248;&#21270;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#21464;&#20307;&#12290;&#25105;&#20204;&#22312;Coin Game&#29615;&#22659;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#36951;&#20256;&#21464;&#31181;&#65292;&#24182;&#19982;&#32463;&#20856;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#21464;&#20998;&#37327;&#23376;&#32447;&#36335;&#26041;&#27861;&#30456;&#27604;&#20110;&#20855;&#26377;&#31867;&#20284;&#21442;&#25968;&#25968;&#37327;&#30340;&#31070;&#32463;&#32593;&#32476;&#34920;&#29616;&#26174;&#33879;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-Agent Reinforcement Learning is becoming increasingly more important in times of autonomous driving and other smart industrial applications. Simultaneously a promising new approach to Reinforcement Learning arises using the inherent properties of quantum mechanics, reducing the trainable parameters of a model significantly. However, gradient-based Multi-Agent Quantum Reinforcement Learning methods often have to struggle with barren plateaus, holding them back from matching the performance of classical approaches. We build upon an existing approach for gradient free Quantum Reinforcement Learning and propose three genetic variations with Variational Quantum Circuits for Multi-Agent Reinforcement Learning using evolutionary optimization. We evaluate our genetic variations in the Coin Game environment and also compare them to classical approaches. We showed that our Variational Quantum Circuit approaches perform significantly better compared to a neural network with a similar amount
&lt;/p&gt;</description></item></channel></rss>