<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#30340;&#25361;&#25112;&#19982;&#24320;&#25918;&#38382;&#39064;&#65292;&#21253;&#25324;&#20219;&#21153;&#20998;&#37197;&#20248;&#21270;&#12289;&#22686;&#24378;&#25512;&#29702;&#33021;&#21147;&#12289;&#31649;&#29702;&#19978;&#19979;&#25991;&#20449;&#24687;&#21644;&#25913;&#21892;&#20869;&#23384;&#31649;&#29702;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#22312;&#21306;&#22359;&#38142;&#31995;&#32479;&#20013;&#30340;&#28508;&#21147;&#21644;&#26410;&#26469;&#21457;&#23637;&#12290;</title><link>https://arxiv.org/abs/2402.03578</link><description>&lt;p&gt;
LLM&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#65306;&#25361;&#25112;&#19982;&#24320;&#25918;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
LLM Multi-Agent Systems: Challenges and Open Problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#30340;&#25361;&#25112;&#19982;&#24320;&#25918;&#38382;&#39064;&#65292;&#21253;&#25324;&#20219;&#21153;&#20998;&#37197;&#20248;&#21270;&#12289;&#22686;&#24378;&#25512;&#29702;&#33021;&#21147;&#12289;&#31649;&#29702;&#19978;&#19979;&#25991;&#20449;&#24687;&#21644;&#25913;&#21892;&#20869;&#23384;&#31649;&#29702;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#22312;&#21306;&#22359;&#38142;&#31995;&#32479;&#20013;&#30340;&#28508;&#21147;&#21644;&#26410;&#26469;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#29616;&#26377;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#30340;&#30740;&#31350;&#24037;&#20316;&#65292;&#24182;&#35782;&#21035;&#20986;&#23578;&#26410;&#20805;&#20998;&#35299;&#20915;&#30340;&#25361;&#25112;&#12290;&#36890;&#36807;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#20869;&#20010;&#20307;&#26234;&#33021;&#20307;&#30340;&#22810;&#26679;&#33021;&#21147;&#21644;&#35282;&#33394;&#65292;&#36825;&#20123;&#31995;&#32479;&#21487;&#20197;&#36890;&#36807;&#21327;&#20316;&#26469;&#22788;&#29702;&#22797;&#26434;&#20219;&#21153;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20248;&#21270;&#20219;&#21153;&#20998;&#37197;&#12289;&#36890;&#36807;&#36845;&#20195;&#36777;&#35770;&#20419;&#36827;&#24378;&#22823;&#25512;&#29702;&#12289;&#31649;&#29702;&#22797;&#26434;&#21644;&#20998;&#23618;&#30340;&#19978;&#19979;&#25991;&#20449;&#24687;&#20197;&#21450;&#22686;&#24378;&#20869;&#23384;&#31649;&#29702;&#20197;&#25903;&#25345;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#20869;&#30340;&#22797;&#26434;&#20132;&#20114;&#12290;&#25105;&#20204;&#36824;&#25506;&#35752;&#20102;&#22312;&#21306;&#22359;&#38142;&#31995;&#32479;&#20013;&#24212;&#29992;&#22810;&#26234;&#33021;&#20307;&#31995;&#32479;&#30340;&#28508;&#21147;&#65292;&#20197;&#21551;&#31034;&#20854;&#22312;&#30495;&#23454;&#20998;&#24067;&#24335;&#31995;&#32479;&#20013;&#30340;&#26410;&#26469;&#21457;&#23637;&#21644;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper explores existing works of multi-agent systems and identifies challenges that remain inadequately addressed. By leveraging the diverse capabilities and roles of individual agents within a multi-agent system, these systems can tackle complex tasks through collaboration. We discuss optimizing task allocation, fostering robust reasoning through iterative debates, managing complex and layered context information, and enhancing memory management to support the intricate interactions within multi-agent systems. We also explore the potential application of multi-agent systems in blockchain systems to shed light on their future development and application in real-world distributed systems.
&lt;/p&gt;</description></item></channel></rss>