<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#31227;&#21160;&#35745;&#31639;&#20013;&#30340;&#25506;&#32034;&#21644;&#20250;&#21512;&#20004;&#20010;&#22522;&#26412;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20998;&#21035;&#33021;&#22312;&#22270;&#20013;$m$&#20010;&#21516;&#27493;&#26102;&#38388;&#27493;&#23454;&#29616;&#38598;&#20307;&#25506;&#32034;&#21644;$\frac{3}{2}m$&#26102;&#38388;&#27493;&#20869;&#23454;&#29616;&#20250;&#21512;&#30340;&#31639;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.07748</link><description>&lt;p&gt;
&#38463;&#29790;&#38463;&#24503;&#28037;&#21644;&#24530;&#20462;&#26031;&#65306;&#22312;&#26410;&#30693;&#22270;&#20013;&#25506;&#32034;&#21644;&#20250;&#21512;&#30340;&#20004;&#20010;&#31227;&#21160;&#20195;&#29702;
&lt;/p&gt;
&lt;p&gt;
Ariadne and Theseus: Exploration and Rendezvous with Two Mobile Agents in an Unknown Graph
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07748
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#31227;&#21160;&#35745;&#31639;&#20013;&#30340;&#25506;&#32034;&#21644;&#20250;&#21512;&#20004;&#20010;&#22522;&#26412;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20998;&#21035;&#33021;&#22312;&#22270;&#20013;$m$&#20010;&#21516;&#27493;&#26102;&#38388;&#27493;&#23454;&#29616;&#38598;&#20307;&#25506;&#32034;&#21644;$\frac{3}{2}m$&#26102;&#38388;&#27493;&#20869;&#23454;&#29616;&#20250;&#21512;&#30340;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#31227;&#21160;&#35745;&#31639;&#20013;&#30340;&#20004;&#20010;&#22522;&#26412;&#38382;&#39064;&#65306;&#25506;&#32034;&#21644;&#20250;&#21512;&#65292;&#28041;&#21450;&#21040;&#19968;&#20010;&#26410;&#30693;&#22270;&#20013;&#30340;&#20004;&#20010;&#19981;&#21516;&#31227;&#21160;&#20195;&#29702;&#12290;&#36825;&#20004;&#20010;&#20195;&#29702;&#21487;&#20197;&#22312;&#25152;&#26377;&#33410;&#28857;&#19978;&#30340;&#30333;&#26495;&#19978;&#35835;&#20889;&#20449;&#24687;&#12290;&#23427;&#20204;&#27599;&#19968;&#27493;&#37117;&#27839;&#30528;&#19968;&#20010;&#30456;&#37051;&#30340;&#36793;&#31227;&#21160;&#12290;&#22312;&#25506;&#32034;&#38382;&#39064;&#20013;&#65292;&#20004;&#20010;&#20195;&#29702;&#20174;&#22270;&#20013;&#30456;&#21516;&#30340;&#33410;&#28857;&#20986;&#21457;&#65292;&#24517;&#39035;&#36941;&#21382;&#25152;&#26377;&#30340;&#36793;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#28145;&#24230;&#20248;&#20808;&#25628;&#32034;&#30340;&#19968;&#20010;&#31616;&#21333;&#21464;&#20307;&#21487;&#20197;&#22312;$m$&#20010;&#21516;&#27493;&#26102;&#38388;&#27493;&#20013;&#23454;&#29616;&#38598;&#20307;&#25506;&#32034;&#65292;&#20854;&#20013;$m$&#26159;&#22270;&#30340;&#36793;&#25968;&#12290;&#36825;&#25552;&#39640;&#20102;&#38598;&#20307;&#22270;&#25506;&#32034;&#30340;&#31454;&#20105;&#27604;&#29575;&#12290;&#22312;&#20250;&#21512;&#38382;&#39064;&#20013;&#65292;&#20195;&#29702;&#20174;&#22270;&#20013;&#19981;&#21516;&#30340;&#33410;&#28857;&#20986;&#21457;&#65292;&#24517;&#39035;&#23613;&#24555;&#30456;&#36935;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#20445;&#35777;&#22312;&#33267;&#22810;$\frac{3}{2}m$&#20010;&#26102;&#38388;&#27493;&#20869;&#20250;&#21512;&#12290;&#36825;&#27604;&#25152;&#35859;&#30340;&#8220;&#31561;&#22920;&#22920;&#8221;&#31639;&#27861;&#38656;&#27714;&#30340;$2m$&#26102;&#38388;&#27493;&#26356;&#22909;&#12290;&#25105;&#20204;&#25152;&#26377;&#30340;&#20445;&#35777;&#37117;&#26159;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07748v1 Announce Type: cross  Abstract: We investigate two fundamental problems in mobile computing: exploration and rendezvous, with two distinct mobile agents in an unknown graph. The agents can read and write information on whiteboards that are located at all nodes. They both move along one adjacent edge at every time-step. In the exploration problem, both agents start from the same node of the graph and must traverse all of its edges. We show that a simple variant of depth-first search achieves collective exploration in $m$ synchronous time-steps, where $m$ is the number of edges of the graph. This improves the competitive ratio of collective graph exploration. In the rendezvous problem, the agents start from different nodes of the graph and must meet as fast as possible. We introduce an algorithm guaranteeing rendezvous in at most $\frac{3}{2}m$ time-steps. This improves over the so-called `wait for Mommy' algorithm which requires $2m$ time-steps. All our guarantees are
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35821;&#20041;&#24863;&#30693;&#22810;&#22336;&#35775;&#38382;&#26041;&#26696;&#65292;&#26088;&#22312;&#20248;&#21270;&#36164;&#28304;&#21033;&#29992;&#19982;&#20844;&#24179;&#24615;&#30340;&#26435;&#34913;&#65292;&#24182;&#32771;&#34385;&#29992;&#25143;&#25968;&#25454;&#30340;&#30456;&#20851;&#24615;&#65292;&#20197;&#28385;&#36275;&#26410;&#26469;6G&#24212;&#29992;&#30340;&#35201;&#27714;&#21644;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.06308</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#20998;&#24067;&#24335;&#12289;&#21160;&#24577;6G&#24212;&#29992;&#30340;&#35821;&#20041;&#24863;&#30693;&#22810;&#22336;&#35775;&#38382;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
A Semantic-Aware Multiple Access Scheme for Distributed, Dynamic 6G-Based Applications. (arXiv:2401.06308v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06308
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35821;&#20041;&#24863;&#30693;&#22810;&#22336;&#35775;&#38382;&#26041;&#26696;&#65292;&#26088;&#22312;&#20248;&#21270;&#36164;&#28304;&#21033;&#29992;&#19982;&#20844;&#24179;&#24615;&#30340;&#26435;&#34913;&#65292;&#24182;&#32771;&#34385;&#29992;&#25143;&#25968;&#25454;&#30340;&#30456;&#20851;&#24615;&#65292;&#20197;&#28385;&#36275;&#26410;&#26469;6G&#24212;&#29992;&#30340;&#35201;&#27714;&#21644;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#20041;&#24863;&#30693;&#33539;&#24335;&#30340;&#20986;&#29616;&#20026;&#21019;&#26032;&#30340;&#26381;&#21153;&#25552;&#20379;&#20102;&#26426;&#20250;&#65292;&#23588;&#20854;&#26159;&#22312;&#22522;&#20110;6G&#30340;&#24212;&#29992;&#29615;&#22659;&#20013;&#12290;&#23613;&#31649;&#22312;&#35821;&#20041;&#25552;&#21462;&#25216;&#26415;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#65292;&#20294;&#23558;&#35821;&#20041;&#20449;&#24687;&#32435;&#20837;&#36164;&#28304;&#20998;&#37197;&#20915;&#31574;&#20173;&#22788;&#20110;&#26089;&#26399;&#38454;&#27573;&#65292;&#32570;&#20047;&#23545;&#26410;&#26469;&#31995;&#32479;&#38656;&#27714;&#21644;&#29305;&#24615;&#30340;&#32771;&#34385;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26080;&#32447;&#39057;&#35889;&#22810;&#22336;&#35775;&#38382;&#38382;&#39064;&#30340;&#24314;&#27169;&#12290;&#23427;&#26088;&#22312;&#20248;&#21270;&#21033;&#29992;&#29575;&#19982;&#20844;&#24179;&#24615;&#30340;&#26435;&#34913;&#65292;&#20351;&#29992;&#945;-&#20844;&#24179;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#33258;&#21161;&#21534;&#21520;&#37327;&#21644;&#21327;&#21161;&#21534;&#21520;&#37327;&#30340;&#27010;&#24565;&#26469;&#32771;&#34385;&#29992;&#25143;&#25968;&#25454;&#30340;&#30456;&#20851;&#24615;&#12290;&#39318;&#20808;&#65292;&#20998;&#26512;&#20102;&#35813;&#38382;&#39064;&#65292;&#25214;&#20986;&#20102;&#26368;&#20248;&#35299;&#12290;&#25509;&#19979;&#26469;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#26080;&#20851;&#30340;&#22810;&#20027;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#25216;&#26415;&#30340;&#35821;&#20041;&#24863;&#30693;&#22810;&#26234;&#33021;&#20307;&#21452;&#37325;&#21644;&#20915;&#26007;&#28145;&#24230;Q&#23398;&#20064; (SAMA-D3QL) &#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The emergence of the semantic-aware paradigm presents opportunities for innovative services, especially in the context of 6G-based applications. Although significant progress has been made in semantic extraction techniques, the incorporation of semantic information into resource allocation decision-making is still in its early stages, lacking consideration of the requirements and characteristics of future systems. In response, this paper introduces a novel formulation for the problem of multiple access to the wireless spectrum. It aims to optimize the utilization-fairness trade-off, using the $\alpha$-fairness metric, while accounting for user data correlation by introducing the concepts of self- and assisted throughputs. Initially, the problem is analyzed to identify its optimal solution. Subsequently, a Semantic-Aware Multi-Agent Double and Dueling Deep Q-Learning (SAMA-D3QL) technique is proposed. This method is grounded in Model-free Multi-Agent Deep Reinforcement Learning (MADRL),
&lt;/p&gt;</description></item></channel></rss>