<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;</title><link>https://arxiv.org/abs/2403.18166</link><description>&lt;p&gt;
&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#20013;&#30340;Vertiport&#39044;&#35746;&#65306;&#22522;&#20110;&#25293;&#21334;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35745;&#26410;&#26469;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#65288;AAM&#65289;&#30340;&#23835;&#36215;&#23558;&#25104;&#20026;&#19968;&#20010;&#25968;&#21313;&#20159;&#32654;&#20803;&#30340;&#20135;&#19994;&#12290;&#24066;&#22330;&#26426;&#21046;&#34987;&#35748;&#20026;&#26159;AAM&#36816;&#33829;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20854;&#20013;&#21253;&#25324;&#20855;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#24322;&#26500;&#36816;&#33829;&#21830;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#35774;&#35745;&#19968;&#31181;&#26426;&#21046;&#26469;&#21327;&#35843;&#30001;&#22810;&#20010;&#20855;&#26377;&#19982;&#20854;&#26426;&#32676;&#20851;&#32852;&#30340;&#24322;&#26500;&#20272;&#20540;&#30340;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#24378;&#21046;&#25191;&#34892;vertiports&#30340;&#21040;&#36798;&#12289;&#31163;&#24320;&#21644;&#20572;&#36710;&#32422;&#26463;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26368;&#22823;&#21270;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#24230;&#37327;&#26631;&#20934;&#65292;&#20174;&#32780;&#21253;&#25324;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#39640;&#20102;&#35774;&#35745;&#36825;&#19968;&#26426;&#21046;&#30340;&#35745;&#31639;&#21487;&#22788;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18166v1 Announce Type: cross  Abstract: The rise of advanced air mobility (AAM) is expected to become a multibillion-dollar industry in the near future. Market-based mechanisms are touted to be an integral part of AAM operations, which comprise heterogeneous operators with private valuations. In this work, we study the problem of designing a mechanism to coordinate the movement of electric vertical take-off and landing (eVTOL) aircraft, operated by multiple operators each having heterogeneous valuations associated with their fleet, between vertiports, while enforcing the arrival, departure, and parking constraints at vertiports. Particularly, we propose an incentive-compatible and individually rational vertiport reservation mechanism that maximizes a social welfare metric, which encapsulates the objective of maximizing the overall valuations of all operators while minimizing the congestion at vertiports. Additionally, we improve the computational tractability of designing th
&lt;/p&gt;</description></item></channel></rss>