<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#25511;&#21046;&#21644;&#21327;&#35843;&#28151;&#21512;&#20132;&#36890;&#65292;&#29305;&#21035;&#26159;&#20154;&#39550;&#39542;&#36710;&#36742;&#21644;&#26426;&#22120;&#20154;&#36710;&#36742;&#22312;&#23454;&#38469;&#22797;&#26434;&#20132;&#21449;&#21475;&#30340;&#24212;&#29992;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#29992;5%&#30340;&#26426;&#22120;&#20154;&#36710;&#36742;&#21487;&#20197;&#26377;&#25928;&#38450;&#27490;&#20132;&#21449;&#21475;&#20869;&#30340;&#25317;&#22581;&#24418;&#25104;&#12290;</title><link>http://arxiv.org/abs/2301.05294</link><description>&lt;p&gt;
&#36890;&#36807;&#26426;&#22120;&#20154;&#36710;&#36742;&#22312;&#22797;&#26434;&#21644;&#26080;&#20449;&#21495;&#30340;&#20132;&#21449;&#21475;&#20013;&#23398;&#20064;&#25511;&#21046;&#21644;&#21327;&#35843;&#28151;&#21512;&#20132;&#36890;
&lt;/p&gt;
&lt;p&gt;
Learning to Control and Coordinate Mixed Traffic Through Robot Vehicles at Complex and Unsignalized Intersections. (arXiv:2301.05294v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05294
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#25511;&#21046;&#21644;&#21327;&#35843;&#28151;&#21512;&#20132;&#36890;&#65292;&#29305;&#21035;&#26159;&#20154;&#39550;&#39542;&#36710;&#36742;&#21644;&#26426;&#22120;&#20154;&#36710;&#36742;&#22312;&#23454;&#38469;&#22797;&#26434;&#20132;&#21449;&#21475;&#30340;&#24212;&#29992;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#29992;5%&#30340;&#26426;&#22120;&#20154;&#36710;&#36742;&#21487;&#20197;&#26377;&#25928;&#38450;&#27490;&#20132;&#21449;&#21475;&#20869;&#30340;&#25317;&#22581;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20132;&#21449;&#21475;&#26159;&#29616;&#20195;&#22823;&#37117;&#24066;&#20132;&#36890;&#20013;&#24517;&#19981;&#21487;&#23569;&#30340;&#36947;&#36335;&#22522;&#30784;&#35774;&#26045;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20132;&#36890;&#20107;&#25925;&#25110;&#32570;&#20047;&#20132;&#36890;&#21327;&#35843;&#26426;&#21046;&#65288;&#22914;&#20132;&#36890;&#20449;&#21495;&#28783;&#65289;&#65292;&#23427;&#20204;&#20063;&#21487;&#33021;&#25104;&#20026;&#20132;&#36890;&#27969;&#30340;&#29942;&#39048;&#12290;&#26368;&#36817;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#36229;&#36234;&#20256;&#32479;&#25511;&#21046;&#26041;&#27861;&#30340;&#25511;&#21046;&#21644;&#21327;&#35843;&#26426;&#21046;&#65292;&#20197;&#25552;&#39640;&#20132;&#21449;&#21475;&#20132;&#36890;&#30340;&#25928;&#29575;&#12290;&#22312;&#36825;&#20123;&#26041;&#27861;&#20013;&#65292;&#25511;&#21046;&#21487;&#39044;&#35265;&#30340;&#21253;&#21547;&#20154;&#39550;&#39542;&#36710;&#36742;&#65288;HVs&#65289;&#21644;&#26426;&#22120;&#20154;&#36710;&#36742;&#65288;RVs&#65289;&#30340;&#28151;&#21512;&#20132;&#36890;&#24050;&#32463;&#20986;&#29616;&#12290;&#22312;&#26412;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#23454;&#38469;&#22797;&#26434;&#20132;&#21449;&#21475;&#30340;&#28151;&#21512;&#20132;&#36890;&#30340;&#25511;&#21046;&#21644;&#21327;&#35843;&#65292;&#36825;&#26159;&#19968;&#20010;&#20197;&#21069;&#26410;&#34987;&#25506;&#32034;&#36807;&#30340;&#20027;&#39064;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#23454;&#39564;&#65292;&#20197;&#23637;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#23454;&#38469;&#20132;&#36890;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;5%&#30340;RVs&#65292;&#25105;&#20204;&#21487;&#20197;&#38450;&#27490;&#22797;&#26434;&#20132;&#21449;&#21475;&#20869;&#30340;&#25317;&#22581;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intersections are essential road infrastructures for traffic in modern metropolises. However, they can also be the bottleneck of traffic flows as a result of traffic incidents or the absence of traffic coordination mechanisms such as traffic lights. Recently, various control and coordination mechanisms that are beyond traditional control methods have been proposed to improve the efficiency of intersection traffic. Amongst these methods, the control of foreseeable mixed traffic that consists of human-driven vehicles (HVs) and robot vehicles (RVs) has emerged. In this project, we propose a decentralized multi-agent reinforcement learning approach for the control and coordination of mixed traffic at real-world, complex intersections--a topic that has not been previously explored. Comprehensive experiments are conducted to show the effectiveness of our approach. In particular, we show that using 5% RVs, we can prevent congestion formation inside a complex intersection under the actual traf
&lt;/p&gt;</description></item></channel></rss>