<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38646;&#38454;&#38543;&#26426;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#26080;&#32447;&#36890;&#20449;&#36890;&#36947;&#30340;&#29305;&#24615;&#65292;&#22312;&#23398;&#20064;&#31639;&#27861;&#20013;&#32771;&#34385;&#20102;&#26080;&#32447;&#36890;&#36947;&#65292;&#36991;&#20813;&#20102;&#36164;&#28304;&#30340;&#28010;&#36153;&#21644;&#20998;&#26512;&#38590;&#24230;&#12290;</title><link>https://arxiv.org/abs/2401.17460</link><description>&lt;p&gt;
&#20351;&#26080;&#32447;&#29615;&#22659;&#23545;&#26799;&#24230;&#20272;&#35745;&#22120;&#26377;&#29992;&#65306;&#19968;&#31181;&#38646;&#38454;&#38543;&#26426;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Rendering Wireless Environments Useful for Gradient Estimators: A Zero-Order Stochastic Federated Learning Method
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17460
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38646;&#38454;&#38543;&#26426;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#26080;&#32447;&#36890;&#20449;&#36890;&#36947;&#30340;&#29305;&#24615;&#65292;&#22312;&#23398;&#20064;&#31639;&#27861;&#20013;&#32771;&#34385;&#20102;&#26080;&#32447;&#36890;&#36947;&#65292;&#36991;&#20813;&#20102;&#36164;&#28304;&#30340;&#28010;&#36153;&#21644;&#20998;&#26512;&#38590;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20801;&#35768;&#22810;&#20010;&#36793;&#32536;&#35774;&#22791;&#21327;&#21516;&#35757;&#32451;&#27169;&#22411;&#65292;&#32780;&#26080;&#38656;&#20844;&#24320;&#21407;&#22987;&#25968;&#25454;&#12290;&#28982;&#32780;&#65292;&#24403;&#35774;&#22791;&#21644;&#26381;&#21153;&#22120;&#36890;&#36807;&#26080;&#32447;&#20449;&#36947;&#36890;&#20449;&#26102;&#65292;&#35813;&#26041;&#27861;&#38754;&#20020;&#30528;&#36890;&#20449;&#21644;&#35745;&#31639;&#29942;&#39048;&#12290;&#36890;&#36807;&#21033;&#29992;&#19968;&#20010;&#36890;&#20449;&#39640;&#25928;&#30340;&#26694;&#26550;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38646;&#38454;&#65288;ZO&#65289;&#26041;&#27861;&#65292;&#37319;&#29992;&#19968;&#28857;&#26799;&#24230;&#20272;&#35745;&#22120;&#65292;&#21033;&#29992;&#26080;&#32447;&#36890;&#20449;&#36890;&#36947;&#30340;&#29305;&#24615;&#65292;&#32780;&#26080;&#38656;&#30693;&#36947;&#36890;&#36947;&#29366;&#24577;&#31995;&#25968;&#12290;&#36825;&#26159;&#31532;&#19968;&#31181;&#23558;&#26080;&#32447;&#36890;&#36947;&#21253;&#21547;&#22312;&#23398;&#20064;&#31639;&#27861;&#26412;&#36523;&#20013;&#30340;&#26041;&#27861;&#65292;&#32780;&#19981;&#26159;&#28010;&#36153;&#36164;&#28304;&#26469;&#20998;&#26512;&#21644;&#28040;&#38500;&#20854;&#24433;&#21709;&#12290;&#36825;&#39033;&#24037;&#20316;&#30340;&#20004;&#20010;&#20027;&#35201;&#22256;&#38590;&#26159;&#65292;&#22312;FL&#20013;&#65292;&#30446;&#26631;&#20989;&#25968;&#36890;&#24120;&#19981;&#26159;&#20984;&#30340;&#65292;&#36825;&#20351;&#24471;&#23558;FL&#25193;&#23637;&#21040;ZO&#26041;&#27861;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#20197;&#21450;&#21253;&#25324;&#24433;&#21709;&#30340;&#38590;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Federated learning (FL) is a novel approach to machine learning that allows multiple edge devices to collaboratively train a model without disclosing their raw data. However, several challenges hinder the practical implementation of this approach, especially when devices and the server communicate over wireless channels, as it suffers from communication and computation bottlenecks in this case. By utilizing a communication-efficient framework, we propose a novel zero-order (ZO) method with a one-point gradient estimator that harnesses the nature of the wireless communication channel without requiring the knowledge of the channel state coefficient. It is the first method that includes the wireless channel in the learning algorithm itself instead of wasting resources to analyze it and remove its impact. The two main difficulties of this work are that in FL, the objective function is usually not convex, which makes the extension of FL to ZO methods challenging, and that including the impa
&lt;/p&gt;</description></item></channel></rss>