<rss version="2.0"><channel><title>Chat Arxiv cs.MA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.MA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#35745;&#21010;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#33021;&#22815;&#30830;&#20445;&#22810;&#20010;&#26234;&#33021;&#20307;&#20043;&#38388;&#19981;&#21457;&#29983;&#30896;&#25758;&#65292;&#24182;&#20351;&#29992; ASP-MAUPF &#31995;&#32479;&#36827;&#34892;&#23454;&#39564;&#65292;&#23545;&#20854;&#36866;&#29992;&#24615;&#21644;&#29615;&#22659;&#20381;&#36182;&#24230;&#36827;&#34892;&#20102;&#35266;&#23519;&#21644;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2305.16203</link><description>&lt;p&gt;
&#35745;&#31639;&#22810;&#26234;&#33021;&#20307;&#37096;&#20998;&#21487;&#35266;&#27979;&#36335;&#24452;&#35268;&#21010;&#38382;&#39064;&#30340;&#36890;&#29992;&#35745;&#21010;
&lt;/p&gt;
&lt;p&gt;
On Computing Universal Plans for Partially Observable Multi-Agent Path Finding. (arXiv:2305.16203v2 [cs.MA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.16203
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#35745;&#21010;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#33021;&#22815;&#30830;&#20445;&#22810;&#20010;&#26234;&#33021;&#20307;&#20043;&#38388;&#19981;&#21457;&#29983;&#30896;&#25758;&#65292;&#24182;&#20351;&#29992; ASP-MAUPF &#31995;&#32479;&#36827;&#34892;&#23454;&#39564;&#65292;&#23545;&#20854;&#36866;&#29992;&#24615;&#21644;&#29615;&#22659;&#20381;&#36182;&#24230;&#36827;&#34892;&#20102;&#35266;&#23519;&#21644;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#36335;&#24452;&#35268;&#21010;&#38382;&#39064;&#22312;&#29616;&#20170;&#24191;&#27867;&#24212;&#29992;&#20110;&#20179;&#24211;&#26426;&#22120;&#20154;&#12289;&#29289;&#27969;&#33258;&#21160;&#21270;&#12289;&#20132;&#36890;&#25511;&#21046;&#31561;&#39046;&#22495;&#12290;&#26412;&#25991;&#23558;&#20854;&#30475;&#20316;&#26159;&#36890;&#29992;&#35268;&#21010;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#36890;&#29992;&#35745;&#21010;&#65288;&#21448;&#31216;&#31574;&#30053;&#65289;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#23454;&#29616;&#20102;&#19968;&#20010;&#21517;&#20026; ASP-MAUPF &#30340;&#31995;&#32479;&#26469;&#35745;&#31639;&#23427;&#20204;&#12290;&#35813;&#31995;&#32479;&#33021;&#22815;&#22312;&#20219;&#24847;&#20108;&#32500;&#22320;&#22270;&#21644;&#26234;&#33021;&#20307;&#30446;&#26631;&#37197;&#32622;&#19979;&#65292;&#25214;&#21040;&#19968;&#20010;&#36866;&#29992;&#20110;&#27599;&#20010;&#26234;&#33021;&#20307;&#30340;&#36890;&#29992;&#35745;&#21010;&#65292;&#20197;&#30830;&#20445;&#23427;&#20204;&#20043;&#38388;&#20114;&#19981;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-agent routing problems have drawn significant attention nowadays due to their broad industrial applications in, e.g., warehouse robots, logistics automation, and traffic control. Conventionally, they are modelled as classical planning problems. In this paper, we argue that it is beneficial to formulate them as universal planning problems. We therefore propose universal plans, also known as policies, as the solution concepts, and implement a system called ASP-MAUPF (Answer Set Programming for Multi-Agent Universal Plan Finding) for computing them. Given an arbitrary two-dimensional map and a profile of goals for the agents, the system finds a feasible universal plan for each agent that ensures no collision with others. We use the system to conduct some experiments, and make some observations on the types of goal profiles and environments that will have feasible policies, and how they may depend on agents' sensors. We also demonstrate how users can customize action preferences to c
&lt;/p&gt;</description></item></channel></rss>