<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#36825;&#20010;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#21253;&#21547;&#31264;&#23494;&#22478;&#24066;&#29615;&#22659;&#20013;&#26080;&#32447;&#22320;&#22270;&#25968;&#25454;&#38598;&#30340;&#30740;&#31350;&#12290;&#36825;&#20010;&#25968;&#25454;&#38598;&#33021;&#22815;&#29992;&#20110;&#36335;&#24452;&#25439;&#32791;&#39044;&#27979;&#21644;&#26080;&#32447;&#23450;&#20301;&#65292;&#36890;&#36807;&#22312;&#30456;&#21516;&#30340;&#22478;&#24066;&#22320;&#22270;&#19978;&#35745;&#31639;&#24471;&#21040;RSS&#21644;ToA&#22320;&#22270;&#65292;&#21487;&#20197;&#20844;&#24179;&#27604;&#36739;&#20004;&#31181;&#23450;&#20301;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2212.11777</link><description>&lt;p&gt;
&#20855;&#26377;&#23450;&#20301;&#24212;&#29992;&#30340;&#36335;&#24452;&#25439;&#32791;&#21644;&#21040;&#36798;&#26102;&#38388;&#26080;&#32447;&#22320;&#22270;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
Dataset of Pathloss and ToA Radio Maps With Localization Application. (arXiv:2212.11777v2 [cs.NI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.11777
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#21253;&#21547;&#31264;&#23494;&#22478;&#24066;&#29615;&#22659;&#20013;&#26080;&#32447;&#22320;&#22270;&#25968;&#25454;&#38598;&#30340;&#30740;&#31350;&#12290;&#36825;&#20010;&#25968;&#25454;&#38598;&#33021;&#22815;&#29992;&#20110;&#36335;&#24452;&#25439;&#32791;&#39044;&#27979;&#21644;&#26080;&#32447;&#23450;&#20301;&#65292;&#36890;&#36807;&#22312;&#30456;&#21516;&#30340;&#22478;&#24066;&#22320;&#22270;&#19978;&#35745;&#31639;&#24471;&#21040;RSS&#21644;ToA&#22320;&#22270;&#65292;&#21487;&#20197;&#20844;&#24179;&#27604;&#36739;&#20004;&#31181;&#23450;&#20301;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#31264;&#23494;&#22478;&#24066;&#29615;&#22659;&#20013;&#29983;&#25104;&#24182;&#20844;&#24320;&#25552;&#20379;&#30340;&#19968;&#32452;&#26080;&#32447;&#22320;&#22270;&#25968;&#25454;&#38598;&#12290;&#36825;&#20123;&#25968;&#25454;&#38598;&#21253;&#25324;&#27169;&#25311;&#30340;&#36335;&#24452;&#25439;&#32791;/&#25509;&#25910;&#20449;&#21495;&#24378;&#24230;&#65288;RSS&#65289;&#21644;&#21040;&#36798;&#26102;&#38388;&#65288;ToA&#65289;&#26080;&#32447;&#22320;&#22270;&#65292;&#35206;&#30422;&#20102;&#22823;&#37327;&#30495;&#23454;&#22478;&#24066;&#22320;&#22270;&#30340;&#31264;&#23494;&#22478;&#24066;&#35774;&#32622;&#12290;&#35813;&#25968;&#25454;&#38598;&#30340;&#20004;&#20010;&#20027;&#35201;&#24212;&#29992;&#26159;1&#65289;&#20174;&#36755;&#20837;&#30340;&#22478;&#24066;&#22320;&#22270;&#39044;&#27979;&#36335;&#24452;&#25439;&#32791;&#30340;&#23398;&#20064;&#26041;&#27861;&#65288;&#21363;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#25311;&#65289;&#65292;&#20197;&#21450;2&#65289;&#26080;&#32447;&#23450;&#20301;&#12290;RSS&#21644;ToA&#22320;&#22270;&#36890;&#36807;&#30456;&#21516;&#30340;&#27169;&#25311;&#22312;&#30456;&#21516;&#30340;&#22478;&#24066;&#22320;&#22270;&#19978;&#35745;&#31639;&#24471;&#20986;&#65292;&#21487;&#20197;&#23545;&#22522;&#20110;RSS&#21644;ToA&#30340;&#23450;&#20301;&#26041;&#27861;&#36827;&#34892;&#20844;&#24179;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this article, we present a collection of radio map datasets in dense urban setting, which we generated and made publicly available. The datasets include simulated pathloss/received signal strength (RSS) and time of arrival (ToA) radio maps over a large collection of realistic dense urban setting in real city maps. The two main applications of the presented dataset are 1) learning methods that predict the pathloss from input city maps (namely, deep learning-based simulations), and, 2) wireless localization. The fact that the RSS and ToA maps are computed by the same simulations over the same city maps allows for a fair comparison of the RSS and ToA-based localization methods.
&lt;/p&gt;</description></item></channel></rss>