<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#25552;&#20986;&#20102;&#31070;&#32463;FDE&#65292;&#19968;&#31181;&#26032;&#22411;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#21487;&#35843;&#25972;FDE&#20197;&#36866;&#24212;&#25968;&#25454;&#21160;&#24577;&#65292;&#21487;&#33021;&#20248;&#20110;&#31070;&#32463;OD&#12290;</title><link>https://arxiv.org/abs/2403.02737</link><description>&lt;p&gt;
&#31070;&#32463;&#20998;&#25968;&#38454;&#24494;&#20998;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Neural Fractional Differential Equations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02737
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#31070;&#32463;FDE&#65292;&#19968;&#31181;&#26032;&#22411;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#21487;&#35843;&#25972;FDE&#20197;&#36866;&#24212;&#25968;&#25454;&#21160;&#24577;&#65292;&#21487;&#33021;&#20248;&#20110;&#31070;&#32463;OD&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25968;&#38454;&#24494;&#20998;&#26041;&#31243;&#65288;FDEs&#65289;&#26159;&#31185;&#23398;&#21644;&#24037;&#31243;&#20013;&#24314;&#27169;&#22797;&#26434;&#31995;&#32479;&#30340;&#22522;&#26412;&#24037;&#20855;&#12290; &#23427;&#20204;&#23558;&#20256;&#32479;&#30340;&#24494;&#20998;&#21644;&#31215;&#20998;&#27010;&#24565;&#25193;&#23637;&#21040;&#38750;&#25972;&#25968;&#38454;&#65292;&#20351;&#24471;&#33021;&#22815;&#26356;&#31934;&#30830;&#22320;&#34920;&#31034;&#20855;&#26377;&#38750;&#23616;&#37096;&#21644;&#35760;&#24518;&#20381;&#36182;&#34892;&#20026;&#29305;&#24449;&#30340;&#36807;&#31243;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#21463;&#31070;&#32463;&#24120;&#24494;&#20998;&#26041;&#31243;&#65288;Neural ODEs&#65289;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#31070;&#32463;FDE&#65292;&#36825;&#26159;&#19968;&#31181;&#35843;&#25972;FDE&#20197;&#36866;&#24212;&#25968;&#25454;&#21160;&#24577;&#30340;&#26032;&#22411;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#12290;&#36825;&#39033;&#24037;&#20316;&#20840;&#38754;&#27010;&#36848;&#20102;&#31070;&#32463;FDE&#20013;&#37319;&#29992;&#30340;&#25968;&#20540;&#26041;&#27861;&#21644;&#31070;&#32463;FDE&#26550;&#26500;&#12290;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#65292;&#23613;&#31649;&#35745;&#31639;&#35201;&#27714;&#26356;&#39640;&#65292;&#31070;&#32463;FDE&#21487;&#33021;&#20248;&#20110;&#31070;&#32463;OD&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02737v1 Announce Type: new  Abstract: Fractional Differential Equations (FDEs) are essential tools for modelling complex systems in science and engineering. They extend the traditional concepts of differentiation and integration to non-integer orders, enabling a more precise representation of processes characterised by non-local and memory-dependent behaviours.   This property is useful in systems where variables do not respond to changes instantaneously, but instead exhibit a strong memory of past interactions.   Having this in mind, and drawing inspiration from Neural Ordinary Differential Equations (Neural ODEs), we propose the Neural FDE, a novel deep neural network architecture that adjusts a FDE to the dynamics of data.   This work provides a comprehensive overview of the numerical method employed in Neural FDEs and the Neural FDE architecture. The numerical outcomes suggest that, despite being more computationally demanding, the Neural FDE may outperform the Neural OD
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;Wasserstein&#31354;&#38388;&#20013;&#36890;&#36807;&#31163;&#25955;&#21644;&#20998;&#27573;&#24120;&#25968;&#27979;&#24230;&#36827;&#34892;&#30340;&#32467;&#26500;&#36924;&#36817;&#26041;&#27861;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#28385;&#31209;&#30340;&#26684;&#28857;&#25353;&#27604;&#20363;&#32553;&#25918;&#21518;&#24471;&#21040;&#30340;Voronoi&#20998;&#21106;&#36924;&#36817;&#30340;&#27979;&#24230;&#35823;&#24046;&#26159;$O(h)$&#65292;&#36924;&#36817;&#30340;$N$&#39033;&#35823;&#24046;&#20026;$O(N^{-\frac1d})$&#65292;&#24182;&#19988;&#21487;&#20197;&#25512;&#24191;&#21040;&#38750;&#32039;&#25903;&#25745;&#27979;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.09149</link><description>&lt;p&gt;
&#24494;&#20998;&#27700;&#24179;&#31354;&#38388;&#20013;&#30340;&#26684;&#28857;&#36924;&#36817;
&lt;/p&gt;
&lt;p&gt;
Lattice Approximations in Wasserstein Space. (arXiv:2310.09149v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09149
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;Wasserstein&#31354;&#38388;&#20013;&#36890;&#36807;&#31163;&#25955;&#21644;&#20998;&#27573;&#24120;&#25968;&#27979;&#24230;&#36827;&#34892;&#30340;&#32467;&#26500;&#36924;&#36817;&#26041;&#27861;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#28385;&#31209;&#30340;&#26684;&#28857;&#25353;&#27604;&#20363;&#32553;&#25918;&#21518;&#24471;&#21040;&#30340;Voronoi&#20998;&#21106;&#36924;&#36817;&#30340;&#27979;&#24230;&#35823;&#24046;&#26159;$O(h)$&#65292;&#36924;&#36817;&#30340;$N$&#39033;&#35823;&#24046;&#20026;$O(N^{-\frac1d})$&#65292;&#24182;&#19988;&#21487;&#20197;&#25512;&#24191;&#21040;&#38750;&#32039;&#25903;&#25745;&#27979;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;Wasserstein&#31354;&#38388;$W_p(\mathbb{R}^d)$&#20013;&#36890;&#36807;&#31163;&#25955;&#21644;&#20998;&#27573;&#24120;&#25968;&#27979;&#24230;&#26469;&#23545;&#27979;&#24230;&#36827;&#34892;&#32467;&#26500;&#36924;&#36817;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;&#19968;&#20010;&#28385;&#31209;&#30340;&#26684;&#28857;$\Lambda$&#25353;&#29031;$h\in(0,1]$&#30340;&#27604;&#20363;&#36827;&#34892;&#32553;&#25918;&#65292;&#37027;&#20040;&#22522;&#20110;$h\Lambda$&#30340;Voronoi&#20998;&#21106;&#24471;&#21040;&#30340;&#27979;&#24230;&#36924;&#36817;&#26159;$O(h)$&#65292;&#19981;&#35770;$d$&#25110;$p$&#30340;&#21462;&#20540;&#12290;&#20043;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#35206;&#30422;&#35770;&#35777;&#35777;&#26126;&#65292;&#23545;&#20110;&#32039;&#25903;&#25745;&#30340;&#27979;&#24230;&#30340;$N$&#39033;&#36924;&#36817;&#26159;$O(N^{-\frac1d})$&#65292;&#36825;&#19982;&#26368;&#20248;&#37327;&#21270;&#22120;&#21644;&#32463;&#39564;&#27979;&#24230;&#36924;&#36817;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#24050;&#30693;&#30340;&#36895;&#29575;&#30456;&#21305;&#37197;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#25512;&#24191;&#21040;&#38750;&#32039;&#25903;&#25745;&#27979;&#24230;&#65292;&#35201;&#27714;&#20854;&#20855;&#26377;&#36275;&#22815;&#30340;&#34928;&#20943;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider structured approximation of measures in Wasserstein space $W_p(\mathbb{R}^d)$ for $p\in[1,\infty)$ by discrete and piecewise constant measures based on a scaled Voronoi partition of $\mathbb{R}^d$. We show that if a full rank lattice $\Lambda$ is scaled by a factor of $h\in(0,1]$, then approximation of a measure based on the Voronoi partition of $h\Lambda$ is $O(h)$ regardless of $d$ or $p$. We then use a covering argument to show that $N$-term approximations of compactly supported measures is $O(N^{-\frac1d})$ which matches known rates for optimal quantizers and empirical measure approximation in most instances. Finally, we extend these results to noncompactly supported measures with sufficient decay.
&lt;/p&gt;</description></item></channel></rss>