<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#36890;&#36807;&#26032;&#23450;&#20041;&#30340;&#24809;&#32602;&#25439;&#22833;&#23398;&#20064;&#21333;&#35843;&#31070;&#32463;&#32593;&#32476;&#65292;&#35299;&#20915;&#22270;&#20687;&#22788;&#29702;&#20013;&#30340;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;FBF&#31639;&#27861;&#25552;&#20379;&#25910;&#25947;&#20445;&#35777;&#65292;&#20197;&#35299;&#20915;&#38750;&#32447;&#24615;&#36870;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2404.00390</link><description>&lt;p&gt;
&#23398;&#20064;&#30495;&#27491;&#21333;&#35843;&#31639;&#23376;&#21450;&#20854;&#22312;&#38750;&#32447;&#24615;&#36870;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Learning truly monotone operators with applications to nonlinear inverse problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00390
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26032;&#23450;&#20041;&#30340;&#24809;&#32602;&#25439;&#22833;&#23398;&#20064;&#21333;&#35843;&#31070;&#32463;&#32593;&#32476;&#65292;&#35299;&#20915;&#22270;&#20687;&#22788;&#29702;&#20013;&#30340;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;FBF&#31639;&#27861;&#25552;&#20379;&#25910;&#25947;&#20445;&#35777;&#65292;&#20197;&#35299;&#20915;&#38750;&#32447;&#24615;&#36870;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#36890;&#36807;&#26032;&#23450;&#20041;&#30340;&#24809;&#32602;&#25439;&#22833;&#26469;&#23398;&#20064;&#21333;&#35843;&#31070;&#32463;&#32593;&#32476;&#30340;&#26032;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#22312;&#35299;&#20915;&#19968;&#31867;&#21464;&#20998;&#38382;&#39064;&#20013;&#29305;&#21035;&#26377;&#25928;&#65292;&#29305;&#21035;&#26159;&#22270;&#20687;&#22788;&#29702;&#20219;&#21153;&#20013;&#24120;&#36935;&#21040;&#30340;&#21333;&#35843;&#21253;&#21547;&#38382;&#39064;&#12290;&#37319;&#29992;&#21069;-&#21518;-&#21069;&#65288;FBF&#65289;&#31639;&#27861;&#26469;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#22312;&#31070;&#32463;&#32593;&#32476;&#30340;Lipschitz&#24120;&#25968;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#20063;&#33021;&#25552;&#20379;&#35299;&#20915;&#26041;&#26696;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;FBF&#31639;&#27861;&#22312;&#23398;&#20064;&#31639;&#23376;&#21333;&#35843;&#30340;&#26465;&#20214;&#19979;&#25552;&#20379;&#25910;&#25947;&#20445;&#35777;&#12290;&#20511;&#37492;&#21363;&#25554;&#21363;&#29992;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#23558;&#36825;&#20123;&#26032;&#23398;&#20064;&#30340;&#31639;&#23376;&#24212;&#29992;&#20110;&#35299;&#20915;&#38750;&#32447;&#24615;&#36870;&#38382;&#39064;&#12290;&#20026;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#39318;&#20808;&#23558;&#38382;&#39064;&#21046;&#23450;&#20026;&#19968;&#20010;&#21464;&#20998;&#21253;&#21547;&#38382;&#39064;&#65292;&#38543;&#21518;&#35757;&#32451;&#19968;&#20010;&#21333;&#35843;&#31070;&#32463;&#32593;&#32476;&#26469;&#36924;&#36817;&#19968;&#20010;&#26412;&#36136;&#19978;&#21487;&#33021;&#19981;&#26159;&#21333;&#35843;&#30340;&#31639;&#23376;&#12290;&#21033;&#29992;FBF&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00390v1 Announce Type: cross  Abstract: This article introduces a novel approach to learning monotone neural networks through a newly defined penalization loss. The proposed method is particularly effective in solving classes of variational problems, specifically monotone inclusion problems, commonly encountered in image processing tasks. The Forward-Backward-Forward (FBF) algorithm is employed to address these problems, offering a solution even when the Lipschitz constant of the neural network is unknown. Notably, the FBF algorithm provides convergence guarantees under the condition that the learned operator is monotone. Building on plug-and-play methodologies, our objective is to apply these newly learned operators to solving non-linear inverse problems. To achieve this, we initially formulate the problem as a variational inclusion problem. Subsequently, we train a monotone neural network to approximate an operator that may not inherently be monotone. Leveraging the FBF al
&lt;/p&gt;</description></item></channel></rss>