<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#28145;&#24230;ReLU&#31070;&#32463;&#32593;&#32476;&#22312;&#19981;&#35268;&#21017;&#38388;&#38548;&#25968;&#25454;&#19978;&#30340;&#25554;&#20540;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#25968;&#25454;&#28857;&#38388;&#36317;&#25351;&#25968;&#32423;&#23567;&#30340;&#24773;&#20917;&#19979;&#38656;&#35201;$\Omega(N)$&#20010;&#21442;&#25968;&#65292;&#21516;&#26102;&#25351;&#20986;&#29616;&#26377;&#30340;&#20301;&#25552;&#21462;&#25216;&#26415;&#26080;&#27861;&#24212;&#29992;&#20110;&#36825;&#31181;&#24773;&#20917;&#12290;</title><link>https://arxiv.org/abs/2302.00834</link><description>&lt;p&gt;
&#29992;&#20110;&#19981;&#35268;&#21017;&#38388;&#38548;&#25968;&#25454;&#30340;&#28145;&#24230;ReLU&#31070;&#32463;&#32593;&#32476;&#25554;&#20540;&#30340;&#23574;&#38160;&#19979;&#30028;
&lt;/p&gt;
&lt;p&gt;
Sharp Lower Bounds on Interpolation by Deep ReLU Neural Networks at Irregularly Spaced Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.00834
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#28145;&#24230;ReLU&#31070;&#32463;&#32593;&#32476;&#22312;&#19981;&#35268;&#21017;&#38388;&#38548;&#25968;&#25454;&#19978;&#30340;&#25554;&#20540;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#25968;&#25454;&#28857;&#38388;&#36317;&#25351;&#25968;&#32423;&#23567;&#30340;&#24773;&#20917;&#19979;&#38656;&#35201;$\Omega(N)$&#20010;&#21442;&#25968;&#65292;&#21516;&#26102;&#25351;&#20986;&#29616;&#26377;&#30340;&#20301;&#25552;&#21462;&#25216;&#26415;&#26080;&#27861;&#24212;&#29992;&#20110;&#36825;&#31181;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#28145;&#24230;ReLU&#31070;&#32463;&#32593;&#32476;&#30340;&#25554;&#20540;&#33021;&#21147;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#32771;&#34385;&#28145;&#24230;ReLU&#32593;&#32476;&#22914;&#20309;&#22312;&#21333;&#20301;&#29699;&#20013;&#30340;$N$&#20010;&#25968;&#25454;&#28857;&#19978;&#36827;&#34892;&#20540;&#30340;&#25554;&#20540;&#65292;&#36825;&#20123;&#28857;&#20043;&#38388;&#30456;&#36317;$\delta$&#12290;&#25105;&#20204;&#34920;&#26126;&#22312;$\delta$&#22312;$N$&#25351;&#25968;&#32423;&#23567;&#30340;&#21306;&#22495;&#20013;&#38656;&#35201;$\Omega(N)$&#20010;&#21442;&#25968;&#65292;&#36825;&#32473;&#20986;&#20102;&#35813;&#21306;&#22495;&#30340;&#23574;&#38160;&#32467;&#26524;&#65292;&#22240;&#20026;$O(N)$&#20010;&#21442;&#25968;&#24635;&#26159;&#36275;&#22815;&#30340;&#12290; &#36825;&#20063;&#34920;&#26126;&#29992;&#20110;&#35777;&#26126;VC&#32500;&#24230;&#19979;&#30028;&#30340;&#20301;&#25552;&#21462;&#25216;&#26415;&#26080;&#27861;&#24212;&#29992;&#20110;&#19981;&#35268;&#21017;&#38388;&#38548;&#30340;&#25968;&#25454;&#28857;&#12290;&#26368;&#21518;&#65292;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#28145;&#24230;ReLU&#31070;&#32463;&#32593;&#32476;&#22312;&#23884;&#20837;&#31471;&#28857;&#22788;&#20026;Sobolev&#31354;&#38388;&#23454;&#29616;&#30340;&#36817;&#20284;&#36895;&#29575;&#30340;&#19979;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.00834v2 Announce Type: replace  Abstract: We study the interpolation power of deep ReLU neural networks. Specifically, we consider the question of how efficiently, in terms of the number of parameters, deep ReLU networks can interpolate values at $N$ datapoints in the unit ball which are separated by a distance $\delta$. We show that $\Omega(N)$ parameters are required in the regime where $\delta$ is exponentially small in $N$, which gives the sharp result in this regime since $O(N)$ parameters are always sufficient. This also shows that the bit-extraction technique used to prove lower bounds on the VC dimension cannot be applied to irregularly spaced datapoints. Finally, as an application we give a lower bound on the approximation rates that deep ReLU neural networks can achieve for Sobolev spaces at the embedding endpoint.
&lt;/p&gt;</description></item></channel></rss>