<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#25552;&#20379;&#29305;&#23450;RC&#20307;&#31995;&#32467;&#26500;&#19982;&#30456;&#24212;&#24490;&#29615;&#20869;&#26680;&#24418;&#24335;&#31561;&#20215;&#24615;&#30340;&#32463;&#39564;&#20998;&#26512;&#65292;&#22635;&#34917;&#20102;Leaky RC&#12289;Sparse RC&#21644;Deep RC&#31561;&#24050;&#24314;&#31435;&#30340;RC&#33539;&#20363;&#23578;&#26410;&#36827;&#34892;&#20998;&#26512;&#30340;&#31354;&#30333;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#25581;&#31034;&#20102;&#31232;&#30095;&#36830;&#25509;&#22312;RC&#20307;&#31995;&#32467;&#26500;&#20013;&#30340;&#20316;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20381;&#36182;&#20648;&#22791;&#22823;&#23567;&#30340;&#26368;&#20339;&#31232;&#30095;&#24615;&#27700;&#24179;&#12290;&#26368;&#21518;&#65292;&#35813;&#30740;&#31350;&#30340;&#31995;&#32479;&#20998;&#26512;&#34920;&#26126;&#65292;&#22312;Deep RC&#27169;&#22411;&#20013;&#65292;&#36890;&#36807;&#20943;&#23567;&#23610;&#23544;&#30340;&#36830;&#32493;&#20648;&#22791;&#21487;&#20197;&#26356;&#22909;&#22320;&#23454;&#29616;&#25910;&#25947;&#12290;</title><link>http://arxiv.org/abs/2401.14557</link><description>&lt;p&gt;
&#19981;&#21516;&#30340;&#24490;&#29615;&#20869;&#26680;&#25299;&#23637;&#21040;&#19981;&#21516;&#30340;&#20648;&#22791;&#35745;&#31639;&#25299;&#25169;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Extension of Recurrent Kernels to different Reservoir Computing topologies. (arXiv:2401.14557v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14557
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#25552;&#20379;&#29305;&#23450;RC&#20307;&#31995;&#32467;&#26500;&#19982;&#30456;&#24212;&#24490;&#29615;&#20869;&#26680;&#24418;&#24335;&#31561;&#20215;&#24615;&#30340;&#32463;&#39564;&#20998;&#26512;&#65292;&#22635;&#34917;&#20102;Leaky RC&#12289;Sparse RC&#21644;Deep RC&#31561;&#24050;&#24314;&#31435;&#30340;RC&#33539;&#20363;&#23578;&#26410;&#36827;&#34892;&#20998;&#26512;&#30340;&#31354;&#30333;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#25581;&#31034;&#20102;&#31232;&#30095;&#36830;&#25509;&#22312;RC&#20307;&#31995;&#32467;&#26500;&#20013;&#30340;&#20316;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20381;&#36182;&#20648;&#22791;&#22823;&#23567;&#30340;&#26368;&#20339;&#31232;&#30095;&#24615;&#27700;&#24179;&#12290;&#26368;&#21518;&#65292;&#35813;&#30740;&#31350;&#30340;&#31995;&#32479;&#20998;&#26512;&#34920;&#26126;&#65292;&#22312;Deep RC&#27169;&#22411;&#20013;&#65292;&#36890;&#36807;&#20943;&#23567;&#23610;&#23544;&#30340;&#36830;&#32493;&#20648;&#22791;&#21487;&#20197;&#26356;&#22909;&#22320;&#23454;&#29616;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#30001;&#20110;&#20854;&#24555;&#36895;&#39640;&#25928;&#30340;&#35745;&#31639;&#33021;&#21147;&#65292;&#20648;&#22791;&#35745;&#31639;&#65288;RC&#65289;&#21464;&#24471;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#12290;&#26631;&#20934;&#30340;RC&#22312;&#28176;&#36817;&#26497;&#38480;&#19979;&#24050;&#34987;&#35777;&#26126;&#19982;&#24490;&#29615;&#20869;&#26680;&#31561;&#25928;&#65292;&#36825;&#26377;&#21161;&#20110;&#20998;&#26512;&#20854;&#34920;&#36798;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#24050;&#24314;&#31435;&#30340;RC&#33539;&#20363;&#65292;&#22914;Leaky RC&#12289;Sparse RC&#21644;Deep RC&#65292;&#23578;&#26410;&#20197;&#36825;&#31181;&#26041;&#24335;&#36827;&#34892;&#20998;&#26512;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#25552;&#20379;&#29305;&#23450;RC&#20307;&#31995;&#32467;&#26500;&#19982;&#30456;&#24212;&#24490;&#29615;&#20869;&#26680;&#24418;&#24335;&#31561;&#20215;&#24615;&#30340;&#32463;&#39564;&#20998;&#26512;&#26469;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#25105;&#20204;&#36890;&#36807;&#25913;&#21464;&#27599;&#20010;&#20307;&#31995;&#32467;&#26500;&#20013;&#23454;&#26045;&#30340;&#28608;&#27963;&#20989;&#25968;&#36827;&#34892;&#25910;&#25947;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#36824;&#25581;&#31034;&#20102;&#31232;&#30095;&#36830;&#25509;&#22312;RC&#20307;&#31995;&#32467;&#26500;&#20013;&#30340;&#20316;&#29992;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20381;&#36182;&#20648;&#22791;&#22823;&#23567;&#30340;&#26368;&#20339;&#31232;&#30095;&#24615;&#27700;&#24179;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#31995;&#32479;&#20998;&#26512;&#34920;&#26126;&#65292;&#22312;Deep RC&#27169;&#22411;&#20013;&#65292;&#36890;&#36807;&#20943;&#23567;&#23610;&#23544;&#30340;&#36830;&#32493;&#20648;&#22791;&#21487;&#20197;&#26356;&#22909;&#22320;&#23454;&#29616;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reservoir Computing (RC) has become popular in recent years due to its fast and efficient computational capabilities. Standard RC has been shown to be equivalent in the asymptotic limit to Recurrent Kernels, which helps in analyzing its expressive power. However, many well-established RC paradigms, such as Leaky RC, Sparse RC, and Deep RC, are yet to be analyzed in such a way. This study aims to fill this gap by providing an empirical analysis of the equivalence of specific RC architectures with their corresponding Recurrent Kernel formulation. We conduct a convergence study by varying the activation function implemented in each architecture. Our study also sheds light on the role of sparse connections in RC architectures and propose an optimal sparsity level that depends on the reservoir size. Furthermore, our systematic analysis shows that in Deep RC models, convergence is better achieved with successive reservoirs of decreasing sizes.
&lt;/p&gt;</description></item></channel></rss>