<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26497;&#20302;&#21151;&#29575;&#19979;&#25805;&#20316;&#30340;&#20809;&#23398;&#31070;&#32463;&#32593;&#32476;&#65292;&#20854;&#20013;&#19968;&#20123;&#23618;&#21482;&#20351;&#29992;&#19968;&#20010;&#20809;&#23376;&#26469;&#24341;&#21457;&#31070;&#32463;&#20803;&#28608;&#27963;&#12290;&#23613;&#31649;&#23384;&#22312;&#26497;&#39640;&#30340;&#22122;&#22768;&#65292;&#20173;&#21487;&#20197;&#35757;&#32451;&#36825;&#20123;&#32593;&#32476;&#20197;&#39640;&#31934;&#24230;&#25191;&#34892;&#30830;&#23450;&#24615;&#22270;&#20687;&#20998;&#31867;&#20219;&#21153;&#12290;</title><link>http://arxiv.org/abs/2307.15712</link><description>&lt;p&gt;
&#23569;&#37327;&#23376;&#28608;&#27963;&#19979;&#37327;&#23376;&#22122;&#22768;&#21463;&#38480;&#30340;&#20809;&#23398;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Quantum-noise-limited optical neural networks operating at a few quanta per activation. (arXiv:2307.15712v1 [physics.optics])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15712
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26497;&#20302;&#21151;&#29575;&#19979;&#25805;&#20316;&#30340;&#20809;&#23398;&#31070;&#32463;&#32593;&#32476;&#65292;&#20854;&#20013;&#19968;&#20123;&#23618;&#21482;&#20351;&#29992;&#19968;&#20010;&#20809;&#23376;&#26469;&#24341;&#21457;&#31070;&#32463;&#20803;&#28608;&#27963;&#12290;&#23613;&#31649;&#23384;&#22312;&#26497;&#39640;&#30340;&#22122;&#22768;&#65292;&#20173;&#21487;&#20197;&#35757;&#32451;&#36825;&#20123;&#32593;&#32476;&#20197;&#39640;&#31934;&#24230;&#25191;&#34892;&#30830;&#23450;&#24615;&#22270;&#20687;&#20998;&#31867;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27169;&#25311;&#29289;&#29702;&#31070;&#32463;&#32593;&#32476;&#34987;&#36890;&#24120;&#22312;&#30456;&#23545;&#39640;&#21151;&#29575;&#19979;&#25805;&#20316;&#65292;&#20197;&#20445;&#35777;&#20449;&#22122;&#27604;&#22823;&#20110;10&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26497;&#20302;&#21151;&#29575;&#19979;&#25805;&#20316;&#27169;&#25311;&#31995;&#32479;&#26102;&#20250;&#21457;&#29983;&#20160;&#20040;&#65292;&#21363;&#31995;&#32479;&#34892;&#20026;&#21464;&#24471;&#39640;&#24230;&#38543;&#26426;&#19988;&#22122;&#22768;&#19981;&#20877;&#26159;&#20449;&#21495;&#30340;&#23567;&#25200;&#21160;&#12290;&#25105;&#20204;&#22312;&#20809;&#23398;&#31070;&#32463;&#32593;&#32476;&#20013;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#20854;&#20013;&#19968;&#20123;&#23618;&#21482;&#20351;&#29992;&#19968;&#20010;&#20809;&#23376;&#26469;&#24341;&#21457;&#31070;&#32463;&#20803;&#28608;&#27963;&#12290;&#22312;&#36825;&#31181;&#26497;&#20302;&#21151;&#29575;&#19979;&#65292;&#31070;&#32463;&#20803;&#28608;&#27963;&#21463;&#21040;&#37327;&#23376;&#22122;&#22768;&#30340;&#20027;&#23548;&#65292;&#36825;&#26159;&#30001;&#20110;&#21333;&#20809;&#23376;&#26816;&#27979;&#24369;&#20809;&#20449;&#21495;&#30340;&#22522;&#26412;&#27010;&#29575;&#24615;&#36136;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23613;&#31649;&#22122;&#22768;&#26497;&#22823;&#65288;&#20449;&#22122;&#27604;&#32422;&#20026;1&#65289;&#65292;&#20173;&#28982;&#21487;&#20197;&#35757;&#32451;&#38543;&#26426;&#20809;&#23398;&#31070;&#32463;&#32593;&#32476;&#20197;&#39640;&#31934;&#24230;&#25191;&#34892;&#30830;&#23450;&#24615;&#22270;&#20687;&#20998;&#31867;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
Analog physical neural networks, which hold promise for improved energy efficiency and speed compared to digital electronic neural networks, are nevertheless typically operated in a relatively high-power regime so that the signal-to-noise ratio (SNR) is large (&gt;10). What happens if an analog system is instead operated in an ultra-low-power regime, in which the behavior of the system becomes highly stochastic and the noise is no longer a small perturbation on the signal? In this paper, we study this question in the setting of optical neural networks operated in the limit where some layers use only a single photon to cause a neuron activation. Neuron activations in this limit are dominated by quantum noise from the fundamentally probabilistic nature of single-photon detection of weak optical signals. We show that it is possible to train stochastic optical neural networks to perform deterministic image-classification tasks with high accuracy in spite of the extremely high noise (SNR ~ 1) 
&lt;/p&gt;</description></item></channel></rss>