<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#29992;&#20110;&#27785;&#28024;&#24335;&#36890;&#20449;&#20013;&#20943;&#23569;&#24102;&#23485;&#28040;&#32791;&#30340;&#23454;&#29992;&#20215;&#20540;&#12290;</title><link>https://arxiv.org/abs/2404.01713</link><description>&lt;p&gt;
&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#29992;&#20110;&#27785;&#28024;&#24335;&#36890;&#20449;&#65306;&#36890;&#36807;6G&#25506;&#32034;&#24863;&#30693;&#20114;&#32852;&#32593;&#30340;&#19979;&#19968;&#20010;&#39046;&#22495;
&lt;/p&gt;
&lt;p&gt;
Generative AI for Immersive Communication: The Next Frontier in Internet-of-Senses Through 6G
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01713
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#29992;&#20110;&#27785;&#28024;&#24335;&#36890;&#20449;&#20013;&#20943;&#23569;&#24102;&#23485;&#28040;&#32791;&#30340;&#23454;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36807;&#21435;&#30340;&#20108;&#21313;&#24180;&#20013;&#65292;&#29289;&#32852;&#32593;(IoT)&#24050;&#32463;&#26159;&#19968;&#20010;&#20855;&#26377;&#21464;&#38761;&#24615;&#30340;&#27010;&#24565;&#65292;&#24403;&#25105;&#20204;&#36924;&#36817;2030&#24180;&#26102;&#65292;&#19968;&#20010;&#26032;&#30340;&#33539;&#24335;&#34987;&#31216;&#20026;&#24863;&#30693;&#20114;&#32852;&#32593;(IoS)&#27491;&#22312;&#20852;&#36215;&#12290;&#19982;&#20256;&#32479;&#30340;&#34394;&#25311;&#29616;&#23454;&#65288;VR&#65289;&#19981;&#21516;&#65292;IoS&#26088;&#22312;&#25552;&#20379;&#22810;&#24863;&#23448;&#20307;&#39564;&#65292;&#35748;&#35782;&#21040;&#22312;&#25105;&#20204;&#30340;&#29616;&#23454;&#19990;&#30028;&#20013;&#65292;&#25105;&#20204;&#30340;&#24863;&#30693;&#36828;&#19981;&#27490;&#20110;&#35270;&#35273;&#21644;&#21548;&#35273;&#65307;&#23427;&#28085;&#30422;&#20102;&#19968;&#31995;&#21015;&#24863;&#35273;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#25512;&#21160;&#27785;&#28024;&#24335;&#22810;&#24863;&#23448;&#23186;&#20307;&#30340;&#29616;&#26377;&#25216;&#26415;&#65292;&#28145;&#20837;&#25506;&#35752;&#23427;&#20204;&#30340;&#21151;&#33021;&#21644;&#28508;&#22312;&#24212;&#29992;&#12290;&#36825;&#39033;&#25506;&#32034;&#21253;&#25324;&#20256;&#32479;&#27785;&#28024;&#24335;&#23186;&#20307;&#27969;&#19982;&#19968;&#20010;&#25552;&#20986;&#30340;&#21033;&#29992;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#22686;&#24378;&#35821;&#20041;&#20132;&#27969;&#30340;&#29992;&#20363;&#20043;&#38388;&#30340;&#27604;&#36739;&#20998;&#26512;&#12290;&#36825;&#39033;&#20998;&#26512;&#30340;&#37325;&#28857;&#26159;&#25152;&#25552;&#26041;&#26696;&#20013;&#24102;&#23485;&#28040;&#32791;&#20943;&#23569;&#20102;99.93%&#12290;&#36890;&#36807;&#36825;&#31181;&#27604;&#36739;&#65292;&#25105;&#20204;&#26088;&#22312;&#24378;&#35843;&#35813;&#23454;&#29992;&#24212;&#29992;&#30340;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01713v1 Announce Type: cross  Abstract: Over the past two decades, the Internet-of-Things (IoT) has been a transformative concept, and as we approach 2030, a new paradigm known as the Internet of Senses (IoS) is emerging. Unlike conventional Virtual Reality (VR), IoS seeks to provide multi-sensory experiences, acknowledging that in our physical reality, our perception extends far beyond just sight and sound; it encompasses a range of senses. This article explores existing technologies driving immersive multi-sensory media, delving into their capabilities and potential applications. This exploration includes a comparative analysis between conventional immersive media streaming and a proposed use case that lever- ages semantic communication empowered by generative Artificial Intelligence (AI). The focal point of this analysis is the substantial reduction in bandwidth consumption by 99.93% in the proposed scheme. Through this comparison, we aim to underscore the practical appli
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#20998;&#20301;&#25968;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#36793;&#32536;&#20113;&#35745;&#31639;&#32593;&#32476;&#20013;&#25214;&#21040;&#26368;&#20339;&#30340;&#27969;&#37327;&#20998;&#37197;&#26041;&#26696;&#12290;&#36890;&#36807;&#24341;&#20837;Gumbel-softmax&#37319;&#26679;&#32593;&#32476;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#35299;&#20915;&#20248;&#21270;&#38382;&#39064;&#24182;&#26174;&#33879;&#20248;&#20110;&#38543;&#26426;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2307.05170</link><description>&lt;p&gt;
&#36793;&#32536;&#20113;&#35745;&#31639;&#30340;&#31070;&#32463;&#20998;&#20301;&#25968;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Neural Quantile Optimization for Edge-Cloud Computing. (arXiv:2307.05170v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05170
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#20998;&#20301;&#25968;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#36793;&#32536;&#20113;&#35745;&#31639;&#32593;&#32476;&#20013;&#25214;&#21040;&#26368;&#20339;&#30340;&#27969;&#37327;&#20998;&#37197;&#26041;&#26696;&#12290;&#36890;&#36807;&#24341;&#20837;Gumbel-softmax&#37319;&#26679;&#32593;&#32476;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#35299;&#20915;&#20248;&#21270;&#38382;&#39064;&#24182;&#26174;&#33879;&#20248;&#20110;&#38543;&#26426;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23547;&#27714;&#36793;&#32536;&#20113;&#35745;&#31639;&#32593;&#32476;&#30340;&#26368;&#20339;&#27969;&#37327;&#20998;&#37197;&#26041;&#26696;&#65292;&#20197;&#28385;&#36275;&#32422;&#26463;&#26465;&#20214;&#24182;&#26368;&#23567;&#21270;&#22522;&#20110;&#31361;&#21457;&#35745;&#36153;&#30340;&#25104;&#26412;&#12290;&#39318;&#20808;&#65292;&#23545;&#20110;&#22266;&#23450;&#30340;&#32593;&#32476;&#25299;&#25169;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#26063;&#25972;&#25968;&#35268;&#21010;&#38382;&#39064;&#65292;&#20854;&#20013;&#21253;&#21547;&#25551;&#36848;&#21508;&#31181;&#27969;&#37327;&#38656;&#27714;&#30340;&#38543;&#26426;&#21442;&#25968;&#12290;&#28982;&#21518;&#65292;&#20026;&#20102;&#20811;&#26381;&#38382;&#39064;&#31163;&#25955;&#29305;&#24449;&#24102;&#26469;&#30340;&#22256;&#38590;&#65292;&#25105;&#20204;&#23558;Gumbel-softmax&#37325;&#21442;&#25968;&#21270;&#26041;&#27861;&#25512;&#24191;&#20026;&#19968;&#20010;&#26080;&#32422;&#26463;&#36830;&#32493;&#20248;&#21270;&#38382;&#39064;&#65292;&#20316;&#20026;&#31163;&#25955;&#38382;&#39064;&#30340;&#27491;&#21017;&#21270;&#24310;&#32493;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24341;&#20837;Gumbel-softmax&#37319;&#26679;&#32593;&#32476;&#65292;&#36890;&#36807;&#26080;&#30417;&#30563;&#23398;&#20064;&#26469;&#35299;&#20915;&#20248;&#21270;&#38382;&#39064;&#12290;&#32593;&#32476;&#32467;&#26500;&#21453;&#26144;&#20102;&#36793;&#32536;&#20113;&#35745;&#31639;&#30340;&#25299;&#25169;&#32467;&#26500;&#65292;&#24182;&#34987;&#35757;&#32451;&#20026;&#20351;&#24471;&#26080;&#32422;&#26463;&#36830;&#32493;&#20248;&#21270;&#38382;&#39064;&#30340;&#25104;&#26412;&#20989;&#25968;&#26399;&#26395;&#26368;&#23567;&#21270;&#12290;&#35757;&#32451;&#22909;&#30340;&#32593;&#32476;&#20316;&#20026;&#19968;&#20010;&#39640;&#25928;&#30340;&#27969;&#37327;&#20998;&#37197;&#26041;&#26696;&#37319;&#26679;&#22120;&#65292;&#22312;&#21487;&#34892;&#24615;&#26041;&#38754;&#26126;&#26174;&#20248;&#20110;&#38543;&#26426;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
We seek the best traffic allocation scheme for the edge-cloud computing network that satisfies constraints and minimizes the cost based on burstable billing. First, for a fixed network topology, we formulate a family of integer programming problems with random parameters describing the various traffic demands. Then, to overcome the difficulty caused by the discrete feature of the problem, we generalize the Gumbel-softmax reparameterization method to induce an unconstrained continuous optimization problem as a regularized continuation of the discrete problem. Finally, we introduce the Gumbel-softmax sampling network to solve the optimization problems via unsupervised learning. The network structure reflects the edge-cloud computing topology and is trained to minimize the expectation of the cost function for unconstrained continuous optimization problems. The trained network works as an efficient traffic allocation scheme sampler, remarkably outperforming the random strategy in feasibili
&lt;/p&gt;</description></item></channel></rss>