<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#22522;&#20110;&#35889;&#26041;&#27861;&#30340;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#35889;&#22495;&#20013;&#23398;&#20064;&#31639;&#23376;&#65292;&#38477;&#20302;&#20102;&#35745;&#31639;&#25104;&#26412;&#65292;&#24182;&#20445;&#35777;&#20102;&#39640;&#25554;&#20540;&#31934;&#24230;&#12290;</title><link>https://arxiv.org/abs/2312.05654</link><description>&lt;p&gt;
&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#30340;&#35889;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Spectral methods for Neural Integral Equations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.05654
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#22522;&#20110;&#35889;&#26041;&#27861;&#30340;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#35889;&#22495;&#20013;&#23398;&#20064;&#31639;&#23376;&#65292;&#38477;&#20302;&#20102;&#35745;&#31639;&#25104;&#26412;&#65292;&#24182;&#20445;&#35777;&#20102;&#39640;&#25554;&#20540;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2312.05654v3 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442;-&#36328;&#20132;&#25688;&#35201;&#65306;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#26159;&#22522;&#20110;&#31215;&#20998;&#26041;&#31243;&#29702;&#35770;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#20854;&#20013;&#27169;&#22411;&#30001;&#31215;&#20998;&#31639;&#23376;&#21644;&#36890;&#36807;&#20248;&#21270;&#36807;&#31243;&#23398;&#20064;&#30340;&#30456;&#24212;&#26041;&#31243;&#65288;&#31532;&#20108;&#31181;&#65289;&#32452;&#25104;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#20013;&#31215;&#20998;&#31639;&#23376;&#30340;&#38750;&#23616;&#37096;&#29305;&#24615;&#65292;&#20294;&#35745;&#31639;&#25104;&#26412;&#24456;&#39640;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#22522;&#20110;&#35889;&#26041;&#27861;&#30340;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#26694;&#26550;&#65292;&#35813;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#35889;&#22495;&#20013;&#23398;&#20064;&#19968;&#20010;&#31639;&#23376;&#65292;&#20174;&#32780;&#38477;&#20302;&#35745;&#31639;&#25104;&#26412;&#65292;&#21516;&#26102;&#20445;&#35777;&#39640;&#25554;&#20540;&#31934;&#24230;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#24615;&#36136;&#65292;&#24182;&#23637;&#31034;&#20102;&#20851;&#20110;&#27169;&#22411;&#36817;&#20284;&#33021;&#21147;&#21644;&#25910;&#25947;&#21040;&#25968;&#20540;&#26041;&#27861;&#35299;&#30340;&#21508;&#31181;&#29702;&#35770;&#20445;&#35777;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#25968;&#20540;&#23454;&#39564;&#26469;&#23637;&#31034;&#25152;&#24471;&#27169;&#22411;&#30340;&#23454;&#38469;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.05654v3 Announce Type: replace-cross  Abstract: Neural integral equations are deep learning models based on the theory of integral equations, where the model consists of an integral operator and the corresponding equation (of the second kind) which is learned through an optimization procedure. This approach allows to leverage the nonlocal properties of integral operators in machine learning, but it is computationally expensive. In this article, we introduce a framework for neural integral equations based on spectral methods that allows us to learn an operator in the spectral domain, resulting in a cheaper computational cost, as well as in high interpolation accuracy. We study the properties of our methods and show various theoretical guarantees regarding the approximation capabilities of the model, and convergence to solutions of the numerical methods. We provide numerical experiments to demonstrate the practical effectiveness of the resulting model.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32467;&#21512;&#20102;&#26080;&#20559;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#65292;&#36890;&#36807;&#24320;&#21457;&#21322;&#31934;&#30830;&#30340;&#23545;&#25968;&#27431;&#25289;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#29575;&#20026;O(h)&#65292;&#36866;&#29992;&#20110;&#22810;&#31181;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2301.12072</link><description>&lt;p&gt;
&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#30340;&#26080;&#20559;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Unbiased estimators for the Heston model with stochastic interest rates. (arXiv:2301.12072v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.12072
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32467;&#21512;&#20102;&#26080;&#20559;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#65292;&#36890;&#36807;&#24320;&#21457;&#21322;&#31934;&#30830;&#30340;&#23545;&#25968;&#27431;&#25289;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#29575;&#20026;O(h)&#65292;&#36866;&#29992;&#20110;&#22810;&#31181;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32467;&#21512;&#20102;Rhee&#21644;Glynn&#65288;Operations Research: 63(5), 1026-1043&#65292;2015&#65289;&#20013;&#30340;&#26080;&#20559;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#39318;&#20808;&#20026;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#24320;&#21457;&#20102;&#19968;&#20010;&#21322;&#31934;&#30830;&#30340;&#23545;&#25968;&#27431;&#25289;&#26041;&#26696;&#12290;&#28982;&#21518;&#65292;&#22312;&#19968;&#20123;&#28201;&#21644;&#30340;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#25910;&#25947;&#29575;&#22312;L^2&#33539;&#25968;&#20013;&#26159;O(h)&#65292;&#20854;&#20013;h&#26159;&#27493;&#38271;&#12290;&#35813;&#32467;&#26524;&#36866;&#29992;&#20110;&#35768;&#22810;&#27169;&#22411;&#65292;&#22914;Heston-Hull-While&#27169;&#22411;&#65292;Heston-CIR&#27169;&#22411;&#21644;Heston-Black-Karasinski&#27169;&#22411;&#12290;&#25968;&#20540;&#23454;&#39564;&#25903;&#25345;&#25105;&#20204;&#30340;&#29702;&#35770;&#25910;&#25947;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We combine the unbiased estimators in Rhee and Glynn (Operations Research: 63(5), 1026-1043, 2015) and the Heston model with stochastic interest rates. Specifically, we first develop a semi-exact log-Euler scheme for the Heston model with stochastic interest rates. Then, under mild assumptions, we show that the convergence rate in the $L^2$ norm is $O(h)$, where $h$ is the step size. The result applies to a large class of models, such as the Heston-Hull-While model, the Heston-CIR model and the Heston-Black-Karasinski model. Numerical experiments support our theoretical convergence rate.
&lt;/p&gt;</description></item></channel></rss>