<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;T-CUR&#20998;&#35299;&#30340;&#21487;&#20998;&#31163;&#38750;&#36127;&#24352;&#37327;&#20998;&#35299;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#22810;&#32500;&#25968;&#25454;&#20013;&#25552;&#21462;&#26377;&#24847;&#20041;&#30340;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2401.16836</link><description>&lt;p&gt;
&#22522;&#20110;T-CUR&#20998;&#35299;&#30340;&#21487;&#20998;&#31163;&#38750;&#36127;&#24352;&#37327;&#20998;&#35299;
&lt;/p&gt;
&lt;p&gt;
Coseparable Nonnegative Tensor Factorization With T-CUR Decomposition. (arXiv:2401.16836v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16836
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;T-CUR&#20998;&#35299;&#30340;&#21487;&#20998;&#31163;&#38750;&#36127;&#24352;&#37327;&#20998;&#35299;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#22810;&#32500;&#25968;&#25454;&#20013;&#25552;&#21462;&#26377;&#24847;&#20041;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;(NMF)&#26159;&#19968;&#31181;&#37325;&#35201;&#30340;&#26080;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#25968;&#25454;&#20013;&#25552;&#21462;&#26377;&#24847;&#20041;&#30340;&#29305;&#24449;&#12290;&#20026;&#20102;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#26694;&#26550;&#20869;&#35299;&#20915;NMF&#38382;&#39064;&#65292;&#30740;&#31350;&#20154;&#21592;&#24341;&#20837;&#20102;&#21487;&#20998;&#31163;&#24615;&#20551;&#35774;&#65292;&#26368;&#36817;&#28436;&#21464;&#20026;&#21487;&#20998;&#31163;&#30340;&#27010;&#24565;&#12290;&#36825;&#19968;&#36827;&#23637;&#20026;&#21407;&#22987;&#25968;&#25454;&#25552;&#20379;&#20102;&#26356;&#39640;&#25928;&#30340;&#26680;&#24515;&#34920;&#31034;&#12290;&#28982;&#32780;&#65292;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#65292;&#25968;&#25454;&#26356;&#33258;&#28982;&#22320;&#34987;&#34920;&#31034;&#20026;&#22810;&#32500;&#25968;&#32452;&#65292;&#22914;&#22270;&#20687;&#25110;&#35270;&#39057;&#12290;&#23558;NMF&#24212;&#29992;&#20110;&#39640;&#32500;&#25968;&#25454;&#28041;&#21450;&#21521;&#37327;&#21270;&#65292;&#20250;&#23548;&#33268;&#20002;&#22833;&#20851;&#38190;&#30340;&#22810;&#32500;&#24230;&#30456;&#20851;&#24615;&#12290;&#20026;&#20102;&#20445;&#30041;&#25968;&#25454;&#20013;&#36825;&#20123;&#22266;&#26377;&#30340;&#30456;&#20851;&#24615;&#65292;&#25105;&#20204;&#36716;&#21521;&#24352;&#37327;(&#22810;&#32500;&#25968;&#32452;)&#24182;&#21033;&#29992;&#24352;&#37327;t&#20056;&#31215;&#12290;&#36825;&#31181;&#26041;&#27861;&#23558;&#21487;&#20998;&#31163;&#30340;NMF&#25193;&#23637;&#21040;&#24352;&#37327;&#35774;&#32622;&#65292;&#20174;&#32780;&#21019;&#24314;&#20102;&#25105;&#20204;&#25152;&#31216;&#30340;&#21487;&#20998;&#31163;&#38750;&#36127;&#24352;&#37327;&#20998;&#35299;(NTF)&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#20132;&#26367;&#32034;&#24341;&#36873;&#25321;&#26041;&#27861;&#26469;&#36873;&#25321;cos
&lt;/p&gt;
&lt;p&gt;
Nonnegative Matrix Factorization (NMF) is an important unsupervised learning method to extract meaningful features from data. To address the NMF problem within a polynomial time framework, researchers have introduced a separability assumption, which has recently evolved into the concept of coseparability. This advancement offers a more efficient core representation for the original data. However, in the real world, the data is more natural to be represented as a multi-dimensional array, such as images or videos. The NMF's application to high-dimensional data involves vectorization, which risks losing essential multi-dimensional correlations. To retain these inherent correlations in the data, we turn to tensors (multidimensional arrays) and leverage the tensor t-product. This approach extends the coseparable NMF to the tensor setting, creating what we term coseparable Nonnegative Tensor Factorization (NTF). In this work, we provide an alternating index selection method to select the cos
&lt;/p&gt;</description></item></channel></rss>