<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#20998;&#26512;&#29305;&#24449;&#23481;&#37327;&#26469;&#29702;&#35299;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#22810;&#20041;&#24615;&#29616;&#35937;&#65292;&#21457;&#29616;&#22312;&#26368;&#20248;&#30340;&#23481;&#37327;&#20998;&#37197;&#19979;&#65292;&#31070;&#32463;&#32593;&#32476;&#20542;&#21521;&#20110;&#21333;&#20041;&#22320;&#34920;&#31034;&#37325;&#35201;&#29305;&#24449;&#65292;&#22810;&#20041;&#22320;&#34920;&#31034;&#27425;&#37325;&#35201;&#29305;&#24449;&#65292;&#24182;&#24573;&#30053;&#26368;&#19981;&#37325;&#35201;&#30340;&#29305;&#24449;&#12290;&#22810;&#20041;&#24615;&#29616;&#35937;&#22312;&#36755;&#20837;&#20855;&#26377;&#26356;&#39640;&#30340;&#23792;&#24230;&#25110;&#31232;&#30095;&#24615;&#26102;&#26356;&#20026;&#26222;&#36941;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#20307;&#31995;&#32467;&#26500;&#20013;&#27604;&#20854;&#20182;&#20307;&#31995;&#32467;&#26500;&#26356;&#20026;&#26222;&#36941;&#12290;&#27492;&#22806;&#65292;&#20316;&#32773;&#36824;&#21457;&#29616;&#20102;&#23884;&#20837;&#31354;&#38388;&#20013;&#30340;&#20998;&#22359;&#21322;&#27491;&#20132;&#32467;&#26500;&#65292;&#19981;&#21516;&#27169;&#22411;&#20013;&#30340;&#20998;&#22359;&#22823;&#23567;&#19981;&#21516;&#65292;&#31361;&#20986;&#20102;&#27169;&#22411;&#20307;&#31995;&#32467;&#26500;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2210.01892</link><description>&lt;p&gt;
&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#22810;&#20041;&#24615;&#21644;&#23481;&#37327;
&lt;/p&gt;
&lt;p&gt;
Polysemanticity and Capacity in Neural Networks. (arXiv:2210.01892v3 [cs.NE] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01892
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#20998;&#26512;&#29305;&#24449;&#23481;&#37327;&#26469;&#29702;&#35299;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#22810;&#20041;&#24615;&#29616;&#35937;&#65292;&#21457;&#29616;&#22312;&#26368;&#20248;&#30340;&#23481;&#37327;&#20998;&#37197;&#19979;&#65292;&#31070;&#32463;&#32593;&#32476;&#20542;&#21521;&#20110;&#21333;&#20041;&#22320;&#34920;&#31034;&#37325;&#35201;&#29305;&#24449;&#65292;&#22810;&#20041;&#22320;&#34920;&#31034;&#27425;&#37325;&#35201;&#29305;&#24449;&#65292;&#24182;&#24573;&#30053;&#26368;&#19981;&#37325;&#35201;&#30340;&#29305;&#24449;&#12290;&#22810;&#20041;&#24615;&#29616;&#35937;&#22312;&#36755;&#20837;&#20855;&#26377;&#26356;&#39640;&#30340;&#23792;&#24230;&#25110;&#31232;&#30095;&#24615;&#26102;&#26356;&#20026;&#26222;&#36941;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#20307;&#31995;&#32467;&#26500;&#20013;&#27604;&#20854;&#20182;&#20307;&#31995;&#32467;&#26500;&#26356;&#20026;&#26222;&#36941;&#12290;&#27492;&#22806;&#65292;&#20316;&#32773;&#36824;&#21457;&#29616;&#20102;&#23884;&#20837;&#31354;&#38388;&#20013;&#30340;&#20998;&#22359;&#21322;&#27491;&#20132;&#32467;&#26500;&#65292;&#19981;&#21516;&#27169;&#22411;&#20013;&#30340;&#20998;&#22359;&#22823;&#23567;&#19981;&#21516;&#65292;&#31361;&#20986;&#20102;&#27169;&#22411;&#20307;&#31995;&#32467;&#26500;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#21333;&#20010;&#31070;&#32463;&#20803;&#36890;&#24120;&#20195;&#34920;&#26080;&#20851;&#29305;&#24449;&#30340;&#28151;&#21512;&#12290;&#36825;&#31181;&#29616;&#35937;&#31216;&#20026;&#22810;&#20041;&#24615;&#65292;&#20351;&#35299;&#37322;&#31070;&#32463;&#32593;&#32476;&#21464;&#24471;&#26356;&#21152;&#22256;&#38590;&#65292;&#22240;&#27492;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#29702;&#35299;&#20854;&#21407;&#22240;&#12290;&#25105;&#20204;&#25552;&#20986;&#36890;&#36807;&#29305;&#24449;&#23481;&#37327;&#30340;&#35270;&#35282;&#26469;&#29702;&#35299;&#36825;&#19968;&#29616;&#35937;&#65292;&#29305;&#24449;&#23481;&#37327;&#26159;&#27599;&#20010;&#29305;&#24449;&#22312;&#23884;&#20837;&#31354;&#38388;&#20013;&#21344;&#29992;&#30340;&#20998;&#24418;&#32500;&#24230;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#19968;&#20010;&#29609;&#20855;&#27169;&#22411;&#20013;&#65292;&#26368;&#20248;&#30340;&#23481;&#37327;&#20998;&#37197;&#20542;&#21521;&#20110;&#21333;&#20041;&#22320;&#34920;&#31034;&#26368;&#37325;&#35201;&#30340;&#29305;&#24449;&#65292;&#22810;&#20041;&#22320;&#34920;&#31034;&#27425;&#37325;&#35201;&#29305;&#24449;&#65288;&#19982;&#20854;&#23545;&#25439;&#22833;&#30340;&#24433;&#21709;&#25104;&#27604;&#20363;&#65289;&#65292;&#24182;&#23436;&#20840;&#24573;&#30053;&#26368;&#19981;&#37325;&#35201;&#30340;&#29305;&#24449;&#12290;&#24403;&#36755;&#20837;&#20855;&#26377;&#26356;&#39640;&#30340;&#23792;&#24230;&#25110;&#31232;&#30095;&#24615;&#26102;&#65292;&#22810;&#20041;&#24615;&#26356;&#20026;&#26222;&#36941;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#20307;&#31995;&#32467;&#26500;&#20013;&#27604;&#20854;&#20182;&#20307;&#31995;&#32467;&#26500;&#26356;&#20026;&#26222;&#36941;&#12290;&#22312;&#24471;&#21040;&#26368;&#20248;&#23481;&#37327;&#20998;&#37197;&#21518;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;&#23884;&#20837;&#31354;&#38388;&#30340;&#20960;&#20309;&#32467;&#26500;&#12290;&#25105;&#20204;&#21457;&#29616;&#20102;&#19968;&#20010;&#20998;&#22359;&#21322;&#27491;&#20132;&#30340;&#32467;&#26500;&#65292;&#19981;&#21516;&#27169;&#22411;&#20013;&#30340;&#20998;&#22359;&#22823;&#23567;&#19981;&#21516;&#65292;&#31361;&#20986;&#20102;&#27169;&#22411;&#20307;&#31995;&#32467;&#26500;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Individual neurons in neural networks often represent a mixture of unrelated features. This phenomenon, called polysemanticity, can make interpreting neural networks more difficult and so we aim to understand its causes. We propose doing so through the lens of feature \emph{capacity}, which is the fractional dimension each feature consumes in the embedding space. We show that in a toy model the optimal capacity allocation tends to monosemantically represent the most important features, polysemantically represent less important features (in proportion to their impact on the loss), and entirely ignore the least important features. Polysemanticity is more prevalent when the inputs have higher kurtosis or sparsity and more prevalent in some architectures than others. Given an optimal allocation of capacity, we go on to study the geometry of the embedding space. We find a block-semi-orthogonal structure, with differing block sizes in different models, highlighting the impact of model archit
&lt;/p&gt;</description></item></channel></rss>