<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;O-RAN&#20013;&#32593;&#32476;&#20999;&#29255;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#35774;&#35745;&#20004;&#20010;xAPPs&#65292;&#20998;&#21035;&#22788;&#29702;&#21151;&#29575;&#25511;&#21046;&#21644;&#29289;&#29702;&#36164;&#28304;&#22359;&#20998;&#37197;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#22312;&#29992;&#25143;&#35774;&#22791;&#20043;&#38388;&#23454;&#29616;&#26368;&#22823;&#21270;&#30340;&#21152;&#26435;&#21534;&#21520;&#37327;&#65292;&#24182;&#20248;&#20808;&#32771;&#34385;&#22686;&#24378;&#22411;&#31227;&#21160;&#23485;&#24102;&#21644;&#36229;&#21487;&#38752;&#20302;&#24310;&#36831;&#36890;&#20449;&#36825;&#20004;&#31181;&#26381;&#21153;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2401.08861</link><description>&lt;p&gt;
O-RAN&#20013;&#21033;&#29992;&#21322;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#36827;&#34892;&#32593;&#32476;&#20999;&#29255;&#30340;&#36164;&#28304;&#20998;&#37197;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Semi-Supervised Learning Approach for Efficient Resource Allocation with Network Slicing in O-RAN. (arXiv:2401.08861v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08861
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;O-RAN&#20013;&#32593;&#32476;&#20999;&#29255;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#35774;&#35745;&#20004;&#20010;xAPPs&#65292;&#20998;&#21035;&#22788;&#29702;&#21151;&#29575;&#25511;&#21046;&#21644;&#29289;&#29702;&#36164;&#28304;&#22359;&#20998;&#37197;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#22312;&#29992;&#25143;&#35774;&#22791;&#20043;&#38388;&#23454;&#29616;&#26368;&#22823;&#21270;&#30340;&#21152;&#26435;&#21534;&#21520;&#37327;&#65292;&#24182;&#20248;&#20808;&#32771;&#34385;&#22686;&#24378;&#22411;&#31227;&#21160;&#23485;&#24102;&#21644;&#36229;&#21487;&#38752;&#20302;&#24310;&#36831;&#36890;&#20449;&#36825;&#20004;&#31181;&#26381;&#21153;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24320;&#25918;&#24335;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#25216;&#26415;&#20316;&#20026;&#19968;&#31181;&#26377;&#21069;&#26223;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20026;&#32593;&#32476;&#36816;&#33829;&#21830;&#25552;&#20379;&#20102;&#19968;&#20010;&#24320;&#25918;&#21644;&#26377;&#21033;&#30340;&#29615;&#22659;&#12290;&#22312;O-RAN&#20869;&#30830;&#20445;&#26377;&#25928;&#22320;&#21327;&#35843;x&#24212;&#29992;&#31243;&#24207;&#65288;xAPPs&#65289;&#23545;&#20110;&#32593;&#32476;&#20999;&#29255;&#21644;&#36164;&#28304;&#20998;&#37197;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#36164;&#28304;&#20998;&#37197;&#26041;&#27861;&#65292;&#26088;&#22312;&#21327;&#35843;O-RAN&#20013;&#22810;&#20010;&#29420;&#31435;xAPPs&#30340;&#21327;&#35843;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20391;&#37325;&#20110;&#22312;&#29992;&#25143;&#35774;&#22791;&#65288;UE&#65289;&#20043;&#38388;&#26368;&#22823;&#21270;&#21152;&#26435;&#21534;&#21520;&#37327;&#65292;&#24182;&#20998;&#37197;&#29289;&#29702;&#36164;&#28304;&#22359;&#65288;PRBs&#65289;&#12290;&#25105;&#20204;&#20248;&#20808;&#32771;&#34385;&#22686;&#24378;&#22411;&#31227;&#21160;&#23485;&#24102;&#21644;&#36229;&#21487;&#38752;&#20302;&#24310;&#36831;&#36890;&#20449;&#36825;&#20004;&#31181;&#26381;&#21153;&#31867;&#22411;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#20004;&#20010;xAPPs&#65306;&#27599;&#20010;UE&#30340;&#21151;&#29575;&#25511;&#21046;xAPP&#21644;PRB&#20998;&#37197;xAPP&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21253;&#25324;&#20004;&#20010;&#37096;&#20998;&#30340;&#35757;&#32451;&#38454;&#27573;&#65292;&#20854;&#20013;&#31532;&#19968;&#37096;&#20998;&#20351;&#29992;&#24102;&#26377;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#30340;&#30417;&#30563;&#23398;&#20064;&#36827;&#34892;&#35757;&#32451;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Open Radio Access Network (O-RAN) technology has emerged as a promising solution for network operators, providing them with an open and favorable environment. Ensuring effective coordination of x-applications (xAPPs) is crucial to enhance flexibility and optimize network performance within the O-RAN. In this paper, we introduce an innovative approach to the resource allocation problem, aiming to coordinate multiple independent xAPPs for network slicing and resource allocation in O-RAN. Our proposed method focuses on maximizing the weighted throughput among user equipments (UE), as well as allocating physical resource blocks (PRBs). We prioritize two service types, namely enhanced Mobile Broadband and Ultra Reliable Low Latency Communication. To achieve this, we have designed two xAPPs: a power control xAPP for each UE and a PRB allocation xAPP. The proposed method consists of a two-part training phase, where the first part uses supervised learning with a Variational Autoencoder tra
&lt;/p&gt;</description></item></channel></rss>