<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#26469;&#30740;&#31350;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#24182;&#25193;&#23637;&#20102;&#31454;&#20105;&#20648;&#23384;&#27169;&#22411;&#20197;&#36866;&#24212;&#38543;&#26426;&#28436;&#21270;&#30340;&#21033;&#29575;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23454;&#38469;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#20855;&#26377;&#37325;&#35201;&#32780;&#25345;&#32493;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.07577</link><description>&lt;p&gt;
&#21033;&#29575;&#21160;&#24577;&#21644;&#21830;&#21697;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Interest Rate Dynamics and Commodity Prices. (arXiv:2308.07577v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07577
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#26469;&#30740;&#31350;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#24182;&#25193;&#23637;&#20102;&#31454;&#20105;&#20648;&#23384;&#27169;&#22411;&#20197;&#36866;&#24212;&#38543;&#26426;&#28436;&#21270;&#30340;&#21033;&#29575;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23454;&#38469;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#20855;&#26377;&#37325;&#35201;&#32780;&#25345;&#32493;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36135;&#24065;&#26465;&#20214;&#32463;&#24120;&#34987;&#35748;&#20026;&#26159;&#24433;&#21709;&#21830;&#21697;&#20215;&#26684;&#27874;&#21160;&#30340;&#37325;&#35201;&#22240;&#32032;&#12290;&#28982;&#32780;&#65292;&#20256;&#36755;&#26426;&#21046;&#30340;&#20855;&#20307;&#28192;&#36947;&#36824;&#27809;&#26377;&#34987;&#26126;&#30830;&#23450;&#20041;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#26469;&#30740;&#31350;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#21450;&#20854;&#22522;&#26412;&#26426;&#21046;&#30340;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25193;&#23637;&#20102;&#31454;&#20105;&#20648;&#23384;&#27169;&#22411;&#20197;&#36866;&#24212;&#38543;&#26426;&#28436;&#21270;&#30340;&#21033;&#29575;&#65292;&#24182;&#30830;&#23450;&#20102;&#26222;&#36941;&#26465;&#20214;&#65292;&#21363;(i)&#23384;&#22312;&#21807;&#19968;&#30340;&#29702;&#24615;&#39044;&#26399;&#22343;&#34913;&#24182;&#33021;&#26377;&#25928;&#35745;&#31639;&#65292;&#20197;&#21450;(ii)&#21033;&#29575;&#19982;&#21830;&#21697;&#20215;&#26684;&#21576;&#36127;&#30456;&#20851;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#36890;&#36807;&#25237;&#26426;&#28192;&#36947;&#37327;&#21270;&#20102;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21363;&#29289;&#29702;&#24066;&#22330;&#19978;&#25345;&#26377;&#24211;&#23384;&#30340;&#25237;&#26426;&#32773;&#30340;&#28608;&#21169;&#21463;&#21033;&#29575;&#21464;&#21160;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#23454;&#38469;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#20855;&#26377;&#37325;&#35201;&#32780;&#25345;&#32493;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#19988;&#35813;&#24433;&#21709;&#24182;&#19981;&#24179;&#20961;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monetary conditions are frequently cited as a significant factor influencing fluctuations in commodity prices. However, the precise channels of transmission are less well identified. In this paper, we develop a unified theory to study the impact of interest rates on commodity prices and the underlying mechanisms. To that end, we extend the competitive storage model to accommodate stochastically evolving interest rates, and establish general conditions under which (i) a unique rational expectations equilibrium exists and can be efficiently computed, and (ii) interest rates are negatively correlated with commodity prices. As an application, we quantify the impact of interest rates on commodity prices through the speculative channel, namely, the role of speculators in the physical market whose incentive to hold inventories is influenced by interest rate movements. Our findings demonstrate that real interest rates have nontrivial and persistent negative effect on commodity prices, and the 
&lt;/p&gt;</description></item></channel></rss>