<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#22686;&#24378;&#30340;&#28151;&#21512;&#27169;&#25311;&#20013;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20999;&#32447;&#31354;&#38388;&#27491;&#21017;&#21270;&#20272;&#35745;&#22120;&#30340;&#26041;&#27861;&#26469;&#25511;&#21046;&#20998;&#24067;&#20559;&#31227;&#65292;&#20174;&#32780;&#25552;&#39640;&#27169;&#25311;&#32467;&#26524;&#30340;&#31934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.09259</link><description>&lt;p&gt;
&#32531;&#35299;&#26426;&#22120;&#23398;&#20064;&#22686;&#24378;&#30340;&#28151;&#21512;&#27169;&#25311;&#20013;&#30340;&#20998;&#24067;&#20559;&#31227;
&lt;/p&gt;
&lt;p&gt;
Mitigating distribution shift in machine learning-augmented hybrid simulation. (arXiv:2401.09259v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09259
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#22686;&#24378;&#30340;&#28151;&#21512;&#27169;&#25311;&#20013;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20999;&#32447;&#31354;&#38388;&#27491;&#21017;&#21270;&#20272;&#35745;&#22120;&#30340;&#26041;&#27861;&#26469;&#25511;&#21046;&#20998;&#24067;&#20559;&#31227;&#65292;&#20174;&#32780;&#25552;&#39640;&#27169;&#25311;&#32467;&#26524;&#30340;&#31934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#22686;&#24378;&#30340;&#28151;&#21512;&#27169;&#25311;&#20013;&#26222;&#36941;&#23384;&#22312;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#65292;&#20854;&#20013;&#27169;&#25311;&#31639;&#27861;&#30340;&#37096;&#20998;&#34987;&#25968;&#25454;&#39537;&#21160;&#30340;&#26367;&#20195;&#27169;&#22411;&#21462;&#20195;&#12290;&#25105;&#20204;&#39318;&#20808;&#24314;&#31435;&#20102;&#19968;&#20010;&#25968;&#23398;&#26694;&#26550;&#26469;&#29702;&#35299;&#26426;&#22120;&#23398;&#20064;&#22686;&#24378;&#30340;&#28151;&#21512;&#27169;&#25311;&#38382;&#39064;&#30340;&#32467;&#26500;&#65292;&#20197;&#21450;&#30456;&#20851;&#30340;&#20998;&#24067;&#20559;&#31227;&#30340;&#21407;&#22240;&#21644;&#24433;&#21709;&#12290;&#25105;&#20204;&#22312;&#25968;&#20540;&#21644;&#29702;&#35770;&#19978;&#23637;&#31034;&#20102;&#20998;&#24067;&#20559;&#31227;&#19982;&#27169;&#25311;&#35823;&#24046;&#30340;&#30456;&#20851;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20999;&#32447;&#31354;&#38388;&#27491;&#21017;&#21270;&#20272;&#35745;&#22120;&#30340;&#31616;&#21333;&#26041;&#27861;&#26469;&#25511;&#21046;&#20998;&#24067;&#20559;&#31227;&#65292;&#20174;&#32780;&#25552;&#39640;&#27169;&#25311;&#32467;&#26524;&#30340;&#38271;&#26399;&#31934;&#30830;&#24615;&#12290;&#22312;&#32447;&#24615;&#21160;&#21147;&#23398;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#35814;&#23613;&#30340;&#29702;&#35770;&#20998;&#26512;&#26469;&#37327;&#21270;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#20960;&#20010;&#25968;&#20540;&#23454;&#39564;&#65292;&#21253;&#25324;&#27169;&#25311;&#37096;&#20998;&#24050;&#30693;&#30340;&#21453;&#24212;&#25193;&#25955;&#26041;&#31243;&#20197;&#21450;&#20351;&#29992;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#25237;&#24433;&#26041;&#27861;&#27714;&#35299;Navier-Stokes&#26041;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of distribution shift generally arising in machine-learning augmented hybrid simulation, where parts of simulation algorithms are replaced by data-driven surrogates. We first establish a mathematical framework to understand the structure of machine-learning augmented hybrid simulation problems, and the cause and effect of the associated distribution shift. We show correlations between distribution shift and simulation error both numerically and theoretically. Then, we propose a simple methodology based on tangent-space regularized estimator to control the distribution shift, thereby improving the long-term accuracy of the simulation results. In the linear dynamics case, we provide a thorough theoretical analysis to quantify the effectiveness of the proposed method. Moreover, we conduct several numerical experiments, including simulating a partially known reaction-diffusion equation and solving Navier-Stokes equations using the projection method with a data-driven p
&lt;/p&gt;</description></item></channel></rss>