<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#26080;&#22122;&#22768;&#35266;&#27979;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25955;&#20081;&#25968;&#25454;&#36924;&#36817;&#30340;&#26032;&#31639;&#27861;&#65292;&#24182;&#24341;&#20837;&#38543;&#26426;&#25506;&#32034;&#27493;&#39588;&#20197;&#23454;&#29616;&#25509;&#36817;&#26368;&#20248;&#22635;&#20805;&#36317;&#31163;&#30340;&#36895;&#29575;&#34928;&#20943;&#12290;&#35813;&#31639;&#27861;&#22312;&#23454;&#29616;&#30340;&#26131;&#29992;&#24615;&#21644;&#32047;&#31215;&#36951;&#25022;&#36793;&#30028;&#30340;&#24615;&#33021;&#19978;&#36229;&#36807;&#20102;&#20256;&#32479;&#30340;GP-UCB&#31639;&#27861;&#65292;&#24182;&#22312;&#22810;&#20010;&#31034;&#20363;&#20013;&#20248;&#20110;&#20854;&#20182;&#36125;&#21494;&#26031;&#20248;&#21270;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2401.17037</link><description>&lt;p&gt;
&#22522;&#20110;&#26080;&#22122;&#22768;&#35266;&#27979;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#65306;&#36890;&#36807;&#38543;&#26426;&#25506;&#32034;&#25913;&#21892;&#36951;&#25022;&#36793;&#30028;
&lt;/p&gt;
&lt;p&gt;
Bayesian Optimization with Noise-Free Observations: Improved Regret Bounds via Random Exploration. (arXiv:2401.17037v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.17037
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#26080;&#22122;&#22768;&#35266;&#27979;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25955;&#20081;&#25968;&#25454;&#36924;&#36817;&#30340;&#26032;&#31639;&#27861;&#65292;&#24182;&#24341;&#20837;&#38543;&#26426;&#25506;&#32034;&#27493;&#39588;&#20197;&#23454;&#29616;&#25509;&#36817;&#26368;&#20248;&#22635;&#20805;&#36317;&#31163;&#30340;&#36895;&#29575;&#34928;&#20943;&#12290;&#35813;&#31639;&#27861;&#22312;&#23454;&#29616;&#30340;&#26131;&#29992;&#24615;&#21644;&#32047;&#31215;&#36951;&#25022;&#36793;&#30028;&#30340;&#24615;&#33021;&#19978;&#36229;&#36807;&#20102;&#20256;&#32479;&#30340;GP-UCB&#31639;&#27861;&#65292;&#24182;&#22312;&#22810;&#20010;&#31034;&#20363;&#20013;&#20248;&#20110;&#20854;&#20182;&#36125;&#21494;&#26031;&#20248;&#21270;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#26080;&#22122;&#22768;&#35266;&#27979;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#26032;&#30340;&#22522;&#20110;&#25955;&#20081;&#25968;&#25454;&#36924;&#36817;&#30340;&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#38543;&#26426;&#25506;&#32034;&#27493;&#39588;&#30830;&#20445;&#26597;&#35810;&#28857;&#30340;&#22635;&#20805;&#36317;&#31163;&#20197;&#25509;&#36817;&#26368;&#20248;&#30340;&#36895;&#29575;&#34928;&#20943;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#20445;&#30041;&#20102;&#32463;&#20856;&#30340;GP-UCB&#31639;&#27861;&#30340;&#26131;&#23454;&#29616;&#24615;&#65292;&#24182;&#28385;&#36275;&#20102;&#20960;&#20046;&#19982;arXiv:2002.05096&#20013;&#30340;&#29468;&#24819;&#30456;&#21305;&#37197;&#30340;&#32047;&#31215;&#36951;&#25022;&#36793;&#30028;&#65292;&#20174;&#32780;&#35299;&#20915;&#20102;COLT&#30340;&#19968;&#20010;&#24320;&#25918;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#26032;&#31639;&#27861;&#22312;&#20960;&#20010;&#31034;&#20363;&#20013;&#20248;&#20110;GP-UCB&#21644;&#20854;&#20182;&#27969;&#34892;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies Bayesian optimization with noise-free observations. We introduce new algorithms rooted in scattered data approximation that rely on a random exploration step to ensure that the fill-distance of query points decays at a near-optimal rate. Our algorithms retain the ease of implementation of the classical GP-UCB algorithm and satisfy cumulative regret bounds that nearly match those conjectured in arXiv:2002.05096, hence solving a COLT open problem. Furthermore, the new algorithms outperform GP-UCB and other popular Bayesian optimization strategies in several examples.
&lt;/p&gt;</description></item></channel></rss>