<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#35752;&#35770;&#20102;&#20855;&#26377;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#30340;&#20648;&#23618;&#31995;&#32479;&#30340;&#36924;&#36817;&#33021;&#21147;&#21644;&#32479;&#19968;&#24378;&#26222;&#36866;&#24615;&#65292;&#21487;&#20197;&#36890;&#36807;&#24182;&#34892;&#20018;&#32852;RNN&#20648;&#23618;&#26500;&#24314;&#36825;&#31181;&#31867;&#22411;&#30340;&#31995;&#32479;</title><link>https://arxiv.org/abs/2403.01900</link><description>&lt;p&gt;
&#20855;&#26377;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#30340;&#20648;&#23618;&#31995;&#32479;&#30340;&#26222;&#36866;&#24615;
&lt;/p&gt;
&lt;p&gt;
Universality of reservoir systems with recurrent neural networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01900
&lt;/p&gt;
&lt;p&gt;
&#35752;&#35770;&#20102;&#20855;&#26377;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#30340;&#20648;&#23618;&#31995;&#32479;&#30340;&#36924;&#36817;&#33021;&#21147;&#21644;&#32479;&#19968;&#24378;&#26222;&#36866;&#24615;&#65292;&#21487;&#20197;&#36890;&#36807;&#24182;&#34892;&#20018;&#32852;RNN&#20648;&#23618;&#26500;&#24314;&#36825;&#31181;&#31867;&#22411;&#30340;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35752;&#35770;&#20102;&#20648;&#23618;&#31995;&#32479;&#30340;&#36924;&#36817;&#33021;&#21147;&#65292;&#20854;&#20013;&#20648;&#23618;&#26159;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65288;RNN&#65289;&#12290;&#22312;&#25105;&#20204;&#30340;&#38382;&#39064;&#35774;&#23450;&#20013;&#65292;&#20648;&#23618;&#31995;&#32479;&#36890;&#36807;&#35843;&#25972;&#20854;&#32447;&#24615;&#36755;&#20986;&#26469;&#36924;&#36817;&#19968;&#32452;&#20989;&#25968;&#65292;&#32780;&#20648;&#23618;&#20445;&#25345;&#19981;&#21464;&#12290;&#25105;&#20204;&#23558;&#23637;&#31034;&#25105;&#20204;&#25152;&#31216;&#30340;&#19968;&#31867;&#20989;&#25968;&#30340;RNN&#20648;&#23618;&#31995;&#32479;&#30340;&#32479;&#19968;&#24378;&#26222;&#36866;&#24615;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#23545;&#20110;&#20219;&#24847;&#27491;&#25968;&#65292;&#25105;&#20204;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#36275;&#22815;&#22823;&#30340;RNN&#20648;&#23618;&#31995;&#32479;&#65292;&#20854;&#23545;&#35813;&#31867;&#20989;&#25968;&#20013;&#27599;&#20010;&#20989;&#25968;&#30340;&#36924;&#36817;&#35823;&#24046;&#37117;&#34987;&#27491;&#25968;&#20174;&#19978;&#26041;&#38480;&#23450;&#12290;&#36825;&#26679;&#30340;RNN&#20648;&#23618;&#31995;&#32479;&#26159;&#36890;&#36807;&#24182;&#34892;&#20018;&#32852;RNN&#20648;&#23618;&#26500;&#24314;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01900v1 Announce Type: cross  Abstract: Approximation capability of reservoir systems whose reservoir is a recurrent neural network (RNN) is discussed. In our problem setting, a reservoir system approximates a set of functions just by adjusting its linear readout while the reservoir is fixed. We will show what we call uniform strong universality of a family of RNN reservoir systems for a certain class of functions to be approximated. This means that, for any positive number, we can construct a sufficiently large RNN reservoir system whose approximation error for each function in the class of functions to be approximated is bounded from above by the positive number. Such RNN reservoir systems are constructed via parallel concatenation of RNN reservoirs.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24191;&#27867;&#30740;&#31350;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#21508;&#20010;&#20027;&#35201;&#30740;&#31350;&#39046;&#22495;&#20013;&#30340;&#28508;&#22312;&#24212;&#29992;&#65292;&#25581;&#31034;&#20102;&#20854;&#20934;&#30830;&#24615;&#21644;&#35745;&#31639;&#33021;&#21147;&#30340;&#20248;&#21183;&#65292;&#20197;&#21450;&#30456;&#20851;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2309.02712</link><description>&lt;p&gt;
&#25581;&#31034;&#28145;&#24230;&#23398;&#20064;&#30340;&#21069;&#27839;&#65306;&#22609;&#36896;&#22810;&#20010;&#39046;&#22495;&#30340;&#21019;&#26032;
&lt;/p&gt;
&lt;p&gt;
Unveiling the frontiers of deep learning: innovations shaping diverse domains. (arXiv:2309.02712v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02712
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24191;&#27867;&#30740;&#31350;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#21508;&#20010;&#20027;&#35201;&#30740;&#31350;&#39046;&#22495;&#20013;&#30340;&#28508;&#22312;&#24212;&#29992;&#65292;&#25581;&#31034;&#20102;&#20854;&#20934;&#30830;&#24615;&#21644;&#35745;&#31639;&#33021;&#21147;&#30340;&#20248;&#21183;&#65292;&#20197;&#21450;&#30456;&#20851;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#20351;&#24471;&#24320;&#21457;&#33021;&#22815;&#23398;&#20064;&#12289;&#21487;&#35270;&#21270;&#12289;&#20248;&#21270;&#12289;&#25913;&#36827;&#21644;&#39044;&#27979;&#25968;&#25454;&#30340;&#35745;&#31639;&#26426;&#27169;&#22411;&#25104;&#20026;&#21487;&#33021;&#12290;&#36817;&#24180;&#26469;&#65292;DL&#24050;&#32463;&#24212;&#29992;&#20110;&#22810;&#20010;&#39046;&#22495;&#65292;&#21253;&#25324;&#38899;&#39057;-&#35270;&#35273;&#25968;&#25454;&#22788;&#29702;&#12289;&#20892;&#19994;&#12289;&#20132;&#36890;&#39044;&#27979;&#12289;&#33258;&#28982;&#35821;&#35328;&#12289;&#29983;&#29289;&#21307;&#23398;&#12289;&#28798;&#23475;&#31649;&#29702;&#12289;&#29983;&#29289;&#20449;&#24687;&#23398;&#12289;&#33647;&#29289;&#35774;&#35745;&#12289;&#22522;&#22240;&#32452;&#23398;&#12289;&#20154;&#33080;&#35782;&#21035;&#21644;&#29983;&#24577;&#23398;&#12290;&#20026;&#20102;&#25506;&#32034;&#28145;&#24230;&#23398;&#20064;&#30340;&#24403;&#21069;&#29366;&#24577;&#65292;&#26377;&#24517;&#35201;&#30740;&#31350;&#28145;&#24230;&#23398;&#20064;&#22312;&#36825;&#20123;&#23398;&#31185;&#20013;&#30340;&#26368;&#26032;&#21457;&#23637;&#21644;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#25991;&#29486;&#20013;&#32570;&#20047;&#23545;&#28145;&#24230;&#23398;&#20064;&#22312;&#25152;&#26377;&#28508;&#22312;&#39046;&#22495;&#20013;&#30340;&#24212;&#29992;&#30340;&#25506;&#32034;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#24191;&#27867;&#35843;&#26597;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#25152;&#26377;&#20027;&#35201;&#30740;&#31350;&#39046;&#22495;&#20013;&#30340;&#28508;&#22312;&#24212;&#29992;&#65292;&#20197;&#21450;&#30456;&#20851;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;&#27491;&#22914;&#25991;&#29486;&#25152;&#35777;&#26126;&#30340;&#37027;&#26679;&#65292;DL&#22312;&#39044;&#27979;&#21644;&#20998;&#26512;&#26041;&#38754;&#34920;&#29616;&#20986;&#20934;&#30830;&#24615;&#65292;&#20351;&#20854;&#25104;&#20026;&#19968;&#31181;&#24378;&#22823;&#30340;&#35745;&#31639;&#24037;&#20855;&#65292;&#24182;&#20855;&#26377;&#34920;&#36798;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep learning (DL) enables the development of computer models that are capable of learning, visualizing, optimizing, refining, and predicting data. In recent years, DL has been applied in a range of fields, including audio-visual data processing, agriculture, transportation prediction, natural language, biomedicine, disaster management, bioinformatics, drug design, genomics, face recognition, and ecology. To explore the current state of deep learning, it is necessary to investigate the latest developments and applications of deep learning in these disciplines. However, the literature is lacking in exploring the applications of deep learning in all potential sectors. This paper thus extensively investigates the potential applications of deep learning across all major fields of study as well as the associated benefits and challenges. As evidenced in the literature, DL exhibits accuracy in prediction and analysis, makes it a powerful computational tool, and has the ability to articulate i
&lt;/p&gt;</description></item></channel></rss>