<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#30340;&#21452;&#26354;&#32447;&#38381;&#21253;&#27169;&#22411;&#65292;&#29992;&#20110;BGK&#21160;&#21147;&#27169;&#22411;&#30340;Grad&#30697;&#23637;&#24320;&#65292;&#20197;&#23454;&#29616;&#26368;&#39640;&#30697;&#30340;&#26799;&#24230;&#30340;&#31934;&#30830;&#38381;&#21512;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2401.04783</link><description>&lt;p&gt;
BGK&#26041;&#31243;&#30340;&#21452;&#26354;&#32447;&#26426;&#22120;&#23398;&#20064;&#30697;&#38381;&#21253;
&lt;/p&gt;
&lt;p&gt;
Hyperbolic Machine Learning Moment Closures for the BGK Equations. (arXiv:2401.04783v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04783
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#35757;&#32451;&#30340;&#21452;&#26354;&#32447;&#38381;&#21253;&#27169;&#22411;&#65292;&#29992;&#20110;BGK&#21160;&#21147;&#27169;&#22411;&#30340;Grad&#30697;&#23637;&#24320;&#65292;&#20197;&#23454;&#29616;&#26368;&#39640;&#30697;&#30340;&#26799;&#24230;&#30340;&#31934;&#30830;&#38381;&#21512;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#22312;BGK&#21160;&#21147;&#27169;&#22411;&#30340;&#30697;&#25968;&#25454;&#19978;&#36827;&#34892;&#35757;&#32451;&#65292;&#24341;&#20837;&#20102;&#23545;Bhatnagar-Gross-Krook&#65288;BGK&#65289;&#21160;&#21147;&#27169;&#22411;&#30340;Grad&#30697;&#23637;&#24320;&#30340;&#21452;&#26354;&#32447;&#38381;&#21253;&#12290;&#36825;&#20010;&#38381;&#21253;&#26159;&#22522;&#20110;&#25105;&#20204;&#22312;&#36755;&#36816;&#23553;&#38381;&#20013;&#23548;&#20986;&#30340;&#33258;&#30001;&#27969;&#26497;&#38480;&#30340;&#31934;&#30830;&#23553;&#38381;&#20851;&#31995;&#32780;&#25552;&#20986;&#30340;&#12290;&#36825;&#20010;&#31934;&#30830;&#23553;&#38381;&#20851;&#31995;&#23558;&#26368;&#39640;&#30697;&#30340;&#26799;&#24230;&#19982;&#22235;&#20010;&#36739;&#20302;&#30697;&#30340;&#26799;&#24230;&#30456;&#20851;&#32852;&#12290;&#19982;&#25105;&#20204;&#36807;&#21435;&#30340;&#24037;&#20316;&#19968;&#26679;&#65292;&#36825;&#37324;&#20171;&#32461;&#30340;&#27169;&#22411;&#36890;&#36807;&#36739;&#20302;&#30697;&#30340;&#26799;&#24230;&#31995;&#25968;&#26469;&#23398;&#20064;&#26368;&#39640;&#30697;&#30340;&#26799;&#24230;&#12290;&#36825;&#24847;&#21619;&#30528;&#24471;&#21040;&#30340;&#21452;&#26354;&#31995;&#32479;&#22312;&#26368;&#39640;&#30697;&#19978;&#24182;&#38750;&#23432;&#24658;&#12290;&#20026;&#20102;&#31283;&#23450;&#24615;&#65292;&#31070;&#32463;&#32593;&#32476;&#30340;&#36755;&#20986;&#23618;&#34987;&#35774;&#35745;&#25104;&#24378;&#21046;&#21452;&#26354;&#24615;&#21644;Galileo&#19981;&#21464;&#24615;&#12290;&#36825;&#30830;&#20445;&#27169;&#22411;&#33021;&#22815;&#22312;NN&#30340;&#35757;&#32451;&#31383;&#21475;&#20043;&#22806;&#36816;&#34892;&#12290;&#19982;&#25105;&#20204;&#20197;&#21069;&#22788;&#29702;&#32447;&#24615;&#27169;&#22411;&#30340;&#36752;&#23556;&#36755;&#36816;&#24037;&#20316;&#19981;&#21516;&#65292;BGK&#27169;&#22411;&#30340;&#38750;&#32447;&#24615;&#24615;&#35201;&#27714;&#26356;&#39640;&#32423;&#30340;&#35757;&#32451;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a hyperbolic closure for the Grad moment expansion of the Bhatnagar-Gross-Krook's (BGK) kinetic model using a neural network (NN) trained on BGK's moment data. This closure is motivated by the exact closure for the free streaming limit that we derived in our paper on closures in transport \cite{Huang2022-RTE1}. The exact closure relates the gradient of the highest moment to the gradient of four lower moments. As with our past work, the model presented here learns the gradient of the highest moment in terms of the coefficients of gradients for all lower ones. By necessity, this means that the resulting hyperbolic system is not conservative in the highest moment. For stability, the output layers of the NN are designed to enforce hyperbolicity and Galilean invariance. This ensures the model can be run outside of the training window of the NN. Unlike our previous work on radiation transport that dealt with linear models, the BGK model's nonlinearity demanded advanced training 
&lt;/p&gt;</description></item></channel></rss>