<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#20351;&#29992;&#29289;&#29702;&#20449;&#24687;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#33258;&#21160;&#21457;&#29616;&#20154;&#24037;&#31896;&#24615;&#27169;&#22411;&#65292;&#26080;&#38656;&#25968;&#25454;&#38598;&#35757;&#32451;&#65292;&#25104;&#21151;&#24212;&#29992;&#20110;&#39640;&#38454;&#23432;&#24658;&#23450;&#24459;&#27714;&#35299;&#22120;&#20013;&#12290;</title><link>https://arxiv.org/abs/2402.16517</link><description>&lt;p&gt;
&#20351;&#29992;&#29289;&#29702;&#20449;&#24687;&#26426;&#22120;&#23398;&#20064;&#21457;&#29616;&#19981;&#36830;&#32493;Galerkin&#36924;&#36817;&#23432;&#24658;&#23450;&#24459;&#30340;&#20154;&#24037;&#31896;&#24615;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Discovering Artificial Viscosity Models for Discontinuous Galerkin Approximation of Conservation Laws using Physics-Informed Machine Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16517
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#29289;&#29702;&#20449;&#24687;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#33258;&#21160;&#21457;&#29616;&#20154;&#24037;&#31896;&#24615;&#27169;&#22411;&#65292;&#26080;&#38656;&#25968;&#25454;&#38598;&#35757;&#32451;&#65292;&#25104;&#21151;&#24212;&#29992;&#20110;&#39640;&#38454;&#23432;&#24658;&#23450;&#24459;&#27714;&#35299;&#22120;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#26377;&#38480;&#20803;&#30340;&#39640;&#38454;&#23432;&#24658;&#23450;&#24459;&#27714;&#35299;&#22120;&#25552;&#20379;&#20102;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#65292;&#20294;&#22312;&#19981;&#36830;&#32493;&#22788;&#38754;&#20020;Gibbs&#29616;&#35937;&#25361;&#25112;&#12290;&#20154;&#24037;&#31896;&#24615;&#26159;&#22522;&#20110;&#29289;&#29702;&#35265;&#35299;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29289;&#29702;&#20449;&#24687;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#29992;&#20110;&#33258;&#21160;&#21457;&#29616;&#38750;&#30417;&#30563;&#33539;&#24335;&#19979;&#30340;&#20154;&#24037;&#31896;&#24615;&#27169;&#22411;&#12290;&#35813;&#31639;&#27861;&#21463;&#24378;&#21270;&#23398;&#20064;&#21551;&#21457;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#23450;&#20041;&#20026;&#30456;&#23545;&#21442;&#32771;&#35299;&#30340;&#24046;&#24322;&#30340;&#25439;&#22833;&#26469;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#65292;&#21333;&#20803;&#26684;&#36880;&#20010;&#21333;&#20803;&#26684;&#25805;&#20316;&#65288;&#31896;&#24615;&#27169;&#22411;&#65289;&#12290;&#36825;&#20351;&#24471;&#33021;&#22815;&#36827;&#34892;&#26080;&#25968;&#25454;&#38598;&#30340;&#35757;&#32451;&#36807;&#31243;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#36890;&#36807;&#23558;&#20854;&#25972;&#21512;&#21040;&#26368;&#20808;&#36827;&#30340;Runge-Kutta&#19981;&#36830;&#32493;Galerkin&#27714;&#35299;&#22120;&#20013;&#26159;&#26377;&#25928;&#30340;&#12290;&#25105;&#20204;&#22312;&#26631;&#37327;&#21644;&#30690;&#37327;&#38382;&#39064;&#19978;&#23637;&#31034;&#20102;&#20960;&#20010;&#25968;&#20540;&#27979;&#35797;&#65292;&#22914;Burgers'&#21644;Euler&#30340;&#26041;&#31243;&#22312;&#19968;&#32500;&#21644;&#20108;&#32500;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16517v1 Announce Type: cross  Abstract: Finite element-based high-order solvers of conservation laws offer large accuracy but face challenges near discontinuities due to the Gibbs phenomenon. Artificial viscosity is a popular and effective solution to this problem based on physical insight. In this work, we present a physics-informed machine learning algorithm to automate the discovery of artificial viscosity models in a non-supervised paradigm. The algorithm is inspired by reinforcement learning and trains a neural network acting cell-by-cell (the viscosity model) by minimizing a loss defined as the difference with respect to a reference solution thanks to automatic differentiation. This enables a dataset-free training procedure. We prove that the algorithm is effective by integrating it into a state-of-the-art Runge-Kutta discontinuous Galerkin solver. We showcase several numerical tests on scalar and vectorial problems, such as Burgers' and Euler's equations in one and tw
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20005;&#26684;&#20998;&#26512;&#20102;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;PDEs&#30340;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;PICNN&#65289;&#65292;&#36890;&#36807;&#20351;&#29992;&#26368;&#26032;&#30340;&#36924;&#36817;&#32467;&#26524;&#21644;&#29699;&#35856;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#36924;&#36817;&#35823;&#24046;&#19982;Sobolev&#33539;&#25968;&#30340;&#19978;&#30028;&#65292;&#24182;&#24314;&#31435;&#20102;&#24555;&#36895;&#25910;&#25947;&#36895;&#29575;&#12290;&#23454;&#39564;&#32467;&#26524;&#20063;&#39564;&#35777;&#20102;&#29702;&#35770;&#20998;&#26512;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.09605</link><description>&lt;p&gt;
&#20351;&#29992;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;&#20559;&#24494;&#20998;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Solving PDEs on Spheres with Physics-Informed Convolutional Neural Networks. (arXiv:2308.09605v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09605
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20005;&#26684;&#20998;&#26512;&#20102;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;PDEs&#30340;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;PICNN&#65289;&#65292;&#36890;&#36807;&#20351;&#29992;&#26368;&#26032;&#30340;&#36924;&#36817;&#32467;&#26524;&#21644;&#29699;&#35856;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#36924;&#36817;&#35823;&#24046;&#19982;Sobolev&#33539;&#25968;&#30340;&#19978;&#30028;&#65292;&#24182;&#24314;&#31435;&#20102;&#24555;&#36895;&#25910;&#25947;&#36895;&#29575;&#12290;&#23454;&#39564;&#32467;&#26524;&#20063;&#39564;&#35777;&#20102;&#29702;&#35770;&#20998;&#26512;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#24050;&#34987;&#35777;&#26126;&#22312;&#35299;&#20915;&#21508;&#31181;&#23454;&#39564;&#35282;&#24230;&#20013;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDEs&#65289;&#26041;&#38754;&#38750;&#24120;&#39640;&#25928;&#12290;&#19968;&#20123;&#26368;&#36817;&#30340;&#30740;&#31350;&#36824;&#25552;&#20986;&#20102;&#38024;&#23545;&#34920;&#38754;&#65292;&#21253;&#25324;&#29699;&#38754;&#19978;&#30340;PDEs&#30340;PINN&#31639;&#27861;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;PINNs&#30340;&#25968;&#20540;&#24615;&#33021;&#65292;&#23588;&#20854;&#26159;&#22312;&#34920;&#38754;&#25110;&#27969;&#24418;&#19978;&#30340;PINNs&#65292;&#20173;&#28982;&#32570;&#20047;&#29702;&#35770;&#29702;&#35299;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23545;&#29992;&#20110;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;PDEs&#30340;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;PICNN&#65289;&#36827;&#34892;&#20102;&#20005;&#26684;&#20998;&#26512;&#12290;&#36890;&#36807;&#20351;&#29992;&#21644;&#25913;&#36827;&#28145;&#24230;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#21644;&#29699;&#35856;&#20998;&#26512;&#30340;&#26368;&#26032;&#36924;&#36817;&#32467;&#26524;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#36924;&#36817;&#35823;&#24046;&#19982;Sobolev&#33539;&#25968;&#30340;&#19978;&#30028;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#23558;&#36825;&#19968;&#32467;&#26524;&#19982;&#21019;&#26032;&#30340;&#23616;&#37096;&#22797;&#26434;&#24230;&#20998;&#26512;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#20102;PICNN&#30340;&#24555;&#36895;&#25910;&#25947;&#36895;&#29575;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#20063;&#24471;&#21040;&#20102;&#23454;&#39564;&#30340;&#39564;&#35777;&#21644;&#34917;&#20805;&#12290;&#37492;&#20110;&#36825;&#20123;&#21457;&#29616;&#65292;
&lt;/p&gt;
&lt;p&gt;
Physics-informed neural networks (PINNs) have been demonstrated to be efficient in solving partial differential equations (PDEs) from a variety of experimental perspectives. Some recent studies have also proposed PINN algorithms for PDEs on surfaces, including spheres. However, theoretical understanding of the numerical performance of PINNs, especially PINNs on surfaces or manifolds, is still lacking. In this paper, we establish rigorous analysis of the physics-informed convolutional neural network (PICNN) for solving PDEs on the sphere. By using and improving the latest approximation results of deep convolutional neural networks and spherical harmonic analysis, we prove an upper bound for the approximation error with respect to the Sobolev norm. Subsequently, we integrate this with innovative localization complexity analysis to establish fast convergence rates for PICNN. Our theoretical results are also confirmed and supplemented by our experiments. In light of these findings, we expl
&lt;/p&gt;</description></item></channel></rss>