<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26377;&#29702;&#26680;&#30340;&#22797;&#39057;&#29575;&#21709;&#24212;&#20989;&#25968;&#25554;&#20540;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#22797;&#20540;&#20989;&#25968;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65292;&#24182;&#32467;&#21512;&#20302;&#38454;&#26377;&#29702;&#20989;&#25968;&#36827;&#34892;&#33258;&#36866;&#24212;&#25554;&#20540;&#65292;&#35299;&#20915;&#20102;&#39057;&#29575;&#21709;&#24212;&#20989;&#25968;&#25311;&#21512;&#36807;&#31243;&#20013;&#26631;&#20934;&#26680;&#26041;&#27861;&#34920;&#29616;&#19981;&#20339;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.13484</link><description>&lt;p&gt;
&#22522;&#20110;&#26377;&#29702;&#26680;&#30340;&#22797;&#39057;&#29575;&#21709;&#24212;&#20989;&#25968;&#25554;&#20540;
&lt;/p&gt;
&lt;p&gt;
Rational kernel-based interpolation for complex-valued frequency response functions. (arXiv:2307.13484v1 [cs.CE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13484
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26377;&#29702;&#26680;&#30340;&#22797;&#39057;&#29575;&#21709;&#24212;&#20989;&#25968;&#25554;&#20540;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#22797;&#20540;&#20989;&#25968;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65292;&#24182;&#32467;&#21512;&#20302;&#38454;&#26377;&#29702;&#20989;&#25968;&#36827;&#34892;&#33258;&#36866;&#24212;&#25554;&#20540;&#65292;&#35299;&#20915;&#20102;&#39057;&#29575;&#21709;&#24212;&#20989;&#25968;&#25311;&#21512;&#36807;&#31243;&#20013;&#26631;&#20934;&#26680;&#26041;&#27861;&#34920;&#29616;&#19981;&#20339;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#26680;&#30340;&#36924;&#36817;&#26041;&#27861;&#22312;&#22797;&#20540;&#20989;&#25968;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#65292;&#20854;&#20013;&#29305;&#21035;&#20851;&#27880;&#39057;&#22495;&#20013;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#39057;&#29575;&#21709;&#24212;&#20989;&#25968;&#12290;&#22312;&#36825;&#20010;&#35774;&#32622;&#20013;&#65292;&#26680;&#26041;&#27861;&#36234;&#26469;&#36234;&#24120;&#29992;&#65292;&#28982;&#32780;&#26631;&#20934;&#30340;&#26680;&#26041;&#27861;&#34920;&#29616;&#19981;&#20339;&#12290;&#27492;&#22806;&#65292;&#22312;&#22797;&#20540;&#24773;&#20917;&#19979;&#65292;&#24213;&#23618;&#26680;&#23545;&#30340;&#25968;&#23398;&#21547;&#20041;&#21644;&#25968;&#23398;&#25512;&#23548;&#23578;&#24453;&#35299;&#20915;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#22797;&#20540;&#20989;&#25968;&#30340;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65292;&#24182;&#23558;&#24102;&#26377;&#26680;&#23545;&#30340;&#22797;&#20540;&#25554;&#20540;&#38382;&#39064;&#36716;&#21270;&#20026;&#36825;&#20123;&#31354;&#38388;&#20013;&#30340;&#26368;&#23567;&#33539;&#25968;&#25554;&#20540;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#25554;&#20540;&#22120;&#19982;&#20302;&#38454;&#26377;&#29702;&#20989;&#25968;&#32467;&#21512;&#65292;&#20854;&#20013;&#38454;&#25968;&#26681;&#25454;&#19968;&#31181;&#26032;&#30340;&#27169;&#22411;&#36873;&#25321;&#20934;&#21017;&#33258;&#36866;&#24212;&#36873;&#25321;&#12290;&#26469;&#33258;&#19981;&#21516;&#39046;&#22495;&#65288;&#21253;&#25324;&#30005;&#30913;&#23398;&#21644;&#22768;&#23398;&#65289;&#30340;&#20363;&#23376;&#30340;&#25968;&#20540;&#32467;&#26524;&#35828;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work is concerned with the kernel-based approximation of a complex-valued function from data, where the frequency response function of a partial differential equation in the frequency domain is of particular interest. In this setting, kernel methods are employed more and more frequently, however, standard kernels do not perform well. Moreover, the role and mathematical implications of the underlying pair of kernels, which arises naturally in the complex-valued case, remain to be addressed. We introduce new reproducing kernel Hilbert spaces of complex-valued functions, and formulate the problem of complex-valued interpolation with a kernel pair as minimum norm interpolation in these spaces. Moreover, we combine the interpolant with a low-order rational function, where the order is adaptively selected based on a new model selection criterion. Numerical results on examples from different fields, including electromagnetics and acoustic examples, illustrate the performance of the metho
&lt;/p&gt;</description></item></channel></rss>