<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#24341;&#20837;&#20102;&#19968;&#31181;&#24102;&#26377;&#29978;&#33267;&#31435;&#26041;&#38750;&#32447;&#24615;&#30340;&#31616;&#21333;&#23454;&#29616;&#28608;&#27963;&#20989;&#25968;&#65292;&#36890;&#36807;&#24341;&#20837;&#21487;&#20248;&#21270;&#21442;&#25968;&#20351;&#24471;&#28608;&#27963;&#20989;&#25968;&#20855;&#26377;&#26356;&#22823;&#30340;&#33258;&#30001;&#24230;&#65292;&#21487;&#20197;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#30340;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#19981;&#38656;&#35201;&#22826;&#22810;&#39069;&#22806;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;</title><link>https://arxiv.org/abs/2403.19896</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#22686;&#24378;&#33258;&#36866;&#24212;&#28608;&#27963;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Nonlinearity Enhanced Adaptive Activation Function
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19896
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#31181;&#24102;&#26377;&#29978;&#33267;&#31435;&#26041;&#38750;&#32447;&#24615;&#30340;&#31616;&#21333;&#23454;&#29616;&#28608;&#27963;&#20989;&#25968;&#65292;&#36890;&#36807;&#24341;&#20837;&#21487;&#20248;&#21270;&#21442;&#25968;&#20351;&#24471;&#28608;&#27963;&#20989;&#25968;&#20855;&#26377;&#26356;&#22823;&#30340;&#33258;&#30001;&#24230;&#65292;&#21487;&#20197;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#30340;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#19981;&#38656;&#35201;&#22826;&#22810;&#39069;&#22806;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#19968;&#31181;&#31616;&#21333;&#23454;&#29616;&#30340;&#28608;&#27963;&#20989;&#25968;&#65292;&#20855;&#26377;&#29978;&#33267;&#31435;&#26041;&#38750;&#32447;&#24615;&#65292;&#21487;&#20197;&#25552;&#39640;&#31070;&#32463;&#32593;&#32476;&#30340;&#20934;&#30830;&#24615;&#65292;&#32780;&#19981;&#38656;&#35201;&#22826;&#22810;&#39069;&#22806;&#30340;&#35745;&#31639;&#36164;&#28304;&#12290;&#36890;&#36807;&#19968;&#31181;&#26126;&#26174;&#30340;&#25910;&#25947;&#19982;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#26469;&#23454;&#29616;&#12290;&#35813;&#28608;&#27963;&#20989;&#25968;&#36890;&#36807;&#24341;&#20837;&#21487;&#20248;&#21270;&#21442;&#25968;&#26469;&#27867;&#21270;&#26631;&#20934;RELU&#20989;&#25968;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#39069;&#22806;&#30340;&#33258;&#30001;&#24230;&#65292;&#20351;&#24471;&#38750;&#32447;&#24615;&#31243;&#24230;&#21487;&#20197;&#34987;&#35843;&#25972;&#12290;&#36890;&#36807;&#19982;&#26631;&#20934;&#25216;&#26415;&#36827;&#34892;&#27604;&#36739;&#65292;&#23558;&#22312;MNIST&#25968;&#23383;&#25968;&#25454;&#38598;&#30340;&#32972;&#26223;&#19979;&#37327;&#21270;&#30456;&#20851;&#20934;&#30830;&#24615;&#30340;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19896v1 Announce Type: new  Abstract: A simply implemented activation function with even cubic nonlinearity is introduced that increases the accuracy of neural networks without substantial additional computational resources. This is partially enabled through an apparent tradeoff between convergence and accuracy. The activation function generalizes the standard RELU function by introducing additional degrees of freedom through optimizable parameters that enable the degree of nonlinearity to be adjusted. The associated accuracy enhancement is quantified in the context of the MNIST digit data set through a comparison with standard techniques.
&lt;/p&gt;</description></item></channel></rss>