<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20998;&#31867;&#30340;&#26080;&#23548;&#25968;&#20248;&#21270;&#31639;&#27861;&#30340;&#21152;&#36895;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#21306;&#22495;&#25910;&#32553;&#27493;&#39588;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;RACE-CARS&#8221;&#30340;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#21306;&#22495;&#25910;&#32553;&#30340;&#21152;&#36895;&#24615;&#36136;&#12290;&#23454;&#39564;&#32467;&#26524;&#39564;&#35777;&#20102;"RACE-CARS"&#30340;&#39640;&#25928;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#32463;&#39564;&#30340;&#36229;&#21442;&#25968;&#35843;&#20248;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2309.11036</link><description>&lt;p&gt;
&#22522;&#20110;&#21306;&#22495;&#25910;&#32553;&#30340;&#20998;&#31867;&#20248;&#21270;&#31639;&#27861;&#30340;&#21152;&#36895;
&lt;/p&gt;
&lt;p&gt;
A Region-Shrinking-Based Acceleration for Classification-Based Derivative-Free Optimization. (arXiv:2309.11036v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11036
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20998;&#31867;&#30340;&#26080;&#23548;&#25968;&#20248;&#21270;&#31639;&#27861;&#30340;&#21152;&#36895;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#21306;&#22495;&#25910;&#32553;&#27493;&#39588;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;RACE-CARS&#8221;&#30340;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#21306;&#22495;&#25910;&#32553;&#30340;&#21152;&#36895;&#24615;&#36136;&#12290;&#23454;&#39564;&#32467;&#26524;&#39564;&#35777;&#20102;"RACE-CARS"&#30340;&#39640;&#25928;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#32463;&#39564;&#30340;&#36229;&#21442;&#25968;&#35843;&#20248;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26080;&#23548;&#25968;&#20248;&#21270;&#31639;&#27861;&#22312;&#31185;&#23398;&#21644;&#24037;&#31243;&#35774;&#35745;&#20248;&#21270;&#38382;&#39064;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#29305;&#21035;&#26159;&#24403;&#26080;&#27861;&#33719;&#21462;&#23548;&#25968;&#20449;&#24687;&#26102;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20998;&#31867;&#30340;&#26080;&#23548;&#25968;&#20248;&#21270;&#31639;&#27861;&#30340;&#26694;&#26550;&#12290;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#31216;&#20026;&#20551;&#35774;-&#30446;&#26631;&#30772;&#35010;&#29575;&#30340;&#27010;&#24565;&#65292;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#35813;&#31867;&#22411;&#31639;&#27861;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#19978;&#30028;&#12290;&#21463;&#37325;&#26032;&#23457;&#35270;&#30340;&#19978;&#30028;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;RACE-CARS&#8221;&#30340;&#31639;&#27861;&#65292;&#19982;&#8220;SRACOS&#8221;&#65288;Hu et al., 2017&#65289;&#30456;&#27604;&#65292;&#35813;&#31639;&#27861;&#28155;&#21152;&#20102;&#19968;&#20010;&#38543;&#26426;&#21306;&#22495;&#25910;&#32553;&#27493;&#39588;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;&#21306;&#22495;&#25910;&#32553;&#30340;&#21152;&#36895;&#24615;&#36136;&#12290;&#38024;&#23545;&#21512;&#25104;&#20989;&#25968;&#20197;&#21450;&#35821;&#35328;&#27169;&#22411;&#26381;&#21153;&#30340;&#40657;&#30418;&#35843;&#20248;&#30340;&#23454;&#39564;&#22312;&#32463;&#39564;&#35777;&#26126;&#20102;&#8220;RACE-CARS&#8221;&#30340;&#25928;&#29575;&#12290;&#25105;&#20204;&#36824;&#36827;&#34892;&#20102;&#20851;&#20110;&#24341;&#20837;&#36229;&#21442;&#25968;&#30340;&#28040;&#34701;&#23454;&#39564;&#65292;&#25581;&#31034;&#20102;&#8220;RACE-CARS&#8221;&#30340;&#24037;&#20316;&#26426;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#32463;&#39564;&#30340;&#36229;&#21442;&#25968;&#35843;&#20248;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
Derivative-free optimization algorithms play an important role in scientific and engineering design optimization problems, especially when derivative information is not accessible. In this paper, we study the framework of classification-based derivative-free optimization algorithms. By introducing a concept called hypothesis-target shattering rate, we revisit the computational complexity upper bound of this type of algorithms. Inspired by the revisited upper bound, we propose an algorithm named "RACE-CARS", which adds a random region-shrinking step compared with "SRACOS" (Hu et al., 2017).. We further establish a theorem showing the acceleration of region-shrinking. Experiments on the synthetic functions as well as black-box tuning for language-model-as-a-service demonstrate empirically the efficiency of "RACE-CARS". An ablation experiment on the introduced hyperparameters is also conducted, revealing the mechanism of "RACE-CARS" and putting forward an empirical hyperparameter-tuning g
&lt;/p&gt;</description></item></channel></rss>