<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#36164;&#28304;&#39640;&#25928;&#30340;&#22312;&#32447;RNN&#31639;&#27861;&#22312;&#25918;&#30103;&#27835;&#30103;&#36807;&#31243;&#20013;&#20934;&#30830;&#39044;&#27979;&#21628;&#21560;&#36816;&#21160;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.01607</link><description>&lt;p&gt;
&#38024;&#23545;&#22806;&#37096;&#23548;&#21521;&#25918;&#30103;&#20013;&#23433;&#20840;&#22686;&#24378;&#30340;&#21628;&#21560;&#36816;&#21160;&#39044;&#27979;&#19982;&#22312;&#32447;&#23398;&#20064;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Respiratory motion forecasting with online learning of recurrent neural networks for safety enhancement in externally guided radiotherapy
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01607
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#36164;&#28304;&#39640;&#25928;&#30340;&#22312;&#32447;RNN&#31639;&#27861;&#22312;&#25918;&#30103;&#27835;&#30103;&#36807;&#31243;&#20013;&#20934;&#30830;&#39044;&#27979;&#21628;&#21560;&#36816;&#21160;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32954;&#37096;&#25918;&#30103;&#20013;&#65292;&#32418;&#22806;&#25668;&#20687;&#22836;&#21487;&#20197;&#35760;&#24405;&#33016;&#37096;&#21453;&#23556;&#29289;&#20307;&#30340;&#20301;&#32622;&#65292;&#20197;&#25512;&#26029;&#30001;&#20110;&#21628;&#21560;&#32780;&#31227;&#21160;&#30340;&#32959;&#30244;&#20301;&#32622;&#65292;&#20294;&#27835;&#30103;&#31995;&#32479;&#30340;&#24310;&#36831;&#24433;&#21709;&#20102;&#25918;&#23556;&#26463;&#31934;&#24230;&#12290;&#23454;&#26102;&#24490;&#29615;&#23398;&#20064;&#65288;RTRL&#65289;&#26159;&#19968;&#20010;&#28508;&#22312;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#22240;&#20026;&#23427;&#21487;&#20197;&#23398;&#20064;&#38750;&#24179;&#31283;&#21628;&#21560;&#25968;&#25454;&#20013;&#30340;&#27169;&#24335;&#65292;&#20294;&#20855;&#26377;&#36739;&#39640;&#30340;&#22797;&#26434;&#24615;&#12290;&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#36164;&#28304;&#39640;&#25928;&#30340;&#22312;&#32447;RNN&#31639;&#27861;&#65292;&#21363;&#26080;&#20559;&#22312;&#32447;&#24490;&#29615;&#20248;&#21270;&#65288;UORO&#65289;&#12289;&#31232;&#30095;-1&#27493;&#36924;&#36817;&#65288;SnAp-1&#65289;&#21644;&#35299;&#32806;&#31070;&#32463;&#25509;&#21475;&#65288;DNI&#65289;&#65292;&#20197;&#20934;&#30830;&#39044;&#27979;&#25918;&#30103;&#27835;&#30103;&#36807;&#31243;&#20013;&#30340;&#21628;&#21560;&#36816;&#21160;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;&#20581;&#24247;&#21463;&#35797;&#32773;&#33016;&#37096;&#22806;&#37096;&#26631;&#35760;&#29289;&#30340;&#21253;&#21547;3D&#20301;&#32622;&#30340;&#26102;&#38388;&#24207;&#21015;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#24433;&#21709;&#21644;&#21363;&#26102;&#38597;&#21487;&#27604;&#30697;&#38453;&#30340;&#21387;&#32553;&#20197;&#21450;&#32447;&#24615;&#31995;&#25968;&#30340;&#20934;&#30830;&#26356;&#26032;&#29992;&#20110;&#20449;&#29992;&#20998;&#37197;&#30340;SnAp-1&#21644;DNI&#30340;&#39640;&#25928;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01607v1 Announce Type: new  Abstract: In lung radiotherapy, infrared cameras can record the location of reflective objects on the chest to infer the position of the tumor moving due to breathing, but treatment system latencies hinder radiation beam precision. Real-time recurrent learning (RTRL), is a potential solution as it can learn patterns within non-stationary respiratory data but has high complexity. This study assesses the capabilities of resource-efficient online RNN algorithms, namely unbiased online recurrent optimization (UORO), sparse-1 step approximation (SnAp-1), and decoupled neural interfaces (DNI) to forecast respiratory motion during radiotherapy treatment accurately. We use time series containing the 3D position of external markers on the chest of healthy subjects. We propose efficient implementations for SnAp-1 and DNI based on compression of the influence and immediate Jacobian matrices and an accurate update of the linear coefficients used in credit ass
&lt;/p&gt;</description></item></channel></rss>