<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#27531;&#24046;&#22810;&#20445;&#30495;&#35745;&#31639;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#22810;&#20445;&#30495;&#20449;&#24687;&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;&#20195;&#29702;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#20302;&#20445;&#30495;&#21644;&#39640;&#20445;&#30495;&#35745;&#31639;&#27169;&#22411;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#24314;&#27169;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#35757;&#32451;&#20102;&#20004;&#20010;&#31070;&#32463;&#32593;&#32476;&#65292;&#21033;&#29992;&#27531;&#24046;&#20989;&#25968;&#36827;&#34892;&#27169;&#22411;&#35757;&#32451;&#65292;&#26368;&#32456;&#24471;&#21040;&#20102;&#39640;&#20445;&#30495;&#26367;&#20195;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2310.03572</link><description>&lt;p&gt;
&#22810;&#20445;&#30495;&#31070;&#32463;&#32593;&#32476;&#35745;&#31639;&#30340;&#27531;&#24046;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Residual Multi-Fidelity Neural Network Computing. (arXiv:2310.03572v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03572
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#27531;&#24046;&#22810;&#20445;&#30495;&#35745;&#31639;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#22810;&#20445;&#30495;&#20449;&#24687;&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;&#20195;&#29702;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#20302;&#20445;&#30495;&#21644;&#39640;&#20445;&#30495;&#35745;&#31639;&#27169;&#22411;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#24314;&#27169;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#35757;&#32451;&#20102;&#20004;&#20010;&#31070;&#32463;&#32593;&#32476;&#65292;&#21033;&#29992;&#27531;&#24046;&#20989;&#25968;&#36827;&#34892;&#27169;&#22411;&#35757;&#32451;&#65292;&#26368;&#32456;&#24471;&#21040;&#20102;&#39640;&#20445;&#30495;&#26367;&#20195;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20351;&#29992;&#22810;&#20445;&#30495;&#20449;&#24687;&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;&#20195;&#29702;&#27169;&#22411;&#30340;&#19968;&#33324;&#38382;&#39064;&#12290;&#32473;&#23450;&#19968;&#20010;&#24265;&#20215;&#30340;&#20302;&#20445;&#30495;&#21644;&#19968;&#20010;&#26114;&#36149;&#30340;&#39640;&#20445;&#30495;&#35745;&#31639;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27531;&#24046;&#22810;&#20445;&#30495;&#35745;&#31639;&#26694;&#26550;&#65292;&#23558;&#27169;&#22411;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#24314;&#27169;&#20026;&#19968;&#20010;&#27531;&#24046;&#20989;&#25968;&#65292;&#36825;&#26159;&#19968;&#20010;&#21487;&#33021;&#38750;&#32447;&#24615;&#30340;1&#65289;&#27169;&#22411;&#20849;&#20139;&#30340;&#36755;&#20837;&#31354;&#38388;&#21644;&#20302;&#20445;&#30495;&#27169;&#22411;&#36755;&#20986;&#20043;&#38388;&#30340;&#26144;&#23556;&#65292;&#20197;&#21450;2&#65289;&#20004;&#20010;&#27169;&#22411;&#36755;&#20986;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#35757;&#32451;&#20102;&#20004;&#20010;&#31070;&#32463;&#32593;&#32476;&#26469;&#21327;&#21516;&#24037;&#20316;&#12290;&#31532;&#19968;&#20010;&#32593;&#32476;&#22312;&#23569;&#37327;&#30340;&#39640;&#20445;&#30495;&#21644;&#20302;&#20445;&#30495;&#25968;&#25454;&#19978;&#23398;&#20064;&#27531;&#24046;&#20989;&#25968;&#12290;&#19968;&#26086;&#35757;&#32451;&#23436;&#25104;&#65292;&#36825;&#20010;&#32593;&#32476;&#34987;&#29992;&#26469;&#29983;&#25104;&#39069;&#22806;&#30340;&#21512;&#25104;&#39640;&#20445;&#30495;&#25968;&#25454;&#65292;&#29992;&#20110;&#35757;&#32451;&#31532;&#20108;&#20010;&#32593;&#32476;&#12290;&#19968;&#26086;&#35757;&#32451;&#23436;&#25104;&#65292;&#31532;&#20108;&#20010;&#32593;&#32476;&#20316;&#20026;&#25105;&#20204;&#23545;&#39640;&#20445;&#30495;&#24863;&#20852;&#36259;&#30340;&#37327;&#30340;&#26367;&#20195;&#27169;&#22411;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19977;&#20010;&#25968;&#20540;&#20363;&#23376;&#26469;&#35777;&#26126;&#36825;&#31181;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we consider the general problem of constructing a neural network surrogate model using multi-fidelity information. Given an inexpensive low-fidelity and an expensive high-fidelity computational model, we present a residual multi-fidelity computational framework that formulates the correlation between models as a residual function, a possibly non-linear mapping between 1) the shared input space of the models together with the low-fidelity model output and 2) the discrepancy between the two model outputs. To accomplish this, we train two neural networks to work in concert. The first network learns the residual function on a small set of high-fidelity and low-fidelity data. Once trained, this network is used to generate additional synthetic high-fidelity data, which is used in the training of a second network. This second network, once trained, acts as our surrogate for the high-fidelity quantity of interest. We present three numerical examples to demonstrate the power of th
&lt;/p&gt;</description></item></channel></rss>