<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21551;&#21457;&#24335;&#20840;&#23616;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;UMCTS&#65289;&#29992;&#20110;&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#32467;&#21512;&#26356;&#26032;&#36807;&#31243;&#21644;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;MCTS&#65289;&#20197;&#21450;&#20351;&#29992;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#26469;&#33719;&#24471;&#21512;&#36866;&#30340;&#35774;&#35745;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2309.06045</link><description>&lt;p&gt;
&#22522;&#20110;&#21551;&#21457;&#24335;&#20840;&#23616;&#25628;&#32034;&#30340;&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#38382;&#39064;&#30340;&#25913;&#36827;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;UMCTS&#65289;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Update Monte Carlo tree search (UMCTS) algorithm for heuristic global search of sizing optimization problems for truss structures. (arXiv:2309.06045v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06045
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21551;&#21457;&#24335;&#20840;&#23616;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;UMCTS&#65289;&#29992;&#20110;&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#32467;&#21512;&#26356;&#26032;&#36807;&#31243;&#21644;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;MCTS&#65289;&#20197;&#21450;&#20351;&#29992;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#26469;&#33719;&#24471;&#21512;&#36866;&#30340;&#35774;&#35745;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#26159;&#19968;&#20010;&#22797;&#26434;&#30340;&#35745;&#31639;&#38382;&#39064;&#65292;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#36866;&#29992;&#20110;&#22788;&#29702;&#26080;&#26799;&#24230;&#35745;&#31639;&#30340;&#22810;&#27169;&#24577;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39640;&#25928;&#20248;&#21270;&#31639;&#27861;&#8212;&#8212;&#26356;&#26032;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;UMCTS&#65289;&#65292;&#29992;&#20110;&#33719;&#24471;&#21512;&#36866;&#30340;&#26689;&#26550;&#32467;&#26500;&#35774;&#35745;&#12290;UMCTS&#26159;&#19968;&#31181;&#22522;&#20110;RL&#30340;&#26041;&#27861;&#65292;&#23558;&#26032;&#39062;&#30340;&#26356;&#26032;&#36807;&#31243;&#21644;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;MCTS&#65289;&#19982;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#30456;&#32467;&#21512;&#12290;&#26356;&#26032;&#36807;&#31243;&#24847;&#21619;&#30528;&#22312;&#27599;&#19968;&#36718;&#20013;&#65292;&#27599;&#20010;&#26500;&#20214;&#30340;&#26368;&#20339;&#25130;&#38754;&#31215;&#36890;&#36807;&#25628;&#32034;&#26641;&#30830;&#23450;&#65292;&#20854;&#21021;&#22987;&#29366;&#24577;&#26159;&#19978;&#19968;&#36718;&#30340;&#26368;&#32456;&#29366;&#24577;&#12290;&#22312;UMCTS&#31639;&#27861;&#20013;&#65292;&#24341;&#20837;&#20102;&#21152;&#36895;&#36873;&#25321;&#25104;&#21592;&#38754;&#31215;&#21644;&#36845;&#20195;&#27425;&#25968;&#30340;&#21152;&#36895;&#22120;&#65292;&#20197;&#20943;&#23569;&#35745;&#31639;&#26102;&#38388;&#12290;&#27492;&#22806;&#65292;&#23545;&#20110;&#27599;&#20010;&#29366;&#24577;&#65292;&#24179;&#22343;&#22870;&#21169;&#34987;&#26368;&#20339;&#22870;&#21169;&#30340;&#27169;&#25311;&#36807;&#31243;&#20013;&#25910;&#38598;&#26469;&#30340;&#22870;&#21169;&#26367;&#20195;&#65292;&#30830;&#23450;&#26368;&#20248;&#35299;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20248;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#26356;&#26032;&#36807;&#31243;&#21644;MCTS&#65292;&#20197;&#21450;&#20351;&#29992;UCB&#26469;&#20248;&#21270;&#26689;&#26550;&#32467;&#26500;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sizing optimization of truss structures is a complex computational problem, and the reinforcement learning (RL) is suitable for dealing with multimodal problems without gradient computations. In this paper, a new efficient optimization algorithm called update Monte Carlo tree search (UMCTS) is developed to obtain the appropriate design for truss structures. UMCTS is an RL-based method that combines the novel update process and Monte Carlo tree search (MCTS) with the upper confidence bound (UCB). Update process means that in each round, the optimal cross-sectional area of each member is determined by search tree, and its initial state is the final state in the previous round. In the UMCTS algorithm, an accelerator for the number of selections for member area and iteration number is introduced to reduce the computation time. Moreover, for each state, the average reward is replaced by the best reward collected on the simulation process to determine the optimal solution. The proposed optim
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20223;&#23556;&#19981;&#21464;&#38598;&#25104;&#21464;&#25442;&#26041;&#27861;&#65292;&#21487;&#20197;&#25913;&#21892;&#22312;ReLU&#32593;&#32476;&#20013;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#12290;&#36890;&#36807;&#22522;&#20110;&#38598;&#21512;&#21345;&#23572;&#26364;&#28388;&#27874;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#30456;&#20114;&#20316;&#29992;&#30340;&#31890;&#23376;&#31995;&#32479;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#25910;&#25947;&#24615;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25506;&#35752;&#20102;&#36825;&#20123;&#26041;&#27861;&#29992;&#20110;&#37327;&#21270;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.04742</link><description>&lt;p&gt;
&#25913;&#36827;ReLU&#32593;&#32476;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#30340;&#20223;&#23556;&#19981;&#21464;&#38598;&#25104;&#21464;&#25442;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Affine Invariant Ensemble Transform Methods to Improve Predictive Uncertainty in ReLU Networks. (arXiv:2309.04742v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04742
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20223;&#23556;&#19981;&#21464;&#38598;&#25104;&#21464;&#25442;&#26041;&#27861;&#65292;&#21487;&#20197;&#25913;&#21892;&#22312;ReLU&#32593;&#32476;&#20013;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#12290;&#36890;&#36807;&#22522;&#20110;&#38598;&#21512;&#21345;&#23572;&#26364;&#28388;&#27874;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#30456;&#20114;&#20316;&#29992;&#30340;&#31890;&#23376;&#31995;&#32479;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#25910;&#25947;&#24615;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25506;&#35752;&#20102;&#36825;&#20123;&#26041;&#27861;&#29992;&#20110;&#37327;&#21270;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20351;&#29992;&#21512;&#36866;&#30340;&#38598;&#21512;&#21345;&#23572;&#26364;&#28388;&#27874;&#30340;&#25193;&#23637;&#36827;&#34892;&#36923;&#36753;&#22238;&#24402;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#30456;&#20114;&#20316;&#29992;&#30340;&#31890;&#23376;&#31995;&#32479;&#65292;&#20174;&#36817;&#20284;&#21518;&#39564;&#20998;&#24067;&#20013;&#37319;&#26679;&#65292;&#24182;&#35777;&#26126;&#24403;&#31890;&#23376;&#25968;&#37327;&#36235;&#20110;&#26080;&#31351;&#26102;&#65292;&#36825;&#20123;&#30456;&#20114;&#20316;&#29992;&#31890;&#23376;&#31995;&#32479;&#25910;&#25947;&#21040;&#22343;&#22330;&#26497;&#38480;&#30340;&#37327;&#21270;&#25910;&#25947;&#36895;&#29575;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24212;&#29992;&#36825;&#20123;&#25216;&#26415;&#24182;&#32771;&#23519;&#23427;&#20204;&#20316;&#20026;&#36125;&#21494;&#26031;&#36817;&#20284;&#26041;&#27861;&#22312;ReLU&#32593;&#32476;&#20013;&#37327;&#21270;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of performing Bayesian inference for logistic regression using appropriate extensions of the ensemble Kalman filter. Two interacting particle systems are proposed that sample from an approximate posterior and prove quantitative convergence rates of these interacting particle systems to their mean-field limit as the number of particles tends to infinity. Furthermore, we apply these techniques and examine their effectiveness as methods of Bayesian approximation for quantifying predictive uncertainty in ReLU networks.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#23558;&#22522;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#30340;&#36827;&#21270;&#27169;&#22411;&#19982;&#31070;&#32463;&#32593;&#32476;&#38598;&#25104;&#22312;&#19968;&#36215;&#12290;&#36825;&#20123;&#23618;&#21487;&#20197;&#23454;&#29616;&#29305;&#23450;&#30340;&#27491;&#21017;&#21270;&#30446;&#26631;&#65292;&#24182;&#36171;&#20104;&#31070;&#32463;&#32593;&#32476;&#36755;&#20986;&#19982;&#36827;&#21270;&#27169;&#22411;&#23545;&#24212;&#30340;&#29305;&#24615;&#12290;&#27492;&#22806;&#65292;&#36870;&#36827;&#21270;&#23618;&#30340;&#26500;&#24314;&#21644;&#23454;&#29616;&#30456;&#23545;&#31616;&#21333;&#65292;&#21487;&#20197;&#36731;&#26494;&#22320;&#20026;&#19981;&#21516;&#30340;&#29289;&#29702;&#36827;&#21270;&#21644;&#31070;&#32463;&#32593;&#32476;&#35774;&#35745;&#12290;</title><link>http://arxiv.org/abs/2307.07344</link><description>&lt;p&gt;
&#36870;&#36827;&#21270;&#23618;:&#29289;&#29702;&#20449;&#24687;&#21270;&#27491;&#21017;&#21270;&#22120;&#29992;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Inverse Evolution Layers: Physics-informed Regularizers for Deep Neural Networks. (arXiv:2307.07344v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07344
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#23558;&#22522;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#30340;&#36827;&#21270;&#27169;&#22411;&#19982;&#31070;&#32463;&#32593;&#32476;&#38598;&#25104;&#22312;&#19968;&#36215;&#12290;&#36825;&#20123;&#23618;&#21487;&#20197;&#23454;&#29616;&#29305;&#23450;&#30340;&#27491;&#21017;&#21270;&#30446;&#26631;&#65292;&#24182;&#36171;&#20104;&#31070;&#32463;&#32593;&#32476;&#36755;&#20986;&#19982;&#36827;&#21270;&#27169;&#22411;&#23545;&#24212;&#30340;&#29305;&#24615;&#12290;&#27492;&#22806;&#65292;&#36870;&#36827;&#21270;&#23618;&#30340;&#26500;&#24314;&#21644;&#23454;&#29616;&#30456;&#23545;&#31616;&#21333;&#65292;&#21487;&#20197;&#36731;&#26494;&#22320;&#20026;&#19981;&#21516;&#30340;&#29289;&#29702;&#36827;&#21270;&#21644;&#31070;&#32463;&#32593;&#32476;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#23558;&#22522;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#30340;&#36827;&#21270;&#27169;&#22411;&#19982;&#31070;&#32463;&#32593;&#32476;&#38598;&#25104;&#22312;&#19968;&#36215;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#36827;&#21270;&#26041;&#31243;&#30340;&#36870;&#36827;&#21270;&#23618;&#65288;IELs&#65289;&#12290;&#36825;&#20123;&#23618;&#21487;&#20197;&#23454;&#29616;&#29305;&#23450;&#30340;&#27491;&#21017;&#21270;&#30446;&#26631;&#65292;&#24182;&#36171;&#20104;&#31070;&#32463;&#32593;&#32476;&#36755;&#20986;&#19982;&#36827;&#21270;&#27169;&#22411;&#23545;&#24212;&#30340;&#29305;&#24615;&#12290;&#27492;&#22806;&#65292;&#36870;&#36827;&#21270;&#23618;&#30340;&#26500;&#24314;&#21644;&#23454;&#29616;&#30456;&#23545;&#31616;&#21333;&#65292;&#21487;&#20197;&#36731;&#26494;&#22320;&#20026;&#19981;&#21516;&#30340;&#29289;&#29702;&#36827;&#21270;&#21644;&#31070;&#32463;&#32593;&#32476;&#35774;&#35745;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#23618;&#30340;&#35774;&#35745;&#36807;&#31243;&#21487;&#20197;&#20026;&#31070;&#32463;&#32593;&#32476;&#25552;&#20379;&#30452;&#35266;&#21644;&#25968;&#23398;&#21487;&#35299;&#37322;&#24615;&#65292;&#20174;&#32780;&#22686;&#24378;&#20102;&#26041;&#27861;&#30340;&#36879;&#26126;&#24230;&#21644;&#35299;&#37322;&#24615;&#12290;&#20026;&#20102;&#35777;&#26126;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12289;&#25928;&#29575;&#21644;&#31616;&#21333;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23558;&#35821;&#20041;&#20998;&#21106;&#27169;&#22411;&#36171;&#20104;&#28909;&#25193;&#25955;&#27169;&#22411;&#24179;&#28369;&#24615;&#23646;&#24615;&#30340;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a novel approach to integrating partial differential equation (PDE)-based evolution models into neural networks through a new type of regularization. Specifically, we propose inverse evolution layers (IELs) based on evolution equations. These layers can achieve specific regularization objectives and endow neural networks' outputs with corresponding properties of the evolution models. Moreover, IELs are straightforward to construct and implement, and can be easily designed for various physical evolutions and neural networks. Additionally, the design process for these layers can provide neural networks with intuitive and mathematical interpretability, thus enhancing the transparency and explainability of the approach. To demonstrate the effectiveness, efficiency, and simplicity of our approach, we present an example of endowing semantic segmentation models with the smoothness property based on the heat diffusion model. To achieve this goal, we design heat-diffusion IE
&lt;/p&gt;</description></item></channel></rss>