<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;L&#233;vyGAN&#65292;&#29992;&#20110;&#29983;&#25104;&#26465;&#20214;&#20110;&#24067;&#26391;&#22686;&#37327;&#30340;L&#233;vy&#21306;&#22495;&#30340;&#36817;&#20284;&#26679;&#26412;&#12290;&#36890;&#36807;&#8220;&#26725;&#32763;&#36716;&#8221;&#25805;&#20316;&#65292;&#36755;&#20986;&#30340;&#26679;&#26412;&#21487;&#20197;&#31934;&#30830;&#21305;&#37197;&#25152;&#26377;&#22855;&#25968;&#38454;&#30697;&#65292;&#35299;&#20915;&#20102;&#38750;&#39640;&#26031;&#24615;&#36136;&#19979;&#30340;&#25277;&#26679;&#22256;&#38590;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.02452</link><description>&lt;p&gt;
&#23545;&#39640;&#38454;SDE&#27169;&#25311;&#30340;L&#233;vy&#21306;&#22495;&#36827;&#34892;&#29983;&#25104;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Generative Modelling of L\'{e}vy Area for High Order SDE Simulation. (arXiv:2308.02452v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02452
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;L&#233;vyGAN&#65292;&#29992;&#20110;&#29983;&#25104;&#26465;&#20214;&#20110;&#24067;&#26391;&#22686;&#37327;&#30340;L&#233;vy&#21306;&#22495;&#30340;&#36817;&#20284;&#26679;&#26412;&#12290;&#36890;&#36807;&#8220;&#26725;&#32763;&#36716;&#8221;&#25805;&#20316;&#65292;&#36755;&#20986;&#30340;&#26679;&#26412;&#21487;&#20197;&#31934;&#30830;&#21305;&#37197;&#25152;&#26377;&#22855;&#25968;&#38454;&#30697;&#65292;&#35299;&#20915;&#20102;&#38750;&#39640;&#26031;&#24615;&#36136;&#19979;&#30340;&#25277;&#26679;&#22256;&#38590;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20247;&#25152;&#21608;&#30693;&#65292;&#24403;&#25968;&#20540;&#27169;&#25311;SDE&#30340;&#35299;&#26102;&#65292;&#35201;&#23454;&#29616;&#24378;&#25910;&#25947;&#36895;&#29575;&#36229;&#36807;O(\sqrt{h})&#65288;&#20854;&#20013;h&#20026;&#27493;&#38271;&#65289;&#65292;&#38656;&#35201;&#20351;&#29992;&#26576;&#20123;&#24067;&#26391;&#36816;&#21160;&#30340;&#36845;&#20195;&#31215;&#20998;&#65292;&#36890;&#24120;&#31216;&#20026;&#20854;&#8220;L&#233;vy&#21306;&#22495;&#8221;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20854;&#38750;&#39640;&#26031;&#24615;&#36136;&#65292;&#23545;&#20110;d&#32500;&#24067;&#26391;&#36816;&#21160;&#65288;d&gt;2&#65289;&#65292;&#30446;&#21069;&#27809;&#26377;&#24555;&#36895;&#36817;&#20284;&#25277;&#26679;&#31639;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;L&#233;vyGAN&#65292;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#29983;&#25104;&#26465;&#20214;&#20110;&#24067;&#26391;&#22686;&#37327;&#30340;L&#233;vy&#21306;&#22495;&#30340;&#36817;&#20284;&#26679;&#26412;&#12290;&#36890;&#36807;&#8220;&#26725;&#32763;&#36716;&#8221;&#25805;&#20316;&#65292;&#36755;&#20986;&#30340;&#26679;&#26412;&#21487;&#20197;&#31934;&#30830;&#21305;&#37197;&#25152;&#26377;&#22855;&#25968;&#38454;&#30697;&#12290;&#25105;&#20204;&#30340;&#29983;&#25104;&#22120;&#37319;&#29992;&#32463;&#36807;&#37327;&#36523;&#23450;&#21046;&#30340;GNN-inspired&#26550;&#26500;&#65292;&#24378;&#21046;&#36755;&#20986;&#20998;&#24067;&#19982;&#26465;&#20214;&#21464;&#37327;&#20043;&#38388;&#30340;&#27491;&#30830;&#20381;&#36182;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#32467;&#21512;&#20102;&#22522;&#20110;&#29305;&#24449;&#20989;&#25968;&#30340;&#25968;&#23398;&#21407;&#29702;&#30340;&#21028;&#21035;&#24615;&#24402;&#19968;&#21270;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
It is well known that, when numerically simulating solutions to SDEs, achieving a strong convergence rate better than O(\sqrt{h}) (where h is the step size) requires the use of certain iterated integrals of Brownian motion, commonly referred to as its "L\'{e}vy areas". However, these stochastic integrals are difficult to simulate due to their non-Gaussian nature and for a d-dimensional Brownian motion with d &gt; 2, no fast almost-exact sampling algorithm is known.  In this paper, we propose L\'{e}vyGAN, a deep-learning-based model for generating approximate samples of L\'{e}vy area conditional on a Brownian increment. Due to our "Bridge-flipping" operation, the output samples match all joint and conditional odd moments exactly. Our generator employs a tailored GNN-inspired architecture, which enforces the correct dependency structure between the output distribution and the conditioning variable. Furthermore, we incorporate a mathematically principled characteristic-function based discrim
&lt;/p&gt;</description></item></channel></rss>