<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#36951;&#20256;&#35268;&#21010;&#26041;&#27861;&#25552;&#20986;&#20102;&#29992;&#20110;&#21487;&#35299;&#37322;&#27969;&#24418;&#23398;&#20064;&#30340;&#26032;&#26041;&#27861;&#65292;&#24110;&#21161;&#35299;&#20915;&#24403;&#21069;&#27969;&#24418;&#23398;&#20064;&#20013;&#21151;&#33021;&#26144;&#23556;&#19981;&#26126;&#30830;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.14139</link><description>&lt;p&gt;
&#29992;&#20110;&#21487;&#35299;&#37322;&#27969;&#24418;&#23398;&#20064;&#30340;&#36951;&#20256;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Genetic Programming for Explainable Manifold Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14139
&lt;/p&gt;
&lt;p&gt;
&#36951;&#20256;&#35268;&#21010;&#26041;&#27861;&#25552;&#20986;&#20102;&#29992;&#20110;&#21487;&#35299;&#37322;&#27969;&#24418;&#23398;&#20064;&#30340;&#26032;&#26041;&#27861;&#65292;&#24110;&#21161;&#35299;&#20915;&#24403;&#21069;&#27969;&#24418;&#23398;&#20064;&#20013;&#21151;&#33021;&#26144;&#23556;&#19981;&#26126;&#30830;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#24418;&#23398;&#20064;&#25216;&#26415;&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#21457;&#25381;&#30528;&#20851;&#38190;&#20316;&#29992;&#65292;&#36890;&#36807;&#25581;&#31034;&#39640;&#32500;&#25968;&#25454;&#20013;&#30340;&#20302;&#32500;&#23884;&#20837;&#65292;&#20174;&#32780;&#23558;&#25968;&#25454;&#36716;&#25442;&#20026;&#26356;&#20302;&#32500;&#30340;&#34920;&#31034;&#24418;&#24335;&#65292;&#25552;&#39640;&#20102;&#25968;&#25454;&#20998;&#26512;&#30340;&#25928;&#29575;&#21644;&#21487;&#35299;&#37322;&#24615;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#27969;&#24418;&#23398;&#20064;&#26041;&#27861;&#30340;&#19968;&#20010;&#26174;&#33879;&#25361;&#25112;&#26159;&#23427;&#20204;&#32570;&#20047;&#26126;&#30830;&#30340;&#21151;&#33021;&#26144;&#23556;&#65292;&#22312;&#35768;&#22810;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#35299;&#37322;&#24615;&#33267;&#20851;&#37325;&#35201;&#12290;&#36951;&#20256;&#35268;&#21010;&#20197;&#20854;&#21487;&#35299;&#37322;&#30340;&#22522;&#20110;&#21151;&#33021;&#26641;&#30340;&#27169;&#22411;&#32780;&#38395;&#21517;&#65292;&#24050;&#25104;&#20026;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#30340;&#19968;&#31181;&#26377;&#24076;&#26395;&#30340;&#26041;&#27861;&#12290;&#20808;&#21069;&#30340;&#30740;&#31350;&#21033;&#29992;&#22810;&#30446;&#26631;&#36951;&#20256;&#35268;&#21010;&#26469;&#24179;&#34913;&#27969;&#24418;&#36136;&#37327;&#19982;&#23884;&#20837;&#32500;&#24230;&#65292;&#20135;&#29983;&#20102;&#19968;&#31995;&#21015;&#23884;&#20837;&#22823;&#23567;&#19979;&#30340;&#21151;&#33021;&#26144;&#23556;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26144;&#23556;&#26641;&#32463;&#24120;&#21464;&#24471;&#22797;&#26434;&#65292;&#38459;&#30861;&#20102;&#35299;&#37322;&#24615;&#12290;&#20316;&#20026;&#22238;&#24212;&#65292;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#29992;&#20110;&#21487;&#35299;&#37322;&#27969;&#24418;&#23398;&#20064;&#30340;&#36951;&#20256;&#35268;&#21010;&#65288;GP-EMaL&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14139v1 Announce Type: cross  Abstract: Manifold learning techniques play a pivotal role in machine learning by revealing lower-dimensional embeddings within high-dimensional data, thus enhancing both the efficiency and interpretability of data analysis by transforming the data into a lower-dimensional representation. However, a notable challenge with current manifold learning methods is their lack of explicit functional mappings, crucial for explainability in many real-world applications. Genetic programming, known for its interpretable functional tree-based models, has emerged as a promising approach to address this challenge. Previous research leveraged multi-objective GP to balance manifold quality against embedding dimensionality, producing functional mappings across a range of embedding sizes. Yet, these mapping trees often became complex, hindering explainability. In response, in this paper, we introduce Genetic Programming for Explainable Manifold Learning (GP-EMaL),
&lt;/p&gt;</description></item></channel></rss>