<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>HAMLET&#26159;&#19968;&#20010;&#22270;&#21464;&#25442;&#31070;&#32463;&#31639;&#23376;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#27169;&#22359;&#21270;&#36755;&#20837;&#32534;&#30721;&#22120;&#23558;&#24494;&#20998;&#26041;&#31243;&#20449;&#24687;&#30452;&#25509;&#34701;&#20837;&#35299;&#20915;&#36807;&#31243;&#20013;&#65292;&#24182;&#23637;&#31034;&#20986;&#22312;&#22788;&#29702;&#22797;&#26434;&#25968;&#25454;&#21644;&#22122;&#22768;&#26041;&#38754;&#30340;&#40065;&#26834;&#24615;&#65292;&#36866;&#29992;&#20110;&#20219;&#24847;&#20960;&#20309;&#24418;&#29366;&#21644;&#21508;&#31181;&#36755;&#20837;&#26684;&#24335;&#30340;PDE&#38382;&#39064;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;HAMLET&#33021;&#22815;&#36229;&#36234;&#24403;&#21069;&#30340;PDE&#25216;&#26415;&#12290;</title><link>https://arxiv.org/abs/2402.03541</link><description>&lt;p&gt;
HAMLET&#65306;&#29992;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#22270;&#21464;&#25442;&#31070;&#32463;&#31639;&#23376;
&lt;/p&gt;
&lt;p&gt;
HAMLET: Graph Transformer Neural Operator for Partial Differential Equations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03541
&lt;/p&gt;
&lt;p&gt;
HAMLET&#26159;&#19968;&#20010;&#22270;&#21464;&#25442;&#31070;&#32463;&#31639;&#23376;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#27169;&#22359;&#21270;&#36755;&#20837;&#32534;&#30721;&#22120;&#23558;&#24494;&#20998;&#26041;&#31243;&#20449;&#24687;&#30452;&#25509;&#34701;&#20837;&#35299;&#20915;&#36807;&#31243;&#20013;&#65292;&#24182;&#23637;&#31034;&#20986;&#22312;&#22788;&#29702;&#22797;&#26434;&#25968;&#25454;&#21644;&#22122;&#22768;&#26041;&#38754;&#30340;&#40065;&#26834;&#24615;&#65292;&#36866;&#29992;&#20110;&#20219;&#24847;&#20960;&#20309;&#24418;&#29366;&#21644;&#21508;&#31181;&#36755;&#20837;&#26684;&#24335;&#30340;PDE&#38382;&#39064;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;HAMLET&#33021;&#22815;&#36229;&#36234;&#24403;&#21069;&#30340;PDE&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#21464;&#25442;&#26694;&#26550;HAMLET&#65292;&#26088;&#22312;&#35299;&#20915;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#27714;&#35299;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#26102;&#30340;&#25361;&#25112;&#12290;&#35813;&#26694;&#26550;&#20351;&#29992;&#20855;&#26377;&#27169;&#22359;&#21270;&#36755;&#20837;&#32534;&#30721;&#22120;&#30340;&#22270;&#21464;&#25442;&#22120;&#65292;&#23558;&#24494;&#20998;&#26041;&#31243;&#20449;&#24687;&#30452;&#25509;&#34701;&#20837;&#35299;&#20915;&#36807;&#31243;&#20013;&#12290;&#36825;&#31181;&#27169;&#22359;&#21270;&#22686;&#24378;&#20102;&#21442;&#25968;&#23545;&#24212;&#25511;&#21046;&#65292;&#20351;&#24471;HAMLET&#33021;&#22815;&#36866;&#24212;&#20219;&#24847;&#20960;&#20309;&#24418;&#29366;&#21644;&#21508;&#31181;&#36755;&#20837;&#26684;&#24335;&#30340;PDE&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;HAMLET&#33021;&#22815;&#26377;&#25928;&#25193;&#23637;&#21040;&#22788;&#29702;&#22797;&#26434;&#25968;&#25454;&#21644;&#22122;&#22768;&#65292;&#23637;&#31034;&#20986;&#20854;&#40065;&#26834;&#24615;&#12290;HAMLET&#19981;&#20165;&#36866;&#29992;&#20110;&#21333;&#19968;&#31867;&#22411;&#30340;&#29289;&#29702;&#27169;&#25311;&#65292;&#36824;&#21487;&#20197;&#24212;&#29992;&#20110;&#21508;&#20010;&#39046;&#22495;&#12290;&#27492;&#22806;&#65292;&#23427;&#25552;&#21319;&#20102;&#27169;&#22411;&#30340;&#24377;&#24615;&#21644;&#24615;&#33021;&#65292;&#29305;&#21035;&#26159;&#22312;&#25968;&#25454;&#26377;&#38480;&#30340;&#22330;&#26223;&#19979;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26694;&#26550;&#33021;&#22815;&#36229;&#36234;&#24403;&#21069;&#30340;PDE&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a novel graph transformer framework, HAMLET, designed to address the challenges in solving partial differential equations (PDEs) using neural networks. The framework uses graph transformers with modular input encoders to directly incorporate differential equation information into the solution process. This modularity enhances parameter correspondence control, making HAMLET adaptable to PDEs of arbitrary geometries and varied input formats. Notably, HAMLET scales effectively with increasing data complexity and noise, showcasing its robustness. HAMLET is not just tailored to a single type of physical simulation, but can be applied across various domains. Moreover, it boosts model resilience and performance, especially in scenarios with limited data. We demonstrate, through extensive experiments, that our framework is capable of outperforming current techniques for PDEs.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#38543;&#26426;&#30697;&#38453;&#35745;&#31639;&#30340;&#39640;&#25928;&#35823;&#24046;&#21644;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#24110;&#21161;&#35780;&#20272;&#36755;&#20986;&#36136;&#37327;&#24182;&#25351;&#23548;&#31639;&#27861;&#21442;&#25968;&#36873;&#25321;&#12290;</title><link>https://arxiv.org/abs/2207.06342</link><description>&lt;p&gt;
&#38024;&#23545;&#38543;&#26426;&#30697;&#38453;&#35745;&#31639;&#30340;&#39640;&#25928;&#35823;&#24046;&#21644;&#26041;&#24046;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Efficient error and variance estimation for randomized matrix computations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2207.06342
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#38543;&#26426;&#30697;&#38453;&#35745;&#31639;&#30340;&#39640;&#25928;&#35823;&#24046;&#21644;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#24110;&#21161;&#35780;&#20272;&#36755;&#20986;&#36136;&#37327;&#24182;&#25351;&#23548;&#31639;&#27861;&#21442;&#25968;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#30697;&#38453;&#31639;&#27861;&#24050;&#25104;&#20026;&#31185;&#23398;&#35745;&#31639;&#21644;&#26426;&#22120;&#23398;&#20064;&#20013;&#24517;&#19981;&#21487;&#23569;&#30340;&#24037;&#20855;&#12290;&#20026;&#20102;&#23433;&#20840;&#22320;&#22312;&#24212;&#29992;&#20013;&#20351;&#29992;&#36825;&#20123;&#31639;&#27861;&#65292;&#38656;&#35201;&#32467;&#21512;&#21518;&#39564;&#35823;&#24046;&#20272;&#35745;&#26469;&#35780;&#20272;&#36755;&#20986;&#30340;&#36136;&#37327;&#12290;&#20026;&#28385;&#36275;&#36825;&#19968;&#38656;&#27714;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#35786;&#26029;&#26041;&#27861;&#65306;&#29992;&#20110;&#38543;&#26426;&#20302;&#31209;&#36924;&#36817;&#30340;&#30041;&#19968;&#27861;&#35823;&#24046;&#20272;&#35745;&#22120;&#21644;&#19968;&#31181;&#26480;&#22522;&#20992;&#37325;&#37319;&#26679;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#38543;&#26426;&#30697;&#38453;&#35745;&#31639;&#30340;&#36755;&#20986;&#26041;&#24046;&#12290;&#36825;&#20004;&#31181;&#35786;&#26029;&#26041;&#27861;&#23545;&#20110;&#38543;&#26426;&#20302;&#31209;&#36924;&#36817;&#31639;&#27861;&#65288;&#22914;&#38543;&#26426;&#22855;&#24322;&#20540;&#20998;&#35299;&#21644;&#38543;&#26426;Nystrom&#36924;&#36817;&#65289;&#35745;&#31639;&#36805;&#36895;&#65292;&#24182;&#25552;&#20379;&#21487;&#29992;&#20110;&#35780;&#20272;&#35745;&#31639;&#36755;&#20986;&#36136;&#37327;&#21644;&#25351;&#23548;&#31639;&#27861;&#21442;&#25968;&#36873;&#25321;&#30340;&#26377;&#29992;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2207.06342v4 Announce Type: replace-cross  Abstract: Randomized matrix algorithms have become workhorse tools in scientific computing and machine learning. To use these algorithms safely in applications, they should be coupled with posterior error estimates to assess the quality of the output. To meet this need, this paper proposes two diagnostics: a leave-one-out error estimator for randomized low-rank approximations and a jackknife resampling method to estimate the variance of the output of a randomized matrix computation. Both of these diagnostics are rapid to compute for randomized low-rank approximation algorithms such as the randomized SVD and randomized Nystr\"om approximation, and they provide useful information that can be used to assess the quality of the computed output and guide algorithmic parameter choices.
&lt;/p&gt;</description></item></channel></rss>