<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#30456;&#20301;&#21464;&#21270;&#35782;&#21035;&#27169;&#24335;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#39564;&#35777;&#25163;&#24037;&#21046;&#20316;&#30340;&#25391;&#33633;&#27169;&#22411;&#35777;&#23454;&#20102;&#36825;&#19968;&#35299;&#37322;&#12290;&#35813;&#30740;&#31350;&#19981;&#20165;&#25552;&#20379;&#20102;&#19968;&#31181;&#28508;&#22312;&#30340;&#21160;&#21147;&#23398;&#26426;&#21046;&#29992;&#20110;&#27169;&#24335;&#35782;&#21035;&#65292;&#36824;&#26263;&#31034;&#20102;&#26377;&#38480;&#29366;&#24577;&#33258;&#21160;&#26426;&#30340;&#31070;&#32463;&#23454;&#29616;&#26041;&#24335;&#65292;&#24182;&#19988;&#23545;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#21487;&#35299;&#37322;&#24615;&#36827;&#34892;&#20102;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2310.07908</link><description>&lt;p&gt;
&#24490;&#29615;&#32593;&#32476;&#36890;&#36807;&#20302;&#32500;&#25391;&#33633;&#35782;&#21035;&#27169;&#24335;
&lt;/p&gt;
&lt;p&gt;
Recurrent networks recognize patterns with low-dimensional oscillations. (arXiv:2310.07908v1 [q-bio.NC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07908
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#30456;&#20301;&#21464;&#21270;&#35782;&#21035;&#27169;&#24335;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#39564;&#35777;&#25163;&#24037;&#21046;&#20316;&#30340;&#25391;&#33633;&#27169;&#22411;&#35777;&#23454;&#20102;&#36825;&#19968;&#35299;&#37322;&#12290;&#35813;&#30740;&#31350;&#19981;&#20165;&#25552;&#20379;&#20102;&#19968;&#31181;&#28508;&#22312;&#30340;&#21160;&#21147;&#23398;&#26426;&#21046;&#29992;&#20110;&#27169;&#24335;&#35782;&#21035;&#65292;&#36824;&#26263;&#31034;&#20102;&#26377;&#38480;&#29366;&#24577;&#33258;&#21160;&#26426;&#30340;&#31070;&#32463;&#23454;&#29616;&#26041;&#24335;&#65292;&#24182;&#19988;&#23545;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#21487;&#35299;&#37322;&#24615;&#36827;&#34892;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#35299;&#37322;&#22312;SET&#21345;&#29260;&#28216;&#25103;&#21551;&#21457;&#19979;&#36827;&#34892;&#35757;&#32451;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;(RNN)&#22312;&#31616;&#21333;&#20219;&#21153;&#19978;&#30340;&#21160;&#21147;&#23398;&#26426;&#21046;&#26469;&#35782;&#21035;&#27169;&#24335;&#12290;&#25105;&#20204;&#23558;&#35757;&#32451;&#21518;&#30340;RNN&#35299;&#37322;&#20026;&#36890;&#36807;&#20302;&#32500;&#26497;&#38480;&#29615;&#20013;&#30340;&#30456;&#20301;&#21464;&#21270;&#36827;&#34892;&#27169;&#24335;&#35782;&#21035;&#65292;&#31867;&#20284;&#20110;&#26377;&#38480;&#29366;&#24577;&#33258;&#21160;&#26426;(FSA)&#20013;&#30340;&#36716;&#25442;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#36890;&#36807;&#25163;&#24037;&#21046;&#20316;&#19968;&#20010;&#31616;&#21333;&#30340;&#25391;&#33633;&#27169;&#22411;&#26469;&#39564;&#35777;&#20102;&#36825;&#19968;&#35299;&#37322;&#65292;&#35813;&#27169;&#22411;&#22797;&#21046;&#20102;&#35757;&#32451;&#21518;&#30340;RNN&#30340;&#21160;&#21147;&#23398;&#29305;&#24615;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#19981;&#20165;&#26263;&#31034;&#20102;&#19968;&#31181;&#28508;&#22312;&#30340;&#21160;&#21147;&#23398;&#26426;&#21046;&#33021;&#22815;&#23454;&#29616;&#27169;&#24335;&#35782;&#21035;&#65292;&#36824;&#26263;&#31034;&#20102;&#19968;&#31181;&#26377;&#38480;&#29366;&#24577;&#33258;&#21160;&#26426;&#30340;&#28508;&#22312;&#31070;&#32463;&#23454;&#29616;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#36825;&#39033;&#24037;&#20316;&#26377;&#21161;&#20110;&#20851;&#20110;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#21487;&#35299;&#37322;&#24615;&#30340;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study proposes a novel dynamical mechanism for pattern recognition discovered by interpreting a recurrent neural network (RNN) trained on a simple task inspired by the SET card game. We interpreted the trained RNN as recognizing patterns via phase shifts in a low-dimensional limit cycle in a manner analogous to transitions in a finite state automaton (FSA). We further validated this interpretation by handcrafting a simple oscillatory model that reproduces the dynamics of the trained RNN. Our findings not only suggest of a potential dynamical mechanism capable of pattern recognition, but also suggest of a potential neural implementation of FSA. Above all, this work contributes to the growing discourse on deep learning model interpretability.
&lt;/p&gt;</description></item></channel></rss>