<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21551;&#21457;&#24335;&#20840;&#23616;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;UMCTS&#65289;&#29992;&#20110;&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#32467;&#21512;&#26356;&#26032;&#36807;&#31243;&#21644;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;MCTS&#65289;&#20197;&#21450;&#20351;&#29992;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#26469;&#33719;&#24471;&#21512;&#36866;&#30340;&#35774;&#35745;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2309.06045</link><description>&lt;p&gt;
&#22522;&#20110;&#21551;&#21457;&#24335;&#20840;&#23616;&#25628;&#32034;&#30340;&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#38382;&#39064;&#30340;&#25913;&#36827;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;UMCTS&#65289;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Update Monte Carlo tree search (UMCTS) algorithm for heuristic global search of sizing optimization problems for truss structures. (arXiv:2309.06045v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06045
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21551;&#21457;&#24335;&#20840;&#23616;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;UMCTS&#65289;&#29992;&#20110;&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#38382;&#39064;&#65292;&#36890;&#36807;&#32467;&#21512;&#26356;&#26032;&#36807;&#31243;&#21644;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;MCTS&#65289;&#20197;&#21450;&#20351;&#29992;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#26469;&#33719;&#24471;&#21512;&#36866;&#30340;&#35774;&#35745;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26689;&#26550;&#32467;&#26500;&#23610;&#23544;&#20248;&#21270;&#26159;&#19968;&#20010;&#22797;&#26434;&#30340;&#35745;&#31639;&#38382;&#39064;&#65292;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#36866;&#29992;&#20110;&#22788;&#29702;&#26080;&#26799;&#24230;&#35745;&#31639;&#30340;&#22810;&#27169;&#24577;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39640;&#25928;&#20248;&#21270;&#31639;&#27861;&#8212;&#8212;&#26356;&#26032;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;UMCTS&#65289;&#65292;&#29992;&#20110;&#33719;&#24471;&#21512;&#36866;&#30340;&#26689;&#26550;&#32467;&#26500;&#35774;&#35745;&#12290;UMCTS&#26159;&#19968;&#31181;&#22522;&#20110;RL&#30340;&#26041;&#27861;&#65292;&#23558;&#26032;&#39062;&#30340;&#26356;&#26032;&#36807;&#31243;&#21644;&#33945;&#29305;&#21345;&#27931;&#26641;&#25628;&#32034;&#65288;MCTS&#65289;&#19982;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#30456;&#32467;&#21512;&#12290;&#26356;&#26032;&#36807;&#31243;&#24847;&#21619;&#30528;&#22312;&#27599;&#19968;&#36718;&#20013;&#65292;&#27599;&#20010;&#26500;&#20214;&#30340;&#26368;&#20339;&#25130;&#38754;&#31215;&#36890;&#36807;&#25628;&#32034;&#26641;&#30830;&#23450;&#65292;&#20854;&#21021;&#22987;&#29366;&#24577;&#26159;&#19978;&#19968;&#36718;&#30340;&#26368;&#32456;&#29366;&#24577;&#12290;&#22312;UMCTS&#31639;&#27861;&#20013;&#65292;&#24341;&#20837;&#20102;&#21152;&#36895;&#36873;&#25321;&#25104;&#21592;&#38754;&#31215;&#21644;&#36845;&#20195;&#27425;&#25968;&#30340;&#21152;&#36895;&#22120;&#65292;&#20197;&#20943;&#23569;&#35745;&#31639;&#26102;&#38388;&#12290;&#27492;&#22806;&#65292;&#23545;&#20110;&#27599;&#20010;&#29366;&#24577;&#65292;&#24179;&#22343;&#22870;&#21169;&#34987;&#26368;&#20339;&#22870;&#21169;&#30340;&#27169;&#25311;&#36807;&#31243;&#20013;&#25910;&#38598;&#26469;&#30340;&#22870;&#21169;&#26367;&#20195;&#65292;&#30830;&#23450;&#26368;&#20248;&#35299;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20248;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#26356;&#26032;&#36807;&#31243;&#21644;MCTS&#65292;&#20197;&#21450;&#20351;&#29992;UCB&#26469;&#20248;&#21270;&#26689;&#26550;&#32467;&#26500;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sizing optimization of truss structures is a complex computational problem, and the reinforcement learning (RL) is suitable for dealing with multimodal problems without gradient computations. In this paper, a new efficient optimization algorithm called update Monte Carlo tree search (UMCTS) is developed to obtain the appropriate design for truss structures. UMCTS is an RL-based method that combines the novel update process and Monte Carlo tree search (MCTS) with the upper confidence bound (UCB). Update process means that in each round, the optimal cross-sectional area of each member is determined by search tree, and its initial state is the final state in the previous round. In the UMCTS algorithm, an accelerator for the number of selections for member area and iteration number is introduced to reduce the computation time. Moreover, for each state, the average reward is replaced by the best reward collected on the simulation process to determine the optimal solution. The proposed optim
&lt;/p&gt;</description></item></channel></rss>