<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#32852;&#37030;&#23398;&#20064;&#26159;&#19968;&#31181;&#26032;&#20852;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23427;&#21487;&#20197;&#22312;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#23454;&#29616;&#25968;&#25454;&#33719;&#21462;&#21644;&#35745;&#31639;&#30340;&#20998;&#31163;&#65292;&#23545;&#20110;&#26410;&#26469;&#30340;&#31227;&#21160;&#32593;&#32476;&#23588;&#20854;&#26159;6G&#21450;&#20197;&#21518;&#20855;&#26377;&#37325;&#35201;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2308.04404</link><description>&lt;p&gt;
&#29992;&#32852;&#37030;&#23398;&#20064;&#38761;&#26032;&#26080;&#32447;&#32593;&#32476;&#65306;&#19968;&#39033;&#32508;&#21512;&#35780;&#36848;
&lt;/p&gt;
&lt;p&gt;
Revolutionizing Wireless Networks with Federated Learning: A Comprehensive Review. (arXiv:2308.04404v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04404
&lt;/p&gt;
&lt;p&gt;
&#32852;&#37030;&#23398;&#20064;&#26159;&#19968;&#31181;&#26032;&#20852;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23427;&#21487;&#20197;&#22312;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#23454;&#29616;&#25968;&#25454;&#33719;&#21462;&#21644;&#35745;&#31639;&#30340;&#20998;&#31163;&#65292;&#23545;&#20110;&#26410;&#26469;&#30340;&#31227;&#21160;&#32593;&#32476;&#23588;&#20854;&#26159;6G&#21450;&#20197;&#21518;&#20855;&#26377;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#26234;&#33021;&#25163;&#26426;&#12289;&#24179;&#26495;&#30005;&#33041;&#21644;&#36710;&#36742;&#31561;&#26080;&#32447;&#29992;&#25143;&#35774;&#22791;&#30340;&#35745;&#31639;&#33021;&#21147;&#19981;&#26029;&#25552;&#39640;&#65292;&#20197;&#21450;&#23545;&#20849;&#20139;&#31169;&#20154;&#25968;&#25454;&#30340;&#26085;&#30410;&#20851;&#27880;&#65292;&#19968;&#31181;&#21517;&#20026;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#30340;&#26032;&#22411;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#24050;&#32463;&#20986;&#29616;&#12290;FL&#20351;&#24471;&#25968;&#25454;&#33719;&#21462;&#21644;&#35745;&#31639;&#22312;&#20013;&#22830;&#21333;&#20803;&#20013;&#20998;&#31163;&#65292;&#36825;&#19982;&#22312;&#25968;&#25454;&#20013;&#24515;&#20013;&#36827;&#34892;&#30340;&#38598;&#20013;&#24335;&#23398;&#20064;&#19981;&#21516;&#12290;FL&#36890;&#24120;&#29992;&#20110;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#65292;&#20854;&#20013;&#36890;&#20449;&#36164;&#28304;&#26377;&#38480;&#19988;&#19981;&#21487;&#38752;&#12290;&#24102;&#23485;&#38480;&#21046;&#35201;&#27714;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#20165;&#23433;&#25490;&#37096;&#20998;&#29992;&#25143;&#35774;&#22791;&#36827;&#34892;&#26356;&#26032;&#65292;&#24182;&#19988;&#30001;&#20110;&#26080;&#32447;&#20171;&#36136;&#26159;&#20849;&#20139;&#30340;&#65292;&#20256;&#36755;&#26131;&#21463;&#24178;&#25200;&#19988;&#19981;&#20445;&#35777;&#12290;&#26412;&#25991;&#35752;&#35770;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#26080;&#32447;&#36890;&#20449;&#20013;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#24378;&#35843;&#20102;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#20316;&#20026;&#19968;&#31181;&#26032;&#39062;&#26041;&#27861;&#65292;&#22312;&#26410;&#26469;&#30340;&#31227;&#21160;&#32593;&#32476;&#20013;&#29305;&#21035;&#26159;6G&#21450;&#20197;&#21518;&#25198;&#28436;&#37325;&#35201;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
These days with the rising computational capabilities of wireless user equipment such as smart phones, tablets, and vehicles, along with growing concerns about sharing private data, a novel machine learning model called federated learning (FL) has emerged. FL enables the separation of data acquisition and computation at the central unit, which is different from centralized learning that occurs in a data center. FL is typically used in a wireless edge network where communication resources are limited and unreliable. Bandwidth constraints necessitate scheduling only a subset of UEs for updates in each iteration, and because the wireless medium is shared, transmissions are susceptible to interference and are not assured. The article discusses the significance of Machine Learning in wireless communication and highlights Federated Learning (FL) as a novel approach that could play a vital role in future mobile networks, particularly 6G and beyond.
&lt;/p&gt;</description></item></channel></rss>