<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#38598;&#25104;&#24863;&#30693;&#21644;&#36890;&#20449;&#31995;&#32479;&#20013;&#23558;&#38647;&#36798;&#30446;&#26631;&#19982;&#36890;&#20449;&#29992;&#25143;&#35774;&#22791;&#36827;&#34892;&#20851;&#32852;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23545;&#38647;&#36798;&#25968;&#25454;&#36827;&#34892;&#22788;&#29702;&#65292;&#23454;&#29616;&#20102;&#32852;&#21512;&#22810;&#30446;&#26631;&#26816;&#27979;&#21644;&#27874;&#26463;&#25512;&#29702;&#12290;&#36825;&#19968;&#26041;&#27861;&#22312;&#20027;&#21160;&#20999;&#25442;&#21644;&#27874;&#26463;&#39044;&#27979;&#31561;&#36890;&#20449;&#20219;&#21153;&#20013;&#20855;&#26377;&#28508;&#22312;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2401.12801</link><description>&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#22312;&#38598;&#25104;&#24863;&#30693;&#19982;&#36890;&#20449;&#31995;&#32479;&#20013;&#22522;&#20110;&#30446;&#26631;&#21040;&#29992;&#25143;&#20851;&#32852;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Deep Learning-based Target-To-User Association in Integrated Sensing and Communication Systems. (arXiv:2401.12801v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12801
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#38598;&#25104;&#24863;&#30693;&#21644;&#36890;&#20449;&#31995;&#32479;&#20013;&#23558;&#38647;&#36798;&#30446;&#26631;&#19982;&#36890;&#20449;&#29992;&#25143;&#35774;&#22791;&#36827;&#34892;&#20851;&#32852;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23545;&#38647;&#36798;&#25968;&#25454;&#36827;&#34892;&#22788;&#29702;&#65292;&#23454;&#29616;&#20102;&#32852;&#21512;&#22810;&#30446;&#26631;&#26816;&#27979;&#21644;&#27874;&#26463;&#25512;&#29702;&#12290;&#36825;&#19968;&#26041;&#27861;&#22312;&#20027;&#21160;&#20999;&#25442;&#21644;&#27874;&#26463;&#39044;&#27979;&#31561;&#36890;&#20449;&#20219;&#21153;&#20013;&#20855;&#26377;&#28508;&#22312;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38598;&#25104;&#24863;&#30693;&#19982;&#36890;&#20449;&#65288;ISAC&#65289;&#31995;&#32479;&#20013;&#65292;&#23558;&#38647;&#36798;&#30446;&#26631;&#19982;&#36890;&#20449;&#29992;&#25143;&#35774;&#22791;&#65288;UEs&#65289;&#36827;&#34892;&#21305;&#37197;&#23545;&#20110;&#20960;&#31181;&#36890;&#20449;&#20219;&#21153;&#26159;&#26377;&#24847;&#20041;&#30340;&#65292;&#22914;&#20027;&#21160;&#20999;&#25442;&#21644;&#27874;&#26463;&#39044;&#27979;&#12290;&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#20010;&#38647;&#36798;&#36741;&#21161;&#36890;&#20449;&#31995;&#32479;&#65292;&#19968;&#20010;&#22522;&#31449;&#65288;BS&#65289;&#37197;&#22791;&#26377;&#22810;&#36755;&#20837;&#22810;&#36755;&#20986;&#65288;MIMO&#65289;&#38647;&#36798;&#65292;&#38647;&#36798;&#20855;&#26377;&#21452;&#37325;&#30446;&#26631;&#65306;&#65288;i&#65289;&#23558;&#36710;&#36742;&#38647;&#36798;&#30446;&#26631;&#19982;&#36890;&#20449;&#27874;&#26463;&#31354;&#38388;&#20013;&#30340;&#36710;&#36742;&#35774;&#22791;&#65288;VEs&#65289;&#20851;&#32852;&#36215;&#26469;&#65292;&#65288;ii&#65289;&#26681;&#25454;&#38647;&#36798;&#25968;&#25454;&#39044;&#27979;&#27599;&#20010;VE&#30340;&#27874;&#26463;&#24418;&#25104;&#30690;&#37327;&#12290;&#25552;&#20986;&#30340;&#30446;&#26631;&#21040;&#29992;&#25143;&#65288;T2U&#65289;&#20851;&#32852;&#20998;&#20026;&#20004;&#20010;&#38454;&#27573;&#12290;&#39318;&#20808;&#65292;&#36890;&#36807;&#36317;&#31163;-&#35282;&#24230;&#22270;&#20687;&#26816;&#27979;&#36710;&#36742;&#38647;&#36798;&#30446;&#26631;&#65292;&#24182;&#20026;&#27599;&#20010;&#30446;&#26631;&#20272;&#35745;&#19968;&#20010;&#27874;&#26463;&#24418;&#25104;&#30690;&#37327;&#12290;&#28982;&#21518;&#65292;&#23558;&#25512;&#26029;&#24471;&#21040;&#30340;&#27599;&#20010;&#30446;&#26631;&#30340;&#27874;&#26463;&#24418;&#25104;&#30690;&#37327;&#19982;BS&#29992;&#20110;&#36890;&#20449;&#30340;&#27874;&#26463;&#24418;&#25104;&#30690;&#37327;&#36827;&#34892;&#21305;&#37197;&#65292;&#20197;&#25191;&#34892;&#30446;&#26631;&#21040;&#29992;&#25143;&#65288;T2U&#65289;&#20851;&#32852;&#12290;&#36890;&#36807;&#20462;&#25913;&#20320;&#21482;&#30475;&#33080;&#37096;&#32593;&#32476;&#65288;YOLO&#65289;&#31639;&#27861;&#23454;&#29616;&#20102;&#32852;&#21512;&#22810;&#30446;&#26631;&#26816;&#27979;&#21644;&#27874;&#26463;&#25512;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
In Integrated Sensing and Communication (ISAC) systems, matching the radar targets with communication user equipments (UEs) is functional to several communication tasks, such as proactive handover and beam prediction. In this paper, we consider a radar-assisted communication system where a base station (BS) is equipped with a multiple-input-multiple-output (MIMO) radar that has a double aim: (i) associate vehicular radar targets to vehicular equipments (VEs) in the communication beamspace and (ii) predict the beamforming vector for each VE from radar data. The proposed target-to-user (T2U) association consists of two stages. First, vehicular radar targets are detected from range-angle images, and, for each, a beamforming vector is estimated. Then, the inferred per-target beamforming vectors are matched with the ones utilized at the BS for communication to perform target-to-user (T2U) association. Joint multi-target detection and beam inference is obtained by modifying the you only look
&lt;/p&gt;</description></item></channel></rss>