<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;5G&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#20013;&#20849;&#20139;&#25968;&#25454;&#24211;&#22330;&#26223;&#19979;&#30340;&#25968;&#25454;&#38544;&#31169;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27927;&#29260;&#30340;&#21487;&#23398;&#20064;&#21152;&#23494;&#25216;&#26415;&#26469;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#25968;&#25454;&#38544;&#31169;&#12290;</title><link>https://arxiv.org/abs/2402.09710</link><description>&lt;p&gt;
&#22312;&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#20013;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#39537;&#21160;&#30340;&#24212;&#29992;&#30340;&#25968;&#25454;&#38544;&#31169;
&lt;/p&gt;
&lt;p&gt;
Preserving Data Privacy for ML-driven Applications in Open Radio Access Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09710
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;5G&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#20013;&#20849;&#20139;&#25968;&#25454;&#24211;&#22330;&#26223;&#19979;&#30340;&#25968;&#25454;&#38544;&#31169;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27927;&#29260;&#30340;&#21487;&#23398;&#20064;&#21152;&#23494;&#25216;&#26415;&#26469;&#20445;&#25252;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#25968;&#25454;&#38544;&#31169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#25552;&#20379;&#20102;&#19968;&#31181;&#25913;&#36827;&#39057;&#35889;&#35775;&#38382;&#25216;&#26415;&#30340;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#36890;&#36807;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#26469;&#31649;&#29702;&#21644;&#20849;&#20139;&#26377;&#38480;&#30340;&#39057;&#35889;&#36164;&#28304;&#65292;&#29992;&#20110;&#26032;&#20852;&#24212;&#29992;&#12290;&#23545;&#20110;&#20854;&#20013;&#20960;&#31181;&#24212;&#29992;&#65292;&#25935;&#24863;&#30340;&#26080;&#32447;&#25968;&#25454;&#65288;&#22914;&#39057;&#35889;&#22270;&#65289;&#23384;&#20648;&#22312;&#20849;&#20139;&#25968;&#25454;&#24211;&#25110;&#22810;&#26041;&#21033;&#30410;&#30456;&#20851;&#32773;&#20113;&#29615;&#22659;&#20013;&#65292;&#22240;&#27492;&#23481;&#26131;&#36896;&#25104;&#38544;&#31169;&#27844;&#28431;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#30740;&#31350;5G&#24320;&#25918;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#65288;O-RAN&#65289;&#20013;&#20849;&#20139;&#25968;&#25454;&#24211;&#22330;&#26223;&#30340;&#20856;&#22411;&#26696;&#20363;&#26469;&#35299;&#20915;&#27492;&#31867;&#38544;&#31169;&#38382;&#39064;&#65292;&#22312;&#36825;&#20123;&#22330;&#26223;&#20013;&#65292;&#25105;&#20204;&#22312;&#36817;&#23454;&#26102;&#65288;near-RT&#65289;&#26080;&#32447;&#25509;&#20837;&#32593;&#32476;&#26234;&#33021;&#25511;&#21046;&#22120;&#20013;&#26377;&#19968;&#20010;&#20849;&#20139;&#25968;&#25454;&#24211;&#12290;&#25105;&#20204;&#30528;&#37325;&#35752;&#35770;&#20102;&#22914;&#20309;&#20445;&#25252;&#29992;&#20110;&#39057;&#35889;&#20849;&#20139;&#21644;&#24178;&#25200;&#32531;&#35299;&#24212;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#27169;&#22411;&#25152;&#20351;&#29992;&#30340;&#25968;&#25454;&#65292;&#21516;&#26102;&#19981;&#24433;&#21709;&#27169;&#22411;&#21644;&#32593;&#32476;&#30340;&#24615;&#33021;&#12290;&#20854;&#20013;&#30340;&#22522;&#26412;&#24819;&#27861;&#26159;&#21033;&#29992;&#22522;&#20110;&#27927;&#29260;&#30340;&#21487;&#23398;&#20064;&#21152;&#23494;&#25216;&#26415;&#26469;&#21152;&#23494;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09710v1 Announce Type: cross  Abstract: Deep learning offers a promising solution to improve spectrum access techniques by utilizing data-driven approaches to manage and share limited spectrum resources for emerging applications. For several of these applications, the sensitive wireless data (such as spectrograms) are stored in a shared database or multistakeholder cloud environment and are therefore prone to privacy leaks. This paper aims to address such privacy concerns by examining the representative case study of shared database scenarios in 5G Open Radio Access Network (O-RAN) networks where we have a shared database within the near-real-time (near-RT) RAN intelligent controller. We focus on securing the data that can be used by machine learning (ML) models for spectrum sharing and interference mitigation applications without compromising the model and network performances. The underlying idea is to leverage a (i) Shuffling-based learnable encryption technique to encryp
&lt;/p&gt;</description></item></channel></rss>