<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#37325;&#20889;&#31995;&#32479;&#21551;&#21457;&#30340;&#31070;&#32463;&#26550;&#26500;&#65292;&#29992;&#20110;&#23398;&#20064;&#31639;&#27861;&#20219;&#21153;&#65292;&#36890;&#36807;Selector&#12289;Solver&#21644;Combiner&#19977;&#20010;&#19987;&#38376;&#27169;&#22359;&#23454;&#29616;&#31639;&#27861;&#20219;&#21153;&#30340;&#31616;&#21270;&#65292;&#20855;&#26377;&#36739;&#22909;&#30340;&#22806;&#25512;&#33021;&#21147;</title><link>https://arxiv.org/abs/2402.17407</link><description>&lt;p&gt;
&#29992;&#31070;&#32463;&#37325;&#20889;&#31995;&#32479;&#35299;&#20915;&#31639;&#27861;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
A Neural Rewriting System to Solve Algorithmic Problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17407
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#37325;&#20889;&#31995;&#32479;&#21551;&#21457;&#30340;&#31070;&#32463;&#26550;&#26500;&#65292;&#29992;&#20110;&#23398;&#20064;&#31639;&#27861;&#20219;&#21153;&#65292;&#36890;&#36807;Selector&#12289;Solver&#21644;Combiner&#19977;&#20010;&#19987;&#38376;&#27169;&#22359;&#23454;&#29616;&#31639;&#27861;&#20219;&#21153;&#30340;&#31616;&#21270;&#65292;&#20855;&#26377;&#36739;&#22909;&#30340;&#22806;&#25512;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#20173;&#28982;&#38590;&#20197;&#23398;&#20064;&#38656;&#35201;&#31995;&#32479;&#24212;&#29992;&#32452;&#21512;&#35268;&#21017;&#26469;&#35299;&#20915;&#36229;&#20986;&#20998;&#24067;&#38382;&#39064;&#23454;&#20363;&#30340;&#31639;&#27861;&#31243;&#24207;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21407;&#21019;&#26041;&#27861;&#26469;&#23398;&#20064;&#21463;&#37325;&#20889;&#31995;&#32479;&#21551;&#21457;&#30340;&#31639;&#27861;&#20219;&#21153;&#65292;&#37325;&#20889;&#31995;&#32479;&#26159;&#31526;&#21495;&#20154;&#24037;&#26234;&#33021;&#20013;&#30340;&#32463;&#20856;&#26694;&#26550;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#37325;&#20889;&#31995;&#32479;&#21487;&#20197;&#34987;&#23454;&#29616;&#20026;&#19968;&#20010;&#30001;&#19987;&#38376;&#27169;&#22359;&#32452;&#25104;&#30340;&#31070;&#32463;&#26550;&#26500;&#65306;&#36873;&#25321;&#22120;&#35782;&#21035;&#35201;&#22788;&#29702;&#30340;&#30446;&#26631;&#23376;&#34920;&#36798;&#24335;&#65292;&#27714;&#35299;&#22120;&#36890;&#36807;&#35745;&#31639;&#30456;&#24212;&#30340;&#32467;&#26524;&#31616;&#21270;&#23376;&#34920;&#36798;&#24335;&#65292;&#32452;&#21512;&#22120;&#36890;&#36807;&#29992;&#25552;&#20379;&#30340;&#35299;&#20915;&#26041;&#26696;&#26367;&#25442;&#23376;&#34920;&#36798;&#24335;&#29983;&#25104;&#21407;&#22987;&#34920;&#36798;&#24335;&#30340;&#26032;&#29256;&#26412;&#12290;&#25105;&#20204;&#22312;&#19977;&#31181;&#28041;&#21450;&#31616;&#21270;&#28041;&#21450;&#21015;&#34920;&#12289;&#31639;&#26415;&#21644;&#20195;&#25968;&#34920;&#36798;&#24335;&#30340;&#31526;&#21495;&#20844;&#24335;&#30340;&#31639;&#27861;&#20219;&#21153;&#19978;&#35780;&#20272;&#25105;&#20204;&#30340;&#27169;&#22411;&#12290;&#25105;&#20204;&#27979;&#35797;&#20102;&#25152;&#25552;&#26550;&#26500;&#30340;&#22806;&#25512;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17407v1 Announce Type: cross  Abstract: Modern neural network architectures still struggle to learn algorithmic procedures that require to systematically apply compositional rules to solve out-of-distribution problem instances. In this work, we propose an original approach to learn algorithmic tasks inspired by rewriting systems, a classic framework in symbolic artificial intelligence. We show that a rewriting system can be implemented as a neural architecture composed by specialized modules: the Selector identifies the target sub-expression to process, the Solver simplifies the sub-expression by computing the corresponding result, and the Combiner produces a new version of the original expression by replacing the sub-expression with the solution provided. We evaluate our model on three types of algorithmic tasks that require simplifying symbolic formulas involving lists, arithmetic, and algebraic expressions. We test the extrapolation capabilities of the proposed architectu
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20351;&#29992;&#21457;&#32946;Braitenberg Vehicles&#20195;&#29702;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#21457;&#32946;&#21551;&#21457;&#30340;&#23398;&#20064;&#20195;&#29702;&#35774;&#35745;&#65292;&#23454;&#29616;&#20102;&#35745;&#31639;&#33258;&#20027;&#24615;&#30340;&#20855;&#36523;&#32463;&#39564;&#21644;&#24418;&#24577;&#21457;&#29983;&#22686;&#38271;&#27169;&#25311;&#65292;&#24182;&#32771;&#34385;&#20102;&#21457;&#32946;&#36712;&#36857;&#22312;&#31070;&#32463;&#31995;&#32479;&#24418;&#24577;&#29983;&#25104;&#12289;&#21457;&#32946;&#23398;&#20064;&#21644;&#21487;&#22609;&#24615;&#31561;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2103.05753</link><description>&lt;p&gt;
&#25345;&#32493;&#21457;&#23637;&#30340;&#31070;&#32463;&#20223;&#30495;&#65306;&#22522;&#20110;&#20855;&#36523;&#35745;&#31639;&#20195;&#29702;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Continual Developmental Neurosimulation Using Embodied Computational Agents. (arXiv:2103.05753v2 [q-bio.NC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.05753
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#21457;&#32946;Braitenberg Vehicles&#20195;&#29702;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#21457;&#32946;&#21551;&#21457;&#30340;&#23398;&#20064;&#20195;&#29702;&#35774;&#35745;&#65292;&#23454;&#29616;&#20102;&#35745;&#31639;&#33258;&#20027;&#24615;&#30340;&#20855;&#36523;&#32463;&#39564;&#21644;&#24418;&#24577;&#21457;&#29983;&#22686;&#38271;&#27169;&#25311;&#65292;&#24182;&#32771;&#34385;&#20102;&#21457;&#32946;&#36712;&#36857;&#22312;&#31070;&#32463;&#31995;&#32479;&#24418;&#24577;&#29983;&#25104;&#12289;&#21457;&#32946;&#23398;&#20064;&#21644;&#21487;&#22609;&#24615;&#31561;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#32508;&#21512;&#21457;&#32946;&#29983;&#29289;&#23398;&#12289;&#35748;&#30693;&#31185;&#23398;&#21644;&#35745;&#31639;&#24314;&#27169;&#65292;&#25105;&#20204;&#21487;&#20197;&#33719;&#24471;&#24456;&#22810;&#30693;&#35782;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#30446;&#26631;&#26159;&#22522;&#20110;Braitenberg Vehicles&#35774;&#35745;&#24320;&#21457;&#21463;&#21457;&#32946;&#21551;&#21457;&#30340;&#23398;&#20064;&#20195;&#29702;&#12290;&#21033;&#29992;&#36825;&#20123;&#20195;&#29702;&#20307;&#29616;&#20102;&#35745;&#31639;&#33258;&#20027;&#24615;&#30340;&#20855;&#36523;&#29305;&#24615;&#65292;&#19981;&#26029;&#38752;&#36817;&#23545;&#20855;&#36523;&#32463;&#39564;&#21644;&#24418;&#24577;&#21457;&#29983;&#22686;&#38271;&#20316;&#20026;&#35748;&#30693;&#21457;&#23637;&#33021;&#21147;&#32452;&#25104;&#37096;&#20998;&#30340;&#24314;&#27169;&#12290;&#25105;&#20204;&#32771;&#34385;&#29983;&#29289;&#21644;&#35748;&#30693;&#21457;&#23637;&#23545;&#25104;&#24180;&#34920;&#22411;&#29983;&#25104;&#21644;&#21487;&#29992;&#21457;&#23637;&#36335;&#24452;&#30340;&#24433;&#21709;&#12290;&#25345;&#32493;&#21457;&#23637;&#31070;&#32463;&#20223;&#30495;&#20351;&#25105;&#20204;&#33021;&#22815;&#32771;&#34385;&#21457;&#32946;&#36712;&#36857;&#22312;&#36830;&#25509;&#31070;&#32463;&#31995;&#32479;&#24418;&#24577;&#21457;&#29983;&#12289;&#21457;&#32946;&#23398;&#20064;&#21644;&#21487;&#22609;&#24615;&#31561;&#30456;&#20851;&#29616;&#35937;&#20013;&#25152;&#36215;&#30340;&#20316;&#29992;&#12290;&#30001;&#20110;&#19982;&#25345;&#32493;&#23398;&#20064;&#32039;&#23494;&#30456;&#20851;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#19982;&#21457;&#32946;&#20855;&#36523;&#32039;&#23494;&#38598;&#25104;&#65292;&#21487;&#20197;&#20351;&#29992;&#19968;&#31181;&#31216;&#20026;&#21457;&#32946;Braitenberg Vehicles (dBVs)&#30340;&#20195;&#29702;&#26469;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
There is much to learn through synthesis of Developmental Biology, Cognitive Science and Computational Modeling. Our path forward is to present a design for developmentally-inspired learning agents based on Braitenberg Vehicles. Using these agents to exemplify the embodied nature of computational autonomy, we move closer to modeling embodied experience and morphogenetic growth as components of cognitive developmental capacity. We consider biological and cognitive development which influence the generation of adult phenotypes and the contingency of available developmental pathways. Continual developmental neurosimulation allows us to consider the role of developmental trajectories in bridging the related phenomena of nervous system morphogenesis, developmental learning, and plasticity. Being closely tied to continual learning, our approach is tightly integrated with developmental embodiment, and can be implemented using a type of agent called developmental Braitenberg Vehicles (dBVs). T
&lt;/p&gt;</description></item></channel></rss>