<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;AT-PINNs&#30340;&#23545;&#25239;&#35757;&#32451;&#31574;&#30053;&#65292;&#36890;&#36807;&#23545;&#25239;&#26679;&#26412;&#30340;&#24494;&#35843;&#26469;&#22686;&#24378;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#30340;&#40065;&#26834;&#24615;&#65292;&#24182;&#19988;&#21487;&#20197;&#36827;&#34892;&#20855;&#26377;&#26102;&#38388;&#22240;&#26524;&#20851;&#31995;&#30340;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2310.11789</link><description>&lt;p&gt;
&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#30340;&#23545;&#25239;&#35757;&#32451;
&lt;/p&gt;
&lt;p&gt;
Adversarial Training for Physics-Informed Neural Networks. (arXiv:2310.11789v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11789
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;AT-PINNs&#30340;&#23545;&#25239;&#35757;&#32451;&#31574;&#30053;&#65292;&#36890;&#36807;&#23545;&#25239;&#26679;&#26412;&#30340;&#24494;&#35843;&#26469;&#22686;&#24378;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#30340;&#40065;&#26834;&#24615;&#65292;&#24182;&#19988;&#21487;&#20197;&#36827;&#34892;&#20855;&#26377;&#26102;&#38388;&#22240;&#26524;&#20851;&#31995;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#22312;&#35299;&#20915;&#20559;&#24494;&#20998;&#26041;&#31243;&#38382;&#39064;&#19978;&#26174;&#31034;&#20986;&#24040;&#22823;&#30340;&#28508;&#21147;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#19981;&#36275;&#30340;&#40065;&#26834;&#24615;&#65292;&#26222;&#36890;&#30340;PINNs&#22312;&#35299;&#20915;&#28041;&#21450;&#22810;&#23610;&#24230;&#34892;&#20026;&#25110;&#20855;&#26377;&#23574;&#38160;&#25110;&#25391;&#33633;&#29305;&#24449;&#30340;&#22797;&#26434;PDE&#26102;&#32463;&#24120;&#38754;&#20020;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#22522;&#20110;&#25237;&#24433;&#26799;&#24230;&#19979;&#38477;&#23545;&#25239;&#25915;&#20987;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#25239;&#35757;&#32451;&#31574;&#30053;&#65292;&#34987;&#31216;&#20026;AT-PINNs&#12290;AT-PINNs&#36890;&#36807;&#23545;&#25239;&#26679;&#26412;&#30340;&#24494;&#35843;&#26469;&#22686;&#24378;PINNs&#30340;&#40065;&#26834;&#24615;&#65292;&#21487;&#20197;&#20934;&#30830;&#35782;&#21035;&#27169;&#22411;&#22833;&#25928;&#20301;&#32622;&#24182;&#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#24341;&#23548;&#27169;&#22411;&#19987;&#27880;&#20110;&#36825;&#20123;&#21306;&#22495;&#12290;AT-PINNs&#36824;&#21487;&#20197;&#36890;&#36807;&#36873;&#25321;&#22260;&#32469;&#26102;&#38388;&#21021;&#22987;&#20540;&#30340;&#21021;&#22987;&#25311;&#21512;&#28857;&#26469;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#12290;&#25105;&#20204;&#23558;AT-PINNs&#24212;&#29992;&#20110;&#20855;&#26377;&#22810;&#23610;&#24230;&#31995;&#25968;&#30340;&#26925;&#22278;&#26041;&#31243;&#12289;&#20855;&#26377;&#22810;&#23792;&#35299;&#30340;&#27850;&#26494;&#26041;&#31243;&#12289;&#20855;&#26377;&#23574;&#38160;&#35299;&#30340;Burgers&#26041;&#31243;&#20197;&#21450;Allen-Cahn&#26041;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
Physics-informed neural networks have shown great promise in solving partial differential equations. However, due to insufficient robustness, vanilla PINNs often face challenges when solving complex PDEs, especially those involving multi-scale behaviors or solutions with sharp or oscillatory characteristics. To address these issues, based on the projected gradient descent adversarial attack, we proposed an adversarial training strategy for PINNs termed by AT-PINNs. AT-PINNs enhance the robustness of PINNs by fine-tuning the model with adversarial samples, which can accurately identify model failure locations and drive the model to focus on those regions during training. AT-PINNs can also perform inference with temporal causality by selecting the initial collocation points around temporal initial values. We implement AT-PINNs to the elliptic equation with multi-scale coefficients, Poisson equation with multi-peak solutions, Burgers equation with sharp solutions and the Allen-Cahn equati
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#27604;&#36739;&#20102;&#20004;&#31867;&#39640;&#32500;&#22810;&#35270;&#35282;&#32858;&#31867;&#26041;&#27861;&#65288;&#22522;&#20110;&#22270;&#21644;&#22522;&#20110;&#23376;&#31354;&#38388;&#65289;&#65292;&#37325;&#28857;&#20851;&#27880;&#20102;&#22914;&#20309;&#22788;&#29702;&#39640;&#38454;&#30456;&#20851;&#24615;&#65292;&#24182;&#22312;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#23454;&#39564;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2303.08582</link><description>&lt;p&gt;
&#39640;&#32500;&#22810;&#35270;&#35282;&#32858;&#31867;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
High-dimensional multi-view clustering methods. (arXiv:2303.08582v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08582
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#27604;&#36739;&#20102;&#20004;&#31867;&#39640;&#32500;&#22810;&#35270;&#35282;&#32858;&#31867;&#26041;&#27861;&#65288;&#22522;&#20110;&#22270;&#21644;&#22522;&#20110;&#23376;&#31354;&#38388;&#65289;&#65292;&#37325;&#28857;&#20851;&#27880;&#20102;&#22914;&#20309;&#22788;&#29702;&#39640;&#38454;&#30456;&#20851;&#24615;&#65292;&#24182;&#22312;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#23454;&#39564;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20960;&#24180;&#65292;&#30456;&#27604;&#20110;&#21333;&#35270;&#35282;&#32858;&#31867;&#65292;&#22810;&#35270;&#35282;&#32858;&#31867;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#25968;&#25454;&#20998;&#26512;&#20013;&#12290;&#23427;&#21487;&#20197;&#25552;&#20379;&#26356;&#22810;&#30340;&#25968;&#25454;&#20449;&#24687;&#65292;&#20294;&#20063;&#24102;&#26469;&#20102;&#19968;&#20123;&#25361;&#25112;&#65292;&#22914;&#22914;&#20309;&#32452;&#21512;&#36825;&#20123;&#35270;&#35282;&#25110;&#29305;&#24449;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#24352;&#37327;&#34920;&#31034;&#19978;&#65292;&#32780;&#19981;&#26159;&#23558;&#25968;&#25454;&#35270;&#20026;&#31616;&#21333;&#30340;&#30697;&#38453;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#22788;&#29702;&#25968;&#25454;&#20043;&#38388;&#30340;&#39640;&#38454;&#30456;&#20851;&#24615;&#65292;&#32780;&#22522;&#20110;&#30697;&#38453;&#30340;&#26041;&#27861;&#21017;&#38590;&#20197;&#25429;&#25417;&#36825;&#31181;&#30456;&#20851;&#24615;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#23558;&#30740;&#31350;&#21644;&#27604;&#36739;&#36825;&#20123;&#26041;&#27861;&#65292;&#29305;&#21035;&#26159;&#22522;&#20110;&#22270;&#30340;&#32858;&#31867;&#21644;&#23376;&#31354;&#38388;&#32858;&#31867;&#65292;&#20197;&#21450;&#22312;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#39564;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-view clustering has been widely used in recent years in comparison to single-view clustering, for clear reasons, as it offers more insights into the data, which has brought with it some challenges, such as how to combine these views or features. Most of recent work in this field focuses mainly on tensor representation instead of treating the data as simple matrices. This permits to deal with the high-order correlation between the data which the based matrix approach struggles to capture. Accordingly, we will examine and compare these approaches, particularly in two categories, namely graph-based clustering and subspace-based clustering. We will conduct and report experiments of the main clustering methods over a benchmark datasets.
&lt;/p&gt;</description></item></channel></rss>