<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#28145;&#24230;BSDE&#26041;&#27861;&#21644;&#38543;&#26426;&#26368;&#22823;&#21407;&#21017;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#35813;&#26041;&#27861;&#30340;&#25910;&#25947;&#32467;&#26524;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#39640;&#32500;&#38382;&#39064;&#20013;&#30456;&#27604;&#20854;&#20182;&#26041;&#27861;&#20855;&#26377;&#21331;&#36234;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2401.17472</link><description>&lt;p&gt;
&#36890;&#36807;&#38543;&#26426;&#26368;&#22823;&#21407;&#21017;&#65292;&#22522;&#20110;&#28145;&#24230;BSDE&#26041;&#27861;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#30340;&#25910;&#25947;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Convergence of the deep BSDE method for stochastic control problems formulated through the stochastic maximum principle
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17472
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#28145;&#24230;BSDE&#26041;&#27861;&#21644;&#38543;&#26426;&#26368;&#22823;&#21407;&#21017;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#35813;&#26041;&#27861;&#30340;&#25910;&#25947;&#32467;&#26524;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#39640;&#32500;&#38382;&#39064;&#20013;&#30456;&#27604;&#20854;&#20182;&#26041;&#27861;&#20855;&#26377;&#21331;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20247;&#25152;&#21608;&#30693;&#65292;&#38543;&#26426;&#25511;&#21046;&#30340;&#20915;&#31574;&#38382;&#39064;&#21487;&#20197;&#36890;&#36807;&#21069;&#21521;&#21518;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;FBSDE&#65289;&#26469;&#34920;&#36848;&#12290;&#26368;&#36817;&#65292;Ji&#31561;&#20154;&#65288;2022&#65289;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#26368;&#22823;&#21407;&#21017;&#65288;SMP&#65289;&#30340;&#39640;&#25928;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#35813;&#28145;&#24230;SMP-BSDE&#31639;&#27861;&#30340;&#25910;&#25947;&#32467;&#26524;&#65292;&#24182;&#23558;&#20854;&#24615;&#33021;&#19982;&#20854;&#20182;&#29616;&#26377;&#26041;&#27861;&#36827;&#34892;&#27604;&#36739;&#12290;&#36890;&#36807;&#37319;&#29992;&#31867;&#20284;&#20110;Han&#21644;Long&#65288;2020&#65289;&#30340;&#31574;&#30053;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#21518;&#39564;&#35823;&#24046;&#20272;&#35745;&#65292;&#24182;&#23637;&#31034;&#20102;&#24635;&#36817;&#20284;&#35823;&#24046;&#21487;&#20197;&#30001;&#25439;&#22833;&#20989;&#25968;&#20540;&#21644;&#31163;&#25955;&#21270;&#35823;&#24046;&#30340;&#20540;&#26469;&#38480;&#21046;&#12290;&#25105;&#20204;&#22312;&#39640;&#32500;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#30340;&#25968;&#20540;&#20363;&#23376;&#20013;&#23637;&#31034;&#20102;&#35813;&#31639;&#27861;&#22312;&#28418;&#31227;&#25511;&#21046;&#21644;&#25193;&#25955;&#25511;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#30456;&#27604;&#29616;&#26377;&#31639;&#27861;&#34920;&#29616;&#20986;&#30340;&#21331;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
It is well-known that decision-making problems from stochastic control can be formulated by means of forward-backward stochastic differential equation (FBSDE). Recently, the authors of Ji et al. 2022 proposed an efficient deep learning-based algorithm which was based on the stochastic maximum principle (SMP). In this paper, we provide a convergence result for this deep SMP-BSDE algorithm and compare its performance with other existing methods. In particular, by adopting a similar strategy as in Han and Long 2020, we derive a posteriori error estimate, and show that the total approximation error can be bounded by the value of the loss functional and the discretization error. We present numerical examples for high-dimensional stochastic control problems, both in case of drift- and diffusion control, which showcase superior performance compared to existing algorithms.
&lt;/p&gt;</description></item></channel></rss>