<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;ReEvo&#65292;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20316;&#20026;&#36229;&#21551;&#21457;&#24335;&#31639;&#27861;&#30340;&#19968;&#31181;&#27714;&#35299;&#26041;&#27861;&#65292;&#36890;&#36807;&#21453;&#24605;&#35774;&#35745;&#26041;&#27861;&#21644;&#24378;&#22823;&#30340;&#28436;&#21270;&#25628;&#32034;&#25216;&#26415;&#65292;&#26174;&#33879;&#25552;&#21319;&#20102;&#22312;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#19978;&#30340;&#25628;&#32034;&#24615;&#33021;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01145</link><description>&lt;p&gt;
ReEvo&#65306;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20316;&#20026;&#20855;&#26377;&#21453;&#24605;&#28436;&#21270;&#30340;&#36229;&#21551;&#21457;&#24335;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
ReEvo: Large Language Models as Hyper-Heuristics with Reflective Evolution
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01145
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;ReEvo&#65292;&#23427;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20316;&#20026;&#36229;&#21551;&#21457;&#24335;&#31639;&#27861;&#30340;&#19968;&#31181;&#27714;&#35299;&#26041;&#27861;&#65292;&#36890;&#36807;&#21453;&#24605;&#35774;&#35745;&#26041;&#27861;&#21644;&#24378;&#22823;&#30340;&#28436;&#21270;&#25628;&#32034;&#25216;&#26415;&#65292;&#26174;&#33879;&#25552;&#21319;&#20102;&#22312;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#19978;&#30340;&#25628;&#32034;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
NP&#22256;&#38590;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#30340;&#26222;&#36941;&#23384;&#22312;&#25512;&#21160;&#39046;&#22495;&#19987;&#23478;&#21442;&#19982;&#35797;&#38169;&#24335;&#21551;&#21457;&#24335;&#35774;&#35745;&#36807;&#31243;&#12290;&#35774;&#35745;&#33258;&#21160;&#21270;&#30340;&#38271;&#26399;&#21162;&#21147;&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30340;&#23835;&#36215;&#32780;&#33719;&#24471;&#26032;&#30340;&#21160;&#21147;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#35821;&#35328;&#36229;&#21551;&#21457;&#24335;&#31639;&#27861;&#65288;LHHs&#65289;&#65292;&#23427;&#26159;&#36229;&#21551;&#21457;&#24335;&#31639;&#27861;&#30340;&#19968;&#31181;&#26032;&#21464;&#20307;&#65292;&#21033;&#29992;LLM&#36827;&#34892;&#21551;&#21457;&#24335;&#29983;&#25104;&#65292;&#20855;&#26377;&#26368;&#23567;&#30340;&#20154;&#24037;&#24178;&#39044;&#21644;&#24320;&#25918;&#24335;&#30340;&#21551;&#21457;&#24335;&#31354;&#38388;&#12290;&#20026;&#20102;&#22686;&#24378;LHHs&#30340;&#33021;&#21147;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21453;&#24605;&#28436;&#21270;&#65288;ReEvo&#65289;&#65306;&#19968;&#31181;&#36890;&#29992;&#30340;&#25628;&#32034;&#26694;&#26550;&#65292;&#27169;&#25311;&#20102;&#20154;&#31867;&#19987;&#23478;&#30340;&#21453;&#24605;&#35774;&#35745;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#21487;&#25193;&#23637;&#30340;LLM&#25512;&#29702;&#12289;&#20114;&#32852;&#32593;&#35268;&#27169;&#30340;&#39046;&#22495;&#30693;&#35782;&#21644;&#24378;&#22823;&#30340;&#36827;&#21270;&#25628;&#32034;&#25216;&#26415;&#36828;&#36828;&#36229;&#36234;&#20102;&#20154;&#31867;&#30340;&#33021;&#21147;&#12290;&#22312;12&#20010;&#32452;&#21512;&#20248;&#21270;&#35774;&#32622;&#30340;&#35780;&#20272;&#20013;&#26174;&#31034;&#65306;1)&#28436;&#21270;&#30340;&#21475;&#22836;&#21453;&#24605;&#23548;&#33268;&#26356;&#24179;&#28369;&#30340;&#36866;&#24212;&#24230;&#22320;&#24418;&#12289;&#40657;&#30418;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#35774;&#32622;&#30340;&#26126;&#30830;&#25512;&#29702;&#20197;&#21450;&#26356;&#22909;&#30340;&#25628;&#32034;&#32467;&#26524;&#65307;2)ReEvo&#29983;&#25104;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#22312;&#20998;&#38047;&#32423;&#20248;&#21270;&#26102;&#38388;&#20869;&#33719;&#24471;&#20102;&#21487;&#38752;&#21644;&#20248;&#31168;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
The omnipresence of NP-hard combinatorial optimization problems (COPs) compels domain experts to engage in trial-and-error heuristic design process. The long-standing endeavor of design automation has gained new momentum with the rise of large language models (LLMs). This paper introduces Language Hyper-Heuristics (LHHs), an emerging variant of Hyper-Heuristics that leverages LLMs for heuristic generation, featuring minimal manual intervention and open-ended heuristic spaces. To empower LHHs, we present Reflective Evolution (ReEvo), a generic searching framework that emulates the reflective design approach of human experts while far surpassing human capabilities with its scalable LLM inference, Internet-scale domain knowledge, and powerful evolutionary search. Evaluations across 12 COP settings show that 1) verbal reflections for evolution lead to smoother fitness landscapes, explicit inference of black-box COP settings, and better search results; 2) heuristics generated by ReEvo in mi
&lt;/p&gt;</description></item></channel></rss>