<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#29983;&#25104;&#27969;&#34433;&#32676;&#37319;&#26679;&#22120;&#65288;GFACS&#65289;&#65292;&#19968;&#31181;&#32467;&#21512;&#29983;&#25104;&#27969;&#32593;&#32476;&#19982;&#34433;&#32676;&#20248;&#21270;&#26041;&#27861;&#30340;&#31070;&#32463;&#24341;&#23548;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#22312;&#32452;&#21512;&#20248;&#21270;&#20219;&#21153;&#20013;&#34920;&#29616;&#20248;&#20110;&#22522;&#32447;ACO&#31639;&#27861;&#24182;&#19982;&#29305;&#23450;&#38382;&#39064;&#21551;&#21457;&#24335;&#26041;&#27861;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.07041</link><description>&lt;p&gt;
&#20351;&#29992;GFlowNets&#30340;&#34433;&#32676;&#37319;&#26679;&#29992;&#20110;&#32452;&#21512;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Ant Colony Sampling with GFlowNets for Combinatorial Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07041
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#29983;&#25104;&#27969;&#34433;&#32676;&#37319;&#26679;&#22120;&#65288;GFACS&#65289;&#65292;&#19968;&#31181;&#32467;&#21512;&#29983;&#25104;&#27969;&#32593;&#32476;&#19982;&#34433;&#32676;&#20248;&#21270;&#26041;&#27861;&#30340;&#31070;&#32463;&#24341;&#23548;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#22312;&#32452;&#21512;&#20248;&#21270;&#20219;&#21153;&#20013;&#34920;&#29616;&#20248;&#20110;&#22522;&#32447;ACO&#31639;&#27861;&#24182;&#19982;&#29305;&#23450;&#38382;&#39064;&#21551;&#21457;&#24335;&#26041;&#27861;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#29983;&#25104;&#27969;&#34433;&#32676;&#37319;&#26679;&#22120;&#65288;GFACS&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#29992;&#20110;&#32452;&#21512;&#20248;&#21270;&#30340;&#31070;&#32463;&#24341;&#23548;&#20803;&#21551;&#21457;&#24335;&#31639;&#27861;&#12290;GFACS &#23558;&#29983;&#25104;&#27969;&#32593;&#32476;&#65288;GFlowNets&#65289;&#19982;&#34433;&#32676;&#20248;&#21270;&#65288;ACO&#65289;&#26041;&#27861;&#30456;&#32467;&#21512;&#12290;GFlowNets &#26159;&#19968;&#31181;&#29983;&#25104;&#27169;&#22411;&#65292;&#23427;&#22312;&#32452;&#21512;&#31354;&#38388;&#20013;&#23398;&#20064;&#26500;&#36896;&#24615;&#31574;&#30053;&#65292;&#36890;&#36807;&#22312;&#36755;&#20837;&#22270;&#23454;&#20363;&#19978;&#25552;&#20379;&#20915;&#31574;&#21464;&#37327;&#30340;&#30693;&#24773;&#20808;&#39564;&#20998;&#24067;&#26469;&#22686;&#24378; ACO&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35757;&#32451;&#25216;&#24039;&#32452;&#21512;&#65292;&#21253;&#25324;&#25628;&#32034;&#24341;&#23548;&#30340;&#23616;&#37096;&#25506;&#32034;&#12289;&#33021;&#37327;&#24402;&#19968;&#21270;&#21644;&#33021;&#37327;&#22609;&#24418;&#65292;&#20197;&#25552;&#39640; GFACS &#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;GFACS &#22312;&#19971;&#20010;&#32452;&#21512;&#20248;&#21270;&#20219;&#21153;&#20013;&#20248;&#20110;&#22522;&#32447; ACO &#31639;&#27861;&#65292;&#24182;&#19988;&#22312;&#36710;&#36742;&#36335;&#24452;&#38382;&#39064;&#30340;&#38382;&#39064;&#29305;&#23450;&#21551;&#21457;&#24335;&#26041;&#27861;&#20013;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;&#28304;&#20195;&#30721;&#21487;&#22312; \url{https://github.com/ai4co/gfacs} &#33719;&#21462;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07041v1 Announce Type: new  Abstract: This paper introduces the Generative Flow Ant Colony Sampler (GFACS), a novel neural-guided meta-heuristic algorithm for combinatorial optimization. GFACS integrates generative flow networks (GFlowNets) with the ant colony optimization (ACO) methodology. GFlowNets, a generative model that learns a constructive policy in combinatorial spaces, enhance ACO by providing an informed prior distribution of decision variables conditioned on input graph instances. Furthermore, we introduce a novel combination of training tricks, including search-guided local exploration, energy normalization, and energy shaping to improve GFACS. Our experimental results demonstrate that GFACS outperforms baseline ACO algorithms in seven CO tasks and is competitive with problem-specific heuristics for vehicle routing problems. The source code is available at \url{https://github.com/ai4co/gfacs}.
&lt;/p&gt;</description></item></channel></rss>