<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20013;&#21518;&#38376;&#25915;&#20987;&#30340;&#36890;&#29992;&#21518;&#35757;&#32451;&#21453;&#21521;&#24037;&#31243;&#38450;&#24481;&#26041;&#27861;&#65292;&#36890;&#36807;&#20381;&#36182;&#20869;&#37096;&#29305;&#24449;&#22270;&#26469;&#26816;&#27979;&#21644;&#21453;&#21521;&#24037;&#31243;&#21518;&#38376;&#65292;&#24182;&#35782;&#21035;&#20854;&#30446;&#26631;&#31867;&#21035;&#65292;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#24615;&#21644;&#20302;&#35745;&#31639;&#24320;&#38144;&#12290;</title><link>https://arxiv.org/abs/2402.02034</link><description>&lt;p&gt;
&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20013;&#38024;&#23545;&#21518;&#38376;&#25915;&#20987;&#30340;&#36890;&#29992;&#21518;&#35757;&#32451;&#21453;&#21521;&#24037;&#31243;&#38450;&#24481;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Universal Post-Training Reverse-Engineering Defense Against Backdoors in Deep Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02034
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20013;&#21518;&#38376;&#25915;&#20987;&#30340;&#36890;&#29992;&#21518;&#35757;&#32451;&#21453;&#21521;&#24037;&#31243;&#38450;&#24481;&#26041;&#27861;&#65292;&#36890;&#36807;&#20381;&#36182;&#20869;&#37096;&#29305;&#24449;&#22270;&#26469;&#26816;&#27979;&#21644;&#21453;&#21521;&#24037;&#31243;&#21518;&#38376;&#65292;&#24182;&#35782;&#21035;&#20854;&#30446;&#26631;&#31867;&#21035;&#65292;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#24615;&#21644;&#20302;&#35745;&#31639;&#24320;&#38144;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20998;&#31867;&#22120;&#30340;&#21518;&#38376;&#25915;&#20987;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#38450;&#24481;&#26041;&#27861;&#12290;&#36890;&#29992;&#26041;&#27861;&#26088;&#22312;&#21487;&#38752;&#22320;&#26816;&#27979;&#21644;/&#25110;&#20943;&#36731;&#21518;&#38376;&#25915;&#20987;&#65292;&#32780;&#21453;&#21521;&#24037;&#31243;&#26041;&#27861;&#36890;&#24120;&#26126;&#30830;&#20551;&#35774;&#20854;&#20013;&#19968;&#31181;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26816;&#27979;&#22120;&#65292;&#23427;&#20381;&#36182;&#20110;&#34987;&#38450;&#23432;&#30340;DNN&#30340;&#20869;&#37096;&#29305;&#24449;&#22270;&#26469;&#26816;&#27979;&#21644;&#21453;&#21521;&#24037;&#31243;&#21518;&#38376;&#65292;&#24182;&#35782;&#21035;&#20854;&#30446;&#26631;&#31867;&#21035;&#65307;&#23427;&#21487;&#20197;&#22312;&#21518;&#35757;&#32451;&#26102;&#25805;&#20316;&#65288;&#26080;&#38656;&#35775;&#38382;&#35757;&#32451;&#25968;&#25454;&#38598;&#65289;&#65307;&#23545;&#20110;&#19981;&#21516;&#30340;&#23884;&#20837;&#26426;&#21046;&#65288;&#21363;&#36890;&#29992;&#30340;&#65289;&#38750;&#24120;&#26377;&#25928;&#65307;&#24182;&#19988;&#20855;&#26377;&#20302;&#35745;&#31639;&#24320;&#38144;&#65292;&#22240;&#27492;&#21487;&#25193;&#23637;&#12290;&#25105;&#20204;&#23545;&#22522;&#20934;CIFAR-10&#22270;&#20687;&#20998;&#31867;&#22120;&#30340;&#19981;&#21516;&#25915;&#20987;&#36827;&#34892;&#20102;&#26816;&#27979;&#26041;&#27861;&#30340;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
A variety of defenses have been proposed against backdoors attacks on deep neural network (DNN) classifiers. Universal methods seek to reliably detect and/or mitigate backdoors irrespective of the incorporation mechanism used by the attacker, while reverse-engineering methods often explicitly assume one. In this paper, we describe a new detector that: relies on internal feature map of the defended DNN to detect and reverse-engineer the backdoor and identify its target class; can operate post-training (without access to the training dataset); is highly effective for various incorporation mechanisms (i.e., is universal); and which has low computational overhead and so is scalable. Our detection approach is evaluated for different attacks on a benchmark CIFAR-10 image classifier.
&lt;/p&gt;</description></item><item><title>&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#36827;&#21270;&#31639;&#27861;&#30340;&#32467;&#21512;&#20855;&#26377;&#24378;&#22823;&#30340;&#19968;&#33268;&#24615;&#65292;&#21253;&#25324;&#26631;&#35760;&#23884;&#20837;&#21644;&#22522;&#22240;&#22411;-&#34920;&#29616;&#22411;&#26144;&#23556;&#12289;&#20301;&#32622;&#32534;&#30721;&#21644;&#36866;&#24212;&#24615;&#22609;&#36896;&#12289;&#20301;&#32622;&#23884;&#20837;&#21644;&#36873;&#25321;&#12289;&#27880;&#24847;&#21147;&#21644;&#20132;&#21449;&#12289;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#21644;&#31361;&#21464;&#12289;&#27169;&#22411;&#35757;&#32451;&#21644;&#21442;&#25968;&#26356;&#26032;&#20197;&#21450;&#22810;&#20219;&#21153;&#23398;&#20064;&#21644;&#22810;&#30446;&#26631;&#20248;&#21270;&#31561;&#22810;&#20010;&#26680;&#24515;&#29305;&#24449;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#29616;&#26377;&#30340;&#32806;&#21512;&#30740;&#31350;&#65292;&#24182;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#26412;&#36335;&#32447;&#21644;&#20851;&#38190;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2401.10510</link><description>&lt;p&gt;
&#22825;&#20316;&#20043;&#21512;&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#19982;&#36827;&#21270;&#31639;&#27861;&#30340;&#32467;&#21512;
&lt;/p&gt;
&lt;p&gt;
A match made in consistency heaven: when large language models meet evolutionary algorithms. (arXiv:2401.10510v1 [cs.NE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10510
&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#36827;&#21270;&#31639;&#27861;&#30340;&#32467;&#21512;&#20855;&#26377;&#24378;&#22823;&#30340;&#19968;&#33268;&#24615;&#65292;&#21253;&#25324;&#26631;&#35760;&#23884;&#20837;&#21644;&#22522;&#22240;&#22411;-&#34920;&#29616;&#22411;&#26144;&#23556;&#12289;&#20301;&#32622;&#32534;&#30721;&#21644;&#36866;&#24212;&#24615;&#22609;&#36896;&#12289;&#20301;&#32622;&#23884;&#20837;&#21644;&#36873;&#25321;&#12289;&#27880;&#24847;&#21147;&#21644;&#20132;&#21449;&#12289;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#21644;&#31361;&#21464;&#12289;&#27169;&#22411;&#35757;&#32451;&#21644;&#21442;&#25968;&#26356;&#26032;&#20197;&#21450;&#22810;&#20219;&#21153;&#23398;&#20064;&#21644;&#22810;&#30446;&#26631;&#20248;&#21270;&#31561;&#22810;&#20010;&#26680;&#24515;&#29305;&#24449;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#29616;&#26377;&#30340;&#32806;&#21512;&#30740;&#31350;&#65292;&#24182;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#26412;&#36335;&#32447;&#21644;&#20851;&#38190;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35757;&#32451;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#29983;&#25104;&#21019;&#36896;&#24615;&#30340;&#33258;&#28982;&#25991;&#26412;&#26041;&#38754;&#20855;&#26377;&#24378;&#22823;&#30340;&#33021;&#21147;&#12290;&#36827;&#21270;&#31639;&#27861;&#65288;EAs&#65289;&#21487;&#20197;&#21457;&#29616;&#22797;&#26434;&#23454;&#38469;&#38382;&#39064;&#30340;&#22810;&#26679;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#36890;&#36807;&#27604;&#36739;&#25991;&#26412;&#24207;&#21015;&#29983;&#25104;&#21644;&#36827;&#21270;&#30340;&#20849;&#21516;&#29305;&#28857;&#21644;&#26041;&#21521;&#24615;&#65292;&#38416;&#36848;&#20102;LLMs&#19982;EAs&#20043;&#38388;&#30340;&#24378;&#22823;&#19968;&#33268;&#24615;&#65292;&#21253;&#25324;&#22810;&#20010;&#19968;&#23545;&#19968;&#30340;&#26680;&#24515;&#29305;&#24449;&#65306;&#26631;&#35760;&#23884;&#20837;&#21644;&#22522;&#22240;&#22411;-&#34920;&#29616;&#22411;&#26144;&#23556;&#12289;&#20301;&#32622;&#32534;&#30721;&#21644;&#36866;&#24212;&#24615;&#22609;&#36896;&#12289;&#20301;&#32622;&#23884;&#20837;&#21644;&#36873;&#25321;&#12289;&#27880;&#24847;&#21147;&#21644;&#20132;&#21449;&#12289;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#21644;&#31361;&#21464;&#12289;&#27169;&#22411;&#35757;&#32451;&#21644;&#21442;&#25968;&#26356;&#26032;&#20197;&#21450;&#22810;&#20219;&#21153;&#23398;&#20064;&#21644;&#22810;&#30446;&#26631;&#20248;&#21270;&#12290;&#22312;&#36825;&#31181;&#19968;&#33268;&#24615;&#35270;&#35282;&#19979;&#65292;&#20998;&#26512;&#20102;&#29616;&#26377;&#30340;&#32806;&#21512;&#30740;&#31350;&#65292;&#21253;&#25324;&#36827;&#21270;&#24494;&#35843;&#21644;LLM&#22686;&#24378;&#22411;EAs&#12290;&#20511;&#21161;&#36825;&#20123;&#27934;&#35265;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#26410;&#26469;&#22312;LLMs&#21644;EAs&#32806;&#21512;&#26041;&#38754;&#30340;&#22522;&#26412;&#30740;&#31350;&#36335;&#32447;&#65292;&#24182;&#31361;&#20986;&#20102;&#20854;&#20013;&#30340;&#20851;&#38190;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pre-trained large language models (LLMs) have powerful capabilities for generating creative natural text. Evolutionary algorithms (EAs) can discover diverse solutions to complex real-world problems. Motivated by the common collective and directionality of text sequence generation and evolution, this paper illustrates the strong consistency of LLMs and EAs, which includes multiple one-to-one key characteristics: token embedding and genotype-phenotype mapping, position encoding and fitness shaping, position embedding and selection, attention and crossover, feed-forward neural network and mutation, model training and parameter update, and multi-task learning and multi-objective optimization. Based on this consistency perspective, existing coupling studies are analyzed, including evolutionary fine-tuning and LLM-enhanced EAs. Leveraging these insights, we outline a fundamental roadmap for future research in coupling LLMs and EAs, while highlighting key challenges along the way. The consist
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#31946;&#33258;&#36866;&#24212;&#36827;&#21270;&#29305;&#24449;&#36873;&#25321;&#19982;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#29992;&#20110;&#21333;&#30446;&#26631;&#21644;&#22810;&#30446;&#26631;&#36523;&#20307;&#33026;&#32938;&#39044;&#27979;&#65292;&#35813;&#26041;&#27861;&#22312;&#31649;&#29702;&#21442;&#25968;&#21270;&#21644;&#35745;&#31639;&#25104;&#26412;&#30340;&#21516;&#26102;&#30830;&#23450;&#20102;&#36866;&#24403;&#30340;&#25506;&#32034;&#21644;&#24320;&#21457;&#27700;&#24179;&#65292;&#21487;&#20197;&#36991;&#20813;&#38519;&#20837;&#23616;&#37096;&#26368;&#20248;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.11949</link><description>&lt;p&gt;
&#19968;&#31181;&#27169;&#31946;&#33258;&#36866;&#24212;&#36827;&#21270;&#29305;&#24449;&#36873;&#25321;&#19982;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#29992;&#20110;&#21333;&#30446;&#26631;&#21644;&#22810;&#30446;&#26631;&#36523;&#20307;&#33026;&#32938;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
A fuzzy adaptive evolutionary-based feature selection and machine learning framework for single and multi-objective body fat prediction. (arXiv:2303.11949v1 [cs.NE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11949
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#31946;&#33258;&#36866;&#24212;&#36827;&#21270;&#29305;&#24449;&#36873;&#25321;&#19982;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#29992;&#20110;&#21333;&#30446;&#26631;&#21644;&#22810;&#30446;&#26631;&#36523;&#20307;&#33026;&#32938;&#39044;&#27979;&#65292;&#35813;&#26041;&#27861;&#22312;&#31649;&#29702;&#21442;&#25968;&#21270;&#21644;&#35745;&#31639;&#25104;&#26412;&#30340;&#21516;&#26102;&#30830;&#23450;&#20102;&#36866;&#24403;&#30340;&#25506;&#32034;&#21644;&#24320;&#21457;&#27700;&#24179;&#65292;&#21487;&#20197;&#36991;&#20813;&#38519;&#20837;&#23616;&#37096;&#26368;&#20248;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#36523;&#20307;&#33026;&#32938;&#21487;&#20197;&#20026;&#21307;&#23398;&#20174;&#19994;&#32773;&#21644;&#29992;&#25143;&#25552;&#20379;&#39044;&#38450;&#21644;&#35786;&#26029;&#24515;&#33039;&#30142;&#30149;&#30340;&#37325;&#35201;&#20449;&#24687;&#12290;&#28151;&#21512;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#36890;&#36807;&#36873;&#25321;&#30456;&#20851;&#30340;&#36523;&#20307;&#27979;&#37327;&#20540;&#21644;&#25429;&#25417;&#27169;&#22411;&#20013;&#25152;&#36873;&#29305;&#24449;&#20043;&#38388;&#30340;&#22797;&#26434;&#38750;&#32447;&#24615;&#20851;&#31995;&#65292;&#25552;&#20379;&#20102;&#27604;&#31616;&#21333;&#30340;&#22238;&#24402;&#20998;&#26512;&#26041;&#27861;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#20173;&#28982;&#23384;&#22312;&#19968;&#20123;&#32570;&#28857;&#12290;&#24403;&#21069;&#30340;&#26426;&#22120;&#23398;&#20064;&#24314;&#27169;&#26041;&#27861;&#23558;&#36523;&#20307;&#33026;&#32938;&#39044;&#27979;&#38382;&#39064;&#24314;&#27169;&#20026;&#32452;&#21512;&#30340;&#21333;&#30446;&#26631;&#21644;&#22810;&#30446;&#26631;&#20248;&#21270;&#38382;&#39064;&#65292;&#24448;&#24448;&#20250;&#38519;&#20837;&#23616;&#37096;&#26368;&#20248;&#12290;&#24403;&#22810;&#20010;&#29305;&#24449;&#23376;&#38598;&#20135;&#29983;&#31867;&#20284;&#25110;&#25509;&#36817;&#30340;&#39044;&#27979;&#26102;&#65292;&#36991;&#20813;&#23616;&#37096;&#26368;&#20248;&#21464;&#24471;&#26356;&#21152;&#22797;&#26434;&#12290;&#36827;&#21270;&#29305;&#24449;&#36873;&#25321;&#24050;&#34987;&#29992;&#20110;&#35299;&#20915;&#20960;&#20010;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#19968;&#20010;&#27169;&#31946;&#38598;&#29702;&#35770;&#30830;&#23450;&#36866;&#24403;&#30340;&#25506;&#32034;&#21644;&#24320;&#21457;&#27700;&#24179;&#65292;&#21516;&#26102;&#31649;&#29702;&#21442;&#25968;&#21270;&#21644;&#35745;&#31639;&#25104;&#26412;&#12290;&#37319;&#29992;&#21152;&#26435;&#21644;&#36523;&#20307;&#33026;&#32938;&#39044;&#27979;&#26041;&#27861;&#36827;&#34892;&#23454;&#39564;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Predicting body fat can provide medical practitioners and users with essential information for preventing and diagnosing heart diseases. Hybrid machine learning models offer better performance than simple regression analysis methods by selecting relevant body measurements and capturing complex nonlinear relationships among selected features in modelling body fat prediction problems. There are, however, some disadvantages to them. Current machine learning. Modelling body fat prediction as a combinatorial single- and multi-objective optimisation problem often gets stuck in local optima. When multiple feature subsets produce similar or close predictions, avoiding local optima becomes more complex. Evolutionary feature selection has been used to solve several machine-learning-based optimisation problems. A fuzzy set theory determines appropriate levels of exploration and exploitation while managing parameterisation and computational costs. A weighted-sum body fat prediction approach was ex
&lt;/p&gt;</description></item></channel></rss>