<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#38543;&#26426;&#31639;&#27861;&#26469;&#26356;&#24555;&#12289;&#26356;&#21487;&#25193;&#23637;&#22320;&#35745;&#31639;&#23545;&#31216;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#65292;&#20854;&#20013;&#19968;&#31181;&#20351;&#29992;&#38543;&#26426;&#30697;&#38453;&#33609;&#22270;&#26469;&#35745;&#31639;&#21021;&#22987;&#20302;&#31209;&#36755;&#20837;&#30697;&#38453;&#65292;&#21478;&#19968;&#31181;&#20351;&#29992;&#38543;&#26426;&#26464;&#26438;&#24471;&#20998;&#37319;&#26679;&#26469;&#36817;&#20284;&#35299;&#20915;&#32422;&#26463;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#12290;&#36825;&#20123;&#26041;&#27861;&#22312;&#22823;&#35268;&#27169;&#30495;&#23454;&#19990;&#30028;&#30340;&#22270;&#32858;&#31867;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.08134</link><description>&lt;p&gt;
&#23545;&#31216;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#30340;&#38543;&#26426;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Randomized Algorithms for Symmetric Nonnegative Matrix Factorization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08134
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#38543;&#26426;&#31639;&#27861;&#26469;&#26356;&#24555;&#12289;&#26356;&#21487;&#25193;&#23637;&#22320;&#35745;&#31639;&#23545;&#31216;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#65292;&#20854;&#20013;&#19968;&#31181;&#20351;&#29992;&#38543;&#26426;&#30697;&#38453;&#33609;&#22270;&#26469;&#35745;&#31639;&#21021;&#22987;&#20302;&#31209;&#36755;&#20837;&#30697;&#38453;&#65292;&#21478;&#19968;&#31181;&#20351;&#29992;&#38543;&#26426;&#26464;&#26438;&#24471;&#20998;&#37319;&#26679;&#26469;&#36817;&#20284;&#35299;&#20915;&#32422;&#26463;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#12290;&#36825;&#20123;&#26041;&#27861;&#22312;&#22823;&#35268;&#27169;&#30495;&#23454;&#19990;&#30028;&#30340;&#22270;&#32858;&#31867;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#31216;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#65288;SymNMF&#65289;&#26159;&#25968;&#25454;&#20998;&#26512;&#21644;&#26426;&#22120;&#23398;&#20064;&#20013;&#19968;&#31181;&#23558;&#23545;&#31216;&#30697;&#38453;&#36817;&#20284;&#34920;&#31034;&#20026;&#38750;&#36127;&#12289;&#20302;&#31209;&#30697;&#38453;&#21450;&#20854;&#36716;&#32622;&#30340;&#25216;&#26415;&#12290;&#20026;&#20102;&#35774;&#35745;&#26356;&#24555;&#12289;&#26356;&#21487;&#25193;&#23637;&#30340;SymNMF&#31639;&#27861;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#20004;&#31181;&#38543;&#26426;&#31639;&#27861;&#26469;&#36827;&#34892;&#35745;&#31639;&#12290;&#31532;&#19968;&#31181;&#31639;&#27861;&#20351;&#29992;&#38543;&#26426;&#30697;&#38453;&#33609;&#22270;&#35745;&#31639;&#21021;&#22987;&#30340;&#20302;&#31209;&#36755;&#20837;&#30697;&#38453;&#65292;&#24182;&#21033;&#29992;&#35813;&#36755;&#20837;&#36805;&#36895;&#35745;&#31639;SymNMF&#12290;&#31532;&#20108;&#31181;&#31639;&#27861;&#20351;&#29992;&#38543;&#26426;&#26464;&#26438;&#24471;&#20998;&#37319;&#26679;&#26469;&#36817;&#20284;&#35299;&#20915;&#32422;&#26463;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#12290;&#35768;&#22810;&#25104;&#21151;&#30340;SymNMF&#26041;&#27861;&#20381;&#36182;&#20110;&#65288;&#36817;&#20284;&#65289;&#35299;&#20915;&#19968;&#31995;&#21015;&#32422;&#26463;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#12290;&#25105;&#20204;&#22312;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#26464;&#26438;&#24471;&#20998;&#37319;&#26679;&#21487;&#20197;&#20197;&#39640;&#27010;&#29575;&#36817;&#20284;&#35299;&#20915;&#38750;&#36127;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#65292;&#36798;&#21040;&#25152;&#36873;&#31934;&#24230;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#36825;&#20004;&#31181;&#26041;&#27861;&#24212;&#29992;&#20110;&#22823;&#35268;&#27169;&#30495;&#23454;&#19990;&#30028;&#30340;&#22270;&#32858;&#31867;&#20219;&#21153;&#20013;&#65292;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Symmetric Nonnegative Matrix Factorization (SymNMF) is a technique in data analysis and machine learning that approximates a symmetric matrix with a product of a nonnegative, low-rank matrix and its transpose. To design faster and more scalable algorithms for SymNMF we develop two randomized algorithms for its computation. The first algorithm uses randomized matrix sketching to compute an initial low-rank input matrix and proceeds to use this input to rapidly compute a SymNMF. The second algorithm uses randomized leverage score sampling to approximately solve constrained least squares problems. Many successful methods for SymNMF rely on (approximately) solving sequences of constrained least squares problems. We prove theoretically that leverage score sampling can approximately solve nonnegative least squares problems to a chosen accuracy with high probability. Finally we demonstrate that both methods work well in practice by applying them to graph clustering tasks on large real world d
&lt;/p&gt;</description></item></channel></rss>