<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#30740;&#31350;&#20102;Hermitian&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;(DMD)&#23545;&#33258;&#20276;&#38543;Koopman&#31639;&#23376;&#30340;&#35889;&#24615;&#36136;&#30340;&#25910;&#25947;&#24615;&#65292;&#36890;&#36807;&#24314;&#31435;&#20102;&#20851;&#20110;&#35889;&#27979;&#24230;&#25910;&#25947;&#24615;&#30340;&#19968;&#33324;&#23450;&#29702;&#65292;&#35777;&#26126;&#20102;HDMD&#30340;&#29305;&#24449;&#20540;&#21644;&#29305;&#24449;&#20989;&#25968;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#25910;&#25947;&#21040;&#22522;&#30784;Koopman&#31639;&#23376;&#30340;&#35889;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2401.03192</link><description>&lt;p&gt;
&#20851;&#20110;Hermitian&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;&#30340;&#25910;&#25947;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Convergence of Hermitian Dynamic Mode Decomposition. (arXiv:2401.03192v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.03192
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;Hermitian&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;(DMD)&#23545;&#33258;&#20276;&#38543;Koopman&#31639;&#23376;&#30340;&#35889;&#24615;&#36136;&#30340;&#25910;&#25947;&#24615;&#65292;&#36890;&#36807;&#24314;&#31435;&#20102;&#20851;&#20110;&#35889;&#27979;&#24230;&#25910;&#25947;&#24615;&#30340;&#19968;&#33324;&#23450;&#29702;&#65292;&#35777;&#26126;&#20102;HDMD&#30340;&#29305;&#24449;&#20540;&#21644;&#29305;&#24449;&#20989;&#25968;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#25910;&#25947;&#21040;&#22522;&#30784;Koopman&#31639;&#23376;&#30340;&#35889;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Hermitian&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;(DMD)&#23545;&#33258;&#20276;&#38543;Koopman&#31639;&#23376;&#30340;&#35889;&#24615;&#36136;&#30340;&#25910;&#25947;&#24615;&#12290;Hermitian DMD&#26159;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#31163;&#25955;&#26102;&#38388;&#24555;&#29031;&#36817;&#20284;&#34920;&#31034;&#19982;&#26410;&#30693;&#38750;&#32447;&#24615;&#21160;&#21147;&#31995;&#32479;&#30456;&#20851;&#30340;Koopman&#31639;&#23376;&#65292;&#21516;&#26102;&#22312;&#20854;&#26377;&#38480;&#32500;&#36817;&#20284;&#20013;&#20445;&#25345;&#31639;&#23376;&#30340;&#33258;&#20276;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#36866;&#24403;&#30340;&#26465;&#20214;&#19979;&#65292;HDMD&#30340;&#29305;&#24449;&#20540;&#21644;&#29305;&#24449;&#20989;&#25968;&#25910;&#25947;&#21040;&#22522;&#30784;Koopman&#31639;&#23376;&#30340;&#35889;&#24615;&#36136;&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20851;&#20110;&#35889;&#27979;&#24230;&#25910;&#25947;&#24615;&#30340;&#19968;&#33324;&#23450;&#29702;&#65292;&#24182;&#22312;&#20108;&#32500;&#34203;&#23450;&#35860;&#26041;&#31243;&#19978;&#36890;&#36807;&#25968;&#20540;&#32467;&#26524;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we study the convergence of Hermitian Dynamic Mode Decomposition (DMD) to the spectral properties of self-adjoint Koopman operators. Hermitian DMD is a data-driven method for approximating the Koopman operator associated with an unknown nonlinear dynamical system from discrete-time snapshots, while preserving the self-adjointness of the operator on its finite-dimensional approximations. We show that, under suitable conditions, the eigenvalues and eigenfunctions of HDMD converge to the spectral properties of the underlying Koopman operator. Along the way, we establish a general theorem on the convergence of spectral measures, and demonstrate our results numerically on the two-dimensional Schr\"odinger equation.
&lt;/p&gt;</description></item></channel></rss>