<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26377;&#38480;&#23380;&#24452;&#36870;&#38556;&#30861;&#25955;&#23556;&#38382;&#39064;&#30340;&#28145;&#24230;&#20998;&#35299;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#25552;&#20379;&#19982;&#25955;&#23556;&#27169;&#22411;&#30456;&#20851;&#32852;&#30340;&#29289;&#29702;&#36816;&#31639;&#31526;&#65292;&#23454;&#29616;&#28145;&#24230;&#23398;&#20064;&#22312;&#36870;&#38382;&#39064;&#19978;&#24037;&#20316;&#65292;&#24182;&#36991;&#20813;&#25197;&#26354;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2403.19470</link><description>&lt;p&gt;
&#26377;&#38480;&#23380;&#24452;&#36870;&#38556;&#30861;&#25955;&#23556;&#38382;&#39064;&#30340;&#28145;&#24230;&#20998;&#35299;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Deep decomposition method for the limited aperture inverse obstacle scattering problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19470
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26377;&#38480;&#23380;&#24452;&#36870;&#38556;&#30861;&#25955;&#23556;&#38382;&#39064;&#30340;&#28145;&#24230;&#20998;&#35299;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#25552;&#20379;&#19982;&#25955;&#23556;&#27169;&#22411;&#30456;&#20851;&#32852;&#30340;&#29289;&#29702;&#36816;&#31639;&#31526;&#65292;&#23454;&#29616;&#28145;&#24230;&#23398;&#20064;&#22312;&#36870;&#38382;&#39064;&#19978;&#24037;&#20316;&#65292;&#24182;&#36991;&#20813;&#25197;&#26354;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31181;&#38024;&#23545;&#26377;&#38480;&#23380;&#24452;&#36870;&#38556;&#30861;&#25955;&#23556;&#38382;&#39064;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#12290;&#20256;&#32479;&#28145;&#24230;&#23398;&#20064;&#20165;&#20381;&#36182;&#25968;&#25454;&#26159;&#20247;&#25152;&#21608;&#30693;&#30340;&#65292;&#24403;&#21482;&#26377;&#38388;&#25509;&#35266;&#27979;&#25968;&#25454;&#21644;&#19968;&#20010;&#29289;&#29702;&#27169;&#22411;&#21487;&#29992;&#26102;&#65292;&#36825;&#21487;&#33021;&#38480;&#21046;&#20854;&#22312;&#36870;&#38382;&#39064;&#19978;&#30340;&#24615;&#33021;&#12290;&#22312;&#38754;&#23545;&#36825;&#20123;&#23616;&#38480;&#24615;&#26102;&#65292;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#20986;&#29616;&#20102;&#65306;&#26159;&#21542;&#21487;&#33021;&#20351;&#28145;&#24230;&#23398;&#20064;&#33021;&#22815;&#22312;&#27809;&#26377;&#26631;&#35760;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#22788;&#29702;&#36870;&#38382;&#39064;&#65292;&#24182;&#19988;&#20102;&#35299;&#23427;&#27491;&#22312;&#23398;&#20064;&#30340;&#20869;&#23481;&#65311;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#36825;&#20123;&#30446;&#30340;&#30340;&#28145;&#24230;&#20998;&#35299;&#26041;&#27861;&#65288;DDM&#65289;&#65292;&#23427;&#19981;&#38656;&#35201;&#22320;&#38754;&#30495;&#23454;&#26631;&#31614;&#12290;&#23427;&#36890;&#36807;&#21521;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#25552;&#20379;&#19982;&#25955;&#23556;&#27169;&#22411;&#30456;&#20851;&#32852;&#30340;&#29289;&#29702;&#36816;&#31639;&#31526;&#26469;&#23454;&#29616;&#36825;&#19968;&#28857;&#12290;&#27492;&#22806;&#65292;DDM&#20013;&#36824;&#23454;&#29616;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#25968;&#25454;&#23436;&#25972;&#24615;&#26041;&#26696;&#65292;&#20197;&#38450;&#27490;&#25197;&#26354;&#26377;&#38480;&#23380;&#24452;&#25968;&#25454;&#30340;&#36870;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#27492;&#22806;&#65292;&#38500;&#20102;&#35299;&#20915;i
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19470v1 Announce Type: cross  Abstract: In this paper, we consider a deep learning approach to the limited aperture inverse obstacle scattering problem. It is well known that traditional deep learning relies solely on data, which may limit its performance for the inverse problem when only indirect observation data and a physical model are available. A fundamental question arises in light of these limitations: is it possible to enable deep learning to work on inverse problems without labeled data and to be aware of what it is learning? This work proposes a deep decomposition method (DDM) for such purposes, which does not require ground truth labels. It accomplishes this by providing physical operators associated with the scattering model to the neural network architecture. Additionally, a deep learning based data completion scheme is implemented in DDM to prevent distorting the solution of the inverse problem for limited aperture data. Furthermore, apart from addressing the i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22235;&#31181;&#26080;&#27491;&#20132;&#21270;&#26041;&#27861;&#20316;&#20026;&#35889;&#32858;&#31867;&#38477;&#32500;&#65292;&#19981;&#38656;&#35201;&#26114;&#36149;&#30340;&#29305;&#24449;&#20540;&#20272;&#35745;&#65292;&#22312;&#32858;&#31867;&#36136;&#37327;&#21644;&#35745;&#31639;&#25104;&#26412;&#26041;&#38754;&#22343;&#20248;&#20110;&#24050;&#26377;&#26041;&#27861;&#65292;&#36866;&#21512;&#20110;&#24182;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2305.10356</link><description>&lt;p&gt;
&#36890;&#36807;&#26080;&#27491;&#20132;&#21270;&#26041;&#27861;&#30340;&#35889;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
Spectral Clustering via Orthogonalization-Free Methods. (arXiv:2305.10356v1 [eess.SP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10356
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22235;&#31181;&#26080;&#27491;&#20132;&#21270;&#26041;&#27861;&#20316;&#20026;&#35889;&#32858;&#31867;&#38477;&#32500;&#65292;&#19981;&#38656;&#35201;&#26114;&#36149;&#30340;&#29305;&#24449;&#20540;&#20272;&#35745;&#65292;&#22312;&#32858;&#31867;&#36136;&#37327;&#21644;&#35745;&#31639;&#25104;&#26412;&#26041;&#38754;&#22343;&#20248;&#20110;&#24050;&#26377;&#26041;&#27861;&#65292;&#36866;&#21512;&#20110;&#24182;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35889;&#32858;&#31867;&#30340;&#38477;&#32500;&#20013;&#65292;&#36890;&#24120;&#20351;&#29992;&#22270;&#20449;&#21495;&#28388;&#27874;&#22120;&#38656;&#35201;&#26114;&#36149;&#30340;&#29305;&#24449;&#20540;&#20272;&#35745;&#12290;&#25105;&#20204;&#22312;&#26368;&#20248;&#21270;&#35774;&#32622;&#20013;&#20998;&#26512;&#20102;&#28388;&#27874;&#22120;&#24182;&#25552;&#20986;&#20351;&#29992;&#22235;&#31181;&#26080;&#27491;&#20132;&#21270;&#26041;&#27861;&#20316;&#20026;&#35889;&#32858;&#31867;&#20013;&#30340;&#38477;&#32500;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#19981;&#21033;&#29992;&#20219;&#20309;&#27491;&#20132;&#21270;&#26041;&#27861;&#65292;&#22312;&#24182;&#34892;&#35745;&#31639;&#29615;&#22659;&#20013;&#19981;&#21487;&#20280;&#32553;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#29702;&#35770;&#19978;&#26500;&#36896;&#20102;&#36275;&#22815;&#30340;&#29305;&#24449;&#31354;&#38388;&#65292;&#26368;&#22810;&#26159;&#35268;&#33539;&#21270;&#25289;&#26222;&#25289;&#26031;&#30697;&#38453;&#29305;&#24449;&#31354;&#38388;&#30340;&#21152;&#26435;&#25913;&#21464;&#12290;&#25105;&#20204;&#22312;&#25968;&#20540;&#19978;&#20551;&#35774;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#19982;&#21033;&#29992;&#31934;&#30830;&#29305;&#24449;&#20540;&#20294;&#38656;&#35201;&#26114;&#36149;&#29305;&#24449;&#20540;&#20272;&#35745;&#30340;&#29702;&#24819;&#22270;&#20449;&#21495;&#28388;&#27874;&#22120;&#22312;&#32858;&#31867;&#36136;&#37327;&#19978;&#31561;&#25928;&#12290;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#32858;&#31867;&#36136;&#37327;&#21644;&#35745;&#31639;&#25104;&#26412;&#26041;&#38754;&#20248;&#20110;&#22522;&#20110;&#24130;&#36845;&#20195;&#30340;&#26041;&#27861;&#21644;&#22270;&#20449;&#21495;&#28388;&#27874;&#22120;&#12290;&#19982;&#22522;&#20110;&#24130;&#36845;&#20195;&#30340;&#26041;&#27861;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#36731;&#26494;&#24182;&#34892;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph Signal Filter used as dimensionality reduction in spectral clustering usually requires expensive eigenvalue estimation. We analyze the filter in an optimization setting and propose to use four orthogonalization-free methods by optimizing objective functions as dimensionality reduction in spectral clustering. The proposed methods do not utilize any orthogonalization, which is known as not well scalable in a parallel computing environment. Our methods theoretically construct adequate feature space, which is, at most, a weighted alteration to the eigenspace of a normalized Laplacian matrix. We numerically hypothesize that the proposed methods are equivalent in clustering quality to the ideal Graph Signal Filter, which exploits the exact eigenvalue needed without expensive eigenvalue estimation. Numerical results show that the proposed methods outperform Power Iteration-based methods and Graph Signal Filter in clustering quality and computation cost. Unlike Power Iteration-based meth
&lt;/p&gt;</description></item></channel></rss>