<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#26368;&#20248;&#21644;&#36817;&#20284;&#26368;&#20248;&#30340;&#33258;&#36866;&#24212;&#21521;&#37327;&#37327;&#21270;&#31639;&#27861;&#65292;&#33021;&#22815;&#20248;&#21270;&#37327;&#21270;&#36807;&#31243;&#65292;&#22312;&#26102;&#38388;&#21644;&#31354;&#38388;&#22797;&#26434;&#24230;&#19978;&#20855;&#26377;&#25913;&#36827;&#65292;&#21487;&#25193;&#23637;&#24212;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#12290;</title><link>https://arxiv.org/abs/2402.03158</link><description>&lt;p&gt;
&#26368;&#20248;&#21644;&#36817;&#20284;&#26368;&#20248;&#30340;&#33258;&#36866;&#24212;&#21521;&#37327;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Optimal and Near-Optimal Adaptive Vector Quantization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03158
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#26368;&#20248;&#21644;&#36817;&#20284;&#26368;&#20248;&#30340;&#33258;&#36866;&#24212;&#21521;&#37327;&#37327;&#21270;&#31639;&#27861;&#65292;&#33021;&#22815;&#20248;&#21270;&#37327;&#21270;&#36807;&#31243;&#65292;&#22312;&#26102;&#38388;&#21644;&#31354;&#38388;&#22797;&#26434;&#24230;&#19978;&#20855;&#26377;&#25913;&#36827;&#65292;&#21487;&#25193;&#23637;&#24212;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#21270;&#26159;&#35768;&#22810;&#26426;&#22120;&#23398;&#20064;&#29992;&#20363;&#20013;&#30340;&#22522;&#26412;&#20248;&#21270;&#65292;&#21253;&#25324;&#21387;&#32553;&#26799;&#24230;&#12289;&#27169;&#22411;&#26435;&#37325;&#21644;&#28608;&#27963;&#20197;&#21450;&#25968;&#25454;&#38598;&#12290;&#26368;&#20934;&#30830;&#30340;&#37327;&#21270;&#24418;&#24335;&#26159;&#8220;&#33258;&#36866;&#24212;&#8221;&#65292;&#20854;&#20013;&#36890;&#36807;&#26368;&#23567;&#21270;&#30456;&#23545;&#20110;&#32473;&#23450;&#36755;&#20837;&#30340;&#35823;&#24046;&#26469;&#20248;&#21270;&#65292;&#32780;&#19981;&#26159;&#38024;&#23545;&#26368;&#22351;&#24773;&#20917;&#36827;&#34892;&#20248;&#21270;&#12290;&#28982;&#32780;&#65292;&#26368;&#20248;&#30340;&#33258;&#36866;&#24212;&#37327;&#21270;&#26041;&#27861;&#22312;&#36816;&#34892;&#26102;&#38388;&#21644;&#20869;&#23384;&#38656;&#27714;&#26041;&#38754;&#34987;&#35748;&#20026;&#26159;&#19981;&#21487;&#34892;&#30340;&#12290;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#33258;&#36866;&#24212;&#21521;&#37327;&#37327;&#21270;&#65288;AVQ&#65289;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#22312;&#28176;&#36817;&#25913;&#36827;&#30340;&#26102;&#38388;&#21644;&#31354;&#38388;&#22797;&#26434;&#24230;&#19979;&#25214;&#21040;&#26368;&#20248;&#35299;&#30340;&#31639;&#27861;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24555;&#36895;&#30340;&#36817;&#20284;&#26368;&#20248;&#31639;&#27861;&#65292;&#20197;&#22788;&#29702;&#22823;&#36755;&#20837;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#21487;&#33021;&#20250;&#22312;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#26356;&#24191;&#27867;&#22320;&#20351;&#29992;AVQ&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantization is a fundamental optimization for many machine-learning use cases, including compressing gradients, model weights and activations, and datasets. The most accurate form of quantization is \emph{adaptive}, where the error is minimized with respect to a given input, rather than optimizing for the worst case. However, optimal adaptive quantization methods are considered infeasible in terms of both their runtime and memory requirements.   We revisit the Adaptive Vector Quantization (AVQ) problem and present algorithms that find optimal solutions with asymptotically improved time and space complexity. We also present an even faster near-optimal algorithm for large inputs. Our experiments show our algorithms may open the door to using AVQ more extensively in a variety of machine learning applications.
&lt;/p&gt;</description></item></channel></rss>