<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#26080;&#20154;&#30417;&#30563;&#23398;&#20064;&#25216;&#26415;&#25506;&#32034;&#26080;&#32447;&#30005;&#39057;&#35889;&#27963;&#21160;&#65292;&#27604;&#36739;&#20102;&#20004;&#31181;&#19981;&#21516;&#30340;&#26080;&#20154;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#21644;&#19968;&#31181;&#28151;&#21512;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#31934;&#20934;&#30340;&#39057;&#35889;&#27963;&#21160;&#32858;&#31867;&#12290;</title><link>http://arxiv.org/abs/2210.02899</link><description>&lt;p&gt;
&#26080;&#20154;&#30417;&#30563;&#23398;&#20064;&#29992;&#20110;&#26080;&#32447;&#30005;&#39057;&#35889;&#27963;&#21160;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
Self-supervised Learning for Clustering of Wireless Spectrum Activity. (arXiv:2210.02899v2 [cs.NI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.02899
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#26080;&#20154;&#30417;&#30563;&#23398;&#20064;&#25216;&#26415;&#25506;&#32034;&#26080;&#32447;&#30005;&#39057;&#35889;&#27963;&#21160;&#65292;&#27604;&#36739;&#20102;&#20004;&#31181;&#19981;&#21516;&#30340;&#26080;&#20154;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#21644;&#19968;&#31181;&#28151;&#21512;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#31934;&#20934;&#30340;&#39057;&#35889;&#27963;&#21160;&#32858;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#22788;&#29702;&#26080;&#32447;&#30005;&#39057;&#35889;&#25968;&#25454;&#20197;&#35299;&#20915;&#35748;&#30693;&#26080;&#32447;&#30005;&#32593;&#32476;&#30456;&#20851;&#38382;&#39064;&#65292;&#22914;&#24322;&#24120;&#26816;&#27979;&#12289;&#35843;&#21046;&#20998;&#31867;&#12289;&#25216;&#26415;&#20998;&#31867;&#21644;&#35774;&#22791;&#25351;&#32441;&#31561;&#39046;&#22495;&#65292;&#21462;&#24471;&#20102;&#24456;&#22823;&#36827;&#23637;&#12290;&#22823;&#22810;&#25968;&#35299;&#20915;&#26041;&#26696;&#37117;&#26159;&#22522;&#20110;&#21463;&#25511;&#21046;&#30340;&#12289;&#24102;&#26631;&#31614;&#30340;&#25968;&#25454;&#65292;&#24182;&#20351;&#29992;&#30417;&#30563;&#24335;&#23398;&#20064;&#26041;&#27861;&#36827;&#34892;&#22788;&#29702;&#12290;&#28982;&#32780;&#65292;&#22312;&#29616;&#23454;&#19990;&#30028;&#29615;&#22659;&#19979;&#27979;&#37327;&#30340;&#39057;&#35889;&#25968;&#25454;&#39640;&#24230;&#19981;&#30830;&#23450;&#65292;&#20854;&#26631;&#35760;&#26159;&#19968;&#39033;&#36153;&#26102;&#19988;&#26114;&#36149;&#30340;&#36807;&#31243;&#65292;&#38656;&#35201;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#65292;&#22240;&#27492;&#25104;&#20026;&#22312;&#35813;&#39046;&#22495;&#20351;&#29992;&#30417;&#30563;&#24335;&#23398;&#20064;&#26041;&#27861;&#30340;&#20027;&#35201;&#32570;&#28857;&#20043;&#19968;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#29616;&#23454;&#19990;&#30028;&#26410;&#26631;&#35760;&#25968;&#25454;&#20013;&#21033;&#29992;&#26080;&#20154;&#30417;&#30563;&#23398;&#20064;&#65288;SSL&#65289;&#26469;&#25506;&#32034;&#39057;&#35889;&#27963;&#21160;&#30340;&#20351;&#29992;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#20004;&#31181; SSL &#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#19968;&#31181;&#22522;&#20110; DeepCluster &#21442;&#32771;&#20307;&#31995;&#32467;&#26500;&#65292;&#21478;&#19968;&#31181;&#36866;&#29992;&#20110;&#39057;&#35889;&#27963;&#21160;&#35782;&#21035;&#21644;&#32858;&#31867;&#65292;&#20197;&#21450;&#19968;&#31181;&#26032;&#22411;&#30340;&#28151;&#21512; SSL &#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#20004;&#31181;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#35780;&#20272;&#34920;&#26126;&#65292;&#36825;&#19977;&#31181;&#26041;&#27861;&#37117;&#21487;&#20197;&#26377;&#25928;&#22320;&#23545;&#39057;&#35889;&#27963;&#21160;&#25968;&#25454;&#36827;&#34892;&#32858;&#31867;&#65292;&#28151;&#21512;&#26041;&#27861;&#30340;&#24615;&#33021;&#26368;&#20339;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, much work has been done on processing of wireless spectrum data involving machine learning techniques in domain-related problems for cognitive radio networks, such as anomaly detection, modulation classification, technology classification and device fingerprinting. Most of the solutions are based on labeled data, created in a controlled manner and processed with supervised learning approaches. However, spectrum data measured in real-world environment is highly nondeterministic, making its labeling a laborious and expensive process, requiring domain expertise, thus being one of the main drawbacks of using supervised learning approaches in this domain. In this paper, we investigate the use of self-supervised learning (SSL) for exploring spectrum activities in a real-world unlabeled data. In particular, we compare the performance of two SSL models, one based on a reference DeepCluster architecture and one adapted for spectrum activity identification and clustering, and a 
&lt;/p&gt;</description></item></channel></rss>