<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#28145;&#24230;&#31639;&#23376;&#32593;&#32476;&#32467;&#26500;&#21551;&#21457;&#30340;&#20989;&#25968;SDE&#36817;&#20284;&#26041;&#27861;&#65292;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#39033;&#24335;&#28151;&#27788;&#23637;&#24320;&#23454;&#29616;&#23545;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#35299;&#30340;&#36817;&#20284;&#65292;&#24182;&#36890;&#36807;&#23398;&#20064;&#20943;&#36731;&#25351;&#25968;&#32423;&#22797;&#26434;&#24230;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.03028</link><description>&lt;p&gt;
&#21463;&#28145;&#24230;&#31639;&#23376;&#32593;&#32476;&#32467;&#26500;&#21551;&#21457;&#30340;&#20989;&#25968;SDE&#36817;&#20284;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Functional SDE approximation inspired by a deep operator network architecture
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03028
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#28145;&#24230;&#31639;&#23376;&#32593;&#32476;&#32467;&#26500;&#21551;&#21457;&#30340;&#20989;&#25968;SDE&#36817;&#20284;&#26041;&#27861;&#65292;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#39033;&#24335;&#28151;&#27788;&#23637;&#24320;&#23454;&#29616;&#23545;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#35299;&#30340;&#36817;&#20284;&#65292;&#24182;&#36890;&#36807;&#23398;&#20064;&#20943;&#36731;&#25351;&#25968;&#32423;&#22797;&#26434;&#24230;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#19968;&#31181;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#36817;&#20284;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;SDE&#65289;&#35299;&#30340;&#26032;&#26041;&#27861;&#12290;&#35813;&#32467;&#26500;&#28789;&#24863;&#26469;&#33258;&#20110;&#28145;&#24230;&#31639;&#23376;&#32593;&#32476;&#65288;DeepONets&#65289;&#30340;&#27010;&#24565;&#65292;&#23427;&#22522;&#20110;&#20989;&#25968;&#31354;&#38388;&#20013;&#30340;&#31639;&#23376;&#23398;&#20064;&#65292;&#20197;&#21450;&#22312;&#32593;&#32476;&#20013;&#34920;&#31034;&#30340;&#38477;&#32500;&#22522;&#30784;&#12290;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#38543;&#26426;&#36807;&#31243;&#30340;&#22810;&#39033;&#24335;&#28151;&#27788;&#23637;&#24320;&#65288;PCE&#65289;&#65292;&#24182;&#23558;&#30456;&#24212;&#30340;&#26550;&#26500;&#31216;&#20026;SDEONet&#12290;&#22312;&#21442;&#25968;&#21270;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#65288;UQ&#65289;&#39046;&#22495;&#20013;&#65292;PCE&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;SDE&#20013;&#24182;&#38750;&#22914;&#27492;&#65292;&#20256;&#32479;&#30340;&#37319;&#26679;&#26041;&#27861;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#32780;&#21151;&#33021;&#24615;&#26041;&#27861;&#24456;&#23569;&#35265;&#12290;&#25130;&#26029;&#30340;PCE&#23384;&#22312;&#19968;&#20010;&#20027;&#35201;&#25361;&#25112;&#65292;&#21363;&#38543;&#30528;&#26368;&#22823;&#22810;&#39033;&#24335;&#38454;&#25968;&#21644;&#22522;&#20989;&#25968;&#25968;&#37327;&#30340;&#22686;&#21152;&#65292;&#20998;&#37327;&#30340;&#25968;&#37327;&#21576;&#25351;&#25968;&#32423;&#22686;&#38271;&#12290;&#25152;&#25552;&#20986;&#30340;SDEONet&#32467;&#26500;&#26088;&#22312;&#36890;&#36807;&#23398;&#20064;&#26469;&#20943;&#36731;&#25351;&#25968;&#32423;&#22797;&#26434;&#24230;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
A novel approach to approximate solutions of Stochastic Differential Equations (SDEs) by Deep Neural Networks is derived and analysed. The architecture is inspired by the notion of Deep Operator Networks (DeepONets), which is based on operator learning in function spaces in terms of a reduced basis also represented in the network. In our setting, we make use of a polynomial chaos expansion (PCE) of stochastic processes and call the corresponding architecture SDEONet. The PCE has been used extensively in the area of uncertainty quantification (UQ) with parametric partial differential equations. This however is not the case with SDE, where classical sampling methods dominate and functional approaches are seen rarely. A main challenge with truncated PCEs occurs due to the drastic growth of the number of components with respect to the maximum polynomial degree and the number of basis elements. The proposed SDEONet architecture aims to alleviate the issue of exponential complexity by learni
&lt;/p&gt;</description></item></channel></rss>