<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21452;&#23384;&#20648;&#22120; RC &#31995;&#32479;&#65292;&#36890;&#36807;&#38598;&#25104;&#19981;&#21516;&#31867;&#22411;&#30340; memristor&#65292;&#24182;&#22312;&#22788;&#29702;&#26102;&#38388;&#25968;&#25454;&#20998;&#31867;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#25104;&#25928;&#12290;</title><link>https://arxiv.org/abs/2403.01827</link><description>&lt;p&gt;
&#20998;&#26512;&#21644;&#22522;&#20110;&#20840; memristor &#30340;&#26102;&#38388;&#25968;&#25454;&#20998;&#31867;&#30340;&#20648;&#23618;&#35745;&#31639;
&lt;/p&gt;
&lt;p&gt;
Analysis and Fully Memristor-based Reservoir Computing for Temporal Data Classification
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01827
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21452;&#23384;&#20648;&#22120; RC &#31995;&#32479;&#65292;&#36890;&#36807;&#38598;&#25104;&#19981;&#21516;&#31867;&#22411;&#30340; memristor&#65292;&#24182;&#22312;&#22788;&#29702;&#26102;&#38388;&#25968;&#25454;&#20998;&#31867;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#25104;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01827v1 &#20844;&#21578;&#31867;&#22411;: &#20132;&#21449;&#25688;&#35201;: &#20648;&#23618;&#35745;&#31639;&#65288;RC&#65289;&#25552;&#20379;&#20102;&#19968;&#20010;&#29305;&#21035;&#36866;&#29992;&#20110;&#22788;&#29702;&#26102;&#31354;&#20449;&#21495;&#30340;&#31070;&#32463;&#24418;&#24577;&#23398;&#26694;&#26550;&#12290;RC&#20197;&#20854;&#26102;&#38388;&#22788;&#29702;&#33021;&#21147;&#32780;&#38395;&#21517;&#65292;&#19982;&#20256;&#32479;&#30340;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#30456;&#27604;&#65292;&#26174;&#33879;&#38477;&#20302;&#20102;&#35757;&#32451;&#25104;&#26412;&#12290;&#20854;&#30828;&#20214;&#37096;&#32626;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#26159;&#33021;&#22815;&#29983;&#25104;&#21160;&#24577;&#20648;&#23618;&#29366;&#24577;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21452;&#37325;&#23384;&#20648;&#22120; RC &#31995;&#32479;&#65292;&#38598;&#25104;&#20102;&#19968;&#31181;&#22522;&#20110; WOx &#30340; memristor &#30340;&#30701;&#26399;&#23384;&#20648;&#22120;&#65292;&#33021;&#22815;&#23454;&#29616; 16 &#20010;&#19981;&#21516;&#29366;&#24577;&#30340;&#32534;&#30721;&#36229;&#36807; 4 &#20010;&#27604;&#29305;&#65292;&#24182;&#22312;&#35835;&#20986;&#23618;&#20013;&#20351;&#29992; TiOx-based memristor &#30340;&#38271;&#26399;&#23384;&#20648;&#22120;&#32452;&#20214;&#12290;&#25105;&#20204;&#24443;&#24213;&#30740;&#31350;&#20102;&#20004;&#31181; memristor &#31867;&#22411;&#65292;&#24182;&#21033;&#29992; RC &#31995;&#32479;&#22788;&#29702;&#26102;&#38388;&#25968;&#25454;&#38598;&#12290;&#25152;&#25552;&#20986;&#30340; RC &#31995;&#32479;&#30340;&#24615;&#33021;&#36890;&#36807;&#20004;&#20010;&#22522;&#20934;&#20219;&#21153;&#36827;&#34892;&#20102;&#39564;&#35777;: &#23545;&#20855;&#26377;&#19981;&#23436;&#25972;&#36755;&#20837;&#30340;&#23396;&#31435;&#21475;&#36848;&#25968;&#23383;&#35782;&#21035;&#21644; Mackey-Glass &#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#12290;&#35813;&#31995;&#32479;&#25552;&#20379;&#20102;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340; 98.84% &#20934;&#30830;&#29575;.
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01827v1 Announce Type: cross  Abstract: Reservoir computing (RC) offers a neuromorphic framework that is particularly effective for processing spatiotemporal signals. Known for its temporal processing prowess, RC significantly lowers training costs compared to conventional recurrent neural networks. A key component in its hardware deployment is the ability to generate dynamic reservoir states. Our research introduces a novel dual-memory RC system, integrating a short-term memory via a WOx-based memristor, capable of achieving 16 distinct states encoded over 4 bits, and a long-term memory component using a TiOx-based memristor within the readout layer. We thoroughly examine both memristor types and leverage the RC system to process temporal data sets. The performance of the proposed RC system is validated through two benchmark tasks: isolated spoken digit recognition with incomplete inputs and Mackey-Glass time series prediction. The system delivered an impressive 98.84% accu
&lt;/p&gt;</description></item></channel></rss>