<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#20999;&#29255;&#21644;&#37197;&#20934;&#36807;&#31243;&#23450;&#20041;&#30340;&#27979;&#37327;&#36716;&#31227;&#21644;&#36924;&#36817;&#38382;&#39064;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#24182;&#23545;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#26041;&#26696;&#25552;&#20379;&#20102;&#20960;&#20046;&#24517;&#28982;&#25910;&#25947;&#30340;&#35777;&#26126;&#12290;</title><link>http://arxiv.org/abs/2307.05705</link><description>&lt;p&gt;
&#36890;&#36807;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#36827;&#34892;&#27979;&#37327;&#36716;&#31227;
&lt;/p&gt;
&lt;p&gt;
Measure transfer via stochastic slicing and matching. (arXiv:2307.05705v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05705
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#20999;&#29255;&#21644;&#37197;&#20934;&#36807;&#31243;&#23450;&#20041;&#30340;&#27979;&#37327;&#36716;&#31227;&#21644;&#36924;&#36817;&#38382;&#39064;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#24182;&#23545;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#26041;&#26696;&#25552;&#20379;&#20102;&#20960;&#20046;&#24517;&#28982;&#25910;&#25947;&#30340;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#20999;&#29255;&#21644;&#37197;&#20934;&#36807;&#31243;&#23450;&#20041;&#30340;&#27979;&#37327;&#36716;&#31227;&#21644;&#36924;&#36817;&#38382;&#39064;&#30340;&#36845;&#20195;&#26041;&#26696;&#12290;&#31867;&#20284;&#20110;&#20999;&#29255;Wasserstein&#36317;&#31163;&#65292;&#36825;&#20123;&#26041;&#26696;&#21463;&#30410;&#20110;&#19968;&#32500;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#30340;&#38381;&#24335;&#35299;&#30340;&#21487;&#29992;&#24615;&#21644;&#30456;&#20851;&#35745;&#31639;&#20248;&#21183;&#12290;&#23613;&#31649;&#36825;&#20123;&#26041;&#26696;&#24050;&#32463;&#22312;&#25968;&#25454;&#31185;&#23398;&#24212;&#29992;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#20851;&#20110;&#23427;&#20204;&#30340;&#25910;&#25947;&#24615;&#30340;&#32467;&#26524;&#19981;&#22826;&#22810;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#23545;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#26041;&#26696;&#25552;&#20379;&#20102;&#20960;&#20046;&#24517;&#28982;&#25910;&#25947;&#30340;&#35777;&#26126;&#12290;&#35813;&#35777;&#26126;&#24314;&#31435;&#22312;&#23558;&#20854;&#35299;&#37322;&#20026;Wasserstein&#31354;&#38388;&#19978;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#26041;&#26696;&#30340;&#22522;&#30784;&#20043;&#19978;&#12290;&#21516;&#26102;&#36824;&#23637;&#31034;&#20102;&#20851;&#20110;&#36880;&#27493;&#22270;&#20687;&#21464;&#24418;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies iterative schemes for measure transfer and approximation problems, which are defined through a slicing-and-matching procedure. Similar to the sliced Wasserstein distance, these schemes benefit from the availability of closed-form solutions for the one-dimensional optimal transport problem and the associated computational advantages. While such schemes have already been successfully utilized in data science applications, not too many results on their convergence are available. The main contribution of this paper is an almost sure convergence proof for stochastic slicing-and-matching schemes. The proof builds on an interpretation as a stochastic gradient descent scheme on the Wasserstein space. Numerical examples on step-wise image morphing are demonstrated as well.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#19968;&#20010;&#23454;&#23545;&#31216;&#24352;&#37327;&#20998;&#35299;&#25104;&#31209;&#20026;1&#39033;&#20043;&#21644;&#30340;&#38750;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#31934;&#30830;&#30340;&#20998;&#26512;&#20272;&#35745;&#65292;&#24182;&#21457;&#29616;&#20102;&#21508;&#31181;&#38459;&#30861;&#23616;&#37096;&#20248;&#21270;&#26041;&#27861;&#30340;&#20960;&#20309;&#38556;&#30861;&#21644;&#30001;&#20110;&#23545;&#31216;&#24615;&#23548;&#33268;&#30340;&#20016;&#23500;&#30340;&#20020;&#30028;&#28857;&#38598;&#21512;&#12290;</title><link>http://arxiv.org/abs/2306.07886</link><description>&lt;p&gt;
&#23545;&#31216;&#24352;&#37327;&#20998;&#35299;&#38382;&#39064;&#30340;&#23545;&#31216;&#24615;&#19982;&#20020;&#30028;&#28857;
&lt;/p&gt;
&lt;p&gt;
Symmetry &amp; Critical Points for Symmetric Tensor Decompositions Problems. (arXiv:2306.07886v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07886
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#19968;&#20010;&#23454;&#23545;&#31216;&#24352;&#37327;&#20998;&#35299;&#25104;&#31209;&#20026;1&#39033;&#20043;&#21644;&#30340;&#38750;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#31934;&#30830;&#30340;&#20998;&#26512;&#20272;&#35745;&#65292;&#24182;&#21457;&#29616;&#20102;&#21508;&#31181;&#38459;&#30861;&#23616;&#37096;&#20248;&#21270;&#26041;&#27861;&#30340;&#20960;&#20309;&#38556;&#30861;&#21644;&#30001;&#20110;&#23545;&#31216;&#24615;&#23548;&#33268;&#30340;&#20016;&#23500;&#30340;&#20020;&#30028;&#28857;&#38598;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#23558;&#19968;&#20010;&#23454;&#23545;&#31216;&#24352;&#37327;&#20998;&#35299;&#25104;&#31209;&#20026;1&#39033;&#20043;&#21644;&#30340;&#38750;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;&#21033;&#29992;&#20854;&#20016;&#23500;&#30340;&#23545;&#31216;&#32467;&#26500;&#65292;&#23548;&#20986;Puiseux&#32423;&#25968;&#34920;&#31034;&#30340;&#19968;&#31995;&#21015;&#20020;&#30028;&#28857;&#65292;&#24182;&#33719;&#24471;&#20102;&#20851;&#20110;&#20020;&#30028;&#20540;&#21644;Hessian&#35889;&#30340;&#31934;&#30830;&#20998;&#26512;&#20272;&#35745;&#12290;&#36825;&#20123;&#32467;&#26524;&#25581;&#31034;&#20102;&#21508;&#31181;&#20960;&#20309;&#38556;&#30861;&#65292;&#38459;&#30861;&#20102;&#23616;&#37096;&#20248;&#21270;&#26041;&#27861;&#30340;&#20351;&#29992;&#65292;&#26368;&#21518;&#65292;&#21033;&#29992;&#19968;&#20010;&#29275;&#39039;&#22810;&#38754;&#20307;&#35770;&#35777;&#20102;&#22266;&#23450;&#23545;&#31216;&#24615;&#30340;&#25152;&#26377;&#20020;&#30028;&#28857;&#30340;&#23436;&#20840;&#26522;&#20030;&#65292;&#24182;&#35777;&#26126;&#20102;&#19982;&#20840;&#23616;&#26368;&#23567;&#20540;&#30340;&#38598;&#21512;&#30456;&#27604;&#65292;&#30001;&#20110;&#23545;&#31216;&#24615;&#30340;&#23384;&#22312;&#65292;&#20020;&#30028;&#28857;&#30340;&#38598;&#21512;&#21487;&#33021;&#20250;&#26174;&#31034;&#20986;&#32452;&#21512;&#30340;&#20016;&#23500;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the non-convex optimization problem associated with the decomposition of a real symmetric tensor into a sum of rank one terms. Use is made of the rich symmetry structure to derive Puiseux series representations of families of critical points, and so obtain precise analytic estimates on the critical values and the Hessian spectrum. The sharp results make possible an analytic characterization of various geometric obstructions to local optimization methods, revealing in particular a complex array of saddles and local minima which differ by their symmetry, structure and analytic properties. A desirable phenomenon, occurring for all critical points considered, concerns the index of a point, i.e., the number of negative Hessian eigenvalues, increasing with the value of the objective function. Lastly, a Newton polytope argument is used to give a complete enumeration of all critical points of fixed symmetry, and it is shown that contrarily to the set of global minima which remains 
&lt;/p&gt;</description></item></channel></rss>