<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#39118;&#38505;&#25935;&#24863;&#30340;&#24180;&#40836;&#24230;&#37327;&#26368;&#23567;&#21270;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#27010;&#24565;&#21644;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;&#20004;&#31181;&#39118;&#38505;&#25935;&#24863;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2401.10265</link><description>&lt;p&gt;
&#26368;&#20339;&#26356;&#26032;&#26102;&#38388;&#65306;&#22522;&#20110;&#39118;&#38505;&#25935;&#24863;&#30340;&#24180;&#40836;&#24230;&#37327;&#26368;&#23567;&#21270;
&lt;/p&gt;
&lt;p&gt;
The Best Time for an Update: Risk-Sensitive Minimization of Age-Based Metrics. (arXiv:2401.10265v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10265
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#39118;&#38505;&#25935;&#24863;&#30340;&#24180;&#40836;&#24230;&#37327;&#26368;&#23567;&#21270;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#27010;&#24565;&#21644;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;&#20004;&#31181;&#39118;&#38505;&#25935;&#24863;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#34892;&#30340;&#37327;&#21270;&#20256;&#36755;&#25968;&#25454;&#36136;&#37327;&#30340;&#26041;&#27861;&#21253;&#25324;&#20449;&#24687;&#24180;&#40836;&#65288;Age of Information&#65292;AoI&#65289;&#65292;&#26597;&#35810;&#20449;&#24687;&#24180;&#40836;&#65288;Query Age of Information&#65292;QAoI&#65289;&#21644;&#19981;&#27491;&#30830;&#20449;&#24687;&#24180;&#40836;&#65288;Age of Incorrect Information&#65292;AoII&#65289;&#12290;&#25105;&#20204;&#32771;&#34385;&#22312;&#28857;&#23545;&#28857;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#20013;&#20351;&#29992;&#36825;&#20123;&#24230;&#37327;&#65292;&#21457;&#36865;&#26041;&#30417;&#35270;&#19968;&#20010;&#36827;&#31243;&#24182;&#21521;&#25509;&#25910;&#26041;&#21457;&#36865;&#29366;&#24577;&#26356;&#26032;&#12290;&#25105;&#20204;&#30340;&#25361;&#25112;&#26159;&#20915;&#23450;&#26356;&#26032;&#30340;&#26368;&#20339;&#26102;&#38388;&#65292;&#24179;&#34913;&#20256;&#36755;&#33021;&#37327;&#21644;&#25509;&#25910;&#26041;&#30340;&#24180;&#40836;&#24230;&#37327;&#12290;&#30001;&#20110;&#39640;&#24180;&#40836;&#24230;&#37327;&#20540;&#24341;&#36215;&#30340;&#19981;&#31283;&#23450;&#31995;&#32479;&#29366;&#24577;&#31561;&#38382;&#39064;&#30340;&#22266;&#26377;&#39118;&#38505;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#30340;&#27010;&#24565;&#26469;&#34920;&#31034;&#24180;&#40836;&#24230;&#37327;&#39640;&#30340;&#29366;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#20010;&#26032;&#30340;&#39118;&#38505;&#29366;&#24577;&#27010;&#24565;&#26469;&#37327;&#21270;&#21644;&#26368;&#23567;&#21270;&#39640;&#24180;&#40836;&#24230;&#37327;&#30340;&#39118;&#38505;&#65292;&#36890;&#36807;&#30452;&#25509;&#23548;&#20986;&#39118;&#38505;&#29366;&#24577;&#30340;&#39057;&#29575;&#20316;&#20026;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#20004;&#31181;&#38024;&#23545;AoI&#65292;QAoI&#21644;AoII&#30340;&#39118;&#38505;&#25935;&#24863;&#31574;&#30053;&#12290;&#31532;&#19968;&#31181;&#31574;&#30053;&#20351;&#29992;&#31995;&#32479;&#30693;&#35782;&#65292;
&lt;/p&gt;
&lt;p&gt;
Popular methods to quantify transmitted data quality are the Age of Information (AoI), the Query Age of Information (QAoI), and the Age of Incorrect Information (AoII). We consider these metrics in a point-to-point wireless communication system, where the transmitter monitors a process and sends status updates to a receiver. The challenge is to decide on the best time for an update, balancing the transmission energy and the age-based metric at the receiver. Due to the inherent risk of high age-based metric values causing complications such as unstable system states, we introduce the new concept of risky states to denote states with high age-based metric. We use this new notion of risky states to quantify and minimize this risk of experiencing high age-based metrics by directly deriving the frequency of risky states as a novel risk-metric. Building on this foundation, we introduce two risk-sensitive strategies for AoI, QAoI and AoII. The first strategy uses system knowledge, i.e., chann
&lt;/p&gt;</description></item></channel></rss>