<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#22312;&#20449;&#21495;&#21152;&#38543;&#26426;&#39640;&#26031;&#22122;&#22768;&#30697;&#38453;&#27169;&#22411;&#30340;&#32972;&#26223;&#19979;&#65292;&#25193;&#23637;&#20102;&#23545;&#22855;&#24322;&#21521;&#37327;&#21644;&#22855;&#24322;&#23376;&#31354;&#38388;&#25200;&#21160;&#30340;Wedin-Davis-Kahan&#23450;&#29702;&#65292;&#33719;&#24471;&#20102;&#22855;&#24322;&#21521;&#37327;&#21644;&#22855;&#24322;&#23376;&#31354;&#38388;&#30340;&#32454;&#31890;&#24230;&#20998;&#26512;&#32467;&#26524;&#65292;&#24182;&#25506;&#32034;&#20102;&#19982;&#22855;&#24322;&#21521;&#37327;&#30456;&#20851;&#30340;&#32447;&#24615;&#21644;&#21452;&#32447;&#24615;&#20989;&#25968;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;&#36825;&#20123;&#21457;&#29616;&#22312;&#39640;&#26031;&#28151;&#21512;&#27169;&#22411;&#21644;&#23376;&#30697;&#38453;&#23450;&#20301;&#38382;&#39064;&#20013;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.09170</link><description>&lt;p&gt;
&#38543;&#26426;&#25200;&#21160;&#19979;&#22855;&#24322;&#23376;&#31354;&#38388;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Analysis of singular subspaces under random perturbations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09170
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20449;&#21495;&#21152;&#38543;&#26426;&#39640;&#26031;&#22122;&#22768;&#30697;&#38453;&#27169;&#22411;&#30340;&#32972;&#26223;&#19979;&#65292;&#25193;&#23637;&#20102;&#23545;&#22855;&#24322;&#21521;&#37327;&#21644;&#22855;&#24322;&#23376;&#31354;&#38388;&#25200;&#21160;&#30340;Wedin-Davis-Kahan&#23450;&#29702;&#65292;&#33719;&#24471;&#20102;&#22855;&#24322;&#21521;&#37327;&#21644;&#22855;&#24322;&#23376;&#31354;&#38388;&#30340;&#32454;&#31890;&#24230;&#20998;&#26512;&#32467;&#26524;&#65292;&#24182;&#25506;&#32034;&#20102;&#19982;&#22855;&#24322;&#21521;&#37327;&#30456;&#20851;&#30340;&#32447;&#24615;&#21644;&#21452;&#32447;&#24615;&#20989;&#25968;&#65292;&#21516;&#26102;&#25506;&#35752;&#20102;&#36825;&#20123;&#21457;&#29616;&#22312;&#39640;&#26031;&#28151;&#21512;&#27169;&#22411;&#21644;&#23376;&#30697;&#38453;&#23450;&#20301;&#38382;&#39064;&#20013;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#20449;&#21495;&#21152;&#38543;&#26426;&#39640;&#26031;&#22122;&#22768;&#30697;&#38453;&#27169;&#22411;&#30340;&#32972;&#26223;&#19979;&#65292;&#23545;&#22855;&#24322;&#21521;&#37327;&#21644;&#22855;&#24322;&#23376;&#31354;&#38388;&#30340;&#25200;&#21160;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#12290;&#20551;&#35774;&#19968;&#20010;&#20302;&#31209;&#20449;&#21495;&#30697;&#38453;&#65292;&#25105;&#20204;&#20197;&#19968;&#31181;&#23436;&#20840;&#27867;&#21270;&#30340;&#26041;&#24335;&#25193;&#23637;&#20102;Wedin-Davis-Kahan&#23450;&#29702;&#65292;&#36866;&#29992;&#20110;&#20219;&#20309;&#37193;&#19981;&#21464;&#30697;&#38453;&#33539;&#25968;&#65292;&#25193;&#23637;&#20102;O'Rourke&#12289;Vu&#21644;&#20316;&#32773;&#20043;&#21069;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#36824;&#33719;&#24471;&#20102;&#32454;&#31890;&#24230;&#30340;&#32467;&#26524;&#65292;&#20854;&#20013;&#21253;&#25324;&#22855;&#24322;&#21521;&#37327;&#30340;$\ell_\infty$&#20998;&#26512;&#65292;&#22855;&#24322;&#23376;&#31354;&#38388;&#30340;$\ell_{2,\infty}$&#20998;&#26512;&#65292;&#20197;&#21450;&#19982;&#22855;&#24322;&#21521;&#37327;&#30456;&#20851;&#30340;&#32447;&#24615;&#21644;&#21452;&#32447;&#24615;&#20989;&#25968;&#30340;&#25506;&#32034;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#36825;&#20123;&#21457;&#29616;&#22312;&#39640;&#26031;&#28151;&#21512;&#27169;&#22411;&#21644;&#23376;&#30697;&#38453;&#23450;&#20301;&#38382;&#39064;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09170v1 Announce Type: cross  Abstract: We present a comprehensive analysis of singular vector and singular subspace perturbations in the context of the signal plus random Gaussian noise matrix model. Assuming a low-rank signal matrix, we extend the Wedin-Davis-Kahan theorem in a fully generalized manner, applicable to any unitarily invariant matrix norm, extending previous results of O'Rourke, Vu and the author. We also obtain the fine-grained results, which encompass the $\ell_\infty$ analysis of singular vectors, the $\ell_{2, \infty}$ analysis of singular subspaces, as well as the exploration of linear and bilinear functions related to the singular vectors. Moreover, we explore the practical implications of these findings, in the context of the Gaussian mixture model and the submatrix localization problem.
&lt;/p&gt;</description></item></channel></rss>