<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#35770;&#25991;&#27010;&#36848;&#20102;&#20351;&#29992;&#21464;&#20998;&#26041;&#27861;&#21644;&#26426;&#22120;&#23398;&#20064;&#35299;&#20915;&#25104;&#20687;&#20013;&#36870;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#37325;&#28857;&#22312;&#20110;&#28857;&#20272;&#35745;&#22120;&#23545;&#25239;&#24615;&#25200;&#21160;&#19979;&#30340;&#40065;&#26834;&#24615;&#20197;&#21450;&#25506;&#32034;&#25968;&#25454;&#19968;&#33268;&#35299;&#23376;&#31354;&#38388;&#20197;&#28385;&#36275;&#29305;&#23450;&#35821;&#20041;&#25110;&#32441;&#29702;&#29305;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.12072</link><description>&lt;p&gt;
&#21464;&#20998;&#26041;&#27861;&#19982;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#36870;&#38382;&#39064;&#20013;&#30340;&#40065;&#26834;&#24615;&#21644;&#25506;&#32034;&#65306;&#27010;&#36848;
&lt;/p&gt;
&lt;p&gt;
Robustness and Exploration of Variational and Machine Learning Approaches to Inverse Problems: An Overview
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12072
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#27010;&#36848;&#20102;&#20351;&#29992;&#21464;&#20998;&#26041;&#27861;&#21644;&#26426;&#22120;&#23398;&#20064;&#35299;&#20915;&#25104;&#20687;&#20013;&#36870;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#37325;&#28857;&#22312;&#20110;&#28857;&#20272;&#35745;&#22120;&#23545;&#25239;&#24615;&#25200;&#21160;&#19979;&#30340;&#40065;&#26834;&#24615;&#20197;&#21450;&#25506;&#32034;&#25968;&#25454;&#19968;&#33268;&#35299;&#23376;&#31354;&#38388;&#20197;&#28385;&#36275;&#29305;&#23450;&#35821;&#20041;&#25110;&#32441;&#29702;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35797;&#22270;&#27010;&#36848;&#20351;&#29992;&#21464;&#20998;&#26041;&#27861;&#21644;&#26426;&#22120;&#23398;&#20064;&#26469;&#35299;&#20915;&#25104;&#20687;&#20013;&#36870;&#38382;&#39064;&#30340;&#24403;&#21069;&#26041;&#27861;&#12290;&#37325;&#28857;&#20851;&#27880;&#28857;&#20272;&#35745;&#22120;&#21450;&#20854;&#23545;&#25239;&#24615;&#25200;&#21160;&#19979;&#30340;&#40065;&#26834;&#24615;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#19968;&#32500;&#31034;&#20363;&#38382;&#39064;&#30340;&#25968;&#20540;&#23454;&#39564;&#32467;&#26524;&#65292;&#23637;&#31034;&#20102;&#19981;&#21516;&#26041;&#27861;&#30340;&#40065;&#26834;&#24615;&#24182;&#22312;&#32463;&#39564;&#19978;&#39564;&#35777;&#20102;&#29702;&#35770;&#20445;&#35777;&#12290;&#35813;&#32508;&#36848;&#30340;&#21478;&#19968;&#20010;&#37325;&#28857;&#26159;&#36890;&#36807;&#26126;&#30830;&#25351;&#23548;&#26469;&#25506;&#32034;&#25968;&#25454;&#19968;&#33268;&#35299;&#30340;&#23376;&#31354;&#38388;&#65292;&#20197;&#28385;&#36275;&#29305;&#23450;&#35821;&#20041;&#25110;&#32441;&#29702;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12072v1 Announce Type: cross  Abstract: This paper attempts to provide an overview of current approaches for solving inverse problems in imaging using variational methods and machine learning. A special focus lies on point estimators and their robustness against adversarial perturbations. In this context results of numerical experiments for a one-dimensional toy problem are provided, showing the robustness of different approaches and empirically verifying theoretical guarantees. Another focus of this review is the exploration of the subspace of data consistent solutions through explicit guidance to satisfy specific semantic or textural properties.
&lt;/p&gt;</description></item></channel></rss>