<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#21452;&#23610;&#24230;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#35299;&#20915;&#20855;&#26377;&#23567;&#21442;&#25968;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#30452;&#25509;&#23558;&#23567;&#21442;&#25968;&#32435;&#20837;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#20013;&#65292;&#20174;&#32780;&#31616;&#21270;&#35299;&#20915;&#36807;&#31243;&#65292;&#24182;&#33021;&#22815;&#21512;&#29702;&#20934;&#30830;&#22320;&#25429;&#25417;&#30001;&#23567;&#21442;&#25968;&#24341;&#36215;&#30340;&#35299;&#20013;&#22823;&#23548;&#25968;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2402.17232</link><description>&lt;p&gt;
&#20855;&#26377;&#23567;&#21442;&#25968;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#21452;&#23610;&#24230;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Two-scale Neural Networks for Partial Differential Equations with Small Parameters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17232
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#21452;&#23610;&#24230;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#35299;&#20915;&#20855;&#26377;&#23567;&#21442;&#25968;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#30452;&#25509;&#23558;&#23567;&#21442;&#25968;&#32435;&#20837;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#20013;&#65292;&#20174;&#32780;&#31616;&#21270;&#35299;&#20915;&#36807;&#31243;&#65292;&#24182;&#33021;&#22815;&#21512;&#29702;&#20934;&#30830;&#22320;&#25429;&#25417;&#30001;&#23567;&#21442;&#25968;&#24341;&#36215;&#30340;&#35299;&#20013;&#22823;&#23548;&#25968;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#35299;&#20915;&#20855;&#26377;&#23567;&#21442;&#25968;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDEs&#65289;&#30340;&#21452;&#23610;&#24230;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#12290;&#25105;&#20204;&#30452;&#25509;&#23558;&#23567;&#21442;&#25968;&#32435;&#20837;&#31070;&#32463;&#32593;&#32476;&#30340;&#26550;&#26500;&#20013;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20351;&#24471;&#20197;&#31616;&#21333;&#26041;&#24335;&#35299;&#20915;&#20855;&#26377;&#23567;&#21442;&#25968;&#30340;PDE&#25104;&#20026;&#21487;&#33021;&#65292;&#32780;&#26080;&#38656;&#28155;&#21152;&#20613;&#37324;&#21494;&#29305;&#24449;&#25110;&#20854;&#20182;&#35745;&#31639;&#32321;&#29712;&#30340;&#25130;&#26029;&#21442;&#25968;&#25628;&#32034;&#12290;&#22810;&#20010;&#25968;&#20540;&#20363;&#23376;&#23637;&#31034;&#20102;&#22312;&#35299;&#20915;&#30001;&#23567;&#21442;&#25968;&#24341;&#36215;&#30340;&#35299;&#20013;&#22823;&#23548;&#25968;&#29305;&#24449;&#26102;&#30340;&#21512;&#29702;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17232v1 Announce Type: cross  Abstract: We propose a two-scale neural network method for solving partial differential equations (PDEs) with small parameters using physics-informed neural networks (PINNs). We directly incorporate the small parameters into the architecture of neural networks. The proposed method enables solving PDEs with small parameters in a simple fashion, without adding Fourier features or other computationally taxing searches of truncation parameters. Various numerical examples demonstrate reasonable accuracy in capturing features of large derivatives in the solutions caused by small parameters.
&lt;/p&gt;</description></item></channel></rss>