<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20998;&#23618;&#24352;&#37327;&#33609;&#22270;&#26469;&#36817;&#20284;&#39640;&#32500;&#27010;&#29575;&#23494;&#24230;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#22855;&#24322;&#20540;&#20998;&#35299;&#25216;&#26415;&#35299;&#20915;&#32447;&#24615;&#26041;&#31243;&#36798;&#21040;&#27492;&#30446;&#30340;&#65292;&#20854;&#31639;&#27861;&#22797;&#26434;&#24230;&#22312;&#39640;&#32500;&#23494;&#24230;&#32500;&#24230;&#19978;&#21576;&#32447;&#24615;&#35268;&#27169;&#12290;</title><link>http://arxiv.org/abs/2304.05305</link><description>&lt;p&gt;
&#22522;&#20110;&#20998;&#23618;&#24352;&#37327;&#33609;&#22270;&#30340;&#29983;&#25104;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Generative Modeling via Hierarchical Tensor Sketching. (arXiv:2304.05305v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05305
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20998;&#23618;&#24352;&#37327;&#33609;&#22270;&#26469;&#36817;&#20284;&#39640;&#32500;&#27010;&#29575;&#23494;&#24230;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#22855;&#24322;&#20540;&#20998;&#35299;&#25216;&#26415;&#35299;&#20915;&#32447;&#24615;&#26041;&#31243;&#36798;&#21040;&#27492;&#30446;&#30340;&#65292;&#20854;&#31639;&#27861;&#22797;&#26434;&#24230;&#22312;&#39640;&#32500;&#23494;&#24230;&#32500;&#24230;&#19978;&#21576;&#32447;&#24615;&#35268;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#32463;&#39564;&#20998;&#24067;&#26469;&#36817;&#20284;&#39640;&#32500;&#27010;&#29575;&#23494;&#24230;&#30340;&#20998;&#23618;&#24352;&#37327;&#32593;&#32476;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#38543;&#26426;&#22855;&#24322;&#20540;&#20998;&#35299;&#65288;SVD&#65289;&#25216;&#26415;&#65292;&#24182;&#28041;&#21450;&#22312;&#35813;&#24352;&#37327;&#32593;&#32476;&#20013;&#35299;&#32447;&#24615;&#26041;&#31243;&#20197;&#33719;&#24471;&#24352;&#37327;&#26680;&#24515;&#12290;&#35813;&#31639;&#27861;&#30340;&#22797;&#26434;&#24615;&#22312;&#39640;&#32500;&#23494;&#24230;&#30340;&#32500;&#24230;&#19978;&#21576;&#32447;&#24615;&#35268;&#27169;&#12290;&#36890;&#36807;&#20960;&#20010;&#25968;&#20540;&#23454;&#39564;&#65292;&#23545;&#20272;&#35745;&#35823;&#24046;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#27492;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a hierarchical tensor-network approach for approximating high-dimensional probability density via empirical distribution. This leverages randomized singular value decomposition (SVD) techniques and involves solving linear equations for tensor cores in this tensor network. The complexity of the resulting algorithm scales linearly in the dimension of the high-dimensional density. An analysis of estimation error demonstrates the effectiveness of this method through several numerical experiments.
&lt;/p&gt;</description></item></channel></rss>