<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>ServeFlow&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;-&#24930;&#36895;&#27169;&#22411;&#26550;&#26500;&#65292;&#29992;&#20110;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#12290;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#25910;&#38598;&#25968;&#25454;&#21253;&#30340;&#25968;&#37327;&#21644;&#24212;&#29992;&#20110;&#19981;&#21516;&#27969;&#37327;&#30340;&#27169;&#22411;&#65292;ServeFlow&#23454;&#29616;&#20102;&#26368;&#23567;&#24310;&#36831;&#12289;&#39640;&#26381;&#21153;&#29575;&#21644;&#39640;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ServeFlow&#33021;&#22815;&#22312;16ms&#20869;&#23545;76.3%&#30340;&#27969;&#37327;&#36827;&#34892;&#25512;&#29702;&#65292;&#36825;&#26159;&#20013;&#20301;&#25968;&#25512;&#29702;&#26102;&#38388;&#30340;40.5&#20493;&#21152;&#36895;&#65281;</title><link>https://arxiv.org/abs/2402.03694</link><description>&lt;p&gt;
ServeFlow&#65306;&#19968;&#31181;&#29992;&#20110;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#30340;&#24555;&#36895;-&#24930;&#36895;&#27169;&#22411;&#26550;&#26500;
&lt;/p&gt;
&lt;p&gt;
ServeFlow: A Fast-Slow Model Architecture for Network Traffic Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03694
&lt;/p&gt;
&lt;p&gt;
ServeFlow&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;-&#24930;&#36895;&#27169;&#22411;&#26550;&#26500;&#65292;&#29992;&#20110;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#12290;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#25910;&#38598;&#25968;&#25454;&#21253;&#30340;&#25968;&#37327;&#21644;&#24212;&#29992;&#20110;&#19981;&#21516;&#27969;&#37327;&#30340;&#27169;&#22411;&#65292;ServeFlow&#23454;&#29616;&#20102;&#26368;&#23567;&#24310;&#36831;&#12289;&#39640;&#26381;&#21153;&#29575;&#21644;&#39640;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ServeFlow&#33021;&#22815;&#22312;16ms&#20869;&#23545;76.3%&#30340;&#27969;&#37327;&#36827;&#34892;&#25512;&#29702;&#65292;&#36825;&#26159;&#20013;&#20301;&#25968;&#25512;&#29702;&#26102;&#38388;&#30340;40.5&#20493;&#21152;&#36895;&#65281;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20114;&#32852;&#32593;&#30340;&#25972;&#21512;&#21644;&#27969;&#37327;&#30340;&#21152;&#23494;&#65292;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#36234;&#26469;&#36234;&#22810;&#22320;&#20351;&#29992;&#22797;&#26434;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#24102;&#23485;&#32593;&#32476;&#20013;&#65292;&#27969;&#37327;&#24448;&#24448;&#27604;&#27169;&#22411;&#30340;&#25512;&#29702;&#36895;&#29575;&#26356;&#24555;&#12290;&#32593;&#32476;&#27969;&#37327;&#30340;&#26102;&#38388;&#24615;&#36136;&#38480;&#21046;&#20102;&#22312;&#20854;&#20182;&#39640;&#27969;&#37327;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#20351;&#29992;&#30340;&#31616;&#21333;&#25193;&#23637;&#26041;&#27861;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;ServeFlow&#65292;&#36825;&#26159;&#19968;&#20010;&#38024;&#23545;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#20219;&#21153;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#25552;&#20379;&#35299;&#20915;&#26041;&#26696;&#65292;&#23427;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#25910;&#38598;&#25968;&#25454;&#21253;&#30340;&#25968;&#37327;&#21644;&#24212;&#29992;&#20110;&#19981;&#21516;&#27969;&#37327;&#30340;&#27169;&#22411;&#65292;&#26469;&#23454;&#29616;&#26368;&#23567;&#24310;&#36831;&#12289;&#39640;&#26381;&#21153;&#29575;&#21644;&#39640;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;&#30456;&#21516;&#30340;&#20219;&#21153;&#19978;&#65292;&#19981;&#21516;&#27169;&#22411;&#30340;&#25512;&#29702;&#26102;&#38388;&#21487;&#20197;&#30456;&#24046;2.7&#20493;&#21040;136.3&#20493;&#65292;&#32780;&#20013;&#20301;&#25968;&#25968;&#25454;&#21253;&#31561;&#24453;&#26102;&#38388;&#36890;&#24120;&#27604;&#25512;&#29702;&#26102;&#38388;&#39640;6&#21040;8&#20010;&#25968;&#37327;&#32423;&#65281;ServeFlow&#33021;&#22815;&#22312;16ms&#20869;&#23545;76.3%&#30340;&#27969;&#37327;&#36827;&#34892;&#25512;&#29702;&#65292;&#36825;&#26159;&#20013;&#20301;&#25968;&#25512;&#29702;&#26102;&#38388;&#30340;40.5&#20493;&#21152;&#36895;&#65281;
&lt;/p&gt;
&lt;p&gt;
Network traffic analysis increasingly uses complex machine learning models as the internet consolidates and traffic gets more encrypted. However, over high-bandwidth networks, flows can easily arrive faster than model inference rates. The temporal nature of network flows limits simple scale-out approaches leveraged in other high-traffic machine learning applications. Accordingly, this paper presents ServeFlow, a solution for machine-learning model serving aimed at network traffic analysis tasks, which carefully selects the number of packets to collect and the models to apply for individual flows to achieve a balance between minimal latency, high service rate, and high accuracy. We identify that on the same task, inference time across models can differ by 2.7x-136.3x, while the median inter-packet waiting time is often 6-8 orders of magnitude higher than the inference time! ServeFlow is able to make inferences on 76.3% flows in under 16ms, which is a speed-up of 40.5x on the median end-
&lt;/p&gt;</description></item></channel></rss>