<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#21521;&#37327;&#20540;&#31070;&#32463;&#32593;&#32476;&#65288;V-nets&#65289;&#30340;&#24191;&#27867;&#26694;&#26550;&#65292;&#24182;&#35299;&#37322;&#20102;&#23427;&#20204;&#19982;&#36229;&#22797;&#20540;&#31070;&#32463;&#32593;&#32476;&#20197;&#21450;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2309.07716</link><description>&lt;p&gt;
&#29702;&#35299;&#21521;&#37327;&#20540;&#31070;&#32463;&#32593;&#32476;&#21450;&#20854;&#19982;&#23454;&#25968;&#21644;&#36229;&#22797;&#20540;&#31070;&#32463;&#32593;&#32476;&#30340;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Understanding Vector-Valued Neural Networks and Their Relationship with Real and Hypercomplex-Valued Neural Networks. (arXiv:2309.07716v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07716
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#21521;&#37327;&#20540;&#31070;&#32463;&#32593;&#32476;&#65288;V-nets&#65289;&#30340;&#24191;&#27867;&#26694;&#26550;&#65292;&#24182;&#35299;&#37322;&#20102;&#23427;&#20204;&#19982;&#36229;&#22797;&#20540;&#31070;&#32463;&#32593;&#32476;&#20197;&#21450;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#22312;&#22810;&#32500;&#20449;&#21495;&#21644;&#22270;&#20687;&#22788;&#29702;&#26041;&#38754;&#26377;&#35768;&#22810;&#25104;&#21151;&#30340;&#24212;&#29992;&#65292;&#20294;&#22823;&#22810;&#25968;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#22788;&#29702;&#30001;&#65288;&#22810;&#32500;&#65289;&#23454;&#25968;&#25968;&#32452;&#34920;&#31034;&#30340;&#25968;&#25454;&#12290;&#29305;&#24449;&#36890;&#36947;&#20043;&#38388;&#30340;&#20114;&#30456;&#20851;&#36890;&#24120;&#34987;&#26399;&#26395;&#20174;&#35757;&#32451;&#25968;&#25454;&#20013;&#23398;&#20064;&#65292;&#36825;&#38656;&#35201;&#22823;&#37327;&#30340;&#21442;&#25968;&#21644;&#20180;&#32454;&#30340;&#35757;&#32451;&#12290;&#30456;&#21453;&#65292;&#21521;&#37327;&#20540;&#31070;&#32463;&#32593;&#32476;&#34987;&#35774;&#35745;&#25104;&#22788;&#29702;&#21521;&#37327;&#25968;&#32452;&#65292;&#24182;&#33258;&#28982;&#22320;&#32771;&#34385;&#29305;&#24449;&#36890;&#36947;&#20043;&#38388;&#30340;&#20114;&#30456;&#20851;&#12290;&#22240;&#27492;&#65292;&#23427;&#20204;&#36890;&#24120;&#20855;&#26377;&#26356;&#23569;&#30340;&#21442;&#25968;&#65292;&#36890;&#24120;&#27604;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#20855;&#26377;&#26356;&#24378;&#30340;&#35757;&#32451;&#33021;&#21147;&#12290;&#26412;&#25991;&#26088;&#22312;&#25552;&#20986;&#19968;&#20010;&#24191;&#27867;&#30340;&#21521;&#37327;&#20540;&#31070;&#32463;&#32593;&#32476;&#26694;&#26550;&#65292;&#31216;&#20026;V-nets&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#36229;&#22797;&#20540;&#31070;&#32463;&#32593;&#32476;&#34987;&#35270;&#20026;&#20855;&#26377;&#39069;&#22806;&#20195;&#25968;&#23646;&#24615;&#30340;&#21521;&#37327;&#20540;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#35299;&#37322;&#20102;&#21521;&#37327;&#20540;&#31070;&#32463;&#32593;&#32476;&#19982;&#20256;&#32479;&#31070;&#32463;&#32593;&#32476;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite the many successful applications of deep learning models for multidimensional signal and image processing, most traditional neural networks process data represented by (multidimensional) arrays of real numbers. The intercorrelation between feature channels is usually expected to be learned from the training data, requiring numerous parameters and careful training. In contrast, vector-valued neural networks are conceived to process arrays of vectors and naturally consider the intercorrelation between feature channels. Consequently, they usually have fewer parameters and often undergo more robust training than traditional neural networks. This paper aims to present a broad framework for vector-valued neural networks, referred to as V-nets. In this context, hypercomplex-valued neural networks are regarded as vector-valued models with additional algebraic properties. Furthermore, this paper explains the relationship between vector-valued and traditional neural networks. Precisely, 
&lt;/p&gt;</description></item></channel></rss>