<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24046;&#20998;&#36827;&#21270;&#33539;&#24335;&#30340;&#26032;&#39062;&#36951;&#20256;&#27169;&#25311;&#31574;&#30053;&#65292;&#29992;&#20110;&#35299;&#20915;&#21322;&#30417;&#30563;&#32858;&#31867;&#38382;&#39064;&#65292;&#26159;&#31532;&#19968;&#27425;&#22312;&#36825;&#20010;&#39046;&#22495;&#23581;&#35797;&#23450;&#20041;&#36825;&#26679;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.04322</link><description>&lt;p&gt;
&#22522;&#20110;&#36951;&#20256;&#27169;&#25311;&#30340;&#24046;&#20998;&#36827;&#21270;&#26041;&#27861;&#29992;&#20110;&#21322;&#30417;&#30563;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
Memetic Differential Evolution Methods for Semi-Supervised Clustering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04322
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24046;&#20998;&#36827;&#21270;&#33539;&#24335;&#30340;&#26032;&#39062;&#36951;&#20256;&#27169;&#25311;&#31574;&#30053;&#65292;&#29992;&#20110;&#35299;&#20915;&#21322;&#30417;&#30563;&#32858;&#31867;&#38382;&#39064;&#65292;&#26159;&#31532;&#19968;&#27425;&#22312;&#36825;&#20010;&#39046;&#22495;&#23581;&#35797;&#23450;&#20041;&#36825;&#26679;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#22788;&#29702;&#21322;&#30417;&#30563;&#26368;&#23567;&#24179;&#26041;&#21644;&#32858;&#31867;(MSSC)&#38382;&#39064;&#65292;&#20854;&#20013;&#32972;&#26223;&#30693;&#35782;&#20197;&#23454;&#20363;&#32423;&#32422;&#26463;&#30340;&#24418;&#24335;&#32473;&#23450;&#12290;&#25105;&#20204;&#29305;&#21035;&#32771;&#34385;&#8220;&#24517;&#36830;&#25509;&#8221;&#21644;&#8220;&#38750;&#36830;&#25509;&#8221;&#32422;&#26463;&#65292;&#27599;&#20010;&#32422;&#26463;&#25351;&#31034;&#20004;&#20010;&#25968;&#25454;&#38598;&#28857;&#26159;&#21542;&#24212;&#35813;&#20851;&#32852;&#21040;&#21516;&#19968;&#20010;&#25110;&#19981;&#21516;&#30340;&#31751;&#20013;&#12290;&#36825;&#20123;&#32422;&#26463;&#30340;&#23384;&#22312;&#20351;&#24471;&#38382;&#39064;&#33267;&#23569;&#19982;&#20854;&#26080;&#30417;&#30563;&#29256;&#26412;&#19968;&#26679;&#22256;&#38590;&#65306;&#19981;&#20877;&#27599;&#20010;&#28857;&#37117;&#20851;&#32852;&#21040;&#20854;&#26368;&#36817;&#30340;&#31751;&#20013;&#24515;&#65292;&#22240;&#27492;&#38656;&#35201;&#22312;&#20851;&#38190;&#25805;&#20316;&#65288;&#22914;&#20998;&#37197;&#27493;&#39588;&#65289;&#20013;&#36827;&#34892;&#19968;&#20123;&#20462;&#25913;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24046;&#20998;&#36827;&#21270;&#33539;&#24335;&#30340;&#26032;&#39062;&#36951;&#20256;&#27169;&#25311;&#31574;&#30053;&#65292;&#30452;&#25509;&#25193;&#23637;&#20102;&#26368;&#36817;&#22312;&#26080;&#30417;&#30563;&#32858;&#31867;&#25991;&#29486;&#20013;&#25552;&#20986;&#30340;&#26368;&#26032;&#26694;&#26550;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#25105;&#20204;&#30340;&#36129;&#29486;&#20195;&#34920;&#20102;&#31532;&#19968;&#27425;&#23581;&#35797;&#23450;&#20041;&#19968;&#20010;&#26088;&#22312;&#29983;&#25104;&#19968;&#20010;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04322v1 Announce Type: cross  Abstract: In this paper, we deal with semi-supervised Minimum Sum-of-Squares Clustering (MSSC) problems where background knowledge is given in the form of instance-level constraints. In particular, we take into account "must-link" and "cannot-link" constraints, each of which indicates if two dataset points should be associated to the same or to a different cluster. The presence of such constraints makes the problem at least as hard as its unsupervised version: it is no more true that each point is associated to its nearest cluster center, thus requiring some modifications in crucial operations, such as the assignment step. In this scenario, we propose a novel memetic strategy based on the Differential Evolution paradigm, directly extending a state-of-the-art framework recently proposed in the unsupervised clustering literature. As far as we know, our contribution represents the first attempt to define a memetic methodology designed to generate a
&lt;/p&gt;</description></item></channel></rss>