<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26080;&#38656;&#39044;&#35774;&#21442;&#25968;&#30340;ART&#25299;&#25169;&#32858;&#31867;&#31639;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#23454;&#29616;&#25345;&#32493;&#23398;&#20064;&#65292;&#24182;&#22312;&#23454;&#39564;&#20013;&#35777;&#26126;&#20854;&#27604;&#29616;&#26377;&#32858;&#31867;&#31639;&#27861;&#26356;&#20248;&#12290;</title><link>http://arxiv.org/abs/2305.01507</link><description>&lt;p&gt;
&#19968;&#31181;&#26080;&#38656;&#39044;&#35774;&#21442;&#25968;&#30340;&#33258;&#36866;&#24212;&#20849;&#25391;&#29702;&#35770;&#25299;&#25169;&#32858;&#31867;&#31639;&#27861;&#65292;&#23454;&#29616;&#25345;&#32493;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
A Parameter-free Adaptive Resonance Theory-based Topological Clustering Algorithm Capable of Continual Learning. (arXiv:2305.01507v1 [cs.NE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01507
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26080;&#38656;&#39044;&#35774;&#21442;&#25968;&#30340;ART&#25299;&#25169;&#32858;&#31867;&#31639;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#23454;&#29616;&#25345;&#32493;&#23398;&#20064;&#65292;&#24182;&#22312;&#23454;&#39564;&#20013;&#35777;&#26126;&#20854;&#27604;&#29616;&#26377;&#32858;&#31867;&#31639;&#27861;&#26356;&#20248;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#33324;&#26469;&#35828;&#65292;&#22312;&#33258;&#36866;&#24212;&#20849;&#25391;&#29702;&#35770;&#65288;ART&#65289;&#31639;&#27861;&#20013;&#65292;&#33410;&#28857;&#23398;&#20064;&#36807;&#31243;&#20013;&#30340;&#30456;&#20284;&#24230;&#38408;&#20540;&#65288;&#21363;&#35686;&#35273;&#21442;&#25968;&#65289;&#23545;&#32858;&#31867;&#24615;&#33021;&#26377;&#37325;&#22823;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#25299;&#25169;&#32858;&#31867;&#31639;&#27861;&#20013;&#30340;&#36793;&#32536;&#21024;&#38500;&#38408;&#20540;&#22312;&#33258;&#32452;&#32455;&#36807;&#31243;&#20013;&#29983;&#25104;&#20114;&#30456;&#20998;&#31163;&#30340;&#32858;&#31867;&#20013;&#36215;&#37325;&#35201;&#20316;&#29992;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26080;&#38656;&#39044;&#35774;&#21442;&#25968;&#30340;ART&#25299;&#25169;&#32858;&#31867;&#31639;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#23454;&#29616;&#25345;&#32493;&#23398;&#20064;&#12290;&#38024;&#23545;&#21512;&#25104;&#25968;&#25454;&#38598;&#21644;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#25552;&#31639;&#27861;&#22312;&#26080;&#39044;&#35774;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377;&#27604;&#29616;&#26377;&#32858;&#31867;&#31639;&#27861;&#26356;&#20248;&#30340;&#32858;&#31867;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
In general, a similarity threshold (i.e., a vigilance parameter) for a node learning process in Adaptive Resonance Theory (ART)-based algorithms has a significant impact on clustering performance. In addition, an edge deletion threshold in a topological clustering algorithm plays an important role in adaptively generating well-separated clusters during a self-organizing process. In this paper, we propose a new parameter-free ART-based topological clustering algorithm capable of continual learning by introducing parameter estimation methods. Experimental results with synthetic and real-world datasets show that the proposed algorithm has superior clustering performance to the state-of-the-art clustering algorithms without any parameter pre-specifications.
&lt;/p&gt;</description></item></channel></rss>