<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>LieDetect&#26159;&#19968;&#31181;&#20174;&#32039;&#33268;Lie&#32676;&#30340;&#26377;&#38480;&#26679;&#26412;&#36712;&#36947;&#20013;&#20272;&#35745;&#34920;&#31034;&#30340;&#26032;&#31639;&#27861;&#12290;&#19982;&#20854;&#20182;&#25216;&#26415;&#19981;&#21516;&#65292;&#35813;&#31639;&#27861;&#21487;&#20197;&#26816;&#32034;&#31934;&#30830;&#30340;&#34920;&#31034;&#31867;&#22411;&#65292;&#24182;&#37325;&#24314;&#20854;&#36712;&#36947;&#65292;&#26377;&#21161;&#20110;&#35782;&#21035;&#29983;&#25104;&#35813;&#20316;&#29992;&#30340;Lie&#32676;&#12290;&#35813;&#31639;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#32039;&#33268;Lie&#32676;&#65292;&#24182;&#22312;&#22810;&#20010;&#39046;&#22495;&#30340;&#24212;&#29992;&#20013;&#21462;&#24471;&#20102;&#38750;&#24120;&#20934;&#30830;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2309.03086</link><description>&lt;p&gt;
LieDetect: &#20174;&#28857;&#20113;&#20013;&#26816;&#27979;&#32039;&#33268;Lie&#32676;&#30340;&#34920;&#31034;&#36712;&#36947;
&lt;/p&gt;
&lt;p&gt;
LieDetect: Detection of representation orbits of compact Lie groups from point clouds. (arXiv:2309.03086v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03086
&lt;/p&gt;
&lt;p&gt;
LieDetect&#26159;&#19968;&#31181;&#20174;&#32039;&#33268;Lie&#32676;&#30340;&#26377;&#38480;&#26679;&#26412;&#36712;&#36947;&#20013;&#20272;&#35745;&#34920;&#31034;&#30340;&#26032;&#31639;&#27861;&#12290;&#19982;&#20854;&#20182;&#25216;&#26415;&#19981;&#21516;&#65292;&#35813;&#31639;&#27861;&#21487;&#20197;&#26816;&#32034;&#31934;&#30830;&#30340;&#34920;&#31034;&#31867;&#22411;&#65292;&#24182;&#37325;&#24314;&#20854;&#36712;&#36947;&#65292;&#26377;&#21161;&#20110;&#35782;&#21035;&#29983;&#25104;&#35813;&#20316;&#29992;&#30340;Lie&#32676;&#12290;&#35813;&#31639;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#32039;&#33268;Lie&#32676;&#65292;&#24182;&#22312;&#22810;&#20010;&#39046;&#22495;&#30340;&#24212;&#29992;&#20013;&#21462;&#24471;&#20102;&#38750;&#24120;&#20934;&#30830;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#32039;&#33268;Lie&#32676;&#30340;&#26377;&#38480;&#26679;&#26412;&#36712;&#36947;&#20013;&#20272;&#35745;&#34920;&#31034;&#12290;&#19982;&#20854;&#20182;&#25253;&#36947;&#30340;&#25216;&#26415;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#26816;&#32034;&#31934;&#30830;&#30340;&#34920;&#31034;&#31867;&#22411;&#65292;&#20316;&#20026;&#19981;&#21487;&#32422;&#34920;&#31034;&#30340;&#30452;&#21644;&#12290;&#32780;&#19988;&#65292;&#23545;&#34920;&#31034;&#31867;&#22411;&#30340;&#20102;&#35299;&#21487;&#20197;&#37325;&#24314;&#20854;&#36712;&#36947;&#65292;&#26377;&#21161;&#20110;&#35782;&#21035;&#29983;&#25104;&#35813;&#20316;&#29992;&#30340;Lie&#32676;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#32039;&#33268;Lie&#32676;&#65292;&#20294;&#21482;&#32771;&#34385;&#20102;SO(2), T^d, SU(2)&#21644;SO(3)&#30340;&#23454;&#20363;&#21270;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22312;Hausdorff&#21644;Wasserstein&#36317;&#31163;&#26041;&#38754;&#30340;&#40065;&#26834;&#24615;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;&#25105;&#20204;&#30340;&#24037;&#20855;&#26469;&#33258;&#20110;&#20960;&#20309;&#27979;&#24230;&#29702;&#35770;&#65292;&#35745;&#31639;&#20960;&#20309;&#21644;&#30697;&#38453;&#27969;&#24418;&#19978;&#30340;&#20248;&#21270;&#12290;&#31639;&#27861;&#22312;&#39640;&#36798;16&#32500;&#30340;&#21512;&#25104;&#25968;&#25454;&#20197;&#21450;&#22270;&#20687;&#20998;&#26512;&#65292;&#35856;&#27874;&#20998;&#26512;&#21644;&#32463;&#20856;&#21147;&#23398;&#31995;&#32479;&#30340;&#23454;&#38469;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#21462;&#24471;&#20102;&#38750;&#24120;&#20934;&#30830;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We suggest a new algorithm to estimate representations of compact Lie groups from finite samples of their orbits. Different from other reported techniques, our method allows the retrieval of the precise representation type as a direct sum of irreducible representations. Moreover, the knowledge of the representation type permits the reconstruction of its orbit, which is useful to identify the Lie group that generates the action. Our algorithm is general for any compact Lie group, but only instantiations for SO(2), T^d, SU(2) and SO(3) are considered. Theoretical guarantees of robustness in terms of Hausdorff and Wasserstein distances are derived. Our tools are drawn from geometric measure theory, computational geometry, and optimization on matrix manifolds. The algorithm is tested for synthetic data up to dimension 16, as well as real-life applications in image analysis, harmonic analysis, and classical mechanics systems, achieving very accurate results.
&lt;/p&gt;</description></item></channel></rss>