<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;GenAI&#30340;GenAINet&#26694;&#26550;&#65292;&#36890;&#36807;&#30693;&#35782;&#20256;&#36755;&#21644;&#25512;&#29702;&#23454;&#29616;&#26080;&#32447;&#38598;&#20307;&#26234;&#33021;&#65292;&#20026;6G&#26102;&#20195;&#38138;&#24179;&#20102;&#36890;&#21521;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#30340;&#36947;&#36335;&#12290;</title><link>https://arxiv.org/abs/2402.16631</link><description>&lt;p&gt;
GenAINet&#65306;&#36890;&#36807;&#30693;&#35782;&#20256;&#36755;&#21644;&#25512;&#29702;&#23454;&#29616;&#26080;&#32447;&#38598;&#20307;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
GenAINet: Enabling Wireless Collective Intelligence via Knowledge Transfer and Reasoning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16631
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;GenAI&#30340;GenAINet&#26694;&#26550;&#65292;&#36890;&#36807;&#30693;&#35782;&#20256;&#36755;&#21644;&#25512;&#29702;&#23454;&#29616;&#26080;&#32447;&#38598;&#20307;&#26234;&#33021;&#65292;&#20026;6G&#26102;&#20195;&#38138;&#24179;&#20102;&#36890;&#21521;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#30340;&#36947;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16631v2 &#22768;&#26126;&#31867;&#22411;&#65306;&#26367;&#25442; &#25688;&#35201;&#65306;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#65288;GenAI&#65289;&#21644;&#36890;&#20449;&#32593;&#32476;&#34987;&#26399;&#26395;&#22312;6G&#20013;&#20855;&#26377;&#31361;&#30772;&#24615;&#30340;&#21327;&#21516;&#20316;&#29992;&#12290;&#36890;&#36807;&#26080;&#32447;&#32593;&#32476;&#36830;&#25509;GenAI&#20195;&#29702;&#21487;&#33021;&#20250;&#37322;&#25918;&#38598;&#20307;&#26234;&#33021;&#30340;&#21147;&#37327;&#65292;&#24182;&#20026;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#65288;AGI&#65289;&#38138;&#24179;&#36947;&#36335;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#26080;&#32447;&#32593;&#32476;&#35774;&#35745;&#20026;&#8220;&#25968;&#25454;&#31649;&#36947;&#8221;&#65292;&#24182;&#19981;&#36866;&#21512;&#23481;&#32435;&#21644;&#21033;&#29992;GenAI&#30340;&#21147;&#37327;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;GenAINet&#26694;&#26550;&#65292;&#20854;&#20013;&#20998;&#24067;&#24335;GenAI&#20195;&#29702;&#20256;&#36798;&#30693;&#35782;&#65288;&#39640;&#32423;&#27010;&#24565;&#25110;&#25688;&#35201;&#65289;&#20197;&#23436;&#25104;&#20219;&#24847;&#20219;&#21153;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20379;&#19968;&#20010;&#32593;&#32476;&#26550;&#26500;&#65292;&#25972;&#21512;&#20102;GenAI&#33021;&#21147;&#65292;&#20197;&#31649;&#29702;&#32593;&#32476;&#21327;&#35758;&#21644;&#24212;&#29992;&#31243;&#24207;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#35821;&#20041;&#26412;&#22320;&#21270;&#30340;GenAINet&#26469;&#30740;&#31350;&#26377;&#25928;&#30340;&#36890;&#20449;&#21644;&#25512;&#29702;&#38382;&#39064;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;GenAI&#20195;&#29702;&#20174;&#22810;&#27169;&#24577;&#21407;&#22987;&#25968;&#25454;&#20013;&#25552;&#21462;&#35821;&#20041;&#27010;&#24565;&#65292;&#26500;&#24314;&#19968;&#20010;&#30693;&#35782;&#24211;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16631v2 Announce Type: replace  Abstract: Generative artificial intelligence (GenAI) and communication networks are expected to have groundbreaking synergies in 6G. Connecting GenAI agents over a wireless network can potentially unleash the power of collective intelligence and pave the way for artificial general intelligence (AGI). However, current wireless networks are designed as a "data pipe" and are not suited to accommodate and leverage the power of GenAI. In this paper, we propose the GenAINet framework in which distributed GenAI agents communicate knowledge (high-level concepts or abstracts) to accomplish arbitrary tasks. We first provide a network architecture integrating GenAI capabilities to manage both network protocols and applications. Building on this, we investigate effective communication and reasoning problems by proposing a semantic-native GenAINet. Specifically, GenAI agents extract semantic concepts from multi-modal raw data, build a knowledgebase represe
&lt;/p&gt;</description></item></channel></rss>