<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#36890;&#36807;&#23618;&#32423;&#32465;&#23450;&#21644;&#32852;&#24819;&#26816;&#32034;&#21464;&#20026;&#30701;&#26399;&#21644;&#38271;&#26399;&#22768;&#26126;&#24615;&#35760;&#24518;&#30340;&#22312;&#32447;&#39044;&#27979;&#22788;&#29702;&#31995;&#32479;&#21487;&#33021;&#20250;&#24863;&#30693;&#21040;&#33258;&#24049;&#20855;&#26377;&#24847;&#35782;&#12290;</title><link>http://arxiv.org/abs/2301.07016</link><description>&lt;p&gt;
&#24847;&#35782;&#26159;&#23398;&#20064;&#30340;&#36807;&#31243;&#65306;&#36890;&#36807;&#32465;&#23450;&#23398;&#20064;&#30340;&#39044;&#27979;&#22788;&#29702;&#31995;&#32479;&#21487;&#33021;&#20250;&#23558;&#33258;&#24049;&#24863;&#30693;&#20026;&#26377;&#24847;&#35782;&#30340;
&lt;/p&gt;
&lt;p&gt;
Consciousness is learning: predictive processing systems that learn by binding may perceive themselves as conscious. (arXiv:2301.07016v2 [q-bio.NC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.07016
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23618;&#32423;&#32465;&#23450;&#21644;&#32852;&#24819;&#26816;&#32034;&#21464;&#20026;&#30701;&#26399;&#21644;&#38271;&#26399;&#22768;&#26126;&#24615;&#35760;&#24518;&#30340;&#22312;&#32447;&#39044;&#27979;&#22788;&#29702;&#31995;&#32479;&#21487;&#33021;&#20250;&#24863;&#30693;&#21040;&#33258;&#24049;&#20855;&#26377;&#24847;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#22312;&#29305;&#23450;&#22797;&#26434;&#39046;&#22495;&#23454;&#29616;&#20102;&#36229;&#36234;&#20154;&#31867;&#30340;&#34920;&#29616;&#12290;&#28982;&#32780;&#65292;&#20174;&#23569;&#37327;&#31034;&#20363;&#20013;&#36827;&#34892;&#22312;&#32447;&#23398;&#20064;&#65292;&#24182;&#22312;&#19981;&#21516;&#39046;&#22495;&#20043;&#38388;&#39640;&#25928;&#22320;&#27867;&#21270;&#20173;&#28982;&#26159;&#38590;&#20197;&#23454;&#29616;&#30340;&#12290;&#22312;&#20154;&#31867;&#36523;&#19978;&#65292;&#36825;&#31181;&#23398;&#20064;&#36890;&#36807;&#22768;&#26126;&#24615;&#23384;&#20648;&#36807;&#31243;&#36827;&#34892;&#65292;&#24182;&#19988;&#19982;&#24847;&#35782;&#23494;&#20999;&#30456;&#20851;&#12290;&#39044;&#27979;&#22788;&#29702;&#34987;&#25512;&#24191;&#20026;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#25512;&#29702;&#26694;&#26550;&#30340;&#21407;&#21017;&#24615;&#26041;&#27861;&#65292;&#29992;&#20110;&#29702;&#35299;&#30382;&#36136;&#22914;&#20309;&#23454;&#29616;&#28145;&#24230;&#29983;&#25104;&#24863;&#30693;&#27169;&#22411;&#65292;&#29992;&#20110;&#24863;&#23448;&#25968;&#25454;&#21644;&#34892;&#20026;&#25511;&#21046;&#12290;&#28982;&#32780;&#65292;&#39044;&#27979;&#22788;&#29702;&#23545;&#20110;&#24555;&#36895;&#32452;&#25104;&#24335;&#23398;&#20064;&#25110;&#24847;&#35782;&#20043;&#35868;&#25552;&#20379;&#20102;&#24456;&#23569;&#30340;&#30452;&#25509;&#35265;&#35299;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#65292;&#36890;&#36807;&#36890;&#36807;&#32465;&#23450;&#39044;&#27979;&#20013;&#30340;&#23618;&#27425;&#27169;&#22411;&#26469;&#23454;&#29616;&#22312;&#32447;&#23398;&#20064;&#65292;&#39044;&#27979;&#22788;&#29702;&#31995;&#32479;&#21487;&#20197;&#36890;&#36807;&#20174;&#21333;&#20010;&#31034;&#20363;&#20013;&#20026;&#24863;&#30693;&#21644;&#34892;&#21160;&#24418;&#25104;&#24037;&#20316;&#35760;&#24518;&#65292;&#22312;&#26032;&#24773;&#20917;&#19979;&#28789;&#27963;&#27867;&#21270;&#65292;&#36825;&#21487;&#36890;&#36807;&#32852;&#24819;&#26816;&#32034;&#21464;&#20026;&#30701;&#26399;&#21644;&#38271;&#26399;&#30340;&#22768;&#26126;&#24615;&#35760;&#24518;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#36825;&#20010;&#36807;&#31243;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#22312;&#32447;&#23618;&#32423;&#39044;&#27979;&#32465;&#23450;&#8221;&#65292;&#20063;&#21487;&#33021;&#26159;&#31995;&#32479;&#24863;&#30693;&#33258;&#24049;&#20855;&#26377;&#24847;&#35782;&#30340;&#24517;&#35201;&#26465;&#20214;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#31181;&#20851;&#20110;&#24863;&#30693;&#30340;&#12289;&#36816;&#21160;&#30340;&#12289;&#35748;&#30693;&#30340;&#21644;&#24773;&#24863;&#30340;&#24847;&#35782;&#30340;&#32479;&#19968;&#35299;&#37322;&#65292;&#24182;&#20855;&#26377;&#36827;&#21270;&#21644;&#21457;&#32946;&#29983;&#29289;&#23398;&#30340;&#28145;&#21051;&#26681;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning algorithms have achieved superhuman performance in specific complex domains. Yet learning online from few examples and efficiently generalizing across domains remains elusive. In humans such learning proceeds via declarative memory formation and is closely associated with consciousness. Predictive processing has been advanced as a principled Bayesian inference framework for understanding the cortex as implementing deep generative perceptual models for both sensory data and action control. However, predictive processing offers little direct insight into fast compositional learning or the mystery of consciousness. Here we propose that through implementing online learning by hierarchical binding of unpredicted inferences, a predictive processing system may flexibly generalize in novel situations by forming working memories for perceptions and actions from single examples, which can become short- and long-term declarative memories retrievable by associative recall. We argu
&lt;/p&gt;</description></item></channel></rss>