<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22122;&#22768;&#23574;&#23792;&#28436;&#21592;&#32593;&#32476;&#65288;NoisySAN&#65289;&#20197;&#35299;&#20915;&#23574;&#23792;&#31070;&#32463;&#32593;&#32476;&#65288;SNNs&#65289;&#22312;&#25506;&#32034;&#20013;&#30340;&#24369;&#28857;&#65292;&#24182;&#22312;&#36830;&#32493;&#25511;&#21046;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#20248;&#20110;&#26368;&#20808;&#36827;&#26041;&#27861;&#30340;&#34920;&#29616;</title><link>https://arxiv.org/abs/2403.04162</link><description>&lt;p&gt;
&#29992;&#20110;&#25506;&#32034;&#30340;&#22122;&#22768;&#23574;&#23792;&#28436;&#21592;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Noisy Spiking Actor Network for Exploration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04162
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22122;&#22768;&#23574;&#23792;&#28436;&#21592;&#32593;&#32476;&#65288;NoisySAN&#65289;&#20197;&#35299;&#20915;&#23574;&#23792;&#31070;&#32463;&#32593;&#32476;&#65288;SNNs&#65289;&#22312;&#25506;&#32034;&#20013;&#30340;&#24369;&#28857;&#65292;&#24182;&#22312;&#36830;&#32493;&#25511;&#21046;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#20248;&#20110;&#26368;&#20808;&#36827;&#26041;&#27861;&#30340;&#34920;&#29616;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#20013;&#25506;&#32034;&#30340;&#19968;&#31181;&#36890;&#29992;&#26041;&#27861;&#65292;NoisyNet&#33021;&#22815;&#20135;&#29983;&#29305;&#23450;&#20110;&#38382;&#39064;&#30340;&#25506;&#32034;&#31574;&#30053;&#12290;&#30001;&#20110;&#23574;&#23792;&#31070;&#32463;&#32593;&#32476;&#65288;SNNs&#65289;&#20855;&#26377;&#20108;&#36827;&#21046;&#21457;&#25918;&#26426;&#21046;&#65292;&#23545;&#20110;&#22122;&#22768;&#20855;&#26377;&#24456;&#24378;&#30340;&#40065;&#26834;&#24615;&#65292;&#22240;&#27492;&#38590;&#20197;&#36890;&#36807;&#23616;&#37096;&#24178;&#25200;&#23454;&#29616;&#39640;&#25928;&#25506;&#32034;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#25506;&#32034;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24341;&#20837;&#26102;&#38388;&#30456;&#20851;&#22122;&#22768;&#30340;&#22122;&#22768;&#23574;&#23792;&#28436;&#21592;&#32593;&#32476;&#65288;NoisySAN&#65289;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#22122;&#22768;&#20943;&#23569;&#26041;&#27861;&#26469;&#20026;&#20195;&#29702;&#25214;&#21040;&#31283;&#23450;&#31574;&#30053;&#12290;&#22823;&#37327;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26469;&#33258;OpenAI gym&#30340;&#24191;&#27867;&#36830;&#32493;&#25511;&#21046;&#20219;&#21153;&#19978;&#20248;&#20110;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04162v1 Announce Type: new  Abstract: As a general method for exploration in deep reinforcement learning (RL), NoisyNet can produce problem-specific exploration strategies. Spiking neural networks (SNNs), due to their binary firing mechanism, have strong robustness to noise, making it difficult to realize efficient exploration with local disturbances. To solve this exploration problem, we propose a noisy spiking actor network (NoisySAN) that introduces time-correlated noise during charging and transmission. Moreover, a noise reduction method is proposed to find a stable policy for the agent. Extensive experimental results demonstrate that our method outperforms the state-of-the-art performance on a wide range of continuous control tasks from OpenAI gym.
&lt;/p&gt;</description></item></channel></rss>