<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#22312;&#26377;&#38480;&#35282;&#24230;&#23618;&#26512;&#25104;&#20687;&#20013;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#33021;&#26356;&#31283;&#23450;&#22320;&#37325;&#26500;&#26356;&#22810;&#20449;&#24687;</title><link>https://arxiv.org/abs/2403.11350</link><description>&lt;p&gt;
&#26377;&#38480;&#35282;&#24230;&#23618;&#26512;&#25104;&#20687;&#20013;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#30340;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Robustness of the data-driven approach in limited angle tomography
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11350
&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#22312;&#26377;&#38480;&#35282;&#24230;&#23618;&#26512;&#25104;&#20687;&#20013;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#33021;&#26356;&#31283;&#23450;&#22320;&#37325;&#26500;&#26356;&#22810;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#38480;&#35282;&#24230;Radon&#21464;&#25442;&#30001;&#20110;&#20854;&#19981;&#36870;&#38382;&#39064;&#32780;&#38395;&#21517;&#20110;&#19990;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#25968;&#23398;&#35299;&#37322;&#65292;&#21363;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#21487;&#20197;&#20197;&#26356;&#31283;&#23450;&#30340;&#26041;&#24335;&#37325;&#26500;&#26356;&#22810;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11350v1 Announce Type: cross  Abstract: The limited angle Radon transform is notoriously difficult to invert due to the ill-posedness. In this work, we give a mathematical explanation that the data-driven approach based on deep neural networks can reconstruct more information in a stable way compared to traditional methods.
&lt;/p&gt;</description></item></channel></rss>