<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#25968;&#23383;&#23402;&#29983;&#21644;&#22810;&#27169;&#24577;&#20223;&#30495;&#26694;&#26550;&#30340;V2X&#36890;&#20449;&#22330;&#26223;DT&#21019;&#24314;&#21644;&#20223;&#30495;&#26041;&#27861;&#65292;&#21487;&#22312;&#39640;&#31227;&#21160;&#24615;V2X&#36890;&#20449;&#29615;&#22659;&#19979;&#20934;&#30830;&#27169;&#25311;&#20986;&#23454;&#38469;&#20256;&#24863;&#22120;&#25968;&#25454;&#21644;&#20449;&#36947;&#12290;</title><link>http://arxiv.org/abs/2303.06947</link><description>&lt;p&gt;
&#19968;&#31181;&#22810;&#27169;&#24577;&#20223;&#30495;&#26694;&#26550;&#65292;&#23454;&#29616;&#25968;&#23383;&#23402;&#29983;&#22522;&#20110;&#21160;&#24577;&#29615;&#22659;&#30340;V2X&#36890;&#20449;
&lt;/p&gt;
&lt;p&gt;
A Multi-Modal Simulation Framework to Enable Digital Twin-based V2X Communications in Dynamic Environments. (arXiv:2303.06947v2 [eess.SP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06947
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#25968;&#23383;&#23402;&#29983;&#21644;&#22810;&#27169;&#24577;&#20223;&#30495;&#26694;&#26550;&#30340;V2X&#36890;&#20449;&#22330;&#26223;DT&#21019;&#24314;&#21644;&#20223;&#30495;&#26041;&#27861;&#65292;&#21487;&#22312;&#39640;&#31227;&#21160;&#24615;V2X&#36890;&#20449;&#29615;&#22659;&#19979;&#20934;&#30830;&#27169;&#25311;&#20986;&#23454;&#38469;&#20256;&#24863;&#22120;&#25968;&#25454;&#21644;&#20449;&#36947;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#65288;DT&#65289;&#34987;&#25552;&#20986;&#20316;&#20026;&#29289;&#29702;&#26080;&#32447;&#29615;&#22659;&#30340;&#31934;&#30830;&#34394;&#25311;&#34920;&#31034;&#65292;&#21487;&#22312;&#29289;&#29702;&#36890;&#20449;&#35774;&#22791;&#19978;&#23454;&#29616;&#22810;&#23618;&#20915;&#31574;&#12290;&#22312;&#39640;&#39057;&#27573;&#65292;DT&#21487;&#24110;&#21161;&#20811;&#26381;V2X&#36890;&#20449;&#39640;&#31227;&#21160;&#24615;&#29615;&#22659;&#20013;&#20986;&#29616;&#30340;&#25361;&#25112;&#12290;&#26412;&#25991;&#38024;&#23545;V2X&#36890;&#20449;&#22330;&#26223;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#24037;&#20316;&#27969;&#29992;&#20110;&#21019;&#24314;DT&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#27169;&#24577;&#20223;&#30495;&#26694;&#26550;&#29992;&#20110;&#20135;&#29983;&#36924;&#30495;&#30340;&#20256;&#24863;&#22120;&#25968;&#25454;&#21644;&#20934;&#30830;&#30340;&#27627;&#31859;&#27874;/&#20122;&#27627;&#31859;&#27874;&#26080;&#32447;&#20449;&#36947;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21033;&#29992;&#22522;&#20110;&#34394;&#24187;&#24341;&#25806;&#28216;&#25103;&#24341;&#25806;&#30340;&#27773;&#36710;&#20223;&#30495;&#21644;&#27979;&#35797;&#26694;&#26550;&#20197;&#21450;&#20934;&#30830;&#30340;&#23556;&#32447;&#36319;&#36394;&#20449;&#36947;&#27169;&#25311;&#22120;&#12290;&#22312;&#22478;&#24066;&#22330;&#26223;&#19979;&#30340;&#20223;&#30495;&#32467;&#26524;&#26174;&#31034;&#65292;&#22522;&#30784;&#35774;&#26045;&#21644;&#33258;&#36710;&#30340;&#36924;&#30495;&#20256;&#24863;&#22120;&#21644;&#20449;&#36947;&#24314;&#27169;&#22343;&#21487;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Digital Twins (DTs) for physical wireless environments have been recently proposed as accurate virtual representations of the propagation environment that can enable multi-layer decisions at the physical communication equipment. At high frequency bands, DTs can help to overcome the challenges emerging in the high mobility conditions featuring vehicular environments. In this paper, we propose a novel data-driven workflow for the creation of the DT of a Vehicle-to-Everything (V2X) communication scenario and a multi-modal simulation framework for the generation of realistic sensor data and accurate mmWave/sub-THz wireless channels. The proposed method leverages an automotive simulation and testing framework based on the Unreal Engine game engine and an accurate ray-tracing channel simulator. Simulations over an urban scenario show the achievable realistic sensor and channel modelling both at the infrastructure and at an ego-vehicle.
&lt;/p&gt;</description></item></channel></rss>