<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#26159;&#19968;&#39033;&#20102;&#35299;&#26426;&#22120;&#20154;&#21644;&#20154;&#24037;&#26234;&#33021;&#20013;&#25928;&#29992;&#29702;&#35770;&#24212;&#29992;&#30340;&#35843;&#26597;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#36890;&#36807;&#21512;&#36866;&#30340;&#25928;&#29992;&#27169;&#22411;&#25351;&#23548;&#26234;&#33021;&#20307;&#36873;&#25321;&#21512;&#29702;&#31574;&#30053;&#26469;&#23454;&#29616;&#31995;&#32479;&#30340;&#26368;&#20248;&#25928;&#29992;&#21644;&#20445;&#35777;&#27599;&#20010;&#32676;&#20307;&#25104;&#21592;&#30340;&#21487;&#25345;&#32493;&#21457;&#23637;&#12290;</title><link>http://arxiv.org/abs/2306.09445</link><description>&lt;p&gt;
&#20102;&#35299;&#25928;&#29992;&#29702;&#35770;&#22312;&#26426;&#22120;&#20154;&#21644;&#20154;&#24037;&#26234;&#33021;&#20013;&#30340;&#24212;&#29992;&#65306;&#19968;&#39033;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Understanding the Application of Utility Theory in Robotics and Artificial Intelligence: A Survey. (arXiv:2306.09445v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09445
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#19968;&#39033;&#20102;&#35299;&#26426;&#22120;&#20154;&#21644;&#20154;&#24037;&#26234;&#33021;&#20013;&#25928;&#29992;&#29702;&#35770;&#24212;&#29992;&#30340;&#35843;&#26597;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#36890;&#36807;&#21512;&#36866;&#30340;&#25928;&#29992;&#27169;&#22411;&#25351;&#23548;&#26234;&#33021;&#20307;&#36873;&#25321;&#21512;&#29702;&#31574;&#30053;&#26469;&#23454;&#29616;&#31995;&#32479;&#30340;&#26368;&#20248;&#25928;&#29992;&#21644;&#20445;&#35777;&#27599;&#20010;&#32676;&#20307;&#25104;&#21592;&#30340;&#21487;&#25345;&#32493;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#32463;&#27982;&#23398;&#12289;&#21338;&#24328;&#35770;&#21644;&#36816;&#31609;&#23398;&#20013;&#30340;&#19968;&#20010;&#32479;&#19968;&#27010;&#24565;&#65292;&#25928;&#29992;&#22312;&#26426;&#22120;&#20154;&#21644;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#20013;&#34987;&#29992;&#26469;&#35780;&#20272;&#20010;&#20307;&#38656;&#27714;&#12289;&#20559;&#22909;&#21644;&#21033;&#30410;&#27700;&#24179;&#12290;&#29305;&#21035;&#26159;&#22312;&#22810;&#26234;&#33021;&#20307;/&#26426;&#22120;&#20154;&#31995;&#32479;&#65288;MAS/MRS&#65289;&#30340;&#20915;&#31574;&#21644;&#23398;&#20064;&#20013;&#65292;&#21512;&#36866;&#30340;&#25928;&#29992;&#27169;&#22411;&#21487;&#20197;&#25351;&#23548;&#26234;&#33021;&#20307;&#36873;&#25321;&#21512;&#29702;&#30340;&#31574;&#30053;&#26469;&#23454;&#29616;&#20854;&#24403;&#21069;&#38656;&#27714;&#24182;&#23398;&#20250;&#21512;&#20316;&#21644;&#32452;&#32455;&#20854;&#34892;&#20026;&#65292;&#20248;&#21270;&#31995;&#32479;&#30340;&#25928;&#29992;&#65292;&#24314;&#31435;&#31283;&#23450;&#21487;&#38752;&#30340;&#20851;&#31995;&#65292;&#24182;&#20445;&#35777;&#27599;&#20010;&#32676;&#20307;&#25104;&#21592;&#30340;&#21487;&#25345;&#32493;&#21457;&#23637;&#65292;&#31867;&#20284;&#20110;&#20154;&#31867;&#31038;&#20250;&#12290;&#34429;&#28982;&#36825;&#20123;&#31995;&#32479;&#30340;&#22797;&#26434;&#12289;&#22823;&#35268;&#27169;&#21644;&#38271;&#26399;&#30340;&#34892;&#20026;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#24213;&#23618;&#20851;&#31995;&#30340;&#22522;&#26412;&#29305;&#24615;&#20915;&#23450;&#65292;&#20294;&#22312;&#26426;&#22120;&#20154;&#21644;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#65292;&#23545;&#26426;&#21046;&#30340;&#29702;&#35770;&#26041;&#38754;&#21644;&#24212;&#29992;&#39046;&#22495;&#30340;&#35752;&#35770;&#36739;&#23569;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#20197;&#25928;&#29992;&#20026;&#23548;&#21521;&#30340;&#38656;&#27714;&#33539;&#24335;&#65292;&#25551;&#36848;&#21644;&#35780;&#20272;&#20102;&#20869;&#37096;&#21644;&#22806;&#37096;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
As a unifying concept in economics, game theory, and operations research, even in the Robotics and AI field, the utility is used to evaluate the level of individual needs, preferences, and interests. Especially for decision-making and learning in multi-agent/robot systems (MAS/MRS), a suitable utility model can guide agents in choosing reasonable strategies to achieve their current needs and learning to cooperate and organize their behaviors, optimizing the system's utility, building stable and reliable relationships, and guaranteeing each group member's sustainable development, similar to the human society. Although these systems' complex, large-scale, and long-term behaviors are strongly determined by the fundamental characteristics of the underlying relationships, there has been less discussion on the theoretical aspects of mechanisms and the fields of applications in Robotics and AI. This paper introduces a utility-orient needs paradigm to describe and evaluate inter and outer rela
&lt;/p&gt;</description></item></channel></rss>