<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#24322;&#24120;&#26816;&#27979;&#22312;&#25968;&#25454;&#23436;&#25972;&#24615;&#19981;&#21516;&#30340;&#25968;&#25454;&#38598;&#19978;&#30340;&#34920;&#29616;&#65292;&#24182;&#21457;&#29616;Random Forest&#31639;&#27861;&#22312;&#21508;&#31181;&#25968;&#25454;&#38598;&#19978;&#37117;&#23637;&#29616;&#20986;&#20102;&#21331;&#36234;&#30340;&#31283;&#20581;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.16843</link><description>&lt;p&gt;
&#35780;&#20272;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#24322;&#24120;&#26816;&#27979;&#22312;&#25968;&#25454;&#23436;&#25972;&#24615;&#19981;&#21516;&#30340;&#25968;&#25454;&#38598;&#19978;&#30340;&#34920;&#29616;&#65306;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Evaluating ML-Based Anomaly Detection Across Datasets of Varied Integrity: A Case Study. (arXiv:2401.16843v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16843
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35780;&#20272;&#20102;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#24322;&#24120;&#26816;&#27979;&#22312;&#25968;&#25454;&#23436;&#25972;&#24615;&#19981;&#21516;&#30340;&#25968;&#25454;&#38598;&#19978;&#30340;&#34920;&#29616;&#65292;&#24182;&#21457;&#29616;Random Forest&#31639;&#27861;&#22312;&#21508;&#31181;&#25968;&#25454;&#38598;&#19978;&#37117;&#23637;&#29616;&#20986;&#20102;&#21331;&#36234;&#30340;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#32593;&#32476;&#27969;&#37327;&#24322;&#24120;&#26816;&#27979;&#20013;&#25968;&#25454;&#23436;&#25972;&#24615;&#30340;&#26222;&#36941;&#38382;&#39064;&#65292;&#36825;&#23545;&#20110;&#24320;&#21457;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#36827;&#34892;&#24322;&#24120;&#26816;&#27979;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#20004;&#20010;&#32463;&#36807;&#25913;&#36827;&#30340;CICIDS-2017&#25968;&#25454;&#38598;&#30340;&#29256;&#26412;&#65292;NFS-2023-nTE&#21644;NFS-2023-TE&#65292;&#21033;&#29992;NFStream&#36827;&#34892;&#26041;&#27861;&#19978;&#21512;&#29702;&#30340;&#27969;&#37327;&#21040;&#26399;&#21644;&#26631;&#35760;&#22788;&#29702;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#23545;&#27604;&#20102;Random Forest&#65288;RF&#65289;&#31639;&#27861;&#22312;&#21407;&#22987;&#30340;CICIDS-2017&#25968;&#25454;&#38598;&#12289;&#20854;&#25913;&#36827;&#29256;&#26412;WTMC-2021&#21644;CRiSIS-2022&#20197;&#21450;&#25105;&#20204;&#22522;&#20110;NFStream&#29983;&#25104;&#30340;&#25968;&#25454;&#38598;&#19978;&#30340;&#24615;&#33021;&#65292;&#22312;&#20108;&#20998;&#31867;&#21644;&#22810;&#20998;&#31867;&#19978;&#19979;&#25991;&#20013;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;RF&#27169;&#22411;&#34920;&#29616;&#20986;&#24322;&#24120;&#30340;&#31283;&#20581;&#24615;&#65292;&#26080;&#35770;&#24213;&#23618;&#25968;&#25454;&#38598;&#30340;&#36136;&#37327;&#22914;&#20309;&#65292;&#22312;&#24615;&#33021;&#25351;&#26631;&#19978;&#37117;&#33021;&#20445;&#25345;&#19968;&#33268;&#30340;&#39640;&#27700;&#24179;&#65292;&#36825;&#24341;&#21457;&#20102;&#23545;&#23454;&#38469;&#24433;&#21709;&#30340;&#37325;&#35201;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cybersecurity remains a critical challenge in the digital age, with network traffic flow anomaly detection being a key pivotal instrument in the fight against cyber threats. In this study, we address the prevalent issue of data integrity in network traffic datasets, which are instrumental in developing machine learning (ML) models for anomaly detection. We introduce two refined versions of the CICIDS-2017 dataset, NFS-2023-nTE and NFS-2023-TE, processed using NFStream to ensure methodologically sound flow expiration and labeling. Our research contrasts the performance of the Random Forest (RF) algorithm across the original CICIDS-2017, its refined counterparts WTMC-2021 and CRiSIS-2022, and our NFStream-generated datasets, in both binary and multi-class classification contexts. We observe that the RF model exhibits exceptional robustness, achieving consistent high-performance metrics irrespective of the underlying dataset quality, which prompts a critical discussion on the actual impac
&lt;/p&gt;</description></item></channel></rss>