<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#28151;&#21512;&#20219;&#21153;&#20803;&#23398;&#20064;&#31639;&#27861;&#65292;&#29992;&#20110;&#21487;&#25193;&#23637;&#21644;&#21487;&#36716;&#31227;&#30340;&#24102;&#23485;&#20998;&#37197;&#12290;&#36890;&#36807;&#24341;&#20837;GNN&#21644;HML&#31639;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#36890;&#20449;&#22330;&#26223;&#19979;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#33021;&#21644;&#37319;&#26679;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2401.10253</link><description>&lt;p&gt;
&#28151;&#21512;&#20219;&#21153;&#20803;&#23398;&#20064;&#65306;&#19968;&#31181;&#29992;&#20110;&#21487;&#25193;&#23637;&#21644;&#21487;&#36716;&#31227;&#24102;&#23485;&#20998;&#37197;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Hybrid-Task Meta-Learning: A Graph Neural Network Approach for Scalable and Transferable Bandwidth Allocation. (arXiv:2401.10253v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10253
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#28151;&#21512;&#20219;&#21153;&#20803;&#23398;&#20064;&#31639;&#27861;&#65292;&#29992;&#20110;&#21487;&#25193;&#23637;&#21644;&#21487;&#36716;&#31227;&#30340;&#24102;&#23485;&#20998;&#37197;&#12290;&#36890;&#36807;&#24341;&#20837;GNN&#21644;HML&#31639;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#19981;&#21516;&#30340;&#36890;&#20449;&#22330;&#26223;&#19979;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#33021;&#21644;&#37319;&#26679;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#24102;&#23485;&#20998;&#37197;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#65306;1&#65289;&#38543;&#30528;&#29992;&#25143;&#25968;&#37327;&#30340;&#22686;&#21152;&#20855;&#26377;&#21487;&#25193;&#23637;&#24615;&#65307;2&#65289;&#33021;&#22815;&#22312;&#19981;&#21516;&#30340;&#36890;&#20449;&#22330;&#26223;&#19979;&#36827;&#34892;&#36716;&#31227;&#65292;&#20363;&#22914;&#38750;&#24179;&#31283;&#30340;&#26080;&#32447;&#20449;&#36947;&#12289;&#19981;&#21516;&#30340;&#26381;&#21153;&#36136;&#37327;&#35201;&#27714;&#21644;&#21160;&#24577;&#21487;&#29992;&#36164;&#28304;&#12290;&#20026;&#20102;&#25903;&#25345;&#21487;&#25193;&#23637;&#24615;&#65292;&#24102;&#23485;&#20998;&#37197;&#31574;&#30053;&#37319;&#29992;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#36827;&#34892;&#34920;&#31034;&#65292;&#35757;&#32451;&#21442;&#25968;&#30340;&#25968;&#37327;&#38543;&#29992;&#25143;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#19981;&#21464;&#12290;&#20026;&#20102;&#23454;&#29616;GNN&#30340;&#27867;&#21270;&#33021;&#21147;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#28151;&#21512;&#20219;&#21153;&#20803;&#23398;&#20064;&#65288;HML&#65289;&#31639;&#27861;&#65292;&#22312;&#20803;&#35757;&#32451;&#36807;&#31243;&#20013;&#20351;&#29992;&#19981;&#21516;&#30340;&#36890;&#20449;&#22330;&#26223;&#26469;&#35757;&#32451;GNN&#30340;&#21021;&#22987;&#21442;&#25968;&#12290;&#28982;&#21518;&#65292;&#22312;&#20803;&#27979;&#35797;&#36807;&#31243;&#20013;&#65292;&#20351;&#29992;&#23569;&#37327;&#26679;&#26412;&#23545;GNN&#36827;&#34892;&#24494;&#35843;&#20197;&#36866;&#24212;&#26410;&#35265;&#36807;&#30340;&#36890;&#20449;&#22330;&#26223;&#12290;&#20223;&#30495;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#29616;&#26377;&#22522;&#20934;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;HML&#26041;&#27861;&#21487;&#20197;&#23558;&#21021;&#22987;&#24615;&#33021;&#25552;&#39640;8.79&#65285;&#65292;&#24182;&#25552;&#39640;&#37319;&#26679;&#25928;&#29575;73&#65285;&#12290;&#22312;&#24494;&#35843;&#21518;&#65292;
&lt;/p&gt;
&lt;p&gt;
In this paper, we develop a deep learning-based bandwidth allocation policy that is: 1) scalable with the number of users and 2) transferable to different communication scenarios, such as non-stationary wireless channels, different quality-of-service (QoS) requirements, and dynamically available resources. To support scalability, the bandwidth allocation policy is represented by a graph neural network (GNN), with which the number of training parameters does not change with the number of users. To enable the generalization of the GNN, we develop a hybrid-task meta-learning (HML) algorithm that trains the initial parameters of the GNN with different communication scenarios during meta-training. Next, during meta-testing, a few samples are used to fine-tune the GNN with unseen communication scenarios. Simulation results demonstrate that our HML approach can improve the initial performance by $8.79\%$, and sampling efficiency by $73\%$, compared with existing benchmarks. After fine-tuning,
&lt;/p&gt;</description></item></channel></rss>