<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#36136;&#37327;&#22810;&#26679;&#24615;&#31639;&#27861;&#20026;&#26230;&#20307;&#32467;&#26500;&#39044;&#27979;&#25171;&#24320;&#20102;&#19968;&#26465;&#26032;&#36884;&#24452;&#65292;&#26088;&#22312;&#21457;&#29616;&#20855;&#26377;&#22810;&#26679;&#29305;&#24449;&#30340;&#39640;&#24615;&#33021;&#35299;&#20915;&#26041;&#26696;&#38598;&#21512;&#65292;&#21487;&#20197;&#20248;&#21270;&#26230;&#20307;&#32467;&#26500;&#31283;&#23450;&#24615;&#20197;&#21450;&#20854;&#20182;&#30446;&#26631;&#22914;&#30913;&#24615;&#25110;&#28909;&#30005;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.17164</link><description>&lt;p&gt;
&#22810;&#30446;&#26631;&#36136;&#37327;&#22810;&#26679;&#24615;&#29992;&#20110;&#26230;&#20307;&#32467;&#26500;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Multi-Objective Quality-Diversity for Crystal Structure Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17164
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#36136;&#37327;&#22810;&#26679;&#24615;&#31639;&#27861;&#20026;&#26230;&#20307;&#32467;&#26500;&#39044;&#27979;&#25171;&#24320;&#20102;&#19968;&#26465;&#26032;&#36884;&#24452;&#65292;&#26088;&#22312;&#21457;&#29616;&#20855;&#26377;&#22810;&#26679;&#29305;&#24449;&#30340;&#39640;&#24615;&#33021;&#35299;&#20915;&#26041;&#26696;&#38598;&#21512;&#65292;&#21487;&#20197;&#20248;&#21270;&#26230;&#20307;&#32467;&#26500;&#31283;&#23450;&#24615;&#20197;&#21450;&#20854;&#20182;&#30446;&#26631;&#22914;&#30913;&#24615;&#25110;&#28909;&#30005;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26230;&#20307;&#32467;&#26500;&#22312;&#20174;&#30005;&#27744;&#21040;&#22826;&#38451;&#33021;&#30005;&#27744;&#31561;&#21508;&#20010;&#39046;&#22495;&#20013;&#37117;&#26159;&#19981;&#21487;&#25110;&#32570;&#30340;&#65292;&#38024;&#23545;&#20854;&#21407;&#23376;&#37197;&#32622;&#39044;&#27979;&#24615;&#33021;&#24050;&#32463;&#26377;&#20102;&#22823;&#37327;&#30740;&#31350;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#26230;&#20307;&#32467;&#26500;&#39044;&#27979;&#26041;&#27861;&#20391;&#37325;&#20110;&#35782;&#21035;&#33021;&#37327;&#20989;&#25968;&#20840;&#23616;&#26368;&#23567;&#20540;&#22788;&#30340;&#26368;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#65292;&#32780;&#24573;&#30053;&#20102;&#37027;&#20123;&#21487;&#33021;&#20301;&#20110;&#30456;&#37051;&#23616;&#37096;&#26497;&#23567;&#20540;&#22788;&#12289;&#20855;&#26377;&#19981;&#21516;&#26448;&#26009;&#29305;&#24615;&#65288;&#22914;&#30005;&#23548;&#29575;&#25110;&#25239;&#21464;&#24418;&#24615;&#65289;&#30340;&#20854;&#20182;&#26377;&#36259;&#26448;&#26009;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#36136;&#37327;&#22810;&#26679;&#24615;&#31639;&#27861;&#20026;&#26230;&#20307;&#32467;&#26500;&#39044;&#27979;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#36884;&#24452;&#65292;&#22240;&#20026;&#23427;&#26088;&#22312;&#25214;&#21040;&#20855;&#26377;&#22810;&#26679;&#29305;&#24449;&#30340;&#39640;&#24615;&#33021;&#35299;&#20915;&#26041;&#26696;&#38598;&#21512;&#12290;&#28982;&#32780;&#65292;&#20248;&#21270;&#26230;&#20307;&#32467;&#26500;&#31283;&#23450;&#24615;&#20197;&#21450;&#20854;&#20182;&#30446;&#26631;&#65288;&#22914;&#30913;&#24615;&#25110;&#28909;&#30005;&#25928;&#29575;&#65289;&#20063;&#21487;&#33021;&#26159;&#26377;&#20215;&#20540;&#30340;&#12290;&#22240;&#27492;&#65292;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;......
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17164v1 Announce Type: cross  Abstract: Crystal structures are indispensable across various domains, from batteries to solar cells, and extensive research has been dedicated to predicting their properties based on their atomic configurations. However, prevailing Crystal Structure Prediction methods focus on identifying the most stable solutions that lie at the global minimum of the energy function. This approach overlooks other potentially interesting materials that lie in neighbouring local minima and have different material properties such as conductivity or resistance to deformation. By contrast, Quality-Diversity algorithms provide a promising avenue for Crystal Structure Prediction as they aim to find a collection of high-performing solutions that have diverse characteristics. However, it may also be valuable to optimise for the stability of crystal structures alongside other objectives such as magnetism or thermoelectric efficiency. Therefore, in this work, we harness 
&lt;/p&gt;</description></item></channel></rss>