<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#28145;&#24230;&#23398;&#20064;&#20013;&#30340;&#22855;&#24322;&#20540;&#20998;&#35299;&#65288;SVD&#65289;&#22312;&#36870;&#38382;&#39064;&#20013;&#25104;&#20026;&#21487;&#35299;&#37322;&#30340;&#22240;&#23376;&#21270;&#24037;&#20855;&#65292;&#36890;&#36807;&#19982;&#35299;&#23494;&#21464;&#25442;&#32467;&#21512;&#65292;&#21487;&#20197;&#29992;&#26469;&#35299;&#37322;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#22312;&#22122;&#22768;&#21442;&#25968;&#20272;&#35745;&#38382;&#39064;&#20013;&#32534;&#30721;&#20449;&#21495;&#27169;&#22411;&#30340;&#32467;&#26500;</title><link>http://arxiv.org/abs/2301.07820</link><description>&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#20013;&#22855;&#24322;&#20540;&#20998;&#35299;&#65288;SVD&#65289;&#20316;&#20026;&#21487;&#35299;&#37322;&#30340;&#22240;&#23376;&#21270;&#30340;&#20986;&#29616;&#22312;&#36870;&#38382;&#39064;&#20013;
&lt;/p&gt;
&lt;p&gt;
Emergence of the SVD as an interpretable factorization in deep learning for inverse problems. (arXiv:2301.07820v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.07820
&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#20013;&#30340;&#22855;&#24322;&#20540;&#20998;&#35299;&#65288;SVD&#65289;&#22312;&#36870;&#38382;&#39064;&#20013;&#25104;&#20026;&#21487;&#35299;&#37322;&#30340;&#22240;&#23376;&#21270;&#24037;&#20855;&#65292;&#36890;&#36807;&#19982;&#35299;&#23494;&#21464;&#25442;&#32467;&#21512;&#65292;&#21487;&#20197;&#29992;&#26469;&#35299;&#37322;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#22312;&#22122;&#22768;&#21442;&#25968;&#20272;&#35745;&#38382;&#39064;&#20013;&#32534;&#30721;&#20449;&#21495;&#27169;&#22411;&#30340;&#32467;&#26500;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#26435;&#37325;&#30697;&#38453;&#30340;&#22855;&#24322;&#20540;&#20998;&#35299;&#65288;SVD&#65289;&#20316;&#20026;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#35299;&#37322;&#24037;&#20855;&#30340;&#20986;&#29616;&#65292;&#24403;&#19982;&#35299;&#23494;&#21464;&#25442;&#30456;&#32467;&#21512;&#26102;&#65292;&#36825;&#26159;&#19968;&#31181;&#26368;&#36817;&#38024;&#23545;&#22122;&#22768;&#21442;&#25968;&#20272;&#35745;&#31070;&#32463;&#32593;&#32476;&#30340;&#35299;&#37322;&#25216;&#26415;&#12290;&#36890;&#36807;&#32771;&#34385;&#20256;&#36882;&#32473;&#35299;&#23494;&#26368;&#23567;&#21270;&#38382;&#39064;&#30340;&#25968;&#25454;&#30340;&#24179;&#22343;&#25928;&#26524;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#22823;&#25968;&#25454;&#26497;&#38480;&#19979;&#65292;&#35299;&#23494;&#21464;&#25442;&#21487;&#20197;&#29992;NN&#26435;&#37325;&#30340;SVD&#21644;&#36755;&#20837;&#33258;&#30456;&#20851;&#30697;&#38453;&#26469;&#34920;&#31034;&#12290;&#21033;&#29992;&#36825;&#20010;&#20107;&#23454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#22122;&#22768;&#21442;&#25968;&#20272;&#35745;&#38382;&#39064;&#31867;&#20013;&#65292;SVD&#21487;&#20197;&#26159;&#35757;&#32451;&#32593;&#32476;&#32534;&#30721;&#20449;&#21495;&#27169;&#22411;&#30340;&#32467;&#26500;&#12290;&#25105;&#20204;&#29992;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#20449;&#21495;&#27169;&#22411;&#30340;&#23454;&#35777;&#35777;&#25454;&#36827;&#19968;&#27493;&#25903;&#25345;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#21457;&#29616;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#36824;&#25581;&#31034;&#20102;&#25968;&#23398;&#29702;&#35770;&#21644;&#35821;&#20041;&#21457;&#23637;&#20043;&#38388;&#30340;&#32852;&#31995;
&lt;/p&gt;
&lt;p&gt;
Within the framework of deep learning we demonstrate the emergence of the singular value decomposition (SVD) of the weight matrix as a tool for interpretation of neural networks (NN) when combined with the descrambling transformation--a recently-developed technique for addressing interpretability in noisy parameter estimation neural networks \cite{amey2021neural}. By considering the averaging effect of the data passed to the descrambling minimization problem, we show that descrambling transformations--in the large data limit--can be expressed in terms of the SVD of the NN weights and the input autocorrelation matrix. Using this fact, we show that within the class of noisy parameter estimation problems the SVD may be the structure through which trained networks encode a signal model. We substantiate our theoretical findings with empirical evidence from both linear and non-linear signal models. Our results also illuminate the connections between a mathematical theory of semantic developm
&lt;/p&gt;</description></item></channel></rss>