<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38598;&#21512;&#30340;&#36864;&#28779;&#37325;&#35201;&#24615;&#25277;&#26679;&#31639;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#20154;&#21475;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#26469;&#25552;&#39640;&#25277;&#26679;&#25928;&#29575;&#65292;&#24182;&#21033;&#29992;&#38598;&#21512;&#30340;&#30456;&#20114;&#20316;&#29992;&#20419;&#36827;&#26410;&#21457;&#29616;&#27169;&#24577;&#30340;&#25506;&#32034;&#12290;</title><link>http://arxiv.org/abs/2401.15645</link><description>&lt;p&gt;
&#22522;&#20110;&#38598;&#21512;&#30340;&#36864;&#28779;&#37325;&#35201;&#24615;&#25277;&#26679;
&lt;/p&gt;
&lt;p&gt;
Ensemble-Based Annealed Importance Sampling. (arXiv:2401.15645v1 [stat.CO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15645
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38598;&#21512;&#30340;&#36864;&#28779;&#37325;&#35201;&#24615;&#25277;&#26679;&#31639;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#20154;&#21475;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#26469;&#25552;&#39640;&#25277;&#26679;&#25928;&#29575;&#65292;&#24182;&#21033;&#29992;&#38598;&#21512;&#30340;&#30456;&#20114;&#20316;&#29992;&#20419;&#36827;&#26410;&#21457;&#29616;&#27169;&#24577;&#30340;&#25506;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#22810;&#27169;&#24577;&#20998;&#24067;&#20013;&#36827;&#34892;&#25277;&#26679;&#26159;&#35745;&#31639;&#31185;&#23398;&#21644;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#19988;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#22312;&#21508;&#31181;&#26041;&#27861;&#20013;&#65292;&#19968;&#31181;&#27969;&#34892;&#30340;&#26041;&#27861;&#26159;&#36864;&#28779;&#37325;&#35201;&#24615;&#25277;&#26679;&#65288;AIS&#65289;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38598;&#21512;&#30340;AIS&#29256;&#26412;&#65292;&#36890;&#36807;&#23558;&#20854;&#19982;&#22522;&#20110;&#20154;&#21475;&#30340;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#30456;&#32467;&#21512;&#65292;&#20197;&#25552;&#39640;&#20854;&#25928;&#29575;&#12290;&#36890;&#36807;&#36319;&#36394;&#38598;&#21512;&#32780;&#19981;&#26159;&#21333;&#20010;&#31890;&#23376;&#27839;&#36215;&#22987;&#20998;&#24067;&#21644;&#30446;&#26631;&#20998;&#24067;&#20043;&#38388;&#30340;&#26576;&#20010;&#24310;&#32493;&#36335;&#24452;&#65292;&#25105;&#20204;&#21033;&#29992;&#38598;&#21512;&#20869;&#30340;&#30456;&#20114;&#20316;&#29992;&#26469;&#20419;&#36827;&#26410;&#21457;&#29616;&#27169;&#24577;&#30340;&#25506;&#32034;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#30340;&#20027;&#35201;&#24605;&#24819;&#26159;&#21033;&#29992;Snooker&#31639;&#27861;&#25110;&#36827;&#21270;&#33945;&#29305;&#21345;&#27931;&#20013;&#20351;&#29992;&#30340;&#36951;&#20256;&#31639;&#27861;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#22914;&#20309;&#23454;&#29616;&#25152;&#25552;&#20986;&#30340;&#31639;&#27861;&#65292;&#24182;&#25512;&#23548;&#20102;&#22312;&#36830;&#32493;&#26102;&#38388;&#21644;&#22343;&#22330;&#26497;&#38480;&#19979;&#25511;&#21046;&#38598;&#21512;&#28436;&#21270;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#12290;&#25105;&#20204;&#36824;&#27979;&#35797;&#20102;&#25152;&#25552;&#31639;&#27861;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sampling from a multimodal distribution is a fundamental and challenging problem in computational science and statistics. Among various approaches proposed for this task, one popular method is Annealed Importance Sampling (AIS). In this paper, we propose an ensemble-based version of AIS by combining it with population-based Monte Carlo methods to improve its efficiency. By keeping track of an ensemble instead of a single particle along some continuation path between the starting distribution and the target distribution, we take advantage of the interaction within the ensemble to encourage the exploration of undiscovered modes. Specifically, our main idea is to utilize either the snooker algorithm or the genetic algorithm used in Evolutionary Monte Carlo. We discuss how the proposed algorithm can be implemented and derive a partial differential equation governing the evolution of the ensemble under the continuous time and mean-field limit. We also test the efficiency of the proposed alg
&lt;/p&gt;</description></item></channel></rss>