<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31215;&#20998;&#31639;&#23376;&#26041;&#27861;&#26469;&#35299;&#20915;&#29699;&#38754;&#19978;&#30340;&#25955;&#28857;&#25968;&#25454;&#25311;&#21512;&#38382;&#39064;&#65292;&#36890;&#36807;&#30740;&#31350;&#21152;&#26435;&#35889;&#28388;&#27874;&#31639;&#27861;&#30340;&#36924;&#36817;&#24615;&#33021;&#65292;&#25104;&#21151;&#25512;&#23548;&#20986;&#20102;&#24102;&#26435;&#37325;&#35889;&#28388;&#27874;&#31639;&#27861;&#30340;&#26368;&#20248;&#35823;&#24046;&#20272;&#35745;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#36991;&#20813;&#19968;&#20123;&#29616;&#26377;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#31181;&#20248;&#21270;&#31639;&#27861;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.15294</link><description>&lt;p&gt;
&#29699;&#38754;&#19978;&#25955;&#28857;&#25968;&#25454;&#25311;&#21512;&#30340;&#31215;&#20998;&#31639;&#23376;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Integral Operator Approaches for Scattered Data Fitting on Spheres. (arXiv:2401.15294v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15294
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31215;&#20998;&#31639;&#23376;&#26041;&#27861;&#26469;&#35299;&#20915;&#29699;&#38754;&#19978;&#30340;&#25955;&#28857;&#25968;&#25454;&#25311;&#21512;&#38382;&#39064;&#65292;&#36890;&#36807;&#30740;&#31350;&#21152;&#26435;&#35889;&#28388;&#27874;&#31639;&#27861;&#30340;&#36924;&#36817;&#24615;&#33021;&#65292;&#25104;&#21151;&#25512;&#23548;&#20986;&#20102;&#24102;&#26435;&#37325;&#35889;&#28388;&#27874;&#31639;&#27861;&#30340;&#26368;&#20248;&#35823;&#24046;&#20272;&#35745;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#36991;&#20813;&#19968;&#20123;&#29616;&#26377;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#31181;&#20248;&#21270;&#31639;&#27861;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30528;&#37325;&#30740;&#31350;&#20102;&#29699;&#38754;&#19978;&#30340;&#25955;&#28857;&#25968;&#25454;&#25311;&#21512;&#38382;&#39064;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31867;&#21152;&#26435;&#35889;&#28388;&#27874;&#31639;&#27861;&#65288;&#21253;&#25324;Tikhonov&#27491;&#21017;&#21270;&#12289;Landaweber&#36845;&#20195;&#12289;&#35889;&#25130;&#26029;&#21644;&#36845;&#20195;Tikhonov&#65289;&#22312;&#25311;&#21512;&#21487;&#33021;&#23384;&#22312;&#30340;&#26080;&#30028;&#38543;&#26426;&#22122;&#22768;&#30340;&#22024;&#26434;&#25968;&#25454;&#26102;&#30340;&#36924;&#36817;&#24615;&#33021;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31215;&#20998;&#31639;&#23376;&#26041;&#27861;&#65292;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#25955;&#28857;&#25968;&#25454;&#25311;&#21512;&#39046;&#22495;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#37319;&#26679;&#19981;&#31561;&#24335;&#26041;&#27861;&#21644;&#35268;&#33539;&#38598;&#26041;&#27861;&#30340;&#24310;&#20280;&#12290;&#36890;&#36807;&#25552;&#20379;&#31639;&#23376;&#24046;&#24322;&#21644;&#25968;&#20540;&#31215;&#20998;&#35268;&#21017;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#25105;&#20204;&#25104;&#21151;&#22320;&#25512;&#23548;&#20986;&#24102;&#26435;&#37325;&#35889;&#28388;&#27874;&#31639;&#27861;&#30340;Sobolev&#31867;&#22411;&#35823;&#24046;&#20272;&#35745;&#30340;&#26368;&#20248;&#32467;&#26524;&#12290;&#25105;&#20204;&#30340;&#35823;&#24046;&#20272;&#35745;&#19981;&#21463;&#25991;&#29486;&#20013;Tikhonov&#27491;&#21017;&#21270;&#30340;&#39281;&#21644;&#29616;&#35937;&#12289;&#29616;&#26377;&#35823;&#24046;&#20998;&#26512;&#20013;&#30340;&#26412;&#22320;&#31354;&#38388;&#23631;&#38556;&#21644;&#19981;&#21516;&#23884;&#20837;&#31354;&#38388;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#32780;&#27835;&#20043;&#30340;&#26041;&#26696;&#65292;&#20197;&#25552;&#21319;&#21152;&#26435;&#35889;&#28388;&#27874;&#31639;&#27861;&#30340;&#25928;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper focuses on scattered data fitting problems on spheres. We study the approximation performance of a class of weighted spectral filter algorithms, including Tikhonov regularization, Landaweber iteration, spectral cut-off, and iterated Tikhonov, in fitting noisy data with possibly unbounded random noise. For the analysis, we develop an integral operator approach that can be regarded as an extension of the widely used sampling inequality approach and norming set method in the community of scattered data fitting. After providing an equivalence between the operator differences and quadrature rules, we succeed in deriving optimal Sobolev-type error estimates of weighted spectral filter algorithms. Our derived error estimates do not suffer from the saturation phenomenon for Tikhonov regularization in the literature, native-space-barrier for existing error analysis and adapts to different embedding spaces. We also propose a divide-and-conquer scheme to equip weighted spectral filter 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#29983;&#25104;&#24314;&#27169;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#25193;&#25955;&#26144;&#23556;&#19982;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#30456;&#32467;&#21512;&#65292;&#22312;&#20165;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#35757;&#32451;&#26679;&#26412;&#30340;&#24773;&#20917;&#19979;&#29983;&#25104;&#26032;&#26679;&#26412;&#65292;&#24182;&#35299;&#20915;&#20102;&#26102;&#38388;&#27493;&#38271;&#20725;&#30828;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#20013;&#30340;&#31283;&#23450;&#24615;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.04372</link><description>&lt;p&gt;
&#20351;&#29992;&#25193;&#25955;&#26144;&#23556;&#36827;&#34892;&#31283;&#23450;&#30340;&#29983;&#25104;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Stable generative modeling using diffusion maps. (arXiv:2401.04372v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04372
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#29983;&#25104;&#24314;&#27169;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#25193;&#25955;&#26144;&#23556;&#19982;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#30456;&#32467;&#21512;&#65292;&#22312;&#20165;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#35757;&#32451;&#26679;&#26412;&#30340;&#24773;&#20917;&#19979;&#29983;&#25104;&#26032;&#26679;&#26412;&#65292;&#24182;&#35299;&#20915;&#20102;&#26102;&#38388;&#27493;&#38271;&#20725;&#30828;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#20013;&#30340;&#31283;&#23450;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20174;&#20165;&#26377;&#36275;&#22815;&#25968;&#37327;&#30340;&#35757;&#32451;&#26679;&#26412;&#21487;&#24471;&#21040;&#30340;&#26410;&#30693;&#20998;&#24067;&#20013;&#25277;&#26679;&#30340;&#38382;&#39064;&#12290;&#22312;&#29983;&#25104;&#24314;&#27169;&#30340;&#32972;&#26223;&#19979;&#65292;&#36825;&#26679;&#30340;&#35774;&#32622;&#26368;&#36817;&#24341;&#36215;&#20102;&#30456;&#24403;&#22823;&#30340;&#20851;&#27880;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#25193;&#25955;&#26144;&#23556;&#21644;&#26391;&#20043;&#19975;&#21160;&#21147;&#23398;&#30456;&#32467;&#21512;&#30340;&#29983;&#25104;&#27169;&#22411;&#12290;&#25193;&#25955;&#26144;&#23556;&#29992;&#20110;&#20174;&#21487;&#29992;&#30340;&#35757;&#32451;&#26679;&#26412;&#20013;&#36817;&#20284;&#24471;&#21040;&#28418;&#31227;&#39033;&#65292;&#28982;&#21518;&#22312;&#31163;&#25955;&#26102;&#38388;&#30340;&#26391;&#20043;&#19975;&#37319;&#26679;&#22120;&#20013;&#23454;&#29616;&#29983;&#25104;&#26032;&#26679;&#26412;&#12290;&#36890;&#36807;&#23558;&#26680;&#24102;&#23485;&#35774;&#32622;&#20026;&#19982;&#26410;&#35843;&#25972;&#30340;&#26391;&#20043;&#19975;&#31639;&#27861;&#20013;&#20351;&#29992;&#30340;&#26102;&#38388;&#27493;&#38271;&#21305;&#37197;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#26377;&#25928;&#22320;&#36991;&#20813;&#36890;&#24120;&#19982;&#26102;&#38388;&#27493;&#38271;&#20725;&#30828;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#30456;&#20851;&#30340;&#31283;&#23450;&#24615;&#38382;&#39064;&#12290;&#26356;&#20934;&#30830;&#22320;&#35828;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20998;&#35010;&#27493;&#39588;&#26041;&#26696;&#65292;&#30830;&#20445;&#29983;&#25104;&#30340;&#26679;&#26412;&#20445;&#25345;&#22312;&#35757;&#32451;&#26679;&#26412;&#30340;&#20984;&#21253;&#20869;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#21487;&#20197;&#33258;&#28982;&#22320;&#25193;&#23637;&#20026;&#29983;&#25104;&#26465;&#20214;&#26679;&#26412;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of sampling from an unknown distribution for which only a sufficiently large number of training samples are available. Such settings have recently drawn considerable interest in the context of generative modelling. In this paper, we propose a generative model combining diffusion maps and Langevin dynamics. Diffusion maps are used to approximate the drift term from the available training samples, which is then implemented in a discrete-time Langevin sampler to generate new samples. By setting the kernel bandwidth to match the time step size used in the unadjusted Langevin algorithm, our method effectively circumvents any stability issues typically associated with time-stepping stiff stochastic differential equations. More precisely, we introduce a novel split-step scheme, ensuring that the generated samples remain within the convex hull of the training samples. Our framework can be naturally extended to generate conditional samples. We demonstrate the performance
&lt;/p&gt;</description></item></channel></rss>