<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#38754;&#21521;&#36793;&#32536;&#35745;&#31639;&#36801;&#31227;&#30340;&#25925;&#38556;&#33258;&#36866;&#24212;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550; FIRE&#65292;&#24341;&#20837;ImRE&#31639;&#27861;&#65292;&#36890;&#36807;&#22312;&#36793;&#32536;&#35745;&#31639;&#25968;&#23383;&#23402;&#29983;&#29615;&#22659;&#20013;&#35757;&#32451;RL&#31574;&#30053;&#26469;&#36866;&#24212;&#32597;&#35265;&#20107;&#20214;&#65292;&#35299;&#20915;&#20102;RL&#26694;&#26550;&#22312;&#22788;&#29702;&#20598;&#21457;&#26381;&#21153;&#22120;&#25925;&#38556;&#26041;&#38754;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2209.14399</link><description>&lt;p&gt;
FIRE&#65306;&#38754;&#21521;&#36793;&#32536;&#35745;&#31639;&#36801;&#31227;&#30340;&#25925;&#38556;&#33258;&#36866;&#24212;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
FIRE: A Failure-Adaptive Reinforcement Learning Framework for Edge Computing Migrations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2209.14399
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#38754;&#21521;&#36793;&#32536;&#35745;&#31639;&#36801;&#31227;&#30340;&#25925;&#38556;&#33258;&#36866;&#24212;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550; FIRE&#65292;&#24341;&#20837;ImRE&#31639;&#27861;&#65292;&#36890;&#36807;&#22312;&#36793;&#32536;&#35745;&#31639;&#25968;&#23383;&#23402;&#29983;&#29615;&#22659;&#20013;&#35757;&#32451;RL&#31574;&#30053;&#26469;&#36866;&#24212;&#32597;&#35265;&#20107;&#20214;&#65292;&#35299;&#20915;&#20102;RL&#26694;&#26550;&#22312;&#22788;&#29702;&#20598;&#21457;&#26381;&#21153;&#22120;&#25925;&#38556;&#26041;&#38754;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36793;&#32536;&#35745;&#31639;&#20013;&#65292;&#29992;&#25143;&#26381;&#21153;&#37197;&#32622;&#25991;&#20214;&#30001;&#20110;&#29992;&#25143;&#31227;&#21160;&#32780;&#36827;&#34892;&#36801;&#31227;&#12290;&#24050;&#32463;&#25552;&#20986;&#20102;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#26694;&#26550;&#26469;&#36827;&#34892;&#36801;&#31227;&#65292;&#36890;&#24120;&#26159;&#22312;&#27169;&#25311;&#25968;&#25454;&#19978;&#36827;&#34892;&#35757;&#32451;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;RL&#26694;&#26550;&#24573;&#35270;&#20102;&#20598;&#21457;&#30340;&#26381;&#21153;&#22120;&#25925;&#38556;&#65292;&#23613;&#31649;&#32597;&#35265;&#65292;&#20294;&#20250;&#24433;&#21709;&#21040;&#20687;&#33258;&#21160;&#39550;&#39542;&#21644;&#23454;&#26102;&#38556;&#30861;&#26816;&#27979;&#31561;&#23545;&#24310;&#36831;&#25935;&#24863;&#30340;&#24212;&#29992;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#65288;&#32597;&#35265;&#20107;&#20214;&#65289;&#25925;&#38556;&#34429;&#28982;&#22312;&#21382;&#21490;&#35757;&#32451;&#25968;&#25454;&#20013;&#27809;&#26377;&#24471;&#21040;&#20805;&#20998;&#20195;&#34920;&#65292;&#21364;&#23545;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;RL&#31639;&#27861;&#26500;&#25104;&#25361;&#25112;&#12290;&#30001;&#20110;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#35843;&#25972;&#25925;&#38556;&#39057;&#29575;&#36827;&#34892;&#35757;&#32451;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;FIRE&#65292;&#36825;&#26159;&#19968;&#20010;&#36890;&#36807;&#22312;&#36793;&#32536;&#35745;&#31639;&#25968;&#23383;&#23402;&#29983;&#29615;&#22659;&#20013;&#35757;&#32451;RL&#31574;&#30053;&#26469;&#36866;&#24212;&#32597;&#35265;&#20107;&#20214;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;ImRE&#65292;&#19968;&#31181;&#22522;&#20110;&#37325;&#35201;&#24615;&#25277;&#26679;&#30340;Q-learning&#31639;&#27861;&#65292;&#23427;&#26681;&#25454;&#32597;&#35265;&#20107;&#20214;&#23545;&#20540;&#20989;&#25968;&#30340;&#24433;&#21709;&#36827;&#34892;&#27604;&#20363;&#25277;&#26679;&#12290;FIRE&#32771;&#34385;&#20102;&#24310;&#36831;&#12289;&#36801;&#31227;&#12289;&#25925;&#38556;&#21644;&#22791;&#20221;pl
&lt;/p&gt;
&lt;p&gt;
arXiv:2209.14399v2 Announce Type: replace-cross  Abstract: In edge computing, users' service profiles are migrated due to user mobility. Reinforcement learning (RL) frameworks have been proposed to do so, often trained on simulated data. However, existing RL frameworks overlook occasional server failures, which although rare, impact latency-sensitive applications like autonomous driving and real-time obstacle detection. Nevertheless, these failures (rare events), being not adequately represented in historical training data, pose a challenge for data-driven RL algorithms. As it is impractical to adjust failure frequency in real-world applications for training, we introduce FIRE, a framework that adapts to rare events by training a RL policy in an edge computing digital twin environment. We propose ImRE, an importance sampling-based Q-learning algorithm, which samples rare events proportionally to their impact on the value function. FIRE considers delay, migration, failure, and backup pl
&lt;/p&gt;</description></item></channel></rss>