<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#35813;&#35770;&#25991;&#21457;&#29616;&#65292;&#22312;&#26410;&#30693;&#31181;&#32676;&#20013;&#23646;&#20110;&#26410;&#22312;&#35757;&#32451;&#25968;&#25454;&#20013;&#20986;&#29616;&#30340;&#31867;&#30340;&#25968;&#25454;&#28857;&#30340;&#27604;&#20363;&#20960;&#20046;&#23436;&#20840;&#21462;&#20915;&#20110;&#35757;&#32451;&#25968;&#25454;&#20013;&#20986;&#29616;&#30456;&#21516;&#27425;&#25968;&#30340;&#31867;&#30340;&#25968;&#37327;&#12290;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36951;&#20256;&#31639;&#27861;&#65292;&#33021;&#22815;&#26681;&#25454;&#26679;&#26412;&#25214;&#21040;&#19968;&#20010;&#20855;&#26377;&#26368;&#23567;&#22343;&#26041;&#35823;&#24046;&#30340;&#20272;&#35745;&#37327;&#12290;</title><link>https://arxiv.org/abs/2402.05835</link><description>&lt;p&gt;
&#19981;&#21487;&#35265;&#25968;&#25454;&#21462;&#20915;&#20110;&#24050;&#30693;&#20449;&#24687;&#30340;&#22810;&#23569;
&lt;/p&gt;
&lt;p&gt;
How Much is Unseen Depends Chiefly on Information About the Seen
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05835
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#21457;&#29616;&#65292;&#22312;&#26410;&#30693;&#31181;&#32676;&#20013;&#23646;&#20110;&#26410;&#22312;&#35757;&#32451;&#25968;&#25454;&#20013;&#20986;&#29616;&#30340;&#31867;&#30340;&#25968;&#25454;&#28857;&#30340;&#27604;&#20363;&#20960;&#20046;&#23436;&#20840;&#21462;&#20915;&#20110;&#35757;&#32451;&#25968;&#25454;&#20013;&#20986;&#29616;&#30456;&#21516;&#27425;&#25968;&#30340;&#31867;&#30340;&#25968;&#37327;&#12290;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36951;&#20256;&#31639;&#27861;&#65292;&#33021;&#22815;&#26681;&#25454;&#26679;&#26412;&#25214;&#21040;&#19968;&#20010;&#20855;&#26377;&#26368;&#23567;&#22343;&#26041;&#35823;&#24046;&#30340;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20045;&#19968;&#30475;&#21487;&#33021;&#26377;&#20123;&#36829;&#21453;&#30452;&#35273;&#65306;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#39044;&#26399;&#20013;&#65292;&#26410;&#30693;&#31181;&#32676;&#20013;&#23646;&#20110;&#22312;&#35757;&#32451;&#25968;&#25454;&#20013;&#27809;&#26377;&#20986;&#29616;&#30340;&#31867;&#30340;&#25968;&#25454;&#28857;&#30340;&#27604;&#20363;&#20960;&#20046;&#23436;&#20840;&#30001;&#35757;&#32451;&#25968;&#25454;&#20013;&#20986;&#29616;&#30456;&#21516;&#27425;&#25968;&#30340;&#31867;&#30340;&#25968;&#37327;$f_k$&#30830;&#23450;&#12290;&#34429;&#28982;&#22312;&#29702;&#35770;&#19978;&#25105;&#20204;&#35777;&#26126;&#20102;&#30001;&#35813;&#20272;&#35745;&#37327;&#24341;&#36215;&#30340;&#20559;&#24046;&#22312;&#26679;&#26412;&#22823;&#23567;&#25351;&#25968;&#32423;&#34928;&#20943;&#65292;&#20294;&#22312;&#23454;&#36341;&#20013;&#65292;&#39640;&#26041;&#24046;&#38459;&#27490;&#25105;&#20204;&#30452;&#25509;&#20351;&#29992;&#23427;&#20316;&#20026;&#26679;&#26412;&#35206;&#30422;&#20272;&#35745;&#37327;&#12290;&#20294;&#26159;&#65292;&#25105;&#20204;&#23545;$f_k$&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#36827;&#34892;&#20102;&#31934;&#30830;&#30340;&#25551;&#36848;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#22810;&#20010;&#19981;&#21516;&#26399;&#26395;&#20540;&#34920;&#31034;&#30340;&#25628;&#32034;&#31354;&#38388;&#65292;&#21487;&#20197;&#30830;&#23450;&#22320;&#23454;&#20363;&#21270;&#20026;&#20272;&#35745;&#37327;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#36716;&#21521;&#20248;&#21270;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#36951;&#20256;&#31639;&#27861;&#65292;&#20165;&#26681;&#25454;&#26679;&#26412;&#25628;&#32034;&#24179;&#22343;&#22343;&#26041;&#35823;&#24046;&#65288;MSE&#65289;&#26368;&#23567;&#30340;&#20272;&#35745;&#37327;&#12290;&#22312;&#25105;&#20204;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#36951;&#20256;&#31639;&#27861;&#21457;&#29616;&#20102;&#20855;&#26377;&#26126;&#26174;&#36739;&#23567;&#26041;&#24046;&#30340;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
It might seem counter-intuitive at first: We find that, in expectation, the proportion of data points in an unknown population-that belong to classes that do not appear in the training data-is almost entirely determined by the number $f_k$ of classes that do appear in the training data the same number of times. While in theory we show that the difference of the induced estimator decays exponentially in the size of the sample, in practice the high variance prevents us from using it directly for an estimator of the sample coverage. However, our precise characterization of the dependency between $f_k$'s induces a large search space of different representations of the expected value, which can be deterministically instantiated as estimators. Hence, we turn to optimization and develop a genetic algorithm that, given only the sample, searches for an estimator with minimal mean-squared error (MSE). In our experiments, our genetic algorithm discovers estimators that have a substantially smalle
&lt;/p&gt;</description></item></channel></rss>