<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;&#34892;&#21015;&#24335;&#25277;&#26679;&#36827;&#34892;&#20449;&#21495;&#37325;&#24314;&#30340;&#26041;&#27861;&#65292;&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#38543;&#26426;&#33410;&#28857;&#35780;&#20272;&#20013;&#36817;&#20284;&#34920;&#31034;&#26041;&#21487;&#31215;&#20989;&#25968;&#65292;&#23454;&#29616;&#20102;&#24555;&#36895;&#25910;&#25947;&#21644;&#26356;&#39640;&#30340;&#36866;&#24212;&#24615;&#27491;&#21017;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.09437</link><description>&lt;p&gt;
&#20351;&#29992;&#34892;&#21015;&#24335;&#25277;&#26679;&#36827;&#34892;&#20449;&#21495;&#37325;&#24314;
&lt;/p&gt;
&lt;p&gt;
Signal reconstruction using determinantal sampling. (arXiv:2310.09437v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20351;&#29992;&#34892;&#21015;&#24335;&#25277;&#26679;&#36827;&#34892;&#20449;&#21495;&#37325;&#24314;&#30340;&#26041;&#27861;&#65292;&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#38543;&#26426;&#33410;&#28857;&#35780;&#20272;&#20013;&#36817;&#20284;&#34920;&#31034;&#26041;&#21487;&#31215;&#20989;&#25968;&#65292;&#23454;&#29616;&#20102;&#24555;&#36895;&#25910;&#25947;&#21644;&#26356;&#39640;&#30340;&#36866;&#24212;&#24615;&#27491;&#21017;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20174;&#38543;&#26426;&#33410;&#28857;&#30340;&#26377;&#38480;&#25968;&#37327;&#35780;&#20272;&#20013;&#36817;&#20284;&#34920;&#31034;&#19968;&#20010;&#26041;&#21487;&#31215;&#20989;&#25968;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#38543;&#26426;&#33410;&#28857;&#30340;&#36873;&#25321;&#20381;&#25454;&#26159;&#19968;&#20010;&#31934;&#24515;&#36873;&#25321;&#30340;&#20998;&#24067;&#12290;&#24403;&#20989;&#25968;&#34987;&#20551;&#35774;&#23646;&#20110;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65288;RKHS&#65289;&#26102;&#65292;&#36825;&#23588;&#20026;&#30456;&#20851;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23558;&#22522;&#20110;&#20004;&#31181;&#21487;&#33021;&#30340;&#33410;&#28857;&#27010;&#29575;&#20998;&#24067;&#30340;&#20960;&#20010;&#33258;&#28982;&#26377;&#38480;&#32500;&#36924;&#36817;&#26041;&#27861;&#30456;&#32467;&#21512;&#12290;&#36825;&#20123;&#27010;&#29575;&#20998;&#24067;&#19982;&#34892;&#21015;&#24335;&#28857;&#36807;&#31243;&#30456;&#20851;&#65292;&#24182;&#21033;&#29992;RKHS&#30340;&#26680;&#20989;&#25968;&#26469;&#20248;&#21270;&#22312;&#38543;&#26426;&#35774;&#35745;&#20013;&#30340;RKHS&#36866;&#24212;&#24615;&#27491;&#21017;&#24615;&#12290;&#34429;&#28982;&#20808;&#21069;&#30340;&#34892;&#21015;&#24335;&#25277;&#26679;&#24037;&#20316;&#20381;&#36182;&#20110;RKHS&#33539;&#25968;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;$L^2$&#33539;&#25968;&#19979;&#30340;&#22343;&#26041;&#20445;&#35777;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#34892;&#21015;&#24335;&#28857;&#36807;&#31243;&#21450;&#20854;&#28151;&#21512;&#20307;&#21487;&#20197;&#20135;&#29983;&#24555;&#36895;&#25910;&#25947;&#36895;&#24230;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#36824;&#25581;&#31034;&#20102;&#24403;&#20551;&#35774;&#26356;&#22810;&#30340;&#24179;&#28369;&#24615;&#26102;&#25910;&#25947;&#36895;&#24230;&#22914;&#20309;&#21464;&#21270;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#36229;&#25910;&#25947;&#12290;&#27492;&#22806;&#65292;&#34892;&#21015;&#24335;&#25277;&#26679;&#25512;&#24191;&#20102;&#20174;Christoffel&#20989;&#25968;&#36827;&#34892;i.i.d.&#25277;&#26679;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the approximation of a square-integrable function from a finite number of evaluations on a random set of nodes according to a well-chosen distribution. This is particularly relevant when the function is assumed to belong to a reproducing kernel Hilbert space (RKHS). This work proposes to combine several natural finite-dimensional approximations based two possible probability distributions of nodes. These distributions are related to determinantal point processes, and use the kernel of the RKHS to favor RKHS-adapted regularity in the random design. While previous work on determinantal sampling relied on the RKHS norm, we prove mean-square guarantees in $L^2$ norm. We show that determinantal point processes and mixtures thereof can yield fast convergence rates. Our results also shed light on how the rate changes as more smoothness is assumed, a phenomenon known as superconvergence. Besides, determinantal sampling generalizes i.i.d. sampling from the Christoffel function which is
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22359;&#22352;&#26631;&#19979;&#38477;&#26041;&#27861;OBCD&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#27491;&#20132;&#32422;&#26463;&#30340;&#19968;&#33324;&#38750;&#20809;&#28369;&#32452;&#21512;&#38382;&#39064;&#12290; OBCD&#26159;&#19968;&#31181;&#21487;&#34892;&#30340;&#26041;&#27861;&#65292;&#20855;&#26377;&#20302;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#65292;&#24182;&#19988;&#33719;&#24471;&#20005;&#26684;&#30340;&#25910;&#25947;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2304.03641</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#27491;&#20132;&#32422;&#26463;&#19979;&#30340;&#38750;&#20809;&#28369;&#32452;&#21512;&#20248;&#21270;&#30340;&#22359;&#22352;&#26631;&#19979;&#38477;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Block Coordinate Descent Method for Nonsmooth Composite Optimization under Orthogonality Constraints. (arXiv:2304.03641v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03641
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22359;&#22352;&#26631;&#19979;&#38477;&#26041;&#27861;OBCD&#65292;&#29992;&#20110;&#35299;&#20915;&#20855;&#26377;&#27491;&#20132;&#32422;&#26463;&#30340;&#19968;&#33324;&#38750;&#20809;&#28369;&#32452;&#21512;&#38382;&#39064;&#12290; OBCD&#26159;&#19968;&#31181;&#21487;&#34892;&#30340;&#26041;&#27861;&#65292;&#20855;&#26377;&#20302;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#65292;&#24182;&#19988;&#33719;&#24471;&#20005;&#26684;&#30340;&#25910;&#25947;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#27491;&#20132;&#32422;&#26463;&#30340;&#38750;&#20809;&#28369;&#32452;&#21512;&#20248;&#21270;&#22312;&#32479;&#35745;&#23398;&#20064;&#21644;&#25968;&#25454;&#31185;&#23398;&#20013;&#26377;&#24191;&#27867;&#30340;&#24212;&#29992;&#12290;&#30001;&#20110;&#20854;&#38750;&#20984;&#24615;&#21644;&#38750;&#20809;&#28369;&#24615;&#36136;&#65292;&#35813;&#38382;&#39064;&#36890;&#24120;&#24456;&#38590;&#27714;&#35299;&#12290;&#29616;&#26377;&#30340;&#35299;&#20915;&#26041;&#26696;&#21463;&#21040;&#20197;&#19979;&#19968;&#20010;&#25110;&#22810;&#20010;&#38480;&#21046;&#30340;&#38480;&#21046;&#65306;&#65288;i&#65289;&#23427;&#20204;&#26159;&#38656;&#35201;&#27599;&#27425;&#36845;&#20195;&#39640;&#35745;&#31639;&#25104;&#26412;&#30340;&#20840;&#26799;&#24230;&#26041;&#27861;&#65307;&#65288;ii&#65289;&#23427;&#20204;&#26080;&#27861;&#35299;&#20915;&#19968;&#33324;&#30340;&#38750;&#20809;&#28369;&#32452;&#21512;&#38382;&#39064;&#65307;&#65288;iii&#65289;&#23427;&#20204;&#26159;&#19981;&#21487;&#34892;&#26041;&#27861;&#65292;&#24182;&#19988;&#21482;&#33021;&#22312;&#26497;&#38480;&#28857;&#22788;&#23454;&#29616;&#35299;&#30340;&#21487;&#34892;&#24615;&#65307;&#65288;iv&#65289;&#23427;&#20204;&#32570;&#20047;&#20005;&#26684;&#30340;&#25910;&#25947;&#20445;&#35777;&#65307;&#65288;v&#65289;&#23427;&#20204;&#21482;&#33021;&#33719;&#24471;&#20851;&#38190;&#28857;&#30340;&#24369;&#26368;&#20248;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22359;&#22352;&#26631;&#19979;&#38477;&#26041;&#27861;OBCD&#65292;&#29992;&#20110;&#35299;&#20915;&#27491;&#20132;&#32422;&#26463;&#19979;&#30340;&#19968;&#33324;&#38750;&#20809;&#28369;&#32452;&#21512;&#38382;&#39064;&#12290;OBCD&#26159;&#19968;&#31181;&#21487;&#34892;&#30340;&#26041;&#27861;&#65292;&#20855;&#26377;&#20302;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#12290;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#20250;&#26356;&#26032;...
&lt;/p&gt;
&lt;p&gt;
Nonsmooth composite optimization with orthogonality constraints has a broad spectrum of applications in statistical learning and data science. However, this problem is generally challenging to solve due to its non-convex and non-smooth nature. Existing solutions are limited by one or more of the following restrictions: (i) they are full gradient methods that require high computational costs in each iteration; (ii) they are not capable of solving general nonsmooth composite problems; (iii) they are infeasible methods and can only achieve the feasibility of the solution at the limit point; (iv) they lack rigorous convergence guarantees; (v) they only obtain weak optimality of critical points. In this paper, we propose \textit{\textbf{OBCD}}, a new Block Coordinate Descent method for solving general nonsmooth composite problems under Orthogonality constraints. \textit{\textbf{OBCD}} is a feasible method with low computation complexity footprints. In each iteration, our algorithm updates $
&lt;/p&gt;</description></item></channel></rss>