<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#31070;&#32463;&#31639;&#23376;&#30340;&#21512;&#25104;&#25968;&#25454;&#30340;&#26032;&#26041;&#27861;&#65292;&#20026;&#35757;&#32451;&#32593;&#32476;&#25552;&#20379;&#19981;&#38656;&#35201;&#25968;&#20540;&#27714;&#35299;PDE&#30340;&#25968;&#25454;&#12290;</title><link>http://arxiv.org/abs/2401.02398</link><description>&lt;p&gt;
&#29983;&#25104;&#31070;&#32463;&#31639;&#23376;&#30340;&#21512;&#25104;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Generating synthetic data for neural operators. (arXiv:2401.02398v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.02398
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#31070;&#32463;&#31639;&#23376;&#30340;&#21512;&#25104;&#25968;&#25454;&#30340;&#26032;&#26041;&#27861;&#65292;&#20026;&#35757;&#32451;&#32593;&#32476;&#25552;&#20379;&#19981;&#38656;&#35201;&#25968;&#20540;&#27714;&#35299;PDE&#30340;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#26399;&#25991;&#29486;&#20013;&#30340;&#35768;&#22810;&#21457;&#23637;&#23637;&#31034;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#33719;&#21462;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDEs&#65289;&#30340;&#25968;&#20540;&#35299;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36825;&#36229;&#20986;&#20102;&#24403;&#21069;&#25968;&#20540;&#27714;&#35299;&#22120;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#25968;&#25454;&#39537;&#21160;&#30340;&#31070;&#32463;&#31639;&#23376;&#37117;&#23384;&#22312;&#21516;&#26679;&#30340;&#38382;&#39064;&#65306;&#35757;&#32451;&#32593;&#32476;&#25152;&#38656;&#30340;&#25968;&#25454;&#20381;&#36182;&#20110;&#20256;&#32479;&#30340;&#25968;&#20540;&#27714;&#35299;&#22120;&#65292;&#22914;&#26377;&#38480;&#24046;&#20998;&#25110;&#26377;&#38480;&#20803;&#31561;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#29983;&#25104;&#21512;&#25104;&#30340;&#20989;&#25968;&#35757;&#32451;&#25968;&#25454;&#65292;&#32780;&#26080;&#38656;&#25968;&#20540;&#27714;&#35299;PDE&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#24456;&#31616;&#21333;&#65306;&#25105;&#20204;&#20174;&#24050;&#30693;&#35299;&#20301;&#20110;&#30340;&#32463;&#20856;&#29702;&#35770;&#35299;&#31354;&#38388;&#65288;&#20363;&#22914;$H_0^1(\Omega)$&#65289;&#20013;&#25277;&#21462;&#22823;&#37327;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#8220;&#38543;&#26426;&#20989;&#25968;&#8221;$u_j$&#65292;&#28982;&#21518;&#23558;&#27599;&#20010;&#38543;&#26426;&#35299;&#26041;&#26696;&#20195;&#20837;&#26041;&#31243;&#24182;&#33719;&#24471;&#30456;&#24212;&#30340;&#21491;&#20391;&#20989;&#25968;$f_j$&#65292;&#23558;$(f_j, u_j)_{j=1}^N$&#20316;&#20026;&#30417;&#30563;&#35757;&#32451;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Numerous developments in the recent literature show the promising potential of deep learning in obtaining numerical solutions to partial differential equations (PDEs) beyond the reach of current numerical solvers. However, data-driven neural operators all suffer from the same problem: the data needed to train a network depends on classical numerical solvers such as finite difference or finite element, among others. In this paper, we propose a new approach to generating synthetic functional training data that does not require solving a PDE numerically. The way we do this is simple: we draw a large number $N$ of independent and identically distributed `random functions' $u_j$ from the underlying solution space (e.g., $H_0^1(\Omega)$) in which we know the solution lies according to classical theory. We then plug each such random candidate solution into the equation and get a corresponding right-hand side function $f_j$ for the equation, and consider $(f_j, u_j)_{j=1}^N$ as supervised trai
&lt;/p&gt;</description></item></channel></rss>