<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#65292;&#31216;&#20026;D-GRW&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#33258;&#36866;&#24212;&#32447;&#24615;&#21270;&#26041;&#26696;&#12289;&#31070;&#32463;&#32593;&#32476;&#21644;&#20840;&#23616;&#38543;&#26426;&#28216;&#36208;&#65292;&#22312;&#26377;&#38480;&#20307;&#31215;&#31163;&#25955;&#21270;&#26694;&#26550;&#19979;&#65292;&#33021;&#22815;&#20135;&#29983;&#20855;&#26377;&#25910;&#25947;&#24615;&#20445;&#35777;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#65292;&#24182;&#22312;&#31934;&#24230;&#21644;&#36136;&#37327;&#23432;&#24658;&#24615;&#33021;&#26041;&#38754;&#34920;&#29616;&#21331;&#36234;&#12290;</title><link>http://arxiv.org/abs/2310.02806</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#65292;&#29992;&#20110;&#27169;&#25311;&#22303;&#22756;&#20013;&#30340;&#27700;&#27969;&#21160;&#21147;&#23398;
&lt;/p&gt;
&lt;p&gt;
A Data-facilitated Numerical Method for Richards Equation to Model Water Flow Dynamics in Soil. (arXiv:2310.02806v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#65292;&#31216;&#20026;D-GRW&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#33258;&#36866;&#24212;&#32447;&#24615;&#21270;&#26041;&#26696;&#12289;&#31070;&#32463;&#32593;&#32476;&#21644;&#20840;&#23616;&#38543;&#26426;&#28216;&#36208;&#65292;&#22312;&#26377;&#38480;&#20307;&#31215;&#31163;&#25955;&#21270;&#26694;&#26550;&#19979;&#65292;&#33021;&#22815;&#20135;&#29983;&#20855;&#26377;&#25910;&#25947;&#24615;&#20445;&#35777;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#65292;&#24182;&#22312;&#31934;&#24230;&#21644;&#36136;&#37327;&#23432;&#24658;&#24615;&#33021;&#26041;&#38754;&#34920;&#29616;&#21331;&#36234;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26681;&#21306;&#22303;&#22756;&#28287;&#24230;&#30340;&#30417;&#27979;&#23545;&#20110;&#31934;&#23494;&#20892;&#19994;&#12289;&#26234;&#33021;&#28748;&#28297;&#21644;&#24178;&#26097;&#39044;&#38450;&#33267;&#20851;&#37325;&#35201;&#12290;&#36890;&#24120;&#36890;&#36807;&#27714;&#35299;Richards&#26041;&#31243;&#36825;&#26679;&#30340;&#27700;&#25991;&#27169;&#22411;&#26469;&#27169;&#25311;&#22303;&#22756;&#30340;&#26102;&#31354;&#27700;&#27969;&#21160;&#21147;&#23398;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#12290;&#36825;&#31181;&#25968;&#20540;&#35299;&#27861;&#34987;&#31216;&#20026;D-GRW&#65288;Data-facilitated global Random Walk&#65289;&#26041;&#27861;&#65292;&#23427;&#22312;&#26377;&#38480;&#20307;&#31215;&#31163;&#25955;&#21270;&#26694;&#26550;&#20013;&#21327;&#21516;&#22320;&#25972;&#21512;&#20102;&#33258;&#36866;&#24212;&#32447;&#24615;&#21270;&#26041;&#26696;&#12289;&#31070;&#32463;&#32593;&#32476;&#21644;&#20840;&#23616;&#38543;&#26426;&#28216;&#36208;&#65292;&#21487;&#20197;&#22312;&#21512;&#29702;&#30340;&#20551;&#35774;&#19979;&#20135;&#29983;&#31934;&#30830;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#65292;&#24182;&#19988;&#20855;&#26377;&#25910;&#25947;&#24615;&#20445;&#35777;&#12290;&#36890;&#36807;&#19977;&#20010;&#31034;&#20363;&#65292;&#25105;&#20204;&#23637;&#31034;&#21644;&#35752;&#35770;&#20102;&#25105;&#20204;&#30340;D-GRW&#26041;&#27861;&#22312;&#31934;&#24230;&#21644;&#36136;&#37327;&#23432;&#24658;&#24615;&#33021;&#26041;&#38754;&#30340;&#21331;&#36234;&#34920;&#29616;&#65292;&#24182;&#23558;&#20854;&#19982;&#22522;&#20934;&#25968;&#20540;&#35299;&#27861;&#21644;&#21830;&#29992;&#36719;&#20214;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Root-zone soil moisture monitoring is essential for precision agriculture, smart irrigation, and drought prevention. Modeling the spatiotemporal water flow dynamics in soil is typically achieved by solving a hydrological model, such as the Richards equation which is a highly nonlinear partial differential equation (PDE). In this paper, we present a novel data-facilitated numerical method for solving the mixed-form Richards equation. This numerical method, which we call the D-GRW (Data-facilitated global Random Walk) method, synergistically integrates adaptive linearization scheme, neural networks, and global random walk in a finite volume discretization framework to produce accurate numerical solutions of the Richards equation with guaranteed convergence under reasonable assumptions. Through three illustrative examples, we demonstrate and discuss the superior accuracy and mass conservation performance of our D-GRW method and compare it with benchmark numerical methods and commercial so
&lt;/p&gt;</description></item></channel></rss>