<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#26032;&#30340;&#32039;&#20945;&#34920;&#31034;&#26041;&#27861;&#65292;&#22312;&#22823;&#22411;&#30830;&#23450;&#24615;&#38382;&#39064;&#30340;&#36719;&#20214;&#23454;&#29616;&#20013;&#34920;&#29616;&#33391;&#22909;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22823;&#22411;&#29305;&#24449;&#20540;&#35745;&#31639;&#12289;&#24352;&#37327;&#20998;&#35299;&#21644;&#38750;&#32447;&#24615;&#22238;&#24402;&#12290;</title><link>https://arxiv.org/abs/2403.12206</link><description>&lt;p&gt;
&#29992;&#20110;&#25968;&#25454;&#25311;&#21512;&#30340;&#23454;&#29992;&#32039;&#20945;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Useful Compact Representations for Data-Fitting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12206
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#26032;&#30340;&#32039;&#20945;&#34920;&#31034;&#26041;&#27861;&#65292;&#22312;&#22823;&#22411;&#30830;&#23450;&#24615;&#38382;&#39064;&#30340;&#36719;&#20214;&#23454;&#29616;&#20013;&#34920;&#29616;&#33391;&#22909;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22823;&#22411;&#29305;&#24449;&#20540;&#35745;&#31639;&#12289;&#24352;&#37327;&#20998;&#35299;&#21644;&#38750;&#32447;&#24615;&#22238;&#24402;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27809;&#26377;2&#38454;&#23548;&#25968;&#20449;&#24687;&#30340;&#26368;&#23567;&#21270;&#38382;&#39064;&#20013;&#65292;&#20272;&#35745;Hessian&#30697;&#38453;&#30340;&#26041;&#27861;&#38750;&#24120;&#26377;&#25928;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#25216;&#26415;&#29983;&#25104;&#30340;&#31264;&#23494;&#30697;&#38453;&#23545;&#20110;&#22823;&#22411;&#38382;&#39064;&#26159;&#38590;&#20197;&#25215;&#21463;&#30340;&#12290;&#26377;&#38480;&#20869;&#23384;&#32039;&#20945;&#34920;&#31034;&#23558;&#31264;&#23494;&#25968;&#32452;&#34920;&#31034;&#20026;&#20302;&#31209;&#34920;&#31034;&#65292;&#24050;&#25104;&#20026;&#22823;&#22411;&#30830;&#23450;&#24615;&#38382;&#39064;&#36719;&#20214;&#23454;&#29616;&#30340;&#26368;&#26032;&#25216;&#26415;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#30001;&#21521;&#37327;&#36873;&#25321;&#21442;&#25968;&#21270;&#30340;&#26032;&#32039;&#20945;&#34920;&#31034;&#65292;&#24182;&#19988;&#23545;&#20110;&#29305;&#23450;&#36873;&#25321;&#65292;&#23427;&#20204;&#21487;&#20197;&#31616;&#21270;&#20026;&#29616;&#26377;&#30340;&#33879;&#21517;&#20844;&#24335;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#32039;&#20945;&#34920;&#31034;&#22312;&#22823;&#22411;&#29305;&#24449;&#20540;&#35745;&#31639;&#12289;&#24352;&#37327;&#20998;&#35299;&#21644;&#38750;&#32447;&#24615;&#22238;&#24402;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12206v1 Announce Type: cross  Abstract: For minimization problems without 2nd derivative information, methods that estimate Hessian matrices can be very effective. However, conventional techniques generate dense matrices that are prohibitive for large problems. Limited-memory compact representations express the dense arrays in terms of a low rank representation and have become the state-of-the-art for software implementations on large deterministic problems. We develop new compact representations that are parameterized by a choice of vectors and that reduce to existing well known formulas for special choices. We demonstrate effectiveness of the compact representations for large eigenvalue computations, tensor factorizations and nonlinear regressions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20351;&#29992;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#31215;&#20998;&#26469;&#25552;&#39640;&#20613;&#37324;&#21494;&#26041;&#27861;&#22312;&#39640;&#32500;&#24773;&#22659;&#19979;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#20197;&#35299;&#20915;&#39640;&#25928;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.02832</link><description>&lt;p&gt;
&#39640;&#25928;&#20613;&#37324;&#21494;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#25311;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Quasi-Monte Carlo for Efficient Fourier Pricing of Multi-Asset Options
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02832
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20351;&#29992;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#31215;&#20998;&#26469;&#25552;&#39640;&#20613;&#37324;&#21494;&#26041;&#27861;&#22312;&#39640;&#32500;&#24773;&#22659;&#19979;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#20197;&#35299;&#20915;&#39640;&#25928;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23450;&#37327;&#37329;&#34701;&#20013;&#65292;&#39640;&#25928;&#23450;&#20215;&#22810;&#36164;&#20135;&#26399;&#26435;&#26159;&#19968;&#20010;&#37325;&#35201;&#25361;&#25112;&#12290;&#33945;&#29305;&#21345;&#27931;&#65288;MC&#65289;&#26041;&#27861;&#20173;&#28982;&#26159;&#23450;&#20215;&#24341;&#25806;&#30340;&#20027;&#35201;&#36873;&#25321;&#65307;&#28982;&#32780;&#65292;&#20854;&#25910;&#25947;&#36895;&#24230;&#24930;&#38459;&#30861;&#20102;&#20854;&#23454;&#38469;&#24212;&#29992;&#12290;&#20613;&#37324;&#21494;&#26041;&#27861;&#21033;&#29992;&#29305;&#24449;&#20989;&#25968;&#30340;&#30693;&#35782;&#65292;&#20934;&#30830;&#24555;&#36895;&#22320;&#20272;&#20540;&#22810;&#36798;&#20004;&#20010;&#36164;&#20135;&#30340;&#26399;&#26435;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#35774;&#32622;&#20013;&#65292;&#30001;&#20110;&#24120;&#29992;&#30340;&#31215;&#20998;&#25216;&#26415;&#20855;&#26377;&#24352;&#37327;&#31215;&#65288;TP&#65289;&#32467;&#26500;&#65292;&#23427;&#20204;&#38754;&#20020;&#38556;&#30861;&#12290;&#26412;&#25991;&#20027;&#24352;&#20351;&#29992;&#38543;&#26426;&#21270;&#25311;&#33945;&#29305;&#21345;&#27931;&#65288;RQMC&#65289;&#31215;&#20998;&#26469;&#25913;&#21892;&#39640;&#32500;&#20613;&#37324;&#21494;&#26041;&#27861;&#30340;&#21487;&#25193;&#23637;&#24615;&#12290;RQMC&#25216;&#26415;&#21463;&#30410;&#20110;&#34987;&#31215;&#20989;&#25968;&#30340;&#20809;&#28369;&#24615;&#65292;&#32531;&#35299;&#20102;&#32500;&#24230;&#28798;&#38590;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#23454;&#29992;&#30340;&#35823;&#24046;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;RQMC&#22312;&#26080;&#30028;&#22495;$\mathbb{R}^d$&#19978;&#30340;&#36866;&#29992;&#24615;&#38656;&#35201;&#23558;&#22495;&#36716;&#25442;&#20026;$[0,1]^d$&#65292;&#36825;&#21487;&#33021;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02832v1 Announce Type: new  Abstract: Efficiently pricing multi-asset options poses a significant challenge in quantitative finance. The Monte Carlo (MC) method remains the prevalent choice for pricing engines; however, its slow convergence rate impedes its practical application. Fourier methods leverage the knowledge of the characteristic function to accurately and rapidly value options with up to two assets. Nevertheless, they face hurdles in the high-dimensional settings due to the tensor product (TP) structure of commonly employed quadrature techniques. This work advocates using the randomized quasi-MC (RQMC) quadrature to improve the scalability of Fourier methods with high dimensions. The RQMC technique benefits from the smoothness of the integrand and alleviates the curse of dimensionality while providing practical error estimates. Nonetheless, the applicability of RQMC on the unbounded domain, $\mathbb{R}^d$, requires a domain transformation to $[0,1]^d$, which may r
&lt;/p&gt;</description></item></channel></rss>