<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#19977;&#31181;&#26041;&#24335;&#23558;&#23545;&#31216;&#24615;&#34701;&#20837;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65306;1. &#24378;&#21046;&#24050;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;2. &#21457;&#29616;&#26410;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;3. &#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#20419;&#36827;&#23545;&#31216;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.00212</link><description>&lt;p&gt;
&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#24378;&#21046;&#12289;&#21457;&#29616;&#21644;&#25512;&#21160;&#23545;&#31216;&#24615;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Unified Framework to Enforce, Discover, and Promote Symmetry in Machine Learning. (arXiv:2311.00212v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00212
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#19977;&#31181;&#26041;&#24335;&#23558;&#23545;&#31216;&#24615;&#34701;&#20837;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65306;1. &#24378;&#21046;&#24050;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;2. &#21457;&#29616;&#26410;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;3. &#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#20419;&#36827;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#31216;&#24615;&#23384;&#22312;&#20110;&#33258;&#28982;&#30028;&#20013;&#65292;&#24182;&#22312;&#29289;&#29702;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#20013;&#25198;&#28436;&#30528;&#36234;&#26469;&#36234;&#26680;&#24515;&#30340;&#35282;&#33394;&#12290;&#22522;&#26412;&#23545;&#31216;&#24615;&#65292;&#22914;&#24222;&#21152;&#33713;&#19981;&#21464;&#24615;&#65292;&#20351;&#22312;&#22320;&#29699;&#19978;&#23454;&#39564;&#23460;&#20013;&#21457;&#29616;&#30340;&#29289;&#29702;&#23450;&#24459;&#33021;&#22815;&#25512;&#24191;&#21040;&#23431;&#23449;&#30340;&#26368;&#36828;&#22788;&#12290;&#23545;&#31216;&#24615;&#23545;&#20110;&#22312;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#23454;&#29616;&#36825;&#31181;&#25512;&#24191;&#33021;&#21147;&#33267;&#20851;&#37325;&#35201;&#12290;&#20363;&#22914;&#65292;&#22312;&#22270;&#20687;&#20998;&#31867;&#20013;&#30340;&#24179;&#31227;&#19981;&#21464;&#24615;&#20801;&#35768;&#20351;&#29992;&#21442;&#25968;&#26356;&#23569;&#30340;&#27169;&#22411;&#65288;&#22914;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65289;&#22312;&#36739;&#23567;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#35757;&#32451;&#65292;&#24182;&#36798;&#21040;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#21644;&#26041;&#27861;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#20197;&#19977;&#31181;&#26041;&#24335;&#34701;&#20837;&#23545;&#31216;&#24615;&#65306;1. &#22312;&#35757;&#32451;&#27169;&#22411;&#26102;&#24378;&#21046;&#24050;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;2. &#21457;&#29616;&#32473;&#23450;&#27169;&#22411;&#25110;&#25968;&#25454;&#38598;&#30340;&#26410;&#30693;&#23545;&#31216;&#24615;&#65307;3. &#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#36890;&#36807;&#23398;&#20064;&#25171;&#30772;&#29992;&#25143;&#25351;&#23450;&#30340;&#20505;&#36873;&#32676;&#20307;&#20869;&#30340;&#23545;&#31216;&#24615;&#26469;&#20419;&#36827;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Symmetry is present throughout nature and continues to play an increasingly central role in physics and machine learning. Fundamental symmetries, such as Poincar\'{e} invariance, allow physical laws discovered in laboratories on Earth to be extrapolated to the farthest reaches of the universe. Symmetry is essential to achieving this extrapolatory power in machine learning applications. For example, translation invariance in image classification allows models with fewer parameters, such as convolutional neural networks, to be trained on smaller data sets and achieve state-of-the-art performance. In this paper, we provide a unifying theoretical and methodological framework for incorporating symmetry into machine learning models in three ways: 1. enforcing known symmetry when training a model; 2. discovering unknown symmetries of a given model or data set; and 3. promoting symmetry during training by learning a model that breaks symmetries within a user-specified group of candidates when 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#65292;&#31216;&#20026;D-GRW&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#33258;&#36866;&#24212;&#32447;&#24615;&#21270;&#26041;&#26696;&#12289;&#31070;&#32463;&#32593;&#32476;&#21644;&#20840;&#23616;&#38543;&#26426;&#28216;&#36208;&#65292;&#22312;&#26377;&#38480;&#20307;&#31215;&#31163;&#25955;&#21270;&#26694;&#26550;&#19979;&#65292;&#33021;&#22815;&#20135;&#29983;&#20855;&#26377;&#25910;&#25947;&#24615;&#20445;&#35777;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#65292;&#24182;&#22312;&#31934;&#24230;&#21644;&#36136;&#37327;&#23432;&#24658;&#24615;&#33021;&#26041;&#38754;&#34920;&#29616;&#21331;&#36234;&#12290;</title><link>http://arxiv.org/abs/2310.02806</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#65292;&#29992;&#20110;&#27169;&#25311;&#22303;&#22756;&#20013;&#30340;&#27700;&#27969;&#21160;&#21147;&#23398;
&lt;/p&gt;
&lt;p&gt;
A Data-facilitated Numerical Method for Richards Equation to Model Water Flow Dynamics in Soil. (arXiv:2310.02806v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#65292;&#31216;&#20026;D-GRW&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#33258;&#36866;&#24212;&#32447;&#24615;&#21270;&#26041;&#26696;&#12289;&#31070;&#32463;&#32593;&#32476;&#21644;&#20840;&#23616;&#38543;&#26426;&#28216;&#36208;&#65292;&#22312;&#26377;&#38480;&#20307;&#31215;&#31163;&#25955;&#21270;&#26694;&#26550;&#19979;&#65292;&#33021;&#22815;&#20135;&#29983;&#20855;&#26377;&#25910;&#25947;&#24615;&#20445;&#35777;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#65292;&#24182;&#22312;&#31934;&#24230;&#21644;&#36136;&#37327;&#23432;&#24658;&#24615;&#33021;&#26041;&#38754;&#34920;&#29616;&#21331;&#36234;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26681;&#21306;&#22303;&#22756;&#28287;&#24230;&#30340;&#30417;&#27979;&#23545;&#20110;&#31934;&#23494;&#20892;&#19994;&#12289;&#26234;&#33021;&#28748;&#28297;&#21644;&#24178;&#26097;&#39044;&#38450;&#33267;&#20851;&#37325;&#35201;&#12290;&#36890;&#24120;&#36890;&#36807;&#27714;&#35299;Richards&#26041;&#31243;&#36825;&#26679;&#30340;&#27700;&#25991;&#27169;&#22411;&#26469;&#27169;&#25311;&#22303;&#22756;&#30340;&#26102;&#31354;&#27700;&#27969;&#21160;&#21147;&#23398;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#22522;&#20110;&#25968;&#25454;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#27861;&#12290;&#36825;&#31181;&#25968;&#20540;&#35299;&#27861;&#34987;&#31216;&#20026;D-GRW&#65288;Data-facilitated global Random Walk&#65289;&#26041;&#27861;&#65292;&#23427;&#22312;&#26377;&#38480;&#20307;&#31215;&#31163;&#25955;&#21270;&#26694;&#26550;&#20013;&#21327;&#21516;&#22320;&#25972;&#21512;&#20102;&#33258;&#36866;&#24212;&#32447;&#24615;&#21270;&#26041;&#26696;&#12289;&#31070;&#32463;&#32593;&#32476;&#21644;&#20840;&#23616;&#38543;&#26426;&#28216;&#36208;&#65292;&#21487;&#20197;&#22312;&#21512;&#29702;&#30340;&#20551;&#35774;&#19979;&#20135;&#29983;&#31934;&#30830;&#30340;Richards&#26041;&#31243;&#25968;&#20540;&#35299;&#65292;&#24182;&#19988;&#20855;&#26377;&#25910;&#25947;&#24615;&#20445;&#35777;&#12290;&#36890;&#36807;&#19977;&#20010;&#31034;&#20363;&#65292;&#25105;&#20204;&#23637;&#31034;&#21644;&#35752;&#35770;&#20102;&#25105;&#20204;&#30340;D-GRW&#26041;&#27861;&#22312;&#31934;&#24230;&#21644;&#36136;&#37327;&#23432;&#24658;&#24615;&#33021;&#26041;&#38754;&#30340;&#21331;&#36234;&#34920;&#29616;&#65292;&#24182;&#23558;&#20854;&#19982;&#22522;&#20934;&#25968;&#20540;&#35299;&#27861;&#21644;&#21830;&#29992;&#36719;&#20214;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Root-zone soil moisture monitoring is essential for precision agriculture, smart irrigation, and drought prevention. Modeling the spatiotemporal water flow dynamics in soil is typically achieved by solving a hydrological model, such as the Richards equation which is a highly nonlinear partial differential equation (PDE). In this paper, we present a novel data-facilitated numerical method for solving the mixed-form Richards equation. This numerical method, which we call the D-GRW (Data-facilitated global Random Walk) method, synergistically integrates adaptive linearization scheme, neural networks, and global random walk in a finite volume discretization framework to produce accurate numerical solutions of the Richards equation with guaranteed convergence under reasonable assumptions. Through three illustrative examples, we demonstrate and discuss the superior accuracy and mass conservation performance of our D-GRW method and compare it with benchmark numerical methods and commercial so
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#21516;&#21270;&#31574;&#30053;&#65292;&#21487;&#21487;&#38752;&#22320;&#22788;&#29702;&#21253;&#21547;&#19981;&#30830;&#23450;&#24230;&#37327;&#21270;&#30340;&#23380;&#38553;&#23610;&#24230;&#21453;&#24212;&#21453;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#25968;&#25454;&#39537;&#21160;&#21644;&#29289;&#29702;&#24314;&#27169;&#65292;&#30830;&#20445;&#20102;&#23380;&#38553;&#23610;&#24230;&#27169;&#22411;&#30340;&#21487;&#38752;&#26657;&#20934;&#12290;</title><link>http://arxiv.org/abs/2308.12864</link><description>&lt;p&gt;
&#33258;&#21160;&#21152;&#26435;&#30340;&#36125;&#21494;&#26031;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#21644;&#40065;&#26834;&#20272;&#35745;&#22312;&#23380;&#38553;&#23610;&#24230;&#28342;&#35299;&#22270;&#20687;&#30340;&#22810;&#20219;&#21153;&#21453;&#38382;&#39064;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Auto-weighted Bayesian Physics-Informed Neural Networks and robust estimations for multitask inverse problems in pore-scale imaging of dissolution. (arXiv:2308.12864v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12864
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#21516;&#21270;&#31574;&#30053;&#65292;&#21487;&#21487;&#38752;&#22320;&#22788;&#29702;&#21253;&#21547;&#19981;&#30830;&#23450;&#24230;&#37327;&#21270;&#30340;&#23380;&#38553;&#23610;&#24230;&#21453;&#24212;&#21453;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#25968;&#25454;&#39537;&#21160;&#21644;&#29289;&#29702;&#24314;&#27169;&#65292;&#30830;&#20445;&#20102;&#23380;&#38553;&#23610;&#24230;&#27169;&#22411;&#30340;&#21487;&#38752;&#26657;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#25991;&#31456;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#21516;&#21270;&#31574;&#30053;&#65292;&#24182;&#23637;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#20351;&#25105;&#20204;&#33021;&#22815;&#21487;&#38752;&#22320;&#22788;&#29702;&#21253;&#21547;&#19981;&#30830;&#23450;&#24230;&#37327;&#21270;&#30340;&#21453;&#24212;&#21453;&#38382;&#39064;&#12290;&#23380;&#38553;&#23610;&#24230;&#30340;&#21453;&#24212;&#27969;&#21160;&#24314;&#27169;&#20026;&#30740;&#31350;&#23439;&#35266;&#24615;&#36136;&#22312;&#21160;&#24577;&#36807;&#31243;&#20013;&#30340;&#28436;&#21464;&#25552;&#20379;&#20102;&#23453;&#36149;&#30340;&#26426;&#20250;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#21463;&#21040;&#30456;&#20851;&#30340;X&#23556;&#32447;&#24494;&#35745;&#31639;&#39640;&#24230;&#20998;&#36776;&#29575;&#25104;&#20687; (X&#23556;&#32447;&#24494;CT) &#36807;&#31243;&#20013;&#30340;&#25104;&#20687;&#38480;&#21046;&#30340;&#24433;&#21709;&#65292;&#23548;&#33268;&#20102;&#24615;&#36136;&#20272;&#35745;&#20013;&#30340;&#24046;&#24322;&#12290;&#21160;&#21147;&#23398;&#21442;&#25968;&#30340;&#35780;&#20272;&#20063;&#38754;&#20020;&#25361;&#25112;&#65292;&#22240;&#20026;&#21453;&#24212;&#31995;&#25968;&#26159;&#20851;&#38190;&#21442;&#25968;&#65292;&#20854;&#25968;&#20540;&#33539;&#22260;&#24456;&#24191;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20004;&#20010;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#23558;&#19981;&#30830;&#23450;&#24230;&#37327;&#21270;&#38598;&#25104;&#21040;&#24037;&#20316;&#27969;&#31243;&#20013;&#65292;&#30830;&#20445;&#20102;&#23380;&#38553;&#23610;&#24230;&#27169;&#22411;&#30340;&#21487;&#38752;&#26657;&#20934;&#12290;&#24403;&#21069;&#30340;&#26041;&#27861;&#22522;&#20110;&#21453;&#24212;&#21453;&#38382;&#39064;&#30340;&#22810;&#20219;&#21153;&#20844;&#24335;&#65292;&#23558;&#25968;&#25454;&#39537;&#21160;&#21644;&#29289;&#29702;&#24314;&#27169;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this article, we present a novel data assimilation strategy in pore-scale imaging and demonstrate that this makes it possible to robustly address reactive inverse problems incorporating Uncertainty Quantification (UQ). Pore-scale modeling of reactive flow offers a valuable opportunity to investigate the evolution of macro-scale properties subject to dynamic processes. Yet, they suffer from imaging limitations arising from the associated X-ray microtomography (X-ray microCT) process, which induces discrepancies in the properties estimates. Assessment of the kinetic parameters also raises challenges, as reactive coefficients are critical parameters that can cover a wide range of values. We account for these two issues and ensure reliable calibration of pore-scale modeling, based on dynamical microCT images, by integrating uncertainty quantification in the workflow.  The present method is based on a multitasking formulation of reactive inverse problems combining data-driven and physics
&lt;/p&gt;</description></item></channel></rss>