<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#19977;&#31181;&#26041;&#24335;&#23558;&#23545;&#31216;&#24615;&#34701;&#20837;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65306;1. &#24378;&#21046;&#24050;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;2. &#21457;&#29616;&#26410;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;3. &#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#20419;&#36827;&#23545;&#31216;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.00212</link><description>&lt;p&gt;
&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#24378;&#21046;&#12289;&#21457;&#29616;&#21644;&#25512;&#21160;&#23545;&#31216;&#24615;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Unified Framework to Enforce, Discover, and Promote Symmetry in Machine Learning. (arXiv:2311.00212v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00212
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#19977;&#31181;&#26041;&#24335;&#23558;&#23545;&#31216;&#24615;&#34701;&#20837;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65306;1. &#24378;&#21046;&#24050;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;2. &#21457;&#29616;&#26410;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;3. &#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#20419;&#36827;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#31216;&#24615;&#23384;&#22312;&#20110;&#33258;&#28982;&#30028;&#20013;&#65292;&#24182;&#22312;&#29289;&#29702;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#20013;&#25198;&#28436;&#30528;&#36234;&#26469;&#36234;&#26680;&#24515;&#30340;&#35282;&#33394;&#12290;&#22522;&#26412;&#23545;&#31216;&#24615;&#65292;&#22914;&#24222;&#21152;&#33713;&#19981;&#21464;&#24615;&#65292;&#20351;&#22312;&#22320;&#29699;&#19978;&#23454;&#39564;&#23460;&#20013;&#21457;&#29616;&#30340;&#29289;&#29702;&#23450;&#24459;&#33021;&#22815;&#25512;&#24191;&#21040;&#23431;&#23449;&#30340;&#26368;&#36828;&#22788;&#12290;&#23545;&#31216;&#24615;&#23545;&#20110;&#22312;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#20013;&#23454;&#29616;&#36825;&#31181;&#25512;&#24191;&#33021;&#21147;&#33267;&#20851;&#37325;&#35201;&#12290;&#20363;&#22914;&#65292;&#22312;&#22270;&#20687;&#20998;&#31867;&#20013;&#30340;&#24179;&#31227;&#19981;&#21464;&#24615;&#20801;&#35768;&#20351;&#29992;&#21442;&#25968;&#26356;&#23569;&#30340;&#27169;&#22411;&#65288;&#22914;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65289;&#22312;&#36739;&#23567;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#35757;&#32451;&#65292;&#24182;&#36798;&#21040;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#21644;&#26041;&#27861;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#20013;&#20197;&#19977;&#31181;&#26041;&#24335;&#34701;&#20837;&#23545;&#31216;&#24615;&#65306;1. &#22312;&#35757;&#32451;&#27169;&#22411;&#26102;&#24378;&#21046;&#24050;&#30693;&#30340;&#23545;&#31216;&#24615;&#65307;2. &#21457;&#29616;&#32473;&#23450;&#27169;&#22411;&#25110;&#25968;&#25454;&#38598;&#30340;&#26410;&#30693;&#23545;&#31216;&#24615;&#65307;3. &#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#36890;&#36807;&#23398;&#20064;&#25171;&#30772;&#29992;&#25143;&#25351;&#23450;&#30340;&#20505;&#36873;&#32676;&#20307;&#20869;&#30340;&#23545;&#31216;&#24615;&#26469;&#20419;&#36827;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Symmetry is present throughout nature and continues to play an increasingly central role in physics and machine learning. Fundamental symmetries, such as Poincar\'{e} invariance, allow physical laws discovered in laboratories on Earth to be extrapolated to the farthest reaches of the universe. Symmetry is essential to achieving this extrapolatory power in machine learning applications. For example, translation invariance in image classification allows models with fewer parameters, such as convolutional neural networks, to be trained on smaller data sets and achieve state-of-the-art performance. In this paper, we provide a unifying theoretical and methodological framework for incorporating symmetry into machine learning models in three ways: 1. enforcing known symmetry when training a model; 2. discovering unknown symmetries of a given model or data set; and 3. promoting symmetry during training by learning a model that breaks symmetries within a user-specified group of candidates when 
&lt;/p&gt;</description></item></channel></rss>