<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#36951;&#20256;&#31639;&#27861;&#30340;&#26032;&#39062;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#26080;&#27861;&#35775;&#38382;&#27169;&#22411;&#26550;&#26500;&#21644;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#25805;&#32437;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411; (LLMs)&#12290;&#36890;&#36807;&#20248;&#21270;&#36890;&#29992;&#23545;&#25239;&#25552;&#31034;&#19982;&#29992;&#25143;&#26597;&#35810;&#32467;&#21512;&#65292;&#21487;&#20197;&#25200;&#20081;&#34987;&#25915;&#20987;&#27169;&#22411;&#30340;&#23545;&#40784;&#65292;&#23548;&#33268;&#24847;&#22806;&#21644;&#28508;&#22312;&#26377;&#23475;&#30340;&#36755;&#20986;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#25581;&#31034;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#21644;&#28431;&#27934;&#65292;&#20026;&#36127;&#36131;&#20219;&#30340;AI&#24320;&#21457;&#25552;&#20379;&#20102;&#19968;&#31181;&#35786;&#26029;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2309.01446</link><description>&lt;p&gt;
&#24320;&#38376;&#21543;&#65281;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#30340;&#36890;&#29992;&#40657;&#30418;&#30772;&#35299;
&lt;/p&gt;
&lt;p&gt;
Open Sesame! Universal Black Box Jailbreaking of Large Language Models. (arXiv:2309.01446v2 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.01446
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#36951;&#20256;&#31639;&#27861;&#30340;&#26032;&#39062;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#26080;&#27861;&#35775;&#38382;&#27169;&#22411;&#26550;&#26500;&#21644;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#25805;&#32437;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411; (LLMs)&#12290;&#36890;&#36807;&#20248;&#21270;&#36890;&#29992;&#23545;&#25239;&#25552;&#31034;&#19982;&#29992;&#25143;&#26597;&#35810;&#32467;&#21512;&#65292;&#21487;&#20197;&#25200;&#20081;&#34987;&#25915;&#20987;&#27169;&#22411;&#30340;&#23545;&#40784;&#65292;&#23548;&#33268;&#24847;&#22806;&#21644;&#28508;&#22312;&#26377;&#23475;&#30340;&#36755;&#20986;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#25581;&#31034;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#21644;&#28431;&#27934;&#65292;&#20026;&#36127;&#36131;&#20219;&#30340;AI&#24320;&#21457;&#25552;&#20379;&#20102;&#19968;&#31181;&#35786;&#26029;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#26088;&#22312;&#25552;&#20379;&#26377;&#24110;&#21161;&#21644;&#23433;&#20840;&#30340;&#22238;&#22797;&#65292;&#36890;&#24120;&#20381;&#36182;&#20110;&#23545;&#40784;&#25216;&#26415;&#19982;&#29992;&#25143;&#24847;&#22270;&#21644;&#31038;&#20250;&#25351;&#21335;&#20445;&#25345;&#19968;&#33268;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#23545;&#40784;&#21487;&#33021;&#20250;&#34987;&#24694;&#24847;&#34892;&#20026;&#32773;&#21033;&#29992;&#65292;&#20197;&#29992;&#20110;&#24847;&#24819;&#19981;&#21040;&#30340;&#30446;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#36951;&#20256;&#31639;&#27861;&#65288;GA&#65289;&#22312;&#27169;&#22411;&#26550;&#26500;&#21644;&#21442;&#25968;&#19981;&#21487;&#35775;&#38382;&#26102;&#25805;&#32437;LLMs&#12290;GA&#25915;&#20987;&#36890;&#36807;&#20248;&#21270;&#36890;&#29992;&#23545;&#25239;&#25552;&#31034;&#19982;&#29992;&#25143;&#26597;&#35810;&#32467;&#21512;&#65292;&#25200;&#20081;&#34987;&#25915;&#20987;&#27169;&#22411;&#30340;&#23545;&#40784;&#65292;&#23548;&#33268;&#24847;&#22806;&#21644;&#28508;&#22312;&#26377;&#23475;&#30340;&#36755;&#20986;&#12290;&#25105;&#20204;&#30340;&#26032;&#39062;&#26041;&#27861;&#36890;&#36807;&#25581;&#31034;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#21644;&#28431;&#27934;&#65292;&#31995;&#32479;&#22320;&#25581;&#31034;&#20102;&#20854;&#21709;&#24212;&#19982;&#39044;&#26399;&#34892;&#20026;&#19981;&#31526;&#30340;&#24773;&#20917;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#25216;&#26415;&#30340;&#26377;&#25928;&#24615;&#65292;&#20174;&#32780;&#20026;&#20851;&#20110;&#36127;&#36131;&#20219;&#30340;AI&#24320;&#21457;&#30340;&#35752;&#35770;&#25552;&#20379;&#20102;&#19968;&#31181;&#35786;&#26029;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models (LLMs), designed to provide helpful and safe responses, often rely on alignment techniques to align with user intent and social guidelines. Unfortunately, this alignment can be exploited by malicious actors seeking to manipulate an LLM's outputs for unintended purposes. In this paper we introduce a novel approach that employs a genetic algorithm (GA) to manipulate LLMs when model architecture and parameters are inaccessible. The GA attack works by optimizing a universal adversarial prompt that -- when combined with a user's query -- disrupts the attacked model's alignment, resulting in unintended and potentially harmful outputs. Our novel approach systematically reveals a model's limitations and vulnerabilities by uncovering instances where its responses deviate from expected behavior. Through extensive experiments we demonstrate the efficacy of our technique, thus contributing to the ongoing discussion on responsible AI development by providing a diagnostic tool 
&lt;/p&gt;</description></item></channel></rss>