<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#26399;&#26435;&#23450;&#20215;&#39046;&#22495;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;</title><link>https://arxiv.org/abs/2403.11738</link><description>&lt;p&gt;
&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;
&lt;/p&gt;
&lt;p&gt;
A path-dependent PDE solver based on signature kernels
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11738
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#26399;&#26435;&#23450;&#20215;&#39046;&#22495;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#65288;PPDE&#65289;&#30340;&#25910;&#25947;&#35777;&#26126;&#27714;&#35299;&#22120;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#26041;&#26696;&#21033;&#29992;&#20102;&#29305;&#24449;&#26680;&#65292;&#36825;&#26159;&#26368;&#36817;&#22312;&#36335;&#24452;&#31354;&#38388;&#19978;&#24341;&#20837;&#30340;&#19968;&#31867;&#26680;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#36890;&#36807;&#22312;&#31526;&#21495;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65288;RKHS&#65289;&#20013;&#36817;&#20284;PPDE&#30340;&#35299;&#26469;&#35299;&#20915;&#19968;&#20010;&#26368;&#20248;&#24674;&#22797;&#38382;&#39064;&#65292;&#35813;&#31354;&#38388;&#21463;&#21040;&#22312;&#26377;&#38480;&#38598;&#21512;&#30340;&#36828;&#31243;&#36335;&#24452;&#19978;&#28385;&#36275;PPDE&#32422;&#26463;&#30340;&#20803;&#32032;&#30340;&#32422;&#26463;&#12290;&#22312;&#32447;&#24615;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20248;&#21270;&#20855;&#26377;&#21807;&#19968;&#30340;&#38381;&#24335;&#35299;&#65292;&#20854;&#20197;&#36828;&#31243;&#36335;&#24452;&#22788;&#30340;&#29305;&#24449;&#26680;&#35780;&#20272;&#30340;&#24418;&#24335;&#34920;&#31034;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#26041;&#26696;&#30340;&#19968;&#33268;&#24615;&#65292;&#20445;&#35777;&#22312;&#36828;&#31243;&#28857;&#25968;&#22686;&#21152;&#26102;&#25910;&#25947;&#21040;PPDE&#35299;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20960;&#20010;&#25968;&#20540;&#20363;&#23376;&#65292;&#23588;&#20854;&#26159;&#22312;&#31895;&#31961;&#27874;&#21160;&#29575;&#19979;&#30340;&#26399;&#26435;&#23450;&#20215;&#32972;&#26223;&#19979;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#26041;&#26696;&#26500;&#25104;&#20102;&#19968;&#31181;&#26367;&#20195;&#24615;&#30340;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#30340;&#26377;&#25928;&#26367;&#20195;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11738v1 Announce Type: cross  Abstract: We develop a provably convergent kernel-based solver for path-dependent PDEs (PPDEs). Our numerical scheme leverages signature kernels, a recently introduced class of kernels on path-space. Specifically, we solve an optimal recovery problem by approximating the solution of a PPDE with an element of minimal norm in the signature reproducing kernel Hilbert space (RKHS) constrained to satisfy the PPDE at a finite collection of collocation paths. In the linear case, we show that the optimisation has a unique closed-form solution expressed in terms of signature kernel evaluations at the collocation paths. We prove consistency of the proposed scheme, guaranteeing convergence to the PPDE solution as the number of collocation points increases. Finally, several numerical examples are presented, in particular in the context of option pricing under rough volatility. Our numerical scheme constitutes a valid alternative to the ubiquitous Monte Carl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#24403;&#31995;&#25968;&#30697;&#38453;&#21644;&#21521;&#37327;&#37117;&#23384;&#22312;&#21152;&#24615;&#21644;&#20056;&#24615;&#22122;&#22768;&#26102;&#65292;&#38543;&#26426;Kaczmarz&#31639;&#27861;&#22312;&#35299;&#20915;&#22122;&#22768;&#32447;&#24615;&#31995;&#32479;&#20013;&#30340;&#25910;&#25947;&#24615;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;RK&#30340;&#25910;&#25947;&#24615;&#21463;&#21040;&#120591;&#30340;&#22823;&#23567;&#24433;&#21709;&#65292;&#20854;&#20013;&#120591;&#34920;&#31034;&#24102;&#26377;&#22122;&#22768;&#30340;&#31995;&#25968;&#30697;&#38453;A&#30340;&#20056;&#23376;&#33539;&#25968;&#30340;&#24179;&#26041;&#19982;Frobenius&#33539;&#25968;&#30340;&#24179;&#26041;&#30340;&#20056;&#31215;&#12290;</title><link>http://arxiv.org/abs/2308.16904</link><description>&lt;p&gt;
&#20851;&#20110;&#35299;&#20915;&#21452;&#21521;&#22122;&#22768;&#32447;&#24615;&#31995;&#32479;&#30340;&#38543;&#26426;Kaczmarz&#31639;&#27861;&#30340;&#27880;&#37322;
&lt;/p&gt;
&lt;p&gt;
A Note on Randomized Kaczmarz Algorithm for Solving Doubly-Noisy Linear Systems. (arXiv:2308.16904v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.16904
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#24403;&#31995;&#25968;&#30697;&#38453;&#21644;&#21521;&#37327;&#37117;&#23384;&#22312;&#21152;&#24615;&#21644;&#20056;&#24615;&#22122;&#22768;&#26102;&#65292;&#38543;&#26426;Kaczmarz&#31639;&#27861;&#22312;&#35299;&#20915;&#22122;&#22768;&#32447;&#24615;&#31995;&#32479;&#20013;&#30340;&#25910;&#25947;&#24615;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;RK&#30340;&#25910;&#25947;&#24615;&#21463;&#21040;&#120591;&#30340;&#22823;&#23567;&#24433;&#21709;&#65292;&#20854;&#20013;&#120591;&#34920;&#31034;&#24102;&#26377;&#22122;&#22768;&#30340;&#31995;&#25968;&#30697;&#38453;A&#30340;&#20056;&#23376;&#33539;&#25968;&#30340;&#24179;&#26041;&#19982;Frobenius&#33539;&#25968;&#30340;&#24179;&#26041;&#30340;&#20056;&#31215;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#32447;&#24615;&#31995;&#32479;Ax=b&#22312;&#23454;&#36341;&#20013;&#32463;&#24120;&#20986;&#29616;&#65292;&#38656;&#35201;&#26377;&#25928;&#30340;&#36845;&#20195;&#27714;&#35299;&#22120;&#12290;&#36890;&#24120;&#65292;&#30001;&#20110;&#25805;&#20316;&#35823;&#24046;&#25110;&#38169;&#35823;&#30340;&#25968;&#25454;&#25910;&#38598;&#36807;&#31243;&#65292;&#36825;&#20123;&#31995;&#32479;&#20250;&#20986;&#29616;&#22122;&#22768;&#12290;&#22312;&#36807;&#21435;&#30340;&#21313;&#24180;&#20013;&#65292;&#38543;&#26426;Kaczmarz&#65288;RK&#65289;&#31639;&#27861;&#24050;&#34987;&#24191;&#27867;&#30740;&#31350;&#20316;&#20026;&#36825;&#20123;&#31995;&#32479;&#30340;&#39640;&#25928;&#36845;&#20195;&#27714;&#35299;&#22120;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#23545;RK&#22312;&#22122;&#22768;&#24773;&#20917;&#19979;&#30340;&#25910;&#25947;&#24615;&#30740;&#31350;&#26377;&#38480;&#65292;&#21482;&#32771;&#34385;&#21491;&#20391;&#21521;&#37327;b&#20013;&#30340;&#27979;&#37327;&#22122;&#22768;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#24182;&#19981;&#24635;&#26159;&#36825;&#26679;&#65307;&#31995;&#25968;&#30697;&#38453;A&#20063;&#21487;&#33021;&#26159;&#26377;&#22122;&#22768;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#24403;&#31995;&#25968;&#30697;&#38453;A&#20197;&#21450;&#21521;&#37327;b&#37117;&#21463;&#26377;&#21152;&#24615;&#21644;&#20056;&#24615;&#22122;&#22768;&#24433;&#21709;&#26102;&#65292;RK&#30340;&#25910;&#25947;&#24615;&#12290;&#22312;&#25105;&#20204;&#30340;&#20998;&#26512;&#20013;&#65292;&#21464;&#37327; &#120591;=&#8741; &#120591; &#119860; &#8727; &#8741;2^2 &#8741; &#119836;&#119863;&#119867;&#8727;&#119888; &#8722; &#119835; &#8741;_&#119865;^2&#127542; &#119900; &#119877; &#30340;&#22823;&#23567;&#20250;&#24433;&#21709;RK&#30340;&#25910;&#25947;&#24615;&#65292;&#20854;&#20013; &#120591;&#119860; &#34920;&#31034;A&#30340;&#24102;&#26377;&#22122;&#22768;&#30340;&#29256;&#26412;&#12290;&#25105;&#20204;&#22768;&#31216;&#25105;&#20204;&#30340;&#20998;&#26512;&#26159;&#20581;&#22766;&#19988;&#36924;&#36817;&#23454;&#38469;&#30340;.
&lt;/p&gt;
&lt;p&gt;
Large-scale linear systems, $Ax=b$, frequently arise in practice and demand effective iterative solvers. Often, these systems are noisy due to operational errors or faulty data-collection processes. In the past decade, the randomized Kaczmarz (RK) algorithm has been studied extensively as an efficient iterative solver for such systems. However, the convergence study of RK in the noisy regime is limited and considers measurement noise in the right-hand side vector, $b$. Unfortunately, in practice, that is not always the case; the coefficient matrix $A$ can also be noisy. In this paper, we analyze the convergence of RK for noisy linear systems when the coefficient matrix, $A$, is corrupted with both additive and multiplicative noise, along with the noisy vector, $b$. In our analyses, the quantity $\tilde R=\| \tilde A^{\dagger} \|_2^2 \|\tilde A \|_F^2$ influences the convergence of RK, where $\tilde A$ represents a noisy version of $A$. We claim that our analysis is robust and realistic
&lt;/p&gt;</description></item></channel></rss>