<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#29702;&#35770;&#20998;&#26512;&#35777;&#26126;&#65292;&#22312;&#22810;&#30446;&#26631;&#36827;&#21270;&#31639;&#27861;&#20013;&#37319;&#29992;&#38543;&#26426;&#31181;&#32676;&#26356;&#26032;&#26426;&#21046;&#21487;&#20197;&#26174;&#33879;&#38477;&#20302;&#31639;&#27861;&#30340;&#36816;&#34892;&#26102;&#38388;&#65292;&#20174;&#32780;&#25552;&#39640;&#38382;&#39064;&#30340;&#27714;&#35299;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2306.02611</link><description>&lt;p&gt;
&#38543;&#26426;&#31181;&#32676;&#26356;&#26032;&#22312;&#22810;&#30446;&#26631;&#36827;&#21270;&#31639;&#27861;&#20013;&#21487;&#20197;&#34987;&#35777;&#26126;&#26159;&#26377;&#24110;&#21161;&#30340;
&lt;/p&gt;
&lt;p&gt;
Stochastic Population Update Can Provably Be Helpful in Multi-Objective Evolutionary Algorithms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2306.02611
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#29702;&#35770;&#20998;&#26512;&#35777;&#26126;&#65292;&#22312;&#22810;&#30446;&#26631;&#36827;&#21270;&#31639;&#27861;&#20013;&#37319;&#29992;&#38543;&#26426;&#31181;&#32676;&#26356;&#26032;&#26426;&#21046;&#21487;&#20197;&#26174;&#33879;&#38477;&#20302;&#31639;&#27861;&#30340;&#36816;&#34892;&#26102;&#38388;&#65292;&#20174;&#32780;&#25552;&#39640;&#38382;&#39064;&#30340;&#27714;&#35299;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36827;&#21270;&#31639;&#27861;&#65288;EAs&#65289;&#22240;&#20854;&#22522;&#20110;&#31181;&#32676;&#30340;&#25628;&#32034;&#29305;&#24615;&#65292;&#24050;&#34987;&#24191;&#27867;&#19988;&#25104;&#21151;&#22320;&#24212;&#29992;&#20110;&#35299;&#20915;&#22810;&#30446;&#26631;&#20248;&#21270;&#38382;&#39064;&#12290;&#31181;&#32676;&#26356;&#26032;&#26159;&#22810;&#30446;&#26631;&#36827;&#21270;&#31639;&#27861;&#65288;MOEAs&#65289;&#20013;&#30340;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#65292;&#36890;&#24120;&#20197;&#36138;&#23146;&#12289;&#30830;&#23450;&#24615;&#30340;&#26041;&#24335;&#36827;&#34892;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#19979;&#19968;&#20195;&#31181;&#32676;&#26159;&#36890;&#36807;&#20174;&#24403;&#21069;&#31181;&#32676;&#21644;&#26032;&#29983;&#25104;&#30340;&#35299;&#20013;&#36873;&#25321;&#26368;&#20248;&#35299;&#24418;&#25104;&#30340;&#65288;&#26080;&#35770;&#20351;&#29992;&#30340;&#36873;&#25321;&#26631;&#20934;&#26159;Pareto&#25903;&#37197;&#12289;&#25317;&#25380;&#24230;&#36824;&#26159;&#25351;&#26631;&#31561;&#65289;&#12290;&#26412;&#25991;&#23545;&#36825;&#31181;&#20570;&#27861;&#25552;&#20986;&#20102;&#36136;&#30097;&#12290;&#25105;&#20204;&#20174;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#38543;&#26426;&#31181;&#32676;&#26356;&#26032;&#23545;&#20110;MOEAs&#30340;&#25628;&#32034;&#26159;&#26377;&#30410;&#30340;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#23558;&#30830;&#23450;&#24615;&#31181;&#32676;&#26356;&#26032;&#26426;&#21046;&#26367;&#25442;&#20026;&#38543;&#26426;&#26426;&#21046;&#65292;&#21487;&#20197;&#25351;&#25968;&#32423;&#20943;&#23569;&#20004;&#20010;&#24050;&#32463;&#34987;&#24191;&#27867;&#25509;&#21463;&#30340;MOEAs&#65288;SMS-EMOA&#21644;NSGA-II&#65289;&#22312;&#35299;&#20915;&#20004;&#20010;&#21452;&#30446;&#26631;&#38382;&#39064;&#65288;OneJumpZeroJump&#21644;&#21452;&#30446;&#26631;RealRoyalRoad&#65289;&#19978;&#30340;&#39044;&#35745;&#36816;&#34892;&#26102;&#38388;&#12290;&#27492;&#22806;&#65292;&#36824;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Evolutionary algorithms (EAs) have been widely and successfully applied to solve multi-objective optimization problems, due to their nature of population-based search. Population update, a key component in multi-objective EAs (MOEAs), is usually performed in a greedy, deterministic manner. That is, the next-generation population is formed by selecting the best solutions from the current population and newly-generated solutions (irrespective of the selection criteria used such as Pareto dominance, crowdedness and indicators). In this paper, we question this practice. We analytically present that stochastic population update can be beneficial for the search of MOEAs. Specifically, we prove that the expected running time of two well-established MOEAs, SMS-EMOA and NSGA-II, for solving two bi-objective problems, OneJumpZeroJump and bi-objective RealRoyalRoad, can be exponentially decreased if replacing its deterministic population update mechanism by a stochastic one. Empirical studies als
&lt;/p&gt;</description></item></channel></rss>