<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#26399;&#26435;&#23450;&#20215;&#39046;&#22495;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;</title><link>https://arxiv.org/abs/2403.11738</link><description>&lt;p&gt;
&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;
&lt;/p&gt;
&lt;p&gt;
A path-dependent PDE solver based on signature kernels
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11738
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#27714;&#35299;&#22120;&#65292;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#26399;&#26435;&#23450;&#20215;&#39046;&#22495;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#26680;&#30340;&#36335;&#24452;&#20381;&#36182;PDE&#65288;PPDE&#65289;&#30340;&#25910;&#25947;&#35777;&#26126;&#27714;&#35299;&#22120;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#26041;&#26696;&#21033;&#29992;&#20102;&#29305;&#24449;&#26680;&#65292;&#36825;&#26159;&#26368;&#36817;&#22312;&#36335;&#24452;&#31354;&#38388;&#19978;&#24341;&#20837;&#30340;&#19968;&#31867;&#26680;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#36890;&#36807;&#22312;&#31526;&#21495;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65288;RKHS&#65289;&#20013;&#36817;&#20284;PPDE&#30340;&#35299;&#26469;&#35299;&#20915;&#19968;&#20010;&#26368;&#20248;&#24674;&#22797;&#38382;&#39064;&#65292;&#35813;&#31354;&#38388;&#21463;&#21040;&#22312;&#26377;&#38480;&#38598;&#21512;&#30340;&#36828;&#31243;&#36335;&#24452;&#19978;&#28385;&#36275;PPDE&#32422;&#26463;&#30340;&#20803;&#32032;&#30340;&#32422;&#26463;&#12290;&#22312;&#32447;&#24615;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20248;&#21270;&#20855;&#26377;&#21807;&#19968;&#30340;&#38381;&#24335;&#35299;&#65292;&#20854;&#20197;&#36828;&#31243;&#36335;&#24452;&#22788;&#30340;&#29305;&#24449;&#26680;&#35780;&#20272;&#30340;&#24418;&#24335;&#34920;&#31034;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#26041;&#26696;&#30340;&#19968;&#33268;&#24615;&#65292;&#20445;&#35777;&#22312;&#36828;&#31243;&#28857;&#25968;&#22686;&#21152;&#26102;&#25910;&#25947;&#21040;PPDE&#35299;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20960;&#20010;&#25968;&#20540;&#20363;&#23376;&#65292;&#23588;&#20854;&#26159;&#22312;&#31895;&#31961;&#27874;&#21160;&#29575;&#19979;&#30340;&#26399;&#26435;&#23450;&#20215;&#32972;&#26223;&#19979;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#26041;&#26696;&#26500;&#25104;&#20102;&#19968;&#31181;&#26367;&#20195;&#24615;&#30340;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#30340;&#26377;&#25928;&#26367;&#20195;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11738v1 Announce Type: cross  Abstract: We develop a provably convergent kernel-based solver for path-dependent PDEs (PPDEs). Our numerical scheme leverages signature kernels, a recently introduced class of kernels on path-space. Specifically, we solve an optimal recovery problem by approximating the solution of a PPDE with an element of minimal norm in the signature reproducing kernel Hilbert space (RKHS) constrained to satisfy the PPDE at a finite collection of collocation paths. In the linear case, we show that the optimisation has a unique closed-form solution expressed in terms of signature kernel evaluations at the collocation paths. We prove consistency of the proposed scheme, guaranteeing convergence to the PPDE solution as the number of collocation points increases. Finally, several numerical examples are presented, in particular in the context of option pricing under rough volatility. Our numerical scheme constitutes a valid alternative to the ubiquitous Monte Carl
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;&#65288;MHSNs&#65289;&#65292;&#21033;&#29992;&#22810;&#23610;&#24230;&#22522;&#30784;&#35789;&#20856;&#21644;&#21367;&#31215;&#32467;&#26500;&#65292;&#29983;&#25104;&#23545;&#33410;&#28857;&#25490;&#21015;&#19981;&#21464;&#30340;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2311.10270</link><description>&lt;p&gt;
&#29992;&#20110;&#25968;&#25454;&#20998;&#26512;&#30340;&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Multiscale Hodge Scattering Networks for Data Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.10270
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;&#65288;MHSNs&#65289;&#65292;&#21033;&#29992;&#22810;&#23610;&#24230;&#22522;&#30784;&#35789;&#20856;&#21644;&#21367;&#31215;&#32467;&#26500;&#65292;&#29983;&#25104;&#23545;&#33410;&#28857;&#25490;&#21015;&#19981;&#21464;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25955;&#23556;&#32593;&#32476;&#65292;&#29992;&#20110;&#22312;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#19978;&#27979;&#37327;&#30340;&#20449;&#21495;&#65292;&#31216;&#20026;\emph{&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;}&#65288;MHSNs&#65289;&#12290;&#25105;&#20204;&#30340;&#26500;&#36896;&#22522;&#20110;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#19978;&#30340;&#22810;&#23610;&#24230;&#22522;&#30784;&#35789;&#20856;&#65292;&#21363;$\kappa$-GHWT&#21644;$\kappa$-HGLET&#65292;&#25105;&#20204;&#26368;&#36817;&#20026;&#32473;&#23450;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#20013;&#30340;&#32500;&#24230;$\kappa \in \mathbb{N}$&#25512;&#24191;&#20102;&#22522;&#20110;&#33410;&#28857;&#30340;&#24191;&#20041;&#21704;-&#27779;&#20160;&#21464;&#25442;&#65288;GHWT&#65289;&#21644;&#20998;&#23618;&#22270;&#25289;&#26222;&#25289;&#26031;&#29305;&#24449;&#21464;&#25442;&#65288;HGLET&#65289;&#12290;$\kappa$-GHWT&#21644;$\kappa$-HGLET&#37117;&#24418;&#25104;&#20887;&#20313;&#38598;&#21512;&#65288;&#21363;&#35789;&#20856;&#65289;&#30340;&#22810;&#23610;&#24230;&#22522;&#30784;&#21521;&#37327;&#21644;&#32473;&#23450;&#20449;&#21495;&#30340;&#30456;&#24212;&#25193;&#23637;&#31995;&#25968;&#12290;&#25105;&#20204;&#30340;MHSNs&#20351;&#29992;&#31867;&#20284;&#20110;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#30340;&#20998;&#23618;&#32467;&#26500;&#26469;&#32423;&#32852;&#35789;&#20856;&#31995;&#25968;&#27169;&#30340;&#30697;&#12290;&#25152;&#24471;&#29305;&#24449;&#23545;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#30340;&#37325;&#26032;&#25490;&#24207;&#19981;&#21464;&#65288;&#21363;&#33410;&#28857;&#25490;&#21015;&#30340;&#32622;&#25442;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.10270v2 Announce Type: replace  Abstract: We propose new scattering networks for signals measured on simplicial complexes, which we call \emph{Multiscale Hodge Scattering Networks} (MHSNs). Our construction is based on multiscale basis dictionaries on simplicial complexes, i.e., the $\kappa$-GHWT and $\kappa$-HGLET, which we recently developed for simplices of dimension $\kappa \in \mathbb{N}$ in a given simplicial complex by generalizing the node-based Generalized Haar-Walsh Transform (GHWT) and Hierarchical Graph Laplacian Eigen Transform (HGLET). The $\kappa$-GHWT and the $\kappa$-HGLET both form redundant sets (i.e., dictionaries) of multiscale basis vectors and the corresponding expansion coefficients of a given signal. Our MHSNs use a layered structure analogous to a convolutional neural network (CNN) to cascade the moments of the modulus of the dictionary coefficients. The resulting features are invariant to reordering of the simplices (i.e., node permutation of the u
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#38454;&#22686;&#24191;&#25289;&#26684;&#26391;&#26085;&#26041;&#27861;&#26469;&#35299;&#20915;&#32422;&#26463;&#26497;&#23567;&#26497;&#22823;&#38382;&#39064;&#65292;&#20854;&#25805;&#20316;&#22797;&#26434;&#24230;&#20026; ${\cal O}(\varepsilon^{-4}\log\varepsilon^{-1})$&#12290;</title><link>http://arxiv.org/abs/2301.02060</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#32422;&#26463;&#26497;&#23567;&#26497;&#22823;&#20248;&#21270;&#38382;&#39064;&#30340;&#19968;&#38454;&#22686;&#24191;&#25289;&#26684;&#26391;&#26085;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A first-order augmented Lagrangian method for constrained minimax optimization. (arXiv:2301.02060v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.02060
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#38454;&#22686;&#24191;&#25289;&#26684;&#26391;&#26085;&#26041;&#27861;&#26469;&#35299;&#20915;&#32422;&#26463;&#26497;&#23567;&#26497;&#22823;&#38382;&#39064;&#65292;&#20854;&#25805;&#20316;&#22797;&#26434;&#24230;&#20026; ${\cal O}(\varepsilon^{-4}\log\varepsilon^{-1})$&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#32422;&#26463;&#26497;&#23567;&#26497;&#22823;&#38382;&#39064;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#38454;&#22686;&#24191;&#25289;&#26684;&#26391;&#26085;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#20854;&#23376;&#38382;&#39064;&#34987;&#21457;&#29616;&#26159;&#19968;&#20010;&#26356;&#31616;&#21333;&#30340;&#32467;&#26500;&#21270;&#26497;&#23567;&#26497;&#22823;&#38382;&#39064;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#20316;&#32773;&#22312; [26] &#20013;&#26368;&#36817;&#24320;&#21457;&#30340;&#19968;&#38454;&#26041;&#27861;&#26469;&#36866;&#24403;&#22320;&#35299;&#20915;&#12290;&#22312;&#19968;&#20123;&#36866;&#24403;&#30340;&#20551;&#35774;&#19979;&#65292;&#20026;&#20102;&#25214;&#21040;&#32422;&#26463;&#26497;&#23567;&#26497;&#22823;&#38382;&#39064;&#30340;&#19968;&#20010; $\varepsilon$-KKT &#35299;&#65292;&#35813;&#26041;&#27861;&#30340;&#25805;&#20316;&#22797;&#26434;&#24230;&#20026; ${\cal O}(\varepsilon^{-4}\log\varepsilon^{-1})$&#65292;&#35813;&#22797;&#26434;&#24230;&#26159;&#30001;&#22522;&#26412;&#25805;&#20316;&#27979;&#37327;&#24471;&#21040;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we study a class of constrained minimax problems. In particular, we propose a first-order augmented Lagrangian method for solving them, whose subproblems turn out to be a much simpler structured minimax problem and are suitably solved by a first-order method recently developed in [26] by the authors. Under some suitable assumptions, an \emph{operation complexity} of ${\cal O}(\varepsilon^{-4}\log\varepsilon^{-1})$, measured by its fundamental operations, is established for the first-order augmented Lagrangian method for finding an $\varepsilon$-KKT solution of the constrained minimax problems.
&lt;/p&gt;</description></item></channel></rss>