<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#35774;&#35745;&#20102;&#19968;&#31181;&#22312;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#20026;&#35774;&#22791;&#21160;&#24577;&#36873;&#25321;&#20998;&#35010;&#28857;&#24182;&#20026;&#26381;&#21153;&#22120;&#20998;&#37197;&#35745;&#31639;&#36164;&#28304;&#30340;&#33258;&#36866;&#24212;&#20998;&#35010;&#23398;&#20064;&#26041;&#26696;&#65292;&#20197;&#26368;&#23567;&#21270;&#24179;&#22343;&#35757;&#32451;&#24310;&#36831;&#20026;&#30446;&#26631;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;OPEN&#30340;&#22312;&#32447;&#31639;&#27861;&#35299;&#20915;&#27492;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.05158</link><description>&lt;p&gt;
&#33021;&#37327;&#21463;&#38480;&#30340;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#30340;&#33258;&#36866;&#24212;&#20998;&#35010;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Adaptive Split Learning over Energy-Constrained Wireless Edge Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05158
&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20102;&#19968;&#31181;&#22312;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#20026;&#35774;&#22791;&#21160;&#24577;&#36873;&#25321;&#20998;&#35010;&#28857;&#24182;&#20026;&#26381;&#21153;&#22120;&#20998;&#37197;&#35745;&#31639;&#36164;&#28304;&#30340;&#33258;&#36866;&#24212;&#20998;&#35010;&#23398;&#20064;&#26041;&#26696;&#65292;&#20197;&#26368;&#23567;&#21270;&#24179;&#22343;&#35757;&#32451;&#24310;&#36831;&#20026;&#30446;&#26631;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;OPEN&#30340;&#22312;&#32447;&#31639;&#27861;&#35299;&#20915;&#27492;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#35010;&#23398;&#20064;&#65288;SL&#65289;&#26159;&#19968;&#31181;&#26377;&#24076;&#26395;&#30340;&#29992;&#20110;&#35757;&#32451;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#20854;&#20013;&#35774;&#22791;&#19982;&#26381;&#21153;&#22120;&#21512;&#20316;&#20197;&#20998;&#24067;&#24335;&#26041;&#24335;&#35757;&#32451;AI&#27169;&#22411;&#65292;&#22522;&#20110;&#30456;&#21516;&#30340;&#22266;&#23450;&#20998;&#35010;&#28857;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#35774;&#22791;&#30340;&#24322;&#26500;&#24615;&#21644;&#20449;&#36947;&#26465;&#20214;&#30340;&#21464;&#21270;&#65292;&#36825;&#31181;&#26041;&#24335;&#22312;&#35757;&#32451;&#24310;&#36831;&#21644;&#33021;&#37327;&#28040;&#32791;&#26041;&#38754;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#20998;&#35010;&#23398;&#20064;&#65288;ASL&#65289;&#26041;&#26696;&#65292;&#21487;&#20197;&#22312;&#26080;&#32447;&#36793;&#32536;&#32593;&#32476;&#20013;&#20026;&#35774;&#22791;&#21160;&#24577;&#36873;&#25321;&#20998;&#35010;&#28857;&#65292;&#24182;&#20026;&#26381;&#21153;&#22120;&#20998;&#37197;&#35745;&#31639;&#36164;&#28304;&#12290;&#25105;&#20204;&#21046;&#23450;&#20102;&#19968;&#20010;&#20248;&#21270;&#38382;&#39064;&#65292;&#26088;&#22312;&#22312;&#28385;&#36275;&#38271;&#26399;&#33021;&#37327;&#28040;&#32791;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#26368;&#23567;&#21270;&#24179;&#22343;&#35757;&#32451;&#24310;&#36831;&#12290;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#30340;&#22256;&#38590;&#22312;&#20110;&#32570;&#20047;&#26410;&#26469;&#20449;&#24687;&#21644;&#28151;&#21512;&#25972;&#25968;&#35268;&#21010;&#65288;MIP&#65289;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;Lyapunov&#29702;&#35770;&#30340;&#22312;&#32447;&#31639;&#27861;&#65292;&#21517;&#20026;OPEN&#65292;&#23427;&#23558;&#20854;&#20998;&#35299;&#20026;&#19968;&#20010;&#20855;&#26377;&#24403;&#21069;&#30340;&#26032;MIP&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05158v1 Announce Type: cross  Abstract: Split learning (SL) is a promising approach for training artificial intelligence (AI) models, in which devices collaborate with a server to train an AI model in a distributed manner, based on a same fixed split point. However, due to the device heterogeneity and variation of channel conditions, this way is not optimal in training delay and energy consumption. In this paper, we design an adaptive split learning (ASL) scheme which can dynamically select split points for devices and allocate computing resource for the server in wireless edge networks. We formulate an optimization problem to minimize the average training latency subject to long-term energy consumption constraint. The difficulties in solving this problem are the lack of future information and mixed integer programming (MIP). To solve it, we propose an online algorithm leveraging the Lyapunov theory, named OPEN, which decomposes it into a new MIP problem only with the curren
&lt;/p&gt;</description></item></channel></rss>