<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Committor&#38382;&#39064;&#30340;&#26377;&#38480;&#34920;&#36798;&#24335;&#26041;&#27861;(FEX)&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#26368;&#20248;&#38750;&#32447;&#24615;&#20989;&#25968;&#21644;&#31995;&#25968;&#20540;&#65292;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#35745;&#31639;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.12268</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Committor&#38382;&#39064;&#30340;&#26377;&#38480;&#34920;&#36798;&#24335;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Finite Expression Method for Solving High-Dimensional Committor Problems. (arXiv:2306.12268v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12268
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#39640;&#32500;Committor&#38382;&#39064;&#30340;&#26377;&#38480;&#34920;&#36798;&#24335;&#26041;&#27861;(FEX)&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#26368;&#20248;&#38750;&#32447;&#24615;&#20989;&#25968;&#21644;&#31995;&#25968;&#20540;&#65292;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#35745;&#31639;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36716;&#31227;&#36335;&#24452;&#29702;&#35770;&#65288;TPT&#65289;&#26159;&#19968;&#31181;&#25968;&#23398;&#26694;&#26550;&#65292;&#29992;&#20110;&#37327;&#21270;&#20174;&#36873;&#23450;&#30340;&#20122;&#31283;&#24577;$A$&#21040;$B$&#20043;&#38388;&#30340;&#31232;&#26377;&#36716;&#31227;&#20107;&#20214;&#12290;TPT&#30340;&#26680;&#24515;&#26159;Committor&#20989;&#25968;&#65292;&#20854;&#25551;&#36848;&#20102;&#20174;&#30456;&#31354;&#38388;&#30340;&#20219;&#20309;&#36215;&#22987;&#28857;&#21040;&#36798;&#20122;&#31283;&#24577;$B$&#20043;&#21069;&#21040;&#36798;$A$&#30340;&#27010;&#29575;&#12290;&#35745;&#31639;&#20986;Committor&#20043;&#21518;&#65292;&#21487;&#20197;&#31435;&#21363;&#25214;&#21040;&#36716;&#25442;&#36890;&#36947;&#21644;&#36716;&#25442;&#36895;&#29575;&#12290;Committor&#26159;&#20855;&#26377;&#36866;&#24403;&#36793;&#30028;&#26465;&#20214;&#30340;&#21453;&#21521;Kolmogorov&#26041;&#31243;&#30340;&#35299;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65292;&#30001;&#20110;&#38656;&#35201;&#32593;&#26684;&#21270;&#25972;&#20010;&#29615;&#22659;&#31354;&#38388;&#65292;&#35299;&#20915;Committor&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#26377;&#38480;&#34920;&#36798;&#24335;&#26041;&#27861;&#65288;FEX&#65292;Liang&#21644;Yang&#65288;2022&#65289;&#65289;&#20316;&#20026;&#35745;&#31639;Committor&#30340;&#24037;&#20855;&#12290;FEX&#36890;&#36807;&#28041;&#21450;&#19968;&#23450;&#25968;&#37327;&#30340;&#38750;&#32447;&#24615;&#20989;&#25968;&#21644;&#20108;&#36827;&#21046;&#31639;&#26415;&#36816;&#31639;&#30340;&#22266;&#23450;&#26377;&#38480;&#20195;&#25968;&#34920;&#36798;&#24335;&#26469;&#36924;&#36817;Committor&#12290;&#26368;&#20339;&#30340;&#38750;&#32447;&#24615;&#20989;&#25968;&#12289;&#20108;&#36827;&#21046;&#36816;&#31639;&#21644;&#25968;&#20540;&#31995;&#25968;&#20540;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20174;&#35757;&#32451;&#25968;&#25454;&#20013;&#23398;&#20064;&#21040;&#12290;&#25105;&#20204;&#36890;&#36807;&#35299;&#20915;&#22810;&#20010;&#39640;&#32500;Committor&#38382;&#39064;&#65292;&#20854;&#20013;&#21253;&#25324;&#39640;&#36798;400&#20010;&#32500;&#24230;&#65292;&#23637;&#31034;&#20102;FEX&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#19988;&#34920;&#26126;FEX&#26174;&#33879;&#20248;&#20110;&#20256;&#32479;&#30340;&#25968;&#20540;&#26041;&#27861;&#65292;&#22914;&#26377;&#38480;&#20803;&#26041;&#27861;&#21644;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Transition path theory (TPT) is a mathematical framework for quantifying rare transition events between a pair of selected metastable states $A$ and $B$. Central to TPT is the committor function, which describes the probability to hit the metastable state $B$ prior to $A$ from any given starting point of the phase space. Once the committor is computed, the transition channels and the transition rate can be readily found. The committor is the solution to the backward Kolmogorov equation with appropriate boundary conditions. However, solving it is a challenging task in high dimensions due to the need to mesh a whole region of the ambient space. In this work, we explore the finite expression method (FEX, Liang and Yang (2022)) as a tool for computing the committor. FEX approximates the committor by an algebraic expression involving a fixed finite number of nonlinear functions and binary arithmetic operations. The optimal nonlinear functions, the binary operations, and the numerical coeffi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;"&#26377;&#38480;&#34920;&#36798;&#27861;" (FEX) &#30340;&#28145;&#24230;&#31526;&#21495;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#21160;&#24577;&#25968;&#25454;&#20013;PDE&#35299;&#30340;&#23548;&#25968;&#65292;&#21457;&#29616;&#25511;&#21046;&#26041;&#31243;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#12290;&#30456;&#23545;&#20110;&#20854;&#20182;&#29616;&#26377;&#26041;&#27861;&#65292;FEX&#22312;&#22810;&#31181;&#38382;&#39064;&#19978;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#25968;&#20540;&#24615;&#33021;&#65292;&#21253;&#25324;&#26102;&#21464;&#30340;PDE&#38382;&#39064;&#21644;&#20855;&#26377;&#26102;&#21464;&#31995;&#25968;&#30340;&#38750;&#32447;&#24615;&#21160;&#21147;&#31995;&#32479;&#12290;</title><link>http://arxiv.org/abs/2305.08342</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#20013;&#21457;&#29616;&#29289;&#29702;&#23450;&#24459;&#30340;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Finite Expression Methods for Discovering Physical Laws from Data. (arXiv:2305.08342v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08342
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;"&#26377;&#38480;&#34920;&#36798;&#27861;" (FEX) &#30340;&#28145;&#24230;&#31526;&#21495;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#21160;&#24577;&#25968;&#25454;&#20013;PDE&#35299;&#30340;&#23548;&#25968;&#65292;&#21457;&#29616;&#25511;&#21046;&#26041;&#31243;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#12290;&#30456;&#23545;&#20110;&#20854;&#20182;&#29616;&#26377;&#26041;&#27861;&#65292;FEX&#22312;&#22810;&#31181;&#38382;&#39064;&#19978;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#25968;&#20540;&#24615;&#33021;&#65292;&#21253;&#25324;&#26102;&#21464;&#30340;PDE&#38382;&#39064;&#21644;&#20855;&#26377;&#26102;&#21464;&#31995;&#25968;&#30340;&#38750;&#32447;&#24615;&#21160;&#21147;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#26159;&#31185;&#23398;&#21644;&#24037;&#31243;&#39046;&#22495;&#20013;&#26222;&#36941;&#23384;&#22312;&#30340;&#29616;&#35937;&#12290;&#28982;&#32780;&#65292;&#20174;&#26377;&#38480;&#25968;&#25454;&#20013;&#25512;&#23548;&#20986;&#25551;&#36848;&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#23558;&#20171;&#32461;&#19968;&#31181;&#26032;&#39062;&#30340;&#28145;&#24230;&#31526;&#21495;&#23398;&#20064;&#26041;&#27861;&#65292;&#31216;&#20026;"&#26377;&#38480;&#34920;&#36798;&#27861;" (FEX)&#65292;&#36890;&#36807;&#23398;&#20064;&#21160;&#24577;&#25968;&#25454;&#20013;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#35299;&#30340;&#23548;&#25968;&#65292;&#21033;&#29992;FEX&#22312;&#21253;&#21547;&#26377;&#38480;&#38598;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#21457;&#29616;&#25511;&#21046;&#26041;&#31243;&#12290;&#25105;&#20204;&#30340;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#65292;&#30456;&#23545;&#20110;&#20854;&#20182;&#29616;&#26377;&#26041;&#27861;&#65288;&#22914;PDE-Net, SINDy, GP &#21644; SPL&#65289;&#65292;&#25105;&#20204;&#30340;FEX&#22312;&#22810;&#31181;&#38382;&#39064;&#19978;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#25968;&#20540;&#24615;&#33021;&#65292;&#21253;&#25324;&#26102;&#21464;&#30340;PDE&#38382;&#39064;&#21644;&#20855;&#26377;&#26102;&#21464;&#31995;&#25968;&#30340;&#38750;&#32447;&#24615;&#21160;&#21147;&#31995;&#32479;&#12290;&#27492;&#22806;&#65292;&#32467;&#26524;&#31361;&#26174;&#20102;FEX&#30340;&#28789;&#27963;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nonlinear dynamics is a pervasive phenomenon observed in scientific and engineering disciplines. However, the task of deriving analytical expressions to describe nonlinear dynamics from limited data remains challenging. In this paper, we shall present a novel deep symbolic learning method called the "finite expression method" (FEX) to discover governing equations within a function space containing a finite set of analytic expressions, based on observed dynamic data. The key concept is to employ FEX to generate analytical expressions of the governing equations by learning the derivatives of partial differential equation (PDE) solutions through convolutions. Our numerical results demonstrate that our FEX surpasses other existing methods (such as PDE-Net, SINDy, GP, and SPL) in terms of numerical performance across a range of problems, including time-dependent PDE problems and nonlinear dynamical systems with time-varying coefficients. Moreover, the results highlight FEX's flexibility and
&lt;/p&gt;</description></item></channel></rss>