<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#38754;&#21521;&#30446;&#26631;&#30340;&#35821;&#20041;&#36890;&#20449;&#26694;&#26550;&#65292;&#21033;&#29992;&#30456;&#23545;&#34920;&#31034;&#36890;&#36807;&#28508;&#22312;&#31354;&#38388;&#23545;&#40784;&#26469;&#32531;&#35299;&#35821;&#20041;&#19981;&#21305;&#37197;&#65292;&#24182;&#23454;&#29616;&#20102;&#33021;&#25928;&#39640;&#12289;&#24310;&#36831;&#20302;&#30340;&#30446;&#26631;&#23548;&#21521;&#35821;&#20041;&#36890;&#20449;&#12290;</title><link>https://arxiv.org/abs/2403.16986</link><description>&lt;p&gt;
&#38754;&#21521;&#30446;&#26631;&#23548;&#21521;&#35821;&#20041;&#36890;&#20449;&#30340;&#21160;&#24577;&#30456;&#23545;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Dynamic Relative Representations for Goal-Oriented Semantic Communications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16986
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#38754;&#21521;&#30446;&#26631;&#30340;&#35821;&#20041;&#36890;&#20449;&#26694;&#26550;&#65292;&#21033;&#29992;&#30456;&#23545;&#34920;&#31034;&#36890;&#36807;&#28508;&#22312;&#31354;&#38388;&#23545;&#40784;&#26469;&#32531;&#35299;&#35821;&#20041;&#19981;&#21305;&#37197;&#65292;&#24182;&#23454;&#29616;&#20102;&#33021;&#25928;&#39640;&#12289;&#24310;&#36831;&#20302;&#30340;&#30446;&#26631;&#23548;&#21521;&#35821;&#20041;&#36890;&#20449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26410;&#26469;&#30340;6G&#26080;&#32447;&#32593;&#32476;&#20013;&#65292;&#36890;&#20449;&#30340;&#35821;&#20041;&#21644;&#26377;&#25928;&#24615;&#26041;&#38754;&#23558;&#21457;&#25381;&#22522;&#30784;&#20316;&#29992;&#65292;&#23558;&#21547;&#20041;&#21644;&#30456;&#20851;&#24615;&#32435;&#20837;&#20256;&#36755;&#12290;&#28982;&#32780;&#65292;&#24403;&#35774;&#22791;&#20351;&#29992;&#19981;&#21516;&#30340;&#35821;&#35328;&#12289;&#36923;&#36753;&#25110;&#20869;&#37096;&#34920;&#31034;&#26102;&#65292;&#20250;&#20986;&#29616;&#38556;&#30861;&#65292;&#23548;&#33268;&#35821;&#20041;&#19981;&#21305;&#37197;&#65292;&#21487;&#33021;&#21361;&#21450;&#29702;&#35299;&#12290;&#22312;&#28508;&#22312;&#31354;&#38388;&#36890;&#20449;&#20013;&#65292;&#36825;&#19968;&#25361;&#25112;&#34920;&#29616;&#20026;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23545;&#25968;&#25454;&#36827;&#34892;&#32534;&#30721;&#26102;&#39640;&#32500;&#34920;&#31034;&#19981;&#21305;&#37197;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#38754;&#21521;&#30446;&#26631;&#30340;&#35821;&#20041;&#36890;&#20449;&#26694;&#26550;&#65292;&#21033;&#29992;&#30456;&#23545;&#34920;&#31034;&#26469;&#36890;&#36807;&#28508;&#22312;&#31354;&#38388;&#23545;&#40784;&#32531;&#35299;&#35821;&#20041;&#19981;&#21305;&#37197;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#20248;&#21270;&#31574;&#30053;&#65292;&#20197;&#35843;&#25972;&#30456;&#23545;&#34920;&#31034;&#12289;&#36890;&#20449;&#21442;&#25968;&#21644;&#35745;&#31639;&#36164;&#28304;&#65292;&#23454;&#29616;&#33021;&#25928;&#39640;&#12289;&#24310;&#36831;&#20302;&#30340;&#30446;&#26631;&#23548;&#21521;&#35821;&#20041;&#36890;&#20449;&#12290;&#25968;&#20540;&#32467;&#26524;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#32531;&#35299;&#20013;&#36215;&#20316;&#29992;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16986v1 Announce Type: cross  Abstract: In future 6G wireless networks, semantic and effectiveness aspects of communications will play a fundamental role, incorporating meaning and relevance into transmissions. However, obstacles arise when devices employ diverse languages, logic, or internal representations, leading to semantic mismatches that might jeopardize understanding. In latent space communication, this challenge manifests as misalignment within high-dimensional representations where deep neural networks encode data. This paper presents a novel framework for goal-oriented semantic communication, leveraging relative representations to mitigate semantic mismatches via latent space alignment. We propose a dynamic optimization strategy that adapts relative representations, communication parameters, and computation resources for energy-efficient, low-latency, goal-oriented semantic communications. Numerical results demonstrate our methodology's effectiveness in mitigating
&lt;/p&gt;</description></item></channel></rss>