<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;5/2&#38454;&#21644;7/2&#38454;$L^2$-&#20934;&#30830;&#30340;&#38543;&#26426;Runge-Kutta-Nystr\"om&#26041;&#27861;&#65292;&#29992;&#20110;&#36817;&#20284;&#24213;&#23618;&#30340;&#21704;&#23494;&#39039;&#27969;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#22312;&#39640;&#32500;&#30446;&#26631;&#20998;&#24067;&#20013;&#30340;&#21331;&#36234;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.07399</link><description>&lt;p&gt;
&#38543;&#26426;Runge-Kutta-Nystr\"om&#26041;&#27861;&#22312;&#38750;&#21487;&#36870;&#39532;&#23572;&#31185;&#22827;&#38142;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Randomized Runge-Kutta-Nystr\"om. (arXiv:2310.07399v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;5/2&#38454;&#21644;7/2&#38454;$L^2$-&#20934;&#30830;&#30340;&#38543;&#26426;Runge-Kutta-Nystr\"om&#26041;&#27861;&#65292;&#29992;&#20110;&#36817;&#20284;&#24213;&#23618;&#30340;&#21704;&#23494;&#39039;&#27969;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#22312;&#39640;&#32500;&#30446;&#26631;&#20998;&#24067;&#20013;&#30340;&#21331;&#36234;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;5/2&#38454;&#21644;7/2&#38454;$L^2$-&#20934;&#30830;&#30340;&#38543;&#26426;Runge-Kutta-Nystr\"om&#26041;&#27861;&#65292;&#29992;&#20110;&#36817;&#20284;&#24213;&#23618;&#30340;&#21704;&#23494;&#39039;&#27969;&#65292;&#21253;&#25324;&#19981;&#35843;&#25972;&#30340;&#21704;&#23494;&#39039;&#33945;&#29305;&#21345;&#27931;&#21644;&#19981;&#35843;&#25972;&#30340;&#21160;&#21147;&#23398;&#26391;&#20043;&#19975;&#38142;&#12290;&#36890;&#36807;&#22312;&#21183;&#33021;&#20989;&#25968;&#30340;&#26799;&#24230;&#21644;&#28023;&#26862;&#30697;&#38453;&#30340;Lipschitz&#20551;&#35774;&#19979;&#25552;&#20379;&#20102;&#37327;&#21270;&#30340;5/2&#38454;$L^2$-&#20934;&#30830;&#24230;&#19978;&#38480;&#12290;&#23545;&#20110;&#19968;&#20123;&#8220;&#33391;&#22909;&#34892;&#20026;&#8221;&#30340;&#39640;&#32500;&#30446;&#26631;&#20998;&#24067;&#65292;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#23545;&#24212;&#30340;&#39532;&#23572;&#31185;&#22827;&#38142;&#34920;&#29616;&#20986;&#24456;&#39640;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present 5/2- and 7/2-order $L^2$-accurate randomized Runge-Kutta-Nystr\"om methods to approximate the Hamiltonian flow underlying various non-reversible Markov chain Monte Carlo chains including unadjusted Hamiltonian Monte Carlo and unadjusted kinetic Langevin chains. Quantitative 5/2-order $L^2$-accuracy upper bounds are provided under gradient and Hessian Lipschitz assumptions on the potential energy function. The superior complexity of the corresponding Markov chains is numerically demonstrated for a selection of `well-behaved', high-dimensional target distributions.
&lt;/p&gt;</description></item></channel></rss>