<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#30740;&#31350;&#20171;&#32461;&#20102;&#23558;&#22522;&#20110;&#35268;&#33539;&#30340;&#31354;&#38388;&#34920;&#31034;&#36716;&#25442;&#20026;&#22522;&#20110;&#22270;&#30340;&#26102;&#31354;&#27969;&#34892;&#30149;&#23398;&#27169;&#22411;&#30340;&#26032;&#26694;&#26550;&#21644;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.14539</link><description>&lt;p&gt;
&#23558;&#22522;&#20110;&#35268;&#33539;&#30340;&#31354;&#38388;&#34920;&#31034;&#36716;&#25442;&#20026;&#22522;&#20110;&#22270;&#30340;&#26102;&#31354;&#27969;&#34892;&#30149;&#23398;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Transforming Norm-based To Graph-based Spatial Representation for Spatio-Temporal Epidemiological Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14539
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20171;&#32461;&#20102;&#23558;&#22522;&#20110;&#35268;&#33539;&#30340;&#31354;&#38388;&#34920;&#31034;&#36716;&#25442;&#20026;&#22522;&#20110;&#22270;&#30340;&#26102;&#31354;&#27969;&#34892;&#30149;&#23398;&#27169;&#22411;&#30340;&#26032;&#26694;&#26550;&#21644;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30123;&#24773;&#22823;&#27969;&#34892;&#20197;&#20854;&#28145;&#36828;&#30340;&#31038;&#20250;&#21644;&#32463;&#27982;&#24433;&#21709;&#65292;&#23545;&#20840;&#29699;&#20581;&#24247;&#12289;&#27515;&#20129;&#29575;&#12289;&#32463;&#27982;&#31283;&#23450;&#24615;&#21644;&#25919;&#27835;&#26684;&#23616;&#26500;&#25104;&#37325;&#22823;&#23041;&#32961;&#12290;&#20026;&#20102;&#24212;&#23545;&#26032;&#20852;&#21644;&#20877;&#29616;&#30123;&#24773;&#24102;&#26469;&#30340;&#25345;&#32493;&#25361;&#25112;&#65292;&#35768;&#22810;&#30740;&#31350;&#37319;&#29992;&#26102;&#31354;&#27169;&#22411;&#26469;&#22686;&#24378;&#25105;&#20204;&#23545;&#36825;&#20123;&#22797;&#26434;&#29616;&#35937;&#30340;&#29702;&#35299;&#21644;&#31649;&#29702;&#12290;&#36825;&#20123;&#26102;&#31354;&#27169;&#22411;&#21487;&#20197;&#22823;&#33268;&#20998;&#20026;&#20004;&#31181;&#20027;&#35201;&#31354;&#38388;&#31867;&#21035;&#65306;&#22522;&#20110;&#35268;&#33539;&#21644;&#22522;&#20110;&#22270;&#30340;&#27169;&#22411;&#65292;&#22312;&#20934;&#30830;&#24615;&#12289;&#35745;&#31639;&#36127;&#25285;&#21644;&#21487;&#34920;&#31034;&#24615;&#20043;&#38388;&#36827;&#34892;&#26435;&#34913;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#23558;&#36825;&#20123;&#27169;&#22411;&#20174;&#22522;&#20110;&#35268;&#33539;&#36716;&#25442;&#20026;&#22522;&#20110;&#22270;&#30340;&#31354;&#38388;&#34920;&#31034;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#20197;&#21450;&#20351;&#29992;&#24191;&#27867;&#30340;&#21551;&#21457;&#24335;&#20248;&#21270;&#26041;&#27861;&#30340;&#21313;&#20108;&#31181;&#21487;&#33021;&#23454;&#29616;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#36890;&#36807;&#21033;&#29992;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#25311;&#21644;&#21551;&#21457;&#24335;&#31639;&#27861;&#26469;&#23454;&#29616;&#22270;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14539v1 Announce Type: new  Abstract: Pandemics, with their profound societal and economic impacts, pose significant threats to global health, mortality rates, economic stability, and political landscapes. In response to the persistent challenges posed by emerging and reemerging pandemics, numerous studies have employed spatio-temporal models to enhance our understanding and management of these complex phenomena. These spatio-temporal models can be roughly divided into two main spatial categories: norm-based and graph-based trade-offering between accuracy, computational burden, and representational feasibility. In this study, we explore the ability to transform from norm-based to graph-based spatial representation for these models. We introduce a novel framework for this task together with twelve possible implementations using a wide range of heuristic optimization approaches. Our findings show that by leveraging agent-based simulations and heuristic algorithms for the graph
&lt;/p&gt;</description></item></channel></rss>