<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#30340;&#26032;&#22411;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#26694;&#26550;&#65292;&#26080;&#38656;&#26631;&#35760;&#25968;&#25454;&#65292;&#22312;&#25628;&#32034;&#36807;&#31243;&#20013;&#20351;&#29992;&#22270;&#20687;&#37325;&#24314;&#20219;&#21153;&#20195;&#26367;&#30417;&#30563;&#23398;&#20064;&#30446;&#26631;&#65292;&#20855;&#26377;&#40065;&#26834;&#24615;&#12289;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#22810;&#23610;&#24230;&#35299;&#30721;&#22120;&#35299;&#20915;&#20102;&#24615;&#33021;&#23849;&#28291;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2311.12086</link><description>&lt;p&gt;
&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#26159;&#40065;&#26834;&#30340;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#23398;&#20064;&#22120;
&lt;/p&gt;
&lt;p&gt;
Masked Autoencoders Are Robust Neural Architecture Search Learners
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.12086
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#30340;&#26032;&#22411;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#26694;&#26550;&#65292;&#26080;&#38656;&#26631;&#35760;&#25968;&#25454;&#65292;&#22312;&#25628;&#32034;&#36807;&#31243;&#20013;&#20351;&#29992;&#22270;&#20687;&#37325;&#24314;&#20219;&#21153;&#20195;&#26367;&#30417;&#30563;&#23398;&#20064;&#30446;&#26631;&#65292;&#20855;&#26377;&#40065;&#26834;&#24615;&#12289;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#22810;&#23610;&#24230;&#35299;&#30721;&#22120;&#35299;&#20915;&#20102;&#24615;&#33021;&#23849;&#28291;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#65288;NAS&#65289;&#30446;&#21069;&#20005;&#37325;&#20381;&#36182;&#26631;&#35760;&#25968;&#25454;&#65292;&#32780;&#33719;&#21462;&#26631;&#35760;&#25968;&#25454;&#26082;&#26114;&#36149;&#21448;&#32791;&#26102;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#65288;MAE&#65289;&#30340;&#26032;&#22411;NAS&#26694;&#26550;&#65292;&#23427;&#22312;&#25628;&#32034;&#36807;&#31243;&#20013;&#28040;&#38500;&#20102;&#23545;&#26631;&#35760;&#25968;&#25454;&#30340;&#38656;&#27714;&#12290;&#36890;&#36807;&#23558;&#30417;&#30563;&#23398;&#20064;&#30446;&#26631;&#26367;&#25442;&#20026;&#22270;&#20687;&#37325;&#24314;&#20219;&#21153;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#24471;&#33021;&#22815;&#22312;&#19981;&#25439;&#23475;&#24615;&#33021;&#21644;&#27867;&#21270;&#33021;&#21147;&#30340;&#24773;&#20917;&#19979;&#40065;&#26834;&#22320;&#21457;&#29616;&#32593;&#32476;&#26550;&#26500;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#22810;&#23610;&#24230;&#35299;&#30721;&#22120;&#35299;&#20915;&#20102;&#22312;&#26080;&#30417;&#30563;&#33539;&#24335;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#21487;&#24494;&#26550;&#26500;&#25628;&#32034;&#65288;DARTS&#65289;&#26041;&#27861;&#36935;&#21040;&#30340;&#24615;&#33021;&#23849;&#28291;&#38382;&#39064;&#12290;&#36890;&#36807;&#22312;&#21508;&#31181;&#25628;&#32034;&#31354;&#38388;&#21644;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#22823;&#37327;&#23454;&#39564;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#21644;&#40065;&#26834;&#24615;&#65292;&#20026;&#20854;&#32988;&#36807;&#22522;&#20934;&#26041;&#27861;&#25552;&#20379;&#20102;&#23454;&#35777;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.12086v2 Announce Type: replace  Abstract: Neural Architecture Search (NAS) currently relies heavily on labeled data, which is both expensive and time-consuming to acquire. In this paper, we propose a novel NAS framework based on Masked Autoencoders (MAE) that eliminates the need for labeled data during the search process. By replacing the supervised learning objective with an image reconstruction task, our approach enables the robust discovery of network architectures without compromising performance and generalization ability. Additionally, we address the problem of performance collapse encountered in the widely-used Differentiable Architecture Search (DARTS) method in the unsupervised paradigm by introducing a multi-scale decoder. Through extensive experiments conducted on various search spaces and datasets, we demonstrate the effectiveness and robustness of the proposed method, providing empirical evidence of its superiority over baseline approaches.
&lt;/p&gt;</description></item></channel></rss>