<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#30340;&#22522;&#20110;&#22270;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;6G&#23376;&#32593;&#32476;&#20013;&#36827;&#34892;&#23376;&#39057;&#24102;&#20998;&#37197;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20248;&#21270;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#23376;&#39057;&#24102;&#20998;&#37197;&#65292;&#23454;&#29616;&#20102;&#19982;&#38598;&#20013;&#24335;&#36138;&#23146;&#30528;&#33394;&#23376;&#39057;&#24102;&#20998;&#37197;&#26041;&#27861;&#30456;&#36817;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#20855;&#26377;&#26356;&#20302;&#30340;&#35745;&#31639;&#26102;&#38388;&#22797;&#26434;&#24230;&#21644;&#36739;&#23567;&#30340;&#20449;&#20196;&#24320;&#38144;&#12290;</title><link>http://arxiv.org/abs/2401.00950</link><description>&lt;p&gt;
&#26080;&#30417;&#30563;&#30340;&#22522;&#20110;&#22270;&#30340;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;6G&#23376;&#32593;&#32476;&#30340;&#23376;&#39057;&#24102;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Unsupervised Graph-based Learning Method for Sub-band Allocation in 6G Subnetworks. (arXiv:2401.00950v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.00950
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#30340;&#22522;&#20110;&#22270;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;6G&#23376;&#32593;&#32476;&#20013;&#36827;&#34892;&#23376;&#39057;&#24102;&#20998;&#37197;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20248;&#21270;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#23376;&#39057;&#24102;&#20998;&#37197;&#65292;&#23454;&#29616;&#20102;&#19982;&#38598;&#20013;&#24335;&#36138;&#23146;&#30528;&#33394;&#23376;&#39057;&#24102;&#20998;&#37197;&#26041;&#27861;&#30456;&#36817;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#20855;&#26377;&#26356;&#20302;&#30340;&#35745;&#31639;&#26102;&#38388;&#22797;&#26434;&#24230;&#21644;&#36739;&#23567;&#30340;&#20449;&#20196;&#24320;&#38144;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#30340;&#22522;&#20110;&#22270;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#26080;&#32447;&#32593;&#32476;&#20013;&#36827;&#34892;&#39057;&#29575;&#23376;&#24102;&#20998;&#37197;&#12290;&#25105;&#20204;&#32771;&#34385;&#22312;&#24037;&#21378;&#29615;&#22659;&#20013;&#23494;&#38598;&#37096;&#32626;&#30340;&#23376;&#32593;&#32476;&#65292;&#36825;&#20123;&#23376;&#32593;&#32476;&#21482;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#23376;&#39057;&#24102;&#65292;&#24517;&#39035;&#34987;&#20248;&#21270;&#22320;&#20998;&#37197;&#20197;&#21327;&#35843;&#23376;&#32593;&#32476;&#38388;&#30340;&#24178;&#25200;&#12290;&#25105;&#20204;&#23558;&#23376;&#32593;&#32476;&#37096;&#32626;&#24314;&#27169;&#20026;&#19968;&#20010;&#20914;&#31361;&#22270;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#21040;&#22270;&#30528;&#33394;&#21551;&#21457;&#21644;Potts&#27169;&#22411;&#30340;&#26080;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#20248;&#21270;&#23376;&#39057;&#24102;&#20998;&#37197;&#12290;&#25968;&#20540;&#35780;&#20272;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#36739;&#20302;&#30340;&#35745;&#31639;&#26102;&#38388;&#22797;&#26434;&#24230;&#19979;&#65292;&#23454;&#29616;&#20102;&#19982;&#38598;&#20013;&#24335;&#36138;&#23146;&#30528;&#33394;&#23376;&#39057;&#24102;&#20998;&#37197;&#21551;&#21457;&#24335;&#26041;&#27861;&#25509;&#36817;&#30340;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#19982;&#38656;&#35201;&#25152;&#26377;&#20114;&#30456;&#24178;&#25200;&#30340;&#20449;&#36947;&#20449;&#24687;&#30340;&#36845;&#20195;&#20248;&#21270;&#21551;&#21457;&#24335;&#30456;&#27604;&#65292;&#23427;&#20135;&#29983;&#26356;&#23569;&#30340;&#20449;&#20196;&#24320;&#38144;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#35813;&#26041;&#27861;&#23545;&#19981;&#21516;&#30340;&#32593;&#32476;&#35774;&#32622;&#20855;&#26377;&#20581;&#22766;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we present an unsupervised approach for frequency sub-band allocation in wireless networks using graph-based learning. We consider a dense deployment of subnetworks in the factory environment with a limited number of sub-bands which must be optimally allocated to coordinate inter-subnetwork interference. We model the subnetwork deployment as a conflict graph and propose an unsupervised learning approach inspired by the graph colouring heuristic and the Potts model to optimize the sub-band allocation using graph neural networks. The numerical evaluation shows that the proposed method achieves close performance to the centralized greedy colouring sub-band allocation heuristic with lower computational time complexity. In addition, it incurs reduced signalling overhead compared to iterative optimization heuristics that require all the mutual interfering channel information. We further demonstrate that the method is robust to different network settings.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#22522;&#20110;&#27969;&#23548;&#21521;&#32435;&#31859;&#23450;&#20301;&#30340;&#35774;&#35745;&#31354;&#38388;&#65292;&#32771;&#34385;&#20102;&#33021;&#28304;&#21644;&#20449;&#21495;&#34928;&#20943;&#31561;&#22240;&#32032;&#65292;&#20026;&#36825;&#19968;&#26032;&#20852;&#39046;&#22495;&#25552;&#20379;&#20102;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2305.18493</link><description>&lt;p&gt;
&#22522;&#20110;&#27969;&#23548;&#21521;&#32435;&#31859;&#23450;&#20301;&#30340;&#35774;&#35745;&#31354;&#38388;&#25506;&#32034;&#30340;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
Insights from the Design Space Exploration of Flow-Guided Nanoscale Localization. (arXiv:2305.18493v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18493
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22522;&#20110;&#27969;&#23548;&#21521;&#32435;&#31859;&#23450;&#20301;&#30340;&#35774;&#35745;&#31354;&#38388;&#65292;&#32771;&#34385;&#20102;&#33021;&#28304;&#21644;&#20449;&#21495;&#34928;&#20943;&#31561;&#22240;&#32032;&#65292;&#20026;&#36825;&#19968;&#26032;&#20852;&#39046;&#22495;&#25552;&#20379;&#20102;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#22826;&#36203;&#20857;&#26080;&#32447;&#36890;&#20449;&#33021;&#21147;&#30340;&#32435;&#31859;&#35774;&#22791;&#20026;&#22312;&#20154;&#31867;&#34880;&#28082;&#20013;&#36827;&#34892;&#27969;&#23548;&#21521;&#23450;&#20301;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;&#27492;&#31867;&#23450;&#20301;&#20351;&#24471;&#23558;&#25152;&#24863;&#21463;&#21040;&#30340;&#20107;&#20214;&#30340;&#20301;&#32622;&#19982;&#20107;&#20214;&#26412;&#36523;&#36827;&#34892;&#21305;&#37197;&#25104;&#20026;&#21487;&#33021;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#31934;&#20934;&#21307;&#30103;&#26041;&#38754;&#30340;&#26089;&#26399;&#21644;&#31934;&#20934;&#35786;&#26029;&#12289;&#38477;&#20302;&#25104;&#26412;&#21644;&#20405;&#20837;&#24615;&#12290;&#27969;&#23548;&#21521;&#23450;&#20301;&#20173;&#22788;&#20110;&#21407;&#22987;&#38454;&#27573;&#65292;&#21482;&#26377;&#23569;&#25968;&#35770;&#25991;&#28041;&#21450;&#27492;&#38382;&#39064;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#25152;&#25552;&#20986;&#35299;&#20915;&#26041;&#26696;&#30340;&#24615;&#33021;&#35780;&#20272;&#20173;&#28982;&#20197;&#38750;&#26631;&#20934;&#21270;&#30340;&#26041;&#24335;&#36827;&#34892;&#65292;&#36890;&#24120;&#21482;&#32771;&#34385;&#21333;&#19968;&#30340;&#24615;&#33021;&#25351;&#26631;&#65292;&#24182;&#24573;&#30053;&#20102;&#22312;&#36825;&#31181;&#35268;&#27169;&#65288;&#20363;&#22914;&#65292;&#32435;&#31859;&#22120;&#20214;&#30340;&#33021;&#37327;&#21463;&#38480;&#65289;&#21644;&#23545;&#20110;&#36825;&#31181;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#29615;&#22659;&#65288;&#20363;&#22914;&#65292;&#20307;&#20869;&#22826;&#36203;&#20857;&#20256;&#25773;&#30340;&#20005;&#37325;&#34928;&#20943;&#65289;&#19979;&#30456;&#20851;&#30340;&#21508;&#20010;&#26041;&#38754;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#35780;&#20272;&#20855;&#26377;&#20302;&#27700;&#24179;&#30340;&#30495;&#23454;&#24615;&#65292;&#24182;&#19988;&#26080;&#27861;&#20197;&#23458;&#35266;&#30340;&#26041;&#24335;&#36827;&#34892;&#27604;&#36739;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20256;&#36755;&#33021;&#37327;&#28040;&#32791;&#21644;&#20449;&#21495;&#34928;&#20943;&#65292;&#23545;&#27969;&#23548;&#21521;&#32435;&#31859;&#23450;&#20301;&#30340;&#35774;&#35745;&#31354;&#38388;&#36827;&#34892;&#20102;&#25506;&#32034;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#32771;&#34385;&#20102;&#21508;&#31181;&#24615;&#33021;&#25351;&#26631;&#65288;&#20363;&#22914;&#33021;&#37327;&#28040;&#32791;&#21644;&#23450;&#20301;&#31934;&#24230;&#65289;&#21644;&#25361;&#25112;&#65288;&#20363;&#22914;&#36523;&#20307;&#36816;&#21160;&#21644;&#34880;&#21387;&#65289;&#65292;&#23548;&#33268;&#25105;&#20204;&#21487;&#20197;&#20026;&#36825;&#20010;&#26032;&#20852;&#39046;&#22495;&#25552;&#20379;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nanodevices with Terahertz (THz)-based wireless communication capabilities are providing a primer for flow-guided localization within the human bloodstreams. Such localization is allowing for assigning the locations of sensed events with the events themselves, providing benefits in precision medicine along the lines of early and precise diagnostics, and reduced costs and invasiveness. Flow-guided localization is still in a rudimentary phase, with only a handful of works targeting the problem. Nonetheless, the performance assessments of the proposed solutions are already carried out in a non-standardized way, usually along a single performance metric, and ignoring various aspects that are relevant at such a scale (e.g., nanodevices' limited energy) and for such a challenging environment (e.g., extreme attenuation of in-body THz propagation). As such, these assessments feature low levels of realism and cannot be compared in an objective way. Toward addressing this issue, we account for t
&lt;/p&gt;</description></item></channel></rss>