<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>netFound&#26159;&#19968;&#20010;&#22522;&#20110;&#33258;&#25105;&#30417;&#30563;&#31639;&#27861;&#30340;&#22522;&#30784;&#27169;&#22411;&#65292;&#29992;&#20110;&#32593;&#32476;&#23433;&#20840;&#39046;&#22495;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#39044;&#35757;&#32451;&#25429;&#25417;&#32593;&#32476;&#27969;&#37327;&#30340;&#23618;&#27425;&#21270;&#21644;&#22810;&#27169;&#24577;&#23646;&#24615;&#65292;&#24182;&#33021;&#22815;&#22312;&#36136;&#37327;&#20302;&#12289;&#26377;&#38480;&#21644;&#22024;&#26434;&#30340;&#25968;&#25454;&#24773;&#20917;&#19979;&#36827;&#34892;&#24494;&#35843;&#12290;</title><link>http://arxiv.org/abs/2310.17025</link><description>&lt;p&gt;
netFound: &#32593;&#32476;&#23433;&#20840;&#30340;&#22522;&#30784;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
netFound: Foundation Model for Network Security. (arXiv:2310.17025v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17025
&lt;/p&gt;
&lt;p&gt;
netFound&#26159;&#19968;&#20010;&#22522;&#20110;&#33258;&#25105;&#30417;&#30563;&#31639;&#27861;&#30340;&#22522;&#30784;&#27169;&#22411;&#65292;&#29992;&#20110;&#32593;&#32476;&#23433;&#20840;&#39046;&#22495;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#39044;&#35757;&#32451;&#25429;&#25417;&#32593;&#32476;&#27969;&#37327;&#30340;&#23618;&#27425;&#21270;&#21644;&#22810;&#27169;&#24577;&#23646;&#24615;&#65292;&#24182;&#33021;&#22815;&#22312;&#36136;&#37327;&#20302;&#12289;&#26377;&#38480;&#21644;&#22024;&#26434;&#30340;&#25968;&#25454;&#24773;&#20917;&#19979;&#36827;&#34892;&#24494;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32593;&#32476;&#23433;&#20840;&#30340;&#26426;&#22120;&#23398;&#20064;&#39046;&#22495;&#65292;&#20256;&#32479;&#24037;&#20316;&#27969;&#20381;&#36182;&#20110;&#39640;&#36136;&#37327;&#26631;&#35760;&#25968;&#25454;&#21644;&#25163;&#21160;&#29305;&#24449;&#24037;&#31243;&#65292;&#20294;&#26377;&#38480;&#30340;&#25968;&#25454;&#38598;&#21644;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#38459;&#30861;&#20102;&#29305;&#24449;&#36873;&#25321;&#65292;&#23548;&#33268;&#27169;&#22411;&#38590;&#20197;&#25429;&#25417;&#20851;&#38190;&#20851;&#31995;&#21644;&#26377;&#25928;&#27867;&#21270;&#12290;&#21463;&#21040;GPT-4&#21644;Vision Transformers&#31561;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;netFound&#65292;&#19968;&#20010;&#32593;&#32476;&#23433;&#20840;&#30340;&#22522;&#30784;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21033;&#29992;&#33258;&#25105;&#30417;&#30563;&#31639;&#27861;&#23545;&#29616;&#26377;&#30340;&#26410;&#26631;&#35760;&#32593;&#32476;&#25968;&#25454;&#21253;&#36827;&#34892;&#39044;&#35757;&#32451;&#12290;netFound&#30340;&#35774;&#35745;&#34701;&#21512;&#20102;&#32593;&#32476;&#27969;&#37327;&#30340;&#23618;&#27425;&#21270;&#21644;&#22810;&#27169;&#24577;&#23646;&#24615;&#65292;&#26377;&#25928;&#25429;&#25417;&#20102;&#38544;&#34255;&#30340;&#32593;&#32476;&#19978;&#19979;&#25991;&#65292;&#21253;&#25324;&#24212;&#29992;&#36923;&#36753;&#12289;&#36890;&#20449;&#21327;&#35758;&#21644;&#32593;&#32476;&#26465;&#20214;&#12290;&#26377;&#20102;&#36825;&#20010;&#39044;&#35757;&#32451;&#22522;&#30784;&#65292;&#21363;&#20351;&#22788;&#29702;&#36136;&#37327;&#20302;&#12289;&#26377;&#38480;&#21644;&#22024;&#26434;&#30340;&#26631;&#35760;&#25968;&#25454;&#65292;&#25105;&#20204;&#20063;&#21487;&#20197;&#23545;netFound&#36827;&#34892;&#24494;&#35843;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#19979;&#28216;&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;netFound&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In ML for network security, traditional workflows rely on high-quality labeled data and manual feature engineering, but limited datasets and human expertise hinder feature selection, leading to models struggling to capture crucial relationships and generalize effectively. Inspired by recent advancements in ML application domains like GPT-4 and Vision Transformers, we have developed netFound, a foundational model for network security. This model undergoes pre-training using self-supervised algorithms applied to readily available unlabeled network packet traces. netFound's design incorporates hierarchical and multi-modal attributes of network traffic, effectively capturing hidden networking contexts, including application logic, communication protocols, and network conditions.  With this pre-trained foundation in place, we can fine-tune netFound for a wide array of downstream tasks, even when dealing with low-quality, limited, and noisy labeled data. Our experiments demonstrate netFound'
&lt;/p&gt;</description></item></channel></rss>