<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#20351;&#29992;&#31639;&#23376;&#25512;&#26029;&#23398;&#20064;&#30340;&#38477;&#38454;&#27169;&#22411;&#22312;&#36807;&#31243;&#24037;&#31243;&#20013;&#24314;&#27169;&#21160;&#24577;&#31995;&#32479;&#65292;&#20026;&#23454;&#29616;&#24555;&#36895;&#21487;&#38752;&#30340;&#25968;&#23383;&#23402;&#29983;&#26550;&#26500;&#36808;&#20986;&#37325;&#35201;&#19968;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.17698</link><description>&lt;p&gt;
&#22312;&#36807;&#31243;&#24037;&#31243;&#20013;&#20351;&#29992;&#31639;&#23376;&#25512;&#26029;&#23398;&#20064;&#38477;&#38454;&#20108;&#27425;-&#32447;&#24615;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Learning reduced-order Quadratic-Linear models in Process Engineering using Operator Inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17698
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#31639;&#23376;&#25512;&#26029;&#23398;&#20064;&#30340;&#38477;&#38454;&#27169;&#22411;&#22312;&#36807;&#31243;&#24037;&#31243;&#20013;&#24314;&#27169;&#21160;&#24577;&#31995;&#32479;&#65292;&#20026;&#23454;&#29616;&#24555;&#36895;&#21487;&#38752;&#30340;&#25968;&#23383;&#23402;&#29983;&#26550;&#26500;&#36808;&#20986;&#37325;&#35201;&#19968;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#22312;&#36807;&#31243;&#24037;&#31243;&#20013;&#39640;&#25928;&#24314;&#27169;&#21160;&#24577;&#31995;&#32479;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#20351;&#29992;&#38477;&#38454;&#27169;&#22411;&#23398;&#20064;&#65292;&#20855;&#20307;&#26469;&#35828;&#26159;&#31639;&#23376;&#25512;&#26029;&#12290;&#36825;&#26159;&#19968;&#31181;&#38750;&#20405;&#20837;&#24335;&#12289;&#25968;&#25454;&#39537;&#21160;&#30340;&#20174;&#26102;&#22495;&#25968;&#25454;&#23398;&#20064;&#21160;&#24577;&#31995;&#32479;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24212;&#29992;&#26159;&#20108;&#27687;&#21270;&#30899;&#30002;&#28919;&#21270;&#21453;&#24212;&#65292;&#36825;&#26159;&#30005;&#21147;&#36716;&#21270;&#25216;&#26415;&#26694;&#26550;&#20013;&#30340;&#37325;&#35201;&#21453;&#24212;&#65292;&#20197;&#23637;&#31034;&#20854;&#28508;&#21147;&#12290;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#65292;&#29992;&#31639;&#23376;&#25512;&#26029;&#26500;&#24314;&#30340;&#38477;&#38454;&#27169;&#22411;&#33021;&#22815;&#25552;&#20379;&#19968;&#20010;&#31616;&#21270;&#20294;&#20934;&#30830;&#30340;&#26367;&#20195;&#35299;&#20915;&#26041;&#26696;&#12290;&#36825;&#26631;&#24535;&#30528;&#23454;&#29616;&#24555;&#36895;&#21487;&#38752;&#25968;&#23383;&#23402;&#29983;&#26550;&#26500;&#30340;&#37325;&#35201;&#37324;&#31243;&#30865;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17698v1 Announce Type: cross  Abstract: In this work, we address the challenge of efficiently modeling dynamical systems in process engineering. We use reduced-order model learning, specifically operator inference. This is a non-intrusive, data-driven method for learning dynamical systems from time-domain data. The application in our study is carbon dioxide methanation, an important reaction within the Power-to-X framework, to demonstrate its potential. The numerical results show the ability of the reduced-order models constructed with operator inference to provide a reduced yet accurate surrogate solution. This represents an important milestone towards the implementation of fast and reliable digital twin architectures.
&lt;/p&gt;</description></item></channel></rss>