<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#26102;&#38388;&#27010;&#29575;&#25968;&#20540;ODE&#27714;&#35299;&#22120;&#65292;&#36890;&#36807;&#23558;&#25968;&#20540;&#27169;&#25311;&#38382;&#39064;&#35270;&#20026;&#36125;&#21494;&#26031;&#29366;&#24577;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;&#36125;&#21494;&#26031;&#28388;&#27874;&#21644;&#24179;&#28369;&#30340;&#26694;&#26550;&#65292;&#23454;&#29616;&#20102;&#22312;&#24182;&#34892;&#22788;&#29702;&#25152;&#26377;&#26102;&#38388;&#27493;&#39588;&#30340;&#21516;&#26102;&#23558;&#26102;&#38388;&#24320;&#38144;&#38477;&#20302;&#21040;&#23545;&#25968;&#32423;&#21035;&#12290;</title><link>http://arxiv.org/abs/2310.01145</link><description>&lt;p&gt;
&#24182;&#34892;&#26102;&#38388;&#27010;&#29575;&#25968;&#20540;ODE&#27714;&#35299;&#22120;
&lt;/p&gt;
&lt;p&gt;
Parallel-in-Time Probabilistic Numerical ODE Solvers. (arXiv:2310.01145v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01145
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#26102;&#38388;&#27010;&#29575;&#25968;&#20540;ODE&#27714;&#35299;&#22120;&#65292;&#36890;&#36807;&#23558;&#25968;&#20540;&#27169;&#25311;&#38382;&#39064;&#35270;&#20026;&#36125;&#21494;&#26031;&#29366;&#24577;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;&#36125;&#21494;&#26031;&#28388;&#27874;&#21644;&#24179;&#28369;&#30340;&#26694;&#26550;&#65292;&#23454;&#29616;&#20102;&#22312;&#24182;&#34892;&#22788;&#29702;&#25152;&#26377;&#26102;&#38388;&#27493;&#39588;&#30340;&#21516;&#26102;&#23558;&#26102;&#38388;&#24320;&#38144;&#38477;&#20302;&#21040;&#23545;&#25968;&#32423;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#24120;&#24494;&#20998;&#26041;&#31243;(ODE)&#30340;&#27010;&#29575;&#25968;&#20540;&#27714;&#35299;&#22120;&#23558;&#21160;&#21147;&#31995;&#32479;&#30340;&#25968;&#20540;&#20223;&#30495;&#38382;&#39064;&#35270;&#20026;&#36125;&#21494;&#26031;&#29366;&#24577;&#20272;&#35745;&#38382;&#39064;&#12290;&#38500;&#20102;&#29983;&#25104;ODE&#35299;&#30340;&#21518;&#39564;&#20998;&#24067;&#24182;&#22240;&#27492;&#37327;&#21270;&#26041;&#27861;&#26412;&#36523;&#30340;&#25968;&#20540;&#36924;&#36817;&#35823;&#24046;&#20043;&#22806;&#65292;&#36825;&#31181;&#24418;&#24335;&#21270;&#26041;&#27861;&#30340;&#19968;&#20010;&#19981;&#24120;&#34987;&#27880;&#24847;&#21040;&#30340;&#20248;&#21183;&#26159;&#36890;&#36807;&#22312;&#36125;&#21494;&#26031;&#28388;&#27874;&#21644;&#24179;&#28369;&#30340;&#26694;&#26550;&#20013;&#36827;&#34892;&#25968;&#20540;&#27169;&#25311;&#32780;&#33719;&#24471;&#30340;&#31639;&#27861;&#28789;&#27963;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#36825;&#31181;&#28789;&#27963;&#24615;&#65292;&#22522;&#20110;&#26102;&#38388;&#24182;&#34892;&#36845;&#20195;&#25193;&#23637;&#21345;&#23572;&#26364;&#24179;&#28369;&#22120;&#30340;&#20844;&#24335;&#21270;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#26102;&#38388;&#27010;&#29575;&#25968;&#20540;ODE&#27714;&#35299;&#22120;&#12290;&#19982;&#24403;&#21069;&#30340;&#27010;&#29575;&#27714;&#35299;&#22120;&#20381;&#27425;&#25353;&#26102;&#38388;&#39034;&#24207;&#27169;&#25311;&#21160;&#21147;&#31995;&#32479;&#19981;&#21516;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20197;&#24182;&#34892;&#26041;&#24335;&#22788;&#29702;&#25152;&#26377;&#26102;&#38388;&#27493;&#39588;&#65292;&#20174;&#32780;&#23558;&#26102;&#38388;&#24320;&#38144;&#20174;&#32447;&#24615;&#38477;&#20302;&#21040;&#23545;&#25968;&#32423;&#21035;&#30340;&#26102;&#38388;&#27493;&#39588;&#25968;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#22810;&#31181;&#38382;&#39064;&#19978;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Probabilistic numerical solvers for ordinary differential equations (ODEs) treat the numerical simulation of dynamical systems as problems of Bayesian state estimation. Aside from producing posterior distributions over ODE solutions and thereby quantifying the numerical approximation error of the method itself, one less-often noted advantage of this formalism is the algorithmic flexibility gained by formulating numerical simulation in the framework of Bayesian filtering and smoothing. In this paper, we leverage this flexibility and build on the time-parallel formulation of iterated extended Kalman smoothers to formulate a parallel-in-time probabilistic numerical ODE solver. Instead of simulating the dynamical system sequentially in time, as done by current probabilistic solvers, the proposed method processes all time steps in parallel and thereby reduces the span cost from linear to logarithmic in the number of time steps. We demonstrate the effectiveness of our approach on a variety o
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#65288;NIE&#65289;&#21644;&#33258;&#27880;&#24847;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#65288;ANIE&#65289;&#30340;&#26041;&#27861;&#65292;&#23427;&#20204;&#21487;&#20197;&#22312;&#26080;&#30417;&#30563;&#24773;&#20917;&#19979;&#36890;&#36807;&#23398;&#20064;&#25968;&#25454;&#20013;&#30340;&#31215;&#20998;&#31639;&#23376;&#36827;&#34892;&#27169;&#22411;&#24314;&#31435;&#65292;&#24182;&#19988;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#30340;ODE&#12289;PDE&#21644;IE&#31995;&#32479;&#20013;&#30340;&#22522;&#20934;&#20219;&#21153;&#19978;&#34920;&#29616;&#20986;&#36739;&#39640;&#30340;&#36895;&#24230;&#21644;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2209.15190</link><description>&lt;p&gt;
&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Neural Integral Equations. (arXiv:2209.15190v4 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.15190
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#65288;NIE&#65289;&#21644;&#33258;&#27880;&#24847;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243;&#65288;ANIE&#65289;&#30340;&#26041;&#27861;&#65292;&#23427;&#20204;&#21487;&#20197;&#22312;&#26080;&#30417;&#30563;&#24773;&#20917;&#19979;&#36890;&#36807;&#23398;&#20064;&#25968;&#25454;&#20013;&#30340;&#31215;&#20998;&#31639;&#23376;&#36827;&#34892;&#27169;&#22411;&#24314;&#31435;&#65292;&#24182;&#19988;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#30340;ODE&#12289;PDE&#21644;IE&#31995;&#32479;&#20013;&#30340;&#22522;&#20934;&#20219;&#21153;&#19978;&#34920;&#29616;&#20986;&#36739;&#39640;&#30340;&#36895;&#24230;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31215;&#20998;&#26041;&#31243; (IEs) &#26159;&#29992;&#20110;&#24314;&#27169;&#20855;&#26377;&#38750;&#23616;&#37096;&#30456;&#20114;&#20316;&#29992;&#30340;&#26102;&#31354;&#31995;&#32479;&#30340;&#26041;&#31243;&#12290;&#23427;&#20204;&#24050;&#32463;&#22312;&#29702;&#35770;&#21644;&#24212;&#29992;&#31185;&#23398;&#20013;&#25214;&#21040;&#20102;&#37325;&#35201;&#24212;&#29992;&#65292;&#21253;&#25324;&#29289;&#29702;&#23398;&#12289;&#21270;&#23398;&#12289;&#29983;&#29289;&#23398;&#21644;&#24037;&#31243;&#23398;&#12290;&#34429;&#28982;&#23384;&#22312;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#35299;&#20915;&#32473;&#23450;&#30340;IEs&#65292;&#20294;&#19981;&#23384;&#22312;&#21487;&#20197;&#20165;&#20174;&#25968;&#25454;&#20013;&#23398;&#20064;IE&#21644;&#20854;&#30456;&#20851;&#21160;&#24577;&#30340;&#26041;&#27861;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243; (NIE)&#65292;&#36825;&#31181;&#26041;&#27861;&#36890;&#36807;IE&#27714;&#35299;&#22120;&#20174;&#25968;&#25454;&#20013;&#23398;&#20064;&#26410;&#30693;&#30340;&#31215;&#20998;&#31639;&#23376;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#33258;&#27880;&#24847;&#31070;&#32463;&#31215;&#20998;&#26041;&#31243; (ANIE)&#65292;&#20854;&#20013;&#31215;&#20998;&#34987;&#33258;&#27880;&#24847;&#21147;&#26367;&#25442;&#65292;&#36825;&#25552;&#39640;&#20102;&#21487;&#25193;&#23637;&#24615;&#12289;&#23481;&#37327;&#65292;&#24182;&#20135;&#29983;&#20102;&#19968;&#20010;&#21487;&#35299;&#37322;&#30340;&#27169;&#22411;&#12290;&#25105;&#20204;&#35777;&#26126;(A)NIE&#22312;ODE&#12289;PDE&#21644;IE&#31995;&#32479;&#20013;&#30340;&#22810;&#20010;&#22522;&#20934;&#20219;&#21153;&#19978;&#30340;&#36895;&#24230;&#21644;&#20934;&#30830;&#24615;&#37117;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#24182;&#19988;&#36866;&#29992;&#20110;&#21512;&#25104;&#21644;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Integral equations (IEs) are equations that model spatiotemporal systems with non-local interactions. They have found important applications throughout theoretical and applied sciences, including in physics, chemistry, biology, and engineering. While efficient algorithms exist for solving given IEs, no method exists that can learn an IE and its associated dynamics from data alone. In this paper, we introduce Neural Integral Equations (NIE), a method that learns an unknown integral operator from data through an IE solver. We also introduce Attentional Neural Integral Equations (ANIE), where the integral is replaced by self-attention, which improves scalability, capacity, and results in an interpretable model. We demonstrate that (A)NIE outperforms other methods in both speed and accuracy on several benchmark tasks in ODE, PDE, and IE systems of synthetic and real-world data.
&lt;/p&gt;</description></item></channel></rss>