<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#36827;&#21270;&#26041;&#27861;&#30340;&#21333;&#26234;&#33021;&#20307;&#19982;&#22810;&#26234;&#33021;&#20307;&#31169;&#23494;&#20027;&#21160;&#24863;&#30693;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#20013;&#36827;&#34892;&#24322;&#24120;&#26816;&#27979;&#31034;&#20363;&#29992;&#20363;&#30340;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.10112</link><description>&lt;p&gt;
&#21333;&#26234;&#33021;&#20307;&#19982;&#22810;&#26234;&#33021;&#20307;&#30340;&#31169;&#23494;&#20027;&#21160;&#24863;&#30693;&#65306;&#28145;&#24230;&#31070;&#32463;&#36827;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Single- and Multi-Agent Private Active Sensing: A Deep Neuroevolution Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10112
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#36827;&#21270;&#26041;&#27861;&#30340;&#21333;&#26234;&#33021;&#20307;&#19982;&#22810;&#26234;&#33021;&#20307;&#31169;&#23494;&#20027;&#21160;&#24863;&#30693;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#20013;&#36827;&#34892;&#24322;&#24120;&#26816;&#27979;&#31034;&#20363;&#29992;&#20363;&#30340;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#23384;&#22312;&#31397;&#35270;&#32773;&#24773;&#20917;&#19979;&#30340;&#20027;&#21160;&#20551;&#35774;&#27979;&#35797;&#20013;&#30340;&#19968;&#20010;&#38598;&#20013;&#24335;&#38382;&#39064;&#21644;&#19968;&#20010;&#20998;&#25955;&#24335;&#38382;&#39064;&#12290;&#38024;&#23545;&#21253;&#25324;&#21333;&#20010;&#21512;&#27861;&#26234;&#33021;&#20307;&#30340;&#38598;&#20013;&#24335;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#31070;&#32463;&#36827;&#21270;&#65288;NE&#65289;&#30340;&#26032;&#26694;&#26550;&#65307;&#32780;&#38024;&#23545;&#20998;&#25955;&#24335;&#38382;&#39064;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;NE&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#21327;&#20316;&#22810;&#26234;&#33021;&#20307;&#20219;&#21153;&#65292;&#36825;&#31181;&#26041;&#27861;&#26377;&#36259;&#22320;&#20445;&#25345;&#20102;&#21333;&#19968;&#26234;&#33021;&#20307;NE&#30340;&#25152;&#26377;&#35745;&#31639;&#20248;&#21183;&#12290;&#36890;&#36807;&#23545;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#19978;&#24322;&#24120;&#26816;&#27979;&#31034;&#20363;&#29992;&#20363;&#20013;&#30340;&#25968;&#20540;&#23454;&#39564;&#65292;&#39564;&#35777;&#20102;&#25152;&#25552;&#20986;&#30340;EAHT&#26041;&#27861;&#20248;&#20110;&#20256;&#32479;&#30340;&#20027;&#21160;&#20551;&#35774;&#27979;&#35797;&#31574;&#30053;&#20197;&#21450;&#22522;&#20110;&#23398;&#20064;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10112v1 Announce Type: new  Abstract: In this paper, we focus on one centralized and one decentralized problem of active hypothesis testing in the presence of an eavesdropper. For the centralized problem including a single legitimate agent, we present a new framework based on NeuroEvolution (NE), whereas, for the decentralized problem, we develop a novel NE-based method for solving collaborative multi-agent tasks, which interestingly maintains all computational benefits of single-agent NE. The superiority of the proposed EAHT approaches over conventional active hypothesis testing policies, as well as learning-based methods, is validated through numerical investigations in an example use case of anomaly detection over wireless sensor networks.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#31070;&#32463;&#36827;&#21270;&#31639;&#27861;&#20248;&#21270;&#20154;&#24037;&#33008;&#33146;&#27835;&#30103;&#31574;&#30053;&#65292;&#20943;&#23569;&#31958;&#23615;&#30149;&#24739;&#32773;&#30340;&#34880;&#31958;&#20559;&#24046;&#65292;&#24182;&#19988;&#38477;&#20302;&#27880;&#23556;&#27425;&#25968;&#12290;</title><link>https://arxiv.org/abs/2402.07949</link><description>&lt;p&gt;
&#20248;&#21270;&#20154;&#24037;&#33008;&#33146;&#35774;&#35745;&#20197;&#25913;&#21892;&#31958;&#23615;&#30149;&#31649;&#29702;
&lt;/p&gt;
&lt;p&gt;
Optimizing the Design of an Artificial Pancreas to Improve Diabetes Management
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07949
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#31070;&#32463;&#36827;&#21270;&#31639;&#27861;&#20248;&#21270;&#20154;&#24037;&#33008;&#33146;&#27835;&#30103;&#31574;&#30053;&#65292;&#20943;&#23569;&#31958;&#23615;&#30149;&#24739;&#32773;&#30340;&#34880;&#31958;&#20559;&#24046;&#65292;&#24182;&#19988;&#38477;&#20302;&#27880;&#23556;&#27425;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31958;&#23615;&#30149;&#26159;&#19968;&#31181;&#24930;&#24615;&#30142;&#30149;&#65292;&#24433;&#21709;&#32654;&#22269;&#22659;&#20869;&#26377;3800&#19975;&#20154;&#65292;&#23427;&#20250;&#24433;&#21709;&#36523;&#20307;&#23558;&#39135;&#29289;&#36716;&#21270;&#20026;&#33021;&#37327;&#65288;&#21363;&#34880;&#31958;&#65289;&#30340;&#33021;&#21147;&#12290;&#26631;&#20934;&#30340;&#27835;&#30103;&#26041;&#27861;&#26159;&#36890;&#36807;&#20351;&#29992;&#20154;&#24037;&#33008;&#33146;&#65292;&#21363;&#25345;&#32493;&#33008;&#23707;&#32032;&#27893;&#65288;&#22522;&#30784;&#27880;&#23556;&#65289;&#65292;&#20197;&#21450;&#23450;&#26399;&#27880;&#23556;&#33008;&#23707;&#32032;&#65288;&#31361;&#21457;&#27880;&#23556;&#65289;&#26469;&#34917;&#20805;&#30899;&#27700;&#21270;&#21512;&#29289;&#25668;&#20837;&#37327;&#12290;&#27835;&#30103;&#30446;&#26631;&#26159;&#23558;&#34880;&#31958;&#20445;&#25345;&#22312;&#21487;&#25509;&#21463;&#33539;&#22260;&#30340;&#20013;&#24515;&#20301;&#32622;&#65292;&#36890;&#36807;&#25345;&#32493;&#34880;&#31958;&#27979;&#37327;&#26469;&#36827;&#34892;&#34913;&#37327;&#12290;&#27425;&#35201;&#30446;&#26631;&#26159;&#20943;&#23569;&#27880;&#23556;&#27425;&#25968;&#65292;&#22240;&#20026;&#23545;&#26576;&#20123;&#24739;&#32773;&#26469;&#35828;&#27880;&#23556;&#26159;&#19981;&#24841;&#24555;&#19988;&#38590;&#20197;&#23454;&#26045;&#30340;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#31070;&#32463;&#36827;&#21270;&#26469;&#21457;&#29616;&#27835;&#30103;&#30340;&#26368;&#20339;&#31574;&#30053;&#12290;&#22522;&#20110;30&#22825;&#30340;&#27835;&#30103;&#21644;&#21333;&#20010;&#24739;&#32773;&#30340;&#27979;&#37327;&#25968;&#25454;&#38598;&#65292;&#39318;&#20808;&#35757;&#32451;&#20102;&#38543;&#26426;&#26862;&#26519;&#26469;&#39044;&#27979;&#26410;&#26469;&#30340;&#34880;&#31958;&#27700;&#24179;&#12290;&#28982;&#21518;&#36890;&#36807;&#36827;&#21270;&#20102;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#26469;&#25351;&#23450;&#30899;&#27700;&#21270;&#21512;&#29289;&#25668;&#20837;&#37327;&#12289;&#22522;&#30784;&#27880;&#23556;&#27700;&#24179;&#21644;&#31361;&#21457;&#27880;&#23556;&#12290;&#36827;&#21270;&#21457;&#29616;&#20102;&#19968;&#20010;&#24085;&#32047;&#25176;&#21069;&#27839;&#65292;&#20943;&#23569;&#20102;&#19982;&#30446;&#26631;&#20540;&#30340;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Diabetes, a chronic condition that impairs how the body turns food into energy, i.e. blood glucose, affects 38 million people in the US alone. The standard treatment is to supplement carbohydrate intake with an artificial pancreas, i.e. a continuous insulin pump (basal shots), as well as occasional insulin injections (bolus shots). The goal of the treatment is to keep blood glucose at the center of an acceptable range, as measured through a continuous glucose meter. A secondary goal is to minimize injections, which are unpleasant and difficult for some patients to implement. In this study, neuroevolution was used to discover an optimal strategy for the treatment. Based on a dataset of 30 days of treatment and measurements of a single patient, a random forest was first trained to predict future glucose levels. A neural network was then evolved to prescribe carbohydrates, basal pumping levels, and bolus injections. Evolution discovered a Pareto front that reduced deviation from the targe
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#39062;&#30340;&#40065;&#26834;&#27169;&#24577;&#36830;&#25509;&#23548;&#21521;&#30340;&#23545;&#25239;&#24615;&#38450;&#24481;&#65292;&#23454;&#29616;&#31070;&#32463;&#32593;&#32476;&#23545;&#22810;&#26679;&#21270;$\ell_p$&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#65292;&#20854;&#20013;&#21253;&#25324;&#20004;&#20010;&#22522;&#20110;&#31181;&#32676;&#23398;&#20064;&#30340;&#23398;&#20064;&#38454;&#27573;&#12290;</title><link>http://arxiv.org/abs/2303.10225</link><description>&lt;p&gt;
&#22686;&#24378;&#31070;&#32463;&#32593;&#32476;&#23545;&#22810;&#26679;&#21270;$\ell_p$&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;:&#40065;&#26834;&#27169;&#24577;&#36830;&#25509;&#23548;&#21521;&#30340;&#23545;&#25239;&#24615;&#38450;&#24481;
&lt;/p&gt;
&lt;p&gt;
Robust Mode Connectivity-Oriented Adversarial Defense: Enhancing Neural Network Robustness Against Diversified $\ell_p$ Attacks. (arXiv:2303.10225v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10225
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#39062;&#30340;&#40065;&#26834;&#27169;&#24577;&#36830;&#25509;&#23548;&#21521;&#30340;&#23545;&#25239;&#24615;&#38450;&#24481;&#65292;&#23454;&#29616;&#31070;&#32463;&#32593;&#32476;&#23545;&#22810;&#26679;&#21270;$\ell_p$&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#65292;&#20854;&#20013;&#21253;&#25324;&#20004;&#20010;&#22522;&#20110;&#31181;&#32676;&#23398;&#20064;&#30340;&#23398;&#20064;&#38454;&#27573;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#25239;&#24615;&#40065;&#26834;&#24615;&#26159;&#34913;&#37327;&#31070;&#32463;&#32593;&#32476;&#22312;&#25512;&#29702;&#38454;&#27573;&#25269;&#24481;&#23545;&#25239;&#24615;&#25915;&#20987;&#33021;&#21147;&#30340;&#20851;&#38190;&#27010;&#24565;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#23613;&#31649;&#20351;&#29992;&#30340;&#24378;&#21270;&#40065;&#26834;&#24615;&#35757;&#32451;&#25216;&#26415;&#33021;&#22815;&#25552;&#39640;&#23545;&#19968;&#31181;&#31867;&#22411;&#30340;&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#65292;&#20294;&#27169;&#22411;&#20173;&#28982;&#23481;&#26131;&#21463;&#21040;&#22810;&#26679;&#21270;&#30340;$\ell_p$&#25915;&#20987;&#12290;&#20026;&#20102;&#23454;&#29616;&#22810;&#26679;&#21270;&#30340;$\ell_p$&#40065;&#26834;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#40065;&#26834;&#27169;&#24577;&#36830;&#25509; (RMC) &#23548;&#21521;&#30340;&#23545;&#25239;&#24615;&#38450;&#24481;&#65292;&#23427;&#21253;&#21547;&#20004;&#20010;&#22522;&#20110;&#31181;&#32676;&#23398;&#20064;&#30340;&#23398;&#20064;&#38454;&#27573;&#12290;&#31532;&#19968;&#20010;&#38454;&#27573;&#65292;RMC&#65292;&#33021;&#22815;&#25628;&#32034;&#20004;&#20010;&#39044;&#20808;&#35757;&#32451;&#27169;&#22411;&#20043;&#38388;&#30340;&#27169;&#22411;&#21442;&#25968;&#31354;&#38388;&#65292;&#24182;&#25214;&#21040;&#21253;&#21547;&#39640;&#40065;&#26834;&#24615;&#28857;&#30340;&#36335;&#24452;&#20197;&#25269;&#24481;&#22810;&#26679;&#21270;&#30340;$\ell_p$&#25915;&#20987;&#12290;&#22522;&#20110;RMC&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#31532;&#20108;&#20010;&#38454;&#27573;&#65292;&#22522;&#20110;RMC&#30340;&#20248;&#21270;&#65292;&#20854;&#20013;RMC&#20316;&#20026;&#31070;&#32463;&#32593;&#32476;&#22810;&#26679;&#21270;$\ell_p$&#40065;&#26834;&#24615;&#36827;&#19968;&#27493;&#22686;&#24378;&#30340;&#22522;&#26412;&#21333;&#20803;&#12290;&#20026;&#20102;&#25552;&#39640;&#35745;&#31639;&#25928;&#29575;&#65292;&#25105;&#20204;&#23558;&#23398;&#20064;&#19982;&#20165;&#36873;&#25321;&#23376;&#38598;&#30340;&#23545;&#25239;&#24615;&#31034;&#20363;&#30456;&#32467;&#21512;&#65292;&#36825;&#23548;&#33268;&#20102;&#19968;&#32452;&#36739;&#23567;&#30340;&#20195;&#34920;&#24615;&#23545;&#25239;&#24615;&#31034;&#20363;&#65292;&#21487;&#29992;&#20110;&#22686;&#24378;&#31070;&#32463;&#32593;&#32476;&#23545;&#22810;&#26679;&#21270;$\ell_p$&#25915;&#20987;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adversarial robustness is a key concept in measuring the ability of neural networks to defend against adversarial attacks during the inference phase. Recent studies have shown that despite the success of improving adversarial robustness against a single type of attack using robust training techniques, models are still vulnerable to diversified $\ell_p$ attacks. To achieve diversified $\ell_p$ robustness, we propose a novel robust mode connectivity (RMC)-oriented adversarial defense that contains two population-based learning phases. The first phase, RMC, is able to search the model parameter space between two pre-trained models and find a path containing points with high robustness against diversified $\ell_p$ attacks. In light of the effectiveness of RMC, we develop a second phase, RMC-based optimization, with RMC serving as the basic unit for further enhancement of neural network diversified $\ell_p$ robustness. To increase computational efficiency, we incorporate learning with a sel
&lt;/p&gt;</description></item></channel></rss>