<rss version="2.0"><channel><title>Chat Arxiv cs.NE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NE</description><item><title>IDENAS&#26159;&#19968;&#31181;&#38598;&#25104;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#21644;&#29305;&#24449;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#25506;&#32034;&#20869;&#37096;&#20381;&#36182;&#24615;&#26469;&#25552;&#39640;&#20998;&#31867;&#20219;&#21153;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.17250</link><description>&lt;p&gt;
IDENAS: &#20869;&#37096;&#20381;&#36182;&#24615;&#25506;&#32034;&#29992;&#20110;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;
&lt;/p&gt;
&lt;p&gt;
IDENAS: Internal Dependency Exploration for Neural Architecture Search. (arXiv:2310.17250v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17250
&lt;/p&gt;
&lt;p&gt;
IDENAS&#26159;&#19968;&#31181;&#38598;&#25104;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#21644;&#29305;&#24449;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#25506;&#32034;&#20869;&#37096;&#20381;&#36182;&#24615;&#26469;&#25552;&#39640;&#20998;&#31867;&#20219;&#21153;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#26159;&#20174;&#19981;&#21516;&#25968;&#25454;&#38598;&#20013;&#25552;&#21462;&#26377;&#20215;&#20540;&#20449;&#24687;&#21644;&#36827;&#34892;&#21508;&#31181;&#39044;&#27979;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#20256;&#32479;&#31639;&#27861;&#20381;&#36182;&#20110;&#26126;&#30830;&#23450;&#20041;&#30340;&#36755;&#20837;&#21644;&#36755;&#20986;&#21464;&#37327;&#65292;&#28982;&#32780;&#65292;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#36755;&#20837;&#21644;&#36755;&#20986;&#21464;&#37327;&#20043;&#38388;&#30340;&#21306;&#21035;&#20197;&#21450;&#27169;&#22411;&#30340;&#24213;&#23618;&#20851;&#32852;&#65288;&#36755;&#20837;&#21644;&#36755;&#20986;&#65289;&#23618;&#26159;&#26410;&#30693;&#30340;&#12290;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#65288;NAS&#65289;&#21644;&#29305;&#24449;&#36873;&#25321;&#24050;&#25104;&#20026;&#36825;&#20123;&#22330;&#26223;&#20013;&#30340;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;IDENAS&#65292;&#19968;&#31181;&#22522;&#20110;&#20869;&#37096;&#20381;&#36182;&#24615;&#30340;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#26041;&#27861;&#65292;&#23558;NAS&#19982;&#29305;&#24449;&#36873;&#25321;&#30456;&#32467;&#21512;&#12290;&#35813;&#26041;&#27861;&#22312;&#28041;&#21450;1D&#20256;&#24863;&#22120;&#21644;2D&#22270;&#20687;&#25968;&#25454;&#30340;&#20998;&#31867;&#38382;&#39064;&#20013;&#25506;&#32034;&#20102;&#23436;&#25972;&#30340;&#21442;&#25968;&#31354;&#38388;&#30340;&#20869;&#37096;&#20381;&#36182;&#24615;&#12290;IDENAS&#37319;&#29992;&#20102;&#20462;&#25913;&#30340;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#27169;&#22411;&#21644;&#39034;&#24207;&#21069;&#21521;&#25628;&#32034;&#65288;SFS&#65289;&#31639;&#27861;&#65292;&#23558;&#36755;&#20837;-&#36755;&#20986;&#37197;&#32622;&#25628;&#32034;&#19982;&#23884;&#20837;&#24335;&#29305;&#24449;&#36873;&#25321;&#30456;&#32467;&#21512;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#26126;&#20102;IDENAS&#30340;&#20248;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning is a powerful tool for extracting valuable information and making various predictions from diverse datasets. Traditional algorithms rely on well-defined input and output variables however, there are scenarios where the distinction between the input and output variables and the underlying, associated (input and output) layers of the model, are unknown. Neural Architecture Search (NAS) and Feature Selection have emerged as promising solutions in such scenarios. This research proposes IDENAS, an Internal Dependency-based Exploration for Neural Architecture Search, integrating NAS with feature selection. The methodology explores internal dependencies in the complete parameter space for classification involving 1D sensor and 2D image data as well. IDENAS employs a modified encoder-decoder model and the Sequential Forward Search (SFS) algorithm, combining input-output configuration search with embedded feature selection. Experimental results demonstrate IDENASs superior perf
&lt;/p&gt;</description></item></channel></rss>