<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#23545;&#31216;&#27491;&#23450;&#30697;&#38453;&#27969;&#24418;&#19978;&#36827;&#34892;&#22238;&#24402;&#27714;&#35299;&#30340;&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#26500;&#36896;&#28385;&#36275;&#27491;&#23450;&#24615;&#21644;&#21487;&#23454;&#38469;&#35745;&#31639;&#23646;&#24615;&#30340;&#39532;&#27663;&#36317;&#31163;&#26368;&#23567;&#21270;&#12290;&#35813;&#20272;&#35745;&#22120;&#26159;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#65292;&#24182;&#19988;&#33021;&#30456;&#23545;&#20110;&#20854;&#20182;&#26041;&#27861;&#26174;&#33879;&#20943;&#23567;&#20272;&#35745;&#35823;&#24046;&#12290;</title><link>http://arxiv.org/abs/2307.12438</link><description>&lt;p&gt;
&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#20272;&#35745;&#65306;&#36890;&#36807;&#22312;&#23545;&#31216;&#27491;&#23450;&#30697;&#38453;&#27969;&#24418;&#19978;&#36827;&#34892;&#22238;&#24402;&#27714;&#35299;
&lt;/p&gt;
&lt;p&gt;
Multifidelity Covariance Estimation via Regression on the Manifold of Symmetric Positive Definite Matrices. (arXiv:2307.12438v2 [stat.CO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12438
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#23545;&#31216;&#27491;&#23450;&#30697;&#38453;&#27969;&#24418;&#19978;&#36827;&#34892;&#22238;&#24402;&#27714;&#35299;&#30340;&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#26500;&#36896;&#28385;&#36275;&#27491;&#23450;&#24615;&#21644;&#21487;&#23454;&#38469;&#35745;&#31639;&#23646;&#24615;&#30340;&#39532;&#27663;&#36317;&#31163;&#26368;&#23567;&#21270;&#12290;&#35813;&#20272;&#35745;&#22120;&#26159;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#65292;&#24182;&#19988;&#33021;&#30456;&#23545;&#20110;&#20854;&#20182;&#26041;&#27861;&#26174;&#33879;&#20943;&#23567;&#20272;&#35745;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#22120;&#65292;&#20854;&#26500;&#24314;&#20026;&#22312;&#23545;&#31216;&#27491;&#23450;&#30697;&#38453;&#27969;&#24418;&#19978;&#30340;&#22238;&#24402;&#38382;&#39064;&#30340;&#35299;&#12290;&#35813;&#20272;&#35745;&#22120;&#36890;&#36807;&#26500;&#36896;&#26159;&#27491;&#23450;&#30340;&#65292;&#24182;&#19988;&#20854;&#26368;&#23567;&#21270;&#30340;&#39532;&#27663;&#36317;&#31163;&#20855;&#26377;&#21487;&#23454;&#38469;&#35745;&#31639;&#30340;&#23646;&#24615;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#27969;&#24418;&#22238;&#24402;&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#26159;&#22312;&#29305;&#23450;&#35823;&#24046;&#27169;&#22411;&#19979;&#30340;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#12290;&#26356;&#24191;&#27867;&#22320;&#35828;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#40654;&#26364;&#22238;&#24402;&#26694;&#26550;&#21253;&#21547;&#20102;&#20174;&#25511;&#21046;&#21464;&#37327;&#26500;&#24314;&#30340;&#29616;&#26377;&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#31034;&#20363;&#35777;&#26126;&#65292;&#30456;&#23545;&#20110;&#21333;&#20445;&#30495;&#24230;&#21644;&#20854;&#20182;&#22810;&#20445;&#30495;&#24230;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#21487;&#20197;&#26174;&#33879;&#20943;&#23567;&#20272;&#35745;&#35823;&#24046;&#30340;&#24179;&#26041;&#65292;&#20943;&#23569;&#19968;&#20010;&#25968;&#37327;&#32423;&#12290;&#27492;&#22806;&#65292;&#27491;&#23450;&#24615;&#30340;&#20445;&#25345;&#30830;&#20445;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#19982;&#19979;&#28216;&#20219;&#21153;&#20860;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a multifidelity estimator of covariance matrices formulated as the solution to a regression problem on the manifold of symmetric positive definite matrices. The estimator is positive definite by construction, and the Mahalanobis distance minimized to obtain it possesses properties which enable practical computation. We show that our manifold regression multifidelity (MRMF) covariance estimator is a maximum likelihood estimator under a certain error model on manifold tangent space. More broadly, we show that our Riemannian regression framework encompasses existing multifidelity covariance estimators constructed from control variates. We demonstrate via numerical examples that our estimator can provide significant decreases, up to one order of magnitude, in squared estimation error relative to both single-fidelity and other multifidelity covariance estimators. Furthermore, preservation of positive definiteness ensures that our estimator is compatible with downstream tasks, s
&lt;/p&gt;</description></item></channel></rss>