<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35821;&#20041;&#24863;&#30693;&#22810;&#22336;&#35775;&#38382;&#26041;&#26696;&#65292;&#26088;&#22312;&#20248;&#21270;&#36164;&#28304;&#21033;&#29992;&#19982;&#20844;&#24179;&#24615;&#30340;&#26435;&#34913;&#65292;&#24182;&#32771;&#34385;&#29992;&#25143;&#25968;&#25454;&#30340;&#30456;&#20851;&#24615;&#65292;&#20197;&#28385;&#36275;&#26410;&#26469;6G&#24212;&#29992;&#30340;&#35201;&#27714;&#21644;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.06308</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#20998;&#24067;&#24335;&#12289;&#21160;&#24577;6G&#24212;&#29992;&#30340;&#35821;&#20041;&#24863;&#30693;&#22810;&#22336;&#35775;&#38382;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
A Semantic-Aware Multiple Access Scheme for Distributed, Dynamic 6G-Based Applications. (arXiv:2401.06308v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06308
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35821;&#20041;&#24863;&#30693;&#22810;&#22336;&#35775;&#38382;&#26041;&#26696;&#65292;&#26088;&#22312;&#20248;&#21270;&#36164;&#28304;&#21033;&#29992;&#19982;&#20844;&#24179;&#24615;&#30340;&#26435;&#34913;&#65292;&#24182;&#32771;&#34385;&#29992;&#25143;&#25968;&#25454;&#30340;&#30456;&#20851;&#24615;&#65292;&#20197;&#28385;&#36275;&#26410;&#26469;6G&#24212;&#29992;&#30340;&#35201;&#27714;&#21644;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#20041;&#24863;&#30693;&#33539;&#24335;&#30340;&#20986;&#29616;&#20026;&#21019;&#26032;&#30340;&#26381;&#21153;&#25552;&#20379;&#20102;&#26426;&#20250;&#65292;&#23588;&#20854;&#26159;&#22312;&#22522;&#20110;6G&#30340;&#24212;&#29992;&#29615;&#22659;&#20013;&#12290;&#23613;&#31649;&#22312;&#35821;&#20041;&#25552;&#21462;&#25216;&#26415;&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#65292;&#20294;&#23558;&#35821;&#20041;&#20449;&#24687;&#32435;&#20837;&#36164;&#28304;&#20998;&#37197;&#20915;&#31574;&#20173;&#22788;&#20110;&#26089;&#26399;&#38454;&#27573;&#65292;&#32570;&#20047;&#23545;&#26410;&#26469;&#31995;&#32479;&#38656;&#27714;&#21644;&#29305;&#24615;&#30340;&#32771;&#34385;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26080;&#32447;&#39057;&#35889;&#22810;&#22336;&#35775;&#38382;&#38382;&#39064;&#30340;&#24314;&#27169;&#12290;&#23427;&#26088;&#22312;&#20248;&#21270;&#21033;&#29992;&#29575;&#19982;&#20844;&#24179;&#24615;&#30340;&#26435;&#34913;&#65292;&#20351;&#29992;&#945;-&#20844;&#24179;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#33258;&#21161;&#21534;&#21520;&#37327;&#21644;&#21327;&#21161;&#21534;&#21520;&#37327;&#30340;&#27010;&#24565;&#26469;&#32771;&#34385;&#29992;&#25143;&#25968;&#25454;&#30340;&#30456;&#20851;&#24615;&#12290;&#39318;&#20808;&#65292;&#20998;&#26512;&#20102;&#35813;&#38382;&#39064;&#65292;&#25214;&#20986;&#20102;&#26368;&#20248;&#35299;&#12290;&#25509;&#19979;&#26469;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27169;&#22411;&#26080;&#20851;&#30340;&#22810;&#20027;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#25216;&#26415;&#30340;&#35821;&#20041;&#24863;&#30693;&#22810;&#26234;&#33021;&#20307;&#21452;&#37325;&#21644;&#20915;&#26007;&#28145;&#24230;Q&#23398;&#20064; (SAMA-D3QL) &#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The emergence of the semantic-aware paradigm presents opportunities for innovative services, especially in the context of 6G-based applications. Although significant progress has been made in semantic extraction techniques, the incorporation of semantic information into resource allocation decision-making is still in its early stages, lacking consideration of the requirements and characteristics of future systems. In response, this paper introduces a novel formulation for the problem of multiple access to the wireless spectrum. It aims to optimize the utilization-fairness trade-off, using the $\alpha$-fairness metric, while accounting for user data correlation by introducing the concepts of self- and assisted throughputs. Initially, the problem is analyzed to identify its optimal solution. Subsequently, a Semantic-Aware Multi-Agent Double and Dueling Deep Q-Learning (SAMA-D3QL) technique is proposed. This method is grounded in Model-free Multi-Agent Deep Reinforcement Learning (MADRL),
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#22826;&#36203;&#20857;&#27969;&#23548;&#21521;&#32435;&#31859;&#23610;&#24230;&#23450;&#20301;&#26041;&#27861;&#65292;&#21487;&#20197;&#25552;&#39640;&#23450;&#20301;&#31934;&#24230;&#21644;&#35206;&#30422;&#33539;&#22260;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#30340;&#23450;&#20301;&#31934;&#24230;&#20302;&#21644;&#26080;&#27861;&#20840;&#23616;&#23450;&#20301;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.05551</link><description>&lt;p&gt;
&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#22826;&#36203;&#20857;&#27969;&#23548;&#21521;&#32435;&#31859;&#23610;&#24230;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Network-enabled Terahertz-based Flow-guided Nanoscale Localization. (arXiv:2307.05551v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05551
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#22826;&#36203;&#20857;&#27969;&#23548;&#21521;&#32435;&#31859;&#23610;&#24230;&#23450;&#20301;&#26041;&#27861;&#65292;&#21487;&#20197;&#25552;&#39640;&#23450;&#20301;&#31934;&#24230;&#21644;&#35206;&#30422;&#33539;&#22260;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#30340;&#23450;&#20301;&#31934;&#24230;&#20302;&#21644;&#26080;&#27861;&#20840;&#23616;&#23450;&#20301;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32435;&#31859;&#25216;&#26415;&#21644;&#20808;&#36827;&#26448;&#26009;&#30340;&#31185;&#23398;&#36827;&#23637;&#20026;&#20307;&#20869;&#31934;&#20934;&#21307;&#23398;&#30340;&#32435;&#31859;&#23610;&#24230;&#35013;&#32622;&#38138;&#24179;&#20102;&#36947;&#36335;&#65292;&#20854;&#20013;&#21253;&#25324;&#38598;&#25104;&#24863;&#24212;&#12289;&#35745;&#31639;&#12289;&#36890;&#20449;&#12289;&#25968;&#25454;&#21644;&#33021;&#37327;&#23384;&#20648;&#33021;&#21147;&#12290;&#22312;&#20154;&#20307;&#24515;&#34880;&#31649;&#31995;&#32479;&#20013;&#65292;&#36825;&#20123;&#35013;&#32622;&#34987;&#35774;&#24819;&#20026;&#34987;&#21160;&#27969;&#21160;&#24182;&#25345;&#32493;&#24863;&#30693;&#20197;&#20415;&#26816;&#27979;&#35786;&#26029;&#24863;&#20852;&#36259;&#30340;&#20107;&#20214;&#12290;&#36890;&#36807;&#23558;&#36825;&#20123;&#20107;&#20214;&#30340;&#29289;&#29702;&#20301;&#32622;&#65288;&#22914;&#36523;&#20307;&#21306;&#22495;&#65289;&#20998;&#37197;&#32473;&#23427;&#20204;&#65292;&#21487;&#20197;&#25552;&#39640;&#26816;&#27979;&#21040;&#36825;&#20123;&#20107;&#20214;&#30340;&#35786;&#26029;&#20215;&#20540;&#65292;&#36825;&#26159;&#27969;&#23548;&#21521;&#23450;&#20301;&#30340;&#20027;&#35201;&#21629;&#39064;&#12290;&#24403;&#21069;&#30340;&#27969;&#23548;&#21521;&#23450;&#20301;&#26041;&#27861;&#23384;&#22312;&#23450;&#20301;&#31934;&#24230;&#20302;&#21644;&#26080;&#27861;&#22312;&#25972;&#20010;&#24515;&#34880;&#31649;&#31995;&#32479;&#20869;&#26412;&#22320;&#21270;&#20107;&#20214;&#30340;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#26469;&#36827;&#34892;&#23450;&#20301;&#65292;&#24182;&#35777;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#23450;&#20301;&#31934;&#24230;&#21644;&#35206;&#30422;&#33539;&#22260;&#19978;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific advancements in nanotechnology and advanced materials are paving the way toward nanoscale devices for in-body precision medicine; comprising integrated sensing, computing, communication, data and energy storage capabilities. In the human cardiovascular system, such devices are envisioned to be passively flowing and continuously sensing for detecting events of diagnostic interest. The diagnostic value of detecting such events can be enhanced by assigning to them their physical locations (e.g., body region), which is the main proposition of flow-guided localization. Current flow-guided localization approaches suffer from low localization accuracy and they are by-design unable to localize events within the entire cardiovascular system. Toward addressing this issue, we propose the utilization of Graph Neural Networks (GNNs) for this purpose, and demonstrate localization accuracy and coverage enhancements of our proposal over the existing State of the Art (SotA) approaches. Based
&lt;/p&gt;</description></item></channel></rss>