<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22806;&#25512;&#30340;&#22359;&#20027;&#23548;&#26497;&#23567;&#21270;&#26041;&#27861;&#65288;BMMe&#65289;&#26469;&#35299;&#20915;&#22810;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;$\beta$-NMF&#12290;&#36890;&#36807;&#20351;&#29992;&#29420;&#29305;&#30340;&#33258;&#36866;&#24212;&#26356;&#26032;&#35268;&#21017;&#26469;&#26356;&#26032;&#22806;&#25512;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#22312;&#23454;&#39564;&#20013;&#23637;&#29616;&#20986;&#26174;&#33879;&#30340;&#21152;&#36895;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2401.06646</link><description>&lt;p&gt;
&#20351;&#29992;&#22806;&#25512;&#30340;&#22359;&#20027;&#23548;&#26497;&#23567;&#21270;&#26041;&#27861;&#21644;&#24212;&#29992;&#20110;$\beta$-NMF
&lt;/p&gt;
&lt;p&gt;
Block Majorization Minimization with Extrapolation and Application to $\beta$-NMF. (arXiv:2401.06646v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06646
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22806;&#25512;&#30340;&#22359;&#20027;&#23548;&#26497;&#23567;&#21270;&#26041;&#27861;&#65288;BMMe&#65289;&#26469;&#35299;&#20915;&#22810;&#20984;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;$\beta$-NMF&#12290;&#36890;&#36807;&#20351;&#29992;&#29420;&#29305;&#30340;&#33258;&#36866;&#24212;&#26356;&#26032;&#35268;&#21017;&#26469;&#26356;&#26032;&#22806;&#25512;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#22312;&#23454;&#39564;&#20013;&#23637;&#29616;&#20986;&#26174;&#33879;&#30340;&#21152;&#36895;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22806;&#25512;&#30340;&#22359;&#20027;&#23548;&#26497;&#23567;&#21270;&#26041;&#27861;&#65288;BMMe&#65289;&#26469;&#35299;&#20915;&#19968;&#31867;&#22810;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;BMMe&#30340;&#22806;&#25512;&#21442;&#25968;&#20351;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#33258;&#36866;&#24212;&#26356;&#26032;&#35268;&#21017;&#26469;&#26356;&#26032;&#12290;&#36890;&#36807;&#23558;&#22359;&#20027;&#23548;&#26497;&#23567;&#21270;&#37325;&#26032;&#34920;&#36848;&#20026;&#22359;&#38236;&#20687;&#19979;&#38477;&#26041;&#27861;&#65292;&#24182;&#22312;&#27599;&#27425;&#36845;&#20195;&#20013;&#33258;&#36866;&#24212;&#26356;&#26032;Bregman&#25955;&#24230;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;BMMe&#30340;&#23376;&#24207;&#21015;&#25910;&#25947;&#24615;&#12290;&#25105;&#20204;&#20351;&#29992;&#36825;&#31181;&#26041;&#27861;&#35774;&#35745;&#20102;&#39640;&#25928;&#30340;&#31639;&#27861;&#26469;&#22788;&#29702;$\beta$-NMF&#20013;&#30340;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#38382;&#39064;&#65292;&#20854;&#20013;$\beta\in [1,2]$&#12290;&#36825;&#20123;&#31639;&#27861;&#26159;&#20351;&#29992;&#22806;&#25512;&#30340;&#20056;&#27861;&#26356;&#26032;&#65292;&#24182;&#20174;&#25105;&#20204;&#30340;&#26032;&#32467;&#26524;&#20013;&#33719;&#24471;&#20102;&#25910;&#25947;&#24615;&#20445;&#35777;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#23454;&#35777;&#20102;BMMe&#22312;$\beta$-NMF&#20013;&#30340;&#26174;&#33879;&#21152;&#36895;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a Block Majorization Minimization method with Extrapolation (BMMe) for solving a class of multi-convex optimization problems. The extrapolation parameters of BMMe are updated using a novel adaptive update rule. By showing that block majorization minimization can be reformulated as a block mirror descent method, with the Bregman divergence adaptively updated at each iteration, we establish subsequential convergence for BMMe. We use this method to design efficient algorithms to tackle nonnegative matrix factorization problems with the $\beta$-divergences ($\beta$-NMF) for $\beta\in [1,2]$. These algorithms, which are multiplicative updates with extrapolation, benefit from our novel results that offer convergence guarantees. We also empirically illustrate the significant acceleration of BMMe for $\beta$-NMF through extensive experiments.
&lt;/p&gt;</description></item></channel></rss>