<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#38543;&#26426;&#33293;&#20837;&#25216;&#26415;&#33021;&#26377;&#25928;&#38544;&#24335;&#27491;&#21017;&#21270;&#39640;&#30246;&#30697;&#38453;&#65292;&#30830;&#20445;&#33293;&#20837;&#21518;&#30340;&#30697;&#38453;&#20855;&#26377;&#23436;&#25972;&#30340;&#21015;&#31209;&#12290;</title><link>https://arxiv.org/abs/2403.12278</link><description>&lt;p&gt;
&#38543;&#26426;&#33293;&#20837;&#38544;&#24335;&#27491;&#21017;&#21270;&#39640;&#30246;&#30697;&#38453;
&lt;/p&gt;
&lt;p&gt;
Stochastic Rounding Implicitly Regularizes Tall-and-Thin Matrices
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12278
&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#33293;&#20837;&#25216;&#26415;&#33021;&#26377;&#25928;&#38544;&#24335;&#27491;&#21017;&#21270;&#39640;&#30246;&#30697;&#38453;&#65292;&#30830;&#20445;&#33293;&#20837;&#21518;&#30340;&#30697;&#38453;&#20855;&#26377;&#23436;&#25972;&#30340;&#21015;&#31209;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#21040;&#38543;&#26426;&#33293;&#20837;&#22312;&#26426;&#22120;&#23398;&#20064;&#21644;&#22823;&#35268;&#27169;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#35757;&#32451;&#20013;&#30340;&#27969;&#34892;&#65292;&#25105;&#20204;&#32771;&#34385;&#23454;&#30697;&#38453;$\mathbf{A}$&#30340;&#38543;&#26426;&#36817;&#20284;&#33293;&#20837;&#65292;&#20854;&#20013;&#34892;&#25968;&#36828;&#36828;&#22810;&#20110;&#21015;&#25968;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#26032;&#39062;&#30340;&#29702;&#35770;&#35777;&#25454;&#65292;&#24182;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#35780;&#20272;&#25903;&#25345;&#65292;&#39640;&#27010;&#29575;&#19979;&#65292;&#38543;&#26426;&#33293;&#20837;&#30697;&#38453;&#30340;&#26368;&#23567;&#22855;&#24322;&#20540;&#36828;&#31163;&#38646;--&#26080;&#35770;$\mathbf{A}$&#25509;&#36817;&#22855;&#24322;&#36824;&#26159;$\mathbf{A}$&#22855;&#24322;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#38543;&#26426;&#33293;&#20837;\textit{&#38544;&#24335;&#27491;&#21017;&#21270;}&#39640;&#30246;&#30697;&#38453;$\mathbf{A}$&#65292;&#20351;&#24471;&#33293;&#20837;&#21518;&#30340;&#29256;&#26412;&#20855;&#26377;&#23436;&#25972;&#30340;&#21015;&#31209;&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#21033;&#29992;&#20102;&#38543;&#26426;&#30697;&#38453;&#29702;&#35770;&#20013;&#30340;&#26377;&#21147;&#32467;&#26524;&#65292;&#20197;&#21450;&#38543;&#26426;&#33293;&#20837;&#35823;&#24046;&#19981;&#38598;&#20013;&#22312;&#20302;&#32500;&#21015;&#31354;&#38388;&#30340;&#24605;&#24819;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12278v1 Announce Type: new  Abstract: Motivated by the popularity of stochastic rounding in the context of machine learning and the training of large-scale deep neural network models, we consider stochastic nearness rounding of real matrices $\mathbf{A}$ with many more rows than columns. We provide novel theoretical evidence, supported by extensive experimental evaluation that, with high probability, the smallest singular value of a stochastically rounded matrix is well bounded away from zero -- regardless of how close $\mathbf{A}$ is to being rank deficient and even if $\mathbf{A}$ is rank-deficient. In other words, stochastic rounding \textit{implicitly regularizes} tall and skinny matrices $\mathbf{A}$ so that the rounded version has full column rank. Our proofs leverage powerful results in random matrix theory, and the idea that stochastic rounding errors do not concentrate in low-dimensional column spaces.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25299;&#23637;&#20102;&#22522;&#20110;&#29289;&#29702;&#30693;&#35782;&#30340;&#31070;&#32463;&#32593;&#32476;(PINN) &#26469;&#35299;&#20915;&#27714;&#35299;&#38556;&#30861;&#29289;&#30456;&#20851;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#38382;&#39064;&#65292;&#36825;&#31181;&#31867;&#22411;&#30340;&#38382;&#39064;&#38656;&#35201;&#35299;&#20915;&#25968;&#20540;&#26041;&#27861;&#30340;&#38590;&#24230;&#36739;&#22823;&#65292;&#20294;&#20316;&#32773;&#36890;&#36807;&#23545;&#22810;&#31181;&#24773;&#20917;&#30340;&#30740;&#31350;&#35777;&#26126;&#20102;PINN&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.03552</link><description>&lt;p&gt;
&#22522;&#20110;&#29289;&#29702;&#30693;&#35782;&#30340;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#27714;&#35299;&#38556;&#30861;&#29289;&#30456;&#20851;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
A physics-informed neural network framework for modeling obstacle-related equations. (arXiv:2304.03552v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25299;&#23637;&#20102;&#22522;&#20110;&#29289;&#29702;&#30693;&#35782;&#30340;&#31070;&#32463;&#32593;&#32476;(PINN) &#26469;&#35299;&#20915;&#27714;&#35299;&#38556;&#30861;&#29289;&#30456;&#20851;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#38382;&#39064;&#65292;&#36825;&#31181;&#31867;&#22411;&#30340;&#38382;&#39064;&#38656;&#35201;&#35299;&#20915;&#25968;&#20540;&#26041;&#27861;&#30340;&#38590;&#24230;&#36739;&#22823;&#65292;&#20294;&#20316;&#32773;&#36890;&#36807;&#23545;&#22810;&#31181;&#24773;&#20917;&#30340;&#30740;&#31350;&#35777;&#26126;&#20102;PINN&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#22312;&#19968;&#20123;&#24212;&#29992;&#20013;&#21462;&#24471;&#20102;&#24456;&#22823;&#25104;&#21151;&#65292;&#20294;&#23558;&#20854;&#29992;&#20110;&#27714;&#35299;&#20559;&#24494;&#20998;&#26041;&#31243;(PDE)&#12288;&#30340;&#30740;&#31350;&#21017;&#26159;&#36817;&#24180;&#26469;&#30340;&#28909;&#28857;&#65292;&#23588;&#20854;&#22312;&#30446;&#21069;&#30340;&#26426;&#22120;&#23398;&#20064;&#24211;&#65288;&#22914;TensorFlow&#25110;PyTorch&#65289;&#30340;&#25903;&#25345;&#19979;&#21462;&#24471;&#20102;&#37325;&#22823;&#36827;&#23637;&#12290;&#22522;&#20110;&#29289;&#29702;&#30693;&#35782;&#30340;&#31070;&#32463;&#32593;&#32476;&#65288;PINN&#65289;&#21487;&#36890;&#36807;&#35299;&#26512;&#31232;&#30095;&#19988;&#22122;&#22768;&#25968;&#25454;&#26469;&#27714;&#35299;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#26159;&#19968;&#31181;&#26377;&#21560;&#24341;&#21147;&#30340;&#24037;&#20855;&#12290;&#26412;&#25991;&#23558;&#25299;&#23637;PINN&#26469;&#27714;&#35299;&#38556;&#30861;&#29289;&#30456;&#20851;PDE&#65292;&#36825;&#31867;&#26041;&#31243;&#38590;&#24230;&#36739;&#22823;&#65292;&#38656;&#35201;&#21487;&#20197;&#24471;&#21040;&#20934;&#30830;&#35299;&#30340;&#25968;&#20540;&#26041;&#27861;&#12290;&#20316;&#32773;&#22312;&#27491;&#24120;&#21644;&#19981;&#35268;&#21017;&#30340;&#38556;&#30861;&#24773;&#20917;&#19979;&#65292;&#23545;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;PDE&#30340;&#22810;&#20010;&#22330;&#26223;&#36827;&#34892;&#20102;&#28436;&#31034;&#65292;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#30340;PINNs&#24615;&#33021;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep learning has been highly successful in some applications. Nevertheless, its use for solving partial differential equations (PDEs) has only been of recent interest with current state-of-the-art machine learning libraries, e.g., TensorFlow or PyTorch. Physics-informed neural networks (PINNs) are an attractive tool for solving partial differential equations based on sparse and noisy data. Here extend PINNs to solve obstacle-related PDEs which present a great computational challenge because they necessitate numerical methods that can yield an accurate approximation of the solution that lies above a given obstacle. The performance of the proposed PINNs is demonstrated in multiple scenarios for linear and nonlinear PDEs subject to regular and irregular obstacles.
&lt;/p&gt;</description></item></channel></rss>