<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>&#36890;&#36807;&#36164;&#28304;&#24863;&#30693;&#30340;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#20197;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#30340;&#20869;&#23481;&#35831;&#27714;&#65292;&#24182;&#20943;&#36731;&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#22238;&#31243;&#27969;&#37327;&#25317;&#22622;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.04216</link><description>&lt;p&gt;
&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#30340;&#36164;&#28304;&#24863;&#30693;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Resource-Aware Hierarchical Federated Learning in Wireless Video Caching Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04216
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#36164;&#28304;&#24863;&#30693;&#30340;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#20197;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#30340;&#20869;&#23481;&#35831;&#27714;&#65292;&#24182;&#20943;&#36731;&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#22238;&#31243;&#27969;&#37327;&#25317;&#22622;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#65292;&#36890;&#36807;&#23558;&#24453;&#35831;&#27714;&#20869;&#23481;&#23384;&#20648;&#22312;&#19981;&#21516;&#32423;&#21035;&#19978;&#65292;&#21487;&#20197;&#20943;&#36731;&#30001;&#23569;&#25968;&#28909;&#38376;&#25991;&#20214;&#30340;&#35270;&#39057;&#27969;&#37327;&#36896;&#25104;&#30340;&#22238;&#31243;&#25317;&#22622;&#12290;&#36890;&#24120;&#65292;&#20869;&#23481;&#26381;&#21153;&#25552;&#20379;&#21830;&#65288;CSP&#65289;&#25317;&#26377;&#20869;&#23481;&#65292;&#29992;&#25143;&#20351;&#29992;&#20854;&#65288;&#26080;&#32447;&#65289;&#20114;&#32852;&#32593;&#26381;&#21153;&#25552;&#20379;&#21830;&#65288;ISP&#65289;&#20174;CSP&#35831;&#27714;&#20854;&#39318;&#36873;&#20869;&#23481;&#12290;&#30001;&#20110;&#36825;&#20123;&#21442;&#19982;&#26041;&#19981;&#20250;&#36879;&#38706;&#20854;&#31169;&#23494;&#20449;&#24687;&#21644;&#21830;&#19994;&#26426;&#23494;&#65292;&#20256;&#32479;&#25216;&#26415;&#21487;&#33021;&#26080;&#27861;&#29992;&#20110;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#38656;&#27714;&#30340;&#21160;&#24577;&#21464;&#21270;&#12290;&#20986;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#36164;&#28304;&#24863;&#30693;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;&#65288;RawHFL&#65289;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#30340;&#20869;&#23481;&#35831;&#27714;&#12290;&#37319;&#29992;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#25968;&#25454;&#33719;&#21462;&#25216;&#26415;&#65292;&#20801;&#35768;&#29992;&#25143;&#26681;&#25454;&#20854;&#35831;&#27714;&#30340;&#20869;&#23481;&#26356;&#26032;&#20854;&#26412;&#22320;&#35757;&#32451;&#25968;&#25454;&#38598;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#32593;&#32476;&#21644;&#20854;&#20182;&#35745;&#31639;&#36164;&#28304;&#26377;&#38480;&#65292;&#32771;&#34385;&#21040;&#21482;&#26377;&#19968;&#37096;&#20998;&#29992;&#25143;&#21442;&#19982;&#27169;&#22411;&#35757;&#32451;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;
&lt;/p&gt;
&lt;p&gt;
Backhaul traffic congestion caused by the video traffic of a few popular files can be alleviated by storing the to-be-requested content at various levels in wireless video caching networks. Typically, content service providers (CSPs) own the content, and the users request their preferred content from the CSPs using their (wireless) internet service providers (ISPs). As these parties do not reveal their private information and business secrets, traditional techniques may not be readily used to predict the dynamic changes in users' future demands. Motivated by this, we propose a novel resource-aware hierarchical federated learning (RawHFL) solution for predicting user's future content requests. A practical data acquisition technique is used that allows the user to update its local training dataset based on its requested content. Besides, since networking and other computational resources are limited, considering that only a subset of the users participate in the model training, we derive
&lt;/p&gt;</description></item></channel></rss>