<rss version="2.0"><channel><title>Chat Arxiv cs.NI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NI</description><item><title>ChatTracer&#26159;&#19968;&#20010;&#30001;LLM&#39537;&#21160;&#30340;&#23454;&#26102;&#34013;&#29273;&#35774;&#22791;&#36861;&#36394;&#31995;&#32479;&#65292;&#20854;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#21487;&#38752;&#39640;&#25928;&#30340;BLE&#25968;&#25454;&#21253;&#20998;&#32452;&#31639;&#27861;&#21644;&#32467;&#21512;&#20102;&#30417;&#30563;&#24494;&#35843;&#21644;&#24378;&#21270;&#23398;&#20064;&#24494;&#35843;&#31574;&#30053;&#30340;LLM&#24494;&#35843;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2403.19833</link><description>&lt;p&gt;
ChatTracer&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#39537;&#21160;&#30340;&#23454;&#26102;&#34013;&#29273;&#35774;&#22791;&#36861;&#36394;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
ChatTracer: Large Language Model Powered Real-time Bluetooth Device Tracking System
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19833
&lt;/p&gt;
&lt;p&gt;
ChatTracer&#26159;&#19968;&#20010;&#30001;LLM&#39537;&#21160;&#30340;&#23454;&#26102;&#34013;&#29273;&#35774;&#22791;&#36861;&#36394;&#31995;&#32479;&#65292;&#20854;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#21487;&#38752;&#39640;&#25928;&#30340;BLE&#25968;&#25454;&#21253;&#20998;&#32452;&#31639;&#27861;&#21644;&#32467;&#21512;&#20102;&#30417;&#30563;&#24494;&#35843;&#21644;&#24378;&#21270;&#23398;&#20064;&#24494;&#35843;&#31574;&#30053;&#30340;LLM&#24494;&#35843;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#22914;OpenAI ChatGPT&#21644;Google Bard&#25152;&#23637;&#31034;&#30340;&#65292;&#24050;&#32463;&#25913;&#21464;&#20102;&#25105;&#20204;&#19982;&#32593;&#32476;&#25216;&#26415;&#20114;&#21160;&#30340;&#26041;&#24335;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;LLM&#19982;&#26080;&#32447;&#20256;&#24863;&#22120;&#32593;&#32476;&#65288;WSN&#65289;&#30456;&#36830;&#25509;&#30340;&#21487;&#33021;&#24615;&#12290;&#19968;&#20010;&#25104;&#21151;&#30340;&#35774;&#35745;&#19981;&#20165;&#20250;&#23558;LLM&#30340;&#30693;&#35782;&#39046;&#22495;&#24310;&#20280;&#21040;&#29289;&#29702;&#19990;&#30028;&#65292;&#32780;&#19988;&#23558;&#24443;&#24213;&#38761;&#26032;&#20154;&#20204;&#19982;WSN&#30340;&#20114;&#21160;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;ChatTracer&#65292;&#19968;&#20010;&#30001;LLM&#39537;&#21160;&#30340;&#23454;&#26102;&#34013;&#29273;&#35774;&#22791;&#36861;&#36394;&#31995;&#32479;&#12290;ChatTracer&#30001;&#19977;&#20010;&#20851;&#38190;&#32452;&#20214;&#32452;&#25104;&#65306;&#19968;&#31995;&#21015;&#34013;&#29273;&#21957;&#25506;&#33410;&#28857;&#12289;&#19968;&#20010;&#25968;&#25454;&#24211;&#21644;&#19968;&#20010;&#32463;&#36807;&#31934;&#35843;&#30340;LLM&#12290;ChatTracer&#30340;&#35774;&#35745;&#22522;&#20110;&#25105;&#20204;&#30340;&#23454;&#39564;&#35266;&#23519;&#65292;&#21830;&#29992;&#30340;&#33529;&#26524;/&#23433;&#21331;&#35774;&#22791;&#21363;&#20351;&#22312;&#31354;&#38386;&#29366;&#24577;&#19979;&#20063;&#20250;&#27599;&#20998;&#38047;&#24191;&#25773;&#25968;&#30334;&#20010;BLE&#25968;&#25454;&#21253;&#12290;&#23427;&#30340;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#65306;i&#65289;&#19968;&#20010;&#21487;&#38752;&#39640;&#25928;&#30340;BLE&#25968;&#25454;&#21253;&#20998;&#32452;&#31639;&#27861;&#65307;&#21644;ii&#65289;&#19968;&#20010;&#32467;&#21512;&#20102;&#30417;&#30563;&#24494;&#35843;&#65288;SFT&#65289;&#21644;&#24378;&#21270;&#23398;&#20064;&#24494;&#35843;&#31574;&#30053;&#30340;LLM&#24494;&#35843;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19833v1 Announce Type: cross  Abstract: Large language models (LLMs), exemplified by OpenAI ChatGPT and Google Bard, have transformed the way we interact with cyber technologies. In this paper, we study the possibility of connecting LLM with wireless sensor networks (WSN). A successful design will not only extend LLM's knowledge landscape to the physical world but also revolutionize human interaction with WSN. To the end, we present ChatTracer, an LLM-powered real-time Bluetooth device tracking system. ChatTracer comprises three key components: an array of Bluetooth sniffing nodes, a database, and a fine-tuned LLM. ChatTracer was designed based on our experimental observation that commercial Apple/Android devices always broadcast hundreds of BLE packets per minute even in their idle status. Its novelties lie in two aspects: i) a reliable and efficient BLE packet grouping algorithm; and ii) an LLM fine-tuning strategy that combines both supervised fine-tuning (SFT) and reinfo
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#32508;&#36848;&#20102;&#29289;&#29702;&#23618;&#30340;&#28145;&#24230;&#23398;&#20064;&#22312;&#25968;&#25454;&#39537;&#21160;&#30340;&#31471;&#21040;&#31471;&#36890;&#20449;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;&#65292;&#20197;&#21450;&#23427;&#20204;&#25152;&#25903;&#25345;&#30340;&#35821;&#20041;&#24212;&#29992;&#12290;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#30340;&#34920;&#31034;&#23398;&#20064;&#65292;&#36825;&#20123;&#31995;&#32479;&#34920;&#29616;&#20986;&#20102;&#22686;&#24378;&#30340;&#36866;&#24212;&#24615;&#21644;&#24615;&#33021;&#65292;&#33021;&#22815;&#29702;&#35299;&#21644;&#36866;&#24212;&#25968;&#25454;&#20256;&#36755;&#30340;&#19978;&#19979;&#25991;&#21644;&#24847;&#22270;&#12290;</title><link>http://arxiv.org/abs/2401.12800</link><description>&lt;p&gt;
&#29289;&#29702;&#23618;&#30340;&#28145;&#24230;&#23398;&#20064;&#65306;&#25968;&#25454;&#39537;&#21160;&#30340;&#31471;&#21040;&#31471;&#36890;&#20449;&#31995;&#32479;&#21450;&#20854;&#25903;&#25345;&#30340;&#35821;&#20041;&#24212;&#29992;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Deep Learning in Physical Layer: Review on Data Driven End-to-End Communication Systems and their Enabling Semantic Applications. (arXiv:2401.12800v1 [cs.NI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12800
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#32508;&#36848;&#20102;&#29289;&#29702;&#23618;&#30340;&#28145;&#24230;&#23398;&#20064;&#22312;&#25968;&#25454;&#39537;&#21160;&#30340;&#31471;&#21040;&#31471;&#36890;&#20449;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;&#65292;&#20197;&#21450;&#23427;&#20204;&#25152;&#25903;&#25345;&#30340;&#35821;&#20041;&#24212;&#29992;&#12290;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#30340;&#34920;&#31034;&#23398;&#20064;&#65292;&#36825;&#20123;&#31995;&#32479;&#34920;&#29616;&#20986;&#20102;&#22686;&#24378;&#30340;&#36866;&#24212;&#24615;&#21644;&#24615;&#33021;&#65292;&#33021;&#22815;&#29702;&#35299;&#21644;&#36866;&#24212;&#25968;&#25454;&#20256;&#36755;&#30340;&#19978;&#19979;&#25991;&#21644;&#24847;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#24050;&#32463;&#36890;&#36807;&#25968;&#25454;&#39537;&#21160;&#30340;&#31471;&#21040;&#31471;&#23398;&#20064;&#21644;&#20248;&#21270;&#29289;&#29702;&#23618;&#23454;&#29616;&#26080;&#32447;&#36890;&#20449;&#31995;&#32479;&#30340;&#33539;&#24335;&#36716;&#21464;&#12290;&#36890;&#36807;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#30340;&#34920;&#31034;&#23398;&#20064;&#65292;&#31471;&#21040;&#31471;&#31995;&#32479;&#22312;&#22797;&#26434;&#30340;&#26080;&#32447;&#29615;&#22659;&#20013;&#34920;&#29616;&#20986;&#20102;&#22686;&#24378;&#30340;&#36866;&#24212;&#24615;&#21644;&#24615;&#33021;&#65292;&#28385;&#36275;&#20102;5G&#21450;&#20854;&#20197;&#19978;&#32593;&#32476;&#31995;&#32479;&#21644;&#24212;&#29992;&#30340;&#38656;&#27714;&#12290;&#25968;&#25454;&#39537;&#21160;&#25216;&#26415;&#22312;&#29289;&#29702;&#23618;&#30340;&#21457;&#23637;&#20351;&#24471;&#22312;&#25991;&#26412;&#12289;&#22270;&#20687;&#12289;&#38899;&#39057;&#12289;&#35270;&#39057;&#21644;&#22810;&#27169;&#24577;&#20256;&#36755;&#31561;&#21508;&#31181;&#27169;&#24577;&#19979;&#23454;&#29616;&#20102;&#39640;&#32423;&#30340;&#35821;&#20041;&#24212;&#29992;&#12290;&#36825;&#20123;&#24212;&#29992;&#20174;&#20256;&#32479;&#30340;&#27604;&#29305;&#32423;&#36890;&#20449;&#36716;&#21464;&#20026;&#35821;&#20041;&#32423;&#26234;&#33021;&#36890;&#20449;&#31995;&#32479;&#65292;&#33021;&#22815;&#29702;&#35299;&#21644;&#36866;&#24212;&#25968;&#25454;&#20256;&#36755;&#30340;&#19978;&#19979;&#25991;&#21644;&#24847;&#22270;&#12290;&#34429;&#28982;&#29289;&#29702;&#23618;&#20316;&#20026;&#25968;&#25454;&#39537;&#21160;&#30340;&#31471;&#21040;&#31471;&#36890;&#20449;&#30340;&#28145;&#24230;&#23398;&#20064;&#26550;&#26500;&#26159;&#23454;&#29616;&#35821;&#20041;&#36890;&#20449;&#31995;&#32479;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36817;&#24180;&#26469;&#26377;&#21508;&#31181;&#30740;&#31350;&#20998;&#21035;&#23545;&#23427;&#20204;&#36827;&#34892;&#20102;&#35843;&#26597;&#65292;
&lt;/p&gt;
&lt;p&gt;
Deep Learning (DL) has enabled a paradigm shift in wireless communication system with data driven end-to-end (E2E) learning and optimization of the Physical Layer (PHY). By leveraging the representation learning of DL, E2E systems exhibit enhanced adaptability and performance in complex wireless environments, fulfilling the demands of 5G and beyond network systems and applications. The evolution of data-driven techniques in the PHY has enabled advanced semantic applications across various modalities including text, image, audio, video, and multi-modal transmissions. These applications transcend from traditional bit-level communication to semantic-level intelligent communication systems, which are capable of understanding and adapting to the context and intent of the data transmission. Although PHY as a DL architecture for data-driven E2E communication is a key factor in enabling semantic communication systems (SemCom), and various studies in recent years have surveyed them separately, 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#20998;&#25955;&#24335;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#36710;&#32852;&#32593;&#26381;&#21153;&#25552;&#20379;&#20013;&#30340;&#20219;&#21153;&#37096;&#32626;&#21644;&#36793;&#32536;&#36164;&#28304;&#30340;&#25193;&#23637;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.09832</link><description>&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#36793;&#32536;&#36164;&#28304;&#20219;&#21153;&#37096;&#32626;&#21644;&#25193;&#23637;&#26041;&#27861;&#29992;&#20110;&#36710;&#36733;&#32593;&#32476;&#26381;&#21153;&#25552;&#20379;
&lt;/p&gt;
&lt;p&gt;
A Deep RL Approach on Task Placement and Scaling of Edge Resources for Cellular Vehicle-to-Network Service Provisioning. (arXiv:2305.09832v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09832
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#20998;&#25955;&#24335;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#36710;&#32852;&#32593;&#26381;&#21153;&#25552;&#20379;&#20013;&#30340;&#20219;&#21153;&#37096;&#32626;&#21644;&#36793;&#32536;&#36164;&#28304;&#30340;&#25193;&#23637;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#8220;&#36710;&#32852;&#32593;&#8221;&#27491;&#22788;&#20110;&#25105;&#20204;&#31038;&#20250;&#25968;&#23383;&#21270;&#36716;&#22411;&#30340;&#21069;&#27839;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20998;&#25955;&#24335;&#26041;&#27861;&#29992;&#20110;&#25552;&#20379;&#36710;&#36742;&#36890;&#32852;&#32593;&#65288;C-V2N&#65289;&#26381;&#21153;&#65292;&#35299;&#20915;&#26381;&#21153;&#20219;&#21153;&#37096;&#32626;&#21644;&#36793;&#32536;&#36164;&#28304;&#30340;&#25193;&#23637;&#38382;&#39064;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20010;&#32852;&#21512;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#20010;&#38382;&#39064;&#30340;&#32852;&#25509;&#26041;&#24335;&#65292;&#37319;&#29992;&#20102;&#22522;&#20110;&#36138;&#24515;&#31639;&#27861;&#30340;&#20851;&#20110;&#20219;&#21153;&#37096;&#32626;&#30340;&#26041;&#27861;&#21644;&#22522;&#20110; Deep Deterministic Policy Gradient (DDPG) &#30340;&#25193;&#23637;&#26041;&#27861;&#12290;&#26412;&#25991;&#36824;&#23545;&#25105;&#20204;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#22522;&#20934;&#27979;&#35797;&#65292;&#37325;&#28857;&#20851;&#27880;&#20102;&#25193;&#23637;&#20195;&#29702;&#19982;&#22810;&#20010;&#29366;&#24577;&#19979;&#26368;&#20808;&#36827;&#30340;&#25193;&#23637;&#26041;&#27861;&#30340;&#24615;&#33021;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cellular-Vehicle-to-Everything (C-V2X) is currently at the forefront of the digital transformation of our society. By enabling vehicles to communicate with each other and with the traffic environment using cellular networks, we redefine transportation, improving road safety and transportation services, increasing efficiency of traffic flows, and reducing environmental impact. This paper proposes a decentralized approach for provisioning Cellular Vehicular-to-Network (C-V2N) services, addressing the coupled problems of service task placement and scaling of edge resources. We formalize the joint problem and prove its complexity. We propose an approach to tackle it, linking the two problems, employing decentralized decision-making using (i) a greedy approach for task placement and (ii) a Deep Deterministic Policy Gradient (DDPG) based approach for scaling. We benchmark the performance of our approach, focusing on the scaling agent, against several State-of-the-Art (SoA) scaling approaches
&lt;/p&gt;</description></item></channel></rss>