<rss version="2.0"><channel><title>Chat Arxiv cs.NA</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.NA</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;&#65288;FEX&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#20855;&#26377;&#26377;&#38480;&#20010;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#23547;&#25214;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#36817;&#20284;&#35299;&#12290;&#36890;&#36807;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#23558;FEX&#24212;&#29992;&#20110;&#21508;&#31181;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#21487;&#20197;&#23454;&#29616;&#39640;&#24230;&#20934;&#30830;&#30340;&#27714;&#35299;&#65292;&#24182;&#19988;&#36991;&#20813;&#20102;&#32500;&#24230;&#28798;&#38590;&#12290;&#36825;&#31181;&#26377;&#38480;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#36817;&#20284;&#35299;&#36824;&#21487;&#20197;&#25552;&#20379;&#23545;&#30495;&#23454;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#30340;&#21487;&#35299;&#37322;&#27934;&#23519;&#12290;</title><link>http://arxiv.org/abs/2206.10121</link><description>&lt;p&gt;
&#29992;&#20110;&#27714;&#35299;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Finite Expression Method for Solving High-Dimensional Partial Differential Equations. (arXiv:2206.10121v3 [math.NA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.10121
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;&#65288;FEX&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#20855;&#26377;&#26377;&#38480;&#20010;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#23547;&#25214;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#36817;&#20284;&#35299;&#12290;&#36890;&#36807;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#23558;FEX&#24212;&#29992;&#20110;&#21508;&#31181;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#21487;&#20197;&#23454;&#29616;&#39640;&#24230;&#20934;&#30830;&#30340;&#27714;&#35299;&#65292;&#24182;&#19988;&#36991;&#20813;&#20102;&#32500;&#24230;&#28798;&#38590;&#12290;&#36825;&#31181;&#26377;&#38480;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#36817;&#20284;&#35299;&#36824;&#21487;&#20197;&#25552;&#20379;&#23545;&#30495;&#23454;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#30340;&#21487;&#35299;&#37322;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#39640;&#25928;&#20934;&#30830;&#30340;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#25968;&#20540;&#27714;&#35299;&#22120;&#20173;&#28982;&#26159;&#35745;&#31639;&#31185;&#23398;&#21644;&#24037;&#31243;&#20013;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#21644;&#37325;&#35201;&#24615;&#30340;&#35838;&#39064;&#65292;&#20027;&#35201;&#26159;&#30001;&#20110;&#22312;&#35774;&#35745;&#33021;&#22815;&#25353;&#32500;&#25968;&#36827;&#34892;&#25193;&#23637;&#30340;&#25968;&#20540;&#26041;&#26696;&#20013;&#23384;&#22312;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#20855;&#26377;&#26377;&#38480;&#20010;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#23547;&#25214;&#36817;&#20284;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#65292;&#22240;&#27492;&#23558;&#35813;&#26041;&#27861;&#21629;&#21517;&#20026;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;&#65288;FEX&#65289;&#12290;&#22312;&#36817;&#20284;&#29702;&#35770;&#20013;&#35777;&#26126;&#20102;FEX&#21487;&#20197;&#36991;&#20813;&#32500;&#24230;&#28798;&#38590;&#12290;&#20316;&#20026;&#27010;&#24565;&#35777;&#26126;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#19981;&#21516;&#32500;&#24230;&#19978;&#23454;&#29616;FEX&#27714;&#35299;&#21508;&#31181;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#23454;&#29616;&#20102;&#39640;&#29978;&#33267;&#26426;&#22120;&#31934;&#24230;&#65292;&#24182;&#20855;&#26377;&#22810;&#39033;&#24335;&#32500;&#24230;&#30340;&#35760;&#24518;&#22797;&#26434;&#24230;&#21644;&#21487;&#25805;&#20316;&#30340;&#26102;&#38388;&#22797;&#26434;&#24230;&#12290;&#20855;&#26377;&#26377;&#38480;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#36817;&#20284;&#35299;&#36824;&#20026;&#22320;&#38754;&#30495;&#23454;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#25552;&#20379;&#20102;&#21487;&#35299;&#37322;&#30340;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
Designing efficient and accurate numerical solvers for high-dimensional partial differential equations (PDEs) remains a challenging and important topic in computational science and engineering, mainly due to the "curse of dimensionality" in designing numerical schemes that scale in dimension. This paper introduces a new methodology that seeks an approximate PDE solution in the space of functions with finitely many analytic expressions and, hence, this methodology is named the finite expression method (FEX). It is proved in approximation theory that FEX can avoid the curse of dimensionality. As a proof of concept, a deep reinforcement learning method is proposed to implement FEX for various high-dimensional PDEs in different dimensions, achieving high and even machine accuracy with a memory complexity polynomial in dimension and an amenable time complexity. An approximate solution with finite analytic expressions also provides interpretable insights into the ground truth PDE solution, w
&lt;/p&gt;</description></item></channel></rss>