<rss version="2.0"><channel><title>Chat Arxiv cs.PF</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PF</description><item><title>InkStream&#26159;&#19968;&#31181;&#22312;&#27969;&#24335;&#22270;&#19978;&#36827;&#34892;&#23454;&#26102;&#25512;&#29702;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#22686;&#37327;&#26356;&#26032;&#33410;&#28857;&#23884;&#20837;&#26469;&#35299;&#20915;&#20256;&#32479;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#27969;&#24335;&#22270;&#19978;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2309.11071</link><description>&lt;p&gt;
InkStream: &#36890;&#36807;&#22686;&#37327;&#26356;&#26032;&#22312;&#27969;&#24335;&#22270;&#19978;&#36827;&#34892;&#23454;&#26102;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
InkStream: Real-time GNN Inference on Streaming Graphs via Incremental Update. (arXiv:2309.11071v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11071
&lt;/p&gt;
&lt;p&gt;
InkStream&#26159;&#19968;&#31181;&#22312;&#27969;&#24335;&#22270;&#19978;&#36827;&#34892;&#23454;&#26102;&#25512;&#29702;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#22686;&#37327;&#26356;&#26032;&#33410;&#28857;&#23884;&#20837;&#26469;&#35299;&#20915;&#20256;&#32479;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#27969;&#24335;&#22270;&#19978;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#25512;&#29702;&#26041;&#27861;&#36866;&#29992;&#20110;&#38745;&#24577;&#22270;&#65292;&#32780;&#23545;&#20110;&#38543;&#26102;&#38388;&#28436;&#21464;&#30340;&#27969;&#24335;&#22270;&#21017;&#19981;&#21512;&#36866;&#12290;&#27969;&#24335;&#22270;&#30340;&#21160;&#24577;&#24615;&#38656;&#35201;&#36827;&#34892;&#25345;&#32493;&#30340;&#26356;&#26032;&#65292;&#23545;GPU&#21152;&#36895;&#25552;&#20986;&#20102;&#29420;&#29305;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#22522;&#20110;&#20004;&#20010;&#20851;&#38190;&#35266;&#28857;&#26469;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65306;&#65288;1&#65289;&#22312;k-hop&#37051;&#22495;&#20869;&#65292;&#24403;&#27169;&#22411;&#20351;&#29992;&#26368;&#23567;&#25110;&#26368;&#22823;&#32858;&#21512;&#20989;&#25968;&#26102;&#65292;&#21482;&#26377;&#19968;&#23567;&#37096;&#20998;&#33410;&#28857;&#21463;&#21040;&#20462;&#25913;&#36793;&#30340;&#24433;&#21709;&#65307;&#65288;2&#65289;&#24403;&#27169;&#22411;&#26435;&#37325;&#20445;&#25345;&#38745;&#24577;&#32780;&#22270;&#32467;&#26500;&#21457;&#29983;&#21464;&#21270;&#26102;&#65292;&#33410;&#28857;&#23884;&#20837;&#21487;&#20197;&#36890;&#36807;&#20165;&#35745;&#31639;&#37051;&#22495;&#30340;&#21463;&#24433;&#21709;&#37096;&#20998;&#26469;&#36880;&#27493;&#28436;&#21270;&#12290;&#22522;&#20110;&#36825;&#20123;&#35266;&#28857;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;InkStream&#65292;&#26088;&#22312;&#23454;&#29616;&#23454;&#26102;&#25512;&#29702;&#65292;&#26368;&#23567;&#21270;&#20869;&#23384;&#35775;&#38382;&#21644;&#35745;&#31639;&#65292;&#24182;&#30830;&#20445;&#19982;&#20256;&#32479;&#26041;&#27861;&#30456;&#21516;&#30340;&#36755;&#20986;&#12290;InkStream&#30340;&#25805;&#20316;&#21407;&#21017;&#26159;&#20165;&#22312;&#24517;&#35201;&#26102;&#20256;&#25773;&#21644;&#33719;&#21462;&#25968;&#25454;&#12290;&#23427;&#20351;&#29992;&#22522;&#20110;&#20107;&#20214;&#30340;&#31995;&#32479;&#26469;&#25511;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classic Graph Neural Network (GNN) inference approaches, designed for static graphs, are ill-suited for streaming graphs that evolve with time. The dynamism intrinsic to streaming graphs necessitates constant updates, posing unique challenges to acceleration on GPU. We address these challenges based on two key insights: (1) Inside the $k$-hop neighborhood, a significant fraction of the nodes is not impacted by the modified edges when the model uses min or max as aggregation function; (2) When the model weights remain static while the graph structure changes, node embeddings can incrementally evolve over time by computing only the impacted part of the neighborhood. With these insights, we propose a novel method, InkStream, designed for real-time inference with minimal memory access and computation, while ensuring an identical output to conventional methods. InkStream operates on the principle of propagating and fetching data only when necessary. It uses an event-based system to control 
&lt;/p&gt;</description></item></channel></rss>