<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#35774;&#35745;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;&#65292;&#20197;&#20248;&#21270;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#33455;&#29255;&#35774;&#35745;&#20013;&#30340;&#24212;&#29992;&#33021;&#21147;&#65292;&#24182;&#35299;&#20915;&#20102;Verilog&#25968;&#25454;&#21294;&#20047;&#21644;&#35757;&#32451;&#25968;&#25454;&#20934;&#22791;&#26102;&#38388;&#38271;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2403.11202</link><description>&lt;p&gt;
&#25968;&#25454;&#23601;&#26159;&#20320;&#38656;&#35201;&#30340;&#19968;&#20999;&#65306;&#36890;&#36807;&#33258;&#21160;&#35774;&#35745;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;&#23545;LLM&#36827;&#34892;&#33455;&#29255;&#35774;&#35745;&#24494;&#35843;
&lt;/p&gt;
&lt;p&gt;
Data is all you need: Finetuning LLMs for Chip Design via an Automated design-data augmentation framework
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11202
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#35774;&#35745;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;&#65292;&#20197;&#20248;&#21270;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#33455;&#29255;&#35774;&#35745;&#20013;&#30340;&#24212;&#29992;&#33021;&#21147;&#65292;&#24182;&#35299;&#20915;&#20102;Verilog&#25968;&#25454;&#21294;&#20047;&#21644;&#35757;&#32451;&#25968;&#25454;&#20934;&#22791;&#26102;&#38388;&#38271;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#36827;&#23637;&#34920;&#26126;&#65292;&#23427;&#20204;&#22312;&#39640;&#23618;&#25552;&#31034;&#19979;&#33258;&#21160;&#29983;&#25104;&#30828;&#20214;&#25551;&#36848;&#35821;&#35328;&#65288;HDL&#65289;&#20195;&#30721;&#30340;&#28508;&#21147;&#12290;&#30740;&#31350;&#20154;&#21592;&#21033;&#29992;&#24494;&#35843;&#26469;&#22686;&#24378;&#36825;&#20123;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#22312;&#33455;&#29255;&#35774;&#35745;&#39046;&#22495;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#32570;&#20047;Verilog&#25968;&#25454;&#38459;&#30861;&#20102;LLMs&#22312;Verilog&#29983;&#25104;&#36136;&#37327;&#19978;&#30340;&#36827;&#19968;&#27493;&#25552;&#21319;&#12290;&#27492;&#22806;&#65292;&#32570;&#23569;Verilog&#21644;&#30005;&#23376;&#35774;&#35745;&#33258;&#21160;&#21270;&#65288;EDA&#65289;&#33050;&#26412;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;&#26174;&#30528;&#22686;&#21152;&#20102;&#20026;LLM&#35757;&#32451;&#22120;&#20934;&#22791;&#35757;&#32451;&#25968;&#25454;&#38598;&#25152;&#38656;&#30340;&#26102;&#38388;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#35774;&#35745;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;&#65292;&#23427;&#29983;&#25104;&#19982;Verilog&#21644;EDA&#33050;&#26412;&#23545;&#40784;&#30340;&#22823;&#37327;&#39640;&#36136;&#37327;&#33258;&#28982;&#35821;&#35328;&#12290;&#23545;&#20110;Verilog&#29983;&#25104;&#65292;&#23427;&#23558;Verilog&#25991;&#20214;&#36716;&#25442;&#20026;&#25277;&#35937;&#35821;&#27861;&#26641;&#65292;&#28982;&#21518;&#23558;&#33410;&#28857;&#26144;&#23556;&#21040;&#20855;&#26377;&#39044;&#23450;&#20041;&#27169;&#26495;&#30340;&#33258;&#28982;&#35821;&#35328;&#12290;&#23545;&#20110;Verilog&#20462;&#22797;&#65292;&#23427;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11202v1 Announce Type: cross  Abstract: Recent advances in large language models have demonstrated their potential for automated generation of hardware description language (HDL) code from high-level prompts. Researchers have utilized fine-tuning to enhance the ability of these large language models (LLMs) in the field of Chip Design. However, the lack of Verilog data hinders further improvement in the quality of Verilog generation by LLMs. Additionally, the absence of a Verilog and Electronic Design Automation (EDA) script data augmentation framework significantly increases the time required to prepare the training dataset for LLM trainers. This paper proposes an automated design-data augmentation framework, which generates high-volume and high-quality natural language aligned with Verilog and EDA scripts. For Verilog generation, it translates Verilog files to an abstract syntax tree and then maps nodes to natural language with a predefined template. For Verilog repair, it 
&lt;/p&gt;</description></item></channel></rss>