<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#37327;&#35299;&#26512;&#22120;&#65292;&#36890;&#36807;&#23545;&#19978;&#19979;&#25991;&#25935;&#24863;&#35821;&#27861;&#36827;&#34892;&#39640;&#25928;&#24038;&#21491;&#21830;&#65292;&#23454;&#29616;&#20102;&#23545;&#35821;&#27861;&#27491;&#30830;&#24615;&#30340;&#26089;&#26399;&#25298;&#32477;&#21644;&#23545;&#23436;&#25972;&#31243;&#24207;&#30340;&#26377;&#25928;&#26816;&#27979;&#12290;</title><link>https://arxiv.org/abs/2402.17988</link><description>&lt;p&gt;
&#36890;&#36807;&#23545;&#19978;&#19979;&#25991;&#25935;&#24863;&#35821;&#27861;&#36827;&#34892;&#39640;&#25928;&#24038;&#21491;&#21830;&#65292;&#22312;&#20195;&#30721;&#35821;&#35328;&#27169;&#22411;&#30340;&#32422;&#26463;&#35299;&#30721;
&lt;/p&gt;
&lt;p&gt;
Constrained Decoding for Code Language Models via Efficient Left and Right Quotienting of Context-Sensitive Grammars
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17988
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#37327;&#35299;&#26512;&#22120;&#65292;&#36890;&#36807;&#23545;&#19978;&#19979;&#25991;&#25935;&#24863;&#35821;&#27861;&#36827;&#34892;&#39640;&#25928;&#24038;&#21491;&#21830;&#65292;&#23454;&#29616;&#20102;&#23545;&#35821;&#27861;&#27491;&#30830;&#24615;&#30340;&#26089;&#26399;&#25298;&#32477;&#21644;&#23545;&#23436;&#25972;&#31243;&#24207;&#30340;&#26377;&#25928;&#26816;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#31243;&#24207;&#21512;&#25104;&#21644;&#39640;&#32423;&#33258;&#21160;&#23436;&#25104;&#30340;&#24378;&#22823;&#24037;&#20855;&#65292;&#20294;&#19981;&#33021;&#20445;&#35777;&#20854;&#36755;&#20986;&#20195;&#30721;&#22312;&#35821;&#27861;&#19978;&#26159;&#27491;&#30830;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#37327;&#35299;&#26512;&#22120;&#65292;&#20801;&#35768;&#26089;&#26399;&#25298;&#32477;&#35821;&#27861;&#19978;&#19981;&#27491;&#30830;&#30340;&#20195;&#30721;&#65292;&#24182;&#19988;&#33021;&#22815;&#26377;&#25928;&#26816;&#27979;&#29992;&#20110;&#22635;&#20805;&#20219;&#21153;&#30340;&#23436;&#25972;&#31243;&#24207;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#33021;&#22815;&#22312;&#20219;&#24847;&#19978;&#19979;&#25991;&#26080;&#20851;&#35821;&#27861;&#30340;&#24038;&#21491;&#21830;&#19978;&#25805;&#20316;&#30340;Earley&#24335;&#35299;&#26512;&#22120;&#65292;&#24182;&#23558;&#22686;&#37327;&#35299;&#26512;&#21644;&#21830;&#25805;&#20316;&#25193;&#23637;&#21040;&#35768;&#22810;&#24120;&#35265;&#32534;&#31243;&#35821;&#35328;&#30340;&#35821;&#27861;&#20013;&#23384;&#22312;&#30340;&#20960;&#20010;&#19978;&#19979;&#25991;&#25935;&#24863;&#29305;&#24615;&#12290;&#36825;&#20123;&#36129;&#29486;&#30340;&#32467;&#26524;&#26159;&#19968;&#31181;&#39640;&#25928;&#12289;&#36890;&#29992;&#21644;&#25166;&#23454;&#30340;&#24038;&#21491;&#21830;&#35299;&#26512;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17988v1 Announce Type: cross  Abstract: Large Language Models are powerful tools for program synthesis and advanced auto-completion, but come with no guarantee that their output code is syntactically correct. This paper contributes an incremental parser that allows early rejection of syntactically incorrect code, as well as efficient detection of complete programs for fill-in-the-middle (FItM) tasks. We develop Earley-style parsers that operate over left and right quotients of arbitrary context-free grammars, and we extend our incremental parsing and quotient operations to several context-sensitive features present in the grammars of many common programming languages. The result of these contributions is an efficient, general, and well-grounded method for left and right quotient parsing.   To validate our theoretical contributions -- and the practical effectiveness of certain design decisions -- we evaluate our method on the particularly difficult case of FItM completion for
&lt;/p&gt;</description></item></channel></rss>