<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20840;&#23616;&#23454;&#38469;&#25490;&#21517;&#26041;&#27861;&#26469;&#20998;&#25674;&#23454;&#38469;&#31243;&#24207;&#21512;&#25104;&#20013;&#35745;&#31639;&#36127;&#25285;&#30340;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#20351;&#29992;&#21333;&#20010;&#28436;&#31034;&#30340;&#23454;&#38469;&#21512;&#25104;&#22120;&#65292;&#24182;&#19988;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#23637;&#31034;&#20102;&#20840;&#23616;&#25490;&#21517;&#26377;&#25928;&#36817;&#20284;&#20102;&#20840;&#20307;&#21512;&#29702;&#21709;&#24212;&#12290;</title><link>http://arxiv.org/abs/2309.03225</link><description>&lt;p&gt;
&#20351;&#29992;&#25490;&#21517;&#26469;&#25674;&#38144;&#23454;&#38469;&#31243;&#24207;&#21512;&#25104;&#30340;&#25104;&#26412;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Amortizing Pragmatic Program Synthesis with Rankings. (arXiv:2309.03225v1 [cs.PL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03225
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20840;&#23616;&#23454;&#38469;&#25490;&#21517;&#26041;&#27861;&#26469;&#20998;&#25674;&#23454;&#38469;&#31243;&#24207;&#21512;&#25104;&#20013;&#35745;&#31639;&#36127;&#25285;&#30340;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#20351;&#29992;&#21333;&#20010;&#28436;&#31034;&#30340;&#23454;&#38469;&#21512;&#25104;&#22120;&#65292;&#24182;&#19988;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#23637;&#31034;&#20102;&#20840;&#23616;&#25490;&#21517;&#26377;&#25928;&#36817;&#20284;&#20102;&#20840;&#20307;&#21512;&#29702;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31243;&#24207;&#21512;&#25104;&#20013;&#65292;&#19968;&#20010;&#26234;&#33021;&#31995;&#32479;&#25509;&#25910;&#19968;&#32452;&#29992;&#25143;&#29983;&#25104;&#30340;&#31034;&#20363;&#65292;&#24182;&#36820;&#22238;&#19968;&#20010;&#36923;&#36753;&#19968;&#33268;&#30340;&#31243;&#24207;&#12290;&#20351;&#29992;&#21512;&#29702;&#28436;&#35828;&#34892;&#20026;&#65288;RSA&#65289;&#26694;&#26550;&#22312;&#26500;&#24314;&#8220;&#23454;&#38469;&#8221;&#31243;&#24207;&#21512;&#25104;&#22120;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#36825;&#20123;&#21512;&#25104;&#22120;&#36820;&#22238;&#30340;&#31243;&#24207;&#19981;&#20165;&#22312;&#36923;&#36753;&#19978;&#19968;&#33268;&#65292;&#32780;&#19988;&#36824;&#32771;&#34385;&#20102;&#29992;&#25143;&#22914;&#20309;&#36873;&#25321;&#31034;&#20363;&#12290;&#28982;&#32780;&#65292;&#36816;&#34892;RSA&#31639;&#27861;&#30340;&#35745;&#31639;&#36127;&#25285;&#38480;&#21046;&#20102;&#23454;&#38469;&#31243;&#24207;&#21512;&#25104;&#22312;&#21487;&#33021;&#31243;&#24207;&#20010;&#25968;&#36739;&#23569;&#30340;&#39046;&#22495;&#30340;&#24212;&#29992;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21033;&#29992;&#8220;&#20840;&#23616;&#23454;&#38469;&#25490;&#21517;&#8221; - &#19968;&#20010;&#21333;&#19968;&#30340;&#12289;&#24635;&#30340;&#25490;&#21015;&#25152;&#26377;&#20551;&#35774;&#30340;&#26041;&#27861;&#26469;&#20998;&#25674;RSA&#31639;&#27861;&#30340;&#35745;&#31639;&#36127;&#25285;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#20351;&#29992;&#21333;&#20010;&#28436;&#31034;&#30340;&#23454;&#38469;&#21512;&#25104;&#22120;&#20013;&#65292;&#25105;&#20204;&#30340;&#20840;&#23616;&#25490;&#21517;&#26041;&#27861;&#23436;&#20840;&#22797;&#21046;&#20102;RSA&#30340;&#25490;&#24207;&#21709;&#24212;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#26174;&#31034;&#65292;&#20840;&#23616;&#25490;&#21517;&#26377;&#25928;&#22320;&#36817;&#20284;&#20102;&#20840;&#20307;&#21512;&#29702;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
In program synthesis, an intelligent system takes in a set of user-generated examples and returns a program that is logically consistent with these examples. The usage of Rational Speech Acts (RSA) framework has been successful in building \emph{pragmatic} program synthesizers that return programs which -in addition to being logically consistent -- account for the fact that a user chooses their examples informatively. However, the computational burden of running the RSA algorithm has restricted the application of pragmatic program synthesis to domains with a small number of possible programs. This work presents a novel method of amortizing the RSA algorithm by leveraging a \emph{global pragmatic ranking} -- a single, total ordering of all the hypotheses. We prove that for a pragmatic synthesizer that uses a single demonstration, our global ranking method exactly replicates RSA's ranked responses. We further empirically show that global rankings effectively approximate the full pragma
&lt;/p&gt;</description></item></channel></rss>