<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>&#26412;&#25991;&#25193;&#23637;&#20102;Agda&#29983;&#24577;&#31995;&#32479;&#21040;&#26426;&#22120;&#23398;&#20064;&#39046;&#22495;&#65292;&#24182;&#21457;&#24067;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20381;&#36182;&#31867;&#22411;&#32534;&#31243;&#35821;&#35328;&#30340;&#35777;&#26126;&#25968;&#25454;&#38598;&#12290;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#32467;&#26500;&#32780;&#38750;&#21629;&#21517;&#21407;&#21017;&#30340;&#26032;&#39062;&#31070;&#32463;&#26550;&#26500;&#65292;&#25105;&#20204;&#33021;&#22815;&#20934;&#30830;&#22320;&#34920;&#31034;&#20381;&#36182;&#31867;&#22411;&#31243;&#24207;&#65292;&#24182;&#22312;&#21069;&#25552;&#36873;&#25321;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#24378;&#22823;&#30340;&#21021;&#27493;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.02104</link><description>&lt;p&gt;
&#23398;&#20064;&#20381;&#36182;&#31867;&#22411;&#30340;&#32467;&#26500;&#24863;&#30693;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Learning Structure-Aware Representations of Dependent Types
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25193;&#23637;&#20102;Agda&#29983;&#24577;&#31995;&#32479;&#21040;&#26426;&#22120;&#23398;&#20064;&#39046;&#22495;&#65292;&#24182;&#21457;&#24067;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20381;&#36182;&#31867;&#22411;&#32534;&#31243;&#35821;&#35328;&#30340;&#35777;&#26126;&#25968;&#25454;&#38598;&#12290;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#32467;&#26500;&#32780;&#38750;&#21629;&#21517;&#21407;&#21017;&#30340;&#26032;&#39062;&#31070;&#32463;&#26550;&#26500;&#65292;&#25105;&#20204;&#33021;&#22815;&#20934;&#30830;&#22320;&#34920;&#31034;&#20381;&#36182;&#31867;&#22411;&#31243;&#24207;&#65292;&#24182;&#22312;&#21069;&#25552;&#36873;&#25321;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#24378;&#22823;&#30340;&#21021;&#27493;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Agda&#26159;&#19968;&#31181;&#20381;&#36182;&#31867;&#22411;&#32534;&#31243;&#35821;&#35328;&#21644;&#35777;&#26126;&#21161;&#25163;&#65292;&#22312;&#35777;&#26126;&#24418;&#24335;&#21270;&#21644;&#32534;&#31243;&#35821;&#35328;&#29702;&#35770;&#20013;&#36215;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#26412;&#25991;&#23558;Agda&#29983;&#24577;&#31995;&#32479;&#25193;&#23637;&#21040;&#26426;&#22120;&#23398;&#20064;&#39046;&#22495;&#65292;&#24182;&#21453;&#36807;&#26469;&#20351;&#26426;&#22120;&#23398;&#20064;&#20174;&#19994;&#32773;&#33021;&#22815;&#20351;&#29992;Agda&#30456;&#20851;&#36164;&#28304;&#12290;&#25105;&#20204;&#20171;&#32461;&#24182;&#21457;&#24067;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;Agda&#31243;&#24207;&#35777;&#26126;&#25968;&#25454;&#38598;&#65292;&#35813;&#25968;&#25454;&#38598;&#26082;&#35814;&#23613;&#21448;&#24191;&#27867;&#65292;&#21487;&#20197;&#25903;&#25345;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#65292;&#36825;&#26159;&#39318;&#20010;&#36825;&#26679;&#30340;&#25968;&#25454;&#38598;&#12290;&#21033;&#29992;&#25968;&#25454;&#38598;&#30340;&#36229;&#39640;&#20998;&#36776;&#29575;&#65292;&#35814;&#32454;&#23637;&#31034;&#20102;&#20122;&#22411;&#32423;&#21035;&#30340;&#35777;&#26126;&#29366;&#24577;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32467;&#26500;&#32780;&#19981;&#26159;&#21629;&#21517;&#21407;&#21017;&#20934;&#30830;&#34920;&#31034;&#20381;&#36182;&#31867;&#22411;&#31243;&#24207;&#30340;&#26032;&#39062;&#31070;&#32463;&#26550;&#26500;&#12290;&#25105;&#20204;&#22312;&#21069;&#25552;&#36873;&#25321;&#35774;&#32622;&#20013;&#23454;&#20363;&#21270;&#21644;&#35780;&#20272;&#25105;&#20204;&#30340;&#26550;&#26500;&#65292;&#21462;&#24471;&#20102;&#24378;&#22823;&#30340;&#21021;&#27493;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Agda is a dependently-typed programming language and a proof assistant, pivotal in proof formalization and programming language theory. This paper extends the Agda ecosystem into machine learning territory, and, vice versa, makes Agda-related resources available to machine learning practitioners. We introduce and release a novel dataset of Agda program-proofs that is elaborate and extensive enough to support various machine learning applications -- the first of its kind. Leveraging the dataset's ultra-high resolution, detailing proof states at the sub-type level, we propose a novel neural architecture targeted at faithfully representing dependently-typed programs on the basis of structural rather than nominal principles. We instantiate and evaluate our architecture in a premise selection setup, where it achieves strong initial results.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20195;&#30721;&#30456;&#20114;&#36716;&#25442;&#26041;&#27861;&#65292;&#21033;&#29992;&#27880;&#24847;&#21147;&#26426;&#21046;&#12289;&#32534;&#35793;&#21644;&#31526;&#21495;&#25191;&#34892;&#27979;&#35797;&#29983;&#25104;&#36827;&#34892;&#31561;&#20215;&#27979;&#35797;&#12290;&#22312;&#24191;&#27867;&#30340;&#23454;&#39564;&#20013;&#65292;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#32534;&#35793;&#21644;&#36816;&#34892;&#26102;&#31561;&#20215;&#20934;&#30830;&#24615;&#31561;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#36716;&#25442;&#22120;&#21644;&#32763;&#35793;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2306.06755</link><description>&lt;p&gt;
&#27880;&#24847;&#21147;&#12289;&#32534;&#35793;&#21644;&#22522;&#20110;&#27714;&#35299;&#22120;&#30340;&#31526;&#21495;&#20998;&#26512;&#26159;&#24744;&#25152;&#38656;&#35201;&#30340;&#19968;&#20999;
&lt;/p&gt;
&lt;p&gt;
Attention, Compilation, and Solver-based Symbolic Analysis are All You Need. (arXiv:2306.06755v2 [cs.PL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.06755
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20195;&#30721;&#30456;&#20114;&#36716;&#25442;&#26041;&#27861;&#65292;&#21033;&#29992;&#27880;&#24847;&#21147;&#26426;&#21046;&#12289;&#32534;&#35793;&#21644;&#31526;&#21495;&#25191;&#34892;&#27979;&#35797;&#29983;&#25104;&#36827;&#34892;&#31561;&#20215;&#27979;&#35797;&#12290;&#22312;&#24191;&#27867;&#30340;&#23454;&#39564;&#20013;&#65292;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#32534;&#35793;&#21644;&#36816;&#34892;&#26102;&#31561;&#20215;&#20934;&#30830;&#24615;&#31561;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#36716;&#25442;&#22120;&#21644;&#32763;&#35793;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;Java&#21040;Python&#65288;J2P&#65289;&#21644;Python&#21040;Java&#65288;P2J&#65289;&#20195;&#30721;&#30456;&#20114;&#36716;&#25442;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#21517;&#20026;CoTran&#30340;&#30456;&#20851;&#24037;&#20855;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#27880;&#24847;&#21147;&#26426;&#21046;&#12289;&#32534;&#35793;&#21644;&#22522;&#20110;&#31526;&#21495;&#25191;&#34892;&#30340;&#27979;&#35797;&#29983;&#25104;&#65292;&#29992;&#20110;&#36755;&#20837;&#21644;&#36755;&#20986;&#31243;&#24207;&#20043;&#38388;&#30340;&#31561;&#20215;&#27979;&#35797;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20462;&#25913;&#20102;&#20856;&#22411;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#35757;&#32451;&#24490;&#29615;&#65292;&#21152;&#20837;&#20102;&#32534;&#35793;&#22120;&#21644;&#31526;&#21495;&#25191;&#34892;&#25439;&#22833;&#12290;&#36890;&#36807;&#22312;&#36229;&#36807;57,000&#20010;Java-Python&#31561;&#20215;&#23545;&#30340;&#22522;&#20934;&#27979;&#35797;&#20013;&#23558;CoTran&#19982;&#20854;&#20182;12&#20010;&#36716;&#25442;&#22120;&#21644;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32763;&#35793;&#24037;&#20855;&#36827;&#34892;&#24191;&#27867;&#30340;&#23454;&#39564;&#27604;&#36739;&#65292;&#25105;&#20204;&#21457;&#29616;CoTran&#22312;&#35832;&#22914;&#32534;&#35793;&#21644;&#36816;&#34892;&#26102;&#31561;&#20215;&#20934;&#30830;&#24615;&#31561;&#30456;&#20851;&#25351;&#26631;&#19978;&#34920;&#29616;&#20248;&#20110;&#23427;&#20204;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#30340;&#24037;&#20855;&#22312;J2P&#36716;&#25442;&#20013;&#33719;&#24471;97.43%&#30340;&#32534;&#35793;&#20934;&#30830;&#24615;&#21644;49.66%&#30340;&#36816;&#34892;&#26102;&#31561;&#20215;&#20934;&#30830;&#24615;&#65292;&#32780;&#26368;&#25509;&#36817;&#30340;&#31454;&#20105;&#24037;&#20855;&#20998;&#21035;&#21482;&#26377;92.84%&#21644;40.95%&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we present a Java-to-Python (J2P) and Python-to-Java (P2J) back-to-back code translation method, and an associated tool called CoTran, based on large language models (LLMs). Our method leverages the attention mechanism of LLMs, compilation, and symbolic execution-based test generation for equivalence testing between the input and output programs. More precisely, we modify the typical LLM training loop to incorporate compiler and symbolic execution loss. Via extensive experiments comparing CoTran with 12 other transpilers and LLM-based translation tools over a benchmark of more than 57,000 Java-Python equivalent pairs, we show that CoTran outperforms them on relevant metrics such as compilation and runtime equivalence accuracy. For example, our tool gets 97.43% compilation accuracy and 49.66% runtime equivalence accuracy for J2P translation, whereas the nearest competing tool only gets 92.84% and 40.95% respectively.
&lt;/p&gt;</description></item></channel></rss>