<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>&#26412;&#25991;&#36890;&#36807;&#24212;&#29992;&#35745;&#31639;&#35748;&#30693;&#31185;&#23398;&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#36890;&#36807;&#35843;&#35797;&#24515;&#26234;&#27169;&#22411;&#35299;&#37322;&#20196;&#20154;&#22256;&#24785;&#31243;&#24207;&#34892;&#20026;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.05334</link><description>&lt;p&gt;
WatChat&#65306;&#36890;&#36807;&#35843;&#35797;&#24515;&#26234;&#27169;&#22411;&#35299;&#37322;&#20196;&#20154;&#22256;&#24785;&#30340;&#31243;&#24207;
&lt;/p&gt;
&lt;p&gt;
WatChat: Explaining perplexing programs by debugging mental models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05334
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24212;&#29992;&#35745;&#31639;&#35748;&#30693;&#31185;&#23398;&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#36890;&#36807;&#35843;&#35797;&#24515;&#26234;&#27169;&#22411;&#35299;&#37322;&#20196;&#20154;&#22256;&#24785;&#31243;&#24207;&#34892;&#20026;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#24120;&#65292;&#35299;&#37322;&#31243;&#24207;&#24847;&#22806;&#34892;&#20026;&#30340;&#19968;&#20010;&#22909;&#26041;&#27861;&#26159;&#31243;&#24207;&#21592;&#20195;&#30721;&#20013;&#30340;&#38169;&#35823;&#12290;&#20294;&#26377;&#26102;&#65292;&#19968;&#20010;&#26356;&#22909;&#30340;&#35299;&#37322;&#26159;&#31243;&#24207;&#21592;&#23545;&#25152;&#20351;&#29992;&#35821;&#35328;&#30340;&#24515;&#26234;&#27169;&#22411;&#20013;&#23384;&#22312;&#38169;&#35823;&#12290;&#25105;&#20204;&#19981;&#20165;&#20165;&#35843;&#35797;&#24403;&#21069;&#20195;&#30721;&#65288;&#8220;&#32473;&#31243;&#24207;&#21592;&#19968;&#26465;&#40060;&#8221;&#65289;&#65292;&#32780;&#26159;&#24076;&#26395;&#25105;&#20204;&#30340;&#24037;&#20855;&#33021;&#30452;&#25509;&#35843;&#35797;&#25105;&#20204;&#30340;&#24515;&#26234;&#27169;&#22411;&#65288;&#8220;&#25945;&#20250;&#31243;&#24207;&#21592;&#22914;&#20309;&#25429;&#40060;&#8221;&#65289;&#12290;&#26412;&#25991;&#23558;&#35745;&#31639;&#35748;&#30693;&#31185;&#23398;&#30340;&#24605;&#24819;&#24212;&#29992;&#21040;&#20854;&#20013;&#65292;&#23545;&#20196;&#20154;&#22256;&#24785;&#30340;&#31243;&#24207;&#65292;&#25105;&#20204;&#20351;&#29992;&#31243;&#24207;&#32508;&#21512;&#25216;&#26415;&#33258;&#21160;&#25512;&#26029;&#21487;&#33021;&#23548;&#33268;&#29992;&#25143;&#23545;&#31243;&#24207;&#34892;&#20026;&#24863;&#21040;&#24778;&#35766;&#30340;&#35823;&#35299;&#12290;&#36890;&#36807;&#20998;&#26512;&#36825;&#20123;&#35823;&#35299;&#65292;&#25105;&#20204;&#25552;&#20379;&#31616;&#26126;&#12289;&#26377;&#29992;&#30340;&#31243;&#24207;&#34892;&#20026;&#35299;&#37322;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#29978;&#33267;&#21487;&#20197;&#34987;&#21453;&#36716;&#65292;&#20197;&#32508;&#21512;&#25945;&#23398;&#31034;&#33539;&#31243;&#24207;&#26469;&#35786;&#26029;&#21644;&#32416;&#27491;&#23398;&#29983;&#30340;&#35823;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05334v1 Announce Type: cross  Abstract: Often, a good explanation for a program's unexpected behavior is a bug in the programmer's code. But sometimes, an even better explanation is a bug in the programmer's mental model of the language they are using. Instead of merely debugging our current code ("giving the programmer a fish"), what if our tools could directly debug our mental models ("teaching the programmer to fish")? In this paper, we apply ideas from computational cognitive science to do exactly that. Given a perplexing program, we use program synthesis techniques to automatically infer potential misconceptions that might cause the user to be surprised by the program's behavior. By analyzing these misconceptions, we provide succinct, useful explanations of the program's behavior. Our methods can even be inverted to synthesize pedagogical example programs for diagnosing and correcting misconceptions in students.
&lt;/p&gt;</description></item></channel></rss>