<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>GPT-4&#22312;&#29983;&#25104;&#32534;&#31243;&#20195;&#30721;&#26041;&#38754;&#34920;&#29616;&#20248;&#24322;&#65292;&#29305;&#21035;&#26159;&#22312;&#36873;&#25321;&#26368;&#20339;&#25552;&#31034;&#31574;&#30053;&#26102;&#65292;&#36229;&#36807;&#20102;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;85%&#30340;&#20154;&#31867;&#21442;&#19982;&#32773;&#12290;</title><link>https://arxiv.org/abs/2403.00894</link><description>&lt;p&gt;
&#23545;&#20110;&#29983;&#25104;&#32534;&#31243;&#20195;&#30721;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#31995;&#32479;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
A systematic evaluation of large language models for generating programming code
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00894
&lt;/p&gt;
&lt;p&gt;
GPT-4&#22312;&#29983;&#25104;&#32534;&#31243;&#20195;&#30721;&#26041;&#38754;&#34920;&#29616;&#20248;&#24322;&#65292;&#29305;&#21035;&#26159;&#22312;&#36873;&#25321;&#26368;&#20339;&#25552;&#31034;&#31574;&#30053;&#26102;&#65292;&#36229;&#36807;&#20102;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;85%&#30340;&#20154;&#31867;&#21442;&#19982;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#31995;&#32479;&#35780;&#20272;&#20102;&#19971;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#20351;&#29992;&#19981;&#21516;&#25552;&#31034;&#31574;&#30053;&#12289;&#32534;&#31243;&#35821;&#35328;&#21644;&#20219;&#21153;&#38590;&#24230;&#29983;&#25104;&#32534;&#31243;&#20195;&#30721;&#26102;&#30340;&#24615;&#33021;&#12290;GPT-4&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#20248;&#20110;&#20854;&#20182;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#21253;&#25324;Gemini Ultra&#21644;Claude 2&#12290;GPT-4&#30340;&#32534;&#30721;&#24615;&#33021;&#38543;&#19981;&#21516;&#25552;&#31034;&#31574;&#30053;&#32780;&#21464;&#21270;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#35780;&#20272;&#30340;&#22823;&#22810;&#25968;LeetCode&#21644;GeeksforGeeks&#32534;&#31243;&#27604;&#36187;&#20013;&#65292;&#37319;&#29992;&#26368;&#20339;&#25552;&#31034;&#31574;&#30053;&#30340;GPT-4&#32988;&#36807;85%&#30340;&#20154;&#31867;&#21442;&#19982;&#32773;&#12290;&#27492;&#22806;&#65292;GPT-4&#34920;&#29616;&#20986;&#22312;&#19981;&#21516;&#32534;&#31243;&#35821;&#35328;&#20043;&#38388;&#32763;&#35793;&#20195;&#30721;&#21644;&#20174;&#36807;&#21435;&#38169;&#35823;&#20013;&#23398;&#20064;&#30340;&#24378;&#22823;&#33021;&#21147;&#12290;&#30001;GPT-4&#29983;&#25104;&#30340;&#20195;&#30721;&#30340;&#35745;&#31639;&#25928;&#29575;&#19982;&#20154;&#31867;&#31243;&#24207;&#21592;&#30456;&#24403;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#65292;GPT-4&#26377;&#28508;&#21147;&#25104;&#20026;&#22312;&#32534;&#31243;&#20195;&#30721;&#29983;&#25104;&#21644;&#36719;&#20214;&#24320;&#21457;&#20013;&#30340;&#21487;&#38752;&#21161;&#25163;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00894v1 Announce Type: cross  Abstract: We systematically evaluated the performance of seven large language models in generating programming code using various prompt strategies, programming languages, and task difficulties. GPT-4 substantially outperforms other large language models, including Gemini Ultra and Claude 2. The coding performance of GPT-4 varies considerably with different prompt strategies. In most LeetCode and GeeksforGeeks coding contests evaluated in this study, GPT-4 employing the optimal prompt strategy outperforms 85 percent of human participants. Additionally, GPT-4 demonstrates strong capabilities in translating code between different programming languages and in learning from past errors. The computational efficiency of the code generated by GPT-4 is comparable to that of human programmers. These results suggest that GPT-4 has the potential to serve as a reliable assistant in programming code generation and software development.
&lt;/p&gt;</description></item></channel></rss>