<rss version="2.0"><channel><title>Chat Arxiv cs.PL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.PL</description><item><title>Soda&#26159;&#19968;&#31181;&#38754;&#21521;&#23545;&#35937;&#30340;&#21151;&#33021;&#24615;&#32534;&#31243;&#35821;&#35328;&#65292;&#29992;&#20110;&#25551;&#36848;&#20197;&#20154;&#20026;&#20013;&#24515;&#30340;&#38382;&#39064;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#22788;&#29702;&#36136;&#37327;&#21644;&#25968;&#37327;&#65292;&#24182;&#36890;&#36807;&#31616;&#21333;&#30340;&#23450;&#20041;&#27169;&#22411;&#21270;&#22797;&#26434;&#35201;&#27714;&#12290;</title><link>http://arxiv.org/abs/2310.01961</link><description>&lt;p&gt;
Soda:&#19968;&#31181;&#29992;&#20110;&#25551;&#36848;&#20197;&#20154;&#20026;&#20013;&#24515;&#38382;&#39064;&#30340;&#38754;&#21521;&#23545;&#35937;&#30340;&#21151;&#33021;&#24615;&#32534;&#31243;&#35821;&#35328;
&lt;/p&gt;
&lt;p&gt;
Soda: An Object-Oriented Functional Language for Specifying Human-Centered Problems. (arXiv:2310.01961v1 [cs.PL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01961
&lt;/p&gt;
&lt;p&gt;
Soda&#26159;&#19968;&#31181;&#38754;&#21521;&#23545;&#35937;&#30340;&#21151;&#33021;&#24615;&#32534;&#31243;&#35821;&#35328;&#65292;&#29992;&#20110;&#25551;&#36848;&#20197;&#20154;&#20026;&#20013;&#24515;&#30340;&#38382;&#39064;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#22788;&#29702;&#36136;&#37327;&#21644;&#25968;&#37327;&#65292;&#24182;&#36890;&#36807;&#31616;&#21333;&#30340;&#23450;&#20041;&#27169;&#22411;&#21270;&#22797;&#26434;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;Soda&#65288;Symbolic Objective Descriptive Analysis&#65289;&#65292;&#19968;&#31181;&#35821;&#35328;&#65292;&#26377;&#21161;&#20110;&#20197;&#33258;&#28982;&#30340;&#26041;&#24335;&#22788;&#29702;&#36136;&#37327;&#21644;&#25968;&#37327;&#65292;&#24182;&#26497;&#22823;&#22320;&#31616;&#21270;&#20102;&#26816;&#26597;&#23427;&#20204;&#27491;&#30830;&#24615;&#30340;&#20219;&#21153;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#35821;&#35328;&#30340;&#20851;&#38190;&#23646;&#24615;&#65292;&#36825;&#20123;&#23646;&#24615;&#26159;&#30001;&#23545;&#35745;&#31639;&#26426;&#31995;&#32479;&#22797;&#26434;&#35201;&#27714;&#36827;&#34892;&#25551;&#36848;&#30340;&#35774;&#35745;&#25152;&#28608;&#21457;&#30340;&#65292;&#24182;&#35299;&#37322;&#20102;&#22914;&#20309;&#36890;&#36807;&#31616;&#21333;&#30340;&#23450;&#20041;&#26469;&#24314;&#27169;&#36825;&#20123;&#35201;&#27714;&#26102;&#24517;&#39035;&#35299;&#20915;&#36825;&#20123;&#20851;&#38190;&#23646;&#24615;&#12290;&#25105;&#20204;&#27010;&#36848;&#20102;&#19968;&#20010;&#24037;&#20855;&#65292;&#23427;&#26377;&#21161;&#20110;&#20197;&#26356;&#36879;&#26126;&#21644;&#26356;&#23569;&#20986;&#38169;&#30340;&#26041;&#24335;&#25551;&#36848;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present Soda (Symbolic Objective Descriptive Analysis), a language that helps to treat qualities and quantities in a natural way and greatly simplifies the task of checking their correctness. We present key properties for the language motivated by the design of a descriptive language to encode complex requirements on computer systems, and we explain how these key properties must be addressed to model these requirements with simple definitions. We give an overview of a tool that helps to describe problems in an easy way that we consider more transparent and less error-prone.
&lt;/p&gt;</description></item></channel></rss>