<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20844;&#24335;&#65292;&#29992;&#20110;&#35299;&#20915;&#31227;&#21160;&#30446;&#26631;&#26053;&#34892;&#25512;&#38144;&#21592;&#38382;&#39064;&#65292;&#35813;&#20844;&#24335;&#22522;&#20110;&#30446;&#26631;&#22312;&#31354;&#38388;-&#26102;&#38388;&#22352;&#26631;&#31995;&#20869;&#25104;&#20026;&#20984;&#38598;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#22312;&#20984;&#38598;&#22270;&#20013;&#23547;&#25214;&#26368;&#30701;&#36335;&#24452;&#26469;&#23454;&#29616;&#65292;&#22312;&#23454;&#39564;&#20013;&#34920;&#29616;&#20986;&#27604;&#24403;&#21069;Mixed Integer Conic Program (MICP)&#27714;&#35299;&#22120;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.04917</link><description>&lt;p&gt;
&#22522;&#20110;&#20984;&#38598;&#22270;&#30340;&#31227;&#21160;&#30446;&#26631;&#26053;&#34892;&#25512;&#38144;&#21592;&#38382;&#39064;&#30340;&#28151;&#21512;&#25972;&#25968;&#38181;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
A Mixed-Integer Conic Program for the Moving-Target Traveling Salesman Problem based on a Graph of Convex Sets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04917
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20844;&#24335;&#65292;&#29992;&#20110;&#35299;&#20915;&#31227;&#21160;&#30446;&#26631;&#26053;&#34892;&#25512;&#38144;&#21592;&#38382;&#39064;&#65292;&#35813;&#20844;&#24335;&#22522;&#20110;&#30446;&#26631;&#22312;&#31354;&#38388;-&#26102;&#38388;&#22352;&#26631;&#31995;&#20869;&#25104;&#20026;&#20984;&#38598;&#30340;&#27010;&#24565;&#65292;&#36890;&#36807;&#22312;&#20984;&#38598;&#22270;&#20013;&#23547;&#25214;&#26368;&#30701;&#36335;&#24452;&#26469;&#23454;&#29616;&#65292;&#22312;&#23454;&#39564;&#20013;&#34920;&#29616;&#20986;&#27604;&#24403;&#21069;Mixed Integer Conic Program (MICP)&#27714;&#35299;&#22120;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23547;&#25214;&#31227;&#21160;&#30446;&#26631;&#26053;&#34892;&#25512;&#38144;&#21592;&#38382;&#39064;&#65288;MT-TSP&#65289;&#30340;&#26368;&#20339;&#35299;&#20915;&#26041;&#26696;&#30340;&#26032;&#30340;&#20844;&#24335;&#65292;&#35813;&#38382;&#39064;&#26088;&#22312;&#25214;&#21040;&#19968;&#20010;&#26368;&#30701;&#36335;&#24452;&#65292;&#20351;&#19968;&#20010;&#20174;&#20179;&#24211;&#20986;&#21457;&#30340;&#20195;&#29702;&#35775;&#38382;&#19968;&#32452;&#31227;&#21160;&#30446;&#26631;&#65292;&#24182;&#22312;&#23427;&#20204;&#20998;&#37197;&#30340;&#26102;&#38388;&#31383;&#21475;&#20869;&#24688;&#22909;&#35775;&#38382;&#19968;&#27425;&#65292;&#28982;&#21518;&#36820;&#22238;&#21040;&#20179;&#24211;&#12290;&#35813;&#20844;&#24335;&#20381;&#36182;&#20110;&#19968;&#20010;&#20851;&#38190;&#24605;&#24819;&#65292;&#21363;&#24403;&#30446;&#26631;&#27839;&#30528;&#32447;&#31227;&#21160;&#26102;&#65292;&#23427;&#20204;&#30340;&#36712;&#36857;&#22312;&#31354;&#38388;-&#26102;&#38388;&#22352;&#26631;&#31995;&#20869;&#21464;&#20026;&#20984;&#38598;&#12290;&#28982;&#21518;&#65292;&#38382;&#39064;&#23601;&#32553;&#20943;&#20026;&#22312;&#19968;&#20010;&#20984;&#38598;&#22270;&#20013;&#23547;&#25214;&#26368;&#30701;&#36335;&#24452;&#65292;&#21463;&#21040;&#19968;&#20123;&#36895;&#24230;&#32422;&#26463;&#30340;&#38480;&#21046;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#20844;&#24335;&#19982;&#24403;&#21069;&#26368;&#20808;&#36827;&#30340;Mixed Integer Conic Program (MICP)&#27714;&#35299;&#22120;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#25105;&#20204;&#30340;&#20844;&#24335;&#22312;&#30446;&#26631;&#25968;&#37327;&#26368;&#22810;&#20026;20&#20010;&#30340;&#24773;&#20917;&#19979;&#24615;&#33021;&#20248;&#20110;MICP&#65292;&#22312;&#36816;&#34892;&#26102;&#38388;&#19978;&#32553;&#30701;&#20102;&#20004;&#20010;&#25968;&#37327;&#32423;&#65292;&#24182;&#19988;&#26368;&#20248;&#24615;&#24046;&#36317;&#32553;&#23567;&#20102;&#39640;&#36798;60&#65285;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#35813;&#35299;&#27861;&#30340;&#25104;&#26412;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04917v1 Announce Type: cross  Abstract: This paper introduces a new formulation that finds the optimum for the Moving-Target Traveling Salesman Problem (MT-TSP), which seeks to find a shortest path for an agent, that starts at a depot, visits a set of moving targets exactly once within their assigned time-windows, and returns to the depot. The formulation relies on the key idea that when the targets move along lines, their trajectories become convex sets within the space-time coordinate system. The problem then reduces to finding the shortest path within a graph of convex sets, subject to some speed constraints. We compare our formulation with the current state-of-the-art Mixed Integer Conic Program (MICP) solver for the MT-TSP. The experimental results show that our formulation outperforms the MICP for instances with up to 20 targets, with up to two orders of magnitude reduction in runtime, and up to a 60\% tighter optimality gap. We also show that the solution cost from th
&lt;/p&gt;</description></item></channel></rss>