<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#33258;&#20027;&#39550;&#39542;&#31995;&#32479;&#20013;&#22522;&#20110;&#23398;&#20064;&#30340;&#30456;&#26426;&#21644;&#28608;&#20809;&#38647;&#36798;&#20223;&#30495;&#26041;&#27861;&#30340;&#26368;&#26032;&#30740;&#31350;&#29616;&#29366;&#12290;</title><link>https://arxiv.org/abs/2402.10079</link><description>&lt;p&gt;
&#33258;&#20027;&#39550;&#39542;&#31995;&#32479;&#20013;&#22522;&#20110;&#23398;&#20064;&#30340;&#30456;&#26426;&#21644;&#28608;&#20809;&#38647;&#36798;&#20223;&#30495;&#26041;&#27861;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Review of the Learning-based Camera and Lidar Simulation Methods for Autonomous Driving Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10079
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#33258;&#20027;&#39550;&#39542;&#31995;&#32479;&#20013;&#22522;&#20110;&#23398;&#20064;&#30340;&#30456;&#26426;&#21644;&#28608;&#20809;&#38647;&#36798;&#20223;&#30495;&#26041;&#27861;&#30340;&#26368;&#26032;&#30740;&#31350;&#29616;&#29366;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24863;&#30693;&#20256;&#24863;&#22120;&#65292;&#23588;&#20854;&#26159;&#30456;&#26426;&#21644;&#28608;&#20809;&#38647;&#36798;&#65292;&#26159;&#33258;&#20027;&#39550;&#39542;&#31995;&#32479;(Autonomous Driving Systems&#65292;ADS)&#30340;&#20851;&#38190;&#20803;&#32032;&#65292;&#20351;&#20854;&#33021;&#22815;&#29702;&#35299;&#21608;&#22260;&#29615;&#22659;&#20197;&#20570;&#20986;&#26126;&#26234;&#30340;&#39550;&#39542;&#21644;&#25511;&#21046;&#20915;&#31574;&#12290;&#22240;&#27492;&#65292;&#24320;&#21457;&#36924;&#30495;&#30340;&#30456;&#26426;&#21644;&#28608;&#20809;&#38647;&#36798;&#27169;&#25311;&#26041;&#27861;&#65292;&#20063;&#31216;&#20026;&#30456;&#26426;&#21644;&#28608;&#20809;&#38647;&#36798;&#27169;&#22411;&#65292;&#23545;&#20110;&#26377;&#25928;&#36827;&#34892;&#22522;&#20110;&#20223;&#30495;&#30340;ADS&#27979;&#35797;&#33267;&#20851;&#37325;&#35201;&#12290;&#27492;&#22806;&#65292;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#24863;&#30693;&#27169;&#22411;&#30340;&#20852;&#36215;&#65292;&#20419;&#36827;&#20102;&#24863;&#30693;&#20256;&#24863;&#22120;&#27169;&#22411;&#20316;&#20026;&#21512;&#25104;&#21508;&#31181;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#26377;&#20215;&#20540;&#24037;&#20855;&#30340;&#26222;&#21450;&#12290;&#20256;&#32479;&#20256;&#24863;&#22120;&#20223;&#30495;&#26041;&#27861;&#20381;&#36182;&#20110;&#35745;&#31639;&#23494;&#38598;&#22411;&#30340;&#22522;&#20110;&#29289;&#29702;&#30340;&#31639;&#27861;&#65292;&#29305;&#21035;&#26159;&#22312;&#22797;&#26434;&#31995;&#32479;&#22914;ADS&#20013;&#12290;&#22240;&#27492;&#65292;&#30446;&#21069;&#30340;&#28508;&#21147;&#22312;&#20110;&#22522;&#20110;&#23398;&#20064;&#30340;&#27169;&#22411;&#65292;&#21463;&#21040;&#28145;&#24230;&#29983;&#25104;&#27169;&#22411;&#22312;&#21512;&#25104;&#39640;&#32500;&#25968;&#25454;&#26041;&#38754;&#21462;&#24471;&#25104;&#21151;&#30340;&#25512;&#21160;&#12290;&#26412;&#25991;&#32508;&#36848;&#20102;&#22522;&#20110;&#23398;&#20064;&#30340;&#20256;&#24863;&#22120;&#20223;&#30495;&#26041;&#27861;&#30340;&#26368;&#26032;&#30740;&#31350;&#29616;&#29366;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10079v1 Announce Type: cross  Abstract: Perception sensors, particularly camera and Lidar, are key elements of Autonomous Driving Systems (ADS) that enable them to comprehend their surroundings for informed driving and control decisions. Therefore, developing realistic camera and Lidar simulation methods, also known as camera and Lidar models, is of paramount importance to effectively conduct simulation-based testing for ADS. Moreover, the rise of deep learning-based perception models has propelled the prevalence of perception sensor models as valuable tools for synthesising diverse training datasets. The traditional sensor simulation methods rely on computationally expensive physics-based algorithms, specifically in complex systems such as ADS. Hence, the current potential resides in learning-based models, driven by the success of deep generative models in synthesising high-dimensional data. This paper reviews the current state-of-the-art in learning-based sensor simulation
&lt;/p&gt;</description></item></channel></rss>