<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#26550;&#26500;&#65292;&#25552;&#39640;&#33258;&#20027;&#20195;&#29702;&#30340;&#20449;&#20219;&#21644;&#23433;&#20840;&#24615;&#65292;&#22686;&#24378;&#20195;&#29702;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#27807;&#36890;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.09567</link><description>&lt;p&gt;
&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22686;&#24378;&#33258;&#20027;&#20195;&#29702;&#30340;&#20449;&#20219;&#65306;&#19968;&#31181;&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#26550;&#26500;
&lt;/p&gt;
&lt;p&gt;
Enhancing Trust in Autonomous Agents: An Architecture for Accountability and Explainability through Blockchain and Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09567
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#26550;&#26500;&#65292;&#25552;&#39640;&#33258;&#20027;&#20195;&#29702;&#30340;&#20449;&#20219;&#21644;&#23433;&#20840;&#24615;&#65292;&#22686;&#24378;&#20195;&#29702;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#27807;&#36890;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20027;&#20195;&#29702;&#22312;&#28041;&#21450;&#20154;&#31867;&#20114;&#21160;&#30340;&#29615;&#22659;&#20013;&#30340;&#37096;&#32626;&#26085;&#30410;&#24341;&#36215;&#23433;&#20840;&#20851;&#27880;&#12290;&#22240;&#27492;&#65292;&#20102;&#35299;&#20107;&#20214;&#32972;&#21518;&#30340;&#24773;&#20917;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#65292;&#38656;&#35201;&#24320;&#21457;&#33021;&#22815;&#21521;&#38750;&#19987;&#23478;&#29992;&#25143;&#35299;&#37322;&#20854;&#34892;&#20026;&#30340;&#33021;&#21147;&#12290;&#36825;&#20123;&#35299;&#37322;&#22312;&#25552;&#39640;&#21487;&#20449;&#24230;&#21644;&#23433;&#20840;&#24615;&#26041;&#38754;&#33267;&#20851;&#37325;&#35201;&#65292;&#20316;&#20026;&#38450;&#33539;&#22833;&#36133;&#12289;&#38169;&#35823;&#21644;&#35823;&#35299;&#30340;&#25514;&#26045;&#12290;&#27492;&#22806;&#65292;&#23427;&#20204;&#26377;&#21161;&#20110;&#25913;&#21892;&#27807;&#36890;&#65292;&#24357;&#21512;&#20195;&#29702;&#21644;&#29992;&#25143;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#20174;&#32780;&#25552;&#39640;&#23427;&#20204;&#30456;&#20114;&#20316;&#29992;&#30340;&#25928;&#26524;&#12290;&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#20026;&#22522;&#20110;ROS&#30340;&#31227;&#21160;&#26426;&#22120;&#20154;&#23454;&#26045;&#30340;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#26550;&#26500;&#12290;&#25152;&#25552;&#20986;&#30340;&#35299;&#20915;&#26041;&#26696;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#32452;&#20214;&#12290;&#39318;&#20808;&#65292;&#19968;&#20010;&#31867;&#20284;&#40657;&#30418;&#30340;&#20803;&#32032;&#29992;&#20110;&#25552;&#20379;&#38382;&#36131;&#21046;&#65292;&#20855;&#26377;&#36890;&#36807;&#21306;&#22359;&#38142;&#25216;&#26415;&#23454;&#29616;&#30340;&#38450;&#31713;&#25913;&#23646;&#24615;&#12290;&#20854;&#27425;&#65292;&#19968;&#20010;&#36127;&#36131;&#30340;&#32452;&#20214;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09567v1 Announce Type: cross  Abstract: The deployment of autonomous agents in environments involving human interaction has increasingly raised security concerns. Consequently, understanding the circumstances behind an event becomes critical, requiring the development of capabilities to justify their behaviors to non-expert users. Such explanations are essential in enhancing trustworthiness and safety, acting as a preventive measure against failures, errors, and misunderstandings. Additionally, they contribute to improving communication, bridging the gap between the agent and the user, thereby improving the effectiveness of their interactions. This work presents an accountability and explainability architecture implemented for ROS-based mobile robots. The proposed solution consists of two main components. Firstly, a black box-like element to provide accountability, featuring anti-tampering properties achieved through blockchain technology. Secondly, a component in charge of 
&lt;/p&gt;</description></item><item><title>EDO-Net&#26159;&#19968;&#20010;&#23398;&#20064;&#21487;&#21464;&#24418;&#29289;&#20307;&#24377;&#24615;&#23646;&#24615;&#30340;&#22270;&#21160;&#21147;&#23398;&#27169;&#22411;&#65292;&#36890;&#36807;&#21033;&#29992;&#21487;&#25552;&#21462;&#30340;&#28508;&#22312;&#34920;&#31034;&#65292;&#21487;&#20197;&#25512;&#24191;&#21040;&#26410;&#30693;&#30340;&#29289;&#29702;&#23646;&#24615;&#65292;&#23454;&#29616;&#23545;&#31867;&#20284;&#24067;&#26009;&#30340;&#23545;&#35937;&#26410;&#26469;&#29366;&#24577;&#30340;&#39044;&#27979;&#21644;&#36716;&#31227;&#23398;&#20064;&#12290;</title><link>http://arxiv.org/abs/2209.08996</link><description>&lt;p&gt;
EDO-Net: &#20174;&#22270;&#21160;&#21147;&#23398;&#20013;&#23398;&#20064;&#21487;&#21464;&#24418;&#29289;&#20307;&#30340;&#24377;&#24615;&#23646;&#24615;
&lt;/p&gt;
&lt;p&gt;
EDO-Net: Learning Elastic Properties of Deformable Objects from Graph Dynamics. (arXiv:2209.08996v2 [cs.CV] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.08996
&lt;/p&gt;
&lt;p&gt;
EDO-Net&#26159;&#19968;&#20010;&#23398;&#20064;&#21487;&#21464;&#24418;&#29289;&#20307;&#24377;&#24615;&#23646;&#24615;&#30340;&#22270;&#21160;&#21147;&#23398;&#27169;&#22411;&#65292;&#36890;&#36807;&#21033;&#29992;&#21487;&#25552;&#21462;&#30340;&#28508;&#22312;&#34920;&#31034;&#65292;&#21487;&#20197;&#25512;&#24191;&#21040;&#26410;&#30693;&#30340;&#29289;&#29702;&#23646;&#24615;&#65292;&#23454;&#29616;&#23545;&#31867;&#20284;&#24067;&#26009;&#30340;&#23545;&#35937;&#26410;&#26469;&#29366;&#24577;&#30340;&#39044;&#27979;&#21644;&#36716;&#31227;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#23398;&#20064;&#21487;&#21464;&#24418;&#29289;&#20307;&#30340;&#22270;&#21160;&#21147;&#23398;&#30340;&#38382;&#39064;&#65292;&#35813;&#38382;&#39064;&#21487;&#20197;&#25512;&#24191;&#21040;&#26410;&#30693;&#30340;&#29289;&#29702;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#20851;&#38190;&#27934;&#23519;&#21147;&#26159;&#21033;&#29992;&#21487;&#25552;&#21462;&#30340;&#31867;&#20284;&#24067;&#26009;&#30340;&#21487;&#21464;&#24418;&#29289;&#20307;&#30340;&#24377;&#24615;&#29289;&#29702;&#23646;&#24615;&#30340;&#28508;&#22312;&#34920;&#31034;&#65292;&#20363;&#22914;&#20174;&#25289;&#20280;&#20132;&#20114;&#20013;&#25552;&#21462;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;EDO-Net&#65288;&#24377;&#24615;&#21487;&#21464;&#24418;&#23545;&#35937;-Net&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#22312;&#20855;&#26377;&#19981;&#21516;&#24377;&#24615;&#23646;&#24615;&#30340;&#22823;&#37327;&#26679;&#26412;&#19978;&#36827;&#34892;&#35757;&#32451;&#30340;&#22270;&#21160;&#21147;&#23398;&#27169;&#22411;&#65292;&#19981;&#20381;&#36182;&#20110;&#23646;&#24615;&#30340;&#30495;&#23454;&#26631;&#31614;&#12290;EDO-Net&#20849;&#21516;&#23398;&#20064;&#20102;&#19968;&#20010;&#33258;&#36866;&#24212;&#27169;&#22359;&#21644;&#19968;&#20010;&#21069;&#21521;&#21160;&#21147;&#23398;&#27169;&#22359;&#12290;&#21069;&#32773;&#36127;&#36131;&#25552;&#21462;&#23545;&#35937;&#30340;&#29289;&#29702;&#29305;&#24615;&#30340;&#28508;&#22312;&#34920;&#31034;&#65292;&#32780;&#21518;&#32773;&#21033;&#29992;&#28508;&#22312;&#34920;&#31034;&#26469;&#39044;&#27979;&#20197;&#22270;&#24418;&#34920;&#31034;&#30340;&#31867;&#20284;&#24067;&#26009;&#30340;&#23545;&#35937;&#30340;&#26410;&#26469;&#29366;&#24577;&#12290;&#25105;&#20204;&#22312;&#20223;&#30495;&#21644;&#30495;&#23454;&#19990;&#30028;&#20013;&#35780;&#20272;&#20102;EDO-Net&#30340;&#33021;&#21147;&#65306;1&#65289;&#25512;&#24191;&#21040;&#26410;&#30693;&#30340;&#29289;&#29702;&#23646;&#24615;&#65292;2&#65289;&#36716;&#31227;&#23398;&#20064;&#25152;&#23398;&#21040;&#30340;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
We study the problem of learning graph dynamics of deformable objects that generalizes to unknown physical properties. Our key insight is to leverage a latent representation of elastic physical properties of cloth-like deformable objects that can be extracted, for example, from a pulling interaction. In this paper we propose EDO-Net (Elastic Deformable Object - Net), a model of graph dynamics trained on a large variety of samples with different elastic properties that does not rely on ground-truth labels of the properties. EDO-Net jointly learns an adaptation module, and a forward-dynamics module. The former is responsible for extracting a latent representation of the physical properties of the object, while the latter leverages the latent representation to predict future states of cloth-like objects represented as graphs. We evaluate EDO-Net both in simulation and real world, assessing its capabilities of: 1) generalizing to unknown physical properties, 2) transferring the learned rep
&lt;/p&gt;</description></item></channel></rss>