<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>DexDiffuser&#26159;&#19968;&#31181;&#20351;&#29992;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#28789;&#24039;&#25235;&#21462;&#23039;&#21183;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#29289;&#20307;&#28857;&#20113;&#30340;&#29983;&#25104;&#12289;&#35780;&#20272;&#21644;&#20248;&#21270;&#65292;&#23454;&#29616;&#20102;&#36739;&#39640;&#30340;&#25235;&#21462;&#25104;&#21151;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.02989</link><description>&lt;p&gt;
DexDiffuser: &#20351;&#29992;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#28789;&#24039;&#25235;&#21462;&#23039;&#21183;
&lt;/p&gt;
&lt;p&gt;
DexDiffuser: Generating Dexterous Grasps with Diffusion Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02989
&lt;/p&gt;
&lt;p&gt;
DexDiffuser&#26159;&#19968;&#31181;&#20351;&#29992;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#28789;&#24039;&#25235;&#21462;&#23039;&#21183;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#29289;&#20307;&#28857;&#20113;&#30340;&#29983;&#25104;&#12289;&#35780;&#20272;&#21644;&#20248;&#21270;&#65292;&#23454;&#29616;&#20102;&#36739;&#39640;&#30340;&#25235;&#21462;&#25104;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;DexDiffuser&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#28789;&#24039;&#25235;&#21462;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#37096;&#20998;&#29289;&#20307;&#28857;&#20113;&#19978;&#29983;&#25104;&#12289;&#35780;&#20272;&#21644;&#20248;&#21270;&#25235;&#21462;&#23039;&#21183;&#12290;DexDiffuser&#21253;&#25324;&#26465;&#20214;&#25193;&#25955;&#22411;&#25235;&#21462;&#37319;&#26679;&#22120;DexSampler&#21644;&#28789;&#24039;&#25235;&#21462;&#35780;&#20272;&#22120;DexEvaluator&#12290;DexSampler&#36890;&#36807;&#23545;&#38543;&#26426;&#25235;&#21462;&#36827;&#34892;&#36845;&#20195;&#21435;&#22122;&#65292;&#29983;&#25104;&#19982;&#29289;&#20307;&#28857;&#20113;&#26465;&#20214;&#30456;&#20851;&#30340;&#39640;&#36136;&#37327;&#25235;&#21462;&#23039;&#21183;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#20004;&#31181;&#25235;&#21462;&#20248;&#21270;&#31574;&#30053;&#65306;&#22522;&#20110;&#35780;&#20272;&#22120;&#30340;&#25193;&#25955;(Evaluator-Guided Diffusion&#65292;EGD)&#21644;&#22522;&#20110;&#35780;&#20272;&#22120;&#30340;&#37319;&#26679;&#20248;&#21270;(Evaluator-based Sampling Refinement&#65292;ESR)&#12290;&#25105;&#20204;&#22312;&#34394;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#19990;&#30028;&#30340;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;Allegro Hand&#36827;&#34892;&#27979;&#35797;&#65292;&#32467;&#26524;&#34920;&#26126;DexDiffuser&#30456;&#27604;&#26368;&#20808;&#36827;&#30340;&#22810;&#25351;&#25235;&#21462;&#29983;&#25104;&#26041;&#27861;FFHNet&#65292;&#24179;&#22343;&#25235;&#21462;&#25104;&#21151;&#29575;&#25552;&#39640;&#20102;21.71-22.20%&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce DexDiffuser, a novel dexterous grasping method that generates, evaluates, and refines grasps on partial object point clouds. DexDiffuser includes the conditional diffusion-based grasp sampler DexSampler and the dexterous grasp evaluator DexEvaluator. DexSampler generates high-quality grasps conditioned on object point clouds by iterative denoising of randomly sampled grasps. We also introduce two grasp refinement strategies: Evaluator-Guided Diffusion (EGD) and Evaluator-based Sampling Refinement (ESR). Our simulation and real-world experiments on the Allegro Hand consistently demonstrate that DexDiffuser outperforms the state-of-the-art multi-finger grasp generation method FFHNet with an, on average, 21.71--22.20\% higher grasp success rate.
&lt;/p&gt;</description></item></channel></rss>