<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;&#8220;&#20154;&#31867;&#21161;&#21147;&#28789;&#24039;&#25235;&#21462;&#8221;&#30340;&#26032;&#22411;&#20219;&#21153;&#65292;&#36890;&#36807;&#20351;&#29992;Grasping Gradient Field&#21644;&#22522;&#20110;&#21382;&#21490;&#26465;&#20214;&#30340;&#27531;&#24046;&#31574;&#30053;&#65292;&#35757;&#32451;&#25511;&#21046;&#26426;&#22120;&#20154;&#25163;&#25351;&#20197;&#36866;&#24212;&#19981;&#21516;&#29992;&#25143;&#24847;&#22270;&#21644;&#29289;&#20307;&#20960;&#20309;&#24418;&#29366;&#30340;&#28789;&#24039;&#25235;&#21462;&#25805;&#20316;&#12290;</title><link>http://arxiv.org/abs/2309.06038</link><description>&lt;p&gt;
&#20026;&#20154;&#31867;&#21161;&#21147;&#28789;&#24039;&#25235;&#21462;&#23398;&#20064;&#22522;&#20110;&#24471;&#20998;&#30340;&#25235;&#21462;&#21407;&#35821;
&lt;/p&gt;
&lt;p&gt;
Learning Score-based Grasping Primitive for Human-assisting Dexterous Grasping. (arXiv:2309.06038v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06038
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;&#8220;&#20154;&#31867;&#21161;&#21147;&#28789;&#24039;&#25235;&#21462;&#8221;&#30340;&#26032;&#22411;&#20219;&#21153;&#65292;&#36890;&#36807;&#20351;&#29992;Grasping Gradient Field&#21644;&#22522;&#20110;&#21382;&#21490;&#26465;&#20214;&#30340;&#27531;&#24046;&#31574;&#30053;&#65292;&#35757;&#32451;&#25511;&#21046;&#26426;&#22120;&#20154;&#25163;&#25351;&#20197;&#36866;&#24212;&#19981;&#21516;&#29992;&#25143;&#24847;&#22270;&#21644;&#29289;&#20307;&#20960;&#20309;&#24418;&#29366;&#30340;&#28789;&#24039;&#25235;&#21462;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#20154;&#31867;&#21161;&#21147;&#28789;&#24039;&#25235;&#21462;&#8221;&#30340;&#26032;&#22411;&#20219;&#21153;&#65292;&#26088;&#22312;&#35757;&#32451;&#25511;&#21046;&#26426;&#22120;&#20154;&#25163;&#25351;&#20197;&#24110;&#21161;&#29992;&#25143;&#25235;&#21462;&#29289;&#20307;&#30340;&#31574;&#30053;&#12290;&#19982;&#20256;&#32479;&#30340;&#28789;&#24039;&#25235;&#21462;&#19981;&#21516;&#65292;&#36825;&#20010;&#20219;&#21153;&#38754;&#20020;&#30528;&#26356;&#22797;&#26434;&#30340;&#25361;&#25112;&#65292;&#22240;&#20026;&#31574;&#30053;&#38656;&#35201;&#36866;&#24212;&#19981;&#21516;&#30340;&#29992;&#25143;&#24847;&#22270;&#21644;&#29289;&#20307;&#30340;&#20960;&#20309;&#24418;&#29366;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#30001;&#20004;&#20010;&#23376;&#27169;&#22359;&#32452;&#25104;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65306;&#19968;&#31181;&#25163;-&#29289;&#20307;&#26465;&#20214;&#25235;&#21462;&#21407;&#35821;&#31216;&#20026;Grasping Gradient Field&#65288;GraspGF&#65289;&#65292;&#20197;&#21450;&#19968;&#31181;&#22522;&#20110;&#21382;&#21490;&#26465;&#20214;&#30340;&#27531;&#24046;&#31574;&#30053;&#12290;GraspGF&#36890;&#36807;&#20272;&#35745;&#26469;&#33258;&#25104;&#21151;&#25235;&#21462;&#31034;&#20363;&#38598;&#30340;&#26799;&#24230;&#26469;&#23398;&#20064;&#8220;&#22914;&#20309;&#8221;&#25235;&#21462;&#65292;&#32780;&#27531;&#24046;&#31574;&#30053;&#26681;&#25454;&#36712;&#36857;&#21382;&#21490;&#30830;&#23450;&#8220;&#20309;&#26102;&#8221;&#21644;&#20197;&#20309;&#31181;&#36895;&#24230;&#25191;&#34892;&#25235;&#21462;&#21160;&#20316;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#26126;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The use of anthropomorphic robotic hands for assisting individuals in situations where human hands may be unavailable or unsuitable has gained significant importance. In this paper, we propose a novel task called human-assisting dexterous grasping that aims to train a policy for controlling a robotic hand's fingers to assist users in grasping objects. Unlike conventional dexterous grasping, this task presents a more complex challenge as the policy needs to adapt to diverse user intentions, in addition to the object's geometry. We address this challenge by proposing an approach consisting of two sub-modules: a hand-object-conditional grasping primitive called Grasping Gradient Field~(GraspGF), and a history-conditional residual policy. GraspGF learns `how' to grasp by estimating the gradient from a success grasping example set, while the residual policy determines `when' and at what speed the grasping action should be executed based on the trajectory history. Experimental results demons
&lt;/p&gt;</description></item></channel></rss>