<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>H2O+&#26159;&#19968;&#31181;&#25913;&#36827;&#30340;&#28151;&#21512;&#31163;&#32447;&#21644;&#22312;&#32447;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#32508;&#21512;&#32771;&#34385;&#30495;&#23454;&#21644;&#27169;&#25311;&#29615;&#22659;&#30340;&#21160;&#21147;&#23398;&#24046;&#36317;&#65292;&#21516;&#26102;&#21033;&#29992;&#26377;&#38480;&#30340;&#31163;&#32447;&#25968;&#25454;&#21644;&#19981;&#23436;&#32654;&#30340;&#27169;&#25311;&#22120;&#36827;&#34892;&#31574;&#30053;&#23398;&#20064;&#65292;&#24182;&#22312;&#24191;&#27867;&#30340;&#20223;&#30495;&#21644;&#23454;&#38469;&#26426;&#22120;&#20154;&#23454;&#39564;&#20013;&#23637;&#31034;&#20102;&#21331;&#36234;&#30340;&#24615;&#33021;&#21644;&#28789;&#27963;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.12716</link><description>&lt;p&gt;
H2O+: &#19968;&#31181;&#25913;&#36827;&#30340;&#28151;&#21512;&#31163;&#32447;&#21644;&#22312;&#32447;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#21160;&#21147;&#23398;&#24046;&#36317;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
H2O+: An Improved Framework for Hybrid Offline-and-Online RL with Dynamics Gaps. (arXiv:2309.12716v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12716
&lt;/p&gt;
&lt;p&gt;
H2O+&#26159;&#19968;&#31181;&#25913;&#36827;&#30340;&#28151;&#21512;&#31163;&#32447;&#21644;&#22312;&#32447;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#32508;&#21512;&#32771;&#34385;&#30495;&#23454;&#21644;&#27169;&#25311;&#29615;&#22659;&#30340;&#21160;&#21147;&#23398;&#24046;&#36317;&#65292;&#21516;&#26102;&#21033;&#29992;&#26377;&#38480;&#30340;&#31163;&#32447;&#25968;&#25454;&#21644;&#19981;&#23436;&#32654;&#30340;&#27169;&#25311;&#22120;&#36827;&#34892;&#31574;&#30053;&#23398;&#20064;&#65292;&#24182;&#22312;&#24191;&#27867;&#30340;&#20223;&#30495;&#21644;&#23454;&#38469;&#26426;&#22120;&#20154;&#23454;&#39564;&#20013;&#23637;&#31034;&#20102;&#21331;&#36234;&#30340;&#24615;&#33021;&#21644;&#28789;&#27963;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27809;&#26377;&#39640;&#31934;&#24230;&#27169;&#25311;&#29615;&#22659;&#25110;&#22823;&#37327;&#31163;&#32447;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#35299;&#20915;&#23454;&#38469;&#22797;&#26434;&#20219;&#21153;&#21487;&#33021;&#30456;&#24403;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22312;&#38750;&#23436;&#32654;&#27169;&#25311;&#29615;&#22659;&#20013;&#35757;&#32451;&#30340;&#22312;&#32447;RL&#20195;&#29702;&#21487;&#33021;&#20250;&#21463;&#21040;&#20005;&#37325;&#30340;&#27169;&#25311;&#19982;&#29616;&#23454;&#38382;&#39064;&#12290;&#34429;&#28982;&#31163;&#32447;RL&#26041;&#27861;&#21487;&#20197;&#32469;&#36807;&#23545;&#27169;&#25311;&#22120;&#30340;&#38656;&#27714;&#65292;&#20294;&#24448;&#24448;&#23545;&#31163;&#32447;&#25968;&#25454;&#38598;&#30340;&#22823;&#23567;&#21644;&#36136;&#37327;&#25552;&#20986;&#20102;&#33499;&#21051;&#30340;&#35201;&#27714;&#12290;&#26368;&#36817;&#20986;&#29616;&#30340;&#28151;&#21512;&#31163;&#32447;&#21644;&#22312;&#32447;RL&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#21560;&#24341;&#21147;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#21516;&#26102;&#20351;&#29992;&#26377;&#38480;&#30340;&#31163;&#32447;&#25968;&#25454;&#21644;&#19981;&#23436;&#32654;&#30340;&#27169;&#25311;&#22120;&#36827;&#34892;&#21487;&#36716;&#31227;&#31574;&#30053;&#23398;&#20064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;H2O+&#30340;&#26032;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#22312;&#26725;&#25509;&#19981;&#21516;&#30340;&#31163;&#32447;&#21644;&#22312;&#32447;&#23398;&#20064;&#26041;&#27861;&#30340;&#21516;&#26102;&#65292;&#20063;&#32771;&#34385;&#20102;&#30495;&#23454;&#21644;&#27169;&#25311;&#29615;&#22659;&#20043;&#38388;&#30340;&#21160;&#21147;&#23398;&#24046;&#36317;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#20223;&#30495;&#21644;&#23454;&#38469;&#26426;&#22120;&#20154;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;H2O+&#22312;&#24615;&#33021;&#21644;&#28789;&#27963;&#24615;&#19978;&#20248;&#20110;&#20808;&#36827;&#30340;&#36328;&#22495;&#22312;&#32447;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Solving real-world complex tasks using reinforcement learning (RL) without high-fidelity simulation environments or large amounts of offline data can be quite challenging. Online RL agents trained in imperfect simulation environments can suffer from severe sim-to-real issues. Offline RL approaches although bypass the need for simulators, often pose demanding requirements on the size and quality of the offline datasets. The recently emerged hybrid offline-and-online RL provides an attractive framework that enables joint use of limited offline data and imperfect simulator for transferable policy learning. In this paper, we develop a new algorithm, called H2O+, which offers great flexibility to bridge various choices of offline and online learning methods, while also accounting for dynamics gaps between the real and simulation environment. Through extensive simulation and real-world robotics experiments, we demonstrate superior performance and flexibility over advanced cross-domain online
&lt;/p&gt;</description></item></channel></rss>