<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;ROAM&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#34892;&#20026;&#26469;&#23454;&#26102;&#35843;&#33410;&#26426;&#22120;&#20154;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#24212;&#23545;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ROAM&#21487;&#20197;&#22312;&#21333;&#20010;&#38454;&#27573;&#20869;&#23454;&#29616;&#24555;&#36895;&#36866;&#24212;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#22330;&#26223;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.01059</link><description>&lt;p&gt;
&#22312;&#37096;&#32626;&#26102;&#36827;&#34892;&#23454;&#26102;&#35843;&#33410;&#65306;&#29992;&#20110;&#21333;&#26426;&#22120;&#20154;&#37096;&#32626;&#30340;&#34892;&#20026;&#35843;&#25511;
&lt;/p&gt;
&lt;p&gt;
Adapt On-the-Go: Behavior Modulation for Single-Life Robot Deployment. (arXiv:2311.01059v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01059
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;ROAM&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#34892;&#20026;&#26469;&#23454;&#26102;&#35843;&#33410;&#26426;&#22120;&#20154;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#24212;&#23545;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ROAM&#21487;&#20197;&#22312;&#21333;&#20010;&#38454;&#27573;&#20869;&#23454;&#29616;&#24555;&#36895;&#36866;&#24212;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#22330;&#26223;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#21462;&#24471;&#25104;&#21151;&#65292;&#26426;&#22120;&#20154;&#24517;&#39035;&#24212;&#23545;&#35757;&#32451;&#36807;&#31243;&#20013;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#38024;&#23545;&#36825;&#20123;&#26032;&#22330;&#26223;&#30340;&#23454;&#26102;&#35843;&#33410;&#38382;&#39064;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#22810;&#26679;&#21270;&#34892;&#20026;&#24211;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;RObust Autonomous Modulation&#65288;ROAM&#65289;&#65292;&#24341;&#20837;&#20102;&#22522;&#20110;&#39044;&#35757;&#32451;&#34892;&#20026;&#30340;&#24863;&#30693;&#20215;&#20540;&#30340;&#26426;&#21046;&#65292;&#20197;&#22312;&#29305;&#23450;&#24773;&#20917;&#19979;&#36873;&#25321;&#21644;&#35843;&#25972;&#39044;&#35757;&#32451;&#34892;&#20026;&#12290;&#20851;&#38190;&#26159;&#65292;&#36825;&#31181;&#35843;&#33410;&#36807;&#31243;&#22312;&#27979;&#35797;&#26102;&#30340;&#21333;&#20010;&#38454;&#27573;&#20869;&#23436;&#25104;&#65292;&#26080;&#38656;&#20219;&#20309;&#20154;&#31867;&#30417;&#30563;&#12290;&#25105;&#20204;&#23545;&#36873;&#25321;&#26426;&#21046;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#65292;&#24182;&#35777;&#26126;&#20102;ROAM&#20351;&#24471;&#26426;&#22120;&#20154;&#33021;&#22815;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#30340;&#22235;&#36275;&#21160;&#29289;Go1&#19978;&#24555;&#36895;&#36866;&#24212;&#21160;&#24577;&#21464;&#21270;&#65292;&#29978;&#33267;&#22312;&#33050;&#19978;&#22871;&#30528;&#28378;&#36718;&#28369;&#38795;&#30340;&#24773;&#20917;&#19979;&#25104;&#21151;&#21069;&#36827;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#38754;&#23545;&#21508;&#31181;&#20998;&#24067;&#24773;&#20917;&#30340;&#37096;&#32626;&#26102;&#33021;&#22815;&#20197;&#36229;&#36807;2&#20493;&#30340;&#25928;&#29575;&#36827;&#34892;&#35843;&#33410;&#65292;&#36890;&#36807;&#26377;&#25928;&#36873;&#25321;&#26469;&#23454;&#29616;&#36866;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
To succeed in the real world, robots must cope with situations that differ from those seen during training. We study the problem of adapting on-the-fly to such novel scenarios during deployment, by drawing upon a diverse repertoire of previously learned behaviors. Our approach, RObust Autonomous Modulation (ROAM), introduces a mechanism based on the perceived value of pre-trained behaviors to select and adapt pre-trained behaviors to the situation at hand. Crucially, this adaptation process all happens within a single episode at test time, without any human supervision. We provide theoretical analysis of our selection mechanism and demonstrate that ROAM enables a robot to adapt rapidly to changes in dynamics both in simulation and on a real Go1 quadruped, even successfully moving forward with roller skates on its feet. Our approach adapts over 2x as efficiently compared to existing methods when facing a variety of out-of-distribution situations during deployment by effectively choosing
&lt;/p&gt;</description></item></channel></rss>