<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#30690;&#37327;&#37327;&#21270;&#34892;&#20026;&#36716;&#25442;&#22120;&#65288;VQ-BeT&#65289;&#30340;&#22810;&#21151;&#33021;&#34892;&#20026;&#29983;&#25104;&#27169;&#22411;&#65292;&#36890;&#36807;&#23545;&#36830;&#32493;&#21160;&#20316;&#36827;&#34892;&#26631;&#35760;&#21270;&#22788;&#29702;&#22810;&#27169;&#24577;&#21160;&#20316;&#39044;&#27979;&#12289;&#26465;&#20214;&#29983;&#25104;&#21644;&#37096;&#20998;&#35266;&#23519;&#12290;</title><link>https://arxiv.org/abs/2403.03181</link><description>&lt;p&gt;
&#20855;&#26377;&#28508;&#22312;&#21160;&#20316;&#30340;&#34892;&#20026;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Behavior Generation with Latent Actions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03181
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#30690;&#37327;&#37327;&#21270;&#34892;&#20026;&#36716;&#25442;&#22120;&#65288;VQ-BeT&#65289;&#30340;&#22810;&#21151;&#33021;&#34892;&#20026;&#29983;&#25104;&#27169;&#22411;&#65292;&#36890;&#36807;&#23545;&#36830;&#32493;&#21160;&#20316;&#36827;&#34892;&#26631;&#35760;&#21270;&#22788;&#29702;&#22810;&#27169;&#24577;&#21160;&#20316;&#39044;&#27979;&#12289;&#26465;&#20214;&#29983;&#25104;&#21644;&#37096;&#20998;&#35266;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#24102;&#26631;&#31614;&#30340;&#25968;&#25454;&#38598;&#20013;&#29983;&#25104;&#22797;&#26434;&#34892;&#20026;&#30340;&#29983;&#25104;&#24314;&#27169;&#19968;&#30452;&#26159;&#20915;&#31574;&#21046;&#23450;&#20013;&#38271;&#26399;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;&#19982;&#35821;&#35328;&#25110;&#22270;&#20687;&#29983;&#25104;&#19981;&#21516;&#65292;&#20915;&#31574;&#21046;&#23450;&#38656;&#35201;&#24314;&#27169;&#21160;&#20316; - &#36830;&#32493;&#20540;&#21521;&#37327;&#65292;&#20854;&#22312;&#20998;&#24067;&#19978;&#26159;&#22810;&#27169;&#24577;&#30340;&#65292;&#21487;&#33021;&#26469;&#33258;&#26410;&#32463;&#31579;&#36873;&#30340;&#26469;&#28304;&#65292;&#22312;&#39034;&#24207;&#39044;&#27979;&#20013;&#29983;&#25104;&#35823;&#24046;&#21487;&#33021;&#20250;&#30456;&#20114;&#32047;&#31215;&#12290;&#26368;&#36817;&#19968;&#31867;&#31216;&#20026;&#34892;&#20026;&#36716;&#25442;&#22120;&#65288;BeT&#65289;&#30340;&#27169;&#22411;&#36890;&#36807;&#20351;&#29992;k-means&#32858;&#31867;&#23545;&#21160;&#20316;&#36827;&#34892;&#31163;&#25955;&#21270;&#20197;&#25429;&#25417;&#19981;&#21516;&#27169;&#24335;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;k-means&#22312;&#22788;&#29702;&#39640;&#32500;&#21160;&#20316;&#31354;&#38388;&#25110;&#38271;&#24207;&#21015;&#26102;&#23384;&#22312;&#22256;&#38590;&#65292;&#24182;&#19988;&#32570;&#20047;&#26799;&#24230;&#20449;&#24687;&#65292;&#22240;&#27492;BeT&#22312;&#24314;&#27169;&#38271;&#36317;&#31163;&#21160;&#20316;&#26102;&#23384;&#22312;&#22256;&#38590;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#30690;&#37327;&#37327;&#21270;&#34892;&#20026;&#36716;&#25442;&#22120;&#65288;VQ-BeT&#65289;&#30340;&#22810;&#21151;&#33021;&#34892;&#20026;&#29983;&#25104;&#27169;&#22411;&#65292;&#29992;&#20110;&#22788;&#29702;&#22810;&#27169;&#24577;&#21160;&#20316;&#39044;&#27979;&#12289;&#26465;&#20214;&#29983;&#25104;&#21644;&#37096;&#20998;&#35266;&#23519;&#12290;VQ-BeT&#36890;&#36807;&#23545;&#36830;&#32493;&#21160;&#20316;&#36827;&#34892;&#26631;&#35760;&#21270;&#26469;&#22686;&#24378;BeT
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03181v1 Announce Type: cross  Abstract: Generative modeling of complex behaviors from labeled datasets has been a longstanding problem in decision making. Unlike language or image generation, decision making requires modeling actions - continuous-valued vectors that are multimodal in their distribution, potentially drawn from uncurated sources, where generation errors can compound in sequential prediction. A recent class of models called Behavior Transformers (BeT) addresses this by discretizing actions using k-means clustering to capture different modes. However, k-means struggles to scale for high-dimensional action spaces or long sequences, and lacks gradient information, and thus BeT suffers in modeling long-range actions. In this work, we present Vector-Quantized Behavior Transformer (VQ-BeT), a versatile model for behavior generation that handles multimodal action prediction, conditional generation, and partial observations. VQ-BeT augments BeT by tokenizing continuous
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#22312;&#21160;&#24577;&#35268;&#21010;&#39046;&#22495;&#20013;&#27169;&#25311;&#24037;&#20855;&#20351;&#29992;&#30340;&#30446;&#26631;&#65292;&#25105;&#20204;&#28145;&#20837;&#25506;&#35752;&#20102;&#20027;&#21160;&#25512;&#26029;&#20013;&#30340;&#21160;&#24577;&#35268;&#21010;&#65292;&#35813;&#39046;&#22495;&#32771;&#34385;&#21040;&#29983;&#29289;&#30446;&#26631;&#23548;&#21521;&#34892;&#20026;&#30340;&#20004;&#20010;&#20851;&#38190;&#26041;&#38754;</title><link>https://arxiv.org/abs/2402.11658</link><description>&lt;p&gt;
&#20998;&#23618;&#20027;&#21160;&#25512;&#26029;&#20013;&#30340;&#21160;&#24577;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Dynamic planning in hierarchical active inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11658
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#22312;&#21160;&#24577;&#35268;&#21010;&#39046;&#22495;&#20013;&#27169;&#25311;&#24037;&#20855;&#20351;&#29992;&#30340;&#30446;&#26631;&#65292;&#25105;&#20204;&#28145;&#20837;&#25506;&#35752;&#20102;&#20027;&#21160;&#25512;&#26029;&#20013;&#30340;&#21160;&#24577;&#35268;&#21010;&#65292;&#35813;&#39046;&#22495;&#32771;&#34385;&#21040;&#29983;&#29289;&#30446;&#26631;&#23548;&#21521;&#34892;&#20026;&#30340;&#20004;&#20010;&#20851;&#38190;&#26041;&#38754;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21160;&#24577;&#35268;&#21010;&#65292;&#25105;&#20204;&#25351;&#30340;&#26159;&#20154;&#31867;&#22823;&#33041;&#25512;&#26029;&#21644;&#26045;&#21152;&#19982;&#35748;&#30693;&#20915;&#31574;&#30456;&#20851;&#30340;&#36816;&#21160;&#36712;&#36857;&#30340;&#33021;&#21147;&#12290;&#26368;&#36817;&#30340;&#19968;&#20010;&#33539;&#24335;&#65292;&#20027;&#21160;&#25512;&#26029;&#65292;&#20026;&#29983;&#29289;&#26377;&#26426;&#20307;&#36866;&#24212;&#24102;&#26469;&#20102;&#22522;&#26412;&#35265;&#35299;&#65292;&#19981;&#26029;&#21162;&#21147;&#26368;&#23567;&#21270;&#39044;&#27979;&#35823;&#24046;&#20197;&#23558;&#33258;&#24049;&#38480;&#21046;&#22312;&#19982;&#29983;&#21629;&#20860;&#23481;&#30340;&#29366;&#24577;&#12290;&#22312;&#36807;&#21435;&#30340;&#20960;&#24180;&#37324;&#65292;&#35768;&#22810;&#30740;&#31350;&#34920;&#26126;&#20154;&#31867;&#21644;&#21160;&#29289;&#34892;&#20026;&#21487;&#20197;&#35299;&#37322;&#20026;&#20027;&#21160;&#25512;&#26029;&#36807;&#31243;&#65292;&#26080;&#35770;&#26159;&#20316;&#20026;&#31163;&#25955;&#20915;&#31574;&#36824;&#26159;&#36830;&#32493;&#36816;&#21160;&#25511;&#21046;&#65292;&#37117;&#28608;&#21457;&#20102;&#26426;&#22120;&#20154;&#25216;&#26415;&#21644;&#20154;&#24037;&#26234;&#33021;&#20013;&#30340;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#12290;&#28982;&#32780;&#65292;&#25991;&#29486;&#32570;&#20047;&#23545;&#22914;&#20309;&#26377;&#25928;&#22320;&#22312;&#21464;&#21270;&#29615;&#22659;&#20013;&#35268;&#21010;&#34892;&#21160;&#30340;&#20840;&#38754;&#23637;&#26395;&#12290;&#25105;&#20204;&#35774;&#23450;&#20102;&#23545;&#24037;&#20855;&#20351;&#29992;&#36827;&#34892;&#24314;&#27169;&#30340;&#30446;&#26631;&#65292;&#28145;&#20837;&#30740;&#31350;&#20102;&#20027;&#21160;&#25512;&#26029;&#20013;&#30340;&#21160;&#24577;&#35268;&#21010;&#20027;&#39064;&#65292;&#29282;&#35760;&#20004;&#20010;&#29983;&#29289;&#30446;&#26631;&#23548;&#21521;&#34892;&#20026;&#30340;&#20851;&#38190;&#26041;&#38754;&#65306;&#29702;&#35299;&#8230;&#8230;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11658v1 Announce Type: new  Abstract: By dynamic planning, we refer to the ability of the human brain to infer and impose motor trajectories related to cognitive decisions. A recent paradigm, active inference, brings fundamental insights into the adaptation of biological organisms, constantly striving to minimize prediction errors to restrict themselves to life-compatible states. Over the past years, many studies have shown how human and animal behavior could be explained in terms of an active inferential process -- either as discrete decision-making or continuous motor control -- inspiring innovative solutions in robotics and artificial intelligence. Still, the literature lacks a comprehensive outlook on how to effectively plan actions in changing environments. Setting ourselves the goal of modeling tool use, we delve into the topic of dynamic planning in active inference, keeping in mind two crucial aspects of biological goal-directed behavior: the capacity to understand a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#32034;&#20102;&#22312;&#21327;&#20316;&#35013;&#37197;&#22330;&#26223;&#20013;&#65292;Cobot&#30340;&#29983;&#20135;&#33410;&#22863;&#23545;&#21442;&#19982;&#32773;&#30340;&#32463;&#39564;&#24615;&#23450;&#20301;&#25511;&#21046;&#21644;&#24773;&#32490;&#29366;&#24577;&#30340;&#24433;&#21709;&#12290;&#34429;&#28982;&#22312;&#24773;&#32490;&#29366;&#24577;&#21644;&#23450;&#20301;&#25511;&#21046;&#26041;&#38754;&#26410;&#21457;&#29616;&#24046;&#24322;&#65292;&#20294;&#32771;&#34385;&#21040;&#20854;&#20182;&#24515;&#29702;&#21464;&#37327;&#65292;&#32467;&#26524;&#34920;&#26126;&#38656;&#35201;&#32771;&#34385;&#20010;&#20307;&#30340;&#24515;&#29702;&#29305;&#24449;&#26469;&#25552;&#20379;&#26356;&#22909;&#30340;&#20114;&#21160;&#20307;&#39564;&#12290;</title><link>https://arxiv.org/abs/2402.00808</link><description>&lt;p&gt;
&#22312;&#21327;&#20316;&#35013;&#37197;&#22330;&#26223;&#20013;&#65292;&#25506;&#32034;Cobot&#30340;&#29983;&#20135;&#33410;&#22863;&#12289;&#25511;&#21046;&#23450;&#20301;&#21644;&#24773;&#32490;&#29366;&#24577;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Exploring the Dynamics between Cobot's Production Rhythm, Locus of Control and Emotional State in a Collaborative Assembly Scenario
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00808
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#32034;&#20102;&#22312;&#21327;&#20316;&#35013;&#37197;&#22330;&#26223;&#20013;&#65292;Cobot&#30340;&#29983;&#20135;&#33410;&#22863;&#23545;&#21442;&#19982;&#32773;&#30340;&#32463;&#39564;&#24615;&#23450;&#20301;&#25511;&#21046;&#21644;&#24773;&#32490;&#29366;&#24577;&#30340;&#24433;&#21709;&#12290;&#34429;&#28982;&#22312;&#24773;&#32490;&#29366;&#24577;&#21644;&#23450;&#20301;&#25511;&#21046;&#26041;&#38754;&#26410;&#21457;&#29616;&#24046;&#24322;&#65292;&#20294;&#32771;&#34385;&#21040;&#20854;&#20182;&#24515;&#29702;&#21464;&#37327;&#65292;&#32467;&#26524;&#34920;&#26126;&#38656;&#35201;&#32771;&#34385;&#20010;&#20307;&#30340;&#24515;&#29702;&#29305;&#24449;&#26469;&#25552;&#20379;&#26356;&#22909;&#30340;&#20114;&#21160;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24037;&#19994;&#22330;&#26223;&#20013;&#65292;&#21327;&#20316;&#26426;&#22120;&#20154;&#65288;cobots&#65289;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#24182;&#19988;&#23545;&#35780;&#20272;&#21644;&#27979;&#37327;cobots&#30340;&#26576;&#20123;&#29305;&#24449;&#23545;&#20154;&#30340;&#24433;&#21709;&#20135;&#29983;&#20102;&#26085;&#30410;&#22686;&#38271;&#30340;&#20852;&#36259;&#12290;&#22312;&#26412;&#27425;&#35797;&#28857;&#30740;&#31350;&#20013;&#65292;&#30740;&#31350;&#20102;&#19968;&#20010;cobots&#30340;&#29983;&#20135;&#33410;&#22863;&#65288;C1-&#24930;&#12289;C2-&#24555;&#12289;C3-&#26681;&#25454;&#21442;&#19982;&#32773;&#30340;&#27493;&#35843;&#35843;&#25972;&#65289;&#23545;31&#21517;&#21442;&#19982;&#32773;&#30340;&#32463;&#39564;&#24615;&#23450;&#20301;&#25511;&#21046;&#65288;ELoC&#65289;&#21644;&#24773;&#32490;&#29366;&#24577;&#30340;&#24433;&#21709;&#12290;&#36824;&#32771;&#34385;&#20102;&#25805;&#20316;&#20154;&#21592;&#30340;&#32489;&#25928;&#12289;&#22522;&#26412;&#20869;&#37096;&#23450;&#20301;&#25511;&#21046;&#31243;&#24230;&#21644;&#23545;&#26426;&#22120;&#20154;&#30340;&#24577;&#24230;&#12290;&#20851;&#20110;&#24773;&#32490;&#29366;&#24577;&#21644;ELoC&#65292;&#22312;&#19977;&#31181;&#26465;&#20214;&#19979;&#27809;&#26377;&#21457;&#29616;&#24046;&#24322;&#65292;&#20294;&#32771;&#34385;&#21040;&#20854;&#20182;&#24515;&#29702;&#21464;&#37327;&#65292;&#20986;&#29616;&#20102;&#26356;&#22797;&#26434;&#30340;&#24773;&#20917;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#32467;&#26524;&#20284;&#20046;&#34920;&#26126;&#38656;&#35201;&#32771;&#34385;&#20010;&#20307;&#30340;&#24515;&#29702;&#29305;&#24449;&#65292;&#20197;&#25552;&#20379;&#19981;&#21516;&#21644;&#26368;&#20339;&#30340;&#20114;&#21160;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
In industrial scenarios, there is widespread use of collaborative robots (cobots), and growing interest is directed at evaluating and measuring the impact of some characteristics of the cobot on the human factor. In the present pilot study, the effect that the production rhythm (C1 - Slow, C2 - Fast, C3 - Adapted to the participant's pace) of a cobot has on the Experiential Locus of Control (ELoC) and the emotional state of 31 participants has been examined. The operators' performance, the degree of basic internal Locus of Control, and the attitude towards the robots were also considered. No difference was found regarding the emotional state and the ELoC in the three conditions, but considering the other psychological variables, a more complex situation emerges. Overall, results seem to indicate a need to consider the person's psychological characteristics to offer a differentiated and optimal interaction experience.
&lt;/p&gt;</description></item></channel></rss>