<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36825;&#31687;&#35770;&#25991;&#24635;&#32467;&#20102;&#24037;&#19994;&#21644;&#23398;&#26415;&#30028;&#20013;&#30340;&#33258;&#21160;&#39550;&#39542;&#31471;&#21040;&#31471;&#35268;&#21010;&#26041;&#27861;&#65292;&#21253;&#25324;&#29305;&#26031;&#25289;FSD V12&#12289;Momenta 2023&#12289;Horizon Robotics 2023&#12289;Motional RoboTaxi 2022&#12289;Woven Planet&#65288;&#20016;&#30000;&#65289;&#65306;&#22478;&#24066;&#39550;&#39542;&#21592;&#21644;Nvidia&#65292;&#24182;&#22238;&#39038;&#20102;&#26368;&#26032;&#30340;&#23398;&#26415;&#30740;&#31350;&#12290;&#36825;&#31687;&#25991;&#31456;&#25552;&#20379;&#20102;2022-2023&#24180;&#31471;&#21040;&#31471;&#35268;&#21010;&#30340;&#26368;&#26032;&#32467;&#26500;&#21644;&#24555;&#36895;&#23398;&#20064;&#65292;&#24182;&#36866;&#29992;&#20110;&#21021;&#23398;&#32773;&#21644;&#39640;&#32423;&#30740;&#31350;&#20154;&#21592;&#12290;</title><link>http://arxiv.org/abs/2401.08658</link><description>&lt;p&gt;
&#24037;&#19994;&#21644;&#23398;&#26415;&#30028;&#20013;&#30340;&#33258;&#21160;&#39550;&#39542;&#31471;&#21040;&#31471;&#35268;&#21010;&#65306;2022-2023&#24180;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
End-To-End Planning of Autonomous Driving in Industry and Academia: 2022-2023. (arXiv:2401.08658v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08658
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#24635;&#32467;&#20102;&#24037;&#19994;&#21644;&#23398;&#26415;&#30028;&#20013;&#30340;&#33258;&#21160;&#39550;&#39542;&#31471;&#21040;&#31471;&#35268;&#21010;&#26041;&#27861;&#65292;&#21253;&#25324;&#29305;&#26031;&#25289;FSD V12&#12289;Momenta 2023&#12289;Horizon Robotics 2023&#12289;Motional RoboTaxi 2022&#12289;Woven Planet&#65288;&#20016;&#30000;&#65289;&#65306;&#22478;&#24066;&#39550;&#39542;&#21592;&#21644;Nvidia&#65292;&#24182;&#22238;&#39038;&#20102;&#26368;&#26032;&#30340;&#23398;&#26415;&#30740;&#31350;&#12290;&#36825;&#31687;&#25991;&#31456;&#25552;&#20379;&#20102;2022-2023&#24180;&#31471;&#21040;&#31471;&#35268;&#21010;&#30340;&#26368;&#26032;&#32467;&#26500;&#21644;&#24555;&#36895;&#23398;&#20064;&#65292;&#24182;&#36866;&#29992;&#20110;&#21021;&#23398;&#32773;&#21644;&#39640;&#32423;&#30740;&#31350;&#20154;&#21592;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#23545;&#30446;&#21069;&#22312;&#24037;&#19994;&#21644;&#23398;&#26415;&#30028;&#25253;&#21578;&#30340;&#21253;&#25324;&#35814;&#32454;&#25216;&#26415;&#22312;&#20869;&#30340;&#26041;&#27861;&#36827;&#34892;&#24555;&#36895;&#22238;&#39038;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#26412;&#25991;&#22238;&#39038;&#20102;&#21253;&#25324;&#29305;&#26031;&#25289;FSD V12&#12289;Momenta 2023&#12289;Horizon Robotics 2023&#12289;Motional RoboTaxi 2022&#12289;Woven Planet&#65288;&#20016;&#30000;&#65289;&#65306;&#22478;&#24066;&#39550;&#39542;&#21592;&#21644;Nvidia&#22312;&#20869;&#30340;&#31471;&#21040;&#31471;&#35268;&#21010;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#22238;&#39038;&#20102;&#35843;&#26597;&#33258;&#21160;&#39550;&#39542;&#31471;&#21040;&#31471;&#35268;&#21010;&#30340;&#26368;&#26032;&#23398;&#26415;&#30740;&#31350;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;2022-2023&#24180;&#31471;&#21040;&#31471;&#35268;&#21010;&#30340;&#26368;&#26032;&#32467;&#26500;&#21644;&#24555;&#36895;&#23398;&#20064;&#65292;&#20026;&#21021;&#23398;&#32773;&#25552;&#20379;&#20102;&#20837;&#38376;&#26448;&#26009;&#65292;&#20379;&#20854;&#20102;&#35299;&#24037;&#19994;&#21644;&#23398;&#26415;&#30028;&#20013;&#30340;&#31471;&#21040;&#31471;&#33258;&#21160;&#39550;&#39542;&#35268;&#21010;&#30340;&#26368;&#26032;&#21457;&#23637;&#65292;&#21516;&#26102;&#20063;&#20026;&#39640;&#32423;&#30740;&#31350;&#20154;&#21592;&#25552;&#20379;&#20102;&#34917;&#20805;&#36164;&#26009;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to provide a quick review of the methods including the technologies in detail that are currently reported in industry and academia. Specifically, this paper reviews the end-to-end planning, including Tesla FSD V12, Momenta 2023, Horizon Robotics 2023, Motional RoboTaxi 2022, Woven Planet (Toyota): Urban Driver, and Nvidia. In addition, we review the state-of-the-art academic studies that investigate end-to-end planning of autonomous driving. This paper provides readers with a concise structure and fast learning of state-of-the-art end-to-end planning for 2022-2023. This article provides a meaningful overview as introductory material for beginners to follow the state-of-the-art end-to-end planning of autonomous driving in industry and academia, as well as supplementary material for advanced researchers.
&lt;/p&gt;</description></item><item><title>FEDORA&#26159;&#19968;&#20010;&#39134;&#34892;&#20107;&#20214;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#25968;&#25454;&#38598;&#32570;&#23569;&#23436;&#25972;&#25968;&#25454;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#38382;&#39064;&#65292;&#26088;&#22312;&#24110;&#21161;&#22312;&#36164;&#28304;&#21463;&#38480;&#29615;&#22659;&#19979;&#23454;&#29616;&#22522;&#20110;&#35270;&#35273;&#30340;&#33258;&#20027;&#23548;&#33322;&#21644;&#36991;&#38556;&#12290;</title><link>http://arxiv.org/abs/2305.14392</link><description>&lt;p&gt;
FEDORA&#65306;&#29992;&#20110;&#21453;&#24212;&#34892;&#20026;&#30340;&#39134;&#34892;&#20107;&#20214;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
FEDORA: Flying Event Dataset fOr Reactive behAvior. (arXiv:2305.14392v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14392
&lt;/p&gt;
&lt;p&gt;
FEDORA&#26159;&#19968;&#20010;&#39134;&#34892;&#20107;&#20214;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#25968;&#25454;&#38598;&#32570;&#23569;&#23436;&#25972;&#25968;&#25454;&#21644;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#38382;&#39064;&#65292;&#26088;&#22312;&#24110;&#21161;&#22312;&#36164;&#28304;&#21463;&#38480;&#29615;&#22659;&#19979;&#23454;&#29616;&#22522;&#20110;&#35270;&#35273;&#30340;&#33258;&#20027;&#23548;&#33322;&#21644;&#36991;&#38556;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#29289;&#20307;&#22312;&#39134;&#34892;&#20013;&#20351;&#29992;&#26497;&#23569;&#25968;&#30340;&#31070;&#32463;&#20803;&#21644;&#26497;&#20302;&#30340;&#22833;&#35823;&#29575;&#25191;&#34892;&#22797;&#26434;&#30340;&#39640;&#36895;&#26426;&#21160;&#65292;&#31361;&#26174;&#20102;&#36825;&#20123;&#36164;&#28304;&#21463;&#38480;&#21046;&#30340;&#29983;&#29289;&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#12290;&#36817;&#24180;&#26469;&#65292;&#20107;&#20214;&#39537;&#21160;&#30828;&#20214;&#36880;&#28176;&#25104;&#20026;&#22312;&#36164;&#28304;&#21463;&#38480;&#29615;&#22659;&#20013;&#23454;&#29616;&#22797;&#26434;&#35270;&#35273;&#20219;&#21153;&#30340;&#19968;&#31181;&#26377;&#21069;&#36884;&#30340;&#26041;&#27861;&#12290;&#22522;&#20110;&#35270;&#35273;&#30340;&#33258;&#20027;&#23548;&#33322;&#21644;&#36991;&#38556;&#21253;&#25324;&#20960;&#20010;&#29420;&#31435;&#20294;&#30456;&#20851;&#30340;&#20219;&#21153;&#65292;&#22914;&#20809;&#27969;&#20272;&#35745;&#12289;&#28145;&#24230;&#20272;&#35745;&#12289;&#21516;&#26102;&#23450;&#20301;&#19982;&#24314;&#22270;&#65288;SLAM&#65289;&#12289;&#29289;&#20307;&#26816;&#27979;&#21644;&#35782;&#21035;&#12290;&#20026;&#20102;&#30830;&#20445;&#36825;&#20123;&#20219;&#21153;&#20043;&#38388;&#30340;&#19968;&#33268;&#24615;&#65292;&#20182;&#20204;&#24517;&#39035;&#22312;&#21333;&#20010;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#35757;&#32451;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#26377;&#25968;&#25454;&#38598;&#21482;&#25552;&#20379;&#25152;&#38656;&#25968;&#25454;&#30340;&#36873;&#23450;&#23376;&#38598;&#65292;&#36825;&#20351;&#24471;&#32593;&#32476;&#38388;&#30340;&#19968;&#33268;&#24615;&#38590;&#20197;&#23454;&#29616;&#12290;&#29616;&#26377;&#25968;&#25454;&#38598;&#30340;&#21478;&#19968;&#20010;&#38480;&#21046;&#26159;&#25552;&#20379;&#30340;&#26377;&#38480;&#26102;&#38388;&#20998;&#36776;&#29575;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;FEDORA&#65292;
&lt;/p&gt;
&lt;p&gt;
The ability of living organisms to perform complex high speed manoeuvers in flight with a very small number of neurons and an incredibly low failure rate highlights the efficacy of these resource-constrained biological systems. Event-driven hardware has emerged, in recent years, as a promising avenue for implementing complex vision tasks in resource-constrained environments. Vision-based autonomous navigation and obstacle avoidance consists of several independent but related tasks such as optical flow estimation, depth estimation, Simultaneous Localization and Mapping (SLAM), object detection, and recognition. To ensure coherence between these tasks, it is imperative that they be trained on a single dataset. However, most existing datasets provide only a selected subset of the required data. This makes inter-network coherence difficult to achieve. Another limitation of existing datasets is the limited temporal resolution they provide. To address these limitations, we present FEDORA, a 
&lt;/p&gt;</description></item></channel></rss>