<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#23433;&#20840;&#39640;&#25928;&#22320;&#23398;&#20064;&#26426;&#22120;&#20154;&#39135;&#29289;&#20999;&#21106;&#20219;&#21153;&#30340;Dual Simulator&#26694;&#26550;&#12290;</title><link>https://arxiv.org/abs/2404.02569</link><description>&lt;p&gt;
SliceIt! -- &#19968;&#20010;&#29992;&#20110;&#23398;&#20064;&#26426;&#22120;&#20154;&#39135;&#29289;&#20999;&#21106;&#30340;&#21452;&#37325;&#27169;&#25311;&#22120;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
SliceIt! -- A Dual Simulator Framework for Learning Robot Food Slicing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02569
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#23433;&#20840;&#39640;&#25928;&#22320;&#23398;&#20064;&#26426;&#22120;&#20154;&#39135;&#29289;&#20999;&#21106;&#20219;&#21153;&#30340;Dual Simulator&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21416;&#25151;&#26426;&#22120;&#20154;&#21487;&#20197;&#36890;&#36807;&#20943;&#36731;&#26085;&#24120;&#28902;&#29712;&#20219;&#21153;&#30340;&#36127;&#25285;&#65292;&#25552;&#39640;&#23478;&#24237;&#20307;&#39564;&#12290;&#28982;&#32780;&#65292;&#22312;&#22788;&#29702;&#21361;&#38505;&#24037;&#20855;&#65288;&#22914;&#21416;&#25151;&#20992;&#20855;&#65289;&#26102;&#65292;&#36825;&#20123;&#26426;&#22120;&#20154;&#24517;&#39035;&#22312;&#20849;&#20139;&#20154;&#31867;&#29615;&#22659;&#20013;&#28789;&#24039;&#19988;&#23433;&#20840;&#22320;&#25191;&#34892;&#20219;&#21153;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#20351;&#26426;&#22120;&#20154;&#33021;&#22815;&#33258;&#20027;&#19988;&#23433;&#20840;&#22320;&#23398;&#20064;&#39135;&#29289;&#20999;&#21106;&#20219;&#21153;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;&#36866;&#24212;&#24615;&#25511;&#21046;&#65292;&#20351;&#29992;&#21327;&#20316;&#26426;&#22120;&#20154;&#25110;&#24037;&#19994;&#26426;&#22120;&#20154;&#25163;&#33218;&#25191;&#34892;&#39135;&#29289;&#20999;&#21106;&#20219;&#21153;&#65292;&#20197;&#36866;&#24212;&#19981;&#21516;&#26448;&#26009;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#35757;&#32451;&#26426;&#22120;&#20154;&#20197;&#21512;&#35268;&#26041;&#24335;&#25805;&#20316;&#20992;&#20855;&#65292;&#20943;&#23569;&#39135;&#29289;&#21644;&#20999;&#33756;&#26495;&#26045;&#21152;&#30340;&#25509;&#35302;&#21147;&#12290;&#28982;&#32780;&#65292;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#35757;&#32451;&#26426;&#22120;&#20154;&#21487;&#33021;&#25928;&#29575;&#20302;&#19979;&#12289;&#21361;&#38505;&#65292;&#24182;&#23548;&#33268;&#22823;&#37327;&#39135;&#29289;&#28010;&#36153;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;SliceIt!&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#23433;&#20840;&#39640;&#25928;&#22320;&#23398;&#20064;&#26426;&#22120;&#20154;&#39135;&#29289;&#20999;&#21106;&#20219;&#21153;&#30340;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02569v1 Announce Type: cross  Abstract: Cooking robots can enhance the home experience by reducing the burden of daily chores. However, these robots must perform their tasks dexterously and safely in shared human environments, especially when handling dangerous tools such as kitchen knives. This study focuses on enabling a robot to autonomously and safely learn food-cutting tasks. More specifically, our goal is to enable a collaborative robot or industrial robot arm to perform food-slicing tasks by adapting to varying material properties using compliance control. Our approach involves using Reinforcement Learning (RL) to train a robot to compliantly manipulate a knife, by reducing the contact forces exerted by the food items and by the cutting board. However, training the robot in the real world can be inefficient, and dangerous, and result in a lot of food waste. Therefore, we proposed SliceIt!, a framework for safely and efficiently learning robot food-slicing tasks in sim
&lt;/p&gt;</description></item></channel></rss>