<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#26694;&#26550;SWBT&#65292;&#33021;&#22815;&#22312;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#20013;&#26377;&#25928;&#22320;&#20174;&#19987;&#23478;&#28436;&#31034;&#21644;&#19981;&#23436;&#32654;&#28436;&#31034;&#20013;&#23398;&#20064;&#65292;&#32780;&#26080;&#38656;&#19982;&#29615;&#22659;&#36827;&#34892;&#20132;&#20114;&#12290;&#36825;&#26159;&#31532;&#19968;&#20010;&#23558;&#19981;&#23436;&#32654;&#28436;&#31034;&#25972;&#21512;&#21040;&#31163;&#32447;&#27169;&#20223;&#23398;&#20064;&#35774;&#32622;&#20013;&#30340;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#30340;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2401.08957</link><description>&lt;p&gt;
SWBT&#65306;&#20855;&#26377;&#19981;&#23436;&#32654;&#28436;&#31034;&#30340;&#30456;&#20284;&#24615;&#21152;&#26435;&#34892;&#20026;&#36716;&#25442;&#22120;&#29992;&#20110;&#26426;&#22120;&#20154;&#25805;&#20316;
&lt;/p&gt;
&lt;p&gt;
SWBT: Similarity Weighted Behavior Transformer with the Imperfect Demonstration for Robotic Manipulation. (arXiv:2401.08957v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08957
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#26694;&#26550;SWBT&#65292;&#33021;&#22815;&#22312;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#20013;&#26377;&#25928;&#22320;&#20174;&#19987;&#23478;&#28436;&#31034;&#21644;&#19981;&#23436;&#32654;&#28436;&#31034;&#20013;&#23398;&#20064;&#65292;&#32780;&#26080;&#38656;&#19982;&#29615;&#22659;&#36827;&#34892;&#20132;&#20114;&#12290;&#36825;&#26159;&#31532;&#19968;&#20010;&#23558;&#19981;&#23436;&#32654;&#28436;&#31034;&#25972;&#21512;&#21040;&#31163;&#32447;&#27169;&#20223;&#23398;&#20064;&#35774;&#32622;&#20013;&#30340;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27169;&#20223;&#23398;&#20064;&#26088;&#22312;&#20174;&#19987;&#23478;&#28436;&#31034;&#20013;&#23398;&#20064;&#26368;&#20339;&#25511;&#21046;&#31574;&#30053;&#65292;&#24050;&#25104;&#20026;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#30340;&#26377;&#25928;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#20808;&#21069;&#30340;&#27169;&#20223;&#23398;&#20064;&#26041;&#27861;&#35201;&#20040;&#20165;&#20351;&#29992;&#26114;&#36149;&#30340;&#19987;&#23478;&#28436;&#31034;&#24182;&#24573;&#30053;&#19981;&#23436;&#32654;&#30340;&#28436;&#31034;&#65292;&#35201;&#20040;&#20381;&#36182;&#20110;&#19982;&#29615;&#22659;&#30340;&#20132;&#20114;&#21644;&#20174;&#22312;&#32447;&#32463;&#39564;&#20013;&#23398;&#20064;&#12290;&#22312;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#26088;&#22312;&#20811;&#26381;&#19978;&#36848;&#20004;&#20010;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Similarity Weighted Behavior Transformer&#65288;SWBT&#65289;&#30340;&#26032;&#22411;&#26694;&#26550;&#12290;SWBT&#33021;&#22815;&#26377;&#25928;&#22320;&#20174;&#19987;&#23478;&#28436;&#31034;&#21644;&#19981;&#23436;&#32654;&#28436;&#31034;&#20013;&#23398;&#20064;&#65292;&#32780;&#26080;&#38656;&#19982;&#29615;&#22659;&#36827;&#34892;&#20132;&#20114;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;&#26131;&#33719;&#21462;&#30340;&#19981;&#23436;&#32654;&#28436;&#31034;&#65292;&#22914;&#27491;&#21521;&#21644;&#21453;&#21521;&#21160;&#21147;&#23398;&#65292;&#36890;&#36807;&#23398;&#20064;&#26377;&#30410;&#20449;&#24687;&#26174;&#33879;&#22686;&#24378;&#20102;&#32593;&#32476;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#25105;&#20204;&#26159;&#31532;&#19968;&#20010;&#23581;&#35797;&#23558;&#19981;&#23436;&#32654;&#28436;&#31034;&#25972;&#21512;&#21040;&#31163;&#32447;&#27169;&#20223;&#23398;&#20064;&#35774;&#32622;&#20013;&#30340;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#20013;&#30340;&#30740;&#31350;&#12290;&#22312;ManiSkill2 bench&#19978;&#36827;&#34892;&#20102;&#22823;&#37327;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Imitation learning (IL), aiming to learn optimal control policies from expert demonstrations, has been an effective method for robot manipulation tasks. However, previous IL methods either only use expensive expert demonstrations and omit imperfect demonstrations or rely on interacting with the environment and learning from online experiences. In the context of robotic manipulation, we aim to conquer the above two challenges and propose a novel framework named Similarity Weighted Behavior Transformer (SWBT). SWBT effectively learn from both expert and imperfect demonstrations without interaction with environments. We reveal that the easy-to-get imperfect demonstrations, such as forward and inverse dynamics, significantly enhance the network by learning fruitful information. To the best of our knowledge, we are the first to attempt to integrate imperfect demonstrations into the offline imitation learning setting for robot manipulation tasks. Extensive experiments on the ManiSkill2 bench
&lt;/p&gt;</description></item></channel></rss>