<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>SRLM &#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#21512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26032;&#22411;&#28151;&#21512;&#26041;&#27861;&#65292;&#29992;&#20110;&#20154;&#26426;&#20132;&#20114;&#24335;&#31038;&#20132;&#26426;&#22120;&#20154;&#23548;&#33322;&#65292;&#36890;&#36807;&#23454;&#26102;&#30340;&#20154;&#31867;&#35821;&#35328;&#25351;&#20196;&#25512;&#26029;&#20840;&#23616;&#35268;&#21010;&#65292;&#24182;&#22312;&#20844;&#20849;&#31354;&#38388;&#20013;&#25552;&#20379;&#22810;&#31181;&#31038;&#20132;&#26381;&#21153;&#65292;&#34920;&#29616;&#20986;&#20986;&#33394;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2403.15648</link><description>&lt;p&gt;
SRLM: &#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#36827;&#34892;&#20154;&#26426;&#20132;&#20114;&#24335;&#31038;&#20132;&#26426;&#22120;&#20154;&#23548;&#33322;
&lt;/p&gt;
&lt;p&gt;
SRLM: Human-in-Loop Interactive Social Robot Navigation with Large Language Model and Deep Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15648
&lt;/p&gt;
&lt;p&gt;
SRLM &#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#21512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26032;&#22411;&#28151;&#21512;&#26041;&#27861;&#65292;&#29992;&#20110;&#20154;&#26426;&#20132;&#20114;&#24335;&#31038;&#20132;&#26426;&#22120;&#20154;&#23548;&#33322;&#65292;&#36890;&#36807;&#23454;&#26102;&#30340;&#20154;&#31867;&#35821;&#35328;&#25351;&#20196;&#25512;&#26029;&#20840;&#23616;&#35268;&#21010;&#65292;&#24182;&#22312;&#20844;&#20849;&#31354;&#38388;&#20013;&#25552;&#20379;&#22810;&#31181;&#31038;&#20132;&#26381;&#21153;&#65292;&#34920;&#29616;&#20986;&#20986;&#33394;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#21517;&#20132;&#20114;&#24335;&#31038;&#20132;&#26426;&#22120;&#20154;&#21161;&#25163;&#24517;&#39035;&#22312;&#22797;&#26434;&#25317;&#25380;&#30340;&#31354;&#38388;&#20013;&#25552;&#20379;&#26381;&#21153;&#65292;&#26681;&#25454;&#23454;&#26102;&#30340;&#20154;&#31867;&#35821;&#35328;&#25351;&#20196;&#25110;&#21453;&#39304;&#35843;&#25972;&#20854;&#34892;&#20026;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Social Robot Planner (SRLM) &#30340;&#26032;&#22411;&#28151;&#21512;&#26041;&#27861;&#65292;&#23427;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#21644;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;DRL&#65289;&#25972;&#21512;&#36215;&#26469;&#65292;&#20197;&#22312;&#20805;&#26021;&#30528;&#20154;&#32676;&#30340;&#20844;&#20849;&#31354;&#38388;&#20013;&#23548;&#33322;&#65292;&#24182;&#25552;&#20379;&#22810;&#31181;&#31038;&#20132;&#26381;&#21153;&#12290;SRLM &#36890;&#36807;&#23454;&#26102;&#30340;&#20154;&#26426;&#20132;&#20114;&#25351;&#20196;&#25512;&#26029;&#20840;&#23616;&#35268;&#21010;&#65292;&#24182;&#23558;&#31038;&#20132;&#20449;&#24687;&#32534;&#30721;&#21040;&#22522;&#20110;LLM&#30340;&#22823;&#22411;&#23548;&#33322;&#27169;&#22411;&#65288;LNM&#65289;&#20013;&#65292;&#29992;&#20110;&#20302;&#23618;&#27425;&#30340;&#36816;&#21160;&#25191;&#34892;&#12290;&#27492;&#22806;&#65292;&#35774;&#35745;&#20102;&#19968;&#20010;&#22522;&#20110;DRL&#30340;&#35268;&#21010;&#22120;&#26469;&#20445;&#25345;&#22522;&#20934;&#24615;&#33021;&#65292;&#36890;&#36807;&#22823;&#22411;&#21453;&#39304;&#27169;&#22411;&#65288;LFM&#65289;&#19982;LNM&#34701;&#21512;&#65292;&#20197;&#35299;&#20915;&#24403;&#21069;&#25991;&#26412;&#21644;LLM&#39537;&#21160;&#30340;LNM&#30340;&#19981;&#31283;&#23450;&#24615;&#12290;&#26368;&#21518;&#65292;SRLM &#22312;&#24191;&#27867;&#30340;&#23454;&#39564;&#20013;&#23637;&#31034;&#20986;&#20102;&#20986;&#33394;&#30340;&#24615;&#33021;&#12290;&#26377;&#20851;&#27492;&#24037;&#20316;&#30340;&#26356;&#22810;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#35775;&#38382;&#65306;https://sites.g
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15648v1 Announce Type: cross  Abstract: An interactive social robotic assistant must provide services in complex and crowded spaces while adapting its behavior based on real-time human language commands or feedback. In this paper, we propose a novel hybrid approach called Social Robot Planner (SRLM), which integrates Large Language Models (LLM) and Deep Reinforcement Learning (DRL) to navigate through human-filled public spaces and provide multiple social services. SRLM infers global planning from human-in-loop commands in real-time, and encodes social information into a LLM-based large navigation model (LNM) for low-level motion execution. Moreover, a DRL-based planner is designed to maintain benchmarking performance, which is blended with LNM by a large feedback model (LFM) to address the instability of current text and LLM-driven LNM. Finally, SRLM demonstrates outstanding performance in extensive experiments. More details about this work are available at: https://sites.g
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;A-KIT&#65292;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Kalman-informed transformer&#65292;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#20256;&#24863;&#22120;&#34701;&#21512;&#20013;&#21464;&#21270;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#12290;&#23427;&#36890;&#36807;&#36866;&#24212;&#23454;&#38469;&#24773;&#20917;&#20013;&#30340;&#36807;&#31243;&#22122;&#22768;&#21464;&#21270;&#65292;&#25913;&#36827;&#20102;&#20272;&#35745;&#29366;&#24577;&#30340;&#20934;&#30830;&#24615;&#65292;&#36991;&#20813;&#20102;&#28388;&#27874;&#22120;&#21457;&#25955;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.09987</link><description>&lt;p&gt;
A-KIT:&#33258;&#36866;&#24212;Kalman-Informed Transformer
&lt;/p&gt;
&lt;p&gt;
A-KIT: Adaptive Kalman-Informed Transformer. (arXiv:2401.09987v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09987
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;A-KIT&#65292;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Kalman-informed transformer&#65292;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#20256;&#24863;&#22120;&#34701;&#21512;&#20013;&#21464;&#21270;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#12290;&#23427;&#36890;&#36807;&#36866;&#24212;&#23454;&#38469;&#24773;&#20917;&#20013;&#30340;&#36807;&#31243;&#22122;&#22768;&#21464;&#21270;&#65292;&#25913;&#36827;&#20102;&#20272;&#35745;&#29366;&#24577;&#30340;&#20934;&#30830;&#24615;&#65292;&#36991;&#20813;&#20102;&#28388;&#27874;&#22120;&#21457;&#25955;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#23637;&#21345;&#23572;&#26364;&#28388;&#27874;&#22120;(EKF)&#26159;&#23548;&#33322;&#24212;&#29992;&#20013;&#24191;&#27867;&#37319;&#29992;&#30340;&#20256;&#24863;&#22120;&#34701;&#21512;&#26041;&#27861;&#12290;EKF&#30340;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#26159;&#22312;&#32447;&#30830;&#23450;&#21453;&#26144;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#23613;&#31649;&#24120;&#35265;&#30340;EKF&#23454;&#29616;&#20551;&#35774;&#36807;&#31243;&#22122;&#22768;&#26159;&#24658;&#23450;&#30340;&#65292;&#20294;&#22312;&#23454;&#38469;&#24773;&#20917;&#20013;&#65292;&#36807;&#31243;&#22122;&#22768;&#26159;&#21464;&#21270;&#30340;&#65292;&#23548;&#33268;&#20272;&#35745;&#29366;&#24577;&#30340;&#19981;&#20934;&#30830;&#65292;&#24182;&#21487;&#33021;&#23548;&#33268;&#28388;&#27874;&#22120;&#21457;&#25955;&#12290;&#20026;&#20102;&#24212;&#23545;&#36825;&#31181;&#24773;&#20917;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#27169;&#22411;&#30340;&#33258;&#36866;&#24212;EKF&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#24615;&#33021;&#25913;&#36827;&#65292;&#20984;&#26174;&#20102;&#23545;&#31283;&#20581;&#33258;&#36866;&#24212;&#26041;&#27861;&#30340;&#38656;&#27714;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25512;&#23548;&#24182;&#24341;&#20837;&#20102;A-KIT&#65292;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Kalman-informed transformer&#65292;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#21464;&#21270;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#12290;A-KIT&#26694;&#26550;&#36866;&#29992;&#20110;&#20219;&#20309;&#31867;&#22411;&#30340;&#20256;&#24863;&#22120;&#34701;&#21512;&#12290;&#25105;&#20204;&#22312;&#36825;&#37324;&#20171;&#32461;&#20102;&#22522;&#20110;&#24815;&#24615;&#23548;&#33322;&#31995;&#32479;&#21644;&#22810;&#26222;&#21202;&#36895;&#24230;&#26085;&#24535;&#30340;&#38750;&#32447;&#24615;&#20256;&#24863;&#22120;&#34701;&#21512;&#26041;&#27861;&#12290;&#36890;&#36807;&#20351;&#29992;&#26469;&#33258;&#33258;&#20027;&#26080;&#20154;&#28508;&#27700;&#22120;&#30340;&#30495;&#23454;&#35760;&#24405;&#25968;&#25454;&#65292;&#25105;&#20204;&#39564;&#35777;&#20102;A-KIT&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The extended Kalman filter (EKF) is a widely adopted method for sensor fusion in navigation applications. A crucial aspect of the EKF is the online determination of the process noise covariance matrix reflecting the model uncertainty. While common EKF implementation assumes a constant process noise, in real-world scenarios, the process noise varies, leading to inaccuracies in the estimated state and potentially causing the filter to diverge. To cope with such situations, model-based adaptive EKF methods were proposed and demonstrated performance improvements, highlighting the need for a robust adaptive approach. In this paper, we derive and introduce A-KIT, an adaptive Kalman-informed transformer to learn the varying process noise covariance online. The A-KIT framework is applicable to any type of sensor fusion. Here, we present our approach to nonlinear sensor fusion based on an inertial navigation system and Doppler velocity log. By employing real recorded data from an autonomous und
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#19981;&#31934;&#30830;&#31070;&#32463;&#32593;&#32476;&#30340;&#20998;&#24067;&#40065;&#26834;&#32479;&#35745;&#39564;&#35777;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#20027;&#21160;&#23398;&#20064;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#31070;&#32463;&#32593;&#32476;&#39564;&#35777;&#65292;&#21487;&#20197;&#22312;&#22823;&#37327;&#30340;&#20998;&#24067;&#19978;&#25552;&#20379;&#23545;&#40657;&#30418;&#31995;&#32479;&#34892;&#20026;&#30340;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2308.14815</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#31934;&#30830;&#31070;&#32463;&#32593;&#32476;&#30340;&#20998;&#24067;&#40065;&#26834;&#32479;&#35745;&#39564;&#35777;
&lt;/p&gt;
&lt;p&gt;
Distributionally Robust Statistical Verification with Imprecise Neural Networks. (arXiv:2308.14815v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.14815
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#19981;&#31934;&#30830;&#31070;&#32463;&#32593;&#32476;&#30340;&#20998;&#24067;&#40065;&#26834;&#32479;&#35745;&#39564;&#35777;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#20027;&#21160;&#23398;&#20064;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#31070;&#32463;&#32593;&#32476;&#39564;&#35777;&#65292;&#21487;&#20197;&#22312;&#22823;&#37327;&#30340;&#20998;&#24067;&#19978;&#25552;&#20379;&#23545;&#40657;&#30418;&#31995;&#32479;&#34892;&#20026;&#30340;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;AI&#23433;&#20840;&#39046;&#22495;&#65292;&#19968;&#20010;&#29305;&#21035;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#26159;&#22312;&#39640;&#32500;&#33258;&#20027;&#31995;&#32479;&#30340;&#34892;&#20026;&#19978;&#25552;&#20379;&#20445;&#35777;&#12290;&#20197;&#21487;&#36798;&#24615;&#20998;&#26512;&#20026;&#20013;&#24515;&#30340;&#39564;&#35777;&#26041;&#27861;&#26080;&#27861;&#25193;&#23637;&#65292;&#32780;&#32431;&#31929;&#30340;&#32479;&#35745;&#26041;&#27861;&#21463;&#21040;&#23545;&#37319;&#26679;&#36807;&#31243;&#30340;&#20998;&#24067;&#20551;&#35774;&#30340;&#38480;&#21046;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#40657;&#30418;&#31995;&#32479;&#30340;&#20998;&#24067;&#40065;&#26834;&#29256;&#26412;&#30340;&#32479;&#35745;&#39564;&#35777;&#38382;&#39064;&#65292;&#20854;&#20013;&#25105;&#20204;&#30340;&#24615;&#33021;&#20445;&#35777;&#36866;&#29992;&#20110;&#22823;&#37327;&#30340;&#20998;&#24067;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20027;&#21160;&#23398;&#20064;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#31070;&#32463;&#32593;&#32476;&#39564;&#35777;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#26041;&#27861;&#30340;&#19968;&#20010;&#26680;&#24515;&#37096;&#20998;&#26159;&#19968;&#31181;&#31216;&#20026;&#19981;&#31934;&#30830;&#31070;&#32463;&#32593;&#32476;&#30340;&#38598;&#25104;&#25216;&#26415;&#65292;&#23427;&#25552;&#20379;&#20102;&#19981;&#30830;&#23450;&#24615;&#20197;&#25351;&#23548;&#20027;&#21160;&#23398;&#20064;&#12290;&#20027;&#21160;&#23398;&#20064;&#20351;&#29992;&#20102;&#19968;&#31181;&#31216;&#20026;Sherlock&#30340;&#20840;&#38754;&#31070;&#32463;&#32593;&#32476;&#39564;&#35777;&#24037;&#20855;&#26469;&#25910;&#38598;&#26679;&#26412;&#12290;&#22312;openAI gym Mujoco&#29615;&#22659;&#20013;&#20351;&#29992;&#22810;&#20010;&#29289;&#29702;&#27169;&#25311;&#22120;&#36827;&#34892;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
A particularly challenging problem in AI safety is providing guarantees on the behavior of high-dimensional autonomous systems. Verification approaches centered around reachability analysis fail to scale, and purely statistical approaches are constrained by the distributional assumptions about the sampling process. Instead, we pose a distributionally robust version of the statistical verification problem for black-box systems, where our performance guarantees hold over a large family of distributions. This paper proposes a novel approach based on a combination of active learning, uncertainty quantification, and neural network verification. A central piece of our approach is an ensemble technique called Imprecise Neural Networks, which provides the uncertainty to guide active learning. The active learning uses an exhaustive neural-network verification tool Sherlock to collect samples. An evaluation on multiple physical simulators in the openAI gym Mujoco environments with reinforcement-
&lt;/p&gt;</description></item></channel></rss>