<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#23558;&#20154;&#24037;&#26234;&#33021;&#38598;&#25104;&#21040;&#26426;&#26800;&#33218;&#30340;&#20849;&#20139;&#25511;&#21046;&#33539;&#24335;&#20013;&#65292;&#20197;&#24110;&#21161;&#36816;&#21160;&#21463;&#25439;&#20154;&#22763;&#23454;&#29616;&#26356;&#39640;&#31243;&#24230;&#30340;&#20010;&#20154;&#33258;&#27835;&#12290;</title><link>http://arxiv.org/abs/2306.13509</link><description>&lt;p&gt;
&#25506;&#32034;AI&#22686;&#24378;&#30340;&#21327;&#20316;&#25511;&#21046;&#23545;&#20110;&#36741;&#21161;&#26426;&#26800;&#33218;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Exploring AI-enhanced Shared Control for an Assistive Robotic Arm. (arXiv:2306.13509v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13509
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#23558;&#20154;&#24037;&#26234;&#33021;&#38598;&#25104;&#21040;&#26426;&#26800;&#33218;&#30340;&#20849;&#20139;&#25511;&#21046;&#33539;&#24335;&#20013;&#65292;&#20197;&#24110;&#21161;&#36816;&#21160;&#21463;&#25439;&#20154;&#22763;&#23454;&#29616;&#26356;&#39640;&#31243;&#24230;&#30340;&#20010;&#20154;&#33258;&#27835;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36741;&#21161;&#25216;&#26415;&#65292;&#29305;&#21035;&#26159;&#36741;&#21161;&#26426;&#26800;&#33218;&#24050;&#32463;&#25104;&#20026;&#24110;&#21161;&#36816;&#21160;&#21463;&#25439;&#20154;&#22763;&#23454;&#29616;&#33258;&#20027;&#29983;&#27963;&#30340;&#21487;&#33021;&#24615;&#12290;&#36817;&#24180;&#26469;&#65292;&#36234;&#26469;&#36234;&#22810;&#36825;&#26679;&#30340;&#31995;&#32479;&#24050;&#32463;&#38754;&#21521;&#26368;&#32456;&#29992;&#25143;&#25552;&#20379;&#65292;&#20363;&#22914;Kinova Jaco&#26426;&#26800;&#33218;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#22823;&#22810;&#38656;&#35201;&#22797;&#26434;&#30340;&#25163;&#21160;&#25511;&#21046;&#65292;&#36825;&#21487;&#33021;&#20250;&#20351;&#29992;&#25143;&#19981;&#22570;&#37325;&#36127;&#12290;&#22240;&#27492;&#65292;&#30740;&#31350;&#20154;&#21592;&#25506;&#32034;&#35753;&#36825;&#20123;&#26426;&#22120;&#20154;&#33258;&#20027;&#34892;&#21160;&#30340;&#26041;&#24335;&#12290;&#28982;&#32780;&#65292;&#33267;&#23569;&#23545;&#20110;&#36825;&#20010;&#29305;&#23450;&#30340;&#29992;&#25143;&#32676;&#20307;&#26469;&#35828;&#65292;&#36825;&#31181;&#26041;&#27861;&#24050;&#32463;&#34987;&#35777;&#26126;&#26159;&#24466;&#21171;&#30340;&#12290;&#22312;&#36825;&#37324;&#65292;&#29992;&#25143;&#24076;&#26395;&#20445;&#25345;&#25511;&#21046;&#26435;&#20197;&#23454;&#29616;&#26356;&#39640;&#31243;&#24230;&#30340;&#20010;&#20154;&#33258;&#27835;&#65292;&#20294;&#33258;&#20027;&#30340;&#26426;&#22120;&#20154;&#19982;&#27492;&#30456;&#21453;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#22914;&#20309;&#23558;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#38598;&#25104;&#21040;&#20849;&#20139;&#25511;&#21046;&#33539;&#24335;&#20013;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#20851;&#27880;&#20102;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#30028;&#38754;&#30340;&#24517;&#35201;&#35201;&#27714;&#65292;&#20197;&#21450;&#22914;&#20309;&#22312;&#26174;&#33879;&#20943;&#23569;&#24515;&#29702;&#36127;&#25285;&#21644;&#25152;&#38656;&#30340;&#26426;&#21160;&#33021;&#21147;&#30340;&#21516;&#26102;&#20445;&#25345;&#20154;&#31867;&#30340;&#25511;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Assistive technologies and in particular assistive robotic arms have the potential to enable people with motor impairments to live a self-determined life. More and more of these systems have become available for end users in recent years, such as the Kinova Jaco robotic arm. However, they mostly require complex manual control, which can overwhelm users. As a result, researchers have explored ways to let such robots act autonomously. However, at least for this specific group of users, such an approach has shown to be futile. Here, users want to stay in control to achieve a higher level of personal autonomy, to which an autonomous robot runs counter. In our research, we explore how Artifical Intelligence (AI) can be integrated into a shared control paradigm. In particular, we focus on the consequential requirements for the interface between human and robot and how we can keep humans in the loop while still significantly reducing the mental load and required motor skills.
&lt;/p&gt;</description></item></channel></rss>