<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#25216;&#26415;&#30340;&#39640;&#25928;&#36275;&#37096;&#35268;&#21010;&#26041;&#27861;&#65292;&#22312;&#32447;&#25512;&#29702;&#30340;&#35745;&#31639;&#38656;&#27714;&#26497;&#20302;&#65292;&#26080;&#21551;&#21457;&#24335;&#65292;&#24182;&#20381;&#36182;&#36830;&#32493;&#30340;&#21160;&#20316;&#29983;&#25104;&#21487;&#34892;&#30340;&#36275;&#27493;&#12290;</title><link>https://arxiv.org/abs/2403.12589</link><description>&lt;p&gt;
FootstepNet: &#19968;&#31181;&#29992;&#20110;&#24555;&#36895;&#22312;&#32447;&#21452;&#36275;&#36275;&#37096;&#27493;&#24577;&#35268;&#21010;&#21644;&#39044;&#27979;&#30340;&#39640;&#25928;&#28436;&#21592;-&#35780;&#35770;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
FootstepNet: an Efficient Actor-Critic Method for Fast On-line Bipedal Footstep Planning and Forecasting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12589
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#25216;&#26415;&#30340;&#39640;&#25928;&#36275;&#37096;&#35268;&#21010;&#26041;&#27861;&#65292;&#22312;&#32447;&#25512;&#29702;&#30340;&#35745;&#31639;&#38656;&#27714;&#26497;&#20302;&#65292;&#26080;&#21551;&#21457;&#24335;&#65292;&#24182;&#20381;&#36182;&#36830;&#32493;&#30340;&#21160;&#20316;&#29983;&#25104;&#21487;&#34892;&#30340;&#36275;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#19968;&#20010;&#20154;&#24418;&#36816;&#21160;&#25511;&#21046;&#22120;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#65292;&#36890;&#24120;&#20998;&#20026;&#20960;&#20010;&#23376;&#38382;&#39064;&#12290;&#20854;&#20013;&#20043;&#19968;&#26159;&#36275;&#37096;&#27493;&#24577;&#35268;&#21010;&#65292;&#20854;&#20013;&#23450;&#20041;&#20102;&#36275;&#27493;&#30340;&#39034;&#24207;&#12290;&#21363;&#20351;&#22312;&#26356;&#31616;&#21333;&#30340;&#29615;&#22659;&#20013;&#65292;&#25214;&#21040;&#19968;&#20010;&#26368;&#23567;&#24207;&#21015;&#65292;&#29978;&#33267;&#19968;&#20010;&#21487;&#34892;&#30340;&#24207;&#21015;&#65292;&#20063;&#26500;&#25104;&#20102;&#19968;&#20010;&#22797;&#26434;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#22312;&#25991;&#29486;&#20013;&#65292;&#36825;&#20010;&#38382;&#39064;&#36890;&#24120;&#36890;&#36807;&#22522;&#20110;&#25628;&#32034;&#30340;&#31639;&#27861;&#65288;&#20363;&#22914;A*&#30340;&#21464;&#31181;&#65289;&#26469;&#35299;&#20915;&#12290;&#28982;&#32780;&#65292;&#36825;&#26679;&#30340;&#26041;&#27861;&#35201;&#20040;&#35745;&#31639;&#24320;&#38144;&#24456;&#22823;&#65292;&#35201;&#20040;&#20381;&#36182;&#25163;&#24037;&#35843;&#25972;&#22810;&#20010;&#21442;&#25968;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#27493;&#24577;&#35268;&#21010;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#24102;&#26377;&#38556;&#30861;&#29289;&#30340;&#23616;&#37096;&#29615;&#22659;&#20013;&#23548;&#33322;&#65292;&#22522;&#20110;&#26368;&#20808;&#36827;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;DRL&#65289;&#25216;&#26415;&#65292;&#23545;&#22312;&#32447;&#25512;&#29702;&#35201;&#27714;&#38750;&#24120;&#20302;&#30340;&#35745;&#31639;&#38656;&#27714;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#26080;&#21551;&#21457;&#30340;&#65292;&#20381;&#36182;&#20110;&#19968;&#32452;&#36830;&#32493;&#30340;&#21160;&#20316;&#26469;&#29983;&#25104;&#21487;&#34892;&#30340;&#36275;&#27493;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#20854;&#20182;&#26041;&#27861;&#38656;&#35201;&#36873;&#25321;&#19968;&#32452;&#30456;&#20851;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12589v1 Announce Type: cross  Abstract: Designing a humanoid locomotion controller is challenging and classically split up in sub-problems. Footstep planning is one of those, where the sequence of footsteps is defined. Even in simpler environments, finding a minimal sequence, or even a feasible sequence, yields a complex optimization problem. In the literature, this problem is usually addressed by search-based algorithms (e.g. variants of A*). However, such approaches are either computationally expensive or rely on hand-crafted tuning of several parameters. In this work, at first, we propose an efficient footstep planning method to navigate in local environments with obstacles, based on state-of-the art Deep Reinforcement Learning (DRL) techniques, with very low computational requirements for on-line inference. Our approach is heuristic-free and relies on a continuous set of actions to generate feasible footsteps. In contrast, other methods necessitate the selection of a rel
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30528;&#37325;&#20110;&#35780;&#20272;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#20915;&#31574;&#36136;&#37327;&#65292;&#25552;&#20986;&#20102;&#26816;&#27979;&#38750;&#26368;&#20339;&#20915;&#31574;&#22330;&#26223;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#21464;&#24418;&#20851;&#31995;&#26292;&#38706;&#26368;&#20339;&#20915;&#31574;&#36829;&#35268;&#12290;</title><link>https://arxiv.org/abs/2402.18393</link><description>&lt;p&gt;
&#36890;&#36807;&#21464;&#24418;&#27979;&#35797;&#35780;&#20272;&#33258;&#21160;&#39550;&#39542;&#30340;&#20915;&#31574;&#26368;&#20339;&#24615;
&lt;/p&gt;
&lt;p&gt;
Evaluating Decision Optimality of Autonomous Driving via Metamorphic Testing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30528;&#37325;&#20110;&#35780;&#20272;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#20915;&#31574;&#36136;&#37327;&#65292;&#25552;&#20986;&#20102;&#26816;&#27979;&#38750;&#26368;&#20339;&#20915;&#31574;&#22330;&#26223;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#21464;&#24418;&#20851;&#31995;&#26292;&#38706;&#26368;&#20339;&#20915;&#31574;&#36829;&#35268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18393v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#25688;&#35201;&#65306;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#65288;ADS&#65289;&#30340;&#27979;&#35797;&#22312;ADS&#24320;&#21457;&#20013;&#33267;&#20851;&#37325;&#35201;&#65292;&#30446;&#21069;&#20027;&#35201;&#20851;&#27880;&#30340;&#26159;&#23433;&#20840;&#24615;&#12290;&#28982;&#32780;&#65292;&#35780;&#20272;&#38750;&#23433;&#20840;&#20851;&#38190;&#24615;&#33021;&#65292;&#29305;&#21035;&#26159;ADS&#21046;&#23450;&#26368;&#20339;&#20915;&#31574;&#24182;&#20026;&#33258;&#21160;&#36710;&#36742;&#65288;AV&#65289;&#29983;&#25104;&#26368;&#20339;&#36335;&#24452;&#30340;&#33021;&#21147;&#21516;&#26679;&#37325;&#35201;&#65292;&#20197;&#30830;&#20445;AV&#30340;&#26234;&#33021;&#24615;&#24182;&#38477;&#20302;&#39118;&#38505;&#12290;&#30446;&#21069;&#65292;&#40092;&#26377;&#24037;&#20316;&#33268;&#21147;&#20110;&#35780;&#20272;ADS&#30340;&#26368;&#20339;&#20915;&#31574;&#24615;&#33021;&#65292;&#22240;&#20026;&#32570;&#20047;&#30456;&#24212;&#30340;&#39044;&#35328;&#21644;&#29983;&#25104;&#26377;&#38750;&#26368;&#20339;&#20915;&#31574;&#30340;&#22330;&#26223;&#38590;&#24230;&#36739;&#22823;&#12290;&#26412;&#25991;&#20391;&#37325;&#20110;&#35780;&#20272;ADS&#30340;&#20915;&#31574;&#36136;&#37327;&#65292;&#24182;&#25552;&#20986;&#39318;&#20010;&#29992;&#20110;&#26816;&#27979;&#38750;&#26368;&#20339;&#20915;&#31574;&#22330;&#26223;&#65288;NoDSs&#65289;&#30340;&#26041;&#27861;&#65292;&#21363;ADS&#26410;&#35745;&#31639;AV&#30340;&#26368;&#20339;&#36335;&#24452;&#30340;&#24773;&#20917;&#12290;&#39318;&#20808;&#65292;&#20026;&#35299;&#20915;&#39044;&#35328;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26088;&#22312;&#26292;&#38706;&#26368;&#20339;&#20915;&#31574;&#36829;&#35268;&#24773;&#20917;&#30340;&#26032;&#39062;&#21464;&#24418;&#20851;&#31995;&#65288;MR&#65289;&#12290;&#36825;&#20010;MR&#30830;&#23450;&#20102;&#24615;&#33021;&#26368;&#20339;&#20915;&#31574;&#30340;&#36829;&#35268;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18393v1 Announce Type: new  Abstract: Autonomous Driving System (ADS) testing is crucial in ADS development, with the current primary focus being on safety. However, the evaluation of non-safety-critical performance, particularly the ADS's ability to make optimal decisions and produce optimal paths for autonomous vehicles (AVs), is equally vital to ensure the intelligence and reduce risks of AVs. Currently, there is little work dedicated to assessing ADSs' optimal decision-making performance due to the lack of corresponding oracles and the difficulty in generating scenarios with non-optimal decisions. In this paper, we focus on evaluating the decision-making quality of an ADS and propose the first method for detecting non-optimal decision scenarios (NoDSs), where the ADS does not compute optimal paths for AVs. Firstly, to deal with the oracle problem, we propose a novel metamorphic relation (MR) aimed at exposing violations of optimal decisions. The MR identifies the propert
&lt;/p&gt;</description></item><item><title>&#22810;&#23545;&#35937;&#22270;&#24418;&#21487;&#29992;&#24615;&#32593;&#32476;&#65288;MOGAN&#65289;&#27169;&#22411;&#21270;&#20102;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#65292;&#39044;&#27979;&#20102;&#23558;&#26032;&#23545;&#35937;&#25918;&#32622;&#22312;&#22797;&#21512;&#23545;&#35937;&#19978;&#30340;&#25928;&#26524;&#12290;&#22312;&#26500;&#24314;&#20855;&#26377;&#29305;&#23450;&#39640;&#24230;&#25110;&#23646;&#24615;&#30340;&#22612;&#31561;&#20219;&#21153;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#35268;&#21010;&#25214;&#21040;&#20855;&#26377;&#36866;&#24403;&#21487;&#29992;&#24615;&#30340;&#23545;&#35937;&#22534;&#21472;&#25805;&#20316;&#30340;&#24207;&#21015;&#12290;&#25105;&#20204;&#30340;&#31995;&#32479;&#33021;&#22815;&#27491;&#30830;&#24314;&#27169;&#38750;&#24120;&#22797;&#26434;&#30340;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#65292;&#24182;&#22312;&#27169;&#25311;&#21644;&#30495;&#23454;&#29615;&#22659;&#20013;&#23637;&#31034;&#20102;&#20854;&#36866;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.10426</link><description>&lt;p&gt;
&#22810;&#23545;&#35937;&#22270;&#24418;&#21487;&#29992;&#24615;&#32593;&#32476;&#65306;&#36890;&#36807;&#22797;&#21512;&#23545;&#35937;&#21487;&#29992;&#24615;&#23454;&#29616;&#30446;&#26631;&#23548;&#21521;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Multi-Object Graph Affordance Network: Enabling Goal-Oriented Planning through Compound Object Affordances. (arXiv:2309.10426v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10426
&lt;/p&gt;
&lt;p&gt;
&#22810;&#23545;&#35937;&#22270;&#24418;&#21487;&#29992;&#24615;&#32593;&#32476;&#65288;MOGAN&#65289;&#27169;&#22411;&#21270;&#20102;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#65292;&#39044;&#27979;&#20102;&#23558;&#26032;&#23545;&#35937;&#25918;&#32622;&#22312;&#22797;&#21512;&#23545;&#35937;&#19978;&#30340;&#25928;&#26524;&#12290;&#22312;&#26500;&#24314;&#20855;&#26377;&#29305;&#23450;&#39640;&#24230;&#25110;&#23646;&#24615;&#30340;&#22612;&#31561;&#20219;&#21153;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#35268;&#21010;&#25214;&#21040;&#20855;&#26377;&#36866;&#24403;&#21487;&#29992;&#24615;&#30340;&#23545;&#35937;&#22534;&#21472;&#25805;&#20316;&#30340;&#24207;&#21015;&#12290;&#25105;&#20204;&#30340;&#31995;&#32479;&#33021;&#22815;&#27491;&#30830;&#24314;&#27169;&#38750;&#24120;&#22797;&#26434;&#30340;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#65292;&#24182;&#22312;&#27169;&#25311;&#21644;&#30495;&#23454;&#29615;&#22659;&#20013;&#23637;&#31034;&#20102;&#20854;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#26159;&#26426;&#22120;&#20154;&#23398;&#20064;&#39046;&#22495;&#30340;&#26377;&#25928;&#24037;&#20855;&#12290;&#34429;&#28982;&#25968;&#25454;&#39537;&#21160;&#30340;&#27169;&#22411;&#28145;&#20837;&#25506;&#35752;&#20102;&#21333;&#20010;&#25110;&#25104;&#23545;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#65292;&#20294;&#22312;&#35843;&#26597;&#30001;&#22797;&#26434;&#24418;&#29366;&#30340;&#20219;&#24847;&#25968;&#37327;&#30340;&#23545;&#35937;&#32452;&#25104;&#30340;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#26041;&#38754;&#23384;&#22312;&#26126;&#26174;&#24046;&#36317;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22810;&#23545;&#35937;&#22270;&#24418;&#21487;&#29992;&#24615;&#32593;&#32476;&#65288;MOGAN&#65289;&#65292;&#23427;&#24314;&#27169;&#20102;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#65292;&#24182;&#39044;&#27979;&#23558;&#26032;&#23545;&#35937;&#25918;&#32622;&#22312;&#29616;&#26377;&#22797;&#21512;&#23545;&#35937;&#19978;&#30340;&#25928;&#26524;&#12290;&#32473;&#23450;&#19981;&#21516;&#30340;&#20219;&#21153;&#65292;&#20363;&#22914;&#26500;&#24314;&#20855;&#26377;&#29305;&#23450;&#39640;&#24230;&#25110;&#23646;&#24615;&#30340;&#22612;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#35268;&#21010;&#25214;&#21040;&#20855;&#26377;&#36866;&#24403;&#21487;&#29992;&#24615;&#30340;&#23545;&#35937;&#22534;&#21472;&#25805;&#20316;&#30340;&#24207;&#21015;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#31995;&#32479;&#33021;&#22815;&#27491;&#30830;&#24314;&#27169;&#21253;&#25324;&#22534;&#21472;&#30340;&#29699;&#20307;&#21644;&#26479;&#23376;&#12289;&#26438;&#21644;&#21253;&#22260;&#26438;&#30340;&#29615;&#31561;&#38750;&#24120;&#22797;&#26434;&#30340;&#22797;&#21512;&#23545;&#35937;&#30340;&#21487;&#29992;&#24615;&#12290;&#25105;&#20204;&#22312;&#27169;&#25311;&#21644;&#30495;&#23454;&#29615;&#22659;&#20013;&#23637;&#31034;&#20102;&#25105;&#20204;&#31995;&#32479;&#30340;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Learning object affordances is an effective tool in the field of robot learning. While the data-driven models delve into the exploration of affordances of single or paired objects, there is a notable gap in the investigation of affordances of compound objects that are composed of an arbitrary number of objects with complex shapes. In this study, we propose Multi-Object Graph Affordance Network (MOGAN) that models compound object affordances and predicts the effect of placing new objects on top of the existing compound. Given different tasks, such as building towers of specific heights or properties, we used a search based planning to find the sequence of stack actions with the objects of suitable affordances. We showed that our system was able to correctly model the affordances of very complex compound objects that include stacked spheres and cups, poles, and rings that enclose the poles. We demonstrated the applicability of our system in both simulated and real-world environments, com
&lt;/p&gt;</description></item></channel></rss>