<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#23433;&#20840;&#38388;&#38548;RRT*&#65288;SI-RRT*&#65289;&#20004;&#32423;&#26041;&#27861;&#65292;&#20302;&#32423;&#37319;&#29992;&#37319;&#26679;&#35268;&#21010;&#22120;&#25214;&#21040;&#21333;&#20010;&#26426;&#22120;&#20154;&#30340;&#26080;&#30896;&#25758;&#36712;&#36857;&#65292;&#39640;&#32423;&#36890;&#36807;&#20248;&#20808;&#35268;&#21010;&#25110;&#22522;&#20110;&#20914;&#31361;&#30340;&#25628;&#32034;&#35299;&#20915;&#26426;&#22120;&#20154;&#38388;&#20914;&#31361;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;SI-RRT*&#33021;&#22815;&#24555;&#36895;&#25214;&#21040;&#39640;&#36136;&#37327;&#35299;&#20915;&#26041;&#26696;</title><link>https://arxiv.org/abs/2404.01752</link><description>&lt;p&gt;
&#23433;&#20840;&#38388;&#38548;RRT*&#29992;&#20110;&#36830;&#32493;&#31354;&#38388;&#20013;&#21487;&#25193;&#23637;&#30340;&#22810;&#26426;&#22120;&#20154;&#36335;&#24452;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Safe Interval RRT* for Scalable Multi-Robot Path Planning in Continuous Space
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01752
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#23433;&#20840;&#38388;&#38548;RRT*&#65288;SI-RRT*&#65289;&#20004;&#32423;&#26041;&#27861;&#65292;&#20302;&#32423;&#37319;&#29992;&#37319;&#26679;&#35268;&#21010;&#22120;&#25214;&#21040;&#21333;&#20010;&#26426;&#22120;&#20154;&#30340;&#26080;&#30896;&#25758;&#36712;&#36857;&#65292;&#39640;&#32423;&#36890;&#36807;&#20248;&#20808;&#35268;&#21010;&#25110;&#22522;&#20110;&#20914;&#31361;&#30340;&#25628;&#32034;&#35299;&#20915;&#26426;&#22120;&#20154;&#38388;&#20914;&#31361;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;SI-RRT*&#33021;&#22815;&#24555;&#36895;&#25214;&#21040;&#39640;&#36136;&#37327;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#36830;&#32493;&#31354;&#38388;&#20013;&#35299;&#20915;&#22810;&#26426;&#22120;&#20154;&#36335;&#24452;&#35268;&#21010;&#65288;MRPP&#65289;&#38382;&#39064;&#20197;&#25214;&#21040;&#26080;&#20914;&#31361;&#36335;&#24452;&#30340;&#38382;&#39064;&#12290;&#38382;&#39064;&#30340;&#22256;&#38590;&#20027;&#35201;&#26469;&#33258;&#20004;&#20010;&#22240;&#32032;&#12290;&#39318;&#20808;&#65292;&#28041;&#21450;&#22810;&#20010;&#26426;&#22120;&#20154;&#20250;&#23548;&#33268;&#32452;&#21512;&#20915;&#31574;&#65292;&#20351;&#25628;&#32034;&#31354;&#38388;&#21576;&#25351;&#25968;&#32423;&#22686;&#38271;&#12290;&#20854;&#27425;&#65292;&#36830;&#32493;&#31354;&#38388;&#21576;&#29616;&#20986;&#28508;&#22312;&#26080;&#38480;&#30340;&#29366;&#24577;&#21644;&#21160;&#20316;&#12290;&#38024;&#23545;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#32423;&#26041;&#27861;&#65292;&#20302;&#32423;&#26159;&#22522;&#20110;&#37319;&#26679;&#30340;&#35268;&#21010;&#22120;&#23433;&#20840;&#38388;&#38548;RRT*&#65288;SI-RRT*&#65289;&#65292;&#29992;&#20110;&#25214;&#21040;&#21333;&#20010;&#26426;&#22120;&#20154;&#30340;&#26080;&#30896;&#25758;&#36712;&#36857;&#12290;&#39640;&#32423;&#21487;&#20197;&#20351;&#29992;&#33021;&#22815;&#35299;&#20915;&#26426;&#22120;&#20154;&#38388;&#20914;&#31361;&#30340;&#20219;&#20309;&#26041;&#27861;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#20004;&#31181;&#20195;&#34920;&#24615;&#26041;&#27861;&#65292;&#21363;&#20248;&#20808;&#35268;&#21010;&#65288;SI-CPP&#65289;&#21644;&#22522;&#20110;&#20914;&#31361;&#30340;&#25628;&#32034;&#65288;SI-CCBS&#65289;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;SI-RRT*&#33021;&#22815;&#24555;&#36895;&#25214;&#21040;&#39640;&#36136;&#37327;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#19988;&#25152;&#38656;&#30340;&#26679;&#26412;&#25968;&#37327;&#36739;&#23569;&#12290;SI-CPP&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#32780;SI-CCBS&#20135;&#29983;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01752v1 Announce Type: cross  Abstract: In this paper, we consider the problem of Multi-Robot Path Planning (MRPP) in continuous space to find conflict-free paths. The difficulty of the problem arises from two primary factors. First, the involvement of multiple robots leads to combinatorial decision-making, which escalates the search space exponentially. Second, the continuous space presents potentially infinite states and actions. For this problem, we propose a two-level approach where the low level is a sampling-based planner Safe Interval RRT* (SI-RRT*) that finds a collision-free trajectory for individual robots. The high level can use any method that can resolve inter-robot conflicts where we employ two representative methods that are Prioritized Planning (SI-CPP) and Conflict Based Search (SI-CCBS). Experimental results show that SI-RRT* can find a high-quality solution quickly with a small number of samples. SI-CPP exhibits improved scalability while SI-CCBS produces 
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#24187;&#35273;&#26816;&#27979;&#26088;&#22312;&#22635;&#34917;&#29616;&#26377;&#35268;&#21010;&#32773;&#32570;&#23569;&#30340;&#24120;&#35782;&#25512;&#29702;&#65292;&#20197;&#36866;&#29992;&#20110;&#36229;&#20986;&#20998;&#24067;&#20219;&#21153;&#30340;&#22330;&#26223;&#12290;</title><link>https://arxiv.org/abs/2403.16527</link><description>&lt;p&gt;
&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#24187;&#35273;&#26816;&#27979;&#65306;&#28789;&#27963;&#23450;&#20041;&#19982;&#29616;&#26377;&#25216;&#26415;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Hallucination Detection in Foundation Models for Decision-Making: A Flexible Definition and Review of the State of the Art
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16527
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#24187;&#35273;&#26816;&#27979;&#26088;&#22312;&#22635;&#34917;&#29616;&#26377;&#35268;&#21010;&#32773;&#32570;&#23569;&#30340;&#24120;&#35782;&#25512;&#29702;&#65292;&#20197;&#36866;&#29992;&#20110;&#36229;&#20986;&#20998;&#24067;&#20219;&#21153;&#30340;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20027;&#31995;&#32479;&#21363;&#23558;&#26080;&#22788;&#19981;&#22312;&#65292;&#20174;&#21046;&#36896;&#19994;&#30340;&#33258;&#20027;&#24615;&#21040;&#20892;&#19994;&#39046;&#22495;&#30340;&#26426;&#22120;&#20154;&#65292;&#20174;&#21307;&#30103;&#21161;&#29702;&#21040;&#23089;&#20048;&#20135;&#19994;&#12290;&#22823;&#22810;&#25968;&#31995;&#32479;&#26159;&#36890;&#36807;&#27169;&#22359;&#21270;&#30340;&#23376;&#32452;&#20214;&#24320;&#21457;&#30340;&#65292;&#29992;&#20110;&#20915;&#31574;&#12289;&#35268;&#21010;&#21644;&#25511;&#21046;&#65292;&#36825;&#20123;&#32452;&#20214;&#21487;&#33021;&#26159;&#25163;&#24037;&#35774;&#35745;&#30340;&#65292;&#20063;&#21487;&#33021;&#26159;&#22522;&#20110;&#23398;&#20064;&#30340;&#12290;&#34429;&#28982;&#29616;&#26377;&#26041;&#27861;&#22312;&#23427;&#20204;&#19987;&#38376;&#35774;&#35745;&#30340;&#24773;&#22659;&#19979;&#34920;&#29616;&#33391;&#22909;&#65292;&#20294;&#22312;&#27979;&#35797;&#26102;&#19981;&#21487;&#36991;&#20813;&#22320;&#20250;&#22312;&#32597;&#35265;&#30340;&#12289;&#36229;&#20986;&#20998;&#24067;&#33539;&#22260;&#30340;&#22330;&#26223;&#19979;&#34920;&#29616;&#29305;&#21035;&#24046;&#12290;&#22522;&#20110;&#22810;&#20010;&#20219;&#21153;&#35757;&#32451;&#30340;&#22522;&#30784;&#27169;&#22411;&#30340;&#20852;&#36215;&#65292;&#20197;&#21450;&#20174;&#21508;&#20010;&#39046;&#22495;&#37319;&#38598;&#30340;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#22823;&#22411;&#25968;&#25454;&#38598;&#65292;&#20351;&#30740;&#31350;&#20154;&#21592;&#30456;&#20449;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#25552;&#20379;&#29616;&#26377;&#35268;&#21010;&#32773;&#25152;&#32570;&#20047;&#30340;&#24120;&#35782;&#25512;&#29702;&#12290;&#30740;&#31350;&#20154;&#21592;&#35748;&#20026;&#65292;&#36825;&#31181;&#24120;&#35782;&#25512;&#29702;&#23558;&#24357;&#21512;&#31639;&#27861;&#24320;&#21457;&#21644;&#37096;&#32626;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#36866;&#29992;&#20110;&#36229;&#20986;&#20998;&#24067;&#20219;&#21153;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16527v1 Announce Type: new  Abstract: Autonomous systems are soon to be ubiquitous, from manufacturing autonomy to agricultural field robots, and from health care assistants to the entertainment industry. The majority of these systems are developed with modular sub-components for decision-making, planning, and control that may be hand-engineered or learning-based. While these existing approaches have been shown to perform well under the situations they were specifically designed for, they can perform especially poorly in rare, out-of-distribution scenarios that will undoubtedly arise at test-time. The rise of foundation models trained on multiple tasks with impressively large datasets from a variety of fields has led researchers to believe that these models may provide common sense reasoning that existing planners are missing. Researchers posit that this common sense reasoning will bridge the gap between algorithm development and deployment to out-of-distribution tasks, like
&lt;/p&gt;</description></item><item><title>NeuPAN &#26159;&#19968;&#31181;&#23454;&#26102;&#12289;&#39640;&#24230;&#20934;&#30830;&#12289;&#26080;&#22320;&#22270;&#12289;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#19988;&#23545;&#29615;&#22659;&#19981;&#21464;&#30340;&#26426;&#22120;&#20154;&#23548;&#33322;&#35299;&#20915;&#26041;&#26696;&#65292;&#26368;&#22823;&#30340;&#21019;&#26032;&#22312;&#20110;&#23558;&#21407;&#22987;&#28857;&#30452;&#25509;&#26144;&#23556;&#21040;&#23398;&#20064;&#21040;&#30340;&#22810;&#24103;&#36317;&#31163;&#31354;&#38388;&#65292;&#24182;&#20855;&#26377;&#31471;&#21040;&#31471;&#27169;&#22411;&#23398;&#20064;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#21487;&#35777;&#26126;&#30340;&#25910;&#25947;&#12290;</title><link>https://arxiv.org/abs/2403.06828</link><description>&lt;p&gt;
NeuPAN:&#30452;&#25509;&#28857;&#26426;&#22120;&#20154;&#23548;&#33322;&#30340;&#31471;&#21040;&#31471;&#22522;&#20110;&#27169;&#22411;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
NeuPAN: Direct Point Robot Navigation with End-to-End Model-based Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06828
&lt;/p&gt;
&lt;p&gt;
NeuPAN &#26159;&#19968;&#31181;&#23454;&#26102;&#12289;&#39640;&#24230;&#20934;&#30830;&#12289;&#26080;&#22320;&#22270;&#12289;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#19988;&#23545;&#29615;&#22659;&#19981;&#21464;&#30340;&#26426;&#22120;&#20154;&#23548;&#33322;&#35299;&#20915;&#26041;&#26696;&#65292;&#26368;&#22823;&#30340;&#21019;&#26032;&#22312;&#20110;&#23558;&#21407;&#22987;&#28857;&#30452;&#25509;&#26144;&#23556;&#21040;&#23398;&#20064;&#21040;&#30340;&#22810;&#24103;&#36317;&#31163;&#31354;&#38388;&#65292;&#24182;&#20855;&#26377;&#31471;&#21040;&#31471;&#27169;&#22411;&#23398;&#20064;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#21487;&#35777;&#26126;&#30340;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25317;&#25380;&#29615;&#22659;&#20013;&#23545;&#38750;&#20840;&#21521;&#26426;&#22120;&#20154;&#36827;&#34892;&#23548;&#33322;&#38656;&#35201;&#26497;&#20854;&#31934;&#30830;&#30340;&#24863;&#30693;&#21644;&#36816;&#21160;&#20197;&#36991;&#20813;&#30896;&#25758;&#12290;&#26412;&#25991;&#25552;&#20986;NeuPAN&#65306;&#19968;&#31181;&#23454;&#26102;&#12289;&#39640;&#24230;&#20934;&#30830;&#12289;&#26080;&#22320;&#22270;&#12289;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#65292;&#19988;&#23545;&#29615;&#22659;&#19981;&#21464;&#30340;&#26426;&#22120;&#20154;&#23548;&#33322;&#35299;&#20915;&#26041;&#26696;&#12290;NeuPAN&#37319;&#29992;&#32039;&#32806;&#21512;&#30340;&#24863;&#30693;-&#36816;&#21160;&#26694;&#26550;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#26377;&#20004;&#20010;&#20851;&#38190;&#21019;&#26032;&#65306;1&#65289;&#23427;&#30452;&#25509;&#23558;&#21407;&#22987;&#28857;&#26144;&#23556;&#21040;&#23398;&#20064;&#21040;&#30340;&#22810;&#24103;&#36317;&#31163;&#31354;&#38388;&#65292;&#36991;&#20813;&#20102;&#20174;&#24863;&#30693;&#21040;&#25511;&#21046;&#30340;&#35823;&#24046;&#20256;&#25773;&#65307;2&#65289;&#20174;&#31471;&#21040;&#31471;&#22522;&#20110;&#27169;&#22411;&#23398;&#20064;&#30340;&#35282;&#24230;&#36827;&#34892;&#35299;&#37322;&#65292;&#23454;&#29616;&#20102;&#21487;&#35777;&#26126;&#30340;&#25910;&#25947;&#12290;NeuPAN&#30340;&#20851;&#38190;&#22312;&#20110;&#21033;&#29992;&#25554;&#25300;&#24335;&#65288;PnP&#65289;&#20132;&#26367;&#26368;&#23567;&#21270;&#20256;&#24863;&#22120;&#65288;PAN&#65289;&#32593;&#32476;&#35299;&#39640;&#32500;&#31471;&#21040;&#31471;&#25968;&#23398;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#21547;&#21508;&#31181;&#28857;&#32423;&#32422;&#26463;&#65292;&#20351;NeuPAN&#33021;&#22815;&#30452;&#25509;&#29983;&#25104;&#23454;&#26102;&#12289;&#31471;&#21040;&#31471;&#12289;&#29289;&#29702;&#21487;&#35299;&#37322;&#30340;&#36816;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06828v1 Announce Type: cross  Abstract: Navigating a nonholonomic robot in a cluttered environment requires extremely accurate perception and locomotion for collision avoidance. This paper presents NeuPAN: a real-time, highly-accurate, map-free, robot-agnostic, and environment-invariant robot navigation solution. Leveraging a tightly-coupled perception-locomotion framework, NeuPAN has two key innovations compared to existing approaches: 1) it directly maps raw points to a learned multi-frame distance space, avoiding error propagation from perception to control; 2) it is interpretable from an end-to-end model-based learning perspective, enabling provable convergence. The crux of NeuPAN is to solve a high-dimensional end-to-end mathematical model with various point-level constraints using the plug-and-play (PnP) proximal alternating-minimization network (PAN) with neurons in the loop. This allows NeuPAN to generate real-time, end-to-end, physically-interpretable motions direct
&lt;/p&gt;</description></item></channel></rss>