<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#23454;&#29616;&#24322;&#27493;&#24863;&#30693;-&#21160;&#20316;-&#36890;&#20449;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#22312;&#22823;&#22411;&#26426;&#22120;&#20154;&#32676;&#20307;&#20013;&#21327;&#20316;&#21644;&#36890;&#20449;&#30340;&#25361;&#25112;&#12290;&#29616;&#26377;&#30340;&#26694;&#26550;&#20551;&#35774;&#39034;&#24207;&#25191;&#34892;&#65292;&#35813;&#26041;&#27861;&#26159;&#23436;&#20840;&#20998;&#25955;&#30340;&#65292;&#20294;&#22312;&#35780;&#20272;&#21644;&#37096;&#32626;&#26041;&#38754;&#20173;&#23384;&#22312;&#19968;&#20123;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2309.10164</link><description>&lt;p&gt;
&#24322;&#27493;&#24863;&#30693;-&#21160;&#20316;-&#36890;&#20449;&#19982;&#22270;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Asynchronous Perception-Action-Communication with Graph Neural Networks. (arXiv:2309.10164v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10164
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#23454;&#29616;&#24322;&#27493;&#24863;&#30693;-&#21160;&#20316;-&#36890;&#20449;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#22312;&#22823;&#22411;&#26426;&#22120;&#20154;&#32676;&#20307;&#20013;&#21327;&#20316;&#21644;&#36890;&#20449;&#30340;&#25361;&#25112;&#12290;&#29616;&#26377;&#30340;&#26694;&#26550;&#20551;&#35774;&#39034;&#24207;&#25191;&#34892;&#65292;&#35813;&#26041;&#27861;&#26159;&#23436;&#20840;&#20998;&#25955;&#30340;&#65292;&#20294;&#22312;&#35780;&#20272;&#21644;&#37096;&#32626;&#26041;&#38754;&#20173;&#23384;&#22312;&#19968;&#20123;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#22411;&#26426;&#22120;&#20154;&#32676;&#20307;&#20013;&#23454;&#29616;&#20849;&#21516;&#30340;&#20840;&#23616;&#30446;&#26631;&#30340;&#21327;&#20316;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#65292;&#22240;&#20026;&#26426;&#22120;&#20154;&#30340;&#24863;&#30693;&#21644;&#36890;&#20449;&#33021;&#21147;&#26377;&#38480;&#12290;&#26426;&#22120;&#20154;&#24517;&#39035;&#25191;&#34892;&#24863;&#30693;-&#21160;&#20316;-&#36890;&#20449;&#65288;PAC&#65289;&#24490;&#29615;-&#23427;&#20204;&#24863;&#30693;&#23616;&#37096;&#29615;&#22659;&#65292;&#19982;&#20854;&#20182;&#26426;&#22120;&#20154;&#36890;&#20449;&#65292;&#24182;&#23454;&#26102;&#37319;&#21462;&#34892;&#21160;&#12290;&#20998;&#25955;&#30340;PAC&#31995;&#32479;&#38754;&#20020;&#30340;&#19968;&#20010;&#22522;&#26412;&#25361;&#25112;&#26159;&#20915;&#23450;&#19982;&#30456;&#37051;&#26426;&#22120;&#20154;&#36890;&#20449;&#30340;&#20449;&#24687;&#20197;&#21450;&#22914;&#20309;&#22312;&#21033;&#29992;&#37051;&#23621;&#20849;&#20139;&#30340;&#20449;&#24687;&#30340;&#21516;&#26102;&#37319;&#21462;&#34892;&#21160;&#12290;&#26368;&#36817;&#65292;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#24050;&#32463;&#21462;&#24471;&#20102;&#19968;&#20123;&#36827;&#23637;&#65292;&#27604;&#22914;&#22312;&#32676;&#38598;&#21644;&#35206;&#30422;&#25511;&#21046;&#31561;&#24212;&#29992;&#20013;&#12290;&#34429;&#28982;&#22312;&#27010;&#24565;&#19978;&#65292;GNN&#31574;&#30053;&#26159;&#23436;&#20840;&#20998;&#25955;&#30340;&#65292;&#20294;&#35780;&#20272;&#21644;&#37096;&#32626;&#36825;&#26679;&#30340;&#31574;&#30053;&#20027;&#35201;&#20173;&#28982;&#26159;&#38598;&#20013;&#24335;&#30340;&#25110;&#20855;&#26377;&#38480;&#21046;&#24615;&#30340;&#20998;&#25955;&#24335;&#12290;&#27492;&#22806;&#65292;&#29616;&#26377;&#30340;&#26694;&#26550;&#20551;&#35774;&#24863;&#30693;&#21644;&#21160;&#20316;&#25512;&#29702;&#30340;&#39034;&#24207;&#25191;&#34892;&#65292;&#36825;&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#24212;&#29992;&#20013;&#38750;&#24120;&#38480;&#21046;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Collaboration in large robot swarms to achieve a common global objective is a challenging problem in large environments due to limited sensing and communication capabilities. The robots must execute a Perception-Action-Communication (PAC) loop -- they perceive their local environment, communicate with other robots, and take actions in real time. A fundamental challenge in decentralized PAC systems is to decide what information to communicate with the neighboring robots and how to take actions while utilizing the information shared by the neighbors. Recently, this has been addressed using Graph Neural Networks (GNNs) for applications such as flocking and coverage control. Although conceptually, GNN policies are fully decentralized, the evaluation and deployment of such policies have primarily remained centralized or restrictively decentralized. Furthermore, existing frameworks assume sequential execution of perception and action inference, which is very restrictive in real-world applica
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21033;&#29992;&#23545;&#31216;&#29615;&#22659;&#20013;&#30340;&#19987;&#23478;&#28436;&#31034;&#26469;&#36827;&#34892;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#31574;&#30053;&#35757;&#32451;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#23398;&#20064;&#25928;&#29575;&#21644;&#26679;&#26412;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2304.06055</link><description>&lt;p&gt;
&#21033;&#29992;&#23545;&#31216;&#24615;&#21644;&#21551;&#21457;&#24335;&#28436;&#31034;&#26469;&#36827;&#34892;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Exploiting Symmetry and Heuristic Demonstrations in Off-policy Reinforcement Learning for Robotic Manipulation. (arXiv:2304.06055v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06055
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21033;&#29992;&#23545;&#31216;&#29615;&#22659;&#20013;&#30340;&#19987;&#23478;&#28436;&#31034;&#26469;&#36827;&#34892;&#26426;&#22120;&#20154;&#25805;&#20316;&#30340;&#31574;&#30053;&#35757;&#32451;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#23398;&#20064;&#25928;&#29575;&#21644;&#26679;&#26412;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#22312;&#35768;&#22810;&#39046;&#22495;&#20013;&#33258;&#21160;&#26500;&#24314;&#25511;&#21046;&#31574;&#30053;&#20855;&#26377;&#26174;&#33879;&#28508;&#21147;&#65292;&#20294;&#22312;&#24212;&#29992;&#20110;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#26102;&#30001;&#20110;&#32500;&#24230;&#30340;&#38382;&#39064;&#65292;&#25928;&#29575;&#36739;&#20302;&#12290;&#20026;&#20102;&#20419;&#36827;&#36825;&#20123;&#20219;&#21153;&#30340;&#23398;&#20064;&#65292;&#20808;&#21069;&#30340;&#30693;&#35782;&#25110;&#21551;&#21457;&#24335;&#26041;&#27861;&#21487;&#20197;&#26377;&#25928;&#22320;&#25552;&#39640;&#23398;&#20064;&#24615;&#33021;&#12290;&#26412;&#25991;&#26088;&#22312;&#23450;&#20041;&#21644;&#32467;&#21512;&#29289;&#29702;&#26426;&#22120;&#29615;&#22659;&#20013;&#23384;&#22312;&#30340;&#33258;&#28982;&#23545;&#31216;&#24615;&#65292;&#21033;&#29992;&#23545;&#31216;&#29615;&#22659;&#20013;&#30340;&#19987;&#23478;&#28436;&#31034;&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#21644;&#34892;&#20026;&#20811;&#38534;&#30340;&#34701;&#21512;&#26469;&#35757;&#32451;&#20855;&#26377;&#39640;&#26679;&#26412;&#25928;&#29575;&#30340;&#31574;&#30053;&#65292;&#20174;&#32780;&#32473;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#36807;&#31243;&#25552;&#20379;&#22810;&#26679;&#21270;&#32780;&#32039;&#20945;&#30340;&#21551;&#21160;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26368;&#36817;&#27010;&#24565;&#30340;&#20005;&#26684;&#26694;&#26550;&#65292;&#24182;&#25506;&#32034;&#20102;&#23427;&#22312;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#20013;&#30340;&#33539;&#22260;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#36827;&#34892;&#20004;&#20010;&#28857;&#23545;&#28857;&#30340;&#24037;&#19994;&#33218;&#21040;&#36798;&#20219;&#21153;&#65288;&#26377;&#38556;&#30861;&#21644;&#26080;&#38556;&#30861;&#65289;&#30340;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reinforcement learning demonstrates significant potential in automatically building control policies in numerous domains, but shows low efficiency when applied to robot manipulation tasks due to the curse of dimensionality. To facilitate the learning of such tasks, prior knowledge or heuristics that incorporate inherent simplification can effectively improve the learning performance. This paper aims to define and incorporate the natural symmetry present in physical robotic environments. Then, sample-efficient policies are trained by exploiting the expert demonstrations in symmetrical environments through an amalgamation of reinforcement and behavior cloning, which gives the off-policy learning process a diverse yet compact initiation. Furthermore, it presents a rigorous framework for a recent concept and explores its scope for robot manipulation tasks. The proposed method is validated via two point-to-point reaching tasks of an industrial arm, with and without an obstacle, in a simulat
&lt;/p&gt;</description></item></channel></rss>