<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#21551;&#29992;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#26500;&#24314;&#26412;&#22320;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65292;&#20197;&#20445;&#35777;&#24191;&#27867;&#31867;&#21035;&#30340;&#38750;&#32447;&#24615;&#28151;&#21512;&#21160;&#21147;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#35813;&#26041;&#27861;&#26159;&#39640;&#25928;&#30340;&#65292;&#23545;&#21442;&#32771;&#25511;&#21046;&#22120;&#30340;&#24178;&#39044;&#26368;&#23567;&#65292;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#21644;&#27604;&#36739;&#26696;&#20363;&#23637;&#31034;&#20102;&#20854;&#21151;&#25928;&#21644;&#28789;&#27963;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.14907</link><description>&lt;p&gt;
&#23398;&#20064;&#26412;&#22320;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#20197;&#23454;&#29616;&#28151;&#21512;&#31995;&#32479;&#30340;&#23433;&#20840;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Learning Local Control Barrier Functions for Safety Control of Hybrid Systems. (arXiv:2401.14907v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14907
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#21551;&#29992;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#26500;&#24314;&#26412;&#22320;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65292;&#20197;&#20445;&#35777;&#24191;&#27867;&#31867;&#21035;&#30340;&#38750;&#32447;&#24615;&#28151;&#21512;&#21160;&#21147;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#35813;&#26041;&#27861;&#26159;&#39640;&#25928;&#30340;&#65292;&#23545;&#21442;&#32771;&#25511;&#21046;&#22120;&#30340;&#24178;&#39044;&#26368;&#23567;&#65292;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#21644;&#27604;&#36739;&#26696;&#20363;&#23637;&#31034;&#20102;&#20854;&#21151;&#25928;&#21644;&#28789;&#27963;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28151;&#21512;&#21160;&#21147;&#31995;&#32479;&#22312;&#23454;&#38469;&#30340;&#26426;&#22120;&#20154;&#24212;&#29992;&#20013;&#26222;&#36941;&#23384;&#22312;&#65292;&#24120;&#28041;&#21450;&#36830;&#32493;&#29366;&#24577;&#21644;&#31163;&#25955;&#29366;&#24577;&#20999;&#25442;&#12290;&#23433;&#20840;&#24615;&#26159;&#28151;&#21512;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#39318;&#35201;&#20851;&#27880;&#28857;&#12290;&#29616;&#26377;&#30340;&#28151;&#21512;&#31995;&#32479;&#30340;&#23433;&#20840;&#20851;&#38190;&#25511;&#21046;&#26041;&#27861;&#35201;&#20040;&#35745;&#31639;&#25928;&#29575;&#20302;&#19979;&#65292;&#23545;&#31995;&#32479;&#24615;&#33021;&#26377;&#25439;&#65292;&#35201;&#20040;&#20165;&#36866;&#29992;&#20110;&#23567;&#35268;&#27169;&#31995;&#32479;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#21551;&#29992;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#26500;&#24314;&#26412;&#22320;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65288;CBFs&#65289;&#65292;&#20197;&#20445;&#35777;&#24191;&#27867;&#31867;&#21035;&#30340;&#38750;&#32447;&#24615;&#28151;&#21512;&#21160;&#21147;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19968;&#20010;&#23433;&#20840;&#30340;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;CBF&#20999;&#25442;&#25511;&#21046;&#22120;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#35745;&#31639;&#19978;&#39640;&#25928;&#65292;&#23545;&#20219;&#20309;&#21442;&#32771;&#25511;&#21046;&#22120;&#30340;&#24178;&#39044;&#26368;&#23567;&#65292;&#24182;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#31995;&#32479;&#12290;&#36890;&#36807;&#20004;&#20010;&#26426;&#22120;&#20154;&#31034;&#20363;&#65288;&#21253;&#25324;&#39640;&#32500;&#33258;&#20027;&#36187;&#36710;&#26696;&#20363;&#65289;&#65292;&#25105;&#20204;&#23545;&#25105;&#20204;&#30340;&#26694;&#26550;&#36827;&#34892;&#20102;&#23454;&#35777;&#35780;&#20272;&#65292;&#24182;&#19982;&#20854;&#20182;&#22522;&#20110;CBF&#30340;&#26041;&#27861;&#21644;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#23637;&#31034;&#20102;&#20854;&#21151;&#25928;&#21644;&#28789;&#27963;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hybrid dynamical systems are ubiquitous as practical robotic applications often involve both continuous states and discrete switchings. Safety is a primary concern for hybrid robotic systems. Existing safety-critical control approaches for hybrid systems are either computationally inefficient, detrimental to system performance, or limited to small-scale systems. To amend these drawbacks, in this paper, we propose a learningenabled approach to construct local Control Barrier Functions (CBFs) to guarantee the safety of a wide class of nonlinear hybrid dynamical systems. The end result is a safe neural CBFbased switching controller. Our approach is computationally efficient, minimally invasive to any reference controller, and applicable to large-scale systems. We empirically evaluate our framework and demonstrate its efficacy and flexibility through two robotic examples including a high-dimensional autonomous racing case, against other CBF-based approaches and model predictive control.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#29983;&#25104;&#22522;&#20110;&#21160;&#24577;&#31995;&#32479;&#36335;&#24452;&#35268;&#21010;&#22120;&#21644;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30456;&#32467;&#21512;&#30340;&#31639;&#27861;&#65292;&#20197;&#20811;&#26381;&#28151;&#27788;&#35206;&#30422;&#36335;&#24452;&#35268;&#21010;&#22120;&#30340;&#31435;&#21363;&#38382;&#39064;&#65292;&#24182;&#22312;&#27169;&#25311;&#21644;&#23454;&#38469;&#29615;&#22659;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#23637;&#31034;&#20854;&#22312;&#26377;&#38480;&#29615;&#22659;&#20013;&#23454;&#29616;&#33258;&#20027;&#25628;&#32034;&#21644;&#35206;&#30422;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2305.01834</link><description>&lt;p&gt;
&#22522;&#20110;&#21160;&#24577;&#31995;&#32479;&#36335;&#24452;&#35268;&#21010;&#21644;&#26080;&#30417;&#30563;&#23398;&#20064;&#30340;&#23454;&#26102;&#29615;&#22659;&#33258;&#20027;&#25628;&#32034;
&lt;/p&gt;
&lt;p&gt;
Autonomous search of real-life environments combining dynamical system-based path planning and unsupervised learning. (arXiv:2305.01834v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01834
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#29983;&#25104;&#22522;&#20110;&#21160;&#24577;&#31995;&#32479;&#36335;&#24452;&#35268;&#21010;&#22120;&#21644;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30456;&#32467;&#21512;&#30340;&#31639;&#27861;&#65292;&#20197;&#20811;&#26381;&#28151;&#27788;&#35206;&#30422;&#36335;&#24452;&#35268;&#21010;&#22120;&#30340;&#31435;&#21363;&#38382;&#39064;&#65292;&#24182;&#22312;&#27169;&#25311;&#21644;&#23454;&#38469;&#29615;&#22659;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#65292;&#23637;&#31034;&#20854;&#22312;&#26377;&#38480;&#29615;&#22659;&#20013;&#23454;&#29616;&#33258;&#20027;&#25628;&#32034;&#21644;&#35206;&#30422;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#21462;&#24471;&#20102;&#20351;&#29992;&#28151;&#27788;&#35206;&#30422;&#36335;&#24452;&#35268;&#21010;&#22120;&#36827;&#34892;&#26377;&#38480;&#29615;&#22659;&#25628;&#32034;&#21644;&#36941;&#21382;&#30340;&#36827;&#23637;&#65292;&#20294;&#35813;&#39046;&#22495;&#30340;&#29616;&#29366;&#20173;&#22788;&#20110;&#21021;&#32423;&#38454;&#27573;&#65292;&#30446;&#21069;&#30340;&#23454;&#39564;&#24037;&#20316;&#23578;&#26410;&#24320;&#21457;&#20986;&#21487;&#28385;&#36275;&#28151;&#27788;&#35206;&#30422;&#36335;&#24452;&#35268;&#21010;&#22120;&#38656;&#35201;&#20811;&#26381;&#30340;&#31435;&#21363;&#38382;&#39064;&#30340;&#24378;&#22823;&#26041;&#27861; &#12290;&#26412;&#25991;&#26088;&#22312;&#25552;&#20986;&#19968;&#31181;&#33258;&#21160;&#29983;&#25104;&#22522;&#20110;&#21160;&#24577;&#31995;&#32479;&#36335;&#24452;&#35268;&#21010;&#22120;&#21644;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30456;&#32467;&#21512;&#30340;&#31639;&#27861;&#65292;&#20197;&#20811;&#26381;&#28151;&#27788;&#35206;&#30422;&#36335;&#24452;&#35268;&#21010;&#22120;&#30340;&#31435;&#21363;&#38382;&#39064;&#65292;&#24182;&#22312;&#27169;&#25311;&#21644;&#23454;&#38469;&#29615;&#22659;&#20013;&#36827;&#34892;&#27979;&#35797;&#65292;&#23637;&#31034;&#20854;&#22312;&#26377;&#38480;&#29615;&#22659;&#20013;&#23454;&#29616;&#33258;&#20027;&#25628;&#32034;&#21644;&#35206;&#30422;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, advancements have been made towards the goal of using chaotic coverage path planners for autonomous search and traversal of spaces with limited environmental cues. However, the state of this field is still in its infancy as there has been little experimental work done. Current experimental work has not developed robust methods to satisfactorily address the immediate set of problems a chaotic coverage path planner needs to overcome in order to scan realistic environments within reasonable coverage times. These immediate problems are as follows: (1) an obstacle avoidance technique which generally maintains the kinematic efficiency of the robot's motion, (2) a means to spread chaotic trajectories across the environment (especially crucial for large and/or complex-shaped environments) that need to be covered, and (3) a real-time coverage calculation technique that is accurate and independent of cell size. This paper aims to progress the field by proposing algorithms that a
&lt;/p&gt;</description></item></channel></rss>