<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23618;&#32423;&#26550;&#26500;&#65292;&#36890;&#36807;&#20351;&#29992;&#23545;&#20598;&#20132;&#20114;&#39044;&#27979;&#21644;&#31934;&#31616;&#30340;MPC&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#21487;&#25193;&#23637;&#30340;&#23454;&#26102;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#65292;&#22312;&#22797;&#26434;&#30340;&#22810;&#27169;&#24577;&#20132;&#36890;&#22330;&#26223;&#20013;&#23637;&#31034;&#20102;12&#20493;&#30340;&#36895;&#24230;&#25552;&#21319;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01116</link><description>&lt;p&gt;
&#21487;&#25193;&#23637;&#22810;&#27169;&#22411;MPC&#30340;&#22522;&#20110;&#23545;&#20598;&#20132;&#20114;&#39044;&#27979;&#30340;&#23618;&#32423;&#26550;&#26500;
&lt;/p&gt;
&lt;p&gt;
Scalable Multi-modal Model Predictive Control via Duality-based Interaction Predictions
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01116
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23618;&#32423;&#26550;&#26500;&#65292;&#36890;&#36807;&#20351;&#29992;&#23545;&#20598;&#20132;&#20114;&#39044;&#27979;&#21644;&#31934;&#31616;&#30340;MPC&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#21487;&#25193;&#23637;&#30340;&#23454;&#26102;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#65292;&#22312;&#22797;&#26434;&#30340;&#22810;&#27169;&#24577;&#20132;&#36890;&#22330;&#26223;&#20013;&#23637;&#31034;&#20102;12&#20493;&#30340;&#36895;&#24230;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23618;&#32423;&#26550;&#26500;&#65292;&#29992;&#20110;&#22312;&#22797;&#26434;&#30340;&#22810;&#27169;&#24577;&#20132;&#36890;&#22330;&#26223;&#20013;&#23454;&#29616;&#21487;&#25193;&#23637;&#30340;&#23454;&#26102;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(MPC)&#12290;&#35813;&#26550;&#26500;&#30001;&#20004;&#20010;&#20851;&#38190;&#32452;&#20214;&#32452;&#25104;&#65306;1) RAID-Net&#65292;&#19968;&#31181;&#22522;&#20110;&#27880;&#24847;&#21147;&#26426;&#21046;&#30340;&#26032;&#39062;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65292;&#20351;&#29992;&#25289;&#26684;&#26391;&#26085;&#23545;&#20598;&#24615;&#39044;&#27979;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#19982;&#21608;&#22260;&#36710;&#36742;&#20043;&#38388;&#22312;MPC&#39044;&#27979;&#33539;&#22260;&#20869;&#30340;&#30456;&#20851;&#20132;&#20114;&#65307;2) &#19968;&#20010;&#31616;&#21270;&#30340;&#38543;&#26426;MPC&#38382;&#39064;&#65292;&#28040;&#38500;&#19981;&#30456;&#20851;&#30340;&#36991;&#30896;&#32422;&#26463;&#65292;&#25552;&#39640;&#35745;&#31639;&#25928;&#29575;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#19968;&#20010;&#27169;&#25311;&#20132;&#36890;&#36335;&#21475;&#20013;&#28436;&#31034;&#65292;&#23637;&#31034;&#20102;&#35299;&#20915;&#36816;&#21160;&#35268;&#21010;&#38382;&#39064;&#30340;12&#20493;&#36895;&#25552;&#21319;&#12290;&#24744;&#21487;&#20197;&#22312;&#36825;&#37324;&#25214;&#21040;&#23637;&#31034;&#35813;&#26550;&#26500;&#22312;&#22810;&#20010;&#22797;&#26434;&#20132;&#36890;&#22330;&#26223;&#20013;&#30340;&#35270;&#39057;&#65306;https://youtu.be/-TcMeolCLWc
&lt;/p&gt;
&lt;p&gt;
We propose a hierarchical architecture designed for scalable real-time Model Predictive Control (MPC) in complex, multi-modal traffic scenarios. This architecture comprises two key components: 1) RAID-Net, a novel attention-based Recurrent Neural Network that predicts relevant interactions along the MPC prediction horizon between the autonomous vehicle and the surrounding vehicles using Lagrangian duality, and 2) a reduced Stochastic MPC problem that eliminates irrelevant collision avoidance constraints, enhancing computational efficiency. Our approach is demonstrated in a simulated traffic intersection with interactive surrounding vehicles, showcasing a 12x speed-up in solving the motion planning problem. A video demonstrating the proposed architecture in multiple complex traffic scenarios can be found here: https://youtu.be/-TcMeolCLWc
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#35821;&#35328;&#25351;&#20196;&#22320;&#38754;&#21270;&#36816;&#21160;&#35268;&#21010;&#65288;LIMP&#65289;&#31995;&#32479;&#65292;&#21033;&#29992;&#22522;&#30784;&#27169;&#22411;&#21644;&#26102;&#38388;&#36923;&#36753;&#29983;&#25104;&#25351;&#20196;&#26465;&#20214;&#30340;&#35821;&#20041;&#22320;&#22270;&#65292;&#20351;&#26426;&#22120;&#20154;&#33021;&#22815;&#21487;&#39564;&#35777;&#22320;&#36981;&#24490;&#23500;&#26377;&#34920;&#29616;&#21147;&#21644;&#38271;&#26399;&#30340;&#25351;&#20196;&#65292;&#21253;&#25324;&#24320;&#25918;&#35789;&#27719;&#21442;&#29031;&#21644;&#22797;&#26434;&#30340;&#26102;&#31354;&#32422;&#26463;&#12290;</title><link>https://arxiv.org/abs/2402.11498</link><description>&lt;p&gt;
&#20351;&#29992;&#22522;&#30784;&#27169;&#22411;&#21487;&#39564;&#35777;&#22320;&#36981;&#24490;&#22797;&#26434;&#26426;&#22120;&#20154;&#25351;&#20196;
&lt;/p&gt;
&lt;p&gt;
Verifiably Following Complex Robot Instructions with Foundation Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11498
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#35821;&#35328;&#25351;&#20196;&#22320;&#38754;&#21270;&#36816;&#21160;&#35268;&#21010;&#65288;LIMP&#65289;&#31995;&#32479;&#65292;&#21033;&#29992;&#22522;&#30784;&#27169;&#22411;&#21644;&#26102;&#38388;&#36923;&#36753;&#29983;&#25104;&#25351;&#20196;&#26465;&#20214;&#30340;&#35821;&#20041;&#22320;&#22270;&#65292;&#20351;&#26426;&#22120;&#20154;&#33021;&#22815;&#21487;&#39564;&#35777;&#22320;&#36981;&#24490;&#23500;&#26377;&#34920;&#29616;&#21147;&#21644;&#38271;&#26399;&#30340;&#25351;&#20196;&#65292;&#21253;&#25324;&#24320;&#25918;&#35789;&#27719;&#21442;&#29031;&#21644;&#22797;&#26434;&#30340;&#26102;&#31354;&#32422;&#26463;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35753;&#26426;&#22120;&#20154;&#33021;&#22815;&#36981;&#24490;&#22797;&#26434;&#30340;&#33258;&#28982;&#35821;&#35328;&#25351;&#20196;&#26159;&#19968;&#20010;&#37325;&#35201;&#20294;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#20154;&#20204;&#24076;&#26395;&#22312;&#25351;&#23548;&#26426;&#22120;&#20154;&#26102;&#33021;&#22815;&#28789;&#27963;&#34920;&#36798;&#32422;&#26463;&#65292;&#25351;&#21521;&#20219;&#24847;&#22320;&#26631;&#24182;&#39564;&#35777;&#34892;&#20026;&#12290;&#30456;&#21453;&#65292;&#26426;&#22120;&#20154;&#24517;&#39035;&#23558;&#20154;&#31867;&#25351;&#20196;&#28040;&#38500;&#27495;&#20041;&#65292;&#23558;&#25351;&#20196;&#21442;&#29031;&#29289;&#32852;&#31995;&#21040;&#30495;&#23454;&#19990;&#30028;&#20013;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#35821;&#35328;&#25351;&#20196;&#22320;&#38754;&#21270;&#36816;&#21160;&#35268;&#21010;&#65288;LIMP&#65289;&#30340;&#31995;&#32479;&#65292;&#35813;&#31995;&#32479;&#21033;&#29992;&#22522;&#30784;&#27169;&#22411;&#21644;&#26102;&#38388;&#36923;&#36753;&#29983;&#25104;&#25351;&#20196;&#26465;&#20214;&#30340;&#35821;&#20041;&#22320;&#22270;&#65292;&#20351;&#26426;&#22120;&#20154;&#33021;&#22815;&#21487;&#39564;&#35777;&#22320;&#36981;&#24490;&#23500;&#26377;&#34920;&#29616;&#21147;&#21644;&#38271;&#26399;&#30340;&#25351;&#20196;&#65292;&#28085;&#30422;&#20102;&#24320;&#25918;&#35789;&#27719;&#21442;&#29031;&#21644;&#22797;&#26434;&#30340;&#26102;&#31354;&#32422;&#26463;&#12290;&#19982;&#20808;&#21069;&#22312;&#26426;&#22120;&#20154;&#20219;&#21153;&#25191;&#34892;&#20013;&#20351;&#29992;&#22522;&#30784;&#27169;&#22411;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;LIMP&#26500;&#24314;&#20102;&#19968;&#20010;&#21487;&#35299;&#37322;&#30340;&#25351;&#20196;&#34920;&#31034;&#65292;&#25581;&#31034;&#20102;&#26426;&#22120;&#20154;&#19982;&#25351;&#23548;&#32773;&#39044;&#26399;&#21160;&#26426;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#23454;&#29616;&#20102;&#26426;&#22120;&#20154;&#34892;&#20026;&#30340;&#32508;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11498v1 Announce Type: cross  Abstract: Enabling robots to follow complex natural language instructions is an important yet challenging problem. People want to flexibly express constraints, refer to arbitrary landmarks and verify behavior when instructing robots. Conversely, robots must disambiguate human instructions into specifications and ground instruction referents in the real world. We propose Language Instruction grounding for Motion Planning (LIMP), a system that leverages foundation models and temporal logics to generate instruction-conditioned semantic maps that enable robots to verifiably follow expressive and long-horizon instructions with open vocabulary referents and complex spatiotemporal constraints. In contrast to prior methods for using foundation models in robot task execution, LIMP constructs an explainable instruction representation that reveals the robot's alignment with an instructor's intended motives and affords the synthesis of robot behaviors that 
&lt;/p&gt;</description></item></channel></rss>