<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22823;&#35268;&#27169;&#22810;&#26426;&#22120;&#20154;&#32452;&#35013;&#35268;&#21010;&#30340;&#31639;&#27861;&#22534;&#26632;&#65292;&#21487;&#20197;&#22312;&#30701;&#26102;&#38388;&#20869;&#21512;&#25104;&#22797;&#26434;&#35013;&#37197;&#30340;&#24314;&#36896;&#35745;&#21010;&#65292;&#24182;&#35299;&#20915;&#20102;&#31227;&#21160;&#33258;&#20027;&#26426;&#22120;&#20154;&#22312;&#21046;&#36896;&#20013;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2311.00192</link><description>&lt;p&gt;
&#22823;&#35268;&#27169;&#22810;&#26426;&#22120;&#20154;&#32452;&#35013;&#35268;&#21010;&#29992;&#20110;&#33258;&#20027;&#21046;&#36896;
&lt;/p&gt;
&lt;p&gt;
Large-Scale Multi-Robot Assembly Planning for Autonomous Manufacturing. (arXiv:2311.00192v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00192
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22823;&#35268;&#27169;&#22810;&#26426;&#22120;&#20154;&#32452;&#35013;&#35268;&#21010;&#30340;&#31639;&#27861;&#22534;&#26632;&#65292;&#21487;&#20197;&#22312;&#30701;&#26102;&#38388;&#20869;&#21512;&#25104;&#22797;&#26434;&#35013;&#37197;&#30340;&#24314;&#36896;&#35745;&#21010;&#65292;&#24182;&#35299;&#20915;&#20102;&#31227;&#21160;&#33258;&#20027;&#26426;&#22120;&#20154;&#22312;&#21046;&#36896;&#20013;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31227;&#21160;&#33258;&#20027;&#26426;&#22120;&#20154;&#26377;&#28508;&#21147;&#38761;&#26032;&#21046;&#36896;&#27969;&#31243;&#12290;&#28982;&#32780;&#65292;&#23558;&#22823;&#22411;&#26426;&#22120;&#20154;&#32676;&#20307;&#24212;&#29992;&#20110;&#21046;&#36896;&#39046;&#22495;&#38656;&#35201;&#35299;&#20915;&#19968;&#20123;&#25361;&#25112;&#65292;&#21253;&#25324;&#22312;&#20849;&#20139;&#24037;&#20316;&#31354;&#38388;&#20013;&#23454;&#29616;&#26080;&#30896;&#25758;&#31227;&#21160;&#65292;&#26377;&#25928;&#30340;&#22810;&#26426;&#22120;&#20154;&#21327;&#20316;&#26469;&#25805;&#32437;&#21644;&#36816;&#36755;&#22823;&#22411;&#36127;&#36733;&#65292;&#30001;&#20110;&#32806;&#21512;&#30340;&#21046;&#36896;&#27969;&#31243;&#23548;&#33268;&#22797;&#26434;&#30340;&#20219;&#21153;&#20998;&#37197;&#65292;&#20197;&#21450;&#23884;&#22871;&#23376;&#35013;&#37197;&#20214;&#30340;&#24182;&#34892;&#35013;&#37197;&#21644;&#36816;&#36755;&#30340;&#31354;&#38388;&#35268;&#21010;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23436;&#25972;&#30340;&#31639;&#27861;&#22534;&#26632;&#65292;&#29992;&#20110;&#22823;&#35268;&#27169;&#22810;&#26426;&#22120;&#20154;&#32452;&#35013;&#35268;&#21010;&#65292;&#21487;&#20197;&#22312;&#20960;&#20998;&#38047;&#20869;&#21512;&#25104;&#20855;&#26377;&#25968;&#21315;&#20010;&#37096;&#20214;&#30340;&#22797;&#26434;&#35013;&#37197;&#30340;&#24314;&#36896;&#35745;&#21010;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25509;&#21463;&#31867;&#20284;CAD&#30340;&#20135;&#21697;&#35268;&#33539;&#65292;&#24182;&#33258;&#21160;&#20026;&#19968;&#32452;&#26426;&#22120;&#20154;&#35268;&#21010;&#20840;&#26632;&#35013;&#37197;&#36807;&#31243;&#26469;&#21046;&#36896;&#20135;&#21697;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#22534;&#26632;&#65292;&#21253;&#25324;&#65306;(i)&#36845;&#20195;&#24452;&#21521;&#24067;&#23616;&#20248;&#21270;&#36807;&#31243;&#65292;&#23450;&#20041;&#21046;&#36896;&#36807;&#31243;&#30340;&#20840;&#23616;&#35843;&#24230;&#24067;&#23616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mobile autonomous robots have the potential to revolutionize manufacturing processes. However, employing large robot fleets in manufacturing requires addressing challenges including collision-free movement in a shared workspace, effective multi-robot collaboration to manipulate and transport large payloads, complex task allocation due to coupled manufacturing processes, and spatial planning for parallel assembly and transportation of nested subassemblies. We propose a full algorithmic stack for large-scale multi-robot assembly planning that addresses these challenges and can synthesize construction plans for complex assemblies with thousands of parts in a matter of minutes. Our approach takes in a CAD-like product specification and automatically plans a full-stack assembly procedure for a group of robots to manufacture the product. We propose an algorithmic stack that comprises: (i) an iterative radial layout optimization procedure to define a global staging layout for the manufacturin
&lt;/p&gt;</description></item></channel></rss>