<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#26550;&#26500;&#65292;&#25552;&#39640;&#33258;&#20027;&#20195;&#29702;&#30340;&#20449;&#20219;&#21644;&#23433;&#20840;&#24615;&#65292;&#22686;&#24378;&#20195;&#29702;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#27807;&#36890;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.09567</link><description>&lt;p&gt;
&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22686;&#24378;&#33258;&#20027;&#20195;&#29702;&#30340;&#20449;&#20219;&#65306;&#19968;&#31181;&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#26550;&#26500;
&lt;/p&gt;
&lt;p&gt;
Enhancing Trust in Autonomous Agents: An Architecture for Accountability and Explainability through Blockchain and Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09567
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21306;&#22359;&#38142;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#26550;&#26500;&#65292;&#25552;&#39640;&#33258;&#20027;&#20195;&#29702;&#30340;&#20449;&#20219;&#21644;&#23433;&#20840;&#24615;&#65292;&#22686;&#24378;&#20195;&#29702;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#27807;&#36890;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20027;&#20195;&#29702;&#22312;&#28041;&#21450;&#20154;&#31867;&#20114;&#21160;&#30340;&#29615;&#22659;&#20013;&#30340;&#37096;&#32626;&#26085;&#30410;&#24341;&#36215;&#23433;&#20840;&#20851;&#27880;&#12290;&#22240;&#27492;&#65292;&#20102;&#35299;&#20107;&#20214;&#32972;&#21518;&#30340;&#24773;&#20917;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#65292;&#38656;&#35201;&#24320;&#21457;&#33021;&#22815;&#21521;&#38750;&#19987;&#23478;&#29992;&#25143;&#35299;&#37322;&#20854;&#34892;&#20026;&#30340;&#33021;&#21147;&#12290;&#36825;&#20123;&#35299;&#37322;&#22312;&#25552;&#39640;&#21487;&#20449;&#24230;&#21644;&#23433;&#20840;&#24615;&#26041;&#38754;&#33267;&#20851;&#37325;&#35201;&#65292;&#20316;&#20026;&#38450;&#33539;&#22833;&#36133;&#12289;&#38169;&#35823;&#21644;&#35823;&#35299;&#30340;&#25514;&#26045;&#12290;&#27492;&#22806;&#65292;&#23427;&#20204;&#26377;&#21161;&#20110;&#25913;&#21892;&#27807;&#36890;&#65292;&#24357;&#21512;&#20195;&#29702;&#21644;&#29992;&#25143;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#20174;&#32780;&#25552;&#39640;&#23427;&#20204;&#30456;&#20114;&#20316;&#29992;&#30340;&#25928;&#26524;&#12290;&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#20026;&#22522;&#20110;ROS&#30340;&#31227;&#21160;&#26426;&#22120;&#20154;&#23454;&#26045;&#30340;&#36131;&#20219;&#21644;&#21487;&#35299;&#37322;&#24615;&#26550;&#26500;&#12290;&#25152;&#25552;&#20986;&#30340;&#35299;&#20915;&#26041;&#26696;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#32452;&#20214;&#12290;&#39318;&#20808;&#65292;&#19968;&#20010;&#31867;&#20284;&#40657;&#30418;&#30340;&#20803;&#32032;&#29992;&#20110;&#25552;&#20379;&#38382;&#36131;&#21046;&#65292;&#20855;&#26377;&#36890;&#36807;&#21306;&#22359;&#38142;&#25216;&#26415;&#23454;&#29616;&#30340;&#38450;&#31713;&#25913;&#23646;&#24615;&#12290;&#20854;&#27425;&#65292;&#19968;&#20010;&#36127;&#36131;&#30340;&#32452;&#20214;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09567v1 Announce Type: cross  Abstract: The deployment of autonomous agents in environments involving human interaction has increasingly raised security concerns. Consequently, understanding the circumstances behind an event becomes critical, requiring the development of capabilities to justify their behaviors to non-expert users. Such explanations are essential in enhancing trustworthiness and safety, acting as a preventive measure against failures, errors, and misunderstandings. Additionally, they contribute to improving communication, bridging the gap between the agent and the user, thereby improving the effectiveness of their interactions. This work presents an accountability and explainability architecture implemented for ROS-based mobile robots. The proposed solution consists of two main components. Firstly, a black box-like element to provide accountability, featuring anti-tampering properties achieved through blockchain technology. Secondly, a component in charge of 
&lt;/p&gt;</description></item></channel></rss>