<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36890;&#36807;&#22522;&#20110;&#20840;&#38754;&#36816;&#33829;&#25104;&#26412;&#30340;&#22870;&#21169;&#20989;&#25968;&#65292;&#37319;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#20248;&#21270;&#33258;&#20027;&#21345;&#36710;&#30340;&#25112;&#26415;&#20915;&#31574;&#65292;&#23558;&#39640;&#32423;&#20915;&#31574;&#19982;&#20302;&#32423;&#25511;&#21046;&#20998;&#31163;&#65292;&#24182;&#37319;&#29992;&#19981;&#21516;&#25216;&#24039;&#25552;&#21319;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2403.06524</link><description>&lt;p&gt;
&#22522;&#20110;&#20840;&#38754;&#36816;&#33829;&#25104;&#26412;&#22870;&#21169;&#30340;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#33258;&#20027;&#21345;&#36710;&#25112;&#26415;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Tactical Decision Making for Autonomous Trucks by Deep Reinforcement Learning with Total Cost of Operation Based Reward
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06524
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22522;&#20110;&#20840;&#38754;&#36816;&#33829;&#25104;&#26412;&#30340;&#22870;&#21169;&#20989;&#25968;&#65292;&#37319;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#20248;&#21270;&#33258;&#20027;&#21345;&#36710;&#30340;&#25112;&#26415;&#20915;&#31574;&#65292;&#23558;&#39640;&#32423;&#20915;&#31574;&#19982;&#20302;&#32423;&#25511;&#21046;&#20998;&#31163;&#65292;&#24182;&#37319;&#29992;&#19981;&#21516;&#25216;&#24039;&#25552;&#21319;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20026;&#33258;&#20027;&#21345;&#36710;&#30340;&#25112;&#26415;&#20915;&#31574;&#21046;&#23450;&#20102;&#19968;&#20010;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26694;&#26550;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#39640;&#36895;&#20844;&#36335;&#22330;&#26223;&#20013;&#30340;&#33258;&#36866;&#24212;&#24033;&#33322;&#25511;&#21046;&#65288;ACC&#65289;&#21644;&#21464;&#36947;&#21160;&#20316;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#24378;&#21270;&#23398;&#20064;&#20195;&#29702;&#21644;&#22522;&#20110;&#29289;&#29702;&#27169;&#22411;&#30340;&#20302;&#32423;&#25511;&#21046;&#22120;&#20043;&#38388;&#20998;&#31163;&#39640;&#32423;&#20915;&#31574;&#36807;&#31243;&#21644;&#20302;&#32423;&#25511;&#21046;&#21160;&#20316;&#26159;&#26377;&#30410;&#30340;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36890;&#36807;&#22312;&#21345;&#36710;&#30340;&#20840;&#38754;&#36816;&#33829;&#25104;&#26412;&#65288;TCOP&#65289;&#20026;&#22522;&#30784;&#30340;&#22810;&#30446;&#26631;&#22870;&#21169;&#20989;&#25968;&#20248;&#21270;&#24615;&#33021;&#30340;&#19981;&#21516;&#26041;&#27861;&#65307;&#36890;&#36807;&#20026;&#22870;&#21169;&#20998;&#37327;&#28155;&#21152;&#26435;&#37325;&#65292;&#36890;&#36807;&#23545;&#22870;&#21169;&#20998;&#37327;&#36827;&#34892;&#24402;&#19968;&#21270;&#65292;&#20197;&#21450;&#20351;&#29992;&#35838;&#31243;&#23398;&#20064;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06524v1 Announce Type: cross  Abstract: We develop a deep reinforcement learning framework for tactical decision making in an autonomous truck, specifically for Adaptive Cruise Control (ACC) and lane change maneuvers in a highway scenario. Our results demonstrate that it is beneficial to separate high-level decision-making processes and low-level control actions between the reinforcement learning agent and the low-level controllers based on physical models. In the following, we study optimizing the performance with a realistic and multi-objective reward function based on Total Cost of Operation (TCOP) of the truck using different approaches; by adding weights to reward components, by normalizing the reward components and by using curriculum learning techniques.
&lt;/p&gt;</description></item></channel></rss>