<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>RealDex&#25968;&#25454;&#38598;&#25429;&#25417;&#20102;&#30495;&#23454;&#30340;&#28789;&#24039;&#25163;&#25235;&#21462;&#21160;&#20316;&#65292;&#21033;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#20351;&#24471;&#35757;&#32451;&#28789;&#24039;&#25163;&#26356;&#21152;&#33258;&#28982;&#21644;&#31934;&#30830;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#19968;&#31181;&#20808;&#36827;&#30340;&#28789;&#24039;&#25235;&#21462;&#21160;&#20316;&#29983;&#25104;&#26694;&#26550;&#65292;&#26377;&#25928;&#21033;&#29992;&#22810;&#27169;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#22312;&#31867;&#20154;&#26426;&#22120;&#20154;&#30340;&#33258;&#21160;&#24863;&#30693;&#12289;&#35748;&#30693;&#21644;&#25805;&#32437;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.13853</link><description>&lt;p&gt;
RealDex: &#23454;&#29616;&#26426;&#22120;&#20154;&#28789;&#24039;&#25163;&#31867;&#20154;&#24335;&#25235;&#21462;
&lt;/p&gt;
&lt;p&gt;
RealDex: Towards Human-like Grasping for Robotic Dexterous Hand
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13853
&lt;/p&gt;
&lt;p&gt;
RealDex&#25968;&#25454;&#38598;&#25429;&#25417;&#20102;&#30495;&#23454;&#30340;&#28789;&#24039;&#25163;&#25235;&#21462;&#21160;&#20316;&#65292;&#21033;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#20351;&#24471;&#35757;&#32451;&#28789;&#24039;&#25163;&#26356;&#21152;&#33258;&#28982;&#21644;&#31934;&#30830;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#19968;&#31181;&#20808;&#36827;&#30340;&#28789;&#24039;&#25235;&#21462;&#21160;&#20316;&#29983;&#25104;&#26694;&#26550;&#65292;&#26377;&#25928;&#21033;&#29992;&#22810;&#27169;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#22312;&#31867;&#20154;&#26426;&#22120;&#20154;&#30340;&#33258;&#21160;&#24863;&#30693;&#12289;&#35748;&#30693;&#21644;&#25805;&#32437;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;RealDex&#65292;&#19968;&#20010;&#24320;&#21019;&#24615;&#30340;&#25968;&#25454;&#38598;&#65292;&#25429;&#25417;&#20102;&#34701;&#20837;&#20102;&#20154;&#31867;&#34892;&#20026;&#27169;&#24335;&#30340;&#30495;&#23454;&#28789;&#24039;&#25163;&#25235;&#21462;&#21160;&#20316;&#65292;&#21516;&#26102;&#36890;&#36807;&#22810;&#35270;&#35282;&#21644;&#22810;&#27169;&#24577;&#35270;&#35273;&#25968;&#25454;&#36827;&#34892;&#20102;&#20016;&#23500;&#12290;&#21033;&#29992;&#36828;&#31243;&#25805;&#20316;&#31995;&#32479;&#65292;&#25105;&#20204;&#21487;&#20197;&#23454;&#26102;&#26080;&#32541;&#21516;&#27493;&#20154;-&#26426;&#22120;&#20154;&#25163;&#23039;&#21183;&#12290;&#36825;&#20123;&#31867;&#20154;&#21160;&#20316;&#30340;&#38598;&#21512;&#23545;&#20110;&#35757;&#32451;&#28789;&#24039;&#25163;&#26356;&#33258;&#28982;&#12289;&#26356;&#31934;&#30830;&#22320;&#27169;&#20223;&#20154;&#31867;&#21160;&#20316;&#33267;&#20851;&#37325;&#35201;&#12290;RealDex&#22312;&#25512;&#21160;&#31867;&#20154;&#26426;&#22120;&#20154;&#22312;&#30495;&#23454;&#22330;&#26223;&#20013;&#33258;&#21160;&#24863;&#30693;&#12289;&#35748;&#30693;&#21644;&#25805;&#32437;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#21069;&#27839;&#30340;&#28789;&#24039;&#25235;&#21462;&#21160;&#20316;&#29983;&#25104;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#31526;&#21512;&#20154;&#31867;&#32463;&#39564;&#65292;&#24182;&#36890;&#36807;&#26377;&#25928;&#21033;&#29992;&#22810;&#27169;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22686;&#24378;&#20102;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#36866;&#29992;&#24615;&#12290;&#24191;&#27867;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;RealDex&#21644;&#20854;&#20182;&#24320;&#25918;&#25968;&#25454;&#38598;&#19978;&#30340;&#20248;&#36234;&#24615;&#33021;&#12290;&#23436;&#25972;&#30340;&#25968;&#25454;&#38598;&#21644;&#20195;&#30721;&#23558;&#20250;&#20844;&#24320;&#21457;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13853v1 Announce Type: cross  Abstract: In this paper, we introduce RealDex, a pioneering dataset capturing authentic dexterous hand grasping motions infused with human behavioral patterns, enriched by multi-view and multimodal visual data. Utilizing a teleoperation system, we seamlessly synchronize human-robot hand poses in real time. This collection of human-like motions is crucial for training dexterous hands to mimic human movements more naturally and precisely. RealDex holds immense promise in advancing humanoid robot for automated perception, cognition, and manipulation in real-world scenarios. Moreover, we introduce a cutting-edge dexterous grasping motion generation framework, which aligns with human experience and enhances real-world applicability through effectively utilizing Multimodal Large Language Models. Extensive experiments have demonstrated the superior performance of our method on RealDex and other open datasets. The complete dataset and code will be made 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;ROAM&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#34892;&#20026;&#26469;&#23454;&#26102;&#35843;&#33410;&#26426;&#22120;&#20154;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#24212;&#23545;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ROAM&#21487;&#20197;&#22312;&#21333;&#20010;&#38454;&#27573;&#20869;&#23454;&#29616;&#24555;&#36895;&#36866;&#24212;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#22330;&#26223;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.01059</link><description>&lt;p&gt;
&#22312;&#37096;&#32626;&#26102;&#36827;&#34892;&#23454;&#26102;&#35843;&#33410;&#65306;&#29992;&#20110;&#21333;&#26426;&#22120;&#20154;&#37096;&#32626;&#30340;&#34892;&#20026;&#35843;&#25511;
&lt;/p&gt;
&lt;p&gt;
Adapt On-the-Go: Behavior Modulation for Single-Life Robot Deployment. (arXiv:2311.01059v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01059
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;ROAM&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#34892;&#20026;&#26469;&#23454;&#26102;&#35843;&#33410;&#26426;&#22120;&#20154;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#24212;&#23545;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ROAM&#21487;&#20197;&#22312;&#21333;&#20010;&#38454;&#27573;&#20869;&#23454;&#29616;&#24555;&#36895;&#36866;&#24212;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#22330;&#26223;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#21462;&#24471;&#25104;&#21151;&#65292;&#26426;&#22120;&#20154;&#24517;&#39035;&#24212;&#23545;&#35757;&#32451;&#36807;&#31243;&#20013;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#38024;&#23545;&#36825;&#20123;&#26032;&#22330;&#26223;&#30340;&#23454;&#26102;&#35843;&#33410;&#38382;&#39064;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#22810;&#26679;&#21270;&#34892;&#20026;&#24211;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;RObust Autonomous Modulation&#65288;ROAM&#65289;&#65292;&#24341;&#20837;&#20102;&#22522;&#20110;&#39044;&#35757;&#32451;&#34892;&#20026;&#30340;&#24863;&#30693;&#20215;&#20540;&#30340;&#26426;&#21046;&#65292;&#20197;&#22312;&#29305;&#23450;&#24773;&#20917;&#19979;&#36873;&#25321;&#21644;&#35843;&#25972;&#39044;&#35757;&#32451;&#34892;&#20026;&#12290;&#20851;&#38190;&#26159;&#65292;&#36825;&#31181;&#35843;&#33410;&#36807;&#31243;&#22312;&#27979;&#35797;&#26102;&#30340;&#21333;&#20010;&#38454;&#27573;&#20869;&#23436;&#25104;&#65292;&#26080;&#38656;&#20219;&#20309;&#20154;&#31867;&#30417;&#30563;&#12290;&#25105;&#20204;&#23545;&#36873;&#25321;&#26426;&#21046;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#65292;&#24182;&#35777;&#26126;&#20102;ROAM&#20351;&#24471;&#26426;&#22120;&#20154;&#33021;&#22815;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#30340;&#22235;&#36275;&#21160;&#29289;Go1&#19978;&#24555;&#36895;&#36866;&#24212;&#21160;&#24577;&#21464;&#21270;&#65292;&#29978;&#33267;&#22312;&#33050;&#19978;&#22871;&#30528;&#28378;&#36718;&#28369;&#38795;&#30340;&#24773;&#20917;&#19979;&#25104;&#21151;&#21069;&#36827;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#38754;&#23545;&#21508;&#31181;&#20998;&#24067;&#24773;&#20917;&#30340;&#37096;&#32626;&#26102;&#33021;&#22815;&#20197;&#36229;&#36807;2&#20493;&#30340;&#25928;&#29575;&#36827;&#34892;&#35843;&#33410;&#65292;&#36890;&#36807;&#26377;&#25928;&#36873;&#25321;&#26469;&#23454;&#29616;&#36866;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
To succeed in the real world, robots must cope with situations that differ from those seen during training. We study the problem of adapting on-the-fly to such novel scenarios during deployment, by drawing upon a diverse repertoire of previously learned behaviors. Our approach, RObust Autonomous Modulation (ROAM), introduces a mechanism based on the perceived value of pre-trained behaviors to select and adapt pre-trained behaviors to the situation at hand. Crucially, this adaptation process all happens within a single episode at test time, without any human supervision. We provide theoretical analysis of our selection mechanism and demonstrate that ROAM enables a robot to adapt rapidly to changes in dynamics both in simulation and on a real Go1 quadruped, even successfully moving forward with roller skates on its feet. Our approach adapts over 2x as efficiently compared to existing methods when facing a variety of out-of-distribution situations during deployment by effectively choosing
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20540;&#20989;&#25968;&#31639;&#27861;&#21644;&#26799;&#24230;&#31639;&#27861;&#30340;&#25915;&#20987;&#26041;&#27861;&#65292;&#21033;&#29992;&#26799;&#24230;&#21453;&#36716;&#37325;&#24314;&#29366;&#24577;&#12289;&#21160;&#20316;&#21644;&#30417;&#30563;&#20449;&#21495;&#65292;&#20197;&#35299;&#20915;&#23884;&#20837;&#24335;&#20154;&#24037;&#26234;&#33021;&#20013;&#30340;&#38544;&#31169;&#27844;&#38706;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.09273</link><description>&lt;p&gt;
&#20320;&#30340;&#25151;&#38388;&#19981;&#26159;&#31169;&#23494;&#30340;&#65306;&#20851;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26799;&#24230;&#21453;&#36716;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Your Room is not Private: Gradient Inversion Attack on Reinforcement Learning. (arXiv:2306.09273v2 [cs.RO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09273
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20540;&#20989;&#25968;&#31639;&#27861;&#21644;&#26799;&#24230;&#31639;&#27861;&#30340;&#25915;&#20987;&#26041;&#27861;&#65292;&#21033;&#29992;&#26799;&#24230;&#21453;&#36716;&#37325;&#24314;&#29366;&#24577;&#12289;&#21160;&#20316;&#21644;&#30417;&#30563;&#20449;&#21495;&#65292;&#20197;&#35299;&#20915;&#23884;&#20837;&#24335;&#20154;&#24037;&#26234;&#33021;&#20013;&#30340;&#38544;&#31169;&#27844;&#38706;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23884;&#20837;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#26174;&#33879;&#21457;&#23637;&#21560;&#24341;&#20102;&#20154;&#20204;&#30340;&#26497;&#22823;&#20851;&#27880;&#65292;&#35813;&#25216;&#26415;&#20351;&#24471;&#26426;&#22120;&#20154;&#21487;&#20197;&#22312;&#34394;&#25311;&#29615;&#22659;&#20013;&#23548;&#33322;&#12289;&#24863;&#30693;&#21644;&#20114;&#21160;&#12290;&#30001;&#20110;&#35745;&#31639;&#26426;&#35270;&#35273;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26041;&#38754;&#30340;&#26174;&#33879;&#36827;&#23637;&#65292;&#38544;&#31169;&#38382;&#39064;&#22312;&#23884;&#20837;&#24335;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#65292;&#22240;&#20026;&#26426;&#22120;&#20154;&#21487;&#20197;&#35775;&#38382;&#22823;&#37327;&#20010;&#20154;&#20449;&#24687;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#20013;&#30340;&#38544;&#31169;&#27844;&#38706;&#38382;&#39064;&#65292;&#23588;&#20854;&#26159;&#20851;&#20110;&#20540;&#20989;&#25968;&#31639;&#27861;&#21644;&#26799;&#24230;&#31639;&#27861;&#30340;&#38382;&#39064;&#65292;&#22312;&#30740;&#31350;&#20013;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#32771;&#34385;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#25915;&#20987;&#20540;&#20989;&#25968;&#31639;&#27861;&#21644;&#26799;&#24230;&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#26799;&#24230;&#21453;&#36716;&#37325;&#24314;&#29366;&#24577;&#12289;&#21160;&#20316;&#21644;&#30417;&#30563;&#20449;&#21495;&#65292;&#26469;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#12290;&#36873;&#25321;&#20351;&#29992;&#26799;&#24230;&#36827;&#34892;&#25915;&#20987;&#26159;&#22240;&#20026;&#24120;&#29992;&#30340;&#32852;&#37030;&#23398;&#20064;&#25216;&#26415;&#20165;&#21033;&#29992;&#22522;&#20110;&#31169;&#20154;&#29992;&#25143;&#25968;&#25454;&#35745;&#31639;&#30340;&#26799;&#24230;&#26469;&#20248;&#21270;&#27169;&#22411;&#65292;&#32780;&#19981;&#23384;&#20648;&#25110;&#20256;&#36755;&#29992;&#25143;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
The prominence of embodied Artificial Intelligence (AI), which empowers robots to navigate, perceive, and engage within virtual environments, has attracted significant attention, owing to the remarkable advancements in computer vision and large language models. Privacy emerges as a pivotal concern within the realm of embodied AI, as the robot accesses substantial personal information. However, the issue of privacy leakage in embodied AI tasks, particularly in relation to reinforcement learning algorithms, has not received adequate consideration in research. This paper aims to address this gap by proposing an attack on the value-based algorithm and the gradient-based algorithm, utilizing gradient inversion to reconstruct states, actions, and supervision signals. The choice of using gradients for the attack is motivated by the fact that commonly employed federated learning techniques solely utilize gradients computed based on private user data to optimize models, without storing or trans
&lt;/p&gt;</description></item></channel></rss>