<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>D$^3$Fields&#26159;&#19968;&#20010;&#21160;&#24577;&#30340;&#19977;&#32500;&#25551;&#36848;&#31526;&#22330;&#65292;&#23558;&#24213;&#23618;&#19977;&#32500;&#29615;&#22659;&#30340;&#21160;&#24577;&#29305;&#24615;&#20197;&#21450;&#35821;&#20041;&#29305;&#24449;&#21644;&#23454;&#20363;&#25513;&#27169;&#32534;&#30721;&#36215;&#26469;&#12290;&#23427;&#21487;&#20197;&#28789;&#27963;&#22320;&#20351;&#29992;&#19981;&#21516;&#32972;&#26223;&#12289;&#39118;&#26684;&#21644;&#23454;&#20363;&#30340;&#20108;&#32500;&#22270;&#20687;&#25351;&#23450;&#30446;&#26631;&#65292;&#23454;&#29616;&#38646;&#26679;&#26412;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#30340;&#21487;&#27867;&#21270;&#12290;</title><link>http://arxiv.org/abs/2309.16118</link><description>&lt;p&gt;
D$^3$Fields: &#21160;&#24577;&#19977;&#32500;&#25551;&#36848;&#31526;&#22330;&#29992;&#20110;&#38646;&#26679;&#26412;&#21487;&#27867;&#21270;&#26426;&#22120;&#20154;&#25805;&#20316;
&lt;/p&gt;
&lt;p&gt;
D$^3$Fields: Dynamic 3D Descriptor Fields for Zero-Shot Generalizable Robotic Manipulation. (arXiv:2309.16118v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16118
&lt;/p&gt;
&lt;p&gt;
D$^3$Fields&#26159;&#19968;&#20010;&#21160;&#24577;&#30340;&#19977;&#32500;&#25551;&#36848;&#31526;&#22330;&#65292;&#23558;&#24213;&#23618;&#19977;&#32500;&#29615;&#22659;&#30340;&#21160;&#24577;&#29305;&#24615;&#20197;&#21450;&#35821;&#20041;&#29305;&#24449;&#21644;&#23454;&#20363;&#25513;&#27169;&#32534;&#30721;&#36215;&#26469;&#12290;&#23427;&#21487;&#20197;&#28789;&#27963;&#22320;&#20351;&#29992;&#19981;&#21516;&#32972;&#26223;&#12289;&#39118;&#26684;&#21644;&#23454;&#20363;&#30340;&#20108;&#32500;&#22270;&#20687;&#25351;&#23450;&#30446;&#26631;&#65292;&#23454;&#29616;&#38646;&#26679;&#26412;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#30340;&#21487;&#27867;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22330;&#26223;&#34920;&#31034;&#26159;&#26426;&#22120;&#20154;&#25805;&#20316;&#31995;&#32479;&#20013;&#19968;&#20010;&#20851;&#38190;&#30340;&#35774;&#35745;&#36873;&#25321;&#12290;&#19968;&#20010;&#29702;&#24819;&#30340;&#34920;&#31034;&#24212;&#35813;&#26159;&#19977;&#32500;&#30340;&#12289;&#21160;&#24577;&#30340;&#21644;&#35821;&#20041;&#21270;&#30340;&#65292;&#20197;&#28385;&#36275;&#19981;&#21516;&#25805;&#20316;&#20219;&#21153;&#30340;&#38656;&#27714;&#12290;&#28982;&#32780;&#65292;&#20808;&#21069;&#30340;&#24037;&#20316;&#24448;&#24448;&#21516;&#26102;&#32570;&#20047;&#36825;&#19977;&#20010;&#23646;&#24615;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;D$^3$Fields&#21160;&#24577;&#19977;&#32500;&#25551;&#36848;&#31526;&#22330;&#12290;&#36825;&#20123;&#22330;&#25429;&#25417;&#20102;&#24213;&#23618;&#19977;&#32500;&#29615;&#22659;&#30340;&#21160;&#24577;&#29305;&#24615;&#65292;&#32534;&#30721;&#20102;&#35821;&#20041;&#29305;&#24449;&#21644;&#23454;&#20363;&#25513;&#27169;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23558;&#24037;&#20316;&#21306;&#22495;&#20013;&#30340;&#20219;&#24847;&#19977;&#32500;&#28857;&#25237;&#24433;&#21040;&#22810;&#35270;&#35282;&#30340;&#20108;&#32500;&#35270;&#35273;&#35266;&#23519;&#20013;&#65292;&#24182;&#25554;&#20540;&#20174;&#22522;&#26412;&#27169;&#22411;&#20013;&#24471;&#21040;&#30340;&#29305;&#24449;&#12290;&#30001;&#27492;&#24471;&#21040;&#30340;&#34701;&#21512;&#25551;&#36848;&#31526;&#22330;&#21487;&#20197;&#20351;&#29992;&#20855;&#26377;&#19981;&#21516;&#32972;&#26223;&#12289;&#39118;&#26684;&#21644;&#23454;&#20363;&#30340;&#20108;&#32500;&#22270;&#20687;&#28789;&#27963;&#22320;&#25351;&#23450;&#30446;&#26631;&#12290;&#20026;&#20102;&#35780;&#20272;&#36825;&#20123;&#25551;&#36848;&#31526;&#22330;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#20197;&#38646;&#26679;&#26412;&#26041;&#24335;&#23558;&#25105;&#20204;&#30340;&#34920;&#31034;&#24212;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#12290;&#36890;&#36807;&#22312;&#30495;&#23454;&#22330;&#26223;&#21644;&#27169;&#25311;&#20013;&#30340;&#24191;&#27867;&#35780;&#20272;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scene representation has been a crucial design choice in robotic manipulation systems. An ideal representation should be 3D, dynamic, and semantic to meet the demands of diverse manipulation tasks. However, previous works often lack all three properties simultaneously. In this work, we introduce D$^3$Fields dynamic 3D descriptor fields. These fields capture the dynamics of the underlying 3D environment and encode both semantic features and instance masks. Specifically, we project arbitrary 3D points in the workspace onto multi-view 2D visual observations and interpolate features derived from foundational models. The resulting fused descriptor fields allow for flexible goal specifications using 2D images with varied contexts, styles, and instances. To evaluate the effectiveness of these descriptor fields, we apply our representation to a wide range of robotic manipulation tasks in a zero-shot manner. Through extensive evaluation in both real-world scenarios and simulations, we demonst
&lt;/p&gt;</description></item></channel></rss>