<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#35757;&#32451;&#30340;&#24378;&#21270;&#23398;&#20064;&#20195;&#29702;&#65292;&#22312;&#22797;&#26434;&#30340;&#27611;&#32454;&#34880;&#31649;&#32593;&#32476;&#20013;&#25104;&#21151;&#22320;&#23454;&#29616;&#20102;&#30913;&#24615;&#24494;&#28216;&#27891;&#22120;&#30340;&#36335;&#24452;&#35268;&#21010;&#12290;</title><link>https://arxiv.org/abs/2404.02171</link><description>&lt;p&gt;
&#30913;&#24615;&#24494;&#28216;&#27891;&#22120;&#22312;&#39640;&#20445;&#30495;&#24230;&#27169;&#25311;&#20154;&#20307;&#27611;&#32454;&#34880;&#31649;&#20013;&#30340;&#36335;&#24452;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Path planning of magnetic microswimmers in high-fidelity simulations of capillaries with deep reinforcement learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02171
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#35757;&#32451;&#30340;&#24378;&#21270;&#23398;&#20064;&#20195;&#29702;&#65292;&#22312;&#22797;&#26434;&#30340;&#27611;&#32454;&#34880;&#31649;&#32593;&#32476;&#20013;&#25104;&#21151;&#22320;&#23454;&#29616;&#20102;&#30913;&#24615;&#24494;&#28216;&#27891;&#22120;&#30340;&#36335;&#24452;&#35268;&#21010;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#29289;&#21307;&#23398;&#24212;&#29992;&#22914;&#23450;&#21521;&#33647;&#29289;&#36755;&#36865;&#12289;&#24494;&#21019;&#25163;&#26415;&#25110;&#24863;&#30693;&#20381;&#36182;&#20110;&#20197;&#26368;&#23567;&#21019;&#20260;&#26041;&#24335;&#21040;&#36798;&#36523;&#20307;&#20869;&#31934;&#30830;&#21306;&#22495;&#12290;&#20154;&#24037;&#32454;&#33740;&#38829;&#27611;(ABFs)&#24050;&#34987;&#35270;&#20026;&#36890;&#36807;&#24490;&#29615;&#31995;&#32479;&#23548;&#33322;&#23436;&#25104;&#27492;&#20219;&#21153;&#30340;&#28508;&#22312;&#24037;&#20855;&#12290;&#34429;&#28982;&#22312;&#31616;&#21333;&#22330;&#26223;&#20013;&#24050;&#20102;&#35299;ABFs&#30340;&#25511;&#21046;&#21644;&#28216;&#27891;&#29305;&#24615;&#65292;&#20294;&#23427;&#20204;&#22312;&#34880;&#28082;&#20013;&#30340;&#34892;&#20026;&#20173;&#19981;&#28165;&#26970;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;ABFs&#22312;&#20154;&#31867;&#35270;&#32593;&#33180;&#20013;&#22797;&#26434;&#27611;&#32454;&#34880;&#31649;&#32593;&#32476;&#20013;&#28436;&#21270;&#30340;&#27169;&#25311;&#12290;&#36890;&#36807;&#20043;&#21069;&#22312;&#38477;&#38454;&#27169;&#22411;&#19978;&#35757;&#32451;&#30340;&#24378;&#21270;&#23398;&#20064;&#20195;&#29702;&#65292;ABF&#34987;&#31283;&#20581;&#22320;&#24341;&#23548;&#21040;&#25351;&#23450;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02171v1 Announce Type: cross  Abstract: Biomedical applications such as targeted drug delivery, microsurgery or sensing rely on reaching precise areas within the body in a minimally invasive way. Artificial bacterial flagella (ABFs) have emerged as potential tools for this task by navigating through the circulatory system. While the control and swimming characteristics of ABFs is understood in simple scenarios, their behavior within the bloodstream remains unclear. We conduct simulations of ABFs evolving in the complex capillary networks found in the human retina. The ABF is robustly guided to a prescribed target by a reinforcement learning agent previously trained on a reduced order model.
&lt;/p&gt;</description></item></channel></rss>