<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#20027;&#30340;&#12289;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#25805;&#20316;&#22120;&#26694;&#26550;&#65292;&#23558;&#20154;&#22312;&#22238;&#36335;&#21407;&#21017;&#21644;&#25193;&#23637;&#29616;&#23454;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20419;&#36827;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#30452;&#35266;&#30340;&#27807;&#36890;&#21644;&#32534;&#31243;&#12290;</title><link>https://arxiv.org/abs/2403.14597</link><description>&lt;p&gt;
&#25193;&#23637;&#29616;&#23454;&#29992;&#20110;&#22686;&#24378;&#20154;&#26426;&#21327;&#20316;&#65306;&#19968;&#31181;&#20154;&#22312;&#22238;&#36335;&#20013;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Extended Reality for Enhanced Human-Robot Collaboration: a Human-in-the-Loop Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14597
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#20027;&#30340;&#12289;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#25805;&#20316;&#22120;&#26694;&#26550;&#65292;&#23558;&#20154;&#22312;&#22238;&#36335;&#21407;&#21017;&#21644;&#25193;&#23637;&#29616;&#23454;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20419;&#36827;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#30452;&#35266;&#30340;&#27807;&#36890;&#21644;&#32534;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#21270;&#30340;&#23835;&#36215;&#20026;&#21046;&#36896;&#36807;&#31243;&#30340;&#39640;&#25928;&#29575;&#25552;&#20379;&#20102;&#26426;&#20250;&#65292;&#20294;&#24448;&#24448;&#29306;&#29298;&#20102;&#21450;&#26102;&#21709;&#24212;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#38656;&#27714;&#21644;&#28385;&#36275;&#23450;&#21046;&#38656;&#27714;&#25152;&#38656;&#30340;&#28789;&#27963;&#24615;&#12290;&#20154;&#26426;&#21327;&#20316;&#35797;&#22270;&#36890;&#36807;&#23558;&#26426;&#22120;&#30340;&#21147;&#37327;&#21644;&#31934;&#24230;&#19982;&#20154;&#31867;&#30340;&#26426;&#26234;&#21644;&#24863;&#30693;&#29702;&#35299;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#12290;&#26412;&#25991;&#27010;&#24565;&#21270;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#29616;&#26694;&#26550;&#65292;&#29992;&#20110;&#23558;&#20154;&#22312;&#22238;&#36335;&#21407;&#21017;&#19982;&#25193;&#23637;&#29616;&#23454;&#65288;XR&#65289;&#30456;&#32467;&#21512;&#65292;&#20197;&#20415;&#20110;&#20154;&#19982;&#26426;&#22120;&#20154;&#20043;&#38388;&#36827;&#34892;&#30452;&#35266;&#27807;&#36890;&#21644;&#32534;&#31243;&#12290;&#27492;&#22806;&#65292;&#36825;&#20010;&#27010;&#24565;&#26694;&#26550;&#39044;&#35265;&#21040;&#20102;&#20154;&#30452;&#25509;&#21442;&#19982;&#26426;&#22120;&#20154;&#23398;&#20064;&#36807;&#31243;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#36866;&#24212;&#24615;&#21644;&#20219;&#21153;&#27867;&#21270;&#33021;&#21147;&#12290;&#26412;&#25991;&#37325;&#28857;&#20171;&#32461;&#20102;&#25903;&#25345;&#25152;&#25552;&#20986;&#26694;&#26550;&#30340;&#20851;&#38190;&#25216;&#26415;&#65292;&#24378;&#35843;&#20102;&#23454;&#29616;&#36825;&#19968;&#26694;&#26550;&#30340;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14597v1 Announce Type: cross  Abstract: The rise of automation has provided an opportunity to achieve higher efficiency in manufacturing processes, yet it often compromises the flexibility required to promptly respond to evolving market needs and meet the demand for customization. Human-robot collaboration attempts to tackle these challenges by combining the strength and precision of machines with human ingenuity and perceptual understanding. In this paper, we conceptualize and propose an implementation framework for an autonomous, machine learning-based manipulator that incorporates human-in-the-loop principles and leverages Extended Reality (XR) to facilitate intuitive communication and programming between humans and robots. Furthermore, the conceptual framework foresees human involvement directly in the robot learning process, resulting in higher adaptability and task generalization. The paper highlights key technologies enabling the proposed framework, emphasizing the im
&lt;/p&gt;</description></item></channel></rss>