<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>VIRUS-NeRF&#26159;&#22522;&#20110;&#35270;&#35273;&#12289;&#32418;&#22806;&#21644;&#36229;&#22768;&#27874;&#30340;&#31070;&#32463;&#36752;&#23556;&#22330;&#65292;&#36890;&#36807;&#25972;&#21512;&#36229;&#22768;&#27874;&#21644;&#32418;&#22806;&#20256;&#24863;&#22120;&#30340;&#28145;&#24230;&#27979;&#37327;&#25968;&#25454;&#65292;&#23454;&#29616;&#20102;&#22312;&#33258;&#20027;&#31227;&#21160;&#26426;&#22120;&#20154;&#20013;&#36798;&#21040;&#19982;LiDAR&#28857;&#20113;&#30456;&#23218;&#32654;&#30340;&#26144;&#23556;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2403.09477</link><description>&lt;p&gt;
&#22522;&#20110;&#35270;&#35273;&#12289;&#32418;&#22806;&#21644;&#36229;&#22768;&#27874;&#30340;&#31070;&#32463;&#36752;&#23556;&#22330;&#8212;&#8212;VIRUS-NeRF
&lt;/p&gt;
&lt;p&gt;
VIRUS-NeRF -- Vision, InfraRed and UltraSonic based Neural Radiance Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09477
&lt;/p&gt;
&lt;p&gt;
VIRUS-NeRF&#26159;&#22522;&#20110;&#35270;&#35273;&#12289;&#32418;&#22806;&#21644;&#36229;&#22768;&#27874;&#30340;&#31070;&#32463;&#36752;&#23556;&#22330;&#65292;&#36890;&#36807;&#25972;&#21512;&#36229;&#22768;&#27874;&#21644;&#32418;&#22806;&#20256;&#24863;&#22120;&#30340;&#28145;&#24230;&#27979;&#37327;&#25968;&#25454;&#65292;&#23454;&#29616;&#20102;&#22312;&#33258;&#20027;&#31227;&#21160;&#26426;&#22120;&#20154;&#20013;&#36798;&#21040;&#19982;LiDAR&#28857;&#20113;&#30456;&#23218;&#32654;&#30340;&#26144;&#23556;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20027;&#31227;&#21160;&#26426;&#22120;&#20154;&#22312;&#29616;&#20195;&#24037;&#21378;&#21644;&#20179;&#24211;&#25805;&#20316;&#20013;&#36215;&#30528;&#36234;&#26469;&#36234;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#38556;&#30861;&#29289;&#26816;&#27979;&#12289;&#22238;&#36991;&#21644;&#36335;&#24452;&#35268;&#21010;&#26159;&#20851;&#38190;&#30340;&#23433;&#20840;&#30456;&#20851;&#20219;&#21153;&#65292;&#36890;&#24120;&#20351;&#29992;&#26114;&#36149;&#30340;LiDAR&#20256;&#24863;&#22120;&#21644;&#28145;&#24230;&#25668;&#20687;&#22836;&#26469;&#35299;&#20915;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#25104;&#26412;&#25928;&#30410;&#30340;&#20302;&#20998;&#36776;&#29575;&#27979;&#36317;&#20256;&#24863;&#22120;&#65292;&#22914;&#36229;&#22768;&#27874;&#21644;&#32418;&#22806;&#26102;&#38388;&#39134;&#34892;&#20256;&#24863;&#22120;&#65292;&#36890;&#36807;&#24320;&#21457;&#22522;&#20110;&#35270;&#35273;&#12289;&#32418;&#22806;&#21644;&#36229;&#22768;&#27874;&#30340;&#31070;&#32463;&#36752;&#23556;&#22330;(VIRUS-NeRF)&#26469;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#12290;VIRUS-NeRF&#26500;&#24314;&#22312;&#30636;&#26102;&#31070;&#32463;&#22270;&#24418;&#22522;&#20803;&#19982;&#22810;&#20998;&#36776;&#29575;&#21704;&#24076;&#32534;&#30721;(Instant-NGP)&#30340;&#22522;&#30784;&#19978;&#65292;&#34701;&#21512;&#20102;&#36229;&#22768;&#27874;&#21644;&#32418;&#22806;&#20256;&#24863;&#22120;&#30340;&#28145;&#24230;&#27979;&#37327;&#25968;&#25454;&#65292;&#24182;&#21033;&#29992;&#23427;&#20204;&#26469;&#26356;&#26032;&#29992;&#20110;&#20809;&#32447;&#36319;&#36394;&#30340;&#21344;&#25454;&#32593;&#26684;&#12290;&#22312;2D&#23454;&#39564;&#35780;&#20272;&#20013;&#65292;VIRUS-NeRF&#23454;&#29616;&#20102;&#19982;LiDAR&#28857;&#20113;&#30456;&#23218;&#32654;&#30340;&#26144;&#23556;&#24615;&#33021;&#65292;&#23588;&#20854;&#22312;&#23567;&#22411;&#29615;&#22659;&#20013;&#65292;&#20854;&#20934;&#30830;&#24615;&#19982;LiDAR&#27979;&#37327;&#30456;&#31526;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09477v1 Announce Type: cross  Abstract: Autonomous mobile robots are an increasingly integral part of modern factory and warehouse operations. Obstacle detection, avoidance and path planning are critical safety-relevant tasks, which are often solved using expensive LiDAR sensors and depth cameras. We propose to use cost-effective low-resolution ranging sensors, such as ultrasonic and infrared time-of-flight sensors by developing VIRUS-NeRF - Vision, InfraRed, and UltraSonic based Neural Radiance Fields. Building upon Instant Neural Graphics Primitives with a Multiresolution Hash Encoding (Instant-NGP), VIRUS-NeRF incorporates depth measurements from ultrasonic and infrared sensors and utilizes them to update the occupancy grid used for ray marching. Experimental evaluation in 2D demonstrates that VIRUS-NeRF achieves comparable mapping performance to LiDAR point clouds regarding coverage. Notably, in small environments, its accuracy aligns with that of LiDAR measurements, whi
&lt;/p&gt;</description></item></channel></rss>