<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;LLM&#30340;&#19987;&#27880;&#25903;&#25345;&#20132;&#20114;&#27010;&#24565;&#65292;&#20351;&#26426;&#22120;&#20154;&#33021;&#22815;&#22312;&#19981;&#24178;&#25200;&#32676;&#20307;&#30340;&#24773;&#20917;&#19979;&#25903;&#25345;&#21644;&#24110;&#21161;&#20154;&#31867;&#12290;</title><link>https://arxiv.org/abs/2403.12533</link><description>&lt;p&gt;
&#26159;&#21542;&#24110;&#21161;&#65306;&#22522;&#20110;LLM&#30340;&#19987;&#27880;&#25903;&#25345;&#19982;&#20154;&#26426;&#32676;&#20307;&#20114;&#21160;
&lt;/p&gt;
&lt;p&gt;
To Help or Not to Help: LLM-based Attentive Support for Human-Robot Group Interactions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12533
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;LLM&#30340;&#19987;&#27880;&#25903;&#25345;&#20132;&#20114;&#27010;&#24565;&#65292;&#20351;&#26426;&#22120;&#20154;&#33021;&#22815;&#22312;&#19981;&#24178;&#25200;&#32676;&#20307;&#30340;&#24773;&#20917;&#19979;&#25903;&#25345;&#21644;&#24110;&#21161;&#20154;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#20154;&#22914;&#20309;&#22312;&#20154;&#31867;&#32676;&#20307;&#20013;&#25552;&#20379;&#19981;&#24341;&#20154;&#27880;&#30446;&#30340;&#29289;&#29702;&#25903;&#25345;&#65311;&#25105;&#20204;&#25552;&#20986;&#20102;Attentive Support&#65292;&#36825;&#26159;&#19968;&#20010;&#26032;&#39062;&#30340;&#26426;&#22120;&#20154;&#19982;&#20154;&#31867;&#32676;&#20307;&#36827;&#34892;&#25903;&#25345;&#30340;&#20132;&#20114;&#27010;&#24565;&#12290;&#23427;&#23558;&#22330;&#26223;&#24863;&#30693;&#12289;&#23545;&#35805;&#33719;&#21462;&#12289;&#24773;&#20917;&#29702;&#35299;&#21644;&#34892;&#20026;&#29983;&#25104;&#19982;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#24120;&#35782;&#25512;&#29702;&#33021;&#21147;&#30456;&#32467;&#21512;&#12290;&#38500;&#20102;&#36981;&#24490;&#29992;&#25143;&#30340;&#25351;&#20196;&#65292;Attentive Support&#33021;&#22815;&#20915;&#23450;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#25903;&#25345;&#20154;&#31867;&#65292;&#24182;&#22312;&#19981;&#24178;&#25200;&#32676;&#20307;&#26102;&#20445;&#25345;&#27785;&#40664;&#12290;&#36890;&#36807;&#22810;&#26679;&#21270;&#30340;&#22330;&#26223;&#65292;&#25105;&#20204;&#23637;&#31034;&#21644;&#35780;&#20272;&#20102;&#26426;&#22120;&#20154;&#30340;&#19987;&#27880;&#34892;&#20026;&#65292;&#24403;&#38656;&#35201;&#26102;&#25903;&#25345;&#21644;&#24110;&#21161;&#20154;&#31867;&#65292;&#32780;&#22914;&#26524;&#19981;&#38656;&#35201;&#24110;&#21161;&#65292;&#21017;&#19981;&#20250;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12533v1 Announce Type: cross  Abstract: How can a robot provide unobtrusive physical support within a group of humans? We present Attentive Support, a novel interaction concept for robots to support a group of humans. It combines scene perception, dialogue acquisition, situation understanding, and behavior generation with the common-sense reasoning capabilities of Large Language Models (LLMs). In addition to following user instructions, Attentive Support is capable of deciding when and how to support the humans, and when to remain silent to not disturb the group. With a diverse set of scenarios, we show and evaluate the robot's attentive behavior, which supports and helps the humans when required, while not disturbing if no help is needed.
&lt;/p&gt;</description></item></channel></rss>