<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#31062;&#21338;&#22827;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#26469;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#25511;&#21046;&#22120;&#65292;&#20197;&#21450;&#23545;&#24212;&#30340;&#26446;&#38597;&#26222;&#35834;&#22827;&#35777;&#20070;&#65292;&#20197;&#26368;&#22823;&#21270;&#21306;&#22495;&#21560;&#24341;&#21147;&#65292;&#24182;&#23562;&#37325;&#28608;&#21169;&#32422;&#26463;&#12290;</title><link>https://arxiv.org/abs/2403.08448</link><description>&lt;p&gt;
&#12298;&#22522;&#20110;&#28436;&#21592;&#35780;&#35770;&#32773;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#26446;&#38597;&#26222;&#35834;&#22827;&#25511;&#21046;&#12299;
&lt;/p&gt;
&lt;p&gt;
Actor-Critic Physics-informed Neural Lyapunov Control
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08448
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#31062;&#21338;&#22827;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#26469;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#25511;&#21046;&#22120;&#65292;&#20197;&#21450;&#23545;&#24212;&#30340;&#26446;&#38597;&#26222;&#35834;&#22827;&#35777;&#20070;&#65292;&#20197;&#26368;&#22823;&#21270;&#21306;&#22495;&#21560;&#24341;&#21147;&#65292;&#24182;&#23562;&#37325;&#28608;&#21169;&#32422;&#26463;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20855;&#26377;&#21487;&#35777;&#20445;&#35777;&#30340;&#31283;&#23450;&#21270;&#20219;&#21153;&#25511;&#21046;&#31574;&#30053;&#26159;&#38750;&#32447;&#24615;&#25511;&#21046;&#20013;&#30340;&#19968;&#20010;&#38271;&#26399;&#38382;&#39064;&#12290;&#20851;&#38190;&#30340;&#24615;&#33021;&#25351;&#26631;&#26159;&#20135;&#29983;&#21306;&#22495;&#21560;&#24341;&#21147;&#30340;&#22823;&#23567;&#65292;&#36825;&#22522;&#26412;&#19978;&#20805;&#24403;&#20102;&#23553;&#38381;&#29615;&#31995;&#32479;&#23545;&#19981;&#30830;&#23450;&#24615;&#30340;&#24377;&#24615;&#8220;&#36793;&#30028;&#8221;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#35757;&#32451;&#19968;&#20010;&#31283;&#23450;&#30340;&#31070;&#32463;&#32593;&#32476;&#25511;&#21046;&#22120;&#20197;&#21450;&#20854;&#23545;&#24212;&#30340;&#26446;&#38597;&#26222;&#35834;&#22827;&#35777;&#20070;&#65292;&#26088;&#22312;&#26368;&#22823;&#21270;&#20135;&#29983;&#30340;&#21306;&#22495;&#21560;&#24341;&#21147;&#65292;&#21516;&#26102;&#23562;&#37325;&#28608;&#21169;&#32422;&#26463;&#12290;&#25105;&#20204;&#26041;&#27861;&#30340;&#20851;&#38190;&#20043;&#22788;&#22312;&#20110;&#20351;&#29992;&#31062;&#21338;&#22827;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDE&#65289;&#65292;&#35813;&#26041;&#31243;&#31934;&#30830;&#22320;&#34920;&#24449;&#20102;&#32473;&#23450;&#25511;&#21046;&#31574;&#30053;&#30340;&#30495;&#23454;&#21306;&#22495;&#21560;&#24341;&#21147;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#36981;&#24490;&#28436;&#21592;&#35780;&#35770;&#32773;&#27169;&#24335;&#65292;&#25105;&#20204;&#22312;&#25913;&#36827;&#25511;&#21046;&#31574;&#30053;&#65288;&#28436;&#21592;&#65289;&#21644;&#23398;&#20064;&#31062;&#21338;&#22827;&#20989;&#25968;&#65288;&#35780;&#35770;&#32773;&#65289;&#20043;&#38388;&#20132;&#26367;&#36827;&#34892;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#35843;&#29992;SMT&#27714;&#35299;&#22120;&#35745;&#31639;&#20986;&#26368;&#22823;&#30340;&#21487;&#35777;&#21306;&#22495;&#21560;&#24341;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08448v1 Announce Type: new  Abstract: Designing control policies for stabilization tasks with provable guarantees is a long-standing problem in nonlinear control. A crucial performance metric is the size of the resulting region of attraction, which essentially serves as a robustness "margin" of the closed-loop system against uncertainties. In this paper, we propose a new method to train a stabilizing neural network controller along with its corresponding Lyapunov certificate, aiming to maximize the resulting region of attraction while respecting the actuation constraints. Crucial to our approach is the use of Zubov's Partial Differential Equation (PDE), which precisely characterizes the true region of attraction of a given control policy. Our framework follows an actor-critic pattern where we alternate between improving the control policy (actor) and learning a Zubov function (critic). Finally, we compute the largest certifiable region of attraction by invoking an SMT solver
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#31574;&#30053;&#32467;&#26500;&#20808;&#39564;&#30340;&#39640;&#25928;&#26410;&#30693;&#29289;&#20307;&#37325;&#26032;&#25490;&#21015;&#31995;&#32479;&#65292;&#36890;&#36807;&#20869;&#22806;&#29615;&#30340;&#23398;&#20064;&#65292;&#23454;&#29616;&#20102;&#25235;&#21462;&#12289;&#35266;&#23519;&#21644;&#25918;&#32622;&#22312;&#24863;&#30693;&#22122;&#22768;&#20013;&#30340;&#20248;&#21270;&#12290;</title><link>https://arxiv.org/abs/2402.15402</link><description>&lt;p&gt;
&#25235;&#21462;&#12289;&#35266;&#23519;&#21644;&#25918;&#32622;&#65306;&#20855;&#26377;&#31574;&#30053;&#32467;&#26500;&#20808;&#39564;&#30340;&#39640;&#25928;&#26410;&#30693;&#29289;&#20307;&#37325;&#26032;&#25490;&#21015;
&lt;/p&gt;
&lt;p&gt;
Grasp, See and Place: Efficient Unknown Object Rearrangement with Policy Structure Prior
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15402
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#31574;&#30053;&#32467;&#26500;&#20808;&#39564;&#30340;&#39640;&#25928;&#26410;&#30693;&#29289;&#20307;&#37325;&#26032;&#25490;&#21015;&#31995;&#32479;&#65292;&#36890;&#36807;&#20869;&#22806;&#29615;&#30340;&#23398;&#20064;&#65292;&#23454;&#29616;&#20102;&#25235;&#21462;&#12289;&#35266;&#23519;&#21644;&#25918;&#32622;&#22312;&#24863;&#30693;&#22122;&#22768;&#20013;&#30340;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20851;&#27880;&#26410;&#30693;&#29289;&#20307;&#37325;&#26032;&#25490;&#21015;&#20219;&#21153;&#65292;&#21363;&#26426;&#22120;&#20154;&#24212;&#37325;&#26032;&#37197;&#32622;&#29289;&#20307;&#21040;&#30001;RGB-D&#22270;&#20687;&#25351;&#23450;&#30340;&#26399;&#26395;&#30446;&#26631;&#37197;&#32622;&#20013;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#36890;&#36807;&#25972;&#21512;&#22522;&#20110;&#23398;&#20064;&#30340;&#24863;&#30693;&#27169;&#22359;&#26469;&#25506;&#32034;&#26410;&#30693;&#29289;&#20307;&#37325;&#26032;&#25490;&#21015;&#31995;&#32479;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#23545;&#24863;&#30693;&#35823;&#24046;&#25935;&#24863;&#65292;&#24182;&#19988;&#36739;&#23569;&#20851;&#27880;&#20219;&#21153;&#32423;&#24615;&#33021;&#12290;&#26412;&#25991;&#26088;&#22312;&#24320;&#21457;&#19968;&#20010;&#26377;&#25928;&#30340;&#31995;&#32479;&#65292;&#29992;&#20110;&#22312;&#24863;&#30693;&#22122;&#22768;&#20013;&#37325;&#26032;&#25490;&#21015;&#26410;&#30693;&#29289;&#20307;&#12290;&#25105;&#20204;&#22312;&#29702;&#35770;&#19978;&#25581;&#31034;&#20102;&#22122;&#22768;&#24863;&#30693;&#22914;&#20309;&#20197;&#20998;&#31163;&#30340;&#26041;&#24335;&#24433;&#21709;&#25235;&#21462;&#21644;&#25918;&#32622;&#65292;&#24182;&#23637;&#31034;&#36825;&#26679;&#30340;&#20998;&#31163;&#32467;&#26500;&#19981;&#23481;&#26131;&#25913;&#21892;&#20219;&#21153;&#30340;&#26368;&#20248;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20855;&#26377;&#20998;&#31163;&#32467;&#26500;&#20316;&#20026;&#20808;&#39564;&#30340;GSP&#65292;&#19968;&#20010;&#21452;&#29615;&#31995;&#32479;&#12290;&#23545;&#20110;&#20869;&#29615;&#65292;&#25105;&#20204;&#23398;&#20064;&#20027;&#21160;&#35266;&#23519;&#31574;&#30053;&#20197;&#25552;&#39640;&#25918;&#32622;&#30340;&#24863;&#30693;&#12290;&#23545;&#20110;&#22806;&#29615;&#65292;&#25105;&#20204;&#23398;&#20064;&#19968;&#20010;&#25235;&#21462;&#31574;&#30053;&#65292;&#24847;&#35782;&#21040;&#29289;&#20307;&#21305;&#37197;&#21644;&#25235;&#21462;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15402v1 Announce Type: cross  Abstract: We focus on the task of unknown object rearrangement, where a robot is supposed to re-configure the objects into a desired goal configuration specified by an RGB-D image. Recent works explore unknown object rearrangement systems by incorporating learning-based perception modules. However, they are sensitive to perception error, and pay less attention to task-level performance. In this paper, we aim to develop an effective system for unknown object rearrangement amidst perception noise. We theoretically reveal the noisy perception impacts grasp and place in a decoupled way, and show such a decoupled structure is non-trivial to improve task optimality. We propose GSP, a dual-loop system with the decoupled structure as prior. For the inner loop, we learn an active seeing policy for self-confident object matching to improve the perception of place. For the outer loop, we learn a grasp policy aware of object matching and grasp capability gu
&lt;/p&gt;</description></item><item><title>&#20998;&#23618;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;HiSS&#65289;&#26159;&#19968;&#31181;&#38024;&#23545;&#36830;&#32493;&#24207;&#21015;&#21040;&#24207;&#21015;&#24314;&#27169;&#30340;&#25216;&#26415;&#65292;&#23427;&#21033;&#29992;&#22534;&#21472;&#30340;&#32467;&#26500;&#21270;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#26469;&#36827;&#34892;&#39044;&#27979;&#12290;</title><link>https://arxiv.org/abs/2402.10211</link><description>&lt;p&gt;
&#38024;&#23545;&#36830;&#32493;&#24207;&#21015;&#21040;&#24207;&#21015;&#24314;&#27169;&#30340;&#20998;&#23618;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Hierarchical State Space Models for Continuous Sequence-to-Sequence Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10211
&lt;/p&gt;
&lt;p&gt;
&#20998;&#23618;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;HiSS&#65289;&#26159;&#19968;&#31181;&#38024;&#23545;&#36830;&#32493;&#24207;&#21015;&#21040;&#24207;&#21015;&#24314;&#27169;&#30340;&#25216;&#26415;&#65292;&#23427;&#21033;&#29992;&#22534;&#21472;&#30340;&#32467;&#26500;&#21270;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#26469;&#36827;&#34892;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10211v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#30340; &#25688;&#35201;&#65306;&#20174;&#21407;&#22987;&#24863;&#30693;&#25968;&#25454;&#30340;&#24207;&#21015;&#25512;&#29702;&#26159;&#20174;&#21307;&#30103;&#35774;&#22791;&#21040;&#26426;&#22120;&#20154;&#39046;&#22495;&#20013;&#26222;&#36941;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;&#36825;&#20123;&#38382;&#39064;&#24120;&#24120;&#28041;&#21450;&#20351;&#29992;&#38271;&#24207;&#21015;&#30340;&#21407;&#22987;&#20256;&#24863;&#22120;&#25968;&#25454;&#65288;&#20363;&#22914;&#30913;&#21147;&#35745;&#65292;&#21387;&#38459;&#22120;&#65289;&#26469;&#39044;&#27979;&#29702;&#24819;&#30340;&#29289;&#29702;&#37327;&#24207;&#21015;&#65288;&#20363;&#22914;&#21147;&#37327;&#65292;&#24815;&#24615;&#27979;&#37327;&#65289;&#12290;&#34429;&#28982;&#32463;&#20856;&#26041;&#27861;&#23545;&#20110;&#23616;&#37096;&#32447;&#24615;&#39044;&#27979;&#38382;&#39064;&#38750;&#24120;&#26377;&#25928;&#65292;&#20294;&#22312;&#20351;&#29992;&#23454;&#38469;&#20256;&#24863;&#22120;&#26102;&#24448;&#24448;&#34920;&#29616;&#19981;&#20339;&#12290;&#36825;&#20123;&#20256;&#24863;&#22120;&#36890;&#24120;&#26159;&#38750;&#32447;&#24615;&#30340;&#65292;&#21463;&#21040;&#22806;&#30028;&#21464;&#37327;&#65288;&#20363;&#22914;&#25391;&#21160;&#65289;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#34920;&#29616;&#20986;&#25968;&#25454;&#30456;&#20851;&#28418;&#31227;&#12290;&#23545;&#20110;&#35768;&#22810;&#38382;&#39064;&#26469;&#35828;&#65292;&#39044;&#27979;&#20219;&#21153;&#21463;&#21040;&#31232;&#32570;&#26631;&#35760;&#25968;&#25454;&#38598;&#30340;&#38480;&#21046;&#65292;&#22240;&#20026;&#33719;&#21462;&#22320;&#38754;&#30495;&#23454;&#26631;&#31614;&#38656;&#35201;&#26114;&#36149;&#30340;&#35774;&#22791;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20998;&#23618;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;HiSS&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#27010;&#24565;&#19978;&#31616;&#21333;&#12289;&#20840;&#26032;&#30340;&#36830;&#32493;&#39034;&#24207;&#39044;&#27979;&#25216;&#26415;&#12290;HiSS&#23558;&#32467;&#26500;&#21270;&#30340;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#22534;&#21472;&#22312;&#19968;&#36215;&#65292;&#20197;&#21019;&#24314;&#19968;&#20010;&#26242;&#23450;&#30340;&#39044;&#27979;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10211v1 Announce Type: new  Abstract: Reasoning from sequences of raw sensory data is a ubiquitous problem across fields ranging from medical devices to robotics. These problems often involve using long sequences of raw sensor data (e.g. magnetometers, piezoresistors) to predict sequences of desirable physical quantities (e.g. force, inertial measurements). While classical approaches are powerful for locally-linear prediction problems, they often fall short when using real-world sensors. These sensors are typically non-linear, are affected by extraneous variables (e.g. vibration), and exhibit data-dependent drift. For many problems, the prediction task is exacerbated by small labeled datasets since obtaining ground-truth labels requires expensive equipment. In this work, we present Hierarchical State-Space Models (HiSS), a conceptually simple, new technique for continuous sequential prediction. HiSS stacks structured state-space models on top of each other to create a tempor
&lt;/p&gt;</description></item></channel></rss>