<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#20171;&#32461;&#20102;&#21333;&#27493;&#32452;&#35013;&#38169;&#35823;&#26657;&#27491;&#20219;&#21153;&#21644;LEGO&#38169;&#35823;&#26657;&#27491;&#32452;&#35013;&#25968;&#25454;&#38598;&#65288;LEGO-ECA&#65289;&#65292;&#25552;&#20986;&#20102;&#29992;&#20110;&#36825;&#19968;&#20219;&#21153;&#30340;&#33258;&#26657;&#27491;&#32452;&#35013;&#32593;&#32476;&#65288;SCANet&#65289;&#12290;</title><link>https://arxiv.org/abs/2403.18195</link><description>&lt;p&gt;
&#29992;&#33258;&#26657;&#27491;&#32452;&#35013;&#32593;&#32476;&#32416;&#27491;LEGO&#32452;&#35013;&#38169;&#35823;
&lt;/p&gt;
&lt;p&gt;
SCANet: Correcting LEGO Assembly Errors with Self-Correct Assembly Network
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18195
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#21333;&#27493;&#32452;&#35013;&#38169;&#35823;&#26657;&#27491;&#20219;&#21153;&#21644;LEGO&#38169;&#35823;&#26657;&#27491;&#32452;&#35013;&#25968;&#25454;&#38598;&#65288;LEGO-ECA&#65289;&#65292;&#25552;&#20986;&#20102;&#29992;&#20110;&#36825;&#19968;&#20219;&#21153;&#30340;&#33258;&#26657;&#27491;&#32452;&#35013;&#32593;&#32476;&#65288;SCANet&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26426;&#22120;&#20154;&#23398;&#21644;3D&#35270;&#35273;&#20013;&#65292;&#33258;&#20027;&#32452;&#35013;&#38754;&#20020;&#30528;&#37325;&#22823;&#25361;&#25112;&#65292;&#23588;&#20854;&#26159;&#30830;&#20445;&#32452;&#35013;&#27491;&#30830;&#24615;&#12290;&#20027;&#27969;&#26041;&#27861;&#22914;MEPNet&#30446;&#21069;&#19987;&#27880;&#20110;&#22522;&#20110;&#25163;&#21160;&#25552;&#20379;&#30340;&#22270;&#20687;&#36827;&#34892;&#32452;&#20214;&#32452;&#35013;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#38656;&#35201;&#38271;&#26399;&#35268;&#21010;&#30340;&#20219;&#21153;&#20013;&#24448;&#24448;&#38590;&#20197;&#21462;&#24471;&#28385;&#24847;&#30340;&#32467;&#26524;&#12290;&#22312;&#21516;&#19968;&#26102;&#38388;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#25972;&#21512;&#33258;&#26657;&#27491;&#27169;&#22359;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#32531;&#35299;&#36825;&#20123;&#38382;&#39064;&#12290;&#21463;&#27492;&#38382;&#39064;&#21551;&#21457;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#21333;&#27493;&#32452;&#35013;&#38169;&#35823;&#26657;&#27491;&#20219;&#21153;&#65292;&#20854;&#20013;&#28041;&#21450;&#35782;&#21035;&#21644;&#32416;&#27491;&#32452;&#20214;&#32452;&#35013;&#38169;&#35823;&#12290;&#20026;&#25903;&#25345;&#36825;&#19968;&#39046;&#22495;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;LEGO&#38169;&#35823;&#26657;&#27491;&#32452;&#35013;&#25968;&#25454;&#38598;&#65288;LEGO-ECA&#65289;&#65292;&#21253;&#25324;&#29992;&#20110;&#32452;&#35013;&#27493;&#39588;&#21644;&#32452;&#35013;&#22833;&#36133;&#23454;&#20363;&#30340;&#25163;&#21160;&#22270;&#20687;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#33258;&#26657;&#27491;&#32452;&#35013;&#32593;&#32476;&#65288;SCANet&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#19968;&#20219;&#21153;&#12290;SCANet&#23558;&#32452;&#35013;&#30340;&#37096;&#20214;&#35270;&#20026;&#26597;&#35810;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18195v1 Announce Type: cross  Abstract: Autonomous assembly in robotics and 3D vision presents significant challenges, particularly in ensuring assembly correctness. Presently, predominant methods such as MEPNet focus on assembling components based on manually provided images. However, these approaches often fall short in achieving satisfactory results for tasks requiring long-term planning. Concurrently, we observe that integrating a self-correction module can partially alleviate such issues. Motivated by this concern, we introduce the single-step assembly error correction task, which involves identifying and rectifying misassembled components. To support research in this area, we present the LEGO Error Correction Assembly Dataset (LEGO-ECA), comprising manual images for assembly steps and instances of assembly failures. Additionally, we propose the Self-Correct Assembly Network (SCANet), a novel method to address this task. SCANet treats assembled components as queries, de
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#35299;&#20915;&#20855;&#26377;&#39640;&#32500;&#24230;&#21644;&#36830;&#32493;&#35266;&#27979;&#30340;&#37096;&#20998;&#21487;&#35266;&#27979;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#24635;&#21464;&#24046;&#36317;&#31163;&#30340;&#26032;&#22411;&#27010;&#29575;&#30028;&#38480;&#65292;&#33021;&#22815;&#31616;&#21270;&#35266;&#27979;&#27169;&#22411;&#24182;&#20445;&#35777;&#35299;&#20915;&#26041;&#26696;&#30340;&#36136;&#37327;&#12290;</title><link>http://arxiv.org/abs/2311.07745</link><description>&lt;p&gt;
&#22312;&#20855;&#26377;&#27010;&#29575;&#20445;&#35777;&#21644;&#23454;&#36341;&#30340;&#36830;&#32493;POMDP&#35268;&#21010;&#20013;&#31616;&#21270;&#22797;&#26434;&#30340;&#35266;&#27979;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Simplifying Complex Observation Models in Continuous POMDP Planning with Probabilistic Guarantees and Practice. (arXiv:2311.07745v4 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.07745
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#35299;&#20915;&#20855;&#26377;&#39640;&#32500;&#24230;&#21644;&#36830;&#32493;&#35266;&#27979;&#30340;&#37096;&#20998;&#21487;&#35266;&#27979;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#24635;&#21464;&#24046;&#36317;&#31163;&#30340;&#26032;&#22411;&#27010;&#29575;&#30028;&#38480;&#65292;&#33021;&#22815;&#31616;&#21270;&#35266;&#27979;&#27169;&#22411;&#24182;&#20445;&#35777;&#35299;&#20915;&#26041;&#26696;&#30340;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35299;&#20915;&#20855;&#26377;&#39640;&#32500;&#24230;&#21644;&#36830;&#32493;&#35266;&#27979;&#65288;&#22914;&#30456;&#26426;&#22270;&#20687;&#65289;&#30340;&#37096;&#20998;&#21487;&#35266;&#27979;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;(POMDP)&#23545;&#20110;&#35768;&#22810;&#23454;&#38469;&#26426;&#22120;&#20154;&#21644;&#35268;&#21010;&#38382;&#39064;&#26159;&#24517;&#38656;&#30340;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#24314;&#35758;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#30340;&#27010;&#29575;&#27169;&#22411;&#20316;&#20026;&#35266;&#27979;&#27169;&#22411;&#65292;&#20294;&#23427;&#20204;&#30446;&#21069;&#22312;&#32447;&#37096;&#32626;&#26102;&#35745;&#31639;&#25104;&#26412;&#36807;&#39640;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#35268;&#21010;&#20013;&#20351;&#29992;&#31616;&#21270;&#35266;&#27979;&#27169;&#22411;&#30340;&#24433;&#21709;&#65292;&#21516;&#26102;&#20445;&#25345;&#23545;&#35299;&#20915;&#26041;&#26696;&#36136;&#37327;&#30340;&#24418;&#24335;&#21270;&#20445;&#35777;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#19968;&#31181;&#22522;&#20110;&#31616;&#21270;&#27169;&#22411;&#30340;&#32479;&#35745;&#24635;&#21464;&#24046;&#36317;&#31163;&#30340;&#26032;&#22411;&#27010;&#29575;&#30028;&#38480;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#36890;&#36807;&#25512;&#24191;&#26368;&#36817;&#30340;&#31890;&#23376;&#32622;&#20449;&#24230;MDP&#38598;&#20013;&#30028;&#38480;&#30340;&#32467;&#26524;&#65292;&#23427;&#23558;&#29702;&#35770;POMDP&#20540;&#19982;&#31616;&#21270;&#27169;&#22411;&#19979;&#30340;&#23454;&#38469;&#35268;&#21010;&#20540;&#36827;&#34892;&#20102;&#32422;&#26463;&#12290;&#25105;&#20204;&#30340;&#35745;&#31639;&#21487;&#20197;&#20998;&#20026;&#31163;&#32447;&#21644;&#22312;&#32447;&#37096;&#20998;&#65292;&#24182;&#19988;&#25105;&#20204;&#21487;&#20197;&#24471;&#21040;&#24418;&#24335;&#21270;&#30340;&#20445;&#35777;&#65292;&#32780;&#26080;&#38656;
&lt;/p&gt;
&lt;p&gt;
Solving partially observable Markov decision processes (POMDPs) with high dimensional and continuous observations, such as camera images, is required for many real life robotics and planning problems. Recent researches suggested machine learned probabilistic models as observation models, but their use is currently too computationally expensive for online deployment. We deal with the question of what would be the implication of using simplified observation models for planning, while retaining formal guarantees on the quality of the solution. Our main contribution is a novel probabilistic bound based on a statistical total variation distance of the simplified model. We show that it bounds the theoretical POMDP value w.r.t. original model, from the empirical planned value with the simplified model, by generalizing recent results of particle-belief MDP concentration bounds. Our calculations can be separated into offline and online parts, and we arrive at formal guarantees without having to
&lt;/p&gt;</description></item></channel></rss>