<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#34701;&#21512;&#35270;&#35273;&#12289;&#26412;&#20307;&#24863;&#30693;&#21644;&#35821;&#35328;&#30340;&#22823;&#33041;&#21551;&#21457;&#24335;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#36890;&#36807;&#39044;&#27979;&#32534;&#30721;&#21644;&#20027;&#21160;&#25512;&#26029;&#30340;&#26694;&#26550;&#65292;&#22522;&#20110;&#33258;&#30001;&#33021;&#21407;&#29702;&#65292;&#23454;&#29616;&#20102;&#35821;&#35328;&#32452;&#21512;&#24615;&#21644;&#24863;&#35273;&#36816;&#21160;&#25216;&#33021;&#30340;&#32852;&#21512;&#21457;&#23637;&#12290;</title><link>https://arxiv.org/abs/2403.19995</link><description>&lt;p&gt;
&#36890;&#36807;&#20132;&#20114;&#23398;&#20064;&#35821;&#35328;&#21644;&#26426;&#22120;&#20154;&#21160;&#20316;&#23454;&#29616;&#32452;&#21512;&#24615;&#21644;&#27867;&#21270;&#33021;&#21147;&#30340;&#21457;&#23637;
&lt;/p&gt;
&lt;p&gt;
Development of Compositionality and Generalization through Interactive Learning of Language and Action of Robots
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19995
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#34701;&#21512;&#35270;&#35273;&#12289;&#26412;&#20307;&#24863;&#30693;&#21644;&#35821;&#35328;&#30340;&#22823;&#33041;&#21551;&#21457;&#24335;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#36890;&#36807;&#39044;&#27979;&#32534;&#30721;&#21644;&#20027;&#21160;&#25512;&#26029;&#30340;&#26694;&#26550;&#65292;&#22522;&#20110;&#33258;&#30001;&#33021;&#21407;&#29702;&#65292;&#23454;&#29616;&#20102;&#35821;&#35328;&#32452;&#21512;&#24615;&#21644;&#24863;&#35273;&#36816;&#21160;&#25216;&#33021;&#30340;&#32852;&#21512;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#31867;&#25797;&#38271;&#23558;&#23398;&#21040;&#30340;&#34892;&#20026;&#24212;&#29992;&#20110;&#26410;&#23398;&#20064;&#36807;&#30340;&#24773;&#22659;&#12290;&#36825;&#31181;&#27867;&#21270;&#34892;&#20026;&#30340;&#19968;&#20010;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#26159;&#25105;&#20204;&#33021;&#22815;&#23558;&#25972;&#20307;&#20998;&#35299;&#25104;&#21487;&#37325;&#22797;&#21033;&#29992;&#30340;&#37096;&#20998;&#30340;&#33021;&#21147;&#65292;&#21363;&#32452;&#21512;&#24615;&#12290;&#26426;&#22120;&#20154;&#39046;&#22495;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#26159;&#28041;&#21450;&#36825;&#31181;&#29305;&#24449;&#12290;&#8220;&#22312;&#20010;&#20307;&#21482;&#23398;&#20064;&#37096;&#20998;&#35821;&#35328;&#32452;&#21512;&#21450;&#20854;&#30456;&#24212;&#30340;&#24863;&#35273;&#36816;&#21160;&#27169;&#24335;&#26102;&#65292;&#22914;&#20309;&#36890;&#36807;&#32852;&#24819;&#23398;&#20064;&#21516;&#26102;&#21457;&#23637;&#35821;&#35328;&#30340;&#32452;&#21512;&#24615;&#21644;&#24863;&#35273;&#36816;&#21160;&#25216;&#33021;&#65311;&#8221;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#34701;&#21512;&#35270;&#35273;&#12289;&#26412;&#20307;&#24863;&#30693;&#21644;&#35821;&#35328;&#30340;&#22823;&#33041;&#21551;&#21457;&#24335;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#23558;&#20854;&#32435;&#20837;&#22522;&#20110;&#33258;&#30001;&#33021;&#21407;&#29702;&#30340;&#39044;&#27979;&#32534;&#30721;&#21644;&#20027;&#21160;&#25512;&#26029;&#26694;&#26550;&#20013;&#12290;&#36890;&#36807;&#19982;&#26426;&#22120;&#20154;&#25163;&#33218;&#36827;&#34892;&#30340;&#21508;&#31181;&#27169;&#25311;&#23454;&#39564;&#35780;&#20272;&#20102;&#36825;&#20010;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#21644;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#23398;&#20064;&#20013;&#23545;&#20110;&#36951;&#24536;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19995v1 Announce Type: new  Abstract: Humans excel at applying learned behavior to unlearned situations. A crucial component of this generalization behavior is our ability to compose/decompose a whole into reusable parts, an attribute known as compositionality. One of the fundamental questions in robotics concerns this characteristic. "How can linguistic compositionality be developed concomitantly with sensorimotor skills through associative learning, particularly when individuals only learn partial linguistic compositions and their corresponding sensorimotor patterns?" To address this question, we propose a brain-inspired neural network model that integrates vision, proprioception, and language into a framework of predictive coding and active inference, based on the free-energy principle. The effectiveness and capabilities of this model were assessed through various simulation experiments conducted with a robot arm. Our results show that generalization in learning to unlear
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;AutoGPT+P&#65292;&#23427;&#32467;&#21512;&#20102;&#22522;&#20110;Affordance&#30340;&#22330;&#26223;&#34920;&#31034;&#21644;&#35268;&#21010;&#31995;&#32479;&#65292;&#21487;&#20197;&#35299;&#20915;&#20855;&#26377;&#19981;&#30830;&#23450;&#24615;&#30340;&#20219;&#21153;&#35268;&#21010;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.10778</link><description>&lt;p&gt;
&#22522;&#20110;Affordance&#30340;&#20219;&#21153;&#35268;&#21010;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;AutoGPT+P
&lt;/p&gt;
&lt;p&gt;
AutoGPT+P: Affordance-based Task Planning with Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10778
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;AutoGPT+P&#65292;&#23427;&#32467;&#21512;&#20102;&#22522;&#20110;Affordance&#30340;&#22330;&#26223;&#34920;&#31034;&#21644;&#35268;&#21010;&#31995;&#32479;&#65292;&#21487;&#20197;&#35299;&#20915;&#20855;&#26377;&#19981;&#30830;&#23450;&#24615;&#30340;&#20219;&#21153;&#35268;&#21010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20851;&#20110;&#20219;&#21153;&#35268;&#21010;&#30340;&#19968;&#20123;&#26032;&#36827;&#23637;&#21033;&#29992;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#36890;&#36807;&#23558;&#36825;&#20123;&#27169;&#22411;&#19982;&#32463;&#20856;&#35268;&#21010;&#31639;&#27861;&#32467;&#21512;&#36215;&#26469;&#26469;&#25552;&#39640;&#27867;&#21270;&#33021;&#21147;&#65292;&#20197;&#35299;&#20915;&#23427;&#20204;&#22312;&#25512;&#29702;&#33021;&#21147;&#19978;&#22266;&#26377;&#30340;&#23616;&#38480;&#24615;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#38754;&#20020;&#30528;&#21160;&#24577;&#25429;&#25417;&#20219;&#21153;&#35268;&#21010;&#38382;&#39064;&#30340;&#21021;&#22987;&#29366;&#24577;&#30340;&#25361;&#25112;&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;AutoGPT+P&#65292;&#36825;&#26159;&#19968;&#20010;&#31995;&#32479;&#65292;&#23558;&#22522;&#20110;Affordance&#30340;&#22330;&#26223;&#34920;&#31034;&#19982;&#19968;&#20010;&#35268;&#21010;&#31995;&#32479;&#30456;&#32467;&#21512;&#12290;Affordance&#21253;&#25324;&#20102;&#19968;&#20010;&#20195;&#29702;&#22312;&#29615;&#22659;&#20013;&#21644;&#20854;&#20013;&#23384;&#22312;&#30340;&#29289;&#20307;&#19978;&#30340;&#21160;&#20316;&#21487;&#33021;&#24615;&#12290;&#22240;&#27492;&#65292;&#20174;&#22522;&#20110;Affordance&#30340;&#22330;&#26223;&#34920;&#31034;&#20013;&#25512;&#23548;&#20986;&#35268;&#21010;&#22495;&#65292;&#20801;&#35768;&#20351;&#29992;&#20219;&#24847;&#23545;&#35937;&#36827;&#34892;&#31526;&#21495;&#35268;&#21010;&#12290;AutoGPT+P&#21033;&#29992;&#36825;&#31181;&#34920;&#31034;&#26469;&#20026;&#29992;&#25143;&#29992;&#33258;&#28982;&#35821;&#35328;&#25351;&#23450;&#30340;&#20219;&#21153;&#21046;&#23450;&#21644;&#25191;&#34892;&#35745;&#21010;&#12290;&#38500;&#20102;&#22312;&#23553;&#38381;&#19990;&#30028;&#20551;&#35774;&#19979;&#35299;&#20915;&#35268;&#21010;&#20219;&#21153;&#22806;&#65292;AutoGPT+P&#36824;&#21487;&#20197;&#22788;&#29702;&#20855;&#26377;&#19981;&#30830;&#23450;&#24615;&#30340;&#35268;&#21010;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10778v1 Announce Type: cross  Abstract: Recent advances in task planning leverage Large Language Models (LLMs) to improve generalizability by combining such models with classical planning algorithms to address their inherent limitations in reasoning capabilities. However, these approaches face the challenge of dynamically capturing the initial state of the task planning problem. To alleviate this issue, we propose AutoGPT+P, a system that combines an affordance-based scene representation with a planning system. Affordances encompass the action possibilities of an agent on the environment and objects present in it. Thus, deriving the planning domain from an affordance-based scene representation allows symbolic planning with arbitrary objects. AutoGPT+P leverages this representation to derive and execute a plan for a task specified by the user in natural language. In addition to solving planning tasks under a closed-world assumption, AutoGPT+P can also handle planning with inc
&lt;/p&gt;</description></item><item><title>CSVTO&#26159;&#19968;&#31181;&#21463;&#38480;&#26031;&#22374;&#21464;&#20998;&#36712;&#36857;&#20248;&#21270;&#31639;&#27861;&#65292;&#23427;&#36890;&#36807;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;&#26041;&#27861;&#29983;&#25104;&#22810;&#26679;&#30340;&#32422;&#26463;&#28385;&#36275;&#36712;&#36857;&#38598;&#21512;&#65292;&#25552;&#39640;&#20102;&#22312;&#20855;&#26377;&#20219;&#24847;&#32422;&#26463;&#30340;&#38382;&#39064;&#20013;&#30340;&#20248;&#21270;&#24615;&#33021;&#21644;&#40065;&#26834;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.12110</link><description>&lt;p&gt;
&#21463;&#38480;&#26031;&#22374;&#21464;&#20998;&#36712;&#36857;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Constrained Stein Variational Trajectory Optimization. (arXiv:2308.12110v1 [cs.RO] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12110
&lt;/p&gt;
&lt;p&gt;
CSVTO&#26159;&#19968;&#31181;&#21463;&#38480;&#26031;&#22374;&#21464;&#20998;&#36712;&#36857;&#20248;&#21270;&#31639;&#27861;&#65292;&#23427;&#36890;&#36807;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;&#26041;&#27861;&#29983;&#25104;&#22810;&#26679;&#30340;&#32422;&#26463;&#28385;&#36275;&#36712;&#36857;&#38598;&#21512;&#65292;&#25552;&#39640;&#20102;&#22312;&#20855;&#26377;&#20219;&#24847;&#32422;&#26463;&#30340;&#38382;&#39064;&#20013;&#30340;&#20248;&#21270;&#24615;&#33021;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#38480;&#26031;&#22374;&#21464;&#20998;&#36712;&#36857;&#20248;&#21270;&#65288;CSVTO&#65289;&#31639;&#27861;&#65292;&#29992;&#20110;&#22312;&#19968;&#32452;&#36712;&#36857;&#19978;&#36827;&#34892;&#24102;&#32422;&#26463;&#30340;&#36712;&#36857;&#20248;&#21270;&#12290;&#25105;&#20204;&#23558;&#21463;&#38480;&#36712;&#36857;&#20248;&#21270;&#35270;&#20026;&#19968;&#31181;&#26032;&#39062;&#30340;&#23545;&#36712;&#36857;&#20998;&#24067;&#32422;&#26463;&#30340;&#20989;&#25968;&#26368;&#23567;&#21270;&#24418;&#24335;&#65292;&#36991;&#20813;&#23558;&#32422;&#26463;&#35270;&#20026;&#30446;&#26631;&#20989;&#25968;&#30340;&#24809;&#32602;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#29983;&#25104;&#22810;&#26679;&#30340;&#28385;&#36275;&#32422;&#26463;&#30340;&#36712;&#36857;&#38598;&#21512;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;&#26031;&#22374;&#21464;&#20998;&#26799;&#24230;&#19979;&#38477;&#65288;SVGD&#65289;&#23547;&#25214;&#19968;&#32452;&#31890;&#23376;&#65292;&#36817;&#20284;&#34920;&#31034;&#19968;&#20010;&#20302;&#25104;&#26412;&#36712;&#36857;&#30340;&#20998;&#24067;&#65292;&#24182;&#36981;&#23432;&#32422;&#26463;&#12290;CSVTO&#36866;&#29992;&#20110;&#20855;&#26377;&#20219;&#24847;&#31561;&#24335;&#21644;&#19981;&#31561;&#24335;&#32422;&#26463;&#30340;&#38382;&#39064;&#65292;&#24182;&#21253;&#25324;&#19968;&#31181;&#26032;&#39062;&#30340;&#31890;&#23376;&#37325;&#26032;&#37319;&#26679;&#27493;&#39588;&#26469;&#36991;&#20813;&#23616;&#37096;&#26368;&#23567;&#20540;&#12290;&#36890;&#36807;&#26126;&#30830;&#29983;&#25104;&#22810;&#26679;&#30340;&#36712;&#36857;&#38598;&#21512;&#65292;CSVTO&#33021;&#22815;&#26356;&#22909;&#22320;&#36991;&#20813;&#19981;&#33391;&#30340;&#23616;&#37096;&#26368;&#23567;&#20540;&#65292;&#24182;&#19988;&#23545;&#21021;&#22987;&#21270;&#26356;&#20855;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;CSVTO&#22312;&#20855;&#26377;&#39640;&#24230;&#32422;&#26463;&#30340;&#25361;&#25112;&#24615;&#38382;&#39064;&#19978;&#20248;&#20110;&#22522;&#32447;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present Constrained Stein Variational Trajectory Optimization (CSVTO), an algorithm for performing trajectory optimization with constraints on a set of trajectories in parallel. We frame constrained trajectory optimization as a novel form of constrained functional minimization over trajectory distributions, which avoids treating the constraints as a penalty in the objective and allows us to generate diverse sets of constraint-satisfying trajectories. Our method uses Stein Variational Gradient Descent (SVGD) to find a set of particles that approximates a distribution over low-cost trajectories while obeying constraints. CSVTO is applicable to problems with arbitrary equality and inequality constraints and includes a novel particle resampling step to escape local minima. By explicitly generating diverse sets of trajectories, CSVTO is better able to avoid poor local minima and is more robust to initialization. We demonstrate that CSVTO outperforms baselines in challenging highly-constr
&lt;/p&gt;</description></item></channel></rss>