<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#30740;&#31350;&#21457;&#23637;&#20102;EqDrive&#27169;&#22411;&#65292;&#36890;&#36807;&#20351;&#29992;EqMotion&#31561;&#21464;&#31890;&#23376;&#21644;&#20154;&#31867;&#39044;&#27979;&#27169;&#22411;&#20197;&#21450;&#22810;&#27169;&#24335;&#39044;&#27979;&#26426;&#21046;&#65292;&#22312;&#33258;&#21160;&#39550;&#39542;&#20013;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#36710;&#36742;&#36816;&#21160;&#39044;&#27979;&#12290;&#35813;&#27169;&#22411;&#22312;&#27169;&#22411;&#23481;&#37327;&#36739;&#20302;&#12289;&#21442;&#25968;&#26356;&#23569;&#12289;&#35757;&#32451;&#26102;&#38388;&#26174;&#33879;&#32553;&#30701;&#30340;&#24773;&#20917;&#19979;&#65292;&#21462;&#24471;&#20102;&#19994;&#30028;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.17540</link><description>&lt;p&gt;
EqDrive: &#33258;&#21160;&#39550;&#39542;&#30340;&#39640;&#25928;&#31561;&#21464;&#36816;&#21160;&#39044;&#27979;&#19982;&#22810;&#27169;&#24335;&#22788;&#29702;
&lt;/p&gt;
&lt;p&gt;
EqDrive: Efficient Equivariant Motion Forecasting with Multi-Modality for Autonomous Driving. (arXiv:2310.17540v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17540
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#23637;&#20102;EqDrive&#27169;&#22411;&#65292;&#36890;&#36807;&#20351;&#29992;EqMotion&#31561;&#21464;&#31890;&#23376;&#21644;&#20154;&#31867;&#39044;&#27979;&#27169;&#22411;&#20197;&#21450;&#22810;&#27169;&#24335;&#39044;&#27979;&#26426;&#21046;&#65292;&#22312;&#33258;&#21160;&#39550;&#39542;&#20013;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#36710;&#36742;&#36816;&#21160;&#39044;&#27979;&#12290;&#35813;&#27169;&#22411;&#22312;&#27169;&#22411;&#23481;&#37327;&#36739;&#20302;&#12289;&#21442;&#25968;&#26356;&#23569;&#12289;&#35757;&#32451;&#26102;&#38388;&#26174;&#33879;&#32553;&#30701;&#30340;&#24773;&#20917;&#19979;&#65292;&#21462;&#24471;&#20102;&#19994;&#30028;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#33258;&#21160;&#39550;&#39542;&#20013;&#39044;&#27979;&#36710;&#36742;&#36816;&#21160;&#38656;&#35201;&#23545;&#36710;&#36742;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#26377;&#28145;&#20837;&#30340;&#29702;&#35299;&#65292;&#24182;&#20445;&#25345;&#22312;&#27431;&#20960;&#37324;&#24471;&#20960;&#20309;&#21464;&#25442;&#19979;&#30340;&#36816;&#21160;&#31561;&#21464;&#24615;&#12290;&#20256;&#32479;&#27169;&#22411;&#24448;&#24448;&#32570;&#20047;&#22788;&#29702;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#20013;&#22797;&#26434;&#21160;&#21147;&#23398;&#21644;&#22330;&#26223;&#20013;&#21508;&#20027;&#20307;&#20043;&#38388;&#20132;&#20114;&#20851;&#31995;&#25152;&#38656;&#30340;&#22797;&#26434;&#24615;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#27169;&#22411;&#20855;&#26377;&#36739;&#20302;&#30340;&#27169;&#22411;&#23481;&#37327;&#65292;&#23548;&#33268;&#26356;&#39640;&#30340;&#39044;&#27979;&#35823;&#24046;&#21644;&#36739;&#20302;&#30340;&#35757;&#32451;&#25928;&#29575;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;EqMotion&#65292;&#19968;&#20010;&#39046;&#20808;&#30340;&#31561;&#21464;&#31890;&#23376;&#21644;&#20154;&#31867;&#39044;&#27979;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#36824;&#32771;&#34385;&#21040;&#19981;&#21464;&#30340;&#20027;&#20307;&#38388;&#30456;&#20114;&#20316;&#29992;&#65292;&#29992;&#20110;&#22810;&#20195;&#29702;&#36710;&#36742;&#36816;&#21160;&#39044;&#27979;&#20219;&#21153;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;&#22810;&#27169;&#24335;&#39044;&#27979;&#26426;&#21046;&#20197;&#27010;&#29575;&#21270;&#26041;&#24335;&#32771;&#34385;&#22810;&#20010;&#21487;&#33021;&#30340;&#26410;&#26469;&#36335;&#24452;&#12290;&#36890;&#36807;&#21033;&#29992;EqMotion&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#21442;&#25968;&#26356;&#23569;&#65288;120&#19975;&#65289;&#21644;&#35757;&#32451;&#26102;&#38388;&#26174;&#33879;&#32553;&#30701;&#65288;&#23569;&#20110;..&#65289;&#30340;&#24773;&#20917;&#19979;&#23454;&#29616;&#20102;&#19994;&#30028;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecasting vehicular motions in autonomous driving requires a deep understanding of agent interactions and the preservation of motion equivariance under Euclidean geometric transformations. Traditional models often lack the sophistication needed to handle the intricate dynamics inherent to autonomous vehicles and the interaction relationships among agents in the scene. As a result, these models have a lower model capacity, which then leads to higher prediction errors and lower training efficiency. In our research, we employ EqMotion, a leading equivariant particle, and human prediction model that also accounts for invariant agent interactions, for the task of multi-agent vehicle motion forecasting. In addition, we use a multi-modal prediction mechanism to account for multiple possible future paths in a probabilistic manner. By leveraging EqMotion, our model achieves state-of-the-art (SOTA) performance with fewer parameters (1.2 million) and a significantly reduced training time (less 
&lt;/p&gt;</description></item></channel></rss>