<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#36890;&#36807;&#30417;&#35270;&#36710;&#36742;&#30340;&#34892;&#20026;&#21644;&#29366;&#24577;&#20449;&#24687;&#26469;&#33258;&#21160;&#35782;&#21035;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#65292;&#26080;&#38656;&#36710;&#36742;&#20027;&#21160;&#36890;&#30693;&#12290;</title><link>https://arxiv.org/abs/2403.09571</link><description>&lt;p&gt;
&#20320;&#26159;&#26426;&#22120;&#20154;&#21527;&#65311;&#20174;&#34892;&#20026;&#20998;&#26512;&#20013;&#26816;&#27979;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;
&lt;/p&gt;
&lt;p&gt;
Are you a robot? Detecting Autonomous Vehicles from Behavior Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09571
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#36890;&#36807;&#30417;&#35270;&#36710;&#36742;&#30340;&#34892;&#20026;&#21644;&#29366;&#24577;&#20449;&#24687;&#26469;&#33258;&#21160;&#35782;&#21035;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#65292;&#26080;&#38656;&#36710;&#36742;&#20027;&#21160;&#36890;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#39550;&#39542;&#25216;&#26415;&#30340;&#24040;&#22823;&#28909;&#28526;&#24613;&#20999;&#22320;&#21628;&#21796;&#26032;&#20852;&#21644;&#21019;&#26032;&#25216;&#26415;&#65292;&#20197;&#25903;&#25345;&#20808;&#36827;&#30340;&#31227;&#21160;&#24615;&#20351;&#29992;&#26696;&#20363;&#12290;&#38543;&#30528;&#27773;&#36710;&#21046;&#36896;&#21830;&#19981;&#26029;&#24320;&#21457;SAE 3&#32423;&#21450;&#20197;&#19978;&#31995;&#32479;&#26469;&#25552;&#39640;&#20056;&#23458;&#30340;&#23433;&#20840;&#24615;&#21644;&#33298;&#36866;&#24615;&#65292;&#20132;&#36890;&#31649;&#29702;&#26426;&#26500;&#38656;&#35201;&#24314;&#31435;&#26032;&#31243;&#24207;&#26469;&#31649;&#29702;&#20174;&#20154;&#24037;&#39550;&#39542;&#21040;&#23436;&#20840;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#30340;&#36807;&#28193;&#65292;&#24182;&#25552;&#20379;&#19968;&#20010;&#21453;&#39304;&#26426;&#21046;&#26469;&#24494;&#35843;&#35774;&#24819;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#12290;&#22240;&#27492;&#65292;&#33258;&#21160;&#23545;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#36827;&#34892;&#33258;&#21160;&#20998;&#26512;&#24182;&#23558;&#20854;&#19982;&#20154;&#24037;&#39550;&#39542;&#36710;&#36742;&#21306;&#20998;&#24320;&#26159;&#24517;&#35201;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23436;&#25972;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#30417;&#35270;&#20351;&#29992;&#25668;&#20687;&#22836;&#22270;&#20687;&#21644;&#29366;&#24577;&#20449;&#24687;&#30340;&#27963;&#21160;&#36710;&#36742;&#65292;&#20197;&#30830;&#23450;&#36710;&#36742;&#26159;&#21542;&#20026;&#33258;&#21160;&#39550;&#39542;&#65292;&#32780;&#26080;&#38656;&#36710;&#36742;&#20027;&#21160;&#36890;&#30693;&#12290;&#22522;&#26412;&#19978;&#65292;&#23427;&#20381;&#36182;&#36710;&#36742;&#20043;&#38388;&#30340;&#21512;&#20316;&#65292;&#36825;&#20123;&#36710;&#36742;&#20849;&#20139;&#22312;&#36947;&#36335;&#19978;&#33719;&#21462;&#30340;&#25968;&#25454;&#65292;&#20379;&#26426;&#22120;&#23398;&#20064;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09571v1 Announce Type: cross  Abstract: The tremendous hype around autonomous driving is eagerly calling for emerging and novel technologies to support advanced mobility use cases. As car manufactures keep developing SAE level 3+ systems to improve the safety and comfort of passengers, traffic authorities need to establish new procedures to manage the transition from human-driven to fully-autonomous vehicles while providing a feedback-loop mechanism to fine-tune envisioned autonomous systems. Thus, a way to automatically profile autonomous vehicles and differentiate those from human-driven ones is a must. In this paper, we present a fully-fledged framework that monitors active vehicles using camera images and state information in order to determine whether vehicles are autonomous, without requiring any active notification from the vehicles themselves. Essentially, it builds on the cooperation among vehicles, which share their data acquired on the road feeding a machine learn
&lt;/p&gt;</description></item></channel></rss>