<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#26234;&#33021;&#30524;&#38236;&#19978;&#23454;&#29616;&#36229;&#39640;&#25928;&#35774;&#22791;&#20869;&#30446;&#26631;&#26816;&#27979;&#30340;&#35774;&#35745;&#21644;&#23454;&#26045;&#65292;&#21033;&#29992;&#26032;&#22411;&#20302;&#21151;&#32791;&#22788;&#29702;&#22120;&#23454;&#29616;&#23567;&#22411;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#20197;&#20415;&#22312;&#20855;&#26377;&#23567;&#23610;&#23544;&#21644;&#26377;&#38480;&#30005;&#27744;&#23481;&#37327;&#30340;&#26234;&#33021;&#30524;&#38236;&#19978;&#23454;&#29616;&#38271;&#26102;&#38388;&#36830;&#32493;&#36816;&#34892;&#12290;</title><link>http://arxiv.org/abs/2311.01057</link><description>&lt;p&gt;
&#24102;&#26377;TinyissimoYOLO&#30340;AI&#38598;&#25104;&#26234;&#33021;&#30524;&#38236;&#19978;&#30340;&#36229;&#39640;&#25928;&#35774;&#22791;&#20869;&#30446;&#26631;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Ultra-Efficient On-Device Object Detection on AI-Integrated Smart Glasses with TinyissimoYOLO. (arXiv:2311.01057v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01057
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#26234;&#33021;&#30524;&#38236;&#19978;&#23454;&#29616;&#36229;&#39640;&#25928;&#35774;&#22791;&#20869;&#30446;&#26631;&#26816;&#27979;&#30340;&#35774;&#35745;&#21644;&#23454;&#26045;&#65292;&#21033;&#29992;&#26032;&#22411;&#20302;&#21151;&#32791;&#22788;&#29702;&#22120;&#23454;&#29616;&#23567;&#22411;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#65292;&#20197;&#20415;&#22312;&#20855;&#26377;&#23567;&#23610;&#23544;&#21644;&#26377;&#38480;&#30005;&#27744;&#23481;&#37327;&#30340;&#26234;&#33021;&#30524;&#38236;&#19978;&#23454;&#29616;&#38271;&#26102;&#38388;&#36830;&#32493;&#36816;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26234;&#33021;&#30524;&#38236;&#20511;&#21161;&#23574;&#31471;&#35745;&#31639;&#25216;&#26415;&#12289;&#21152;&#36895;&#30828;&#20214;&#26550;&#26500;&#21644;&#23567;&#22411;AI&#31639;&#27861;&#65292;&#27491;&#36805;&#36895;&#33719;&#24471;&#20808;&#36827;&#21151;&#33021;&#12290;&#22312;&#38754;&#21521;&#20840;&#22825;&#20351;&#29992;&#20197;&#23454;&#29616;&#28385;&#24847;&#29992;&#25143;&#20307;&#39564;&#26102;&#65292;&#23558;AI&#38598;&#25104;&#21040;&#20855;&#26377;&#23567;&#23610;&#23544;&#21644;&#26377;&#38480;&#30005;&#27744;&#23481;&#37327;&#30340;&#26234;&#33021;&#30524;&#38236;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#38416;&#36848;&#20102;&#21033;&#29992;&#26032;&#22411;&#20302;&#21151;&#32791;&#22788;&#29702;&#22120;&#23454;&#29616;&#23567;&#22411;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#35774;&#35745;&#21644;&#23454;&#29616;&#65292;&#20197;&#22312;&#26234;&#33021;&#30524;&#38236;&#20013;&#23454;&#29616;&#38271;&#26102;&#38388;&#36830;&#32493;&#36816;&#34892;&#12290;&#25105;&#20204;&#25506;&#32034;&#20102;&#26234;&#33021;&#30524;&#38236;&#22312;&#23454;&#26102;&#30446;&#26631;&#26816;&#27979;&#24773;&#20917;&#19979;&#30340;&#33021;&#37327;&#21644;&#26102;&#24310;&#25928;&#29575;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#26234;&#33021;&#30524;&#38236;&#21407;&#22411;&#20316;&#20026;&#30740;&#31350;&#24179;&#21488;&#65292;&#20854;&#20013;&#21253;&#25324;&#20004;&#20010;&#24494;&#25511;&#21046;&#22120;&#65292;&#21253;&#25324;&#19968;&#20010;&#20855;&#26377;&#35270;&#35273;AI&#30828;&#20214;&#21152;&#36895;&#22120;&#30340;&#26032;&#22411;&#27627;&#29926;&#32423;&#21151;&#29575;RISC-V&#24182;&#34892;&#22788;&#29702;&#22120;&#65292;&#20197;&#21450;&#19968;&#20010;&#29992;&#20110;&#36890;&#20449;&#30340;&#20302;&#21151;&#32791;&#34013;&#29273;&#27169;&#22359;&#12290;&#26234;&#33021;&#30524;&#38236;&#38598;&#25104;&#20102;&#22270;&#20687;&#21644;&#38899;&#39057;&#24863;&#24212;&#25509;&#21475;&#31561;&#30005;&#28304;&#24490;&#29615;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Smart glasses are rapidly gaining advanced functionality thanks to cutting-edge computing technologies, accelerated hardware architectures, and tiny AI algorithms. Integrating AI into smart glasses featuring a small form factor and limited battery capacity is still challenging when targeting full-day usage for a satisfactory user experience. This paper illustrates the design and implementation of tiny machine-learning algorithms exploiting novel low-power processors to enable prolonged continuous operation in smart glasses. We explore the energy- and latency-efficient of smart glasses in the case of real-time object detection. To this goal, we designed a smart glasses prototype as a research platform featuring two microcontrollers, including a novel milliwatt-power RISC-V parallel processor with a hardware accelerator for visual AI, and a Bluetooth low-power module for communication. The smart glasses integrate power cycling mechanisms, including image and audio sensing interfaces. Fur
&lt;/p&gt;</description></item></channel></rss>