<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#21160;&#24577;&#24341;&#23548;&#25193;&#25955;&#27169;&#22411;&#65292;&#21033;&#29992;&#20849;&#20139;&#30340;&#21160;&#21147;&#23398;&#32593;&#32476;&#20026;&#19981;&#21516;&#25805;&#20316;&#20219;&#21153;&#29983;&#25104; manipulator &#20960;&#20309;&#35774;&#35745;&#65292;&#36890;&#36807;&#35774;&#35745;&#30446;&#26631;&#26500;&#24314;&#30340;&#26799;&#24230;&#24341;&#23548;&#25163;&#25351;&#20960;&#20309;&#35774;&#35745;&#30340;&#23436;&#21892;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.15038</link><description>&lt;p&gt;
&#21160;&#24577;&#24341;&#23548;&#25193;&#25955;&#27169;&#22411;&#29992;&#20110;&#26426;&#22120;&#20154; manipulator &#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Dynamics-Guided Diffusion Model for Robot Manipulator Design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15038
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#21160;&#24577;&#24341;&#23548;&#25193;&#25955;&#27169;&#22411;&#65292;&#21033;&#29992;&#20849;&#20139;&#30340;&#21160;&#21147;&#23398;&#32593;&#32476;&#20026;&#19981;&#21516;&#25805;&#20316;&#20219;&#21153;&#29983;&#25104; manipulator &#20960;&#20309;&#35774;&#35745;&#65292;&#36890;&#36807;&#35774;&#35745;&#30446;&#26631;&#26500;&#24314;&#30340;&#26799;&#24230;&#24341;&#23548;&#25163;&#25351;&#20960;&#20309;&#35774;&#35745;&#30340;&#23436;&#21892;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;&#21160;&#24577;&#24341;&#23548;&#25193;&#25955;&#27169;&#22411;&#30340;&#25968;&#25454;&#39537;&#21160;&#26694;&#26550;&#65292;&#29992;&#20110;&#20026;&#32473;&#23450;&#25805;&#20316;&#20219;&#21153;&#29983;&#25104; manipulator &#20960;&#20309;&#35774;&#35745;&#12290;&#19982;&#20026;&#27599;&#20010;&#20219;&#21153;&#35757;&#32451;&#19981;&#21516;&#30340;&#35774;&#35745;&#27169;&#22411;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#37319;&#29992;&#19968;&#20010;&#36328;&#20219;&#21153;&#20849;&#20139;&#30340;&#23398;&#20064;&#21160;&#21147;&#23398;&#32593;&#32476;&#12290;&#23545;&#20110;&#26032;&#30340;&#25805;&#20316;&#20219;&#21153;&#65292;&#25105;&#20204;&#39318;&#20808;&#23558;&#20854;&#20998;&#35299;&#20026;&#19968;&#32452;&#31216;&#20026;&#30446;&#26631;&#30456;&#20114;&#20316;&#29992;&#37197;&#32622;&#25991;&#20214;&#30340;&#20010;&#21035;&#36816;&#21160;&#30446;&#26631;&#65292;&#20854;&#20013;&#27599;&#20010;&#20010;&#21035;&#36816;&#21160;&#21487;&#20197;&#30001;&#20849;&#20139;&#30340;&#21160;&#21147;&#23398;&#32593;&#32476;&#24314;&#27169;&#12290;&#20174;&#30446;&#26631;&#21644;&#39044;&#27979;&#30340;&#30456;&#20114;&#20316;&#29992;&#37197;&#32622;&#25991;&#20214;&#26500;&#24314;&#30340;&#35774;&#35745;&#30446;&#26631;&#20026;&#20219;&#21153;&#30340;&#25163;&#25351;&#20960;&#20309;&#35774;&#35745;&#25552;&#20379;&#20102;&#26799;&#24230;&#24341;&#23548;&#12290;&#36825;&#20010;&#35774;&#35745;&#36807;&#31243;&#34987;&#25191;&#34892;&#20026;&#19968;&#31181;&#20998;&#31867;&#22120;&#24341;&#23548;&#30340;&#25193;&#25955;&#36807;&#31243;&#65292;&#20854;&#20013;&#35774;&#35745;&#30446;&#26631;&#20316;&#20026;&#20998;&#31867;&#22120;&#24341;&#23548;&#12290;&#25105;&#20204;&#22312;&#21482;&#20351;&#29992;&#24320;&#29615;&#24179;&#34892;&#22841;&#29226;&#36816;&#21160;&#30340;&#26080;&#20256;&#24863;&#22120;&#35774;&#32622;&#19979;&#65292;&#22312;&#21508;&#31181;&#25805;&#20316;&#20219;&#21153;&#19978;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15038v1 Announce Type: cross  Abstract: We present Dynamics-Guided Diffusion Model, a data-driven framework for generating manipulator geometry designs for a given manipulation task. Instead of training different design models for each task, our approach employs a learned dynamics network shared across tasks. For a new manipulation task, we first decompose it into a collection of individual motion targets which we call target interaction profile, where each individual motion can be modeled by the shared dynamics network. The design objective constructed from the target and predicted interaction profiles provides a gradient to guide the refinement of finger geometry for the task. This refinement process is executed as a classifier-guided diffusion process, where the design objective acts as the classifier guidance. We evaluate our framework on various manipulation tasks, under the sensor-less setting using only an open-loop parallel jaw motion. Our generated designs outperfor
&lt;/p&gt;</description></item></channel></rss>