<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102; GUTS &#31639;&#27861;&#65292;&#33021;&#22815;&#22312;&#24322;&#26500;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#37096;&#32626;&#65292;&#35299;&#20915;&#22823;&#22411;&#38750;&#32467;&#26500;&#21270;&#29615;&#22659;&#19979;&#30340;&#20027;&#21160;&#25628;&#32034;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#20256;&#24863;&#22120;&#19981;&#30830;&#23450;&#24615;&#12289;&#36974;&#25377;&#38382;&#39064;&#12289;&#24322;&#26500;&#25628;&#32034;&#22242;&#38431;&#21644;&#30828;&#20214;&#12289;&#36890;&#20449;&#25925;&#38556;&#30340;&#40065;&#26834;&#24615;&#31561;&#38382;&#39064;&#65292;&#24182;&#22312;&#20223;&#30495;&#20013;&#36229;&#36807;&#29616;&#26377;&#31639;&#27861;&#39640;&#36798;80%&#12290;</title><link>http://arxiv.org/abs/2304.02075</link><description>&lt;p&gt;
GUTS&#65306;&#22810;&#26234;&#33021;&#20307;&#20027;&#21160;&#25628;&#32034;&#30340;&#24191;&#20041;&#19981;&#30830;&#23450;&#24615;&#24863;&#30693; Thompson Sampling&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
GUTS: Generalized Uncertainty-Aware Thompson Sampling for Multi-Agent Active Search. (arXiv:2304.02075v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02075
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102; GUTS &#31639;&#27861;&#65292;&#33021;&#22815;&#22312;&#24322;&#26500;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#37096;&#32626;&#65292;&#35299;&#20915;&#22823;&#22411;&#38750;&#32467;&#26500;&#21270;&#29615;&#22659;&#19979;&#30340;&#20027;&#21160;&#25628;&#32034;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#20256;&#24863;&#22120;&#19981;&#30830;&#23450;&#24615;&#12289;&#36974;&#25377;&#38382;&#39064;&#12289;&#24322;&#26500;&#25628;&#32034;&#22242;&#38431;&#21644;&#30828;&#20214;&#12289;&#36890;&#20449;&#25925;&#38556;&#30340;&#40065;&#26834;&#24615;&#31561;&#38382;&#39064;&#65292;&#24182;&#22312;&#20223;&#30495;&#20013;&#36229;&#36807;&#29616;&#26377;&#31639;&#27861;&#39640;&#36798;80%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24555;&#36895;&#28798;&#38590;&#21709;&#24212;&#30340;&#26426;&#22120;&#20154;&#35299;&#20915;&#26041;&#26696;&#23545;&#30830;&#20445;&#26368;&#23567;&#29983;&#21629;&#25439;&#22833;&#33267;&#20851;&#37325;&#35201;&#65292;&#29305;&#21035;&#26159;&#24403;&#25628;&#32034;&#21306;&#22495;&#23545;&#20110;&#20154;&#31867;&#25937;&#25588;&#32773;&#32780;&#35328;&#36807;&#20110;&#21361;&#38505;&#25110;&#36807;&#20110;&#24191;&#38420;&#26102;&#12290;&#26412;&#25991;&#23558;&#36825;&#20010;&#38382;&#39064;&#24314;&#27169;&#20026;&#19968;&#20010;&#24322;&#27493;&#22810;&#26234;&#33021;&#20307;&#20027;&#21160;&#25628;&#32034;&#20219;&#21153;&#65292;&#22312;&#27492;&#20219;&#21153;&#20013;&#65292;&#27599;&#20010;&#26426;&#22120;&#20154;&#26088;&#22312;&#39640;&#25928;&#22320;&#22312;&#26410;&#30693;&#29615;&#22659;&#20013;&#23547;&#25214;&#24863;&#20852;&#36259;&#30340;&#23545;&#35937;&#65288;OOI&#65289;&#12290;&#36825;&#31181;&#34920;&#36848;&#35299;&#20915;&#20102;&#25628;&#32034;&#20219;&#21153;&#24212;&#35813;&#19987;&#27880;&#20110;&#24555;&#36895;&#24674;&#22797;OOI&#32780;&#19981;&#26159;&#23545;&#25628;&#32034;&#21306;&#22495;&#36827;&#34892;&#20840;&#35206;&#30422;&#30340;&#35201;&#27714;&#12290;&#20808;&#21069;&#30340;&#26041;&#27861;&#26410;&#33021;&#20934;&#30830;&#24314;&#27169;&#20256;&#24863;&#22120;&#19981;&#30830;&#23450;&#24615;&#65292;&#32771;&#34385;&#21040;&#30001;&#20110;&#26893;&#34987;&#25110;&#22320;&#24418;&#30340;&#36974;&#25377;&#32780;&#23548;&#33268;&#30340;&#36974;&#25377;&#38382;&#39064;&#65292;&#25110;&#32773;&#32771;&#34385;&#21040;&#24322;&#26500;&#25628;&#32034;&#22242;&#38431;&#21644;&#30828;&#20214;&#12289;&#36890;&#20449;&#25925;&#38556;&#30340;&#40065;&#26834;&#24615;&#35201;&#27714;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#24191;&#20041;&#19981;&#30830;&#23450;&#24615;&#24863;&#30693;Thompson&#25277;&#26679;&#65288;GUTS&#65289;&#31639;&#27861;&#65292;&#23427;&#35299;&#20915;&#20102;&#36825;&#20123;&#38382;&#39064;&#65292;&#24182;&#36866;&#29992;&#20110;&#22312;&#22823;&#22411;&#38750;&#32467;&#26500;&#21270;&#29615;&#22659;&#20013;&#37096;&#32626;&#24322;&#26500;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#36827;&#34892;&#20027;&#21160;&#25628;&#32034;&#12290;&#25105;&#20204;&#36890;&#36807;&#20223;&#30495;&#23454;&#39564;&#34920;&#26126;&#65292;GUTS&#31639;&#27861;&#22312;&#24615;&#33021;&#19978;&#36229;&#36807;&#29616;&#26377;&#31639;&#27861;&#39640;&#36798;80%&#12290;
&lt;/p&gt;
&lt;p&gt;
Robotic solutions for quick disaster response are essential to ensure minimal loss of life, especially when the search area is too dangerous or too vast for human rescuers. We model this problem as an asynchronous multi-agent active-search task where each robot aims to efficiently seek objects of interest (OOIs) in an unknown environment. This formulation addresses the requirement that search missions should focus on quick recovery of OOIs rather than full coverage of the search region. Previous approaches fail to accurately model sensing uncertainty, account for occlusions due to foliage or terrain, or consider the requirement for heterogeneous search teams and robustness to hardware and communication failures. We present the Generalized Uncertainty-aware Thompson Sampling (GUTS) algorithm, which addresses these issues and is suitable for deployment on heterogeneous multi-robot systems for active search in large unstructured environments. We show through simulation experiments that GU
&lt;/p&gt;</description></item></channel></rss>