<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22810;&#20445;&#30495;&#24230;&#35757;&#32451;&#30340;&#26426;&#22120;&#20154;&#20195;&#29702;&#20849;&#35774;&#35745;&#30340;&#26679;&#26412;&#39640;&#25928;&#26041;&#27861;&#65292;&#36890;&#36807;&#22312;&#35774;&#35745;&#31354;&#38388;&#20013;&#20849;&#20139;&#23398;&#20064;&#21040;&#30340;&#25511;&#21046;&#22120;&#65292;&#20197;&#21450;&#36890;&#36807;&#29305;&#23450;&#26041;&#24335;&#36941;&#21382;&#35774;&#35745;&#30697;&#38453;&#65292;&#21487;&#20197;&#25552;&#39640;&#35774;&#35745;&#35780;&#20272;&#30340;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2309.04085</link><description>&lt;p&gt;
&#20351;&#29992;&#22810;&#20445;&#30495;&#24230;&#35757;&#32451;&#22312;&#36890;&#29992;&#31574;&#30053;&#32593;&#32476;&#19978;&#30340;&#26426;&#22120;&#20154;&#20195;&#29702;&#20849;&#35774;&#35745;&#30340;&#26679;&#26412;&#39640;&#25928;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Sample-Efficient Co-Design of Robotic Agents Using Multi-fidelity Training on Universal Policy Network. (arXiv:2309.04085v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04085
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22810;&#20445;&#30495;&#24230;&#35757;&#32451;&#30340;&#26426;&#22120;&#20154;&#20195;&#29702;&#20849;&#35774;&#35745;&#30340;&#26679;&#26412;&#39640;&#25928;&#26041;&#27861;&#65292;&#36890;&#36807;&#22312;&#35774;&#35745;&#31354;&#38388;&#20013;&#20849;&#20139;&#23398;&#20064;&#21040;&#30340;&#25511;&#21046;&#22120;&#65292;&#20197;&#21450;&#36890;&#36807;&#29305;&#23450;&#26041;&#24335;&#36941;&#21382;&#35774;&#35745;&#30697;&#38453;&#65292;&#21487;&#20197;&#25552;&#39640;&#35774;&#35745;&#35780;&#20272;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#35774;&#35745;&#28041;&#21450;&#21516;&#26102;&#20248;&#21270;&#25511;&#21046;&#22120;&#21644;&#20195;&#29702;&#29289;&#29702;&#35774;&#35745;&#12290;&#20854;&#22266;&#26377;&#30340;&#21452;&#23618;&#20248;&#21270;&#24418;&#24335;&#35201;&#27714;&#36890;&#36807;&#20869;&#23618;&#25511;&#21046;&#20248;&#21270;&#26469;&#39537;&#21160;&#22806;&#23618;&#35774;&#35745;&#20248;&#21270;&#12290;&#24403;&#35774;&#35745;&#31354;&#38388;&#36739;&#22823;&#19988;&#27599;&#20010;&#35774;&#35745;&#35780;&#20272;&#37117;&#28041;&#21450;&#25968;&#25454;&#23494;&#38598;&#22411;&#30340;&#24378;&#21270;&#23398;&#20064;&#36807;&#31243;&#26102;&#65292;&#36825;&#21487;&#33021;&#20250;&#24102;&#26469;&#25361;&#25112;&#12290;&#20026;&#20102;&#25552;&#39640;&#26679;&#26412;&#25928;&#29575;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Hyperband&#30340;&#22810;&#20445;&#30495;&#24230;&#35774;&#35745;&#25506;&#32034;&#31574;&#30053;&#65292;&#22312;&#35774;&#35745;&#31354;&#38388;&#20013;&#36890;&#36807;&#36890;&#29992;&#31574;&#30053;&#23398;&#20064;&#32773;&#23558;&#23398;&#20064;&#21040;&#30340;&#25511;&#21046;&#22120;&#36827;&#34892;&#20851;&#32852;&#65292;&#20197;&#21551;&#21160;&#21518;&#32493;&#25511;&#21046;&#22120;&#23398;&#20064;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25512;&#33616;&#19968;&#31181;&#29305;&#23450;&#30340;&#36941;&#21382;Hyperband&#29983;&#25104;&#30340;&#35774;&#35745;&#30697;&#38453;&#30340;&#26041;&#24335;&#65292;&#20197;&#30830;&#20445;&#38543;&#30528;&#27599;&#20010;&#26032;&#30340;&#35774;&#35745;&#35780;&#20272;&#65292;&#36890;&#29992;&#31574;&#30053;&#23398;&#20064;&#32773;&#30340;&#22686;&#24378;&#25928;&#26524;&#36234;&#26469;&#36234;&#24378;&#65292;&#20174;&#32780;&#38477;&#20302;Hyperband&#30340;&#38543;&#26426;&#24615;&#12290;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#22312;&#24191;&#27867;&#30340;&#24180;&#40836;&#33539;&#22260;&#20869;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Co-design involves simultaneously optimizing the controller and agents physical design. Its inherent bi-level optimization formulation necessitates an outer loop design optimization driven by an inner loop control optimization. This can be challenging when the design space is large and each design evaluation involves data-intensive reinforcement learning process for control optimization. To improve the sample-efficiency we propose a multi-fidelity-based design exploration strategy based on Hyperband where we tie the controllers learnt across the design spaces through a universal policy learner for warm-starting the subsequent controller learning problems. Further, we recommend a particular way of traversing the Hyperband generated design matrix that ensures that the stochasticity of the Hyperband is reduced the most with the increasing warm starting effect of the universal policy learner as it is strengthened with each new design evaluation. Experiments performed on a wide range of age
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#25511;&#21046;&#21644;&#21327;&#35843;&#28151;&#21512;&#20132;&#36890;&#65292;&#29305;&#21035;&#26159;&#20154;&#39550;&#39542;&#36710;&#36742;&#21644;&#26426;&#22120;&#20154;&#36710;&#36742;&#22312;&#23454;&#38469;&#22797;&#26434;&#20132;&#21449;&#21475;&#30340;&#24212;&#29992;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#29992;5%&#30340;&#26426;&#22120;&#20154;&#36710;&#36742;&#21487;&#20197;&#26377;&#25928;&#38450;&#27490;&#20132;&#21449;&#21475;&#20869;&#30340;&#25317;&#22581;&#24418;&#25104;&#12290;</title><link>http://arxiv.org/abs/2301.05294</link><description>&lt;p&gt;
&#36890;&#36807;&#26426;&#22120;&#20154;&#36710;&#36742;&#22312;&#22797;&#26434;&#21644;&#26080;&#20449;&#21495;&#30340;&#20132;&#21449;&#21475;&#20013;&#23398;&#20064;&#25511;&#21046;&#21644;&#21327;&#35843;&#28151;&#21512;&#20132;&#36890;
&lt;/p&gt;
&lt;p&gt;
Learning to Control and Coordinate Mixed Traffic Through Robot Vehicles at Complex and Unsignalized Intersections. (arXiv:2301.05294v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05294
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#25511;&#21046;&#21644;&#21327;&#35843;&#28151;&#21512;&#20132;&#36890;&#65292;&#29305;&#21035;&#26159;&#20154;&#39550;&#39542;&#36710;&#36742;&#21644;&#26426;&#22120;&#20154;&#36710;&#36742;&#22312;&#23454;&#38469;&#22797;&#26434;&#20132;&#21449;&#21475;&#30340;&#24212;&#29992;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#20351;&#29992;5%&#30340;&#26426;&#22120;&#20154;&#36710;&#36742;&#21487;&#20197;&#26377;&#25928;&#38450;&#27490;&#20132;&#21449;&#21475;&#20869;&#30340;&#25317;&#22581;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20132;&#21449;&#21475;&#26159;&#29616;&#20195;&#22823;&#37117;&#24066;&#20132;&#36890;&#20013;&#24517;&#19981;&#21487;&#23569;&#30340;&#36947;&#36335;&#22522;&#30784;&#35774;&#26045;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20132;&#36890;&#20107;&#25925;&#25110;&#32570;&#20047;&#20132;&#36890;&#21327;&#35843;&#26426;&#21046;&#65288;&#22914;&#20132;&#36890;&#20449;&#21495;&#28783;&#65289;&#65292;&#23427;&#20204;&#20063;&#21487;&#33021;&#25104;&#20026;&#20132;&#36890;&#27969;&#30340;&#29942;&#39048;&#12290;&#26368;&#36817;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#36229;&#36234;&#20256;&#32479;&#25511;&#21046;&#26041;&#27861;&#30340;&#25511;&#21046;&#21644;&#21327;&#35843;&#26426;&#21046;&#65292;&#20197;&#25552;&#39640;&#20132;&#21449;&#21475;&#20132;&#36890;&#30340;&#25928;&#29575;&#12290;&#22312;&#36825;&#20123;&#26041;&#27861;&#20013;&#65292;&#25511;&#21046;&#21487;&#39044;&#35265;&#30340;&#21253;&#21547;&#20154;&#39550;&#39542;&#36710;&#36742;&#65288;HVs&#65289;&#21644;&#26426;&#22120;&#20154;&#36710;&#36742;&#65288;RVs&#65289;&#30340;&#28151;&#21512;&#20132;&#36890;&#24050;&#32463;&#20986;&#29616;&#12290;&#22312;&#26412;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#30340;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#23454;&#38469;&#22797;&#26434;&#20132;&#21449;&#21475;&#30340;&#28151;&#21512;&#20132;&#36890;&#30340;&#25511;&#21046;&#21644;&#21327;&#35843;&#65292;&#36825;&#26159;&#19968;&#20010;&#20197;&#21069;&#26410;&#34987;&#25506;&#32034;&#36807;&#30340;&#20027;&#39064;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#23454;&#39564;&#65292;&#20197;&#23637;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#23454;&#38469;&#20132;&#36890;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;5%&#30340;RVs&#65292;&#25105;&#20204;&#21487;&#20197;&#38450;&#27490;&#22797;&#26434;&#20132;&#21449;&#21475;&#20869;&#30340;&#25317;&#22581;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intersections are essential road infrastructures for traffic in modern metropolises. However, they can also be the bottleneck of traffic flows as a result of traffic incidents or the absence of traffic coordination mechanisms such as traffic lights. Recently, various control and coordination mechanisms that are beyond traditional control methods have been proposed to improve the efficiency of intersection traffic. Amongst these methods, the control of foreseeable mixed traffic that consists of human-driven vehicles (HVs) and robot vehicles (RVs) has emerged. In this project, we propose a decentralized multi-agent reinforcement learning approach for the control and coordination of mixed traffic at real-world, complex intersections--a topic that has not been previously explored. Comprehensive experiments are conducted to show the effectiveness of our approach. In particular, we show that using 5% RVs, we can prevent congestion formation inside a complex intersection under the actual traf
&lt;/p&gt;</description></item></channel></rss>