<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>NeuPAN &#26159;&#19968;&#31181;&#23454;&#26102;&#12289;&#39640;&#24230;&#20934;&#30830;&#12289;&#26080;&#22320;&#22270;&#12289;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#19988;&#23545;&#29615;&#22659;&#19981;&#21464;&#30340;&#26426;&#22120;&#20154;&#23548;&#33322;&#35299;&#20915;&#26041;&#26696;&#65292;&#26368;&#22823;&#30340;&#21019;&#26032;&#22312;&#20110;&#23558;&#21407;&#22987;&#28857;&#30452;&#25509;&#26144;&#23556;&#21040;&#23398;&#20064;&#21040;&#30340;&#22810;&#24103;&#36317;&#31163;&#31354;&#38388;&#65292;&#24182;&#20855;&#26377;&#31471;&#21040;&#31471;&#27169;&#22411;&#23398;&#20064;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#21487;&#35777;&#26126;&#30340;&#25910;&#25947;&#12290;</title><link>https://arxiv.org/abs/2403.06828</link><description>&lt;p&gt;
NeuPAN:&#30452;&#25509;&#28857;&#26426;&#22120;&#20154;&#23548;&#33322;&#30340;&#31471;&#21040;&#31471;&#22522;&#20110;&#27169;&#22411;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
NeuPAN: Direct Point Robot Navigation with End-to-End Model-based Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06828
&lt;/p&gt;
&lt;p&gt;
NeuPAN &#26159;&#19968;&#31181;&#23454;&#26102;&#12289;&#39640;&#24230;&#20934;&#30830;&#12289;&#26080;&#22320;&#22270;&#12289;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#19988;&#23545;&#29615;&#22659;&#19981;&#21464;&#30340;&#26426;&#22120;&#20154;&#23548;&#33322;&#35299;&#20915;&#26041;&#26696;&#65292;&#26368;&#22823;&#30340;&#21019;&#26032;&#22312;&#20110;&#23558;&#21407;&#22987;&#28857;&#30452;&#25509;&#26144;&#23556;&#21040;&#23398;&#20064;&#21040;&#30340;&#22810;&#24103;&#36317;&#31163;&#31354;&#38388;&#65292;&#24182;&#20855;&#26377;&#31471;&#21040;&#31471;&#27169;&#22411;&#23398;&#20064;&#30340;&#21487;&#35299;&#37322;&#24615;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#21487;&#35777;&#26126;&#30340;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25317;&#25380;&#29615;&#22659;&#20013;&#23545;&#38750;&#20840;&#21521;&#26426;&#22120;&#20154;&#36827;&#34892;&#23548;&#33322;&#38656;&#35201;&#26497;&#20854;&#31934;&#30830;&#30340;&#24863;&#30693;&#21644;&#36816;&#21160;&#20197;&#36991;&#20813;&#30896;&#25758;&#12290;&#26412;&#25991;&#25552;&#20986;NeuPAN&#65306;&#19968;&#31181;&#23454;&#26102;&#12289;&#39640;&#24230;&#20934;&#30830;&#12289;&#26080;&#22320;&#22270;&#12289;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#20154;&#65292;&#19988;&#23545;&#29615;&#22659;&#19981;&#21464;&#30340;&#26426;&#22120;&#20154;&#23548;&#33322;&#35299;&#20915;&#26041;&#26696;&#12290;NeuPAN&#37319;&#29992;&#32039;&#32806;&#21512;&#30340;&#24863;&#30693;-&#36816;&#21160;&#26694;&#26550;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#26377;&#20004;&#20010;&#20851;&#38190;&#21019;&#26032;&#65306;1&#65289;&#23427;&#30452;&#25509;&#23558;&#21407;&#22987;&#28857;&#26144;&#23556;&#21040;&#23398;&#20064;&#21040;&#30340;&#22810;&#24103;&#36317;&#31163;&#31354;&#38388;&#65292;&#36991;&#20813;&#20102;&#20174;&#24863;&#30693;&#21040;&#25511;&#21046;&#30340;&#35823;&#24046;&#20256;&#25773;&#65307;2&#65289;&#20174;&#31471;&#21040;&#31471;&#22522;&#20110;&#27169;&#22411;&#23398;&#20064;&#30340;&#35282;&#24230;&#36827;&#34892;&#35299;&#37322;&#65292;&#23454;&#29616;&#20102;&#21487;&#35777;&#26126;&#30340;&#25910;&#25947;&#12290;NeuPAN&#30340;&#20851;&#38190;&#22312;&#20110;&#21033;&#29992;&#25554;&#25300;&#24335;&#65288;PnP&#65289;&#20132;&#26367;&#26368;&#23567;&#21270;&#20256;&#24863;&#22120;&#65288;PAN&#65289;&#32593;&#32476;&#35299;&#39640;&#32500;&#31471;&#21040;&#31471;&#25968;&#23398;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#21547;&#21508;&#31181;&#28857;&#32423;&#32422;&#26463;&#65292;&#20351;NeuPAN&#33021;&#22815;&#30452;&#25509;&#29983;&#25104;&#23454;&#26102;&#12289;&#31471;&#21040;&#31471;&#12289;&#29289;&#29702;&#21487;&#35299;&#37322;&#30340;&#36816;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06828v1 Announce Type: cross  Abstract: Navigating a nonholonomic robot in a cluttered environment requires extremely accurate perception and locomotion for collision avoidance. This paper presents NeuPAN: a real-time, highly-accurate, map-free, robot-agnostic, and environment-invariant robot navigation solution. Leveraging a tightly-coupled perception-locomotion framework, NeuPAN has two key innovations compared to existing approaches: 1) it directly maps raw points to a learned multi-frame distance space, avoiding error propagation from perception to control; 2) it is interpretable from an end-to-end model-based learning perspective, enabling provable convergence. The crux of NeuPAN is to solve a high-dimensional end-to-end mathematical model with various point-level constraints using the plug-and-play (PnP) proximal alternating-minimization network (PAN) with neurons in the loop. This allows NeuPAN to generate real-time, end-to-end, physically-interpretable motions direct
&lt;/p&gt;</description></item></channel></rss>