<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#25311;&#36741;&#21161;&#30340;&#33258;&#21160;&#35843;&#33410;&#25216;&#26415;&#65292;&#29992;&#20110;&#35299;&#20915;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#30340;&#39640;&#24230;&#21487;&#37197;&#32622;&#21442;&#25968;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#25216;&#26415;&#36890;&#36807;&#35299;&#20915;&#36719;&#30828;&#20214;&#20043;&#38388;&#37197;&#32622;&#36873;&#39033;&#30340;&#20132;&#20114;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22312;&#19981;&#21516;&#29615;&#22659;&#21644;&#26426;&#22120;&#20154;&#24179;&#21488;&#20043;&#38388;&#30340;&#24615;&#33021;&#36801;&#31227;&#12290;</title><link>https://arxiv.org/abs/2402.05399</link><description>&lt;p&gt;
CURE: &#26426;&#22120;&#20154;&#39046;&#22495;&#30340;&#27169;&#25311;&#36741;&#21161;&#33258;&#21160;&#35843;&#33410;&#25216;&#26415;
&lt;/p&gt;
&lt;p&gt;
CURE: Simulation-Augmented Auto-Tuning in Robotics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#25311;&#36741;&#21161;&#30340;&#33258;&#21160;&#35843;&#33410;&#25216;&#26415;&#65292;&#29992;&#20110;&#35299;&#20915;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#30340;&#39640;&#24230;&#21487;&#37197;&#32622;&#21442;&#25968;&#30340;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#25216;&#26415;&#36890;&#36807;&#35299;&#20915;&#36719;&#30828;&#20214;&#20043;&#38388;&#37197;&#32622;&#36873;&#39033;&#30340;&#20132;&#20114;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22312;&#19981;&#21516;&#29615;&#22659;&#21644;&#26426;&#22120;&#20154;&#24179;&#21488;&#20043;&#38388;&#30340;&#24615;&#33021;&#36801;&#31227;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#20154;&#31995;&#32479;&#36890;&#24120;&#30001;&#22810;&#20010;&#23376;&#31995;&#32479;&#32452;&#25104;&#65292;&#20363;&#22914;&#23450;&#20301;&#21644;&#23548;&#33322;&#65292;&#27599;&#20010;&#23376;&#31995;&#32479;&#21448;&#21253;&#21547;&#35768;&#22810;&#21487;&#37197;&#32622;&#30340;&#32452;&#20214;&#65288;&#20363;&#22914;&#36873;&#25321;&#19981;&#21516;&#30340;&#35268;&#21010;&#31639;&#27861;&#65289;&#12290;&#19968;&#26086;&#36873;&#25321;&#20102;&#26576;&#20010;&#31639;&#27861;&#65292;&#23601;&#38656;&#35201;&#35774;&#32622;&#30456;&#20851;&#30340;&#37197;&#32622;&#36873;&#39033;&#20197;&#36798;&#21040;&#36866;&#24403;&#30340;&#20540;&#12290;&#31995;&#32479;&#22534;&#26632;&#20013;&#30340;&#37197;&#32622;&#36873;&#39033;&#20250;&#20135;&#29983;&#22797;&#26434;&#30340;&#20132;&#20114;&#20851;&#31995;&#12290;&#22312;&#39640;&#24230;&#21487;&#37197;&#32622;&#30340;&#26426;&#22120;&#20154;&#20013;&#25214;&#21040;&#26368;&#20339;&#37197;&#32622;&#26469;&#23454;&#29616;&#26399;&#26395;&#30340;&#24615;&#33021;&#26159;&#19968;&#20010;&#37325;&#22823;&#25361;&#25112;&#65292;&#22240;&#20026;&#36719;&#20214;&#21644;&#30828;&#20214;&#20043;&#38388;&#30340;&#37197;&#32622;&#36873;&#39033;&#20132;&#20114;&#23548;&#33268;&#20102;&#24222;&#22823;&#19988;&#22797;&#26434;&#30340;&#37197;&#32622;&#31354;&#38388;&#12290;&#24615;&#33021;&#36801;&#31227;&#22312;&#19981;&#21516;&#30340;&#29615;&#22659;&#21644;&#26426;&#22120;&#20154;&#24179;&#21488;&#20043;&#38388;&#20063;&#26159;&#19968;&#20010;&#38590;&#39064;&#12290;&#25968;&#25454;&#39640;&#25928;&#20248;&#21270;&#31639;&#27861;&#65288;&#20363;&#22914;&#36125;&#21494;&#26031;&#20248;&#21270;&#65289;&#24050;&#36234;&#26469;&#36234;&#22810;&#22320;&#29992;&#20110;&#33258;&#21160;&#21270;&#35843;&#25972;&#32593;&#32476;&#29289;&#29702;&#31995;&#32479;&#20013;&#30340;&#21487;&#37197;&#32622;&#21442;&#25968;&#12290;&#28982;&#32780;&#65292;&#36825;&#26679;&#30340;&#20248;&#21270;&#31639;&#27861;&#22312;&#26426;&#22120;&#20154;&#39046;&#22495;&#24212;&#29992;&#20173;&#26377;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Robotic systems are typically composed of various subsystems, such as localization and navigation, each encompassing numerous configurable components (e.g., selecting different planning algorithms). Once an algorithm has been selected for a component, its associated configuration options must be set to the appropriate values. Configuration options across the system stack interact non-trivially. Finding optimal configurations for highly configurable robots to achieve desired performance poses a significant challenge due to the interactions between configuration options across software and hardware that result in an exponentially large and complex configuration space. These challenges are further compounded by the need for transferability between different environments and robotic platforms. Data efficient optimization algorithms (e.g., Bayesian optimization) have been increasingly employed to automate the tuning of configurable parameters in cyber-physical systems. However, such optimiz
&lt;/p&gt;</description></item></channel></rss>