<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36890;&#36807;&#23545;ICP&#31639;&#27861;&#36827;&#34892;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#25915;&#20987;&#65292;&#22312;&#23433;&#20840;&#20851;&#38190;&#24212;&#29992;&#20013;&#35780;&#20272;&#20854;&#40065;&#26834;&#24615;&#65292;&#37325;&#28857;&#22312;&#20110;&#25214;&#21040;&#21487;&#33021;&#30340;&#26368;&#22823;ICP&#23039;&#21183;&#35823;&#24046;&#12290;</title><link>https://arxiv.org/abs/2403.05666</link><description>&lt;p&gt;
&#38754;&#23545;&#26368;&#22351;&#24773;&#20917;&#65306;&#19968;&#31181;&#22522;&#20110;&#23398;&#20064;&#30340;&#23545;ICP&#31639;&#27861;&#40065;&#26834;&#24615;&#20998;&#26512;&#30340;&#23545;&#25239;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Prepared for the Worst: A Learning-Based Adversarial Attack for Resilience Analysis of the ICP Algorithm
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05666
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;ICP&#31639;&#27861;&#36827;&#34892;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#25915;&#20987;&#65292;&#22312;&#23433;&#20840;&#20851;&#38190;&#24212;&#29992;&#20013;&#35780;&#20272;&#20854;&#40065;&#26834;&#24615;&#65292;&#37325;&#28857;&#22312;&#20110;&#25214;&#21040;&#21487;&#33021;&#30340;&#26368;&#22823;ICP&#23039;&#21183;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#28145;&#24230;&#23398;&#20064;&#25915;&#20987;&#28608;&#20809;&#38647;&#36798;&#28857;&#20113;&#26469;&#35780;&#20272;&#36845;&#20195;&#26368;&#36817;&#28857;&#65288;ICP&#65289;&#31639;&#27861;&#40065;&#26834;&#24615;&#30340;&#26032;&#26041;&#27861;&#12290;&#23545;&#20110;&#20687;&#33258;&#20027;&#23548;&#33322;&#36825;&#26679;&#30340;&#23433;&#20840;&#20851;&#38190;&#24212;&#29992;&#65292;&#30830;&#20445;&#31639;&#27861;&#22312;&#37096;&#32626;&#21069;&#30340;&#40065;&#26834;&#24615;&#33267;&#20851;&#37325;&#35201;&#12290;ICP&#31639;&#27861;&#24050;&#25104;&#20026;&#22522;&#20110;&#28608;&#20809;&#38647;&#36798;&#30340;&#23450;&#20301;&#30340;&#26631;&#20934;&#12290;&#28982;&#32780;&#65292;&#23427;&#20135;&#29983;&#30340;&#23039;&#21183;&#20272;&#35745;&#21487;&#33021;&#20250;&#21463;&#21040;&#27979;&#37327;&#25968;&#25454;&#30340;&#24433;&#21709;&#12290;&#25968;&#25454;&#30340;&#27745;&#26579;&#21487;&#33021;&#26469;&#33258;&#21508;&#31181;&#22330;&#26223;&#65292;&#22914;&#36974;&#25377;&#12289;&#24694;&#21155;&#22825;&#27668;&#25110;&#20256;&#24863;&#22120;&#30340;&#26426;&#26800;&#38382;&#39064;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;ICP&#30340;&#22797;&#26434;&#21644;&#36845;&#20195;&#29305;&#24615;&#20351;&#24471;&#35780;&#20272;&#20854;&#23545;&#27745;&#26579;&#30340;&#40065;&#26834;&#24615;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#34429;&#28982;&#24050;&#32463;&#26377;&#20154;&#21162;&#21147;&#21019;&#24314;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#25968;&#25454;&#38598;&#21644;&#24320;&#21457;&#20223;&#30495;&#26469;&#32463;&#39564;&#24615;&#22320;&#35780;&#20272;ICP&#30340;&#40065;&#26834;&#24615;&#65292;&#20294;&#25105;&#20204;&#30340;&#26041;&#27861;&#20391;&#37325;&#20110;&#36890;&#36807;&#22522;&#20110;&#25200;&#21160;&#30340;&#23545;&#25239;&#25915;&#20987;&#25214;&#21040;&#26368;&#22823;&#21487;&#33021;&#30340;ICP&#23039;&#21183;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05666v1 Announce Type: cross  Abstract: This paper presents a novel method to assess the resilience of the Iterative Closest Point (ICP) algorithm via deep-learning-based attacks on lidar point clouds. For safety-critical applications such as autonomous navigation, ensuring the resilience of algorithms prior to deployments is of utmost importance. The ICP algorithm has become the standard for lidar-based localization. However, the pose estimate it produces can be greatly affected by corruption in the measurements. Corruption can arise from a variety of scenarios such as occlusions, adverse weather, or mechanical issues in the sensor. Unfortunately, the complex and iterative nature of ICP makes assessing its resilience to corruption challenging. While there have been efforts to create challenging datasets and develop simulations to evaluate the resilience of ICP empirically, our method focuses on finding the maximum possible ICP pose error using perturbation-based adversarial
&lt;/p&gt;</description></item></channel></rss>