<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#27979;&#35797;&#29983;&#25104;&#22120;&#65288;GenBo&#65289;&#65292;&#23427;&#36890;&#36807;&#22312;&#26080;&#25925;&#38556;&#29615;&#22659;&#20013;&#21464;&#24322;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#30340;&#39550;&#39542;&#26465;&#20214;&#26469;&#29983;&#25104;&#36793;&#30028;&#29366;&#24577;&#23545;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#27979;&#35797;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.10590</link><description>&lt;p&gt;
&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#27979;&#35797;&#19982;&#25913;&#36827;&#30340;&#36793;&#30028;&#29366;&#24577;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Boundary State Generation for Testing and Improvement of Autonomous Driving Systems. (arXiv:2307.10590v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10590
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#27979;&#35797;&#29983;&#25104;&#22120;&#65288;GenBo&#65289;&#65292;&#23427;&#36890;&#36807;&#22312;&#26080;&#25925;&#38556;&#29615;&#22659;&#20013;&#21464;&#24322;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#30340;&#39550;&#39542;&#26465;&#20214;&#26469;&#29983;&#25104;&#36793;&#30028;&#29366;&#24577;&#23545;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#27979;&#35797;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#21644;&#20256;&#24863;&#22120;&#25216;&#26415;&#30340;&#36827;&#23637;&#20351;&#24471;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#65288;ADS&#65289;&#20855;&#26377;&#20102;&#36234;&#26469;&#36234;&#39640;&#30340;&#33258;&#20027;&#24615;&#12290;&#28982;&#32780;&#65292;&#35780;&#20272;&#20854;&#21487;&#38752;&#24615;&#20173;&#28982;&#26159;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#30446;&#21069;&#30340;ADS&#27979;&#35797;&#26041;&#27861;&#20462;&#25913;&#27169;&#25311;&#39550;&#39542;&#29615;&#22659;&#30340;&#21487;&#25511;&#23646;&#24615;&#65292;&#30452;&#21040;ADS&#20986;&#29616;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#26377;&#20004;&#20010;&#20027;&#35201;&#32570;&#28857;&#65306;&#65288;1&#65289;&#23545;&#27169;&#25311;&#29615;&#22659;&#30340;&#20462;&#25913;&#21487;&#33021;&#19981;&#23481;&#26131;&#36716;&#31227;&#21040;&#23454;&#38469;&#27979;&#35797;&#29615;&#22659;&#65288;&#20363;&#22914;&#25913;&#21464;&#36947;&#36335;&#24418;&#29366;&#65289;&#65307;&#65288;2&#65289;&#21363;&#20351;ADS&#22312;&#26576;&#20123;&#29615;&#22659;&#20013;&#25104;&#21151;&#65292;&#36825;&#20123;&#29615;&#22659;&#23454;&#20363;&#20063;&#20250;&#34987;&#20002;&#24323;&#65292;&#23613;&#31649;&#23427;&#20204;&#21487;&#33021;&#21253;&#21547;ADS&#21487;&#33021;&#20986;&#29616;&#38382;&#39064;&#30340;&#28508;&#22312;&#39550;&#39542;&#26465;&#20214;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;ADS&#27979;&#35797;&#29983;&#25104;&#22120;&#8212;&#8212;GenBo&#65288;GENerator of BOundary state pairs&#65289;&#12290;GenBo&#22312;&#19968;&#20010;&#26080;&#25925;&#38556;&#29615;&#22659;&#23454;&#20363;&#20013;&#21464;&#24322;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#30340;&#39550;&#39542;&#26465;&#20214;&#65288;&#20301;&#32622;&#65292;&#36895;&#24230;&#21644;&#26041;&#21521;&#65289;&#65292;&#24182;&#26377;&#25928;&#22320;&#29983;&#25104;&#21487;&#36793;&#30028;&#21270;&#30340;&#29366;&#24577;&#23545;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent advances in Deep Neural Networks (DNNs) and sensor technologies are enabling autonomous driving systems (ADSs) with an ever-increasing level of autonomy. However, assessing their dependability remains a critical concern. State-of-the-art ADS testing approaches modify the controllable attributes of a simulated driving environment until the ADS misbehaves. Such approaches have two main drawbacks: (1) modifications to the simulated environment might not be easily transferable to the in-field test setting (e.g., changing the road shape); (2) environment instances in which the ADS is successful are discarded, despite the possibility that they could contain hidden driving conditions in which the ADS may misbehave.  In this paper, we present GenBo (GENerator of BOundary state pairs), a novel test generator for ADS testing. GenBo mutates the driving conditions of the ego vehicle (position, velocity and orientation), collected in a failure-free environment instance, and efficiently gener
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#22810;&#38454;&#27573;&#20307;&#31995;&#32467;&#26500;&#21644;&#20004;&#31181;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;&#65292;&#19987;&#38376;&#29992;&#20110;&#22522;&#20110;&#36816;&#21160;&#23398;&#25968;&#25454;&#30340;&#34892;&#21160;&#20998;&#21106;&#12290;&#21516;&#26102;&#65292;&#20316;&#32773;&#22312;&#19977;&#20010;&#25163;&#26415;&#32541;&#21512;&#20219;&#21153;&#25968;&#25454;&#38598;&#19978;&#23545;&#27169;&#22411;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2303.07814</link><description>&lt;p&gt;
&#22522;&#20110;&#36816;&#21160;&#23398;&#25968;&#25454;&#30340;&#25163;&#26415;&#34892;&#20026;&#20999;&#20998;
&lt;/p&gt;
&lt;p&gt;
Kinematic Data-Based Action Segmentation for Surgical Applications. (arXiv:2303.07814v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07814
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#22810;&#38454;&#27573;&#20307;&#31995;&#32467;&#26500;&#21644;&#20004;&#31181;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;&#65292;&#19987;&#38376;&#29992;&#20110;&#22522;&#20110;&#36816;&#21160;&#23398;&#25968;&#25454;&#30340;&#34892;&#21160;&#20998;&#21106;&#12290;&#21516;&#26102;&#65292;&#20316;&#32773;&#22312;&#19977;&#20010;&#25163;&#26415;&#32541;&#21512;&#20219;&#21153;&#25968;&#25454;&#38598;&#19978;&#23545;&#27169;&#22411;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34892;&#21160;&#20999;&#20998;&#26159;&#39640;&#32423;&#27969;&#31243;&#20998;&#26512;&#20013;&#30340;&#19968;&#20010;&#25361;&#25112;&#24615;&#20219;&#21153;&#65292;&#36890;&#24120;&#22312;&#35270;&#39057;&#25110;&#20174;&#21508;&#31181;&#20256;&#24863;&#22120;&#33719;&#21462;&#30340;&#36816;&#21160;&#23398;&#25968;&#25454;&#19978;&#25191;&#34892;&#12290;&#22312;&#25163;&#26415;&#36807;&#31243;&#20013;&#65292;&#34892;&#21160;&#20999;&#20998;&#23545;&#20110;&#24037;&#20316;&#27969;&#20998;&#26512;&#31639;&#27861;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#20010;&#19982;&#36816;&#21160;&#23398;&#25968;&#25454;&#30456;&#20851;&#30340;&#34892;&#21160;&#20998;&#21106;&#26041;&#38754;&#30340;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#20004;&#31181;&#22810;&#38454;&#27573;&#20307;&#31995;&#32467;&#26500;&#65292;MS-TCN-BiLSTM&#21644;MS-TCN-BiGRU&#65292;&#19987;&#38376;&#35774;&#35745;&#29992;&#20110;&#36816;&#21160;&#23398;&#25968;&#25454;&#12290; &#36825;&#20123;&#20307;&#31995;&#32467;&#26500;&#30001;&#20855;&#26377;&#38454;&#20869;&#35268;&#21017;&#21270;&#21644;&#21452;&#21521;LSTM&#25110;GRU&#30340;&#32454;&#21270;&#38454;&#27573;&#30340;&#39044;&#27979;&#29983;&#25104;&#22120;&#32452;&#25104;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26032;&#30340;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;&#65292;World Frame Rotation&#21644;Horizontal-Flip&#65292;&#21033;&#29992;&#36816;&#21160;&#23398;&#25968;&#25454;&#30340;&#24378;&#20960;&#20309;&#32467;&#26500;&#26469;&#25552;&#39640;&#31639;&#27861;&#24615;&#33021;&#21644;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#22312;&#19977;&#20010;&#25163;&#26415;&#32541;&#21512;&#20219;&#21153;&#25968;&#25454;&#38598;&#19978;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#65306;&#21487;&#21464;&#32452;&#32455;&#27169;&#25311;&#65288;VTS&#65289;&#25968;&#25454;&#38598;&#21644;&#26032;&#25512;&#20986;&#30340;&#32928;&#36947;&#20462;&#22797;&#27169;&#25311;&#65288;BRS&#65289;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
Action segmentation is a challenging task in high-level process analysis, typically performed on video or kinematic data obtained from various sensors. In the context of surgical procedures, action segmentation is critical for workflow analysis algorithms. This work presents two contributions related to action segmentation on kinematic data. Firstly, we introduce two multi-stage architectures, MS-TCN-BiLSTM and MS-TCN-BiGRU, specifically designed for kinematic data. The architectures consist of a prediction generator with intra-stage regularization and Bidirectional LSTM or GRU-based refinement stages. Secondly, we propose two new data augmentation techniques, World Frame Rotation and Horizontal-Flip, which utilize the strong geometric structure of kinematic data to improve algorithm performance and robustness. We evaluate our models on three datasets of surgical suturing tasks: the Variable Tissue Simulation (VTS) Dataset and the newly introduced Bowel Repair Simulation (BRS) Dataset,
&lt;/p&gt;</description></item></channel></rss>