<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#28508;&#22312;&#29366;&#24577;&#25512;&#26029;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#33258;&#21160;&#21277;&#36947;&#21512;&#24182;&#38382;&#39064;&#65292;&#22312;&#27809;&#26377;&#35814;&#32454;&#20102;&#35299;&#21608;&#22260;&#36710;&#36742;&#24847;&#22270;&#25110;&#39550;&#39542;&#39118;&#26684;&#30340;&#24773;&#20917;&#19979;&#23433;&#20840;&#25191;&#34892;&#21277;&#36947;&#21512;&#24182;&#20219;&#21153;&#65292;&#24182;&#32771;&#34385;&#20102;&#35266;&#27979;&#24310;&#36831;&#65292;&#20197;&#22686;&#24378;&#20195;&#29702;&#22312;&#21160;&#24577;&#20132;&#36890;&#29366;&#20917;&#20013;&#30340;&#20915;&#31574;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.11852</link><description>&lt;p&gt;
&#20855;&#26377;&#28508;&#22312;&#29366;&#24577;&#25512;&#26029;&#30340;&#24378;&#21270;&#23398;&#20064;&#22312;&#33258;&#21160;&#21277;&#36947;&#21512;&#24182;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Reinforcement Learning with Latent State Inference for Autonomous On-ramp Merging under Observation Delay
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11852
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#28508;&#22312;&#29366;&#24577;&#25512;&#26029;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#33258;&#21160;&#21277;&#36947;&#21512;&#24182;&#38382;&#39064;&#65292;&#22312;&#27809;&#26377;&#35814;&#32454;&#20102;&#35299;&#21608;&#22260;&#36710;&#36742;&#24847;&#22270;&#25110;&#39550;&#39542;&#39118;&#26684;&#30340;&#24773;&#20917;&#19979;&#23433;&#20840;&#25191;&#34892;&#21277;&#36947;&#21512;&#24182;&#20219;&#21153;&#65292;&#24182;&#32771;&#34385;&#20102;&#35266;&#27979;&#24310;&#36831;&#65292;&#20197;&#22686;&#24378;&#20195;&#29702;&#22312;&#21160;&#24577;&#20132;&#36890;&#29366;&#20917;&#20013;&#30340;&#20915;&#31574;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#33258;&#21160;&#21277;&#36947;&#21512;&#24182;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#65292;&#20854;&#20013;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#38656;&#35201;&#26080;&#32541;&#22320;&#34701;&#20837;&#22810;&#36710;&#36947;&#39640;&#36895;&#20844;&#36335;&#19978;&#30340;&#36710;&#27969;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;Lane-keeping, Lane-changing with Latent-state Inference and Safety Controller (L3IS)&#20195;&#29702;&#65292;&#26088;&#22312;&#22312;&#27809;&#26377;&#20851;&#20110;&#21608;&#22260;&#36710;&#36742;&#24847;&#22270;&#25110;&#39550;&#39542;&#39118;&#26684;&#30340;&#20840;&#38754;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#23433;&#20840;&#25191;&#34892;&#21277;&#36947;&#21512;&#24182;&#20219;&#21153;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#35813;&#20195;&#29702;&#30340;&#22686;&#24378;&#29256;AL3IS&#65292;&#32771;&#34385;&#20102;&#35266;&#27979;&#24310;&#36831;&#65292;&#20351;&#20195;&#29702;&#33021;&#22815;&#22312;&#20855;&#26377;&#36710;&#36742;&#38388;&#36890;&#20449;&#24310;&#36831;&#30340;&#29616;&#23454;&#29615;&#22659;&#20013;&#20570;&#20986;&#26356;&#31283;&#20581;&#30340;&#20915;&#31574;&#12290;&#36890;&#36807;&#36890;&#36807;&#28508;&#22312;&#29366;&#24577;&#24314;&#27169;&#29615;&#22659;&#20013;&#30340;&#19981;&#21487;&#35266;&#23519;&#26041;&#38754;&#65292;&#22914;&#20854;&#20182;&#39550;&#39542;&#21592;&#30340;&#24847;&#22270;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22686;&#24378;&#20102;&#20195;&#29702;&#36866;&#24212;&#21160;&#24577;&#20132;&#36890;&#29366;&#20917;&#12289;&#20248;&#21270;&#21512;&#24182;&#25805;&#20316;&#24182;&#30830;&#20445;&#19982;&#20854;&#20182;&#36710;&#36742;&#36827;&#34892;&#23433;&#20840;&#20114;&#21160;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11852v1 Announce Type: cross  Abstract: This paper presents a novel approach to address the challenging problem of autonomous on-ramp merging, where a self-driving vehicle needs to seamlessly integrate into a flow of vehicles on a multi-lane highway. We introduce the Lane-keeping, Lane-changing with Latent-state Inference and Safety Controller (L3IS) agent, designed to perform the on-ramp merging task safely without comprehensive knowledge about surrounding vehicles' intents or driving styles. We also present an augmentation of this agent called AL3IS that accounts for observation delays, allowing the agent to make more robust decisions in real-world environments with vehicle-to-vehicle (V2V) communication delays. By modeling the unobservable aspects of the environment through latent states, such as other drivers' intents, our approach enhances the agent's ability to adapt to dynamic traffic conditions, optimize merging maneuvers, and ensure safe interactions with other vehi
&lt;/p&gt;</description></item><item><title>&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#32570;&#20047;&#36890;&#29992;&#34892;&#20026;&#65292;&#38656;&#35201;&#21033;&#29992;&#32467;&#26500;&#21270;&#30693;&#35782;&#34920;&#31034;&#12290;&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20803;&#35748;&#30693;&#27867;&#21270;&#26694;&#26550;KIX&#65292;&#36890;&#36807;&#19982;&#23545;&#35937;&#30340;&#20132;&#20114;&#23398;&#20064;&#21487;&#36801;&#31227;&#30340;&#20132;&#20114;&#27010;&#24565;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#20419;&#36827;&#20102;&#30693;&#35782;&#19982;&#24378;&#21270;&#23398;&#20064;&#30340;&#34701;&#21512;&#65292;&#20026;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#30340;&#33258;&#20027;&#21644;&#36890;&#29992;&#34892;&#20026;&#25552;&#20379;&#20102;&#28508;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.05346</link><description>&lt;p&gt;
KIX: &#19968;&#31181;&#20803;&#35748;&#30693;&#27867;&#21270;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
KIX: A Metacognitive Generalization Framework
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05346
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#32570;&#20047;&#36890;&#29992;&#34892;&#20026;&#65292;&#38656;&#35201;&#21033;&#29992;&#32467;&#26500;&#21270;&#30693;&#35782;&#34920;&#31034;&#12290;&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20803;&#35748;&#30693;&#27867;&#21270;&#26694;&#26550;KIX&#65292;&#36890;&#36807;&#19982;&#23545;&#35937;&#30340;&#20132;&#20114;&#23398;&#20064;&#21487;&#36801;&#31227;&#30340;&#20132;&#20114;&#27010;&#24565;&#21644;&#27867;&#21270;&#33021;&#21147;&#65292;&#20419;&#36827;&#20102;&#30693;&#35782;&#19982;&#24378;&#21270;&#23398;&#20064;&#30340;&#34701;&#21512;&#65292;&#20026;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#30340;&#33258;&#20027;&#21644;&#36890;&#29992;&#34892;&#20026;&#25552;&#20379;&#20102;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#31867;&#21644;&#20854;&#20182;&#21160;&#29289;&#33021;&#22815;&#28789;&#27963;&#35299;&#20915;&#21508;&#31181;&#20219;&#21153;&#65292;&#24182;&#19988;&#33021;&#22815;&#36890;&#36807;&#37325;&#22797;&#20351;&#29992;&#21644;&#24212;&#29992;&#38271;&#26399;&#31215;&#32047;&#30340;&#39640;&#32423;&#30693;&#35782;&#26469;&#36866;&#24212;&#26032;&#39062;&#24773;&#22659;&#65292;&#36825;&#34920;&#29616;&#20102;&#19968;&#31181;&#27867;&#21270;&#26234;&#33021;&#34892;&#20026;&#12290;&#20294;&#26159;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#26356;&#22810;&#22320;&#26159;&#19987;&#23478;&#65292;&#32570;&#20047;&#36825;&#31181;&#36890;&#29992;&#34892;&#20026;&#12290;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#38656;&#35201;&#29702;&#35299;&#21644;&#21033;&#29992;&#20851;&#38190;&#30340;&#32467;&#26500;&#21270;&#30693;&#35782;&#34920;&#31034;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20803;&#35748;&#30693;&#27867;&#21270;&#26694;&#26550;&#65292;&#31216;&#20026;Knowledge-Interaction-eXecution (KIX)&#65292;&#24182;&#19988;&#35748;&#20026;&#36890;&#36807;&#19982;&#23545;&#35937;&#30340;&#20132;&#20114;&#26469;&#21033;&#29992;&#31867;&#22411;&#31354;&#38388;&#21487;&#20197;&#20419;&#36827;&#23398;&#20064;&#21487;&#36801;&#31227;&#30340;&#20132;&#20114;&#27010;&#24565;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;&#36825;&#26159;&#23558;&#30693;&#35782;&#34701;&#20837;&#21040;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#19968;&#31181;&#33258;&#28982;&#26041;&#24335;&#65292;&#24182;&#26377;&#26395;&#25104;&#20026;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#20013;&#23454;&#29616;&#33258;&#20027;&#21644;&#36890;&#29992;&#34892;&#20026;&#30340;&#25512;&#24191;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
Humans and other animals aptly exhibit general intelligence behaviors in solving a variety of tasks with flexibility and ability to adapt to novel situations by reusing and applying high level knowledge acquired over time. But artificial agents are more of a specialist, lacking such generalist behaviors. Artificial agents will require understanding and exploiting critical structured knowledge representations. We present a metacognitive generalization framework, Knowledge-Interaction-eXecution (KIX), and argue that interactions with objects leveraging type space facilitate the learning of transferable interaction concepts and generalization. It is a natural way of integrating knowledge into reinforcement learning and promising to act as an enabler for autonomous and generalist behaviors in artificial intelligence systems.
&lt;/p&gt;</description></item></channel></rss>