<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23398;&#20064;&#25511;&#21046;&#36719;&#24418;&#21464;&#26426;&#22120;&#20154;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#20010;&#20840;&#38754;&#30340;&#24378;&#21270;&#23398;&#20064;&#22522;&#20934;&#31995;&#32479;DittoGym&#65292;&#35813;&#31995;&#32479;&#38656;&#35201;&#23545;&#26426;&#22120;&#20154;&#30340;&#24418;&#24577;&#36827;&#34892;&#32454;&#31890;&#24230;&#21464;&#21270;&#26469;&#23436;&#25104;&#20219;&#21153;&#12290;</title><link>http://arxiv.org/abs/2401.13231</link><description>&lt;p&gt;
DittoGym:&#23398;&#20064;&#25511;&#21046;&#36719;&#24418;&#21464;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
DittoGym: Learning to Control Soft Shape-Shifting Robots. (arXiv:2401.13231v1 [cs.RO] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13231
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23398;&#20064;&#25511;&#21046;&#36719;&#24418;&#21464;&#26426;&#22120;&#20154;&#30340;&#26041;&#27861;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#20010;&#20840;&#38754;&#30340;&#24378;&#21270;&#23398;&#20064;&#22522;&#20934;&#31995;&#32479;DittoGym&#65292;&#35813;&#31995;&#32479;&#38656;&#35201;&#23545;&#26426;&#22120;&#20154;&#30340;&#24418;&#24577;&#36827;&#34892;&#32454;&#31890;&#24230;&#21464;&#21270;&#26469;&#23436;&#25104;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#20154;&#20849;&#21516;&#35774;&#35745;&#65292;&#20854;&#20013;&#26426;&#22120;&#20154;&#30340;&#24418;&#24577;&#20248;&#21270;&#19982;&#23398;&#20064;&#30340;&#31574;&#30053;&#20849;&#21516;&#35299;&#20915;&#29305;&#23450;&#20219;&#21153;&#65292;&#26159;&#19968;&#20010;&#26032;&#20852;&#30340;&#30740;&#31350;&#39046;&#22495;&#12290;&#23545;&#20110;&#36719;&#26426;&#22120;&#20154;&#26469;&#35828;&#65292;&#36825;&#19968;&#39046;&#22495;&#20855;&#26377;&#29305;&#21035;&#30340;&#28508;&#21147;&#65292;&#22240;&#20026;&#36719;&#26426;&#22120;&#20154;&#21487;&#20197;&#36890;&#36807;&#26032;&#39062;&#30340;&#21046;&#36896;&#25216;&#26415;&#23454;&#29616;&#23398;&#20064;&#21040;&#30340;&#24418;&#24577;&#21644;&#25191;&#34892;&#22120;&#12290;&#21463;&#33258;&#28982;&#30028;&#21644;&#26368;&#36817;&#30340;&#26032;&#22411;&#26426;&#22120;&#20154;&#35774;&#35745;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#26356;&#36827;&#19968;&#27493;&#25506;&#32034;&#26032;&#22411;&#21487;&#37325;&#26500;&#26426;&#22120;&#20154;&#65292;&#21363;&#22312;&#20854;&#23551;&#21629;&#20869;&#21487;&#20197;&#25913;&#21464;&#24418;&#24577;&#30340;&#26426;&#22120;&#20154;&#12290;&#25105;&#20204;&#23558;&#21487;&#37325;&#26500;&#36719;&#26426;&#22120;&#20154;&#30340;&#25511;&#21046;&#24418;&#24335;&#21270;&#20026;&#39640;&#32500;&#24378;&#21270;&#23398;&#20064;&#38382;&#39064;&#12290;&#25105;&#20204;&#22312;&#21516;&#19968;action&#31354;&#38388;&#20013;&#32479;&#19968;&#24418;&#24577;&#21464;&#21270;&#12289;&#36816;&#21160;&#21644;&#19982;&#29615;&#22659;&#30340;&#20114;&#21160;&#65292;&#24182;&#24341;&#20837;&#21512;&#36866;&#30340;&#31895;&#21040;&#32454;&#30340;&#35838;&#31243;&#34920;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#21457;&#29616;&#23454;&#29616;&#23545;&#26368;&#32456;&#26426;&#22120;&#20154;&#36827;&#34892;&#32454;&#31890;&#24230;&#25511;&#21046;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;DittoGym&#65292;&#36825;&#26159;&#19968;&#20010;&#38024;&#23545;&#21487;&#37325;&#26500;&#36719;&#26426;&#22120;&#20154;&#30340;&#20840;&#38754;&#24378;&#21270;&#23398;&#20064;&#22522;&#20934;&#65292;&#38656;&#35201;&#23545;&#24418;&#24577;&#36827;&#34892;&#32454;&#31890;&#24230;&#21464;&#21270;&#26469;&#23436;&#25104;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
Robot co-design, where the morphology of a robot is optimized jointly with a learned policy to solve a specific task, is an emerging area of research. It holds particular promise for soft robots, which are amenable to novel manufacturing techniques that can realize learned morphologies and actuators. Inspired by nature and recent novel robot designs, we propose to go a step further and explore the novel reconfigurable robots, defined as robots that can change their morphology within their lifetime. We formalize control of reconfigurable soft robots as a high-dimensional reinforcement learning (RL) problem. We unify morphology change, locomotion, and environment interaction in the same action space, and introduce an appropriate, coarse-to-fine curriculum that enables us to discover policies that accomplish fine-grained control of the resulting robots. We also introduce DittoGym, a comprehensive RL benchmark for reconfigurable soft robots that require fine-grained morphology changes to a
&lt;/p&gt;</description></item></channel></rss>