<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#27880;&#24847;&#26426;&#21046;&#30340;&#39044;&#27979;&#24615;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#65292;&#33021;&#22815;&#23454;&#29616;&#23454;&#26102;&#24863;&#30693;&#21644;&#21160;&#20316;&#29983;&#25104;&#65292;&#20197;&#25903;&#25345;&#28921;&#39274;&#26426;&#22120;&#20154;&#22312;&#29038;&#40481;&#34507;&#36807;&#31243;&#20013;&#23545;&#40481;&#34507;&#29366;&#24577;&#30340;&#24863;&#30693;&#21644;&#25605;&#25292;&#21160;&#20316;&#30340;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2309.14837</link><description>&lt;p&gt;
&#20351;&#29992;&#27880;&#24847;&#26426;&#21046;&#36827;&#34892;&#23454;&#26102;&#21160;&#20316;&#29983;&#25104;&#21644;&#20027;&#21160;&#24863;&#30693;&#30340;&#28921;&#39274;&#26426;&#22120;&#20154;
&lt;/p&gt;
&lt;p&gt;
Realtime Motion Generation with Active Perception Using Attention Mechanism for Cooking Robot. (arXiv:2309.14837v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14837
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#27880;&#24847;&#26426;&#21046;&#30340;&#39044;&#27979;&#24615;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#65292;&#33021;&#22815;&#23454;&#29616;&#23454;&#26102;&#24863;&#30693;&#21644;&#21160;&#20316;&#29983;&#25104;&#65292;&#20197;&#25903;&#25345;&#28921;&#39274;&#26426;&#22120;&#20154;&#22312;&#29038;&#40481;&#34507;&#36807;&#31243;&#20013;&#23545;&#40481;&#34507;&#29366;&#24577;&#30340;&#24863;&#30693;&#21644;&#25605;&#25292;&#21160;&#20316;&#30340;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#25903;&#25345;&#20154;&#31867;&#30340;&#26085;&#24120;&#29983;&#27963;&#65292;&#26426;&#22120;&#20154;&#38656;&#35201;&#33258;&#20027;&#23398;&#20064;&#65292;&#36866;&#24212;&#29289;&#20307;&#21644;&#29615;&#22659;&#65292;&#24182;&#25191;&#34892;&#36866;&#24403;&#30340;&#21160;&#20316;&#12290;&#25105;&#20204;&#23581;&#35797;&#20351;&#29992;&#30495;&#23454;&#30340;&#39135;&#26448;&#29038;&#28818;&#40481;&#34507;&#30340;&#20219;&#21153;&#65292;&#20854;&#20013;&#26426;&#22120;&#20154;&#38656;&#35201;&#23454;&#26102;&#24863;&#30693;&#40481;&#34507;&#30340;&#29366;&#24577;&#24182;&#35843;&#25972;&#25605;&#25292;&#21160;&#20316;&#65292;&#21516;&#26102;&#40481;&#34507;&#34987;&#21152;&#28909;&#19988;&#29366;&#24577;&#19981;&#26029;&#21464;&#21270;&#12290;&#22312;&#20197;&#21069;&#30340;&#30740;&#31350;&#20013;&#65292;&#22788;&#29702;&#21464;&#21270;&#30340;&#29289;&#20307;&#34987;&#21457;&#29616;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#65292;&#22240;&#20026;&#24863;&#30693;&#20449;&#24687;&#21253;&#25324;&#21160;&#24577;&#30340;&#12289;&#37325;&#35201;&#25110;&#22024;&#26434;&#30340;&#20449;&#24687;&#65292;&#32780;&#19988;&#27599;&#27425;&#24212;&#35813;&#20851;&#27880;&#30340;&#27169;&#24577;&#19981;&#26029;&#21464;&#21270;&#65292;&#36825;&#20351;&#24471;&#23454;&#29616;&#23454;&#26102;&#24863;&#30693;&#21644;&#21160;&#20316;&#29983;&#25104;&#21464;&#24471;&#22256;&#38590;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#24102;&#26377;&#27880;&#24847;&#26426;&#21046;&#30340;&#39044;&#27979;&#24615;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#65292;&#21487;&#20197;&#26435;&#34913;&#20256;&#24863;&#22120;&#36755;&#20837;&#65292;&#21306;&#20998;&#27599;&#31181;&#27169;&#24577;&#30340;&#37325;&#35201;&#24615;&#21644;&#21487;&#38752;&#24615;&#65292;&#23454;&#29616;&#24555;&#36895;&#21644;&#39640;&#25928;&#30340;&#24863;&#30693;&#21644;&#21160;&#20316;&#29983;&#25104;&#12290;&#27169;&#22411;&#36890;&#36807;&#31034;&#33539;&#23398;&#20064;&#36827;&#34892;&#35757;&#32451;&#65292;&#24182;&#20801;&#35768;&#19981;&#26029;&#26356;&#26032;&#12290;
&lt;/p&gt;
&lt;p&gt;
To support humans in their daily lives, robots are required to autonomously learn, adapt to objects and environments, and perform the appropriate actions. We tackled on the task of cooking scrambled eggs using real ingredients, in which the robot needs to perceive the states of the egg and adjust stirring movement in real time, while the egg is heated and the state changes continuously. In previous works, handling changing objects was found to be challenging because sensory information includes dynamical, both important or noisy information, and the modality which should be focused on changes every time, making it difficult to realize both perception and motion generation in real time. We propose a predictive recurrent neural network with an attention mechanism that can weigh the sensor input, distinguishing how important and reliable each modality is, that realize quick and efficient perception and motion generation. The model is trained with learning from the demonstration, and allow
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#19968;&#33268;&#26102;&#38388;&#36923;&#36753;&#35268;&#21010;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#22810;&#20010;&#39640;&#32423;&#23376;&#20219;&#21153;&#30340;&#31227;&#21160;&#26426;&#22120;&#20154;&#36816;&#21160;&#35268;&#21010;&#38382;&#39064;&#12290;&#20854;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#25361;&#25112;&#26159;&#22914;&#20309;&#20197;&#27491;&#30830;&#24615;&#30340;&#35282;&#24230;&#25512;&#29702;&#26426;&#22120;&#20154;&#35745;&#21010;&#19982;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#30340;&#36923;&#36753;&#20219;&#21153;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2309.10092</link><description>&lt;p&gt;
&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#19968;&#33268;&#26102;&#38388;&#36923;&#36753;&#35268;&#21010;&#65306;&#30693;&#36947;&#20309;&#26102;&#20570;&#20160;&#20040;&#21644;&#20309;&#26102;&#23547;&#27714;&#24110;&#21161;&#12290;
&lt;/p&gt;
&lt;p&gt;
Conformal Temporal Logic Planning using Large Language Models: Knowing When to Do What and When to Ask for Help. (arXiv:2309.10092v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10092
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#19968;&#33268;&#26102;&#38388;&#36923;&#36753;&#35268;&#21010;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#22810;&#20010;&#39640;&#32423;&#23376;&#20219;&#21153;&#30340;&#31227;&#21160;&#26426;&#22120;&#20154;&#36816;&#21160;&#35268;&#21010;&#38382;&#39064;&#12290;&#20854;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#25361;&#25112;&#26159;&#22914;&#20309;&#20197;&#27491;&#30830;&#24615;&#30340;&#35282;&#24230;&#25512;&#29702;&#26426;&#22120;&#20154;&#35745;&#21010;&#19982;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#30340;&#36923;&#36753;&#20219;&#21153;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#19968;&#20010;&#26032;&#30340;&#31227;&#21160;&#26426;&#22120;&#20154;&#36816;&#21160;&#35268;&#21010;&#38382;&#39064;&#65292;&#20219;&#21153;&#26159;&#20197;&#33258;&#28982;&#35821;&#35328;&#65288;NL&#65289;&#34920;&#36798;&#24182;&#20197;&#26102;&#38388;&#21644;&#36923;&#36753;&#39034;&#24207;&#23436;&#25104;&#22810;&#20010;&#39640;&#32423;&#23376;&#20219;&#21153;&#12290;&#20026;&#20102;&#27491;&#24335;&#23450;&#20041;&#36825;&#26679;&#30340;&#20219;&#21153;&#65292;&#25105;&#20204;&#21033;&#29992;&#22522;&#20110;NL&#30340;&#21407;&#23376;&#35859;&#35789;&#22312;LTL&#19978;&#23450;&#20041;&#20102;&#27169;&#22411;&#12290;&#36825;&#19982;&#30456;&#20851;&#30340;&#35268;&#21010;&#26041;&#27861;&#24418;&#25104;&#23545;&#27604;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#21407;&#23376;&#35859;&#35789;&#19978;&#23450;&#20041;&#20102;&#25429;&#25417;&#25152;&#38656;&#20302;&#32423;&#31995;&#32479;&#37197;&#32622;&#30340;LTL&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#35774;&#35745;&#26426;&#22120;&#20154;&#35745;&#21010;&#65292;&#28385;&#36275;&#22522;&#20110;NL&#30340;&#21407;&#23376;&#21629;&#39064;&#23450;&#20041;&#30340;LTL&#20219;&#21153;&#12290;&#22312;&#36825;&#20010;&#35774;&#32622;&#20013;&#20986;&#29616;&#30340;&#19968;&#20010;&#26032;&#30340;&#25216;&#26415;&#25361;&#25112;&#22312;&#20110;&#25512;&#29702;&#26426;&#22120;&#20154;&#35745;&#21010;&#30340;&#27491;&#30830;&#24615;&#19982;&#36825;&#20123;LTL&#32534;&#30721;&#30340;&#20219;&#21153;&#30340;&#20851;&#31995;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;HERACLEs&#65292;&#19968;&#20010;&#20998;&#23618;&#19968;&#33268;&#30340;&#33258;&#28982;&#35821;&#35328;&#35268;&#21010;&#22120;&#65292;&#23427;&#20381;&#36182;&#20110;&#29616;&#26377;&#24037;&#20855;&#30340;&#26032;&#22411;&#25972;&#21512;&#65292;&#21253;&#25324;&#65288;i&#65289;&#33258;&#21160;&#26426;&#29702;&#35770;&#65292;&#20197;&#30830;&#23450;&#26426;&#22120;&#20154;&#24212;&#35813;&#23436;&#25104;&#30340;NL&#25351;&#23450;&#30340;&#23376;&#20219;&#21153;&#20197;&#25512;&#36827;&#20219;&#21153;&#36827;&#23637;&#65307;
&lt;/p&gt;
&lt;p&gt;
This paper addresses a new motion planning problem for mobile robots tasked with accomplishing multiple high-level sub-tasks, expressed using natural language (NL), in a temporal and logical order. To formally define such missions, we leverage LTL defined over NL-based atomic predicates modeling the considered NL-based sub-tasks. This is contrast to related planning approaches that define LTL tasks over atomic predicates capturing desired low-level system configurations. Our goal is to design robot plans that satisfy LTL tasks defined over NL-based atomic propositions. A novel technical challenge arising in this setup lies in reasoning about correctness of a robot plan with respect to such LTL-encoded tasks. To address this problem, we propose HERACLEs, a hierarchical conformal natural language planner, that relies on a novel integration of existing tools that include (i) automata theory to determine the NL-specified sub-task the robot should accomplish next to make mission progress; (
&lt;/p&gt;</description></item></channel></rss>