<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26679;&#26412;&#25928;&#29575;&#23398;&#20064;&#26694;&#26550;&#65292;&#21517;&#20026;&#23398;&#20064;&#25945;&#23398;&#65288;L2T&#65289;&#65292;&#36890;&#36807;&#22238;&#25910;&#25945;&#24072;&#26234;&#33021;&#20307;&#25910;&#38598;&#30340;&#32463;&#39564;&#65292;&#35299;&#20915;&#20102;&#25945;&#24072;-&#23398;&#29983;&#23398;&#20064;&#20013;&#30340;&#26679;&#26412;&#25928;&#29575;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.06783</link><description>&lt;p&gt;
&#23398;&#20064;&#25945;&#23398;&#65306;&#25913;&#21892;&#25945;&#24072;-&#23398;&#29983;&#23398;&#20064;&#20013;&#30340;&#26679;&#26412;&#25928;&#29575;&#65292;&#23454;&#29616;&#20174;&#27169;&#25311;&#21040;&#29616;&#23454;&#30340;&#36801;&#31227;
&lt;/p&gt;
&lt;p&gt;
Learn to Teach: Improve Sample Efficiency in Teacher-student Learning for Sim-to-Real Transfer
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06783
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26679;&#26412;&#25928;&#29575;&#23398;&#20064;&#26694;&#26550;&#65292;&#21517;&#20026;&#23398;&#20064;&#25945;&#23398;&#65288;L2T&#65289;&#65292;&#36890;&#36807;&#22238;&#25910;&#25945;&#24072;&#26234;&#33021;&#20307;&#25910;&#38598;&#30340;&#32463;&#39564;&#65292;&#35299;&#20915;&#20102;&#25945;&#24072;-&#23398;&#29983;&#23398;&#20064;&#20013;&#30340;&#26679;&#26412;&#25928;&#29575;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27169;&#25311;&#21040;&#29616;&#23454;&#65288;sim-to-real&#65289;&#30340;&#36801;&#31227;&#26159;&#26426;&#22120;&#20154;&#23398;&#20064;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#12290;&#22495;&#38543;&#26426;&#21270;&#26159;&#19968;&#31181;&#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#28155;&#21152;&#38543;&#26426;&#24615;&#30340;&#24378;&#22823;&#25216;&#26415;&#65292;&#21487;&#20197;&#26377;&#25928;&#35299;&#20915;&#27169;&#25311;&#19982;&#29616;&#23454;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#28982;&#32780;&#65292;&#35266;&#27979;&#20013;&#30340;&#22122;&#22768;&#20351;&#24471;&#23398;&#20064;&#21464;&#24471;&#26356;&#21152;&#22256;&#38590;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#37319;&#29992;&#25945;&#24072;-&#23398;&#29983;&#23398;&#20064;&#33539;&#24335;&#21487;&#20197;&#21152;&#36895;&#38543;&#26426;&#21270;&#29615;&#22659;&#20013;&#30340;&#35757;&#32451;&#12290;&#36890;&#36807;&#20351;&#29992;&#29305;&#26435;&#20449;&#24687;&#36827;&#34892;&#23398;&#20064;&#65292;&#25945;&#24072;&#26234;&#33021;&#20307;&#21487;&#20197;&#25351;&#23548;&#23398;&#29983;&#26234;&#33021;&#20307;&#22312;&#22122;&#22768;&#29615;&#22659;&#20013;&#25805;&#20316;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#26041;&#27861;&#36890;&#24120;&#19981;&#26159;&#26679;&#26412;&#25928;&#29575;&#30340;&#65292;&#22240;&#20026;&#22312;&#35757;&#32451;&#23398;&#29983;&#26234;&#33021;&#20307;&#26102;&#23436;&#20840;&#33293;&#24323;&#20102;&#25945;&#24072;&#26234;&#33021;&#20307;&#25910;&#38598;&#30340;&#32463;&#39564;&#65292;&#28010;&#36153;&#20102;&#29615;&#22659;&#25152;&#36879;&#38706;&#30340;&#20449;&#24687;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#21517;&#20026;&#23398;&#20064;&#25945;&#23398;&#65288;L2T&#65289;&#30340;&#26679;&#26412;&#25928;&#29575;&#23398;&#20064;&#26694;&#26550;&#26469;&#25193;&#23637;&#25945;&#24072;-&#23398;&#29983;&#23398;&#20064;&#33539;&#24335;&#65292;&#35813;&#26694;&#26550;&#21487;&#20197;&#22238;&#25910;&#25945;&#24072;&#26234;&#33021;&#20307;&#25910;&#38598;&#30340;&#32463;&#39564;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#23545;&#20110;&#19968;&#23545;&#25945;&#24072;-&#23398;&#29983;&#26234;&#33021;&#20307;&#65292;&#29615;&#22659;&#30340;&#21160;&#24577;&#29305;&#24615;&#23545;&#20004;&#32773;&#37117;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Simulation-to-reality (sim-to-real) transfer is a fundamental problem for robot learning. Domain Randomization, which adds randomization during training, is a powerful technique that effectively addresses the sim-to-real gap. However, the noise in observations makes learning significantly harder. Recently, studies have shown that employing a teacher-student learning paradigm can accelerate training in randomized environments. Learned with privileged information, a teacher agent can instruct the student agent to operate in noisy environments. However, this approach is often not sample efficient as the experience collected by the teacher is discarded completely when training the student, wasting information revealed by the environment. In this work, we extend the teacher-student learning paradigm by proposing a sample efficient learning framework termed Learn to Teach (L2T) that recycles experience collected by the teacher agent. We observe that the dynamics of the environments for both 
&lt;/p&gt;</description></item></channel></rss>