<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#24694;&#21155;&#22825;&#27668;&#30340;&#22810;&#27169;&#22359;&#21644;&#27169;&#22359;&#21270;&#31995;&#32479;&#26550;&#26500;&#65292;&#22312;WATonoBus&#24179;&#21488;&#19978;&#36827;&#34892;&#20102;&#23454;&#38469;&#27979;&#35797;&#65292;&#35777;&#26126;&#20854;&#33021;&#22815;&#35299;&#20915;&#20840;&#22825;&#20505;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#38754;&#20020;&#30340;&#25361;&#25112;</title><link>https://arxiv.org/abs/2312.00938</link><description>&lt;p&gt;
WATonoBus&#65306;&#19968;&#31181;&#20840;&#22825;&#20505;&#33258;&#21160;&#24033;&#33322;&#36710;
&lt;/p&gt;
&lt;p&gt;
WATonoBus: An All Weather Autonomous Shuttle
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.00938
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#24694;&#21155;&#22825;&#27668;&#30340;&#22810;&#27169;&#22359;&#21644;&#27169;&#22359;&#21270;&#31995;&#32479;&#26550;&#26500;&#65292;&#22312;WATonoBus&#24179;&#21488;&#19978;&#36827;&#34892;&#20102;&#23454;&#38469;&#27979;&#35797;&#65292;&#35777;&#26126;&#20854;&#33021;&#22815;&#35299;&#20915;&#20840;&#22825;&#20505;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#38754;&#20020;&#30340;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#22312;&#20840;&#22825;&#20505;&#36816;&#34892;&#20013;&#38754;&#20020;&#26174;&#33879;&#25361;&#25112;&#65292;&#28085;&#30422;&#20102;&#20174;&#24863;&#30693;&#21644;&#20915;&#31574;&#21040;&#36335;&#24452;&#35268;&#21010;&#21644;&#25511;&#21046;&#30340;&#21508;&#20010;&#27169;&#22359;&#12290;&#22797;&#26434;&#24615;&#28304;&#20110;&#38656;&#35201;&#35299;&#20915;&#20687;&#38632;&#12289;&#38634;&#21644;&#38654;&#31561;&#24694;&#21155;&#22825;&#27668;&#26465;&#20214;&#22312;&#33258;&#20027;&#24615;&#22534;&#26632;&#20013;&#30340;&#38382;&#39064;&#12290;&#20256;&#32479;&#30340;&#22522;&#20110;&#27169;&#22411;&#21644;&#21333;&#27169;&#22359;&#26041;&#27861;&#36890;&#24120;&#32570;&#20047;&#19982;&#19978;&#28216;&#25110;&#19979;&#28216;&#20219;&#21153;&#30340;&#25972;&#20307;&#38598;&#25104;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#32771;&#34385;&#24694;&#21155;&#22825;&#27668;&#30340;&#22810;&#27169;&#22359;&#21644;&#27169;&#22359;&#21270;&#31995;&#32479;&#26550;&#26500;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#28085;&#30422;&#20102;&#20174;&#24863;&#30693;&#27700;&#24179;&#21040;&#20915;&#31574;&#21644;&#23433;&#20840;&#30417;&#27979;&#30340;&#21508;&#20010;&#26041;&#38754;&#65292;&#20363;&#22914;&#35206;&#30422;&#38634;&#30340;&#36335;&#32536;&#26816;&#27979;&#12290;&#36890;&#36807;&#22312;WATonoBus&#24179;&#21488;&#19978;&#27599;&#21608;&#26085;&#24120;&#26381;&#21153;&#36817;&#19968;&#24180;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#33021;&#22815;&#35299;&#20915;&#24694;&#21155;&#22825;&#27668;&#26465;&#20214;&#65292;&#24182;&#20174;&#36816;&#33829;&#20013;&#35266;&#23519;&#21040;&#30340;&#26497;&#31471;&#24773;&#20917;&#20013;&#33719;&#24471;&#23453;&#36149;&#30340;&#32463;&#39564;&#25945;&#35757;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.00938v1 Announce Type: cross  Abstract: Autonomous vehicle all-weather operation poses significant challenges, encompassing modules from perception and decision-making to path planning and control. The complexity arises from the need to address adverse weather conditions like rain, snow, and fog across the autonomy stack. Conventional model-based and single-module approaches often lack holistic integration with upstream or downstream tasks. We tackle this problem by proposing a multi-module and modular system architecture with considerations for adverse weather across the perception level, through features such as snow covered curb detection, to decision-making and safety monitoring. Through daily weekday service on the WATonoBus platform for almost a year, we demonstrate that our proposed approach is capable of addressing adverse weather conditions and provide valuable learning from edge cases observed during operation.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#65292;&#21033;&#29992;&#23618;&#27425;&#21270;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#23454;&#29616;&#21516;&#26102;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#24341;&#20837;&#23618;&#27425;&#21270;&#32467;&#26500;&#21040;LTL&#35268;&#33539;&#20013;&#65292;&#35813;&#26041;&#27861;&#26356;&#20855;&#34920;&#36798;&#33021;&#21147;&#12290;&#37319;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#26041;&#27861;&#26469;&#32508;&#21512;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#35745;&#21010;&#65292;&#23558;&#25628;&#32034;&#31354;&#38388;&#25286;&#20998;&#20026;&#26494;&#25955;&#30456;&#20114;&#36830;&#25509;&#30340;&#23376;&#31354;&#38388;&#65292;&#20197;&#20415;&#26356;&#39640;&#25928;&#22320;&#36827;&#34892;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#12290;</title><link>http://arxiv.org/abs/2401.04003</link><description>&lt;p&gt;
&#22810;&#26426;&#22120;&#20154;&#22312;&#23618;&#27425;&#21270;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#19979;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Simultaneous Task Allocation and Planning for Multi-Robots under Hierarchical Temporal Logic Specifications. (arXiv:2401.04003v2 [cs.RO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04003
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#65292;&#21033;&#29992;&#23618;&#27425;&#21270;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#23454;&#29616;&#21516;&#26102;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#24341;&#20837;&#23618;&#27425;&#21270;&#32467;&#26500;&#21040;LTL&#35268;&#33539;&#20013;&#65292;&#35813;&#26041;&#27861;&#26356;&#20855;&#34920;&#36798;&#33021;&#21147;&#12290;&#37319;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#26041;&#27861;&#26469;&#32508;&#21512;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#35745;&#21010;&#65292;&#23558;&#25628;&#32034;&#31354;&#38388;&#25286;&#20998;&#20026;&#26494;&#25955;&#30456;&#20114;&#36830;&#25509;&#30340;&#23376;&#31354;&#38388;&#65292;&#20197;&#20415;&#26356;&#39640;&#25928;&#22320;&#36827;&#34892;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20851;&#20110;&#26426;&#22120;&#20154;&#35268;&#21010;&#19982;&#26102;&#38388;&#36923;&#36753;&#35268;&#33539;&#30340;&#30740;&#31350;&#65292;&#29305;&#21035;&#26159;&#32447;&#24615;&#26102;&#38388;&#36923;&#36753;&#65288;LTL&#65289;&#65292;&#20027;&#35201;&#26159;&#22522;&#20110;&#38024;&#23545;&#20010;&#20307;&#25110;&#32676;&#20307;&#26426;&#22120;&#20154;&#30340;&#21333;&#19968;&#20844;&#24335;&#12290;&#20294;&#38543;&#30528;&#20219;&#21153;&#22797;&#26434;&#24615;&#30340;&#22686;&#21152;&#65292;LTL&#20844;&#24335;&#19981;&#21487;&#36991;&#20813;&#22320;&#21464;&#24471;&#20887;&#38271;&#65292;&#20351;&#35299;&#37322;&#21644;&#35268;&#33539;&#29983;&#25104;&#21464;&#24471;&#22797;&#26434;&#65292;&#21516;&#26102;&#36824;&#23545;&#35268;&#21010;&#22120;&#30340;&#35745;&#31639;&#33021;&#21147;&#36896;&#25104;&#21387;&#21147;&#12290;&#36890;&#36807;&#21033;&#29992;&#20219;&#21153;&#30340;&#20869;&#22312;&#32467;&#26500;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#23618;&#27425;&#21270;&#32467;&#26500;&#21040;&#20855;&#26377;&#35821;&#27861;&#21644;&#35821;&#20041;&#38656;&#27714;&#30340;LTL&#35268;&#33539;&#20013;&#65292;&#24182;&#35777;&#26126;&#23427;&#20204;&#27604;&#25153;&#24179;&#35268;&#33539;&#26356;&#20855;&#34920;&#36798;&#33021;&#21147;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#37319;&#29992;&#22522;&#20110;&#25628;&#32034;&#30340;&#26041;&#27861;&#26469;&#32508;&#21512;&#22810;&#26426;&#22120;&#20154;&#31995;&#32479;&#30340;&#35745;&#21010;&#65292;&#23454;&#29616;&#21516;&#26102;&#30340;&#20219;&#21153;&#20998;&#37197;&#21644;&#35268;&#21010;&#12290;&#25628;&#32034;&#31354;&#38388;&#30001;&#26494;&#25955;&#30456;&#20114;&#36830;&#25509;&#30340;&#23376;&#31354;&#38388;&#36817;&#20284;&#34920;&#31034;&#65292;&#27599;&#20010;&#23376;&#31354;&#38388;&#23545;&#24212;&#19968;&#20010;LTL&#35268;&#33539;&#12290;&#25628;&#32034;&#20027;&#35201;&#21463;&#38480;&#20110;&#21333;&#20010;&#23376;&#31354;&#38388;&#65292;&#26681;&#25454;&#29305;&#23450;&#26465;&#20214;&#36716;&#31227;&#21040;&#21478;&#19968;&#20010;&#23376;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
Past research into robotic planning with temporal logic specifications, notably Linear Temporal Logic (LTL), was largely based on singular formulas for individual or groups of robots. But with increasing task complexity, LTL formulas unavoidably grow lengthy, complicating interpretation and specification generation, and straining the computational capacities of the planners. By leveraging the intrinsic structure of tasks, we introduced a hierarchical structure to LTL specifications with requirements on syntax and semantics, and proved that they are more expressive than their flat counterparts. Second, we employ a search-based approach to synthesize plans for a multi-robot system, accomplishing simultaneous task allocation and planning. The search space is approximated by loosely interconnected sub-spaces, with each sub-space corresponding to one LTL specification. The search is predominantly confined to a single sub-space, transitioning to another sub-space under certain conditions, de
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#35843;&#26597;&#20102;&#31471;&#21040;&#31471;&#33258;&#21160;&#39550;&#39542;&#39046;&#22495;&#20013;&#30340;&#20851;&#38190;&#25361;&#25112;&#21644;&#26410;&#26469;&#36235;&#21183;&#65292;&#21253;&#25324;&#22810;&#27169;&#24577;&#12289;&#21487;&#35299;&#37322;&#24615;&#12289;&#22240;&#26524;&#28151;&#28102;&#12289;&#40065;&#26834;&#24615;&#21644;&#19990;&#30028;&#27169;&#22411;&#31561;&#12290;&#36890;&#36807;&#32852;&#21512;&#29305;&#24449;&#20248;&#21270;&#24863;&#30693;&#21644;&#35268;&#21010;&#65292;&#31471;&#21040;&#31471;&#31995;&#32479;&#22312;&#24863;&#30693;&#21644;&#35268;&#21010;&#19978;&#33719;&#24471;&#20102;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.16927</link><description>&lt;p&gt;
&#32447;&#26463;&#33258;&#21160;&#39550;&#39542;&#65306;&#25361;&#25112;&#19982;&#21069;&#26223;
&lt;/p&gt;
&lt;p&gt;
End-to-end Autonomous Driving: Challenges and Frontiers. (arXiv:2306.16927v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16927
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#35843;&#26597;&#20102;&#31471;&#21040;&#31471;&#33258;&#21160;&#39550;&#39542;&#39046;&#22495;&#20013;&#30340;&#20851;&#38190;&#25361;&#25112;&#21644;&#26410;&#26469;&#36235;&#21183;&#65292;&#21253;&#25324;&#22810;&#27169;&#24577;&#12289;&#21487;&#35299;&#37322;&#24615;&#12289;&#22240;&#26524;&#28151;&#28102;&#12289;&#40065;&#26834;&#24615;&#21644;&#19990;&#30028;&#27169;&#22411;&#31561;&#12290;&#36890;&#36807;&#32852;&#21512;&#29305;&#24449;&#20248;&#21270;&#24863;&#30693;&#21644;&#35268;&#21010;&#65292;&#31471;&#21040;&#31471;&#31995;&#32479;&#22312;&#24863;&#30693;&#21644;&#35268;&#21010;&#19978;&#33719;&#24471;&#20102;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#39550;&#39542;&#39046;&#22495;&#27491;&#22312;&#36805;&#36895;&#21457;&#23637;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#26041;&#27861;&#37319;&#29992;&#31471;&#21040;&#31471;&#31639;&#27861;&#26694;&#26550;&#65292;&#21033;&#29992;&#21407;&#22987;&#20256;&#24863;&#22120;&#36755;&#20837;&#29983;&#25104;&#36710;&#36742;&#36816;&#21160;&#35745;&#21010;&#65292;&#32780;&#19981;&#26159;&#19987;&#27880;&#20110;&#35832;&#22914;&#26816;&#27979;&#21644;&#36816;&#21160;&#39044;&#27979;&#31561;&#21333;&#20010;&#20219;&#21153;&#12290;&#19982;&#27169;&#22359;&#21270;&#27969;&#27700;&#32447;&#30456;&#27604;&#65292;&#31471;&#21040;&#31471;&#31995;&#32479;&#36890;&#36807;&#32852;&#21512;&#29305;&#24449;&#20248;&#21270;&#24863;&#30693;&#21644;&#35268;&#21010;&#26469;&#33719;&#30410;&#12290;&#36825;&#19968;&#39046;&#22495;&#22240;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#30340;&#21487;&#29992;&#24615;&#12289;&#38381;&#29615;&#35780;&#20272;&#20197;&#21450;&#33258;&#21160;&#39550;&#39542;&#31639;&#27861;&#22312;&#25361;&#25112;&#24615;&#22330;&#26223;&#20013;&#30340;&#26377;&#25928;&#25191;&#34892;&#25152;&#38656;&#30340;&#38656;&#27714;&#32780;&#34028;&#21187;&#21457;&#23637;&#12290;&#22312;&#26412;&#35843;&#26597;&#20013;&#65292;&#25105;&#20204;&#20840;&#38754;&#20998;&#26512;&#20102;250&#22810;&#31687;&#35770;&#25991;&#65292;&#28085;&#30422;&#20102;&#31471;&#21040;&#31471;&#33258;&#21160;&#39550;&#39542;&#30340;&#21160;&#26426;&#12289;&#36335;&#32447;&#22270;&#12289;&#26041;&#27861;&#35770;&#12289;&#25361;&#25112;&#21644;&#26410;&#26469;&#36235;&#21183;&#12290;&#25105;&#20204;&#28145;&#20837;&#25506;&#35752;&#20102;&#22810;&#27169;&#24577;&#12289;&#21487;&#35299;&#37322;&#24615;&#12289;&#22240;&#26524;&#28151;&#28102;&#12289;&#40065;&#26834;&#24615;&#21644;&#19990;&#30028;&#27169;&#22411;&#31561;&#20960;&#20010;&#20851;&#38190;&#25361;&#25112;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#22522;&#30784;&#25216;&#26415;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
The autonomous driving community has witnessed a rapid growth in approaches that embrace an end-to-end algorithm framework, utilizing raw sensor input to generate vehicle motion plans, instead of concentrating on individual tasks such as detection and motion prediction. End-to-end systems, in comparison to modular pipelines, benefit from joint feature optimization for perception and planning. This field has flourished due to the availability of large-scale datasets, closed-loop evaluation, and the increasing need for autonomous driving algorithms to perform effectively in challenging scenarios. In this survey, we provide a comprehensive analysis of more than 250 papers, covering the motivation, roadmap, methodology, challenges, and future trends in end-to-end autonomous driving. We delve into several critical challenges, including multi-modality, interpretability, causal confusion, robustness, and world models, amongst others. Additionally, we discuss current advancements in foundation
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27169;&#20223;&#23398;&#20064;&#21644;&#39044;&#27979;&#23433;&#20840;&#36807;&#28388;&#22120;&#36827;&#34892;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(NMPC)&#30340;&#23433;&#20840;&#36817;&#20284;&#30340;&#26694;&#26550;&#65292;&#20197;&#23454;&#29616;&#23545;&#26580;&#24615;&#26426;&#22120;&#20154;&#30340;&#24555;&#36895;&#25511;&#21046;&#12290;&#19982;NMPC&#30456;&#27604;&#65292;&#22312;&#20445;&#35777;&#23433;&#20840;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#35745;&#31639;&#26102;&#38388;&#19978;&#25913;&#21892;&#20102;8&#20493;&#20197;&#19978;&#12290;</title><link>http://arxiv.org/abs/2212.02941</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#22312;&#26580;&#24615;&#26426;&#22120;&#20154;&#20013;&#30340;&#23433;&#20840;&#27169;&#20223;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Safe Imitation Learning of Nonlinear Model Predictive Control for Flexible Robots. (arXiv:2212.02941v2 [cs.RO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.02941
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27169;&#20223;&#23398;&#20064;&#21644;&#39044;&#27979;&#23433;&#20840;&#36807;&#28388;&#22120;&#36827;&#34892;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(NMPC)&#30340;&#23433;&#20840;&#36817;&#20284;&#30340;&#26694;&#26550;&#65292;&#20197;&#23454;&#29616;&#23545;&#26580;&#24615;&#26426;&#22120;&#20154;&#30340;&#24555;&#36895;&#25511;&#21046;&#12290;&#19982;NMPC&#30456;&#27604;&#65292;&#22312;&#20445;&#35777;&#23433;&#20840;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#35745;&#31639;&#26102;&#38388;&#19978;&#25913;&#21892;&#20102;8&#20493;&#20197;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26580;&#24615;&#26426;&#22120;&#20154;&#21487;&#20197;&#35299;&#20915;&#19968;&#20123;&#24037;&#19994;&#39046;&#22495;&#30340;&#20027;&#35201;&#25361;&#25112;&#65292;&#22914;&#23454;&#29616;&#22266;&#26377;&#23433;&#20840;&#30340;&#20154;&#26426;&#21327;&#20316;&#21644;&#23454;&#29616;&#26356;&#39640;&#30340;&#36127;&#36733;&#37325;&#37327;&#27604;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20854;&#22797;&#26434;&#30340;&#21160;&#21147;&#23398;&#29305;&#24615;&#65292;&#21253;&#25324;&#25391;&#33633;&#34892;&#20026;&#21644;&#39640;&#32500;&#29366;&#24577;&#31354;&#38388;&#65292;&#25511;&#21046;&#26580;&#24615;&#26426;&#22120;&#20154;&#38750;&#24120;&#22797;&#26434;&#12290;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(NMPC)&#33021;&#22815;&#26377;&#25928;&#25511;&#21046;&#27492;&#31867;&#26426;&#22120;&#20154;&#65292;&#20294;&#20854;&#35745;&#31639;&#38656;&#27714;&#36739;&#39640;&#24120;&#24120;&#38480;&#21046;&#20854;&#22312;&#23454;&#26102;&#22330;&#26223;&#20013;&#30340;&#24212;&#29992;&#12290;&#20026;&#20102;&#23454;&#29616;&#23545;&#26580;&#24615;&#26426;&#22120;&#20154;&#30340;&#24555;&#36895;&#25511;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27169;&#20223;&#23398;&#20064;&#21644;&#39044;&#27979;&#23433;&#20840;&#36807;&#28388;&#22120;&#36827;&#34892;NMPC&#30340;&#23433;&#20840;&#36817;&#20284;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#26174;&#33879;&#20943;&#23569;&#20102;&#35745;&#31639;&#26102;&#38388;&#65292;&#21516;&#26102;&#22312;&#24615;&#33021;&#19978;&#30053;&#26377;&#25439;&#22833;&#12290;&#19982;NMPC&#30456;&#27604;&#65292;&#22312;&#27169;&#25311;&#20013;&#25511;&#21046;&#19968;&#20010;&#19977;&#32500;&#26580;&#24615;&#26426;&#26800;&#33218;&#26102;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#35745;&#31639;&#26102;&#38388;&#19978;&#25913;&#21892;&#20102;8&#20493;&#20197;&#19978;&#65292;&#21516;&#26102;&#20445;&#35777;&#20102;&#23433;&#20840;&#32422;&#26463;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20248;&#20110;&#20256;&#32479;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Flexible robots may overcome some of the industry's major challenges, such as enabling intrinsically safe human-robot collaboration and achieving a higher load-to-mass ratio. However, controlling flexible robots is complicated due to their complex dynamics, which include oscillatory behavior and a high-dimensional state space. NMPC offers an effective means to control such robots, but its extensive computational demands often limit its application in real-time scenarios. To enable fast control of flexible robots, we propose a framework for a safe approximation of NMPC using imitation learning and a predictive safety filter. Our framework significantly reduces computation time while incurring a slight loss in performance. Compared to NMPC, our framework shows more than a eightfold improvement in computation time when controlling a three-dimensional flexible robot arm in simulation, all while guaranteeing safety constraints. Notably, our approach outperforms conventional reinforcement le
&lt;/p&gt;</description></item></channel></rss>