<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#26680;&#20989;&#25968;&#30340;&#24555;&#36895;&#36941;&#21382;&#25628;&#32034;&#26041;&#27861;&#65292;&#20854;&#22312;&#25628;&#32034;&#31354;&#38388;&#32500;&#24230;&#19978;&#20855;&#26377;&#32447;&#24615;&#22797;&#26434;&#24230;&#65292;&#21487;&#20197;&#25512;&#24191;&#21040;&#26446;&#32676;&#65292;&#24182;&#19988;&#36890;&#36807;&#25968;&#20540;&#27979;&#35797;&#23637;&#31034;&#27604;&#29616;&#26377;&#31639;&#27861;&#24555;&#20004;&#20010;&#25968;&#37327;&#32423;&#12290;</title><link>https://arxiv.org/abs/2403.01536</link><description>&lt;p&gt;
&#20351;&#29992;&#26680;&#20989;&#25968;&#30340;&#24555;&#36895;&#36941;&#21382;&#25628;&#32034;
&lt;/p&gt;
&lt;p&gt;
Fast Ergodic Search with Kernel Functions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01536
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#26680;&#20989;&#25968;&#30340;&#24555;&#36895;&#36941;&#21382;&#25628;&#32034;&#26041;&#27861;&#65292;&#20854;&#22312;&#25628;&#32034;&#31354;&#38388;&#32500;&#24230;&#19978;&#20855;&#26377;&#32447;&#24615;&#22797;&#26434;&#24230;&#65292;&#21487;&#20197;&#25512;&#24191;&#21040;&#26446;&#32676;&#65292;&#24182;&#19988;&#36890;&#36807;&#25968;&#20540;&#27979;&#35797;&#23637;&#31034;&#27604;&#29616;&#26377;&#31639;&#27861;&#24555;&#20004;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36941;&#21382;&#25628;&#32034;&#20351;&#24471;&#23545;&#20449;&#24687;&#20998;&#24067;&#36827;&#34892;&#26368;&#20339;&#25506;&#32034;&#25104;&#20026;&#21487;&#33021;&#65292;&#21516;&#26102;&#20445;&#35777;&#20102;&#23545;&#25628;&#32034;&#31354;&#38388;&#30340;&#28176;&#36817;&#35206;&#30422;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#26041;&#27861;&#36890;&#24120;&#22312;&#25628;&#32034;&#31354;&#38388;&#32500;&#24230;&#19978;&#20855;&#26377;&#25351;&#25968;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#24182;&#19988;&#23616;&#38480;&#20110;&#27431;&#20960;&#37324;&#24471;&#31354;&#38388;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#35745;&#31639;&#39640;&#25928;&#30340;&#36941;&#21382;&#25628;&#32034;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26159;&#21452;&#37325;&#30340;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#22522;&#20110;&#26680;&#30340;&#36941;&#21382;&#24230;&#37327;&#65292;&#24182;&#23558;&#20854;&#20174;&#27431;&#20960;&#37324;&#24471;&#31354;&#38388;&#25512;&#24191;&#21040;&#26446;&#32676;&#19978;&#12290;&#25105;&#20204;&#27491;&#24335;&#35777;&#26126;&#20102;&#25152;&#24314;&#35758;&#30340;&#24230;&#37327;&#19982;&#26631;&#20934;&#36941;&#21382;&#24230;&#37327;&#19968;&#33268;&#65292;&#21516;&#26102;&#20445;&#35777;&#20102;&#22312;&#25628;&#32034;&#31354;&#38388;&#32500;&#24230;&#19978;&#20855;&#26377;&#32447;&#24615;&#22797;&#26434;&#24230;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#38750;&#32447;&#24615;&#31995;&#32479;&#30340;&#26680;&#36941;&#21382;&#24230;&#37327;&#30340;&#19968;&#38454;&#26368;&#20248;&#24615;&#26465;&#20214;&#65292;&#36825;&#20351;&#24471;&#36712;&#36857;&#20248;&#21270;&#21464;&#24471;&#26356;&#21152;&#39640;&#25928;&#12290;&#20840;&#38754;&#30340;&#25968;&#20540;&#22522;&#20934;&#27979;&#35797;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#33267;&#23569;&#27604;&#29616;&#26377;&#26368;&#20808;&#36827;&#30340;&#31639;&#27861;&#24555;&#20004;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01536v1 Announce Type: cross  Abstract: Ergodic search enables optimal exploration of an information distribution while guaranteeing the asymptotic coverage of the search space. However, current methods typically have exponential computation complexity in the search space dimension and are restricted to Euclidean space. We introduce a computationally efficient ergodic search method. Our contributions are two-fold. First, we develop a kernel-based ergodic metric and generalize it from Euclidean space to Lie groups. We formally prove the proposed metric is consistent with the standard ergodic metric while guaranteeing linear complexity in the search space dimension. Secondly, we derive the first-order optimality condition of the kernel ergodic metric for nonlinear systems, which enables efficient trajectory optimization. Comprehensive numerical benchmarks show that the proposed method is at least two orders of magnitude faster than the state-of-the-art algorithm. Finally, we d
&lt;/p&gt;</description></item></channel></rss>