<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#24320;&#21457;&#20102;&#36830;&#32493;&#39550;&#39542;&#25919;&#31574;&#20248;&#21270;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#38381;&#29615;&#20010;&#24615;&#21270;&#35838;&#31243;&#65288;CLIC&#65289;&#27010;&#24565;&#65292;&#20801;&#35768;&#37325;&#22797;&#21033;&#29992;&#24191;&#27867;&#22330;&#26223;&#26469;&#36845;&#20195;&#25913;&#36827;&#33258;&#20027;&#39550;&#39542;&#36710;&#36742;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2309.14209</link><description>&lt;p&gt;
&#20855;&#26377;&#38381;&#29615;&#20010;&#24615;&#21270;&#35838;&#31243;&#30340;&#36830;&#32493;&#39550;&#39542;&#25919;&#31574;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Continual Driving Policy Optimization with Closed-Loop Individualized Curricula
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2309.14209
&lt;/p&gt;
&lt;p&gt;
&#24320;&#21457;&#20102;&#36830;&#32493;&#39550;&#39542;&#25919;&#31574;&#20248;&#21270;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#38381;&#29615;&#20010;&#24615;&#21270;&#35838;&#31243;&#65288;CLIC&#65289;&#27010;&#24565;&#65292;&#20801;&#35768;&#37325;&#22797;&#21033;&#29992;&#24191;&#27867;&#22330;&#26223;&#26469;&#36845;&#20195;&#25913;&#36827;&#33258;&#20027;&#39550;&#39542;&#36710;&#36742;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#20027;&#39550;&#39542;&#36710;&#36742;&#65288;AV&#65289;&#30340;&#23433;&#20840;&#19968;&#30452;&#26159;&#19968;&#20010;&#38271;&#26399;&#30340;&#22836;&#31561;&#20851;&#27880;&#28857;&#65292;&#26681;&#28304;&#20110;&#38271;&#23614;&#33258;&#28982;&#39550;&#39542;&#20998;&#24067;&#20013;&#32597;&#35265;&#30340;&#23433;&#20840;&#20851;&#38190;&#22330;&#26223;&#30340;&#32570;&#22833;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#20986;&#29616;&#20102;&#22823;&#37327;&#22522;&#20110;&#22330;&#26223;&#30340;&#33258;&#21160;&#39550;&#39542;&#30740;&#31350;&#65292;&#37325;&#28857;&#26159;&#29983;&#25104;&#39640;&#39118;&#38505;&#39550;&#39542;&#22330;&#26223;&#24182;&#23558;&#23427;&#20204;&#24212;&#29992;&#20110;&#23545;AV&#27169;&#22411;&#36827;&#34892;&#23433;&#20840;&#20851;&#38190;&#27979;&#35797;&#12290;&#28982;&#32780;&#65292;&#26377;&#38480;&#30340;&#24037;&#20316;&#25506;&#35752;&#20102;&#37325;&#22797;&#21033;&#29992;&#36825;&#20123;&#24191;&#27867;&#22330;&#26223;&#26469;&#36845;&#20195;&#25913;&#36827;AV&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#20174;&#20855;&#26377;&#19981;&#21516;&#34892;&#20026;&#30340;&#20854;&#20182;AV&#27169;&#22411;&#25910;&#38598;&#30340;&#24040;&#22823;&#22330;&#26223;&#24211;&#20013;&#28388;&#20986;&#21487;&#20256;&#36882;&#20449;&#24687;&#20197;&#25913;&#36827;&#24403;&#21069;AV&#20173;&#28982;&#26159;&#38590;&#20197;&#35299;&#20915;&#30340;&#19988;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20855;&#26377;&#38381;&#29615;&#20010;&#24615;&#21270;&#35838;&#31243;&#65288;CLIC&#65289;&#29305;&#28857;&#30340;&#36830;&#32493;&#39550;&#39542;&#25919;&#31574;&#20248;&#21270;&#26694;&#26550;&#65292;&#25105;&#20204;&#23558;&#20854;&#20998;&#35299;&#20026;&#19968;&#32452;&#26631;&#20934;&#21270;&#30340;&#23376;&#27169;&#22359;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2309.14209v3 Announce Type: replace-cross  Abstract: The safety of autonomous vehicles (AV) has been a long-standing top concern, stemming from the absence of rare and safety-critical scenarios in the long-tail naturalistic driving distribution. To tackle this challenge, a surge of research in scenario-based autonomous driving has emerged, with a focus on generating high-risk driving scenarios and applying them to conduct safety-critical testing of AV models. However, limited work has been explored on the reuse of these extensive scenarios to iteratively improve AV models. Moreover, it remains intractable and challenging to filter through gigantic scenario libraries collected from other AV models with distinct behaviors, attempting to extract transferable information for current AV improvement. Therefore, we develop a continual driving policy optimization framework featuring Closed-Loop Individualized Curricula (CLIC), which we factorize into a set of standardized sub-modules for
&lt;/p&gt;</description></item></channel></rss>