<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#33258;&#21160;&#21270;&#26694;&#26550;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#25552;&#31034;&#31574;&#30053;&#23558;&#36712;&#36857;&#25968;&#25454;&#20998;&#35299;&#20026;&#26102;&#38388;&#21644;&#35821;&#35328;&#25551;&#36848;&#30340;&#23376;&#20219;&#21153;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#26102;&#38388;&#30456;&#20284;&#24615;&#21644;&#35821;&#20041;&#30456;&#20284;&#24615;&#20004;&#31181;&#26032;&#30340;&#35780;&#20272;&#25351;&#26631;&#12290;</title><link>https://arxiv.org/abs/2403.17238</link><description>&lt;p&gt;
&#22522;&#20110;&#26102;&#38388;&#21644;&#35821;&#20041;&#35780;&#20272;&#25351;&#26631;&#30340;&#22522;&#30784;&#27169;&#22411;&#22312;&#26426;&#22120;&#20154;&#23376;&#20219;&#21153;&#20107;&#21518;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Temporal and Semantic Evaluation Metrics for Foundation Models in Post-Hoc Analysis of Robotic Sub-tasks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17238
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#33258;&#21160;&#21270;&#26694;&#26550;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#25552;&#31034;&#31574;&#30053;&#23558;&#36712;&#36857;&#25968;&#25454;&#20998;&#35299;&#20026;&#26102;&#38388;&#21644;&#35821;&#35328;&#25551;&#36848;&#30340;&#23376;&#20219;&#21153;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#26102;&#38388;&#30456;&#20284;&#24615;&#21644;&#35821;&#20041;&#30456;&#20284;&#24615;&#20004;&#31181;&#26032;&#30340;&#35780;&#20272;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#22312;&#20219;&#21153;&#21644;&#36816;&#21160;&#35268;&#21010;&#65288;TAMP&#65289;&#39046;&#22495;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#20351;&#29992;&#24102;&#26377;&#36136;&#37327;&#26631;&#35760;&#25968;&#25454;&#30340;&#35821;&#35328;&#30417;&#30563;&#26426;&#22120;&#20154;&#36712;&#36857;&#36827;&#34892;&#25511;&#21046;&#31574;&#30053;&#35757;&#32451;&#21487;&#20197;&#26174;&#30528;&#25552;&#39640;&#20195;&#29702;&#20219;&#21153;&#25104;&#21151;&#29575;&#12290;&#28982;&#32780;&#65292;&#36825;&#31867;&#25968;&#25454;&#30340;&#31232;&#32570;&#24615;&#23545;&#23558;&#36825;&#20123;&#26041;&#27861;&#25193;&#23637;&#21040;&#19968;&#33324;&#29992;&#20363;&#26500;&#25104;&#37325;&#22823;&#38556;&#30861;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#26694;&#26550;&#65292;&#36890;&#36807;&#21033;&#29992;&#26368;&#36817;&#30340;&#22522;&#30784;&#27169;&#22411;&#65288;FMs&#65289;&#30340;&#25552;&#31034;&#31574;&#30053;&#65292;&#21253;&#25324;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#21644;&#35270;&#35273;&#35821;&#35328;&#27169;&#22411;&#65288;VLMs&#65289;&#65292;&#23558;&#36712;&#36857;&#25968;&#25454;&#20998;&#35299;&#20026;&#22522;&#20110;&#26102;&#38388;&#21644;&#33258;&#28982;&#35821;&#35328;&#30340;&#25551;&#36848;&#24615;&#23376;&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#20026;&#26500;&#25104;&#23436;&#25972;&#36712;&#36857;&#30340;&#24213;&#23618;&#23376;&#20219;&#21153;&#25552;&#20379;&#20102;&#22522;&#20110;&#26102;&#38388;&#21644;&#35821;&#35328;&#30340;&#25551;&#36848;&#12290;&#20026;&#20102;&#20005;&#26684;&#35780;&#20272;&#25105;&#20204;&#30340;&#33258;&#21160;&#26631;&#35760;&#26694;&#26550;&#30340;&#36136;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31639;&#27861; SIMILARITY &#26469;&#29983;&#25104;&#20004;&#31181;&#26032;&#39062;&#30340;&#25351;&#26631;&#65292;&#21363;&#26102;&#38388;&#30456;&#20284;&#24615;&#21644;&#35821;&#20041;&#30456;&#20284;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17238v1 Announce Type: cross  Abstract: Recent works in Task and Motion Planning (TAMP) show that training control policies on language-supervised robot trajectories with quality labeled data markedly improves agent task success rates. However, the scarcity of such data presents a significant hurdle to extending these methods to general use cases. To address this concern, we present an automated framework to decompose trajectory data into temporally bounded and natural language-based descriptive sub-tasks by leveraging recent prompting strategies for Foundation Models (FMs) including both Large Language Models (LLMs) and Vision Language Models (VLMs). Our framework provides both time-based and language-based descriptions for lower-level sub-tasks that comprise full trajectories. To rigorously evaluate the quality of our automatic labeling framework, we contribute an algorithm SIMILARITY to produce two novel metrics, temporal similarity and semantic similarity. The metrics me
&lt;/p&gt;</description></item></channel></rss>