<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>CoBOS&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22312;&#32447;&#22522;&#20110;&#32422;&#26463;&#30340;&#35843;&#24230;&#26041;&#27861;&#65292;&#22312;&#20154;&#26426;&#21327;&#20316;&#20013;&#23454;&#29616;&#20102;&#26426;&#22120;&#20154;&#23545;&#19981;&#30830;&#23450;&#20107;&#20214;&#30340;&#36866;&#24212;&#24615;&#65292;&#22823;&#22823;&#20943;&#36731;&#20102;&#29992;&#25143;&#30340;&#21387;&#21147;&#65292;&#25552;&#39640;&#20102;&#24037;&#20316;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.18459</link><description>&lt;p&gt;
CoBOS: &#22522;&#20110;&#32422;&#26463;&#30340;&#20154;&#26426;&#21327;&#20316;&#22312;&#32447;&#35843;&#24230;&#22120;
&lt;/p&gt;
&lt;p&gt;
CoBOS: Constraint-Based Online Scheduler for Human-Robot Collaboration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18459
&lt;/p&gt;
&lt;p&gt;
CoBOS&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22312;&#32447;&#22522;&#20110;&#32422;&#26463;&#30340;&#35843;&#24230;&#26041;&#27861;&#65292;&#22312;&#20154;&#26426;&#21327;&#20316;&#20013;&#23454;&#29616;&#20102;&#26426;&#22120;&#20154;&#23545;&#19981;&#30830;&#23450;&#20107;&#20214;&#30340;&#36866;&#24212;&#24615;&#65292;&#22823;&#22823;&#20943;&#36731;&#20102;&#29992;&#25143;&#30340;&#21387;&#21147;&#65292;&#25552;&#39640;&#20102;&#24037;&#20316;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28041;&#21450;&#20154;&#31867;&#21644;&#26426;&#22120;&#20154;&#30340;&#35013;&#37197;&#36807;&#31243;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#22330;&#26223;&#65292;&#22240;&#20026;&#20010;&#20154;&#27963;&#21160;&#21644;&#20849;&#20139;&#24037;&#20316;&#31354;&#38388;&#30340;&#35775;&#38382;&#24517;&#39035;&#21327;&#35843;&#12290;&#22266;&#23450;&#30340;&#26426;&#22120;&#20154;&#31243;&#24207;&#19981;&#20801;&#35768;&#20559;&#31163;&#22266;&#23450;&#21327;&#35758;&#12290;&#22312;&#36825;&#26679;&#30340;&#36807;&#31243;&#20013;&#24037;&#20316;&#21487;&#33021;&#20250;&#35753;&#29992;&#25143;&#24863;&#21040;&#26377;&#21387;&#21147;&#65292;&#24182;&#23548;&#33268;&#34892;&#20026;&#26080;&#25928;&#25110;&#22833;&#36133;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22312;&#32447;&#22522;&#20110;&#32422;&#26463;&#30340;&#35843;&#24230;&#26041;&#27861;&#65292;&#20301;&#20110;&#25903;&#25345;&#34892;&#20026;&#26641;&#30340;&#21453;&#24212;&#24335;&#25191;&#34892;&#25511;&#21046;&#26694;&#26550;&#20013;&#65292;&#21517;&#20026;CoBOS&#12290;&#36825;&#20351;&#24471;&#26426;&#22120;&#20154;&#33021;&#22815;&#36866;&#24212;&#24310;&#36831;&#27963;&#21160;&#23436;&#25104;&#21644;&#27963;&#21160;&#36873;&#25321;&#65288;&#30001;&#20154;&#31867;&#65289;&#31561;&#19981;&#30830;&#23450;&#20107;&#20214;&#12290;&#29992;&#25143;&#23558;&#20307;&#39564;&#21040;&#36739;&#23569;&#30340;&#21387;&#21147;&#65292;&#22240;&#20026;&#26426;&#22120;&#20154;&#21516;&#20107;&#20250;&#35843;&#25972;&#20854;&#34892;&#20026;&#20197;&#26368;&#22909;&#22320;&#34917;&#20805;&#20154;&#31867;&#36873;&#25321;&#30340;&#27963;&#21160;&#65292;&#20197;&#23436;&#25104;&#20849;&#21516;&#20219;&#21153;&#12290;&#38500;&#20102;&#25913;&#21892;&#30340;&#24037;&#20316;&#26465;&#20214;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#36824;&#23548;&#33268;&#20102;&#25928;&#29575;&#30340;&#25552;&#39640;&#65292;&#21363;&#20351;&#22312;&#39640;&#24230;&#19981;&#30830;&#23450;&#30340;&#24773;&#20917;&#19979;&#20063;&#26159;&#22914;&#27492;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#27010;&#29575;&#24615;&#30340;si&#26469;&#35780;&#20272;&#25105;&#20204;&#30340;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18459v1 Announce Type: cross  Abstract: Assembly processes involving humans and robots are challenging scenarios because the individual activities and access to shared workspace have to be coordinated. Fixed robot programs leave no room to diverge from a fixed protocol. Working on such a process can be stressful for the user and lead to ineffective behavior or failure. We propose a novel approach of online constraint-based scheduling in a reactive execution control framework facilitating behavior trees called CoBOS. This allows the robot to adapt to uncertain events such as delayed activity completions and activity selection (by the human). The user will experience less stress as the robotic coworkers adapt their behavior to best complement the human-selected activities to complete the common task. In addition to the improved working conditions, our algorithm leads to increased efficiency, even in highly uncertain scenarios. We evaluate our algorithm using a probabilistic si
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#21040;&#30340;ICP&#26435;&#37325;&#20248;&#21270;&#38647;&#36798;-&#28608;&#20809;&#38647;&#36798;&#30340;&#23450;&#20301;&#65292;&#20174;&#32780;&#25913;&#21892;&#20102;&#38647;&#36798;&#27979;&#37327;&#23545;&#28608;&#20809;&#38647;&#36798;&#22320;&#22270;&#30340;&#23450;&#20301;&#25928;&#26524;&#12290;&#36825;&#19968;&#26041;&#27861;&#22312;&#20445;&#25345;&#39640;&#36136;&#37327;&#22320;&#22270;&#23450;&#20301;&#24615;&#33021;&#30340;&#21516;&#26102;&#65292;&#25552;&#39640;&#20102;&#22312;&#38477;&#27700;&#21644;&#22823;&#38654;&#31561;&#24694;&#21155;&#22825;&#27668;&#26465;&#20214;&#19979;&#30340;&#23450;&#20301;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.08731</link><description>&lt;p&gt;
&#25351;&#24341;&#30340;&#26041;&#27861;&#65306;&#21033;&#29992;&#23398;&#20064;&#21040;&#30340;ICP&#26435;&#37325;&#25913;&#36827;&#38647;&#36798;-&#28608;&#20809;&#38647;&#36798;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
Pointing the Way: Refining Radar-Lidar Localization Using Learned ICP Weights. (arXiv:2309.08731v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08731
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#21040;&#30340;ICP&#26435;&#37325;&#20248;&#21270;&#38647;&#36798;-&#28608;&#20809;&#38647;&#36798;&#30340;&#23450;&#20301;&#65292;&#20174;&#32780;&#25913;&#21892;&#20102;&#38647;&#36798;&#27979;&#37327;&#23545;&#28608;&#20809;&#38647;&#36798;&#22320;&#22270;&#30340;&#23450;&#20301;&#25928;&#26524;&#12290;&#36825;&#19968;&#26041;&#27861;&#22312;&#20445;&#25345;&#39640;&#36136;&#37327;&#22320;&#22270;&#23450;&#20301;&#24615;&#33021;&#30340;&#21516;&#26102;&#65292;&#25552;&#39640;&#20102;&#22312;&#38477;&#27700;&#21644;&#22823;&#38654;&#31561;&#24694;&#21155;&#22825;&#27668;&#26465;&#20214;&#19979;&#30340;&#23450;&#20301;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#25913;&#36827;&#38647;&#36798;&#27979;&#37327;&#23545;&#28608;&#20809;&#38647;&#36798;&#22320;&#22270;&#30340;&#23450;&#20301;&#12290;&#34429;&#28982;&#30446;&#21069;&#23450;&#20301;&#30340;&#25216;&#26415;&#27700;&#24179;&#26159;&#23558;&#28608;&#20809;&#38647;&#36798;&#25968;&#25454;&#19982;&#28608;&#20809;&#38647;&#36798;&#22320;&#22270;&#36827;&#34892;&#21305;&#37197;&#65292;&#20294;&#26159;&#38647;&#36798;&#34987;&#35748;&#20026;&#26159;&#19968;&#31181;&#26377;&#21069;&#36884;&#30340;&#26367;&#20195;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#23545;&#38477;&#27700;&#21644;&#22823;&#38654;&#31561;&#24694;&#21155;&#22825;&#27668;&#20855;&#26377;&#26356;&#24378;&#30340;&#38887;&#24615;&#12290;&#20026;&#20102;&#21033;&#29992;&#29616;&#26377;&#30340;&#39640;&#36136;&#37327;&#28608;&#20809;&#38647;&#36798;&#22320;&#22270;&#65292;&#21516;&#26102;&#22312;&#24694;&#21155;&#22825;&#27668;&#19979;&#20445;&#25345;&#24615;&#33021;&#65292;&#23558;&#38647;&#36798;&#25968;&#25454;&#19982;&#28608;&#20809;&#38647;&#36798;&#22320;&#22270;&#36827;&#34892;&#21305;&#37197;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#38647;&#36798;&#27979;&#37327;&#20013;&#23384;&#22312;&#30340;&#29420;&#29305;&#20266;&#24433;&#65292;&#38647;&#36798;-&#28608;&#20809;&#38647;&#36798;&#23450;&#20301;&#19968;&#30452;&#38590;&#20197;&#36798;&#21040;&#19982;&#28608;&#20809;&#38647;&#36798;-&#28608;&#20809;&#38647;&#36798;&#31995;&#32479;&#30456;&#23218;&#32654;&#30340;&#24615;&#33021;&#65292;&#20351;&#20854;&#26080;&#27861;&#29992;&#20110;&#33258;&#21160;&#39550;&#39542;&#12290;&#26412;&#24037;&#20316;&#22312;&#22522;&#20110;ICP&#30340;&#38647;&#36798;-&#28608;&#20809;&#38647;&#36798;&#23450;&#20301;&#31995;&#32479;&#22522;&#30784;&#19978;&#65292;&#21253;&#25324;&#19968;&#20010;&#23398;&#20064;&#30340;&#39044;&#22788;&#29702;&#27493;&#39588;&#65292;&#26681;&#25454;&#39640;&#23618;&#27425;&#30340;&#25195;&#25551;&#20449;&#24687;&#23545;&#38647;&#36798;&#28857;&#36827;&#34892;&#21152;&#26435;&#12290;&#23558;&#32463;&#36807;&#39564;&#35777;&#30340;&#20998;&#26512;&#26041;&#27861;&#19982;&#23398;&#20064;&#21040;&#30340;&#26435;&#37325;&#30456;&#32467;&#21512;&#65292;&#20943;&#23567;&#20102;&#38647;&#36798;&#23450;&#20301;&#20013;&#30340;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a novel deep-learning-based approach to improve localizing radar measurements against lidar maps. Although the state of the art for localization is matching lidar data to lidar maps, radar has been considered as a promising alternative, as it is potentially more resilient against adverse weather such as precipitation and heavy fog. To make use of existing high-quality lidar maps, while maintaining performance in adverse weather, matching radar data to lidar maps is of interest. However, owing in part to the unique artefacts present in radar measurements, radar-lidar localization has struggled to achieve comparable performance to lidar-lidar systems, preventing it from being viable for autonomous driving. This work builds on an ICP-based radar-lidar localization system by including a learned preprocessing step that weights radar points based on high-level scan information. Combining a proven analytical approach with a learned weight reduces localization errors in rad
&lt;/p&gt;</description></item></channel></rss>