<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>2023&#24180;10&#26376;&#65292;&#19968;&#36215;GM Cruise&#26426;&#22120;&#20154;&#20986;&#31199;&#36710;&#19982;&#34892;&#20154;&#30456;&#25758;&#30340;&#20107;&#25925;&#32473;&#20844;&#21496;&#36896;&#25104;&#20102;&#24040;&#22823;&#30340;&#21160;&#33633;&#65292;&#21516;&#26102;&#20063;&#25581;&#31034;&#20102;&#35813;&#20844;&#21496;&#22312;&#22788;&#29702;&#20107;&#25925;&#21518;&#30340;&#22833;&#35823;&#12290;&#36825;&#19968;&#20107;&#20214;&#30340;&#35299;&#21078;&#25552;&#20379;&#20102;&#22312;&#25216;&#26415;&#12289;&#25805;&#20316;&#23433;&#20840;&#23454;&#36341;&#21644;&#32452;&#32455;&#21453;&#24212;&#26041;&#38754;&#30340;&#23433;&#20840;&#25945;&#35757;&#12290;</title><link>https://arxiv.org/abs/2402.06046</link><description>&lt;p&gt;
&#26426;&#22120;&#20154;&#20986;&#31199;&#36710;&#20107;&#25925;&#30340;&#35299;&#21078;&#65306;&#20174;Cruise&#34892;&#20154;&#25302;&#25341;&#20107;&#25925;&#20013;&#21560;&#21462;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
Anatomy of a Robotaxi Crash: Lessons from the Cruise Pedestrian Dragging Mishap
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06046
&lt;/p&gt;
&lt;p&gt;
2023&#24180;10&#26376;&#65292;&#19968;&#36215;GM Cruise&#26426;&#22120;&#20154;&#20986;&#31199;&#36710;&#19982;&#34892;&#20154;&#30456;&#25758;&#30340;&#20107;&#25925;&#32473;&#20844;&#21496;&#36896;&#25104;&#20102;&#24040;&#22823;&#30340;&#21160;&#33633;&#65292;&#21516;&#26102;&#20063;&#25581;&#31034;&#20102;&#35813;&#20844;&#21496;&#22312;&#22788;&#29702;&#20107;&#25925;&#21518;&#30340;&#22833;&#35823;&#12290;&#36825;&#19968;&#20107;&#20214;&#30340;&#35299;&#21078;&#25552;&#20379;&#20102;&#22312;&#25216;&#26415;&#12289;&#25805;&#20316;&#23433;&#20840;&#23454;&#36341;&#21644;&#32452;&#32455;&#21453;&#24212;&#26041;&#38754;&#30340;&#23433;&#20840;&#25945;&#35757;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2023&#24180;10&#26376;&#65292;&#22312;&#26087;&#37329;&#23665;&#65292;&#19968;&#36742;&#36890;&#29992;&#27773;&#36710;Cruise&#30340;&#26426;&#22120;&#20154;&#20986;&#31199;&#36710;&#19982;&#19968;&#21517;&#34892;&#20154;&#30456;&#25758;&#65292;&#36896;&#25104;&#20102;&#20005;&#37325;&#30340;&#20260;&#23475;&#65292;&#21516;&#26102;&#20063;&#23545;&#35813;&#20844;&#21496;&#36896;&#25104;&#20102;&#24040;&#22823;&#30340;&#21160;&#33633;&#65292;&#36825;&#24456;&#21487;&#33021;&#20250;&#23545;&#25972;&#20010;&#34892;&#19994;&#20135;&#29983;&#38271;&#26399;&#24433;&#21709;&#12290;&#38382;&#39064;&#19981;&#20165;&#20165;&#28304;&#20110;&#20107;&#25925;&#26412;&#36523;&#65292;&#36824;&#21253;&#25324;Cruise&#22312;&#22788;&#29702;&#26426;&#22120;&#20154;&#20986;&#31199;&#36710;&#25758;&#21040;&#34892;&#20154;&#21518;&#34987;&#25302;&#34892;&#30340;&#36807;&#31243;&#20013;&#30340;&#22833;&#35823;&#12290;&#20004;&#20221;&#22806;&#37096;&#35843;&#26597;&#25253;&#21578;&#25552;&#20379;&#20102;&#25551;&#36848;&#20107;&#20214;&#30340;&#21407;&#22987;&#26448;&#26009;&#65292;&#24182;&#20174;&#30417;&#31649;&#20114;&#21160;&#30340;&#35282;&#24230;&#25209;&#35780;&#20102;&#20844;&#21496;&#30340;&#21453;&#24212;&#65292;&#20294;&#24182;&#26410;&#21253;&#21547;&#28508;&#22312;&#30340;&#23433;&#20840;&#24314;&#35758;&#12290;&#25105;&#20204;&#21033;&#29992;&#36825;&#20123;&#25253;&#21578;&#26448;&#26009;&#26469;&#24378;&#35843;&#20855;&#20307;&#30340;&#20107;&#23454;&#21644;&#20107;&#20214;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#36890;&#36807;&#23558;&#25253;&#21578;&#26448;&#26009;&#30340;&#19981;&#21516;&#37096;&#20998;&#32852;&#31995;&#36215;&#26469;&#12290;&#28982;&#21518;&#25105;&#20204;&#25506;&#35752;&#22312;&#25216;&#26415;&#12289;&#25805;&#20316;&#23433;&#20840;&#23454;&#36341;&#21644;&#32452;&#32455;&#23545;&#20107;&#20214;&#30340;&#21453;&#24212;&#26041;&#38754;&#21487;&#33021;&#21487;&#20197;&#23398;&#21040;&#30340;&#23433;&#20840;&#25945;&#35757;&#12290;
&lt;/p&gt;
&lt;p&gt;
An October 2023 crash between a GM Cruise robotaxi and a pedestrian in San Francisco resulted not only in a severe injury, but also dramatic upheaval at that company that will likely have lasting effects throughout the industry. The issues stem not just from the crash facts themselves, but also how Cruise mishandled dealing with their robotaxi dragging a pedestrian under the vehicle after the initial post-crash stop. A pair of external investigation reports provide raw material describing the incident and critique the company response from a regulatory interaction point of view, but did not include potential safety recommendations in scope. We use that report material to highlight specific facts and relationships between events by tying together different pieces of the report material. We then explore safety lessons that might be learned with regard to technology, operational safety practices, and organizational reaction to incidents.
&lt;/p&gt;</description></item></channel></rss>