<rss version="2.0"><channel><title>Chat Arxiv cs.RO</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.RO</description><item><title>PoCo&#26159;&#19968;&#31181;&#31574;&#30053;&#32452;&#21512;&#26041;&#27861;&#65292;&#36890;&#36807;&#32452;&#21512;&#19981;&#21516;&#27169;&#24577;&#21644;&#39046;&#22495;&#30340;&#25968;&#25454;&#20998;&#24067;&#65292;&#23454;&#29616;&#20102;&#20174;&#24322;&#26500;&#25968;&#25454;&#20013;&#35757;&#32451;&#36890;&#29992;&#26426;&#22120;&#20154;&#31574;&#30053;&#30340;&#30446;&#26631;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#22330;&#26223;&#32423;&#21644;&#20219;&#21153;&#32423;&#30340;&#24191;&#20041;&#25805;&#20316;&#25216;&#33021;&#23398;&#20064;&#65292;&#24182;&#22312;&#25512;&#29702;&#26102;&#36890;&#36807;&#20219;&#21153;&#32423;&#32452;&#21512;&#21644;&#20998;&#26512;&#25104;&#26412;&#20989;&#25968;&#36827;&#34892;&#31574;&#30053;&#34892;&#20026;&#30340;&#33258;&#36866;&#24212;&#35843;&#25972;&#12290;</title><link>https://arxiv.org/abs/2402.02511</link><description>&lt;p&gt;
PoCo: &#26469;&#33258;&#21644;&#20026;&#24322;&#26500;&#26426;&#22120;&#20154;&#23398;&#20064;&#30340;&#31574;&#30053;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
PoCo: Policy Composition from and for Heterogeneous Robot Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02511
&lt;/p&gt;
&lt;p&gt;
PoCo&#26159;&#19968;&#31181;&#31574;&#30053;&#32452;&#21512;&#26041;&#27861;&#65292;&#36890;&#36807;&#32452;&#21512;&#19981;&#21516;&#27169;&#24577;&#21644;&#39046;&#22495;&#30340;&#25968;&#25454;&#20998;&#24067;&#65292;&#23454;&#29616;&#20102;&#20174;&#24322;&#26500;&#25968;&#25454;&#20013;&#35757;&#32451;&#36890;&#29992;&#26426;&#22120;&#20154;&#31574;&#30053;&#30340;&#30446;&#26631;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#22330;&#26223;&#32423;&#21644;&#20219;&#21153;&#32423;&#30340;&#24191;&#20041;&#25805;&#20316;&#25216;&#33021;&#23398;&#20064;&#65292;&#24182;&#22312;&#25512;&#29702;&#26102;&#36890;&#36807;&#20219;&#21153;&#32423;&#32452;&#21512;&#21644;&#20998;&#26512;&#25104;&#26412;&#20989;&#25968;&#36827;&#34892;&#31574;&#30053;&#34892;&#20026;&#30340;&#33258;&#36866;&#24212;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#24322;&#26500;&#25968;&#25454;&#20013;&#35757;&#32451;&#36890;&#29992;&#30340;&#26426;&#22120;&#20154;&#31574;&#30053;&#20197;&#22788;&#29702;&#19981;&#21516;&#20219;&#21153;&#26159;&#19968;&#20010;&#37325;&#22823;&#25361;&#25112;&#12290;&#29616;&#26377;&#30340;&#26426;&#22120;&#20154;&#25968;&#25454;&#38598;&#22312;&#39068;&#33394;&#12289;&#28145;&#24230;&#12289;&#35302;&#35273;&#21644;&#23039;&#24577;&#24863;&#31561;&#19981;&#21516;&#27169;&#24577;&#19978;&#23384;&#22312;&#24046;&#24322;&#65292;&#24182;&#22312;&#27169;&#25311;&#12289;&#30495;&#23454;&#26426;&#22120;&#20154;&#21644;&#20154;&#31867;&#35270;&#39057;&#31561;&#19981;&#21516;&#39046;&#22495;&#25910;&#38598;&#12290;&#30446;&#21069;&#30340;&#26041;&#27861;&#36890;&#24120;&#20250;&#25910;&#38598;&#24182;&#27719;&#38598;&#19968;&#20010;&#39046;&#22495;&#30340;&#25152;&#26377;&#25968;&#25454;&#65292;&#20197;&#35757;&#32451;&#19968;&#20010;&#21333;&#19968;&#31574;&#30053;&#26469;&#22788;&#29702;&#20219;&#21153;&#21644;&#39046;&#22495;&#30340;&#24322;&#26500;&#24615;&#65292;&#36825;&#26159;&#38750;&#24120;&#26114;&#36149;&#21644;&#22256;&#38590;&#30340;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;&#31574;&#30053;&#32452;&#21512;&#65292;&#36890;&#36807;&#32452;&#21512;&#29992;&#25193;&#25955;&#27169;&#22411;&#34920;&#31034;&#30340;&#19981;&#21516;&#25968;&#25454;&#20998;&#24067;&#65292;&#23558;&#36328;&#19981;&#21516;&#27169;&#24577;&#21644;&#39046;&#22495;&#30340;&#20449;&#24687;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#23398;&#20064;&#22330;&#26223;&#32423;&#21644;&#20219;&#21153;&#32423;&#30340;&#24191;&#20041;&#25805;&#20316;&#25216;&#33021;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#22810;&#20219;&#21153;&#25805;&#20316;&#20013;&#20351;&#29992;&#20219;&#21153;&#32423;&#32452;&#21512;&#65292;&#24182;&#19982;&#20998;&#26512;&#25104;&#26412;&#20989;&#25968;&#32452;&#21512;&#65292;&#20197;&#22312;&#25512;&#29702;&#26102;&#35843;&#25972;&#31574;&#30053;&#34892;&#20026;&#12290;&#25105;&#20204;&#22312;&#27169;&#25311;&#12289;&#20154;&#31867;&#21644;&#23454;&#38469;&#26426;&#22120;&#20154;&#25968;&#25454;&#19978;&#35757;&#32451;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Training general robotic policies from heterogeneous data for different tasks is a significant challenge. Existing robotic datasets vary in different modalities such as color, depth, tactile, and proprioceptive information, and collected in different domains such as simulation, real robots, and human videos. Current methods usually collect and pool all data from one domain to train a single policy to handle such heterogeneity in tasks and domains, which is prohibitively expensive and difficult. In this work, we present a flexible approach, dubbed Policy Composition, to combine information across such diverse modalities and domains for learning scene-level and task-level generalized manipulation skills, by composing different data distributions represented with diffusion models. Our method can use task-level composition for multi-task manipulation and be composed with analytic cost functions to adapt policy behaviors at inference time. We train our method on simulation, human, and real 
&lt;/p&gt;</description></item></channel></rss>