<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#26412;&#25991;&#30528;&#37325;&#20110;&#35780;&#20272;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#20915;&#31574;&#36136;&#37327;&#65292;&#25552;&#20986;&#20102;&#26816;&#27979;&#38750;&#26368;&#20339;&#20915;&#31574;&#22330;&#26223;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#21464;&#24418;&#20851;&#31995;&#26292;&#38706;&#26368;&#20339;&#20915;&#31574;&#36829;&#35268;&#12290;</title><link>https://arxiv.org/abs/2402.18393</link><description>&lt;p&gt;
&#36890;&#36807;&#21464;&#24418;&#27979;&#35797;&#35780;&#20272;&#33258;&#21160;&#39550;&#39542;&#30340;&#20915;&#31574;&#26368;&#20339;&#24615;
&lt;/p&gt;
&lt;p&gt;
Evaluating Decision Optimality of Autonomous Driving via Metamorphic Testing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18393
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30528;&#37325;&#20110;&#35780;&#20272;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#20915;&#31574;&#36136;&#37327;&#65292;&#25552;&#20986;&#20102;&#26816;&#27979;&#38750;&#26368;&#20339;&#20915;&#31574;&#22330;&#26223;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#21464;&#24418;&#20851;&#31995;&#26292;&#38706;&#26368;&#20339;&#20915;&#31574;&#36829;&#35268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18393v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#25688;&#35201;&#65306;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#65288;ADS&#65289;&#30340;&#27979;&#35797;&#22312;ADS&#24320;&#21457;&#20013;&#33267;&#20851;&#37325;&#35201;&#65292;&#30446;&#21069;&#20027;&#35201;&#20851;&#27880;&#30340;&#26159;&#23433;&#20840;&#24615;&#12290;&#28982;&#32780;&#65292;&#35780;&#20272;&#38750;&#23433;&#20840;&#20851;&#38190;&#24615;&#33021;&#65292;&#29305;&#21035;&#26159;ADS&#21046;&#23450;&#26368;&#20339;&#20915;&#31574;&#24182;&#20026;&#33258;&#21160;&#36710;&#36742;&#65288;AV&#65289;&#29983;&#25104;&#26368;&#20339;&#36335;&#24452;&#30340;&#33021;&#21147;&#21516;&#26679;&#37325;&#35201;&#65292;&#20197;&#30830;&#20445;AV&#30340;&#26234;&#33021;&#24615;&#24182;&#38477;&#20302;&#39118;&#38505;&#12290;&#30446;&#21069;&#65292;&#40092;&#26377;&#24037;&#20316;&#33268;&#21147;&#20110;&#35780;&#20272;ADS&#30340;&#26368;&#20339;&#20915;&#31574;&#24615;&#33021;&#65292;&#22240;&#20026;&#32570;&#20047;&#30456;&#24212;&#30340;&#39044;&#35328;&#21644;&#29983;&#25104;&#26377;&#38750;&#26368;&#20339;&#20915;&#31574;&#30340;&#22330;&#26223;&#38590;&#24230;&#36739;&#22823;&#12290;&#26412;&#25991;&#20391;&#37325;&#20110;&#35780;&#20272;ADS&#30340;&#20915;&#31574;&#36136;&#37327;&#65292;&#24182;&#25552;&#20986;&#39318;&#20010;&#29992;&#20110;&#26816;&#27979;&#38750;&#26368;&#20339;&#20915;&#31574;&#22330;&#26223;&#65288;NoDSs&#65289;&#30340;&#26041;&#27861;&#65292;&#21363;ADS&#26410;&#35745;&#31639;AV&#30340;&#26368;&#20339;&#36335;&#24452;&#30340;&#24773;&#20917;&#12290;&#39318;&#20808;&#65292;&#20026;&#35299;&#20915;&#39044;&#35328;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26088;&#22312;&#26292;&#38706;&#26368;&#20339;&#20915;&#31574;&#36829;&#35268;&#24773;&#20917;&#30340;&#26032;&#39062;&#21464;&#24418;&#20851;&#31995;&#65288;MR&#65289;&#12290;&#36825;&#20010;MR&#30830;&#23450;&#20102;&#24615;&#33021;&#26368;&#20339;&#20915;&#31574;&#30340;&#36829;&#35268;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18393v1 Announce Type: new  Abstract: Autonomous Driving System (ADS) testing is crucial in ADS development, with the current primary focus being on safety. However, the evaluation of non-safety-critical performance, particularly the ADS's ability to make optimal decisions and produce optimal paths for autonomous vehicles (AVs), is equally vital to ensure the intelligence and reduce risks of AVs. Currently, there is little work dedicated to assessing ADSs' optimal decision-making performance due to the lack of corresponding oracles and the difficulty in generating scenarios with non-optimal decisions. In this paper, we focus on evaluating the decision-making quality of an ADS and propose the first method for detecting non-optimal decision scenarios (NoDSs), where the ADS does not compute optimal paths for AVs. Firstly, to deal with the oracle problem, we propose a novel metamorphic relation (MR) aimed at exposing violations of optimal decisions. The MR identifies the propert
&lt;/p&gt;</description></item></channel></rss>