<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#35770;&#25991;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#21019;&#24314;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#21452;&#36275;&#26426;&#22120;&#20154;&#21160;&#24577;&#36816;&#21160;&#25511;&#21046;&#22120;&#65292;&#35813;&#25511;&#21046;&#22120;&#21487;&#20197;&#24212;&#29992;&#20110;&#22810;&#31181;&#21160;&#24577;&#21452;&#36275;&#25216;&#33021;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#23454;&#38469;&#29615;&#22659;&#20013;&#23637;&#29616;&#20986;&#20102;&#20248;&#36234;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.16889</link><description>&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#29992;&#20110;&#22810;&#21151;&#33021;&#12289;&#21160;&#24577;&#21644;&#31283;&#20581;&#30340;&#21452;&#36275;&#36816;&#21160;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Reinforcement Learning for Versatile, Dynamic, and Robust Bipedal Locomotion Control. (arXiv:2401.16889v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16889
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#21019;&#24314;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#21452;&#36275;&#26426;&#22120;&#20154;&#21160;&#24577;&#36816;&#21160;&#25511;&#21046;&#22120;&#65292;&#35813;&#25511;&#21046;&#22120;&#21487;&#20197;&#24212;&#29992;&#20110;&#22810;&#31181;&#21160;&#24577;&#21452;&#36275;&#25216;&#33021;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#23454;&#38469;&#29615;&#22659;&#20013;&#23637;&#29616;&#20986;&#20102;&#20248;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#39033;&#20851;&#20110;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#21019;&#24314;&#21452;&#36275;&#26426;&#22120;&#20154;&#21160;&#24577;&#36816;&#21160;&#25511;&#21046;&#22120;&#30340;&#32508;&#21512;&#30740;&#31350;&#12290;&#25105;&#20204;&#19981;&#20165;&#20165;&#19987;&#27880;&#20110;&#21333;&#19968;&#30340;&#36816;&#21160;&#25216;&#33021;&#65292;&#32780;&#26159;&#24320;&#21457;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#25511;&#21046;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#20197;&#29992;&#20110;&#19968;&#31995;&#21015;&#21160;&#24577;&#21452;&#36275;&#25216;&#33021;&#65292;&#20174;&#21608;&#26399;&#24615;&#34892;&#36208;&#21644;&#22868;&#36305;&#21040;&#38750;&#21608;&#26399;&#24615;&#36339;&#36291;&#21644;&#31449;&#31435;&#12290;&#25105;&#20204;&#22522;&#20110;RL&#30340;&#25511;&#21046;&#22120;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21452;&#21382;&#21490;&#26550;&#26500;&#65292;&#21033;&#29992;&#26426;&#22120;&#20154;&#30340;&#38271;&#26399;&#21644;&#30701;&#26399;&#36755;&#20837;/&#36755;&#20986;&#65288;I/O&#65289;&#21382;&#21490;&#12290;&#36890;&#36807;&#25552;&#20986;&#30340;&#31471;&#21040;&#31471;RL&#26041;&#27861;&#36827;&#34892;&#35757;&#32451;&#26102;&#65292;&#36825;&#31181;&#25511;&#21046;&#26550;&#26500;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#23454;&#38469;&#29615;&#22659;&#20013;&#30340;&#22810;&#26679;&#21270;&#25216;&#33021;&#19978;&#22987;&#32456;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#12290;&#35813;&#30740;&#31350;&#36824;&#28145;&#20837;&#25506;&#35752;&#20102;&#25152;&#25552;&#20986;&#30340;RL&#31995;&#32479;&#22312;&#24320;&#21457;&#36816;&#21160;&#25511;&#21046;&#22120;&#26041;&#38754;&#24341;&#20837;&#30340;&#36866;&#24212;&#24615;&#21644;&#31283;&#20581;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#30340;&#26550;&#26500;&#21487;&#20197;&#36866;&#24212;&#26102;&#38388;&#19981;&#21464;&#30340;&#21160;&#21147;&#23398;&#21464;&#21270;&#21644;&#26102;&#38388;&#21464;&#21270;&#30340;&#21464;&#21270;&#65292;&#22914;&#25509;&#35302;&#20107;&#20214;&#65292;&#36890;&#36807;&#26377;&#25928;&#22320;
&lt;/p&gt;
&lt;p&gt;
This paper presents a comprehensive study on using deep reinforcement learning (RL) to create dynamic locomotion controllers for bipedal robots. Going beyond focusing on a single locomotion skill, we develop a general control solution that can be used for a range of dynamic bipedal skills, from periodic walking and running to aperiodic jumping and standing. Our RL-based controller incorporates a novel dual-history architecture, utilizing both a long-term and short-term input/output (I/O) history of the robot. This control architecture, when trained through the proposed end-to-end RL approach, consistently outperforms other methods across a diverse range of skills in both simulation and the real world.The study also delves into the adaptivity and robustness introduced by the proposed RL system in developing locomotion controllers. We demonstrate that the proposed architecture can adapt to both time-invariant dynamics shifts and time-variant changes, such as contact events, by effectivel
&lt;/p&gt;</description></item></channel></rss>