<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#30740;&#31350;&#35777;&#26126;&#20102;&#19968;&#20010;&#38750;&#28176;&#36817;&#30340;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#24182;&#36890;&#36807;&#24212;&#29992;&#20110;TD&#23398;&#20064;&#65292;&#23637;&#31034;&#20102;&#20854;&#23454;&#38469;&#24212;&#29992;&#30340;&#21487;&#34892;&#24615;&#12290;</title><link>https://arxiv.org/abs/2401.15719</link><description>&lt;p&gt;
&#20851;&#20110;&#39532;&#23572;&#21487;&#22827;&#38142;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#21450;&#20854;&#22312;TD&#23398;&#20064;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Rates of Convergence in the Central Limit Theorem for Markov Chains, with an Application to TD Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.15719
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35777;&#26126;&#20102;&#19968;&#20010;&#38750;&#28176;&#36817;&#30340;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#24182;&#36890;&#36807;&#24212;&#29992;&#20110;TD&#23398;&#20064;&#65292;&#23637;&#31034;&#20102;&#20854;&#23454;&#38469;&#24212;&#29992;&#30340;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;Stein&#26041;&#27861;&#35777;&#26126;&#20102;&#19968;&#20010;&#38750;&#28176;&#36817;&#30340;&#12289;&#30690;&#37327;&#20540;&#38789;&#24046;&#30340;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#24182;&#21033;&#29992;&#27850;&#26494;&#26041;&#31243;&#23558;&#32467;&#26524;&#25512;&#24191;&#21040;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#20989;&#25968;&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20123;&#32467;&#26524;&#21487;&#20197;&#24212;&#29992;&#20110;&#24314;&#31435;&#22522;&#20110;&#24179;&#22343;&#30340;&#38750;&#28176;&#36817;&#30340;TD&#23398;&#20064;&#30340;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
We prove a non-asymptotic central limit theorem for vector-valued martingale differences using Stein's method, and use Poisson's equation to extend the result to functions of Markov Chains. We then show that these results can be applied to establish a non-asymptotic central limit theorem for Temporal Difference (TD) learning with averaging.
&lt;/p&gt;</description></item></channel></rss>