<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>DyExpert&#26159;&#19968;&#31181;&#29992;&#20110;&#36328;&#22495;&#38142;&#25509;&#39044;&#27979;&#30340;&#21160;&#24577;&#22270;&#27169;&#22411;&#65292;&#36890;&#36807;&#26126;&#30830;&#24314;&#27169;&#21382;&#21490;&#28436;&#21270;&#36807;&#31243;&#24182;&#32467;&#21512;&#38142;&#25509;&#39044;&#27979;&#65292;&#23427;&#21487;&#20197;&#23398;&#20064;&#29305;&#23450;&#19979;&#28216;&#22270;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#22312;&#21508;&#20010;&#39046;&#22495;&#19978;&#21462;&#24471;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.02168</link><description>&lt;p&gt;
&#36328;&#22495;&#21160;&#24577;&#38142;&#25509;&#39044;&#27979;&#30340;&#19968;&#31181;&#22270;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
One Graph Model for Cross-domain Dynamic Link Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02168
&lt;/p&gt;
&lt;p&gt;
DyExpert&#26159;&#19968;&#31181;&#29992;&#20110;&#36328;&#22495;&#38142;&#25509;&#39044;&#27979;&#30340;&#21160;&#24577;&#22270;&#27169;&#22411;&#65292;&#36890;&#36807;&#26126;&#30830;&#24314;&#27169;&#21382;&#21490;&#28436;&#21270;&#36807;&#31243;&#24182;&#32467;&#21512;&#38142;&#25509;&#39044;&#27979;&#65292;&#23427;&#21487;&#20197;&#23398;&#20064;&#29305;&#23450;&#19979;&#28216;&#22270;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#22312;&#21508;&#20010;&#39046;&#22495;&#19978;&#21462;&#24471;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;DyExpert&#65292;&#19968;&#31181;&#29992;&#20110;&#36328;&#22495;&#38142;&#25509;&#39044;&#27979;&#30340;&#21160;&#24577;&#22270;&#27169;&#22411;&#12290;&#23427;&#21487;&#20197;&#26126;&#30830;&#22320;&#24314;&#27169;&#21382;&#21490;&#28436;&#21270;&#36807;&#31243;&#65292;&#23398;&#20064;&#29305;&#23450;&#19979;&#28216;&#22270;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#36827;&#32780;&#36827;&#34892;&#29305;&#23450;&#27169;&#24335;&#30340;&#38142;&#25509;&#39044;&#27979;&#12290;DyExpert&#37319;&#29992;&#20102;&#35299;&#30721;&#22120;&#20248;&#21270;&#30340;transformer&#65292;&#24182;&#36890;&#36807;&#32467;&#21512;&#28436;&#21270;&#24314;&#27169;&#21644;&#38142;&#25509;&#39044;&#27979;&#30340;&#8220;&#26465;&#20214;&#38142;&#25509;&#29983;&#25104;&#8221;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#24182;&#34892;&#35757;&#32451;&#21644;&#25512;&#26029;&#12290;DyExpert&#22312;&#21253;&#21547;6&#30334;&#19975;&#20010;&#21160;&#24577;&#36793;&#30340;&#24191;&#27867;&#21160;&#24577;&#22270;&#19978;&#36827;&#34892;&#35757;&#32451;&#12290;&#22312;&#20843;&#20010;&#26410;&#35757;&#32451;&#30340;&#22270;&#19978;&#36827;&#34892;&#20102;&#22823;&#37327;&#23454;&#39564;&#65292;&#32467;&#26524;&#26174;&#31034;DyExpert&#22312;&#36328;&#22495;&#38142;&#25509;&#39044;&#27979;&#20013;&#21462;&#24471;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;&#19982;&#30456;&#21516;&#35774;&#32622;&#19979;&#30340;&#20808;&#36827;&#22522;&#20934;&#30456;&#27604;&#65292;DyExpert&#22312;&#20843;&#20010;&#22270;&#19978;&#30340;&#24179;&#22343;&#31934;&#30830;&#24230;&#25552;&#39640;&#20102;11.40&#65285;&#12290;&#26356;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#26159;&#65292;&#22312;&#20845;&#20010;&#26410;&#35757;&#32451;&#30340;&#22270;&#19978;&#65292;&#23427;&#36229;&#36807;&#20102;&#20843;&#20010;&#20808;&#36827;&#22522;&#32447;&#30340;&#20840;&#30417;&#30563;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work proposes DyExpert, a dynamic graph model for cross-domain link prediction. It can explicitly model historical evolving processes to learn the evolution pattern of a specific downstream graph and subsequently make pattern-specific link predictions. DyExpert adopts a decode-only transformer and is capable of efficiently parallel training and inference by \textit{conditioned link generation} that integrates both evolution modeling and link prediction. DyExpert is trained by extensive dynamic graphs across diverse domains, comprising 6M dynamic edges. Extensive experiments on eight untrained graphs demonstrate that DyExpert achieves state-of-the-art performance in cross-domain link prediction. Compared to the advanced baseline under the same setting, DyExpert achieves an average of 11.40% improvement Average Precision across eight graphs. More impressive, it surpasses the fully supervised performance of 8 advanced baselines on 6 untrained graphs.
&lt;/p&gt;</description></item></channel></rss>