<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#36890;&#36807;&#20174;&#25968;&#25454;&#30340;&#35270;&#35282;&#20986;&#21457;&#65292;&#37325;&#26032;&#23457;&#35270;&#20102;&#38142;&#25509;&#39044;&#27979;&#30340;&#21407;&#21017;&#65292;&#24182;&#21457;&#29616;&#20102;&#23616;&#37096;&#32467;&#26500;&#25509;&#36817;&#24615;&#12289;&#20840;&#23616;&#32467;&#26500;&#25509;&#36817;&#24615;&#21644;&#29305;&#24449;&#25509;&#36817;&#24615;&#19977;&#20010;&#22240;&#32032;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#21516;&#26102;&#65292;&#21457;&#29616;&#20102;&#20840;&#23616;&#32467;&#26500;&#25509;&#36817;&#24615;&#21482;&#22312;&#23616;&#37096;&#32467;&#26500;&#25509;&#36817;&#24615;&#19981;&#36275;&#26102;&#26174;&#31034;&#20986;&#26377;&#25928;&#24615;&#65292;&#20197;&#21450;&#29305;&#24449;&#21644;&#32467;&#26500;&#25509;&#36817;&#24615;&#20043;&#38388;&#30340;&#19981;&#20860;&#23481;&#24615;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#38142;&#25509;&#39044;&#27979;&#25552;&#20379;&#20102;&#26032;&#30340;&#24605;&#36335;&#65292;&#21551;&#21457;&#20102;GNN4LP&#30340;&#35774;&#35745;&#12290;</title><link>https://arxiv.org/abs/2310.00793</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;&#38142;&#25509;&#39044;&#27979;: &#19968;&#20010;&#25968;&#25454;&#30340;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Revisiting Link Prediction: A Data Perspective
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2310.00793
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20174;&#25968;&#25454;&#30340;&#35270;&#35282;&#20986;&#21457;&#65292;&#37325;&#26032;&#23457;&#35270;&#20102;&#38142;&#25509;&#39044;&#27979;&#30340;&#21407;&#21017;&#65292;&#24182;&#21457;&#29616;&#20102;&#23616;&#37096;&#32467;&#26500;&#25509;&#36817;&#24615;&#12289;&#20840;&#23616;&#32467;&#26500;&#25509;&#36817;&#24615;&#21644;&#29305;&#24449;&#25509;&#36817;&#24615;&#19977;&#20010;&#22240;&#32032;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#21516;&#26102;&#65292;&#21457;&#29616;&#20102;&#20840;&#23616;&#32467;&#26500;&#25509;&#36817;&#24615;&#21482;&#22312;&#23616;&#37096;&#32467;&#26500;&#25509;&#36817;&#24615;&#19981;&#36275;&#26102;&#26174;&#31034;&#20986;&#26377;&#25928;&#24615;&#65292;&#20197;&#21450;&#29305;&#24449;&#21644;&#32467;&#26500;&#25509;&#36817;&#24615;&#20043;&#38388;&#30340;&#19981;&#20860;&#23481;&#24615;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#38142;&#25509;&#39044;&#27979;&#25552;&#20379;&#20102;&#26032;&#30340;&#24605;&#36335;&#65292;&#21551;&#21457;&#20102;GNN4LP&#30340;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38142;&#25509;&#39044;&#27979;&#26159;&#19968;&#39033;&#22522;&#20110;&#22270;&#30340;&#22522;&#26412;&#20219;&#21153;&#65292;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#24050;&#34987;&#35777;&#26126;&#26159;&#19981;&#21487;&#25110;&#32570;&#30340;&#65292;&#20363;&#22914;&#26379;&#21451;&#25512;&#33616;&#12289;&#34507;&#30333;&#36136;&#20998;&#26512;&#21644;&#33647;&#29289;&#20114;&#20316;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#25968;&#25454;&#38598;&#28085;&#30422;&#20102;&#22810;&#20010;&#39046;&#22495;&#65292;&#23427;&#20204;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#30340;&#38142;&#25509;&#24418;&#25104;&#26426;&#21046;&#12290;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#35777;&#25454;&#24378;&#35843;&#20102;&#19968;&#20010;&#26222;&#36941;&#36866;&#29992;&#20110;&#25152;&#26377;&#25968;&#25454;&#38598;&#30340;&#26368;&#20339;&#31639;&#27861;&#30340;&#32570;&#22833;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23581;&#35797;&#20174;&#25968;&#25454;&#20013;&#24515;&#30340;&#35270;&#35282;&#25506;&#32034;&#38142;&#25509;&#39044;&#27979;&#30340;&#21407;&#21017;&#65292;&#36328;&#36234;&#19981;&#21516;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#19977;&#20010;&#23545;&#38142;&#25509;&#39044;&#27979;&#33267;&#20851;&#37325;&#35201;&#30340;&#22522;&#26412;&#22240;&#32032;:&#23616;&#37096;&#32467;&#26500;&#25509;&#36817;&#24615;&#12289;&#20840;&#23616;&#32467;&#26500;&#25509;&#36817;&#24615;&#21644;&#29305;&#24449;&#25509;&#36817;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#36825;&#20123;&#22240;&#32032;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20854;&#20013; (i)&#21482;&#26377;&#22312;&#23616;&#37096;&#32467;&#26500;&#25509;&#36817;&#24615;&#19981;&#36275;&#30340;&#24773;&#20917;&#19979;&#65292;&#20840;&#23616;&#32467;&#26500;&#25509;&#36817;&#24615;&#25165;&#26174;&#31034;&#20986;&#26377;&#25928;&#24615;&#12290; (ii)&#29305;&#24449;&#21644;&#32467;&#26500;&#25509;&#36817;&#24615;&#20043;&#38388;&#23384;&#22312;&#19981;&#20860;&#23481;&#24615;&#12290;&#36825;&#31181;&#19981;&#20860;&#23481;&#24615;&#23548;&#33268;&#20102;&#38142;&#25509;&#39044;&#27979;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476; (GNN4LP) &#25345;&#32493;&#22320;
&lt;/p&gt;
&lt;p&gt;
Link prediction, a fundamental task on graphs, has proven indispensable in various applications, e.g., friend recommendation, protein analysis, and drug interaction prediction. However, since datasets span a multitude of domains, they could have distinct underlying mechanisms of link formation. Evidence in existing literature underscores the absence of a universally best algorithm suitable for all datasets. In this paper, we endeavor to explore principles of link prediction across diverse datasets from a data-centric perspective. We recognize three fundamental factors critical to link prediction: local structural proximity, global structural proximity, and feature proximity. We then unearth relationships among those factors where (i) global structural proximity only shows effectiveness when local structural proximity is deficient. (ii) The incompatibility can be found between feature and structural proximity. Such incompatibility leads to GNNs for Link Prediction (GNN4LP) consistently 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22240;&#26524;&#24863;&#30693;&#22270;&#31070;&#32463;&#32593;&#32476;&#39044;&#27979;&#21160;&#24577;&#22270;&#20013;&#30340;&#26102;&#38388;&#20013;&#24515;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#22312;&#19981;&#21516;&#39046;&#22495;&#30340;13&#20010;&#26102;&#38388;&#22270;&#19978;&#36827;&#34892;&#20102;&#23454;&#39564;&#39564;&#35777;&#65292;&#32467;&#26524;&#26174;&#31034;&#35813;&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#20171;&#25968;&#21644;&#25509;&#36817;&#24230;&#20013;&#24515;&#24615;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2310.15865</link><description>&lt;p&gt;
&#20351;&#29992;&#22240;&#26524;&#24863;&#30693;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#21160;&#24577;&#22270;&#20013;&#39044;&#27979;&#26102;&#38388;&#20013;&#24515;&#24615;
&lt;/p&gt;
&lt;p&gt;
Using Causality-Aware Graph Neural Networks to Predict Temporal Centralities in Dynamic Graphs. (arXiv:2310.15865v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22240;&#26524;&#24863;&#30693;&#22270;&#31070;&#32463;&#32593;&#32476;&#39044;&#27979;&#21160;&#24577;&#22270;&#20013;&#30340;&#26102;&#38388;&#20013;&#24515;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#22312;&#19981;&#21516;&#39046;&#22495;&#30340;13&#20010;&#26102;&#38388;&#22270;&#19978;&#36827;&#34892;&#20102;&#23454;&#39564;&#39564;&#35777;&#65292;&#32467;&#26524;&#26174;&#31034;&#35813;&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#20171;&#25968;&#21644;&#25509;&#36817;&#24230;&#20013;&#24515;&#24615;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33410;&#28857;&#20013;&#24515;&#24615;&#22312;&#32593;&#32476;&#31185;&#23398;&#12289;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#21644;&#25512;&#33616;&#31995;&#32479;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#22312;&#26102;&#38388;&#25968;&#25454;&#20013;&#65292;&#38745;&#24577;&#22522;&#20110;&#36335;&#24452;&#30340;&#20013;&#24515;&#24615;&#22914;&#25509;&#36817;&#24230;&#25110;&#20171;&#25968;&#21487;&#33021;&#20250;&#23545;&#33410;&#28857;&#22312;&#26102;&#38388;&#22270;&#20013;&#30340;&#30495;&#23454;&#37325;&#35201;&#24615;&#20135;&#29983;&#35823;&#23548;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24050;&#32463;&#23450;&#20041;&#20102;&#22522;&#20110;&#33410;&#28857;&#23545;&#20043;&#38388;&#26368;&#30701;&#26102;&#38388;&#36335;&#24452;&#30340;&#26102;&#38388;&#19968;&#33324;&#21270;&#20171;&#25968;&#21644;&#25509;&#36817;&#24230;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#19968;&#33324;&#21270;&#30340;&#19968;&#20010;&#20027;&#35201;&#38382;&#39064;&#26159;&#35745;&#31639;&#36825;&#26679;&#30340;&#36335;&#24452;&#30340;&#35745;&#31639;&#25104;&#26412;&#36739;&#39640;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;De Bruijn&#22270;&#31070;&#32463;&#32593;&#32476;(DBGNN)&#65292;&#19968;&#31181;&#22240;&#26524;&#24863;&#30693;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#22312;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#20013;&#39044;&#27979;&#22522;&#20110;&#36335;&#24452;&#30340;&#26102;&#38388;&#20013;&#24515;&#24615;&#12290;&#25105;&#20204;&#22312;13&#20010;&#29983;&#29289;&#21644;&#31038;&#20132;&#31995;&#32479;&#30340;&#26102;&#38388;&#22270;&#20013;&#23454;&#39564;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#26174;&#31034;&#23427;&#30456;&#27604;&#38745;&#24577;&#22270;&#21367;&#31215;&#26041;&#27861;&#26174;&#33879;&#25913;&#21892;&#20102;&#20171;&#25968;&#21644;&#25509;&#36817;&#24230;&#20013;&#24515;&#24615;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Node centralities play a pivotal role in network science, social network analysis, and recommender systems. In temporal data, static path-based centralities like closeness or betweenness can give misleading results about the true importance of nodes in a temporal graph. To address this issue, temporal generalizations of betweenness and closeness have been defined that are based on the shortest time-respecting paths between pairs of nodes. However, a major issue of those generalizations is that the calculation of such paths is computationally expensive. Addressing this issue, we study the application of De Bruijn Graph Neural Networks (DBGNN), a causality-aware graph neural network architecture, to predict temporal path-based centralities in time series data. We experimentally evaluate our approach in 13 temporal graphs from biological and social systems and show that it considerably improves the prediction of both betweenness and closeness centrality compared to a static Graph Convolut
&lt;/p&gt;</description></item></channel></rss>