<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>MDB&#26159;&#19968;&#20010;&#35843;&#35797;&#26694;&#26550;&#65292;&#29992;&#20110;&#20114;&#21160;&#26597;&#35810;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#12290;&#23427;&#36890;&#36807;&#38598;&#25104;&#20989;&#25968;&#24335;&#32534;&#31243;&#19982;&#20851;&#31995;&#20195;&#25968;&#65292;&#33021;&#22815;&#24555;&#36895;&#36845;&#20195;&#21644;&#20248;&#21270;&#26597;&#35810;&#65292;&#21457;&#29616;&#21644;&#25551;&#36848;&#38169;&#35823;&#21644;&#27169;&#22411;&#34892;&#20026;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;MDB&#27604;&#20854;&#20182;&#24037;&#20855;&#33021;&#22815;&#23454;&#29616;&#26356;&#24555;&#30340;&#26597;&#35810;&#36895;&#24230;&#21152;&#24555;&#21644;&#26597;&#35810;&#38271;&#24230;&#32553;&#30701;&#12290;</title><link>http://arxiv.org/abs/2308.06686</link><description>&lt;p&gt;
MDB&#65306;&#20114;&#21160;&#26597;&#35810;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
MDB: Interactively Querying Datasets and Models. (arXiv:2308.06686v1 [cs.DB])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06686
&lt;/p&gt;
&lt;p&gt;
MDB&#26159;&#19968;&#20010;&#35843;&#35797;&#26694;&#26550;&#65292;&#29992;&#20110;&#20114;&#21160;&#26597;&#35810;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#12290;&#23427;&#36890;&#36807;&#38598;&#25104;&#20989;&#25968;&#24335;&#32534;&#31243;&#19982;&#20851;&#31995;&#20195;&#25968;&#65292;&#33021;&#22815;&#24555;&#36895;&#36845;&#20195;&#21644;&#20248;&#21270;&#26597;&#35810;&#65292;&#21457;&#29616;&#21644;&#25551;&#36848;&#38169;&#35823;&#21644;&#27169;&#22411;&#34892;&#20026;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;MDB&#27604;&#20854;&#20182;&#24037;&#20855;&#33021;&#22815;&#23454;&#29616;&#26356;&#24555;&#30340;&#26597;&#35810;&#36895;&#24230;&#21152;&#24555;&#21644;&#26597;&#35810;&#38271;&#24230;&#32553;&#30701;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#27169;&#22411;&#30340;&#35757;&#32451;&#21644;&#37096;&#32626;&#65292;&#24320;&#21457;&#32773;&#38656;&#35201;&#33021;&#22815;&#31995;&#32479;&#22320;&#35843;&#35797;&#22312;&#26426;&#22120;&#23398;&#20064;&#27969;&#31243;&#20013;&#20986;&#29616;&#30340;&#38169;&#35823;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;MDB&#65292;&#19968;&#20010;&#29992;&#20110;&#20114;&#21160;&#26597;&#35810;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#30340;&#35843;&#35797;&#26694;&#26550;&#12290;MDB&#36890;&#36807;&#23558;&#20989;&#25968;&#24335;&#32534;&#31243;&#19982;&#20851;&#31995;&#20195;&#25968;&#32467;&#21512;&#36215;&#26469;&#65292;&#26500;&#24314;&#20102;&#19968;&#20010;&#23545;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#39044;&#27979;&#30340;&#25968;&#25454;&#24211;&#36827;&#34892;&#34920;&#36798;&#24615;&#26597;&#35810;&#30340;&#24037;&#20855;&#12290;&#26597;&#35810;&#21487;&#37325;&#29992;&#19988;&#26131;&#20110;&#20462;&#25913;&#65292;&#20351;&#24471;&#35843;&#35797;&#20154;&#21592;&#33021;&#22815;&#24555;&#36895;&#36845;&#20195;&#21644;&#20248;&#21270;&#26597;&#35810;&#65292;&#20197;&#21457;&#29616;&#21644;&#25551;&#36848;&#38169;&#35823;&#21644;&#27169;&#22411;&#34892;&#20026;&#12290;&#25105;&#20204;&#22312;&#30446;&#26631;&#26816;&#27979;&#12289;&#20559;&#24046;&#21457;&#29616;&#12289;&#22270;&#20687;&#20998;&#31867;&#21644;&#25968;&#25454;&#22635;&#20805;&#20219;&#21153;&#20013;&#35780;&#20272;&#20102;MDB&#22312;&#33258;&#21160;&#39550;&#39542;&#35270;&#39057;&#12289;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#21307;&#30103;&#35760;&#24405;&#19978;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;MDB&#27604;&#20854;&#20182;&#22522;&#20934;&#27979;&#35797;&#24037;&#20855;&#33021;&#22815;&#23454;&#29616;&#26368;&#39640;10&#20493;&#30340;&#26597;&#35810;&#36895;&#24230;&#21152;&#24555;&#21644;40%&#30340;&#26597;&#35810;&#38271;&#24230;&#32553;&#30701;&#12290;&#22312;&#29992;&#25143;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#24320;&#21457;&#32773;&#33021;&#22815;&#25104;&#21151;&#26500;&#24314;&#22797;&#26434;&#26597;&#35810;&#26469;&#25551;&#36848;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;
As models are trained and deployed, developers need to be able to systematically debug errors that emerge in the machine learning pipeline. We present MDB, a debugging framework for interactively querying datasets and models. MDB integrates functional programming with relational algebra to build expressive queries over a database of datasets and model predictions. Queries are reusable and easily modified, enabling debuggers to rapidly iterate and refine queries to discover and characterize errors and model behaviors. We evaluate MDB on object detection, bias discovery, image classification, and data imputation tasks across self-driving videos, large language models, and medical records. Our experiments show that MDB enables up to 10x faster and 40\% shorter queries than other baselines. In a user study, we find developers can successfully construct complex queries that describe errors of machine learning models.
&lt;/p&gt;</description></item></channel></rss>