<rss version="2.0"><channel><title>Chat Arxiv cs.SC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SC</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#31526;&#21495;&#35745;&#31639;&#20013;&#30340;&#24212;&#29992;&#32463;&#39564;&#25945;&#35757;&#65292;&#21253;&#25324;&#22312;&#26426;&#22120;&#23398;&#20064;&#20043;&#21069;&#23545;&#25968;&#25454;&#38598;&#36827;&#34892;&#20998;&#26512;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#19981;&#21516;&#26426;&#22120;&#23398;&#20064;&#33539;&#24335;&#30340;&#36873;&#25321;&#12290;&#36890;&#36807;&#22312;&#26609;&#38754;&#20195;&#25968;&#20998;&#35299;&#20013;&#30340;&#21464;&#37327;&#25490;&#24207;&#36873;&#25321;&#20013;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#21457;&#29616;&#20102;&#25968;&#25454;&#38598;&#20013;&#30340;&#19981;&#24179;&#34913;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;&#22686;&#24378;&#25216;&#26415;&#26469;&#25913;&#21892;&#25968;&#25454;&#38598;&#30340;&#24179;&#34913;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.13343</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#31526;&#21495;&#35745;&#31639;&#20013;&#30340;&#25968;&#25454;&#38598;&#21644;&#33539;&#24335;&#30340;&#25945;&#35757;&#65306;&#22522;&#20110;CAD&#30340;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Lessons on Datasets and Paradigms in Machine Learning for Symbolic Computation: A Case Study on CAD. (arXiv:2401.13343v1 [cs.SC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13343
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#31526;&#21495;&#35745;&#31639;&#20013;&#30340;&#24212;&#29992;&#32463;&#39564;&#25945;&#35757;&#65292;&#21253;&#25324;&#22312;&#26426;&#22120;&#23398;&#20064;&#20043;&#21069;&#23545;&#25968;&#25454;&#38598;&#36827;&#34892;&#20998;&#26512;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#19981;&#21516;&#26426;&#22120;&#23398;&#20064;&#33539;&#24335;&#30340;&#36873;&#25321;&#12290;&#36890;&#36807;&#22312;&#26609;&#38754;&#20195;&#25968;&#20998;&#35299;&#20013;&#30340;&#21464;&#37327;&#25490;&#24207;&#36873;&#25321;&#20013;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#21457;&#29616;&#20102;&#25968;&#25454;&#38598;&#20013;&#30340;&#19981;&#24179;&#34913;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;&#22686;&#24378;&#25216;&#26415;&#26469;&#25913;&#21892;&#25968;&#25454;&#38598;&#30340;&#24179;&#34913;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31526;&#21495;&#35745;&#31639;&#31639;&#27861;&#21450;&#20854;&#22312;&#35745;&#31639;&#26426;&#20195;&#25968;&#31995;&#32479;&#20013;&#30340;&#23454;&#29616;&#36890;&#24120;&#21253;&#21547;&#19968;&#20123;&#36873;&#25321;&#65292;&#36825;&#20123;&#36873;&#25321;&#19981;&#20250;&#24433;&#21709;&#32467;&#26524;&#30340;&#27491;&#30830;&#24615;&#65292;&#20294;&#23545;&#25152;&#38656;&#36164;&#28304;&#26377;&#26174;&#33879;&#24433;&#21709;&#65306;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#21487;&#20197;&#38024;&#23545;&#27599;&#20010;&#38382;&#39064;&#21333;&#29420;&#20570;&#20986;&#36825;&#20123;&#36873;&#25321;&#12290;&#26412;&#30740;&#31350;&#25253;&#21578;&#20102;&#22312;&#31526;&#21495;&#35745;&#31639;&#20013;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#30340;&#32463;&#39564;&#25945;&#35757;&#65292;&#29305;&#21035;&#26159;&#22312;&#26426;&#22120;&#23398;&#20064;&#20043;&#21069;&#23545;&#25968;&#25454;&#38598;&#36827;&#34892;&#20998;&#26512;&#30340;&#37325;&#35201;&#24615;&#65292;&#20197;&#21450;&#21487;&#33021;&#20351;&#29992;&#30340;&#19981;&#21516;&#26426;&#22120;&#23398;&#20064;&#33539;&#24335;&#12290;&#19979;&#38754;&#20197;&#26609;&#38754;&#20195;&#25968;&#20998;&#35299;&#20013;&#30340;&#21464;&#37327;&#25490;&#24207;&#36873;&#25321;&#20316;&#20026;&#19968;&#20010;&#20855;&#20307;&#26696;&#20363;&#30740;&#31350;&#30340;&#32467;&#26524;&#26469;&#23637;&#31034;&#65292;&#20294;&#35748;&#20026;&#25152;&#23398;&#21040;&#30340;&#25945;&#35757;&#36866;&#29992;&#20110;&#31526;&#21495;&#35745;&#31639;&#20013;&#30340;&#20854;&#20182;&#20915;&#31574;&#12290;&#25105;&#20204;&#21033;&#29992;&#19968;&#20010;&#29616;&#26377;&#30340;&#20174;&#24212;&#29992;&#20013;&#23548;&#20986;&#30340;&#31034;&#20363;&#25968;&#25454;&#38598;&#65292;&#21457;&#29616;&#35813;&#25968;&#25454;&#38598;&#22312;&#21464;&#37327;&#25490;&#24207;&#20915;&#31574;&#26041;&#38754;&#23384;&#22312;&#19981;&#24179;&#34913;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#31995;&#32479;&#38382;&#39064;&#30340;&#22686;&#24378;&#25216;&#26415;&#65292;&#20351;&#24471;&#27599;&#20010;&#38382;&#39064;&#21487;&#20197;&#26377;&#22810;&#20010;&#31034;&#20363;&#20197;&#22686;&#24378;&#25968;&#25454;&#38598;&#30340;&#24179;&#34913;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Symbolic Computation algorithms and their implementation in computer algebra systems often contain choices which do not affect the correctness of the output but can significantly impact the resources required: such choices can benefit from having them made separately for each problem via a machine learning model. This study reports lessons on such use of machine learning in symbolic computation, in particular on the importance of analysing datasets prior to machine learning and on the different machine learning paradigms that may be utilised. We present results for a particular case study, the selection of variable ordering for cylindrical algebraic decomposition, but expect that the lessons learned are applicable to other decisions in symbolic computation.  We utilise an existing dataset of examples derived from applications which was found to be imbalanced with respect to the variable ordering decision. We introduce an augmentation technique for polynomial systems problems that allow
&lt;/p&gt;</description></item></channel></rss>