<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#22411;&#30340;&#24615;&#33021;&#29305;&#24449;&#26354;&#32447;&#65292;&#29992;&#20110;&#35780;&#20272;&#20854;&#22312;&#19981;&#21516;&#22797;&#26434;&#24230;&#20219;&#21153;&#20013;&#30340;&#34920;&#29616;&#12290;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#20449;&#24687;&#29109;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#38543;&#26426;&#24615;&#19982;&#27169;&#22411;&#39044;&#27979;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#21457;&#29616;&#19981;&#21516;&#26465;&#20214;&#19979;&#30340;&#25968;&#25454;&#28857;&#37117;&#21487;&#20197;&#21512;&#24182;&#25104;&#19968;&#26465;&#26354;&#32447;&#65292;&#25429;&#25417;&#20102;&#27169;&#22411;&#22312;&#38754;&#23545;&#19981;&#30830;&#23450;&#24615;&#26102;&#30340;&#27491;&#30830;&#39044;&#27979;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.09537</link><description>&lt;p&gt;
&#19968;&#31181;&#27169;&#22411;&#35780;&#20272;&#30340;&#24615;&#33021;&#29305;&#24449;&#26354;&#32447;&#65306;&#22312;&#20449;&#24687;&#25193;&#25955;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A performance characteristic curve for model evaluation: the application in information diffusion prediction. (arXiv:2309.09537v2 [cs.SI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09537
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#22411;&#30340;&#24615;&#33021;&#29305;&#24449;&#26354;&#32447;&#65292;&#29992;&#20110;&#35780;&#20272;&#20854;&#22312;&#19981;&#21516;&#22797;&#26434;&#24230;&#20219;&#21153;&#20013;&#30340;&#34920;&#29616;&#12290;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#20449;&#24687;&#29109;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#38543;&#26426;&#24615;&#19982;&#27169;&#22411;&#39044;&#27979;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#21457;&#29616;&#19981;&#21516;&#26465;&#20214;&#19979;&#30340;&#25968;&#25454;&#28857;&#37117;&#21487;&#20197;&#21512;&#24182;&#25104;&#19968;&#26465;&#26354;&#32447;&#65292;&#25429;&#25417;&#20102;&#27169;&#22411;&#22312;&#38754;&#23545;&#19981;&#30830;&#23450;&#24615;&#26102;&#30340;&#27491;&#30830;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#32593;&#32476;&#19978;&#30340;&#20449;&#24687;&#25193;&#25955;&#39044;&#27979;&#26088;&#22312;&#39044;&#27979;&#26410;&#26469;&#28040;&#24687;&#30340;&#25509;&#25910;&#32773;&#65292;&#22312;&#24066;&#22330;&#33829;&#38144;&#21644;&#31038;&#20132;&#23186;&#20307;&#31561;&#23454;&#38469;&#24212;&#29992;&#20013;&#20855;&#26377;&#23454;&#29992;&#20215;&#20540;&#12290;&#23613;&#31649;&#19981;&#21516;&#30340;&#39044;&#27979;&#27169;&#22411;&#37117;&#22768;&#31216;&#34920;&#29616;&#33391;&#22909;&#65292;&#20294;&#24615;&#33021;&#35780;&#20272;&#30340;&#36890;&#29992;&#26694;&#26550;&#20173;&#28982;&#26377;&#38480;&#12290;&#26412;&#25991;&#26088;&#22312;&#35782;&#21035;&#27169;&#22411;&#30340;&#24615;&#33021;&#29305;&#24449;&#26354;&#32447;&#65292;&#35813;&#26354;&#32447;&#25429;&#33719;&#20102;&#27169;&#22411;&#22312;&#19981;&#21516;&#22797;&#26434;&#24230;&#20219;&#21153;&#19978;&#30340;&#34920;&#29616;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#29109;&#30340;&#24230;&#37327;&#26041;&#27861;&#26469;&#37327;&#21270;&#25193;&#25955;&#25968;&#25454;&#20013;&#30340;&#38543;&#26426;&#24615;&#65292;&#28982;&#21518;&#30830;&#23450;&#20102;&#38543;&#26426;&#24615;&#19982;&#27169;&#22411;&#39044;&#27979;&#20934;&#30830;&#24615;&#20043;&#38388;&#30340;&#32553;&#25918;&#27169;&#24335;&#12290;&#19981;&#21516;&#24207;&#21015;&#38271;&#24230;&#12289;&#31995;&#32479;&#22823;&#23567;&#21644;&#38543;&#26426;&#24615;&#19979;&#30340;&#25968;&#25454;&#28857;&#37117;&#21512;&#24182;&#25104;&#19968;&#26465;&#26354;&#32447;&#65292;&#25429;&#25417;&#20102;&#27169;&#22411;&#22312;&#38754;&#23545;&#22686;&#21152;&#30340;&#19981;&#30830;&#23450;&#24615;&#26102;&#20316;&#20986;&#27491;&#30830;&#39044;&#27979;&#30340;&#20869;&#22312;&#33021;&#21147;&#12290;&#32771;&#34385;&#21040;&#36825;&#26465;&#26354;&#32447;&#20855;&#26377;&#35780;&#20272;&#27169;&#22411;&#30340;&#37325;&#35201;&#23646;&#24615;&#65292;&#25105;&#20204;&#23558;&#20854;&#23450;&#20041;&#20026;&#27169;&#22411;&#30340;&#24615;&#33021;&#29305;&#24449;&#26354;&#32447;&#12290;
&lt;/p&gt;
&lt;p&gt;
The information diffusion prediction on social networks aims to predict future recipients of a message, with practical applications in marketing and social media. While different prediction models all claim to perform well, general frameworks for performance evaluation remain limited. Here, we aim to identify a performance characteristic curve for a model, which captures its performance on tasks of different complexity. We propose a metric based on information entropy to quantify the randomness in diffusion data, then identify a scaling pattern between the randomness and the prediction accuracy of the model. Data points in the patterns by different sequence lengths, system sizes, and randomness all collapse into a single curve, capturing a model's inherent capability of making correct predictions against increased uncertainty. Given that this curve has such important properties that it can be used to evaluate the model, we define it as the performance characteristic curve of the model.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#37051;&#22495;&#28151;&#28102;&#24230;&#37327;&#26469;&#20998;&#31163;&#23398;&#20064;&#35299;&#20915;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#28151;&#28102;&#33410;&#28857;&#30340;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26356;&#21487;&#38752;&#22320;&#21306;&#20998;&#24322;&#36136;&#33410;&#28857;&#21644;&#21516;&#36136;&#33410;&#28857;&#65292;&#24182;&#25913;&#21892;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2306.02285</link><description>&lt;p&gt;
&#36890;&#36807;&#20998;&#31163;&#23398;&#20064;&#35299;&#20915;&#28151;&#28102;&#33410;&#28857;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Clarify Confused Nodes Through Separated Learning. (arXiv:2306.02285v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02285
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#37051;&#22495;&#28151;&#28102;&#24230;&#37327;&#26469;&#20998;&#31163;&#23398;&#20064;&#35299;&#20915;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#28151;&#28102;&#33410;&#28857;&#30340;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26356;&#21487;&#38752;&#22320;&#21306;&#20998;&#24322;&#36136;&#33410;&#28857;&#21644;&#21516;&#36136;&#33410;&#28857;&#65292;&#24182;&#25913;&#21892;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#22312;&#22270;&#23548;&#21521;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#36827;&#23637;&#12290;&#28982;&#32780;&#65292;&#29616;&#23454;&#19990;&#30028;&#30340;&#22270;&#20013;&#19981;&#21487;&#36991;&#20813;&#22320;&#21253;&#21547;&#19968;&#23450;&#27604;&#20363;&#30340;&#24322;&#36136;&#33410;&#28857;&#65292;&#36825;&#25361;&#25112;&#20102;&#32463;&#20856;GNN&#30340;&#21516;&#36136;&#24615;&#20551;&#35774;&#65292;&#24182;&#38459;&#30861;&#20102;&#20854;&#24615;&#33021;&#12290;&#29616;&#26377;&#30740;&#31350;&#22823;&#22810;&#25968;&#20173;&#35774;&#35745;&#20102;&#20855;&#26377;&#24322;&#36136;&#33410;&#28857;&#21644;&#21516;&#36136;&#33410;&#28857;&#38388;&#20849;&#20139;&#26435;&#37325;&#30340;&#36890;&#29992;&#27169;&#22411;&#12290;&#23613;&#31649;&#36825;&#20123;&#21162;&#21147;&#20013;&#21253;&#21547;&#20102;&#39640;&#38454;&#20449;&#24687;&#21644;&#22810;&#36890;&#36947;&#26550;&#26500;&#65292;&#20294;&#24448;&#24448;&#25928;&#26524;&#19981;&#20339;&#12290;&#23569;&#25968;&#30740;&#31350;&#23581;&#35797;&#35757;&#32451;&#19981;&#21516;&#33410;&#28857;&#32452;&#30340;&#20998;&#31163;&#23398;&#20064;&#65292;&#20294;&#21463;&#21040;&#20102;&#19981;&#21512;&#36866;&#30340;&#20998;&#31163;&#24230;&#37327;&#21644;&#20302;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#39318;&#20808;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#25351;&#26631;&#65292;&#31216;&#20026;&#37051;&#22495;&#28151;&#28102;&#65288;NC&#65289;&#65292;&#20197;&#20415;&#26356;&#21487;&#38752;&#22320;&#20998;&#31163;&#33410;&#28857;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#20855;&#26377;&#19981;&#21516;NC&#20540;&#30340;&#33410;&#28857;&#32452;&#22312;&#32452;&#20869;&#20934;&#30830;&#24230;&#21644;&#21487;&#35270;&#21270;&#23884;&#20837;&#19978;&#23384;&#22312;&#19968;&#23450;&#24046;&#24322;&#12290;&#36825;&#20026;&#22522;&#20110;&#37051;&#22495;&#28151;&#28102;&#30340;&#22270;&#21367;&#31215;&#32593;&#32476;&#65288;NC-GCN&#65289;&#38138;&#24179;&#20102;&#36947;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph neural networks (GNNs) have achieved remarkable advances in graph-oriented tasks. However, real-world graphs invariably contain a certain proportion of heterophilous nodes, challenging the homophily assumption of classical GNNs and hindering their performance. Most existing studies continue to design generic models with shared weights between heterophilous and homophilous nodes. Despite the incorporation of high-order messages or multi-channel architectures, these efforts often fall short. A minority of studies attempt to train different node groups separately but suffer from inappropriate separation metrics and low efficiency. In this paper, we first propose a new metric, termed Neighborhood Confusion (NC), to facilitate a more reliable separation of nodes. We observe that node groups with different levels of NC values exhibit certain differences in intra-group accuracy and visualized embeddings. These pave the way for Neighborhood Confusion-guided Graph Convolutional Network (N
&lt;/p&gt;</description></item></channel></rss>