<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;PBSCSR&#25968;&#25454;&#38598;&#65292;&#29992;&#20110;&#30740;&#31350;&#38050;&#29748;&#20048;&#35889;&#20316;&#26354;&#23478;&#39118;&#26684;&#35782;&#21035;&#12290;&#25968;&#25454;&#38598;&#21253;&#21547;&#20102;&#30423;&#29256;&#20048;&#35889;&#22270;&#20687;&#21644;&#30456;&#20851;&#20803;&#25968;&#25454;&#65292;&#21487;&#20197;&#36827;&#34892;&#22810;&#20010;&#30740;&#31350;&#20219;&#21153;&#12290;</title><link>http://arxiv.org/abs/2401.16803</link><description>&lt;p&gt;
PBSCSR&#65306;&#38050;&#29748;&#40657;&#24066;&#20048;&#35889;&#20316;&#26354;&#23478;&#39118;&#26684;&#35782;&#21035;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
PBSCSR: The Piano Bootleg Score Composer Style Recognition Dataset. (arXiv:2401.16803v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16803
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;PBSCSR&#25968;&#25454;&#38598;&#65292;&#29992;&#20110;&#30740;&#31350;&#38050;&#29748;&#20048;&#35889;&#20316;&#26354;&#23478;&#39118;&#26684;&#35782;&#21035;&#12290;&#25968;&#25454;&#38598;&#21253;&#21547;&#20102;&#30423;&#29256;&#20048;&#35889;&#22270;&#20687;&#21644;&#30456;&#20851;&#20803;&#25968;&#25454;&#65292;&#21487;&#20197;&#36827;&#34892;&#22810;&#20010;&#30740;&#31350;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;PBSCSR&#25968;&#25454;&#38598;&#65292;&#29992;&#20110;&#30740;&#31350;&#38050;&#29748;&#20048;&#35889;&#20316;&#26354;&#23478;&#39118;&#26684;&#35782;&#21035;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#21019;&#24314;&#19968;&#20010;&#30740;&#31350;&#20316;&#26354;&#23478;&#39118;&#26684;&#35782;&#21035;&#30340;&#25968;&#25454;&#38598;&#65292;&#23427;&#26082;&#20687;MNIST&#19968;&#26679;&#26131;&#20110;&#33719;&#21462;&#65292;&#21448;&#20687;ImageNet&#19968;&#26679;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#20010;&#30446;&#26631;&#65292;&#25105;&#20204;&#20174;IMSLP&#30340;&#38050;&#29748;&#20048;&#35889;&#22270;&#20687;&#20013;&#37319;&#26679;&#22266;&#23450;&#38271;&#24230;&#30340;&#30423;&#29256;&#20048;&#35889;&#29255;&#27573;&#12290;&#25968;&#25454;&#38598;&#26412;&#36523;&#21253;&#21547;40,000&#20010;62x64&#30340;&#30423;&#29256;&#20048;&#35889;&#22270;&#20687;&#65292;&#29992;&#20110;&#36827;&#34892;9&#20998;&#31867;&#20219;&#21153;&#65292;&#20197;&#21450;100,000&#20010;62x64&#30340;&#30423;&#29256;&#20048;&#35889;&#22270;&#20687;&#65292;&#29992;&#20110;&#36827;&#34892;100&#20998;&#31867;&#20219;&#21153;&#65292;&#36824;&#26377;29,310&#20010;&#26080;&#26631;&#31614;&#30340;&#21487;&#21464;&#38271;&#24230;&#30340;&#30423;&#29256;&#20048;&#35889;&#22270;&#20687;&#65292;&#29992;&#20110;&#39044;&#35757;&#32451;&#12290;&#26631;&#35760;&#25968;&#25454;&#20197;&#19982;MNIST&#22270;&#20687;&#31867;&#20284;&#30340;&#24418;&#24335;&#21576;&#29616;&#65292;&#20197;&#20415;&#26497;&#20854;&#26041;&#20415;&#22320;&#21487;&#35270;&#21270;&#12289;&#25805;&#20316;&#21644;&#35757;&#32451;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#21253;&#25324;&#30456;&#20851;&#30340;&#20803;&#25968;&#25454;&#65292;&#20197;&#20801;&#35768;&#35775;&#38382;IMSLP&#19978;&#30340;&#21407;&#22987;&#20048;&#35889;&#22270;&#20687;&#21644;&#20854;&#20182;&#30456;&#20851;&#25968;&#25454;&#12290;&#25105;&#20204;&#25551;&#36848;&#20102;&#20960;&#20010;&#21487;&#20197;&#20351;&#29992;&#35813;&#25968;&#25454;&#36827;&#34892;&#30740;&#31350;&#30340;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article motivates, describes, and presents the PBSCSR dataset for studying composer style recognition of piano sheet music. Our overarching goal was to create a dataset for studying composer style recognition that is "as accessible as MNIST and as challenging as ImageNet." To achieve this goal, we sample fixed-length bootleg score fragments from piano sheet music images on IMSLP. The dataset itself contains 40,000 62x64 bootleg score images for a 9-way classification task, 100,000 62x64 bootleg score images for a 100-way classification task, and 29,310 unlabeled variable-length bootleg score images for pretraining. The labeled data is presented in a form that mirrors MNIST images, in order to make it extremely easy to visualize, manipulate, and train models in an efficient manner. Additionally, we include relevant metadata to allow access to the underlying raw sheet music images and other related data on IMSLP. We describe several research tasks that could be studied with the data
&lt;/p&gt;</description></item></channel></rss>