<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#21512;&#22270;&#31070;&#32463;&#32593;&#32476;&#21644;&#21452;&#26426;&#22120;&#23398;&#20064;&#30340;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#20934;&#30830;&#21644;&#39640;&#25928;&#22320;&#20272;&#35745;&#30452;&#25509;&#21644;&#21516;&#34892;&#25928;&#24212;&#65292;&#22788;&#29702;&#32593;&#32476;&#28151;&#26434;&#22240;&#32032;&#65292;&#24182;&#19968;&#33268;&#22320;&#20272;&#35745;&#25152;&#38656;&#30340;&#22240;&#26524;&#25928;&#24212;</title><link>https://arxiv.org/abs/2403.11332</link><description>&lt;p&gt;
&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#32593;&#32476;&#22240;&#26524;&#25928;&#24212;&#21452;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Network based Double Machine Learning Estimator of Network Causal Effects
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11332
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#21512;&#22270;&#31070;&#32463;&#32593;&#32476;&#21644;&#21452;&#26426;&#22120;&#23398;&#20064;&#30340;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#20934;&#30830;&#21644;&#39640;&#25928;&#22320;&#20272;&#35745;&#30452;&#25509;&#21644;&#21516;&#34892;&#25928;&#24212;&#65292;&#22788;&#29702;&#32593;&#32476;&#28151;&#26434;&#22240;&#32032;&#65292;&#24182;&#19968;&#33268;&#22320;&#20272;&#35745;&#25152;&#38656;&#30340;&#22240;&#26524;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30340;&#35770;&#25991;&#35299;&#20915;&#20102;&#22312;&#31038;&#20132;&#32593;&#32476;&#25968;&#25454;&#20013;&#25512;&#26029;&#22240;&#26524;&#25928;&#24212;&#30340;&#25361;&#25112;&#65292;&#36825;&#20123;&#25968;&#25454;&#20855;&#26377;&#20010;&#20307;&#20043;&#38388;&#22797;&#26434;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#23548;&#33268;&#21333;&#20301;&#20043;&#38388;&#19981;&#29420;&#31435;&#12289;&#24178;&#25200;&#65288;&#21333;&#20301;&#30340;&#32467;&#26524;&#21463;&#37051;&#23621;&#30340;&#22788;&#29702;&#24433;&#21709;&#65289;&#20197;&#21450;&#24341;&#20837;&#26469;&#33258;&#37051;&#36817;&#21333;&#20301;&#30340;&#39069;&#22806;&#28151;&#26434;&#22240;&#32032;&#31561;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#22270;&#31070;&#32463;&#32593;&#32476;&#21644;&#21452;&#26426;&#22120;&#23398;&#20064;&#30456;&#32467;&#21512;&#30340;&#21019;&#26032;&#26041;&#27861;&#65292;&#33021;&#22815;&#20351;&#29992;&#21333;&#20010;&#35266;&#27979;&#31038;&#20132;&#32593;&#32476;&#20934;&#30830;&#39640;&#25928;&#22320;&#20272;&#35745;&#30452;&#25509;&#21644;&#21516;&#20276;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21033;&#29992;&#22270;&#21516;&#26500;&#32593;&#32476;&#19982;&#21452;&#26426;&#22120;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#26377;&#25928;&#35843;&#25972;&#32593;&#32476;&#28151;&#26434;&#22240;&#32032;&#24182;&#19968;&#33268;&#22320;&#20272;&#35745;&#25152;&#38656;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#26082;&#20855;&#26377;&#28176;&#36817;&#27491;&#24577;&#24615;&#21448;&#21322;&#21442;&#25968;&#39640;&#25928;&#12290;&#25105;&#20204;&#23545;&#19977;&#20010;&#21322;&#21512;&#25104;&#29366;&#24577;&#19979;&#30340;&#22235;&#31181;&#26368;&#20808;&#36827;&#22522;&#32447;&#26041;&#27861;&#36827;&#34892;&#20102;&#20840;&#38754;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11332v1 Announce Type: new  Abstract: Our paper addresses the challenge of inferring causal effects in social network data, characterized by complex interdependencies among individuals resulting in challenges such as non-independence of units, interference (where a unit's outcome is affected by neighbors' treatments), and introduction of additional confounding factors from neighboring units. We propose a novel methodology combining graph neural networks and double machine learning, enabling accurate and efficient estimation of direct and peer effects using a single observational social network. Our approach utilizes graph isomorphism networks in conjunction with double machine learning to effectively adjust for network confounders and consistently estimate the desired causal effects. We demonstrate that our estimator is both asymptotically normal and semiparametrically efficient. A comprehensive evaluation against four state-of-the-art baseline methods using three semi-synth
&lt;/p&gt;</description></item></channel></rss>