<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>PowerFlowMultiNet&#26159;&#19968;&#31181;&#19987;&#38376;&#20026;&#19981;&#24179;&#34913;&#19977;&#30456;&#21151;&#29575;&#32593;&#26684;&#35774;&#35745;&#30340;&#26032;&#39062;&#22810;&#22270;GNN&#26694;&#26550;&#65292;&#33021;&#22815;&#26377;&#25928;&#25429;&#25417;&#19981;&#24179;&#34913;&#32593;&#26684;&#20013;&#30340;&#19981;&#23545;&#31216;&#24615;&#65292;&#24182;&#24341;&#20837;&#20102;&#22270;&#23884;&#20837;&#26426;&#21046;&#26469;&#25429;&#33719;&#30005;&#21147;&#31995;&#32479;&#32593;&#32476;&#20869;&#37096;&#30340;&#31354;&#38388;&#20381;&#36182;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.00892</link><description>&lt;p&gt;
PowerFlowMultiNet&#65306;&#29992;&#20110;&#19981;&#24179;&#34913;&#19977;&#30456;&#37197;&#30005;&#31995;&#32479;&#30340;&#22810;&#22270;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
PowerFlowMultiNet: Multigraph Neural Networks for Unbalanced Three-Phase Distribution Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00892
&lt;/p&gt;
&lt;p&gt;
PowerFlowMultiNet&#26159;&#19968;&#31181;&#19987;&#38376;&#20026;&#19981;&#24179;&#34913;&#19977;&#30456;&#21151;&#29575;&#32593;&#26684;&#35774;&#35745;&#30340;&#26032;&#39062;&#22810;&#22270;GNN&#26694;&#26550;&#65292;&#33021;&#22815;&#26377;&#25928;&#25429;&#25417;&#19981;&#24179;&#34913;&#32593;&#26684;&#20013;&#30340;&#19981;&#23545;&#31216;&#24615;&#65292;&#24182;&#24341;&#20837;&#20102;&#22270;&#23884;&#20837;&#26426;&#21046;&#26469;&#25429;&#33719;&#30005;&#21147;&#31995;&#32479;&#32593;&#32476;&#20869;&#37096;&#30340;&#31354;&#38388;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#25928;&#35299;&#20915;&#37197;&#30005;&#32593;&#20013;&#19981;&#24179;&#34913;&#30340;&#19977;&#30456;&#21151;&#29575;&#27969;&#38382;&#39064;&#23545;&#20110;&#32593;&#26684;&#20998;&#26512;&#21644;&#20223;&#30495;&#33267;&#20851;&#37325;&#35201;&#12290;&#30446;&#21069;&#24613;&#38656;&#21487;&#22788;&#29702;&#22823;&#35268;&#27169;&#19981;&#24179;&#34913;&#21151;&#29575;&#32593;&#26684;&#24182;&#33021;&#25552;&#20379;&#20934;&#30830;&#24555;&#36895;&#35299;&#20915;&#26041;&#26696;&#30340;&#21487;&#25193;&#23637;&#31639;&#27861;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#23588;&#20854;&#26159;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#24212;&#36816;&#32780;&#29983;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#25991;&#29486;&#20027;&#35201;&#38598;&#20013;&#22312;&#24179;&#34913;&#32593;&#32476;&#19978;&#65292;&#32570;&#20047;&#25903;&#25345;&#19981;&#24179;&#34913;&#19977;&#30456;&#21151;&#29575;&#32593;&#32476;&#30340;&#20851;&#38190;&#20869;&#23481;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;PowerFlowMultiNet&#65292;&#36825;&#26159;&#19968;&#20010;&#19987;&#38376;&#20026;&#19981;&#24179;&#34913;&#19977;&#30456;&#21151;&#29575;&#32593;&#26684;&#35774;&#35745;&#30340;&#26032;&#39062;&#22810;&#22270;GNN&#26694;&#26550;&#12290;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#22810;&#22270;&#34920;&#31034;&#20013;&#20998;&#21035;&#23545;&#27599;&#20010;&#30456;&#36827;&#34892;&#24314;&#27169;&#65292;&#26377;&#25928;&#25429;&#25417;&#19981;&#24179;&#34913;&#32593;&#26684;&#20013;&#22266;&#26377;&#30340;&#19981;&#23545;&#31216;&#24615;&#12290;&#24341;&#20837;&#20102;&#21033;&#29992;&#28040;&#24687;&#20256;&#36882;&#25429;&#33719;&#30005;&#21147;&#31995;&#32479;&#32593;&#32476;&#20869;&#37096;&#31354;&#38388;&#20381;&#36182;&#20851;&#31995;&#30340;&#22270;&#23884;&#20837;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00892v1 Announce Type: cross  Abstract: Efficiently solving unbalanced three-phase power flow in distribution grids is pivotal for grid analysis and simulation. There is a pressing need for scalable algorithms capable of handling large-scale unbalanced power grids that can provide accurate and fast solutions. To address this, deep learning techniques, especially Graph Neural Networks (GNNs), have emerged. However, existing literature primarily focuses on balanced networks, leaving a critical gap in supporting unbalanced three-phase power grids. This letter introduces PowerFlowMultiNet, a novel multigraph GNN framework explicitly designed for unbalanced three-phase power grids. The proposed approach models each phase separately in a multigraph representation, effectively capturing the inherent asymmetry in unbalanced grids. A graph embedding mechanism utilizing message passing is introduced to capture spatial dependencies within the power system network. PowerFlowMultiNet out
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36229;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#38598;&#25104;&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;&#65292;&#20351;&#29992;&#36229;&#22270;&#25429;&#25417;&#31471;&#21475;&#25195;&#25551;&#25915;&#20987;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#20351;&#29992;&#27966;&#29983;&#30340;&#24230;&#37327;&#26469;&#35757;&#32451;NIDS&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#39640;&#31934;&#24230;&#12289;&#39640;&#20934;&#30830;&#29575;&#12289;&#39640;&#21484;&#22238;&#29575;&#24615;&#33021;&#19979;&#23454;&#26102;&#30417;&#27979;&#21644;&#26816;&#27979;&#31471;&#21475;&#25195;&#25551;&#27963;&#21160;&#12289;&#20854;&#20182;&#31867;&#22411;&#30340;&#25915;&#20987;&#21644;&#25932;&#23545;&#20837;&#20405;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;NIDS&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2211.03933</link><description>&lt;p&gt;
&#22522;&#20110;&#36229;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#38598;&#25104;&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
A Hypergraph-Based Machine Learning Ensemble Network Intrusion Detection System. (arXiv:2211.03933v2 [cs.CR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.03933
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36229;&#22270;&#30340;&#26426;&#22120;&#23398;&#20064;&#38598;&#25104;&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;&#65292;&#20351;&#29992;&#36229;&#22270;&#25429;&#25417;&#31471;&#21475;&#25195;&#25551;&#25915;&#20987;&#30340;&#28436;&#21270;&#27169;&#24335;&#65292;&#24182;&#20351;&#29992;&#27966;&#29983;&#30340;&#24230;&#37327;&#26469;&#35757;&#32451;NIDS&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#39640;&#31934;&#24230;&#12289;&#39640;&#20934;&#30830;&#29575;&#12289;&#39640;&#21484;&#22238;&#29575;&#24615;&#33021;&#19979;&#23454;&#26102;&#30417;&#27979;&#21644;&#26816;&#27979;&#31471;&#21475;&#25195;&#25551;&#27963;&#21160;&#12289;&#20854;&#20182;&#31867;&#22411;&#30340;&#25915;&#20987;&#21644;&#25932;&#23545;&#20837;&#20405;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;NIDS&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;(NIDS)&#22312;&#26816;&#27979;&#24694;&#24847;&#25915;&#20987;&#26102;&#20173;&#28982;&#38754;&#20020;&#25361;&#25112;&#12290;NIDS&#36890;&#24120;&#22312;&#31163;&#32447;&#29366;&#24577;&#19979;&#24320;&#21457;&#65292;&#20294;&#38754;&#23545;&#33258;&#21160;&#29983;&#25104;&#30340;&#31471;&#21475;&#25195;&#25551;&#28183;&#36879;&#23581;&#35797;&#26102;&#65292;&#20250;&#23548;&#33268;&#20174;&#23545;&#25163;&#36866;&#24212;&#21040;NIDS&#21709;&#24212;&#30340;&#26174;&#30528;&#26102;&#38388;&#28382;&#21518;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#20197;Internet&#21327;&#35758;&#22320;&#22336;&#21644;&#30446;&#26631;&#31471;&#21475;&#20026;&#37325;&#28857;&#30340;&#36229;&#22270;&#26469;&#25429;&#25417;&#31471;&#21475;&#25195;&#25551;&#25915;&#20987;&#30340;&#28436;&#21270;&#27169;&#24335;&#12290;&#28982;&#21518;&#20351;&#29992;&#27966;&#29983;&#30340;&#22522;&#20110;&#36229;&#22270;&#30340;&#24230;&#37327;&#26469;&#35757;&#32451;&#19968;&#20010;&#38598;&#25104;&#26426;&#22120;&#23398;&#20064;(ML)&#30340;NIDS&#65292;&#20174;&#32780;&#20801;&#35768;&#22312;&#39640;&#31934;&#24230;&#12289;&#39640;&#20934;&#30830;&#29575;&#12289;&#39640;&#21484;&#22238;&#29575;&#24615;&#33021;&#19979;&#23454;&#26102;&#35843;&#25972;&#65292;&#30417;&#27979;&#21644;&#26816;&#27979;&#31471;&#21475;&#25195;&#25551;&#27963;&#21160;&#12289;&#20854;&#20182;&#31867;&#22411;&#30340;&#25915;&#20987;&#21644;&#25932;&#23545;&#20837;&#20405;&#12290;&#36825;&#20010;ML&#33258;&#36866;&#24212;&#30340;NIDS&#26159;&#36890;&#36807;&#20197;&#19979;&#20960;&#20010;&#37096;&#20998;&#30340;&#32452;&#21512;&#24320;&#21457;&#20986;&#26469;&#30340;&#65306;(1)&#20837;&#20405;&#31034;&#20363;&#65292;(2)NIDS&#26356;&#26032;&#35268;&#21017;&#65292;(3)&#35302;&#21457;NIDS&#37325;&#26032;&#35757;&#32451;&#35831;&#27714;&#30340;&#25915;&#20987;&#38408;&#20540;&#36873;&#25321;&#65292;&#20197;&#21450;(4)&#22312;&#27809;&#26377;&#20808;&#21069;&#32593;&#32476;&#24615;&#36136;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#30340;&#29983;&#20135;&#29615;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;
Network intrusion detection systems (NIDS) to detect malicious attacks continue to meet challenges. NIDS are often developed offline while they face auto-generated port scan infiltration attempts, resulting in a significant time lag from adversarial adaption to NIDS response. To address these challenges, we use hypergraphs focused on internet protocol addresses and destination ports to capture evolving patterns of port scan attacks. The derived set of hypergraph-based metrics are then used to train an ensemble machine learning (ML) based NIDS that allows for real-time adaption in monitoring and detecting port scanning activities, other types of attacks, and adversarial intrusions at high accuracy, precision and recall performances. This ML adapting NIDS was developed through the combination of (1) intrusion examples, (2) NIDS update rules, (3) attack threshold choices to trigger NIDS retraining requests, and (4) a production environment with no prior knowledge of the nature of network 
&lt;/p&gt;</description></item></channel></rss>