<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#36890;&#36807;&#35782;&#21035;&#19968;&#20010;&#29983;&#25104;&#32593;&#32476;&#27169;&#22411;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#35774;&#32622;&#65292;IPF&#21487;&#20197;&#24674;&#22797;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65292;&#25581;&#31034;&#20102;&#20851;&#20110;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#20351;&#29992;IPF&#30340;&#38544;&#21547;&#20551;&#35774;&#65292;&#24182;&#21487;&#20197;&#20026;IPF&#30340;&#21442;&#25968;&#20272;&#35745;&#25552;&#20379;&#32467;&#26500;&#30456;&#20851;&#30340;&#35823;&#24046;&#30028;&#12290;</title><link>https://arxiv.org/abs/2402.18697</link><description>&lt;p&gt;
&#20174;&#36793;&#38469;&#25512;&#26029;&#21160;&#24577;&#32593;&#32476;&#30340;&#26041;&#27861;&#65306;&#36845;&#20195;&#27604;&#20363;&#25311;&#21512;
&lt;/p&gt;
&lt;p&gt;
Inferring Dynamic Networks from Marginals with Iterative Proportional Fitting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18697
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35782;&#21035;&#19968;&#20010;&#29983;&#25104;&#32593;&#32476;&#27169;&#22411;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#35774;&#32622;&#65292;IPF&#21487;&#20197;&#24674;&#22797;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65292;&#25581;&#31034;&#20102;&#20851;&#20110;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#20351;&#29992;IPF&#30340;&#38544;&#21547;&#20551;&#35774;&#65292;&#24182;&#21487;&#20197;&#20026;IPF&#30340;&#21442;&#25968;&#20272;&#35745;&#25552;&#20379;&#32467;&#26500;&#30456;&#20851;&#30340;&#35823;&#24046;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26469;&#33258;&#29616;&#23454;&#25968;&#25454;&#32422;&#26463;&#30340;&#24120;&#35265;&#32593;&#32476;&#25512;&#26029;&#38382;&#39064;&#26159;&#22914;&#20309;&#20174;&#26102;&#38388;&#32858;&#21512;&#30340;&#37051;&#25509;&#30697;&#38453;&#21644;&#26102;&#38388;&#21464;&#21270;&#36793;&#38469;&#65288;&#21363;&#34892;&#21521;&#37327;&#21644;&#21015;&#21521;&#37327;&#20043;&#21644;&#65289;&#25512;&#26029;&#21160;&#24577;&#32593;&#32476;&#12290;&#20808;&#21069;&#30340;&#26041;&#27861;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#37325;&#26032;&#21033;&#29992;&#20102;&#32463;&#20856;&#30340;&#36845;&#20195;&#27604;&#20363;&#25311;&#21512;&#65288;IPF&#65289;&#36807;&#31243;&#65292;&#20063;&#31216;&#20026;Sinkhorn&#31639;&#27861;&#65292;&#24182;&#21462;&#24471;&#20102;&#20196;&#20154;&#28385;&#24847;&#30340;&#32463;&#39564;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#20351;&#29992;IPF&#30340;&#32479;&#35745;&#22522;&#30784;&#23578;&#26410;&#24471;&#21040;&#24456;&#22909;&#30340;&#29702;&#35299;&#65306;&#22312;&#20160;&#20040;&#24773;&#20917;&#19979;&#65292;IPF&#25552;&#20379;&#20102;&#20174;&#36793;&#38469;&#20934;&#30830;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#30340;&#21407;&#21017;&#24615;&#65292;&#20197;&#21450;&#23427;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#20272;&#35745;&#20102;&#32593;&#32476;&#65311;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#36825;&#26679;&#19968;&#20010;&#35774;&#32622;&#65292;&#36890;&#36807;&#35782;&#21035;&#19968;&#20010;&#29983;&#25104;&#32593;&#32476;&#27169;&#22411;&#65292;IPF&#21487;&#20197;&#24674;&#22797;&#20854;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#25581;&#31034;&#20102;&#20851;&#20110;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#20351;&#29992;IPF&#30340;&#38544;&#21547;&#20551;&#35774;&#65292;&#24182;&#20351;&#24471;&#21487;&#20197;&#36827;&#34892;&#26032;&#30340;&#20998;&#26512;&#65292;&#22914;&#26377;&#20851;IPF&#21442;&#25968;&#20272;&#35745;&#30340;&#32467;&#26500;&#30456;&#20851;&#35823;&#24046;&#30028;&#12290;&#24403;IPF&#22833;&#36133;&#26102;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18697v1 Announce Type: cross  Abstract: A common network inference problem, arising from real-world data constraints, is how to infer a dynamic network from its time-aggregated adjacency matrix and time-varying marginals (i.e., row and column sums). Prior approaches to this problem have repurposed the classic iterative proportional fitting (IPF) procedure, also known as Sinkhorn's algorithm, with promising empirical results. However, the statistical foundation for using IPF has not been well understood: under what settings does IPF provide principled estimation of a dynamic network from its marginals, and how well does it estimate the network? In this work, we establish such a setting, by identifying a generative network model whose maximum likelihood estimates are recovered by IPF. Our model both reveals implicit assumptions on the use of IPF in such settings and enables new analyses, such as structure-dependent error bounds on IPF's parameter estimates. When IPF fails to c
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#21019;&#24314;&#26032;&#30340;&#25968;&#25454;&#38598;&#12289;&#35780;&#20272;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;Transformer&#27169;&#22411;&#20197;&#21450;&#25552;&#20986;&#22810;&#38454;&#27573;&#26694;&#26550;&#26469;&#35299;&#20915;&#20102;&#36328;&#35821;&#35328;&#28548;&#28165;&#26816;&#32034;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.05680</link><description>&lt;p&gt;
&#36890;&#36807;&#22810;&#38454;&#27573;&#26816;&#32034;&#25214;&#21040;&#24050;&#32463;&#34987;&#28548;&#28165;&#30340;&#21465;&#36848;&#65306;&#23454;&#29616;&#36328;&#35821;&#35328;&#12289;&#36328;&#25968;&#25454;&#38598;&#21644;&#38646;&#26679;&#26412;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Finding Already Debunked Narratives via Multistage Retrieval: Enabling Cross-Lingual, Cross-Dataset and Zero-Shot Learning. (arXiv:2308.05680v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.05680
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#21019;&#24314;&#26032;&#30340;&#25968;&#25454;&#38598;&#12289;&#35780;&#20272;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;Transformer&#27169;&#22411;&#20197;&#21450;&#25552;&#20986;&#22810;&#38454;&#27573;&#26694;&#26550;&#26469;&#35299;&#20915;&#20102;&#36328;&#35821;&#35328;&#28548;&#28165;&#26816;&#32034;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26816;&#32034;&#24050;&#32463;&#34987;&#28548;&#28165;&#30340;&#21465;&#36848;&#30340;&#20219;&#21153;&#26088;&#22312;&#26816;&#27979;&#24050;&#32463;&#32463;&#36807;&#20107;&#23454;&#26680;&#26597;&#30340;&#25925;&#20107;&#12290;&#25104;&#21151;&#26816;&#27979;&#21040;&#24050;&#34987;&#28548;&#28165;&#30340;&#22768;&#26126;&#19981;&#20165;&#20943;&#23569;&#20102;&#19987;&#19994;&#20107;&#23454;&#26680;&#26597;&#20154;&#21592;&#30340;&#25163;&#21160;&#21162;&#21147;&#65292;&#36824;&#21487;&#20197;&#26377;&#21161;&#20110;&#20943;&#32531;&#34394;&#20551;&#20449;&#24687;&#30340;&#20256;&#25773;&#12290;&#30001;&#20110;&#32570;&#20047;&#21487;&#29992;&#25968;&#25454;&#65292;&#36825;&#26159;&#19968;&#20010;&#30740;&#31350;&#19981;&#36275;&#30340;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22312;&#32771;&#34385;&#36328;&#35821;&#35328;&#20219;&#21153;&#26102;&#65292;&#21363;&#22312;&#26816;&#26597;&#30340;&#22312;&#32447;&#24086;&#23376;&#30340;&#35821;&#35328;&#19982;&#20107;&#23454;&#26680;&#26597;&#25991;&#31456;&#30340;&#35821;&#35328;&#19981;&#21516;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#26816;&#32034;&#12290;&#26412;&#25991;&#36890;&#36807;&#20197;&#19979;&#26041;&#24335;&#22635;&#34917;&#20102;&#36825;&#19968;&#31354;&#30333;&#65306;&#65288;i&#65289;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#25968;&#25454;&#38598;&#65292;&#20197;&#20801;&#35768;&#23545;&#24050;&#34987;&#28548;&#28165;&#30340;&#21465;&#36848;&#36827;&#34892;&#36328;&#35821;&#35328;&#26816;&#32034;&#30340;&#30740;&#31350;&#65292;&#20351;&#29992;&#25512;&#25991;&#20316;&#20026;&#23545;&#20107;&#23454;&#26680;&#26597;&#25991;&#31456;&#25968;&#25454;&#24211;&#30340;&#26597;&#35810;&#65307;&#65288;ii&#65289;&#23637;&#31034;&#20102;&#19968;&#20010;&#20840;&#38754;&#30340;&#23454;&#39564;&#65292;&#20197;&#35780;&#20272;&#32463;&#36807;&#24494;&#35843;&#21644;&#29616;&#25104;&#30340;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;Transformer&#27169;&#22411;&#22312;&#36825;&#20010;&#20219;&#21153;&#19978;&#30340;&#24615;&#33021;&#65307;&#65288;iii&#65289;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#22810;&#38454;&#27573;&#26694;&#26550;&#65292;&#23558;&#36825;&#20010;&#36328;&#35821;&#35328;&#28548;&#28165;&#26816;&#32034;&#38382;&#39064;&#21010;&#20998;&#20026;&#19981;&#21516;&#30340;&#38454;&#27573;&#12290;
&lt;/p&gt;
&lt;p&gt;
The task of retrieving already debunked narratives aims to detect stories that have already been fact-checked. The successful detection of claims that have already been debunked not only reduces the manual efforts of professional fact-checkers but can also contribute to slowing the spread of misinformation. Mainly due to the lack of readily available data, this is an understudied problem, particularly when considering the cross-lingual task, i.e. the retrieval of fact-checking articles in a language different from the language of the online post being checked. This paper fills this gap by (i) creating a novel dataset to enable research on cross-lingual retrieval of already debunked narratives, using tweets as queries to a database of fact-checking articles; (ii) presenting an extensive experiment to benchmark fine-tuned and off-the-shelf multilingual pre-trained Transformer models for this task; and (iii) proposing a novel multistage framework that divides this cross-lingual debunk ret
&lt;/p&gt;</description></item></channel></rss>