<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20272;&#35745;&#38543;&#26426;&#36882;&#24402;&#26641;&#20013;&#39030;&#28857;&#21040;&#36798;&#39034;&#24207;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;Jordan&#20013;&#24515;&#24615;&#24230;&#37327;&#30340;&#39034;&#24207;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20854;&#20960;&#20046;&#26159;&#26368;&#20248;&#30340;&#12290;</title><link>https://arxiv.org/abs/2403.09755</link><description>&lt;p&gt;
&#20272;&#35745;&#38543;&#26426;&#36882;&#24402;&#26641;&#30340;&#21382;&#21490;
&lt;/p&gt;
&lt;p&gt;
Estimating the history of a random recursive tree
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09755
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20272;&#35745;&#38543;&#26426;&#36882;&#24402;&#26641;&#20013;&#39030;&#28857;&#21040;&#36798;&#39034;&#24207;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;Jordan&#20013;&#24515;&#24615;&#24230;&#37327;&#30340;&#39034;&#24207;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20854;&#20960;&#20046;&#26159;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20272;&#35745;&#38543;&#26426;&#36882;&#24402;&#26641;&#20013;&#39030;&#28857;&#21040;&#36798;&#39034;&#24207;&#30340;&#38382;&#39064;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#20010;&#22522;&#26412;&#27169;&#22411;&#65306;&#22343;&#21248;&#36830;&#25509;&#27169;&#22411;&#21644;&#32447;&#24615;&#20248;&#20808;&#36830;&#25509;&#27169;&#22411;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Jordan&#20013;&#24515;&#24615;&#24230;&#37327;&#30340;&#39034;&#24207;&#20272;&#35745;&#22120;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#26063;&#39118;&#38505;&#24230;&#37327;&#26469;&#37327;&#21270;&#25490;&#24207;&#36807;&#31243;&#30340;&#36136;&#37327;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20026;&#36825;&#20010;&#38382;&#39064;&#24314;&#31435;&#20102;&#26497;&#23567;-&#26368;&#22823;&#19979;&#30028;&#65292;&#24182;&#35777;&#26126;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#20960;&#20046;&#26159;&#26368;&#20248;&#30340;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#20248;&#20110;&#22522;&#20110;&#24230;&#25968;&#21644;&#35889;&#25490;&#24207;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09755v1 Announce Type: cross  Abstract: This paper studies the problem of estimating the order of arrival of the vertices in a random recursive tree. Specifically, we study two fundamental models: the uniform attachment model and the linear preferential attachment model. We propose an order estimator based on the Jordan centrality measure and define a family of risk measures to quantify the quality of the ordering procedure. Moreover, we establish a minimax lower bound for this problem, and prove that the proposed estimator is nearly optimal. Finally, we numerically demonstrate that the proposed estimator outperforms degree-based and spectral ordering procedures.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#25991;&#26412;&#25366;&#25496;&#21644;&#32593;&#32476;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#37096;&#38376;&#20043;&#38388;&#30340;&#25216;&#26415;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#25216;&#26415;&#21019;&#26032;&#20013;&#65292;&#38388;&#25509;&#32852;&#31995;&#21644;&#30452;&#25509;&#32852;&#31995;&#21516;&#31561;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2308.00014</link><description>&lt;p&gt;
&#19968;&#31181;&#26032;&#30340;&#25216;&#26415;&#30456;&#20114;&#20381;&#36182;&#30340;&#26144;&#23556;
&lt;/p&gt;
&lt;p&gt;
A new mapping of technological interdependence. (arXiv:2308.00014v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00014
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#25991;&#26412;&#25366;&#25496;&#21644;&#32593;&#32476;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#37096;&#38376;&#20043;&#38388;&#30340;&#25216;&#26415;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#25216;&#26415;&#21019;&#26032;&#20013;&#65292;&#38388;&#25509;&#32852;&#31995;&#21644;&#30452;&#25509;&#32852;&#31995;&#21516;&#31561;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21738;&#20123;&#25216;&#26415;&#32852;&#31995;&#24433;&#21709;&#20102;&#37096;&#38376;&#30340;&#21019;&#26032;&#33021;&#21147;&#65311;&#36825;&#20123;&#25928;&#24212;&#22914;&#20309;&#36890;&#36807;&#25216;&#26415;&#31354;&#38388;&#20256;&#36882;&#65311;&#26412;&#25991;&#20351;&#29992;&#26032;&#39062;&#30340;&#25991;&#26412;&#25366;&#25496;&#21644;&#32593;&#32476;&#20998;&#26512;&#26041;&#27861;&#22238;&#31572;&#20102;&#36825;&#20004;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#20998;&#26512;&#32654;&#22269;&#19987;&#21033;&#21830;&#26631;&#23616;&#65288;USPTO&#65289;&#25480;&#20104;&#30340;650&#19975;&#39033;&#19987;&#21033;&#30340;&#25991;&#26412;&#65292;&#24182;&#24212;&#29992;&#32593;&#32476;&#20998;&#26512;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#21322;&#20010;&#19990;&#32426;&#65288;&#20174;1976&#24180;&#21040;2021&#24180;&#65289;&#26399;&#38388;&#19981;&#21516;&#37096;&#38376;&#20043;&#38388;&#30340;&#25216;&#26415;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#25581;&#31034;&#20102;&#23384;&#22312;&#20110;&#25216;&#26415;&#39046;&#22495;&#20043;&#38388;&#30340;&#20840;&#35889;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#35777;&#26126;&#19987;&#21033;&#25991;&#26412;&#21253;&#21547;&#20102;&#24448;&#24448;&#26080;&#27861;&#36890;&#36807;&#20256;&#32479;&#30340;&#21019;&#26032;&#25351;&#26631;&#65288;&#20363;&#22914;&#19987;&#21033;&#24341;&#29992;&#65289;&#25429;&#25417;&#21040;&#30340;&#20016;&#23500;&#20449;&#24687;&#12290;&#36890;&#36807;&#20351;&#29992;&#32593;&#32476;&#20998;&#26512;&#65292;&#25105;&#20204;&#35760;&#24405;&#20102;&#38388;&#25509;&#32852;&#31995;&#21644;&#30452;&#25509;&#32852;&#31995;&#21516;&#31561;&#37325;&#35201;&#65292;&#24182;&#19988;&#21069;&#32773;&#22823;&#37096;&#20998;&#20351;&#29992;&#20256;&#32479;&#30340;&#38388;&#25509;&#32852;&#31995;&#24230;&#37327;&#26041;&#27861;&#65288;&#22914;Leontief&#36870;&#30697;&#38453;&#65289;&#24448;&#24448;&#20250;&#34987;&#38544;&#34255;&#12290;&#26368;&#21518;&#65292;&#22522;&#20110;&#20914;&#20987;&#21709;&#24212;&#20998;&#26512;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Which technological linkages affect the sector's ability to innovate? How do these effects transmit through the technology space? This paper answers these two key questions using novel methods of text mining and network analysis. We examine technological interdependence across sectors over a period of half a century (from 1976 to 2021) by analyzing the text of 6.5 million patents granted by the United States Patent and Trademark Office (USPTO), and applying network analysis to uncover the full spectrum of linkages existing across technology areas. We demonstrate that patent text contains a wealth of information often not captured by traditional innovation metrics, such as patent citations. By using network analysis, we document that indirect linkages are as important as direct connections and that the former would remain mostly hidden using more traditional measures of indirect linkages, such as the Leontief inverse matrix. Finally, based on an impulse-response analysis, we illustrate 
&lt;/p&gt;</description></item></channel></rss>