<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>RCAgent&#26159;&#19968;&#20010;&#24037;&#20855;&#22686;&#24378;&#30340;LLM&#33258;&#20027;&#20195;&#29702;&#26694;&#26550;&#65292;&#29992;&#20110;&#20113;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;&#65292;&#33021;&#22815;&#23454;&#29616;&#33258;&#30001;&#26684;&#24335;&#30340;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#38754;&#30340;&#20998;&#26512;&#65292;&#24182;&#22312;&#21508;&#20010;&#26041;&#38754;&#20248;&#20110;&#24403;&#21069;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.16340</link><description>&lt;p&gt;
RCAgent&#65306;&#22522;&#20110;&#33258;&#20027;&#20195;&#29702;&#21644;&#22686;&#24378;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20113;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
RCAgent: Cloud Root Cause Analysis by Autonomous Agents with Tool-Augmented Large Language Models. (arXiv:2310.16340v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16340
&lt;/p&gt;
&lt;p&gt;
RCAgent&#26159;&#19968;&#20010;&#24037;&#20855;&#22686;&#24378;&#30340;LLM&#33258;&#20027;&#20195;&#29702;&#26694;&#26550;&#65292;&#29992;&#20110;&#20113;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;&#65292;&#33021;&#22815;&#23454;&#29616;&#33258;&#30001;&#26684;&#24335;&#30340;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#38754;&#30340;&#20998;&#26512;&#65292;&#24182;&#22312;&#21508;&#20010;&#26041;&#38754;&#20248;&#20110;&#24403;&#21069;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#20113;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;&#20013;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#24212;&#29992;&#21463;&#21040;&#20102;&#31215;&#26497;&#30340;&#20851;&#27880;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#26041;&#27861;&#20173;&#28982;&#20381;&#36182;&#20110;&#25163;&#21160;&#24037;&#20316;&#27969;&#35774;&#32622;&#65292;&#24182;&#27809;&#26377;&#20805;&#20998;&#21457;&#25381;LLMs&#30340;&#20915;&#31574;&#21644;&#29615;&#22659;&#20132;&#20114;&#33021;&#21147;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;RCAgent&#65292;&#36825;&#26159;&#19968;&#20010;&#23454;&#29992;&#21644;&#27880;&#37325;&#38544;&#31169;&#30340;&#24037;&#20855;&#22686;&#24378;LLM&#33258;&#20027;&#20195;&#29702;&#26694;&#26550;&#65292;&#29992;&#20110;&#23454;&#38469;&#30340;&#24037;&#19994;RCA&#20351;&#29992;&#12290;RCAgent&#22312;&#20869;&#37096;&#37096;&#32626;&#30340;&#27169;&#22411;&#19978;&#36816;&#34892;&#65292;&#32780;&#19981;&#26159;GPT&#31995;&#21015;&#65292;&#33021;&#22815;&#36827;&#34892;&#33258;&#30001;&#26684;&#24335;&#30340;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#38754;&#30340;&#20998;&#26512;&#65292;&#24182;&#32467;&#21512;&#21508;&#31181;&#22686;&#24378;&#21151;&#33021;&#65292;&#21253;&#25324;&#29420;&#29305;&#30340;&#34892;&#21160;&#36712;&#36857;&#33258;&#19968;&#33268;&#24615;&#21644;&#19968;&#22871;&#29992;&#20110;&#19978;&#19979;&#25991;&#31649;&#29702;&#12289;&#31283;&#23450;&#21270;&#21644;&#23548;&#20837;&#39046;&#22495;&#30693;&#35782;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#35777;&#26126;RCAgent&#22312;RCA&#30340;&#21508;&#20010;&#26041;&#38754;&#65288;&#39044;&#27979;&#26681;&#26412;&#21407;&#22240;&#12289;&#35299;&#20915;&#26041;&#26696;&#12289;&#35777;&#25454;&#21644;&#36131;&#20219;&#65289;&#20197;&#21450;&#24403;&#21069;&#35268;&#21017;&#26410;&#28085;&#30422;&#30340;&#20219;&#21153;&#19978;&#37117;&#26126;&#26174;&#20248;&#20110;ReAct&#65292;&#24471;&#21040;&#20102;&#33258;&#21160;&#21270;&#21644;&#20154;&#24037;&#39564;&#35777;&#30340;&#30830;&#35748;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language model (LLM) applications in cloud root cause analysis (RCA) have been actively explored recently. However, current methods are still reliant on manual workflow settings and do not unleash LLMs' decision-making and environment interaction capabilities. We present RCAgent, a tool-augmented LLM autonomous agent framework for practical and privacy-aware industrial RCA usage. Running on an internally deployed model rather than GPT families, RCAgent is capable of free-form data collection and comprehensive analysis with tools. Our framework combines a variety of enhancements, including a unique Self-Consistency for action trajectories, and a suite of methods for context management, stabilization, and importing domain knowledge. Our experiments show RCAgent's evident and consistent superiority over ReAct across all aspects of RCA -- predicting root causes, solutions, evidence, and responsibilities -- and tasks covered or uncovered by current rules, as validated by both automate
&lt;/p&gt;</description></item></channel></rss>