<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#20855;&#26377;&#26234;&#33021;&#20648;&#33021;&#30340;&#24314;&#31569;&#20013;&#65292;&#31616;&#21333;&#30340;&#32447;&#24615;&#22810;&#23618;&#24863;&#30693;&#22120;&#27169;&#22411;&#25552;&#20379;&#20102;&#19982;&#26368;&#20808;&#36827;&#27169;&#22411;&#30456;&#24403;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#26356;&#20855;&#26377;&#25968;&#25454;&#25928;&#29575;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.12539</link><description>&lt;p&gt;
&#25968;&#25454;&#20351;&#29992;&#23545;&#20855;&#26377;&#26234;&#33021;&#20648;&#33021;&#30340;&#24314;&#31569;&#20013;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#24615;&#33021;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Impact of data usage for forecasting on performance of model predictive control in buildings with smart energy storage
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12539
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#20855;&#26377;&#26234;&#33021;&#20648;&#33021;&#30340;&#24314;&#31569;&#20013;&#65292;&#31616;&#21333;&#30340;&#32447;&#24615;&#22810;&#23618;&#24863;&#30693;&#22120;&#27169;&#22411;&#25552;&#20379;&#20102;&#19982;&#26368;&#20808;&#36827;&#27169;&#22411;&#30456;&#24403;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#26356;&#20855;&#26377;&#25968;&#25454;&#25928;&#29575;&#21644;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#26159;&#24320;&#21457;&#29992;&#20110;&#24314;&#31569;&#33021;&#28304;&#31995;&#32479;&#20013;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#65288;MPC&#65289;&#26041;&#26696;&#30340;&#39044;&#27979;&#27169;&#22411;&#25152;&#24517;&#38656;&#30340;&#12290;&#28982;&#32780;&#65292;&#25968;&#25454;&#20351;&#29992;&#20250;&#20135;&#29983;&#25910;&#38598;&#21644;&#21033;&#29992;&#26041;&#38754;&#30340;&#25104;&#26412;&#12290;&#30830;&#23450;&#25104;&#26412;&#26368;&#20248;&#25968;&#25454;&#20351;&#29992;&#38656;&#35201;&#20102;&#35299;&#20854;&#24102;&#26469;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#20197;&#21450;&#32467;&#26524; MPC &#36816;&#34892;&#24615;&#33021;&#30340;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#21382;&#21490;&#24314;&#31569;&#33021;&#28304;&#25968;&#25454;&#22312;&#19968;&#20010;&#22810;&#24314;&#31569;&#33021;&#28304;&#31995;&#32479;&#27169;&#25311;&#20013;&#65292;&#30740;&#31350;&#20102;&#31616;&#21333;&#21644;&#26368;&#20808;&#36827;&#30340;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#27169;&#22411;&#22312; MPC &#20013;&#30340;&#24615;&#33021;&#12290;&#23545;&#20110;&#20197;&#19979;&#25968;&#25454;&#25928;&#29575;&#25514;&#26045;&#65292;&#21363;&#37325;&#26032;&#20351;&#29992;&#39044;&#27979;&#27169;&#22411;&#12289;&#20943;&#23569;&#35757;&#32451;&#25968;&#25454;&#37327;&#12289;&#20943;&#23569;&#27169;&#22411;&#25968;&#25454;&#29305;&#24449;&#21644;&#22312;&#32447;&#27169;&#22411;&#35757;&#32451;&#65292;&#37327;&#21270;&#20102;&#25968;&#25454;&#20351;&#29992;&#23545;&#39044;&#27979;&#20934;&#30830;&#24615;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#31616;&#21333;&#30340;&#32447;&#24615;&#22810;&#23618;&#24863;&#30693;&#22120;&#27169;&#22411;&#25552;&#20379;&#20102;&#19982;&#26368;&#20808;&#36827;&#27169;&#22411;&#30456;&#24403;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#19988;&#20855;&#26377;&#26356;&#39640;&#30340;&#25968;&#25454;&#25928;&#29575;&#21644;&#26222;&#36866;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12539v1 Announce Type: cross  Abstract: Data is required to develop forecasting models for use in Model Predictive Control (MPC) schemes in building energy systems. However, data usage incurs costs from both its collection and exploitation. Determining cost optimal data usage requires understanding of the forecast accuracy and resulting MPC operational performance it enables. This study investigates the performance of both simple and state-of-the-art machine learning prediction models for MPC in a multi-building energy system simulation using historic building energy data. The impact of data usage on forecast accuracy is quantified for the following data efficiency measures: reuse of prediction models, reduction of training data volumes, reduction of model data features, and online model training. A simple linear multi-layer perceptron model is shown to provide equivalent forecast accuracy to state-of-the-art models, with greater data efficiency and generalisability. The use
&lt;/p&gt;</description></item></channel></rss>