<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#21024;&#38500;&#25237;&#31080;&#22270;&#20013;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#24471;&#20986;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#30340;&#21807;&#19968;&#25490;&#24207;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.15702</link><description>&lt;p&gt;
&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#65306;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Strong Maximum Circulation Algorithm: A New Method for Aggregating Preference Rankings. (arXiv:2307.15702v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15702
&lt;/p&gt;
&lt;p&gt;
&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#21024;&#38500;&#25237;&#31080;&#22270;&#20013;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#24471;&#20986;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#30340;&#21807;&#19968;&#25490;&#24207;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#27599;&#20010;&#20915;&#31574;&#32773;&#25110;&#36873;&#27665;&#23545;&#19968;&#23545;&#36873;&#25321;&#36827;&#34892;&#20559;&#22909;&#34920;&#36798;&#30340;&#24773;&#20917;&#19979;&#38598;&#25104;&#20559;&#22909;&#12290;&#25361;&#25112;&#22312;&#20110;&#22312;&#19968;&#20123;&#20914;&#31361;&#30340;&#25237;&#31080;&#24773;&#20917;&#19979;&#65292;&#23613;&#21487;&#33021;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#22320;&#24471;&#20986;&#19968;&#20010;&#25490;&#24207;&#12290;&#21482;&#26377;&#19981;&#21253;&#21547;&#29615;&#36335;&#30340;&#25237;&#31080;&#38598;&#21512;&#25165;&#26159;&#38750;&#20914;&#31361;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#22312;&#36873;&#25321;&#20043;&#38388;&#24341;&#21457;&#19968;&#20010;&#37096;&#20998;&#39034;&#24207;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#22522;&#20110;&#36825;&#26679;&#19968;&#20010;&#35266;&#23519;&#65306;&#26500;&#25104;&#19968;&#20010;&#29615;&#36335;&#30340;&#25237;&#31080;&#38598;&#21512;&#21487;&#20197;&#34987;&#35270;&#20026;&#24179;&#23616;&#12290;&#28982;&#21518;&#65292;&#26041;&#27861;&#26159;&#20174;&#25237;&#31080;&#22270;&#20013;&#21024;&#38500;&#29615;&#36335;&#30340;&#24182;&#38598;&#65292;&#24182;&#26681;&#25454;&#21097;&#20313;&#37096;&#20998;&#30830;&#23450;&#38598;&#25104;&#20559;&#22909;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#23427;&#30001;&#19968;&#32452;&#29615;&#36335;&#30340;&#24182;&#38598;&#24418;&#25104;&#65292;&#21024;&#38500;&#23427;&#21487;&#20197;&#20445;&#35777;&#22312;&#24341;&#21457;&#30340;&#37096;&#20998;&#39034;&#24207;&#20013;&#33719;&#24471;&#21807;&#19968;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#21253;&#21547;&#22312;&#28040;&#38500;&#20219;&#20309;&#26368;&#22823;&#29615;&#36335;&#21518;&#21097;&#19979;&#30340;&#25152;&#26377;&#38598;&#25104;&#20559;&#22909;&#12290;&#19982;&#20043;&#30456;&#21453;&#30340;&#26159;&#65292;wel
&lt;/p&gt;
&lt;p&gt;
We present a new optimization-based method for aggregating preferences in settings where each decision maker, or voter, expresses preferences over pairs of alternatives. The challenge is to come up with a ranking that agrees as much as possible with the votes cast in cases when some of the votes conflict. Only a collection of votes that contains no cycles is non-conflicting and can induce a partial order over alternatives. Our approach is motivated by the observation that a collection of votes that form a cycle can be treated as ties. The method is then to remove unions of cycles of votes, or circulations, from the vote graph and determine aggregate preferences from the remainder.  We introduce the strong maximum circulation which is formed by a union of cycles, the removal of which guarantees a unique outcome in terms of the induced partial order. Furthermore, it contains all the aggregate preferences remaining following the elimination of any maximum circulation. In contrast, the wel
&lt;/p&gt;</description></item></channel></rss>