<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#23884;&#22871;&#38543;&#26426;&#22359;&#27169;&#22411;&#65288;NSBM&#65289;&#33021;&#22815;&#21516;&#26102;&#23545;&#32593;&#32476;&#21644;&#33410;&#28857;&#36827;&#34892;&#32858;&#31867;&#65292;&#20855;&#26377;&#22788;&#29702;&#26080;&#26631;&#31614;&#32593;&#32476;&#12289;&#24314;&#27169;&#24322;&#36136;&#31038;&#32676;&#20197;&#21450;&#33258;&#21160;&#36873;&#25321;&#32858;&#31867;&#25968;&#37327;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2307.09210</link><description>&lt;p&gt;
&#23884;&#22871;&#38543;&#26426;&#22359;&#27169;&#22411;&#29992;&#20110;&#21516;&#26102;&#23545;&#32593;&#32476;&#21644;&#33410;&#28857;&#36827;&#34892;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
Nested stochastic block model for simultaneously clustering networks and nodes. (arXiv:2307.09210v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09210
&lt;/p&gt;
&lt;p&gt;
&#23884;&#22871;&#38543;&#26426;&#22359;&#27169;&#22411;&#65288;NSBM&#65289;&#33021;&#22815;&#21516;&#26102;&#23545;&#32593;&#32476;&#21644;&#33410;&#28857;&#36827;&#34892;&#32858;&#31867;&#65292;&#20855;&#26377;&#22788;&#29702;&#26080;&#26631;&#31614;&#32593;&#32476;&#12289;&#24314;&#27169;&#24322;&#36136;&#31038;&#32676;&#20197;&#21450;&#33258;&#21160;&#36873;&#25321;&#32858;&#31867;&#25968;&#37327;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#23884;&#22871;&#38543;&#26426;&#22359;&#27169;&#22411;&#65288;NSBM&#65289;&#65292;&#29992;&#20110;&#23545;&#19968;&#32452;&#32593;&#32476;&#36827;&#34892;&#32858;&#31867;&#65292;&#21516;&#26102;&#26816;&#27979;&#27599;&#20010;&#32593;&#32476;&#20013;&#30340;&#31038;&#32676;&#12290;NSBM&#20855;&#26377;&#20960;&#20010;&#21560;&#24341;&#20154;&#30340;&#29305;&#28857;&#65292;&#21253;&#25324;&#33021;&#22815;&#22788;&#29702;&#20855;&#26377;&#28508;&#22312;&#19981;&#21516;&#33410;&#28857;&#38598;&#30340;&#26080;&#26631;&#31614;&#32593;&#32476;&#65292;&#28789;&#27963;&#22320;&#24314;&#27169;&#24322;&#36136;&#31038;&#32676;&#65292;&#20197;&#21450;&#33258;&#21160;&#36873;&#25321;&#32593;&#32476;&#31867;&#21035;&#21644;&#27599;&#20010;&#32593;&#32476;&#20869;&#31038;&#32676;&#25968;&#37327;&#30340;&#33021;&#21147;&#12290;&#36890;&#36807;&#36125;&#21494;&#26031;&#27169;&#22411;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#24182;&#23558;&#23884;&#22871;&#29380;&#21033;&#20811;&#38647;&#36807;&#31243;&#65288;NDP&#65289;&#20316;&#20026;&#20808;&#39564;&#65292;&#20197;&#32852;&#21512;&#24314;&#27169;&#32593;&#32476;&#38388;&#21644;&#32593;&#32476;&#20869;&#30340;&#32858;&#31867;&#12290;&#32593;&#32476;&#25968;&#25454;&#24341;&#20837;&#30340;&#20381;&#36182;&#24615;&#32473;NDP&#24102;&#26469;&#20102;&#38750;&#24179;&#20961;&#30340;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#22312;&#24320;&#21457;&#39640;&#25928;&#30340;&#37319;&#26679;&#22120;&#26041;&#38754;&#12290;&#23545;&#20110;&#21518;&#39564;&#25512;&#26029;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20960;&#31181;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#21253;&#25324;&#26631;&#20934;&#30340;Gibbs&#37319;&#26679;&#22120;&#65292;&#31616;&#21270;Gibbs&#37319;&#26679;&#22120;&#21644;&#20004;&#31181;&#29992;&#20110;&#36820;&#22238;&#20004;&#20010;&#32423;&#21035;&#32858;&#31867;&#32467;&#26524;&#30340;&#38459;&#22622;Gibbs&#37319;&#26679;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the nested stochastic block model (NSBM) to cluster a collection of networks while simultaneously detecting communities within each network. NSBM has several appealing features including the ability to work on unlabeled networks with potentially different node sets, the flexibility to model heterogeneous communities, and the means to automatically select the number of classes for the networks and the number of communities within each network. This is accomplished via a Bayesian model, with a novel application of the nested Dirichlet process (NDP) as a prior to jointly model the between-network and within-network clusters. The dependency introduced by the network data creates nontrivial challenges for the NDP, especially in the development of efficient samplers. For posterior inference, we propose several Markov chain Monte Carlo algorithms including a standard Gibbs sampler, a collapsed Gibbs sampler, and two blocked Gibbs samplers that ultimately return two levels of clus
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#27979;&#37327;&#26694;&#26550;&#65292;&#21457;&#29616;&#36328;&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#65292;&#20294;&#30456;&#36739;&#20110;&#23398;&#31185;&#22522;&#37329;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#25903;&#25345;&#35770;&#25991;&#26356;&#23569;&#19988;&#24433;&#21709;&#21147;&#19979;&#38477;&#12290;</title><link>http://arxiv.org/abs/2303.14732</link><description>&lt;p&gt;
&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#20855;&#26377;&#28145;&#36828;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;
&lt;/p&gt;
&lt;p&gt;
Interdisciplinary Papers Supported by Disciplinary Grants Garner Deep and Broad Scientific Impact. (arXiv:2303.14732v1 [cs.DL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14732
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#27979;&#37327;&#26694;&#26550;&#65292;&#21457;&#29616;&#36328;&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#65292;&#20294;&#30456;&#36739;&#20110;&#23398;&#31185;&#22522;&#37329;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#25903;&#25345;&#35770;&#25991;&#26356;&#23569;&#19988;&#24433;&#21709;&#21147;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#23398;&#31185;&#30740;&#31350;&#24050;&#25104;&#20026;&#21019;&#26032;&#21644;&#21457;&#29616;&#30340;&#28201;&#24202;&#12290;&#22522;&#37329;&#25903;&#25345;&#30340;&#30740;&#31350;&#36234;&#26469;&#36234;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#19982;&#27492;&#21516;&#26102;&#65292;&#23545;&#36164;&#21161;&#36328;&#23398;&#31185;&#24037;&#20316;&#30340;&#20852;&#36259;&#26085;&#30410;&#22686;&#38271;&#65292;&#36825;&#24341;&#21457;&#20102;&#20851;&#20110;&#36328;&#23398;&#31185;&#25320;&#27454;&#22312;&#25903;&#25345;&#39640;&#24433;&#21709;&#36328;&#23398;&#31185;&#36827;&#23637;&#20013;&#30340;&#20316;&#29992;&#30340;&#26681;&#26412;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#27979;&#37327;&#26694;&#26550;&#65292;&#26469;&#37327;&#21270;&#30740;&#31350;&#22522;&#37329;&#21644;&#20986;&#29256;&#29289;&#30340;&#36328;&#23398;&#31185;&#24615;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#26469;&#33258;164&#20010;&#36164;&#21161;&#26426;&#26500;&#12289;26&#20010;&#22269;&#23478;&#30340;35&#19975;&#20010;&#25320;&#27454;&#21644;&#20174;1985&#24180;&#21040;2009&#24180;&#25215;&#35748;&#36825;&#20123;&#25320;&#27454;&#25903;&#25345;&#30340;130&#19975;&#31687;&#35770;&#25991;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20004;&#31181;&#30683;&#30462;&#30340;&#27169;&#24335;&#12290;&#19968;&#26041;&#38754;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#24448;&#24448;&#20250;&#20135;&#29983;&#36328;&#23398;&#31185;&#35770;&#25991;&#65292;&#32780;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#19982;&#23398;&#31185;&#22522;&#37329;&#30456;&#27604;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#35770;&#25991;&#26356;&#23569;&#65292;&#32780;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#24433;&#21709;&#21147;&#20063;&#22823;&#22823;&#19979;&#38477;&#12290;&#25105;&#20204;&#34920;&#26126;
&lt;/p&gt;
&lt;p&gt;
Interdisciplinary research has emerged as a hotbed for innovation and discoveries. The increasing dominance of grant-supported research, combined with growing interest in funding interdisciplinary work, raises fundamental questions on the role of interdisciplinary grants in supporting high-impact interdisciplinary advances. Here we develop a measurement framework to quantify the interdisciplinarity of both research grants and publications and apply it to 350K grants from 164 funding agencies over 26 countries and 1.3M papers that acknowledged the support of these grants from 1985 to 2009. Our analysis uncovers two contradictory patterns. On the one hand, interdisciplinary grants tend to produce interdisciplinary papers and interdisciplinary papers are associated with high impact. On the other hand, compared to their disciplinary counterparts, interdisciplinary grants produce much fewer papers and interdisciplinary papers that they support have substantially reduced impact. We show that
&lt;/p&gt;</description></item></channel></rss>