<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#20113;&#31995;&#32479;&#20013;&#30340;&#24615;&#33021;&#38382;&#39064;&#35782;&#21035;&#23384;&#22312;&#25361;&#25112;&#65292;&#29616;&#26377;&#26041;&#27861;&#20013;&#30340;&#29420;&#31435;&#20998;&#26512;&#27599;&#20010;&#25351;&#26631;&#30340;&#24322;&#24120;&#26080;&#27861;&#35299;&#20915;&#38382;&#39064;&#65292;&#38656;&#35201;&#32771;&#34385;&#25351;&#26631;&#20043;&#38388;&#30340;&#20851;&#32852;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.10869</link><description>&lt;p&gt;
&#20113;&#31995;&#32479;&#20013;&#30340;&#24615;&#33021;&#38382;&#39064;&#35782;&#21035;&#19982;&#20851;&#31995;-&#26102;&#38388;&#24322;&#24120;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Performance Issue Identification in Cloud Systems with Relational-Temporal Anomaly Detection. (arXiv:2307.10869v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10869
&lt;/p&gt;
&lt;p&gt;
&#20113;&#31995;&#32479;&#20013;&#30340;&#24615;&#33021;&#38382;&#39064;&#35782;&#21035;&#23384;&#22312;&#25361;&#25112;&#65292;&#29616;&#26377;&#26041;&#27861;&#20013;&#30340;&#29420;&#31435;&#20998;&#26512;&#27599;&#20010;&#25351;&#26631;&#30340;&#24322;&#24120;&#26080;&#27861;&#35299;&#20915;&#38382;&#39064;&#65292;&#38656;&#35201;&#32771;&#34385;&#25351;&#26631;&#20043;&#38388;&#30340;&#20851;&#32852;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24615;&#33021;&#38382;&#39064;&#22312;&#22823;&#35268;&#27169;&#20113;&#26381;&#21153;&#31995;&#32479;&#20013;&#26222;&#36941;&#23384;&#22312;&#65292;&#21487;&#33021;&#23548;&#33268;&#24040;&#39069;&#25910;&#20837;&#25439;&#22833;&#12290;&#20026;&#20102;&#30830;&#20445;&#21487;&#38752;&#30340;&#24615;&#33021;&#65292;&#20351;&#29992;&#26381;&#21153;&#30417;&#25511;&#25351;&#26631;&#20934;&#30830;&#22320;&#35782;&#21035;&#21644;&#23450;&#20301;&#36825;&#20123;&#38382;&#39064;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#37492;&#20110;&#29616;&#20195;&#20113;&#31995;&#32479;&#30340;&#22797;&#26434;&#24615;&#21644;&#35268;&#27169;&#65292;&#36825;&#39033;&#20219;&#21153;&#21487;&#33021;&#20250;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#24182;&#19988;&#21487;&#33021;&#38656;&#35201;&#36229;&#20986;&#20010;&#20154;&#33021;&#21147;&#30340;&#24191;&#27867;&#19987;&#19994;&#30693;&#35782;&#21644;&#36164;&#28304;&#12290;&#19968;&#20123;&#29616;&#26377;&#30340;&#26041;&#27861;&#36890;&#36807;&#20998;&#26512;&#27599;&#20010;&#25351;&#26631;&#29420;&#31435;&#22320;&#26816;&#27979;&#24322;&#24120;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#36825;&#21487;&#33021;&#20250;&#23548;&#33268;&#38590;&#20197;&#30001;&#24037;&#31243;&#24072;&#25163;&#21160;&#35786;&#26029;&#30340;&#21387;&#20498;&#24615;&#35686;&#25253;&#39118;&#26292;&#12290;&#20026;&#20102;&#36861;&#27714;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#19981;&#20165;&#24212;&#32771;&#34385;&#25351;&#26631;&#30340;&#26102;&#38388;&#27169;&#24335;&#65292;&#36824;&#24212;&#32771;&#34385;&#25351;&#26631;&#20043;&#38388;&#30340;&#20851;&#32852;&#24615;&#27169;&#24335;&#65292;&#36825;&#21487;&#20197;&#34987;&#24418;&#24335;&#21270;&#20026;&#22810;&#21464;&#37327;&#25351;&#26631;&#24322;&#24120;&#26816;&#27979;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#30740;&#31350;&#22312;&#26126;&#30830;&#25552;&#21462;&#36825;&#20004;&#31181;&#31867;&#22411;&#30340;&#29305;&#24449;&#26041;&#38754;&#23384;&#22312;&#19981;&#36275;&#12290;&#27492;&#22806;&#65292;&#23384;&#22312;&#19968;&#20123;&#26410;&#26631;&#35760;&#30340;&#24322;&#24120;&#12290;
&lt;/p&gt;
&lt;p&gt;
Performance issues permeate large-scale cloud service systems, which can lead to huge revenue losses. To ensure reliable performance, it's essential to accurately identify and localize these issues using service monitoring metrics. Given the complexity and scale of modern cloud systems, this task can be challenging and may require extensive expertise and resources beyond the capacity of individual humans. Some existing methods tackle this problem by analyzing each metric independently to detect anomalies. However, this could incur overwhelming alert storms that are difficult for engineers to diagnose manually. To pursue better performance, not only the temporal patterns of metrics but also the correlation between metrics (i.e., relational patterns) should be considered, which can be formulated as a multivariate metrics anomaly detection problem. However, most of the studies fall short of extracting these two types of features explicitly. Moreover, there exist some unlabeled anomalies m
&lt;/p&gt;</description></item></channel></rss>