<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#35206;&#30422;143&#31181;&#35821;&#35328;&#12289;&#29992;&#20110;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#24615;&#33021;&#22522;&#20934;&#30340;&#22810;&#35821;&#31181;&#35821;&#38899;&#22522;&#20934; ML-SUPERB&#65292;&#24182;&#21457;&#29616;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#24615;&#33021;&#19988;&#22810;&#35821;&#31181;&#27169;&#22411;&#19981;&#24635;&#26159;&#27604;&#21333;&#35821;&#35328;&#27169;&#22411;&#34920;&#29616;&#26356;&#22909;&#12290;</title><link>http://arxiv.org/abs/2305.10615</link><description>&lt;p&gt;
ML-SUPERB: &#22810;&#35821;&#31181;&#35821;&#38899;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#24615;&#33021;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
ML-SUPERB: Multilingual Speech Universal PERformance Benchmark. (arXiv:2305.10615v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#35206;&#30422;143&#31181;&#35821;&#35328;&#12289;&#29992;&#20110;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#24615;&#33021;&#22522;&#20934;&#30340;&#22810;&#35821;&#31181;&#35821;&#38899;&#22522;&#20934; ML-SUPERB&#65292;&#24182;&#21457;&#29616;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#24615;&#33021;&#19988;&#22810;&#35821;&#31181;&#27169;&#22411;&#19981;&#24635;&#26159;&#27604;&#21333;&#35821;&#35328;&#27169;&#22411;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#38899;&#22788;&#29702;Universal PERformance Benchmark (SUPERB)&#26159;&#19968;&#20010;&#29992;&#20110;&#21508;&#31181;&#35821;&#38899;&#22788;&#29702;&#20219;&#21153;&#30340;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#24615;&#33021;&#22522;&#20934;&#30340;&#25490;&#34892;&#27036;&#12290;&#28982;&#32780;&#65292;SUPERB&#22312;&#35780;&#20272;&#20013;&#20027;&#35201;&#32771;&#34385;&#33521;&#35821;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#22810;&#35821;&#31181;SUPERB (ML-SUPERB)&#65292;&#35206;&#30422;&#20102;143&#31181;&#35821;&#35328;&#65288;&#20174;&#39640;&#36164;&#28304;&#21040;&#28626;&#21361;&#35821;&#35328;&#65289;&#65292;&#32771;&#34385;&#20102;&#33258;&#21160;&#35821;&#38899;&#35782;&#21035;&#21644;&#35821;&#35328;&#35782;&#21035;&#12290;&#19982;SUPERB&#27010;&#24565;&#31867;&#20284;&#65292;ML-SUPERB&#21033;&#29992;&#20923;&#32467;&#30340;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#29305;&#24449;&#65292;&#24182;&#36890;&#36807;&#23398;&#20064;&#27973;&#23618;&#19979;&#28216;&#27169;&#22411;&#30340;&#31616;&#21333;&#26694;&#26550;&#65292;&#29992;&#20110;&#22810;&#35821;&#31181;&#20219;&#21153;&#12290;&#19982;SUPERB&#22522;&#20934;&#31867;&#20284;&#65292;&#25105;&#20204;&#21457;&#29616;&#35821;&#38899;&#33258;&#25105;&#30417;&#30563;&#23398;&#20064;&#27169;&#22411;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#24615;&#33021;&#65292;&#19982;FBANK&#29305;&#24449;&#30456;&#27604;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21457;&#29616;&#22810;&#35821;&#31181;&#27169;&#22411;&#24182;&#19981;&#24635;&#26159;&#27604;&#21333;&#35821;&#35328;&#27169;&#22411;&#34920;&#29616;&#26356;&#22909;&#12290;&#25105;&#20204;&#23558;&#21457;&#24067;ML-SUPERB&#20316;&#20026;&#19968;&#20010;&#25361;&#25112;&#65292;&#25552;&#20379;&#32452;&#32455;&#22909;&#30340;&#25968;&#25454;&#38598;&#21644;&#21487;&#37325;&#29616;&#30340;&#35757;&#32451;&#33050;&#26412;&#65292;&#29992;&#20110;&#26410;&#26469;&#30340;&#22810;&#35821;&#31181;&#34920;&#31034;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Speech processing Universal PERformance Benchmark (SUPERB) is a leaderboard to benchmark the performance of Self-Supervised Learning (SSL) models on various speech processing tasks. However, SUPERB largely considers English speech in its evaluation. This paper presents multilingual SUPERB (ML-SUPERB), covering 143 languages (ranging from high-resource to endangered), and considering both automatic speech recognition and language identification. Following the concept of SUPERB, ML-SUPERB utilizes frozen SSL features and employs a simple framework for multilingual tasks by learning a shallow downstream model. Similar to the SUPERB benchmark, we find speech SSL models can significantly improve performance compared to FBANK features. Furthermore, we find that multilingual models do not always perform better than their monolingual counterparts. We will release ML-SUPERB as a challenge with organized datasets and reproducible training scripts for future multilingual representation research.
&lt;/p&gt;</description></item></channel></rss>