<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>SongComposer&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#27468;&#26354;&#29983;&#25104;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#37319;&#29992;&#31526;&#21495;&#21270;&#30340;&#27468;&#26354;&#34920;&#31034;&#65292;&#23454;&#29616;&#20102;LLM&#21487;&#20197;&#26126;&#30830;&#21019;&#20316;&#27468;&#26354;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.17645</link><description>&lt;p&gt;
SongComposer&#65306;&#19968;&#31181;&#29992;&#20110;&#27468;&#26354;&#29983;&#25104;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#29992;&#20110;&#27468;&#35789;&#21644;&#26059;&#24459;&#21019;&#20316;
&lt;/p&gt;
&lt;p&gt;
SongComposer: A Large Language Model for Lyric and Melody Composition in Song Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17645
&lt;/p&gt;
&lt;p&gt;
SongComposer&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#27468;&#26354;&#29983;&#25104;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#37319;&#29992;&#31526;&#21495;&#21270;&#30340;&#27468;&#26354;&#34920;&#31034;&#65292;&#23454;&#29616;&#20102;LLM&#21487;&#20197;&#26126;&#30830;&#21019;&#20316;&#27468;&#26354;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;SongComposer&#65292;&#19968;&#20010;&#20026;&#27468;&#26354;&#21019;&#20316;&#32780;&#35774;&#35745;&#30340;&#21019;&#26032;&#22411;LLM&#12290;&#23427;&#33021;&#22815;&#29702;&#35299;&#21644;&#29983;&#25104;&#27468;&#26354;&#20013;&#30340;&#26059;&#24459;&#21644;&#27468;&#35789;&#65292;&#36890;&#36807;&#21033;&#29992;LLM&#30340;&#33021;&#21147;&#22312;&#31526;&#21495;&#21270;&#30340;&#27468;&#26354;&#34920;&#31034;&#20013;&#29983;&#25104;&#12290;&#29616;&#26377;&#30340;&#19982;&#38899;&#20048;&#30456;&#20851;&#30340;LLM&#23558;&#38899;&#20048;&#35270;&#20026;&#37327;&#21270;&#30340;&#38899;&#39057;&#20449;&#21495;&#65292;&#32780;&#36825;&#31181;&#38544;&#24335;&#32534;&#30721;&#23548;&#33268;&#20102;&#32534;&#30721;&#25928;&#29575;&#20302;&#19979;&#21644;&#28789;&#27963;&#24615;&#24046;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#31526;&#21495;&#21270;&#30340;&#27468;&#26354;&#34920;&#31034;&#65292;&#36825;&#26159;&#20154;&#31867;&#20026;&#38899;&#20048;&#35774;&#35745;&#30340;&#25104;&#29087;&#21644;&#39640;&#25928;&#30340;&#26041;&#24335;&#65292;&#24182;&#20351;LLM&#33021;&#22815;&#20687;&#20154;&#31867;&#19968;&#26679;&#26126;&#30830;&#22320;&#21019;&#20316;&#27468;&#26354;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20803;&#32452;&#35774;&#35745;&#65292;&#29992;&#20110;&#26684;&#24335;&#21270;&#27468;&#35789;&#21644;&#26059;&#24459;&#20013;&#30340;&#19977;&#20010;&#38899;&#31526;&#23646;&#24615;&#65288;&#38899;&#39640;&#12289;&#25345;&#32493;&#26102;&#38388;&#21644;&#20241;&#27490;&#26102;&#38388;&#65289;&#65292;&#20174;&#32780;&#20445;&#35777;LLM&#23545;&#38899;&#20048;&#31526;&#21495;&#30340;&#27491;&#30830;&#29702;&#35299;&#65292;&#24182;&#23454;&#29616;&#27468;&#35789;&#21644;&#26059;&#24459;&#20043;&#38388;&#30340;&#31934;&#30830;&#23545;&#40784;&#12290;&#20026;&#20102;&#21521;LLM&#28748;&#36755;&#22522;&#26412;&#30340;&#38899;&#20048;&#29702;&#35299;&#65292;&#25105;&#20204;&#31934;&#24515;&#25910;&#38598;&#20102;SongCompose-PT&#65292;&#19968;&#20010;&#22823;&#35268;&#27169;&#30340;&#27468;&#26354;&#39044;&#35757;&#32451;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#25324;&#20102;&#27468;&#35789;&#12289;&#26059;&#24459;&#21644;&#25104;&#23545;&#30340;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17645v1 Announce Type: cross  Abstract: We present SongComposer, an innovative LLM designed for song composition. It could understand and generate melodies and lyrics in symbolic song representations, by leveraging the capability of LLM. Existing music-related LLM treated the music as quantized audio signals, while such implicit encoding leads to inefficient encoding and poor flexibility. In contrast, we resort to symbolic song representation, the mature and efficient way humans designed for music, and enable LLM to explicitly compose songs like humans. In practice, we design a novel tuple design to format lyric and three note attributes (pitch, duration, and rest duration) in the melody, which guarantees the correct LLM understanding of musical symbols and realizes precise alignment between lyrics and melody. To impart basic music understanding to LLM, we carefully collected SongCompose-PT, a large-scale song pretraining dataset that includes lyrics, melodies, and paired ly
&lt;/p&gt;</description></item></channel></rss>