<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#20256;&#36755;&#25193;&#23637;&#23545;&#39640;&#27604;&#20363;&#21487;&#20877;&#29983;&#33021;&#28304;&#31995;&#32479;&#30340;&#22909;&#22788;&#36828;&#36828;&#36229;&#36807;&#20256;&#32479;&#21457;&#30005;&#31995;&#32479;&#65292;&#20840;&#22269;&#26368;&#20339;&#35745;&#21010;&#19979;&#30340;&#20256;&#36755;&#25193;&#23637;&#20165;&#33021;&#23558;100%&#28165;&#27905;&#31995;&#32479;&#30340;&#25104;&#26412;&#38477;&#20302;4%&#12290;</title><link>https://arxiv.org/abs/2402.14189</link><description>&lt;p&gt;
&#26368;&#20339;&#20256;&#36755;&#25193;&#23637;&#26368;&#23567;&#21270;&#38477;&#20302;&#32654;&#22269;&#30005;&#21147;&#30899;&#20943;&#25490;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
Optimal transmission expansion minimally reduces decarbonization costs of U.S. electricity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14189
&lt;/p&gt;
&lt;p&gt;
&#20256;&#36755;&#25193;&#23637;&#23545;&#39640;&#27604;&#20363;&#21487;&#20877;&#29983;&#33021;&#28304;&#31995;&#32479;&#30340;&#22909;&#22788;&#36828;&#36828;&#36229;&#36807;&#20256;&#32479;&#21457;&#30005;&#31995;&#32479;&#65292;&#20840;&#22269;&#26368;&#20339;&#35745;&#21010;&#19979;&#30340;&#20256;&#36755;&#25193;&#23637;&#20165;&#33021;&#23558;100%&#28165;&#27905;&#31995;&#32479;&#30340;&#25104;&#26412;&#38477;&#20302;4%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22826;&#38451;&#33021;&#21644;&#39118;&#33021;&#19982;&#21270;&#30707;&#29123;&#26009;&#20855;&#26377;&#31454;&#20105;&#21147;&#65292;&#20294;&#23427;&#20204;&#30340;&#38388;&#27463;&#24615;&#29305;&#24615;&#24102;&#26469;&#20102;&#25361;&#25112;&#12290;&#38470;&#22320;&#12289;&#39118;&#21147;&#21644;&#22826;&#38451;&#36164;&#28304;&#22312;&#26102;&#38388;&#21644;&#22320;&#29702;&#19978;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#65292;&#36825;&#34920;&#26126;&#36828;&#36317;&#31163;&#36755;&#30005;&#21487;&#33021;&#29305;&#21035;&#26377;&#30410;&#12290;&#25105;&#20204;&#20351;&#29992;&#35814;&#32454;&#30340;&#24320;&#28304;&#27169;&#22411;&#65292;&#32852;&#21512;&#20998;&#26512;&#20102;&#32654;&#22269;&#19977;&#20010;&#20027;&#35201;&#20114;&#32852;&#32593;&#30340;&#26368;&#20339;&#20256;&#36755;&#25193;&#23637;&#12289;&#23384;&#20648;&#12289;&#21457;&#30005;&#21644;&#23567;&#26102;&#36816;&#33829;&#12290;&#22312;&#39640;&#21487;&#20877;&#29983;&#33021;&#28304;&#31995;&#32479;&#20013;&#65292;&#20256;&#36755;&#25193;&#23637;&#25552;&#20379;&#30340;&#22909;&#22788;&#36828;&#36828;&#36229;&#36807;&#20027;&#35201;&#37319;&#29992;&#20256;&#32479;&#21457;&#30005;&#30340;&#31995;&#32479;&#12290;&#28982;&#32780;&#65292;&#23613;&#31649;&#19968;&#20010;&#26368;&#20339;&#30340;&#20840;&#22269;&#35745;&#21010;&#38656;&#35201;&#23558;&#24403;&#21069;&#30340;&#22320;&#21306;&#38388;&#36755;&#30005;&#23481;&#37327;&#22686;&#21152;&#33267;&#19977;&#20493;&#20197;&#19978;&#65292;&#19982;&#20165;&#20381;&#38752;&#24403;&#21069;&#36755;&#30005;&#30340;&#26041;&#26696;&#30456;&#27604;&#65292;&#20256;&#36755;&#20165;&#33021;&#23558;100%&#28165;&#27905;&#31995;&#32479;&#30340;&#25104;&#26412;&#38477;&#20302;4%&#12290;&#20165;&#22312;&#29616;&#26377;&#20114;&#32852;&#32593;&#20043;&#38388;&#25193;&#23637;&#23481;&#37327;&#21363;&#21487;&#23454;&#29616;&#22823;&#37096;&#20998;&#33410;&#32422;&#12290;&#23545;&#33021;&#28304;&#23384;&#20648;&#21644;&#21457;&#30005;&#30340;&#35843;&#25972;&#20063;&#33021;&#23454;&#29616;&#19968;&#23450;&#31243;&#24230;&#19978;&#30340;&#33410;&#32422;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14189v1 Announce Type: new  Abstract: Solar and wind power are cost-competitive with fossil fuels, yet their intermittent nature presents challenges. Significant temporal and geographic differences in land, wind, and solar resources suggest that long-distance transmission could be particularly beneficial. Using a detailed, open-source model, we analyze optimal transmission expansion jointly with storage, generation, and hourly operations across the three primary interconnects in the United States. Transmission expansion offers far more benefits in a high-renewable system than in a system with mostly conventional generation. Yet while an optimal nationwide plan would have more than triple current interregional transmission, transmission decreases the cost of a 100% clean system by only 4% compared to a plan that relies solely on current transmission. Expanding capacity only within existing interconnects can achieve most of these savings. Adjustments to energy storage and gene
&lt;/p&gt;</description></item><item><title>RobustNeuralNetworks.jl&#26159;&#19968;&#20010;&#29992;Julia&#32534;&#20889;&#30340;&#26426;&#22120;&#23398;&#20064;&#21644;&#25968;&#25454;&#39537;&#21160;&#25511;&#21046;&#21253;&#65292;&#23427;&#36890;&#36807;&#33258;&#28982;&#28385;&#36275;&#29992;&#25143;&#23450;&#20041;&#30340;&#40065;&#26834;&#24615;&#32422;&#26463;&#26465;&#20214;&#65292;&#23454;&#29616;&#20102;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#26500;&#24314;&#12290;</title><link>http://arxiv.org/abs/2306.12612</link><description>&lt;p&gt;
RobustNeuralNetworks.jl&#65306;&#24102;&#26377;&#35748;&#35777;&#40065;&#26834;&#24615;&#30340;&#26426;&#22120;&#23398;&#20064;&#21644;&#25968;&#25454;&#39537;&#21160;&#25511;&#21046;&#21253;&#12290;
&lt;/p&gt;
&lt;p&gt;
RobustNeuralNetworks.jl: a Package for Machine Learning and Data-Driven Control with Certified Robustness. (arXiv:2306.12612v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12612
&lt;/p&gt;
&lt;p&gt;
RobustNeuralNetworks.jl&#26159;&#19968;&#20010;&#29992;Julia&#32534;&#20889;&#30340;&#26426;&#22120;&#23398;&#20064;&#21644;&#25968;&#25454;&#39537;&#21160;&#25511;&#21046;&#21253;&#65292;&#23427;&#36890;&#36807;&#33258;&#28982;&#28385;&#36275;&#29992;&#25143;&#23450;&#20041;&#30340;&#40065;&#26834;&#24615;&#32422;&#26463;&#26465;&#20214;&#65292;&#23454;&#29616;&#20102;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#30340;&#26500;&#24314;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#32593;&#32476;&#36890;&#24120;&#23545;&#20110;&#24494;&#23567;&#30340;&#36755;&#20837;&#25200;&#21160;&#38750;&#24120;&#25935;&#24863;&#65292;&#23548;&#33268;&#20986;&#29616;&#24847;&#22806;&#25110;&#33030;&#24369;&#30340;&#34892;&#20026;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;RobustNeuralNetworks.jl&#65306;&#19968;&#20010;Julia&#21253;&#65292;&#29992;&#20110;&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#33258;&#28982;&#22320;&#28385;&#36275;&#19968;&#32452;&#29992;&#25143;&#23450;&#20041;&#30340;&#40065;&#26834;&#24615;&#32422;&#26463;&#26465;&#20214;&#12290;&#35813;&#21253;&#22522;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;Recurrent Equilibrium Network&#65288;REN&#65289;&#21644;Lipschitz-Bounded Deep Network&#65288;LBDN&#65289;&#27169;&#22411;&#31867;&#65292;&#24182;&#26088;&#22312;&#30452;&#25509;&#19982;Julia&#26368;&#24191;&#27867;&#20351;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#21253;Flux.jl&#25509;&#21475;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#27169;&#22411;&#21442;&#25968;&#21270;&#32972;&#21518;&#30340;&#29702;&#35770;&#65292;&#27010;&#36848;&#20102;&#35813;&#21253;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#25945;&#31243;&#65292;&#28436;&#31034;&#20102;&#20854;&#22312;&#22270;&#20687;&#20998;&#31867;&#12289;&#24378;&#21270;&#23398;&#20064;&#21644;&#38750;&#32447;&#24615;&#29366;&#24577;&#35266;&#27979;&#22120;&#35774;&#35745;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Neural networks are typically sensitive to small input perturbations, leading to unexpected or brittle behaviour. We present RobustNeuralNetworks.jl: a Julia package for neural network models that are constructed to naturally satisfy a set of user-defined robustness constraints. The package is based on the recently proposed Recurrent Equilibrium Network (REN) and Lipschitz-Bounded Deep Network (LBDN) model classes, and is designed to interface directly with Julia's most widely-used machine learning package, Flux.jl. We discuss the theory behind our model parameterization, give an overview of the package, and provide a tutorial demonstrating its use in image classification, reinforcement learning, and nonlinear state-observer design.
&lt;/p&gt;</description></item></channel></rss>