<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>SLADE&#36890;&#36807;&#33258;&#30417;&#30563;&#23398;&#20064;&#22312;&#36793;&#32536;&#27969;&#20013;&#36805;&#36895;&#26816;&#27979;&#21160;&#24577;&#24322;&#24120;&#65292;&#26080;&#38656;&#20381;&#36182;&#26631;&#31614;&#65292;&#20027;&#35201;&#36890;&#36807;&#35266;&#23519;&#33410;&#28857;&#20132;&#20114;&#27169;&#24335;&#30340;&#20559;&#24046;&#26469;&#26816;&#27979;&#33410;&#28857;&#29366;&#24577;&#36716;&#21464;&#12290;</title><link>https://arxiv.org/abs/2402.11933</link><description>&lt;p&gt;
SLADE&#65306;&#36890;&#36807;&#33258;&#30417;&#30563;&#23398;&#20064;&#22312;&#36793;&#32536;&#27969;&#20013;&#26816;&#27979;&#21160;&#24577;&#24322;&#24120;
&lt;/p&gt;
&lt;p&gt;
SLADE: Detecting Dynamic Anomalies in Edge Streams without Labels via Self-Supervised Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11933
&lt;/p&gt;
&lt;p&gt;
SLADE&#36890;&#36807;&#33258;&#30417;&#30563;&#23398;&#20064;&#22312;&#36793;&#32536;&#27969;&#20013;&#36805;&#36895;&#26816;&#27979;&#21160;&#24577;&#24322;&#24120;&#65292;&#26080;&#38656;&#20381;&#36182;&#26631;&#31614;&#65292;&#20027;&#35201;&#36890;&#36807;&#35266;&#23519;&#33410;&#28857;&#20132;&#20114;&#27169;&#24335;&#30340;&#20559;&#24046;&#26469;&#26816;&#27979;&#33410;&#28857;&#29366;&#24577;&#36716;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#26816;&#27979;&#30495;&#23454;&#19990;&#30028;&#22270;&#20013;&#30340;&#24322;&#24120;&#65292;&#22914;&#31038;&#20132;&#12289;&#30005;&#23376;&#37038;&#20214;&#21644;&#37329;&#34701;&#32593;&#32476;&#65292;&#24050;&#32463;&#24320;&#21457;&#20102;&#21508;&#31181;&#26041;&#27861;&#12290;&#22312;&#22823;&#22810;&#25968;&#30495;&#23454;&#19990;&#30028;&#22270;&#38543;&#26102;&#38388;&#22686;&#38271;&#65292;&#33258;&#28982;&#22320;&#34920;&#31034;&#20026;&#36793;&#32536;&#27969;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#65306;(a)&#22312;&#24322;&#24120;&#21457;&#29983;&#26102;&#21363;&#26102;&#26816;&#27979;&#24322;&#24120;&#65292;(b)&#36866;&#24212;&#21160;&#24577;&#21464;&#21270;&#30340;&#29366;&#24577;&#65292;(c)&#22788;&#29702;&#21160;&#24577;&#24322;&#24120;&#26631;&#31614;&#30340;&#31232;&#32570;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;SLADE&#65288;&#36793;&#32536;&#27969;&#24322;&#24120;&#26816;&#27979;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#65289;&#65292;&#29992;&#20110;&#22312;&#36793;&#32536;&#27969;&#20013;&#24555;&#36895;&#26816;&#27979;&#21160;&#24577;&#24322;&#24120;&#65292;&#32780;&#19981;&#20381;&#36182;&#20110;&#26631;&#31614;&#12290;SLADE&#36890;&#36807;&#35266;&#23519;&#33410;&#28857;&#22312;&#26102;&#38388;&#19978;&#30456;&#20114;&#20316;&#29992;&#27169;&#24335;&#30340;&#20559;&#24046;&#26469;&#26816;&#27979;&#33410;&#28857;&#36827;&#20837;&#24322;&#24120;&#29366;&#24577;&#30340;&#36716;&#21464;&#12290;&#20026;&#27492;&#65292;&#23427;&#35757;&#32451;&#19968;&#20010;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#25191;&#34892;&#20004;&#20010;&#33258;&#30417;&#30563;&#20219;&#21153;&#65306;(a)&#26368;&#23567;&#21270;&#33410;&#28857;&#34920;&#31034;&#20013;&#30340;&#28418;&#31227;&#65292;(b)&#20174;&#30701;&#26399;&#29983;&#25104;&#38271;&#26399;&#20132;&#20114;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11933v1 Announce Type: new  Abstract: To detect anomalies in real-world graphs, such as social, email, and financial networks, various approaches have been developed. While they typically assume static input graphs, most real-world graphs grow over time, naturally represented as edge streams. In this context, we aim to achieve three goals: (a) instantly detecting anomalies as they occur, (b) adapting to dynamically changing states, and (c) handling the scarcity of dynamic anomaly labels. In this paper, we propose SLADE (Self-supervised Learning for Anomaly Detection in Edge Streams) for rapid detection of dynamic anomalies in edge streams, without relying on labels. SLADE detects the shifts of nodes into abnormal states by observing deviations in their interaction patterns over time. To this end, it trains a deep neural network to perform two self-supervised tasks: (a) minimizing drift in node representations and (b) generating long-term interaction patterns from short-term 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39044;&#27979;&#21160;&#24577;&#22270;&#32467;&#26500;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#26102;&#38388;&#24207;&#21015;&#26041;&#27861;&#39044;&#27979;&#26410;&#26469;&#26102;&#38388;&#28857;&#30340;&#33410;&#28857;&#24230;&#65292;&#24182;&#32467;&#21512;&#36890;&#37327;&#24179;&#34913;&#20998;&#26512;&#26041;&#27861;&#33719;&#24471;&#26410;&#26469;&#22270;&#30340;&#32467;&#26500;&#65292;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#29992;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.04280</link><description>&lt;p&gt;
&#39044;&#27979;&#21160;&#24577;&#22270;&#30340;&#32467;&#26500;
&lt;/p&gt;
&lt;p&gt;
Predicting the structure of dynamic graphs. (arXiv:2401.04280v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04280
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39044;&#27979;&#21160;&#24577;&#22270;&#32467;&#26500;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#26102;&#38388;&#24207;&#21015;&#26041;&#27861;&#39044;&#27979;&#26410;&#26469;&#26102;&#38388;&#28857;&#30340;&#33410;&#28857;&#24230;&#65292;&#24182;&#32467;&#21512;&#36890;&#37327;&#24179;&#34913;&#20998;&#26512;&#26041;&#27861;&#33719;&#24471;&#26410;&#26469;&#22270;&#30340;&#32467;&#26500;&#65292;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#29992;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#22270;&#23884;&#20837;&#12289;&#24402;&#32435;&#21644;&#22686;&#37327;&#23398;&#20064;&#26377;&#21161;&#20110;&#39044;&#27979;&#20219;&#21153;&#65292;&#22914;&#33410;&#28857;&#20998;&#31867;&#21644;&#38142;&#25509;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#20174;&#22270;&#30340;&#26102;&#38388;&#24207;&#21015;&#20013;&#39044;&#27979;&#26410;&#26469;&#26102;&#38388;&#27493;&#30340;&#22270;&#32467;&#26500;&#65292;&#20801;&#35768;&#26377;&#26032;&#33410;&#28857;&#65292;&#24182;&#27809;&#26377;&#21463;&#21040;&#22826;&#22810;&#20851;&#27880;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36825;&#26679;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#26102;&#38388;&#24207;&#21015;&#26041;&#27861;&#39044;&#27979;&#26410;&#26469;&#26102;&#38388;&#28857;&#30340;&#33410;&#28857;&#24230;&#65292;&#24182;&#23558;&#20854;&#19982;&#36890;&#37327;&#24179;&#34913;&#20998;&#26512;&#65288;&#19968;&#31181;&#22312;&#29983;&#29289;&#21270;&#23398;&#20013;&#20351;&#29992;&#30340;&#32447;&#24615;&#35268;&#21010;&#26041;&#27861;&#65289;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#33719;&#24471;&#26410;&#26469;&#22270;&#30340;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#19981;&#21516;&#21442;&#25968;&#20540;&#30340;&#39044;&#27979;&#22270;&#20998;&#24067;&#12290;&#25105;&#20204;&#20351;&#29992;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#23454;&#29992;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic graph embeddings, inductive and incremental learning facilitate predictive tasks such as node classification and link prediction. However, predicting the structure of a graph at a future time step from a time series of graphs, allowing for new nodes has not gained much attention. In this paper, we present such an approach. We use time series methods to predict the node degree at future time points and combine it with flux balance analysis -- a linear programming method used in biochemistry -- to obtain the structure of future graphs. Furthermore, we explore the predictive graph distribution for different parameter values. We evaluate this method using synthetic and real datasets and demonstrate its utility and applicability.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65292;&#29992;&#20110;&#28145;&#20837;&#20998;&#26512;&#35821;&#20041;&#32593;&#32476;&#65292;&#20026;&#21697;&#29260;&#24418;&#35937;&#30340;&#26356;&#22909;&#25506;&#32034;&#21644;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.16228</link><description>&lt;p&gt;
&#21697;&#29260;&#32593;&#32476;&#22686;&#24378;&#22120;&#65306;&#25552;&#21319;&#21697;&#29260;&#36830;&#25509;&#24615;&#30340;&#26032;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Brand Network Booster: A New System for Improving Brand Connectivity. (arXiv:2309.16228v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16228
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65292;&#29992;&#20110;&#28145;&#20837;&#20998;&#26512;&#35821;&#20041;&#32593;&#32476;&#65292;&#20026;&#21697;&#29260;&#24418;&#35937;&#30340;&#26356;&#22909;&#25506;&#32034;&#21644;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65292;&#29992;&#20110;&#28145;&#20837;&#20998;&#26512;&#35821;&#20041;&#32593;&#32476;&#65292;&#20026;&#21697;&#29260;&#24418;&#35937;&#30340;&#26356;&#22909;&#25506;&#32034;&#21644;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;&#22312;&#32593;&#32476;&#20998;&#26512;&#26041;&#38754;&#65292;&#25105;&#20204;&#36890;&#36807;&#35299;&#20915;&#25193;&#23637;&#29256;&#30340;&#26368;&#22823;&#36830;&#25509;&#24230;&#25913;&#36827;&#38382;&#39064;&#26469;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#20854;&#20013;&#21253;&#25324;&#32771;&#34385;&#25932;&#23545;&#33410;&#28857;&#12289;&#32422;&#26463;&#39044;&#31639;&#21644;&#21152;&#26435;&#32593;&#32476;&#30340;&#21487;&#33021;&#24615; - &#36890;&#36807;&#28155;&#21152;&#38142;&#25509;&#25110;&#22686;&#21152;&#29616;&#26377;&#36830;&#25509;&#30340;&#26435;&#37325;&#26469;&#23454;&#29616;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#12290;&#25105;&#20204;&#32467;&#21512;&#20004;&#20010;&#26696;&#20363;&#30740;&#31350;&#26469;&#23637;&#31034;&#36825;&#20010;&#26032;&#31995;&#32479;&#65292;&#24182;&#35752;&#35770;&#20854;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#24037;&#20855;&#21644;&#26041;&#27861;&#23545;&#20110;&#32593;&#32476;&#23398;&#32773;&#21644;&#25903;&#25345;&#24066;&#22330;&#33829;&#38144;&#21644;&#20256;&#25773;&#31649;&#29702;&#32773;&#30340;&#25112;&#30053;&#20915;&#31574;&#36807;&#31243;&#37117;&#24456;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a new decision support system offered for an in-depth analysis of semantic networks, which can provide insights for a better exploration of a brand's image and the improvement of its connectivity. In terms of network analysis, we show that this goal is achieved by solving an extended version of the Maximum Betweenness Improvement problem, which includes the possibility of considering adversarial nodes, constrained budgets, and weighted networks - where connectivity improvement can be obtained by adding links or increasing the weight of existing connections. We present this new system together with two case studies, also discussing its performance. Our tool and approach are useful both for network scholars and for supporting the strategic decision-making processes of marketing and communication managers.
&lt;/p&gt;</description></item></channel></rss>