<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20844;&#24179;&#28508;&#22312;&#34920;&#31034;&#30340;&#20108;&#20998;&#22270;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#26041;&#27861;&#65292;&#20197;&#35299;&#20915;&#29983;&#24577;&#32593;&#32476;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#38382;&#39064;&#65292;&#36890;&#36807;&#22312;&#25439;&#22833;&#20989;&#25968;&#20013;&#24341;&#20837;&#39069;&#22806;&#30340;HSIC&#24809;&#32602;&#39033;&#65292;&#30830;&#20445;&#20102;&#28508;&#22312;&#31354;&#38388;&#32467;&#26500;&#19982;&#36830;&#32493;&#21464;&#37327;&#30340;&#29420;&#31435;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.02011</link><description>&lt;p&gt;
&#20844;&#24179;&#28508;&#22312;&#34920;&#31034;&#30340;&#20108;&#20998;&#22270;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#65292;&#20197;&#35299;&#20915;&#29983;&#24577;&#32593;&#32476;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Bipartite Graph Variational Auto-Encoder with Fair Latent Representation to Account for Sampling Bias in Ecological Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02011
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20844;&#24179;&#28508;&#22312;&#34920;&#31034;&#30340;&#20108;&#20998;&#22270;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#26041;&#27861;&#65292;&#20197;&#35299;&#20915;&#29983;&#24577;&#32593;&#32476;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#38382;&#39064;&#65292;&#36890;&#36807;&#22312;&#25439;&#22833;&#20989;&#25968;&#20013;&#24341;&#20837;&#39069;&#22806;&#30340;HSIC&#24809;&#32602;&#39033;&#65292;&#30830;&#20445;&#20102;&#28508;&#22312;&#31354;&#38388;&#32467;&#26500;&#19982;&#36830;&#32493;&#21464;&#37327;&#30340;&#29420;&#31435;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#19968;&#31181;&#26041;&#27861;&#65292;&#20351;&#29992;&#22270;&#23884;&#20837;&#26469;&#34920;&#31034;&#20108;&#20998;&#32593;&#32476;&#65292;&#20197;&#35299;&#20915;&#30740;&#31350;&#29983;&#24577;&#32593;&#32476;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#27604;&#22914;&#36830;&#25509;&#26893;&#29289;&#21644;&#20256;&#31881;&#32773;&#31561;&#32593;&#32476;&#65292;&#38656;&#32771;&#34385;&#35768;&#22810;&#21327;&#21464;&#37327;&#65292;&#23588;&#20854;&#35201;&#25511;&#21046;&#25277;&#26679;&#20559;&#24046;&#12290;&#25105;&#20204;&#23558;&#21464;&#20998;&#22270;&#33258;&#21160;&#32534;&#30721;&#22120;&#26041;&#27861;&#35843;&#25972;&#20026;&#20108;&#20998;&#24773;&#20917;&#65292;&#20174;&#32780;&#33021;&#22815;&#22312;&#28508;&#22312;&#31354;&#38388;&#20013;&#29983;&#25104;&#23884;&#20837;&#65292;&#20854;&#20013;&#20004;&#32452;&#33410;&#28857;&#30340;&#20301;&#32622;&#22522;&#20110;&#23427;&#20204;&#30340;&#36830;&#25509;&#27010;&#29575;&#12290;&#25105;&#20204;&#23558;&#22312;&#31038;&#20250;&#23398;&#20013;&#24120;&#32771;&#34385;&#30340;&#20844;&#24179;&#24615;&#26694;&#26550;&#36716;&#21270;&#20026;&#29983;&#24577;&#23398;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#38382;&#39064;&#12290;&#36890;&#36807;&#22312;&#25439;&#22833;&#20989;&#25968;&#20013;&#28155;&#21152;Hilbert-Schmidt&#29420;&#31435;&#20934;&#21017;&#65288;HSIC&#65289;&#20316;&#20026;&#39069;&#22806;&#24809;&#32602;&#39033;&#65292;&#25105;&#20204;&#30830;&#20445;&#28508;&#22312;&#31354;&#38388;&#32467;&#26500;&#19982;&#36830;&#32493;&#21464;&#37327;&#65288;&#19982;&#25277;&#26679;&#36807;&#31243;&#30456;&#20851;&#65289;&#26080;&#20851;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22914;&#20309;&#25913;&#21464;&#25105;&#20204;&#23545;&#29983;&#24577;&#32593;&#32476;&#30340;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02011v1 Announce Type: cross  Abstract: We propose a method to represent bipartite networks using graph embeddings tailored to tackle the challenges of studying ecological networks, such as the ones linking plants and pollinators, where many covariates need to be accounted for, in particular to control for sampling bias. We adapt the variational graph auto-encoder approach to the bipartite case, which enables us to generate embeddings in a latent space where the two sets of nodes are positioned based on their probability of connection. We translate the fairness framework commonly considered in sociology in order to address sampling bias in ecology. By incorporating the Hilbert-Schmidt independence criterion (HSIC) as an additional penalty term in the loss we optimize, we ensure that the structure of the latent space is independent of continuous variables, which are related to the sampling process. Finally, we show how our approach can change our understanding of ecological n
&lt;/p&gt;</description></item></channel></rss>