<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;REBORN&#65292;&#22312;&#26080;&#30417;&#30563;&#35821;&#38899;&#35782;&#21035;&#20013;&#20351;&#29992;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#36845;&#20195;&#35757;&#32451;&#26469;&#23454;&#29616;&#36793;&#30028;&#20998;&#21106;&#12290;&#36890;&#36807;&#20132;&#26367;&#35757;&#32451;&#20998;&#21106;&#27169;&#22411;&#21644;&#38899;&#32032;&#39044;&#27979;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#23398;&#20064;&#35821;&#38899;&#21644;&#25991;&#26412;&#20043;&#38388;&#30340;&#26144;&#23556;&#65292;&#35299;&#20915;&#20102;&#26080;&#30417;&#30563;&#24773;&#20917;&#19979;&#35821;&#38899;&#20449;&#21495;&#20998;&#27573;&#32467;&#26500;&#36793;&#30028;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2402.03988</link><description>&lt;p&gt;
REBORN: &#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#36845;&#20195;&#35757;&#32451;&#30340;&#26080;&#30417;&#30563;&#35821;&#38899;&#35782;&#21035;&#20013;&#30340;&#36793;&#30028;&#20998;&#21106;
&lt;/p&gt;
&lt;p&gt;
REBORN: Reinforcement-Learned Boundary Segmentation with Iterative Training for Unsupervised ASR
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03988
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;REBORN&#65292;&#22312;&#26080;&#30417;&#30563;&#35821;&#38899;&#35782;&#21035;&#20013;&#20351;&#29992;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#36845;&#20195;&#35757;&#32451;&#26469;&#23454;&#29616;&#36793;&#30028;&#20998;&#21106;&#12290;&#36890;&#36807;&#20132;&#26367;&#35757;&#32451;&#20998;&#21106;&#27169;&#22411;&#21644;&#38899;&#32032;&#39044;&#27979;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#23398;&#20064;&#35821;&#38899;&#21644;&#25991;&#26412;&#20043;&#38388;&#30340;&#26144;&#23556;&#65292;&#35299;&#20915;&#20102;&#26080;&#30417;&#30563;&#24773;&#20917;&#19979;&#35821;&#38899;&#20449;&#21495;&#20998;&#27573;&#32467;&#26500;&#36793;&#30028;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26080;&#30417;&#30563;&#33258;&#21160;&#35821;&#38899;&#35782;&#21035;&#65288;ASR&#65289;&#26088;&#22312;&#23398;&#20064;&#35821;&#38899;&#20449;&#21495;&#19982;&#20854;&#23545;&#24212;&#30340;&#25991;&#26412;&#36716;&#24405;&#20043;&#38388;&#30340;&#26144;&#23556;&#65292;&#32780;&#26080;&#38656;&#37197;&#23545;&#30340;&#35821;&#38899;-&#25991;&#26412;&#25968;&#25454;&#30417;&#30563;&#12290;&#35821;&#38899;&#20449;&#21495;&#20013;&#30340;&#21333;&#35789;/&#38899;&#32032;&#30001;&#19968;&#27573;&#38271;&#24230;&#21487;&#21464;&#19988;&#36793;&#30028;&#26410;&#30693;&#30340;&#35821;&#38899;&#20449;&#21495;&#34920;&#31034;&#65292;&#32780;&#36825;&#31181;&#20998;&#27573;&#32467;&#26500;&#20351;&#24471;&#22312;&#27809;&#26377;&#37197;&#23545;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#23398;&#20064;&#35821;&#38899;&#21644;&#25991;&#26412;&#20043;&#38388;&#30340;&#26144;&#23556;&#21464;&#24471;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;REBORN&#65292;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#36845;&#20195;&#35757;&#32451;&#30340;&#26080;&#30417;&#30563;&#35821;&#38899;&#35782;&#21035;&#20013;&#30340;&#36793;&#30028;&#20998;&#21106;&#12290;REBORN&#20132;&#26367;&#36827;&#34892;&#20197;&#19979;&#20004;&#20010;&#27493;&#39588;&#65306;&#65288;1&#65289;&#35757;&#32451;&#19968;&#20010;&#33021;&#22815;&#39044;&#27979;&#35821;&#38899;&#20449;&#21495;&#20013;&#20998;&#27573;&#32467;&#26500;&#36793;&#30028;&#30340;&#20998;&#21106;&#27169;&#22411;&#65292;&#21644;&#65288;2&#65289;&#35757;&#32451;&#19968;&#20010;&#38899;&#32032;&#39044;&#27979;&#27169;&#22411;&#65292;&#20854;&#36755;&#20837;&#26159;&#30001;&#20998;&#21106;&#27169;&#22411;&#20998;&#21106;&#30340;&#20998;&#27573;&#32467;&#26500;&#65292;&#29992;&#20110;&#39044;&#27979;&#38899;&#32032;&#36716;&#24405;&#12290;&#30001;&#20110;&#27809;&#26377;&#29992;&#20110;&#35757;&#32451;&#20998;&#21106;&#27169;&#22411;&#30340;&#30417;&#30563;&#25968;&#25454;&#65292;&#25105;&#20204;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#26469;&#35757;&#32451;&#20998;&#21106;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Unsupervised automatic speech recognition (ASR) aims to learn the mapping between the speech signal and its corresponding textual transcription without the supervision of paired speech-text data. A word/phoneme in the speech signal is represented by a segment of speech signal with variable length and unknown boundary, and this segmental structure makes learning the mapping between speech and text challenging, especially without paired data. In this paper, we propose REBORN, Reinforcement-Learned Boundary Segmentation with Iterative Training for Unsupervised ASR. REBORN alternates between (1) training a segmentation model that predicts the boundaries of the segmental structures in speech signals and (2) training the phoneme prediction model, whose input is a segmental structure segmented by the segmentation model, to predict a phoneme transcription. Since supervised data for training the segmentation model is not available, we use reinforcement learning to train the segmentation model t
&lt;/p&gt;</description></item></channel></rss>