<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#22522;&#20110;&#25193;&#25955;&#29983;&#25104;&#27169;&#22411;&#65292;&#36890;&#36807;&#28151;&#21512;&#22122;&#22768;&#35821;&#38899;&#21644;&#39640;&#26031;&#22122;&#22768;&#36827;&#34892;&#21453;&#21521;&#36807;&#31243;&#65292;&#20165;&#20351;&#29992;30&#27493;&#23601;&#23454;&#29616;&#39640;&#36136;&#37327;&#30340;&#24178;&#20928;&#35821;&#38899;&#20272;&#35745;&#12290;&#35843;&#25972;&#32593;&#32476;&#26550;&#26500;&#65292;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#35821;&#38899;&#22686;&#24378;&#24615;&#33021;&#65292;&#36798;&#21040;&#20102;&#26368;&#26032;&#26041;&#27861;&#30340;&#31454;&#20105;&#27700;&#24179;&#12290;</title><link>http://arxiv.org/abs/2208.05830</link><description>&lt;p&gt;
&#22522;&#20110;&#25193;&#25955;&#29983;&#25104;&#27169;&#22411;&#30340;&#35821;&#38899;&#22686;&#24378;&#21644;&#21435;&#28151;&#21709;
&lt;/p&gt;
&lt;p&gt;
Speech Enhancement and Dereverberation with Diffusion-based Generative Models. (arXiv:2208.05830v2 [eess.AS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.05830
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22522;&#20110;&#25193;&#25955;&#29983;&#25104;&#27169;&#22411;&#65292;&#36890;&#36807;&#28151;&#21512;&#22122;&#22768;&#35821;&#38899;&#21644;&#39640;&#26031;&#22122;&#22768;&#36827;&#34892;&#21453;&#21521;&#36807;&#31243;&#65292;&#20165;&#20351;&#29992;30&#27493;&#23601;&#23454;&#29616;&#39640;&#36136;&#37327;&#30340;&#24178;&#20928;&#35821;&#38899;&#20272;&#35745;&#12290;&#35843;&#25972;&#32593;&#32476;&#26550;&#26500;&#65292;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#35821;&#38899;&#22686;&#24378;&#24615;&#33021;&#65292;&#36798;&#21040;&#20102;&#26368;&#26032;&#26041;&#27861;&#30340;&#31454;&#20105;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#22522;&#20110;&#25105;&#20204;&#20043;&#21069;&#30340;&#20986;&#29256;&#29289;&#65292;&#24182;&#20351;&#29992;&#22522;&#20110;&#25193;&#25955;&#30340;&#29983;&#25104;&#27169;&#22411;&#36827;&#34892;&#35821;&#38899;&#22686;&#24378;&#12290;&#25105;&#20204;&#35814;&#32454;&#20171;&#32461;&#20102;&#22522;&#20110;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#30340;&#25193;&#25955;&#36807;&#31243;&#65292;&#24182;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#29702;&#35770;&#25506;&#35752;&#20854;&#21547;&#20041;&#12290;&#19982;&#36890;&#24120;&#30340;&#26465;&#20214;&#29983;&#25104;&#20219;&#21153;&#30456;&#21453;&#65292;&#25105;&#20204;&#19981;&#26159;&#20174;&#32431;&#39640;&#26031;&#22122;&#22768;&#24320;&#22987;&#21453;&#21521;&#36807;&#31243;&#65292;&#32780;&#26159;&#20174;&#22122;&#22768;&#35821;&#38899;&#21644;&#39640;&#26031;&#22122;&#22768;&#30340;&#28151;&#21512;&#29289;&#24320;&#22987;&#12290;&#36825;&#19982;&#25105;&#20204;&#30340;&#27491;&#21521;&#36807;&#31243;&#30456;&#21305;&#37197;&#65292;&#35813;&#36807;&#31243;&#36890;&#36807;&#21253;&#25324;&#28418;&#31227;&#39033;&#23558;&#24178;&#20928;&#35821;&#38899;&#36716;&#21464;&#25104;&#22122;&#22768;&#35821;&#38899;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#20010;&#36807;&#31243;&#20351;&#24471;&#20351;&#29992;&#20165;30&#20010;&#25193;&#25955;&#27493;&#39588;&#26469;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#24178;&#20928;&#35821;&#38899;&#20272;&#35745;&#25104;&#20026;&#21487;&#33021;&#12290;&#36890;&#36807;&#35843;&#25972;&#32593;&#32476;&#26550;&#26500;&#65292;&#25105;&#20204;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#35821;&#38899;&#22686;&#24378;&#24615;&#33021;&#65292;&#36825;&#34920;&#26126;&#32593;&#32476;&#32780;&#19981;&#26159;&#24418;&#24335;&#20027;&#20041;&#26159;&#25105;&#20204;&#21407;&#22987;&#26041;&#27861;&#30340;&#20027;&#35201;&#38480;&#21046;&#12290;&#22312;&#24191;&#27867;&#30340;&#36328;&#25968;&#25454;&#38598;&#35780;&#20272;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25913;&#36827;&#21518;&#30340;&#26041;&#27861;&#21487;&#20197;&#19982;&#26368;&#26032;&#30340;&#26041;&#27861;&#31454;&#20105;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we build upon our previous publication and use diffusion-based generative models for speech enhancement. We present a detailed overview of the diffusion process that is based on a stochastic differential equation and delve into an extensive theoretical examination of its implications. Opposed to usual conditional generation tasks, we do not start the reverse process from pure Gaussian noise but from a mixture of noisy speech and Gaussian noise. This matches our forward process which moves from clean speech to noisy speech by including a drift term. We show that this procedure enables using only 30 diffusion steps to generate high-quality clean speech estimates. By adapting the network architecture, we are able to significantly improve the speech enhancement performance, indicating that the network, rather than the formalism, was the main limitation of our original approach. In an extensive cross-dataset evaluation, we show that the improved method can compete with recent 
&lt;/p&gt;</description></item></channel></rss>