<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#23433;&#20840;&#20445;&#35777;&#25506;&#32034;&#26694;&#26550;&#65292;&#20351;&#29992;&#26368;&#20248;&#25511;&#21046;&#23454;&#29616;&#20102;&#23545;&#38750;&#32447;&#24615;&#31995;&#32479;&#30340;&#26377;&#38480;&#26102;&#38388;&#26679;&#26412;&#22797;&#26434;&#24230;&#30028;&#38480;&#30340;&#20445;&#35777;&#25506;&#32034;&#65292;&#21516;&#26102;&#20855;&#26377;&#35777;&#26126;&#30340;&#23433;&#20840;&#24615;&#21644;&#24191;&#27867;&#36866;&#29992;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.06562</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#31995;&#32479;&#30340;&#23433;&#20840;&#20445;&#35777;&#25506;&#32034;
&lt;/p&gt;
&lt;p&gt;
Safe Guaranteed Exploration for Non-linear Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06562
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#23433;&#20840;&#20445;&#35777;&#25506;&#32034;&#26694;&#26550;&#65292;&#20351;&#29992;&#26368;&#20248;&#25511;&#21046;&#23454;&#29616;&#20102;&#23545;&#38750;&#32447;&#24615;&#31995;&#32479;&#30340;&#26377;&#38480;&#26102;&#38388;&#26679;&#26412;&#22797;&#26434;&#24230;&#30028;&#38480;&#30340;&#20445;&#35777;&#25506;&#32034;&#65292;&#21516;&#26102;&#20855;&#26377;&#35777;&#26126;&#30340;&#23433;&#20840;&#24615;&#21644;&#24191;&#27867;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#20808;&#39564;&#26410;&#30693;&#32422;&#26463;&#30340;&#29615;&#22659;&#20013;&#36827;&#34892;&#23433;&#20840;&#25506;&#32034;&#26159;&#38480;&#21046;&#26426;&#22120;&#20154;&#33258;&#20027;&#24615;&#30340;&#22522;&#26412;&#25361;&#25112;&#12290;&#34429;&#28982;&#23433;&#20840;&#24615;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#23545;&#36275;&#22815;&#25506;&#32034;&#30340;&#20445;&#35777;&#23545;&#20110;&#30830;&#20445;&#33258;&#20027;&#20219;&#21153;&#23436;&#25104;&#20063;&#33267;&#20851;&#37325;&#35201;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#23433;&#20840;&#20445;&#35777;&#25506;&#32034;&#26694;&#26550;&#65292;&#21033;&#29992;&#26368;&#20248;&#25511;&#21046;&#23454;&#29616;&#21069;&#25152;&#26410;&#26377;&#30340;&#32467;&#26524;&#65306;&#20855;&#26377;&#26377;&#38480;&#26102;&#38388;&#26679;&#26412;&#22797;&#26434;&#24230;&#30028;&#38480;&#30340;&#38750;&#32447;&#24615;&#31995;&#32479;&#30340;&#20445;&#35777;&#25506;&#32034;&#65292;&#21516;&#26102;&#22312;&#20219;&#24847;&#39640;&#27010;&#29575;&#19979;&#34987;&#35777;&#26126;&#26159;&#23433;&#20840;&#30340;&#12290;&#35813;&#26694;&#26550;&#20855;&#26377;&#24191;&#27867;&#30340;&#36866;&#29992;&#24615;&#65292;&#21487;&#36866;&#29992;&#20110;&#20855;&#26377;&#22797;&#26434;&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#21644;&#26410;&#30693;&#39046;&#22495;&#30340;&#35768;&#22810;&#23454;&#38469;&#22330;&#26223;&#12290;&#22522;&#20110;&#36825;&#20010;&#26694;&#26550;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#31639;&#27861;&#65292;SageMPC&#65292;&#37319;&#29992;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#36827;&#34892;&#23433;&#20840;&#20445;&#35777;&#25506;&#32034;&#12290;SageMPC&#36890;&#36807;&#25972;&#21512;&#19977;&#31181;&#25216;&#26415;&#26469;&#25552;&#39640;&#25928;&#29575;&#65306;i) &#21033;&#29992;Lipschitz&#36793;&#30028;&#65292;ii) &#30446;&#26631;&#23548;&#21521;&#25506;&#32034;&#65292;&#21644;iii) &#36880;&#27493;&#35843;&#25972;&#39118;&#26684;&#30340;&#37325;&#26032;&#35268;&#21010;&#65292;&#21516;&#26102;&#20445;&#25345;&#39640;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Safely exploring environments with a-priori unknown constraints is a fundamental challenge that restricts the autonomy of robots. While safety is paramount, guarantees on sufficient exploration are also crucial for ensuring autonomous task completion. To address these challenges, we propose a novel safe guaranteed exploration framework using optimal control, which achieves first-of-its-kind results: guaranteed exploration for non-linear systems with finite time sample complexity bounds, while being provably safe with arbitrarily high probability. The framework is general and applicable to many real-world scenarios with complex non-linear dynamics and unknown domains. Based on this framework we propose an efficient algorithm, SageMPC, SAfe Guaranteed Exploration using Model Predictive Control. SageMPC improves efficiency by incorporating three techniques: i) exploiting a Lipschitz bound, ii) goal-directed exploration, and iii) receding horizon style re-planning, all while maintaining th
&lt;/p&gt;</description></item></channel></rss>