<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#20004;&#31181;&#25968;&#25454;&#22686;&#24378;&#26041;&#27861;&#26469;&#25913;&#21892;&#32534;&#31243;&#35821;&#35328;&#20043;&#38388;&#30340;&#20195;&#30721;&#32763;&#35793;&#12290;&#36890;&#36807;&#26500;&#24314;&#21487;&#27604;&#36739;&#30340;&#35821;&#26009;&#24211;&#21644;&#22686;&#21152;&#22810;&#20010;&#21442;&#32771;&#32763;&#35793;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#36825;&#20123;&#26041;&#27861;&#26174;&#33879;&#25552;&#39640;&#20102;CodeT5&#22312;Java&#12289;Python&#21644;C++&#20043;&#38388;&#30340;&#32763;&#35793;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.00317</link><description>&lt;p&gt;
&#29992;&#21487;&#27604;&#36739;&#30340;&#35821;&#26009;&#21644;&#22810;&#20010;&#21442;&#32771;&#25991;&#29486;&#36827;&#34892;&#20195;&#30721;&#32763;&#35793;&#30340;&#25968;&#25454;&#22686;&#24378;
&lt;/p&gt;
&lt;p&gt;
Data Augmentation for Code Translation with Comparable Corpora and Multiple References. (arXiv:2311.00317v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00317
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#20004;&#31181;&#25968;&#25454;&#22686;&#24378;&#26041;&#27861;&#26469;&#25913;&#21892;&#32534;&#31243;&#35821;&#35328;&#20043;&#38388;&#30340;&#20195;&#30721;&#32763;&#35793;&#12290;&#36890;&#36807;&#26500;&#24314;&#21487;&#27604;&#36739;&#30340;&#35821;&#26009;&#24211;&#21644;&#22686;&#21152;&#22810;&#20010;&#21442;&#32771;&#32763;&#35793;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#36825;&#20123;&#26041;&#27861;&#26174;&#33879;&#25552;&#39640;&#20102;CodeT5&#22312;Java&#12289;Python&#21644;C++&#20043;&#38388;&#30340;&#32763;&#35793;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32534;&#31243;&#35821;&#35328;&#20043;&#38388;&#36827;&#34892;&#20195;&#30721;&#32763;&#35793;&#30340;&#19968;&#20010;&#20027;&#35201;&#25361;&#25112;&#26159;&#24179;&#34892;&#35757;&#32451;&#25968;&#25454;&#36890;&#24120;&#26377;&#38480;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;&#65292;&#19968;&#31181;&#26159;&#26500;&#24314;&#21487;&#27604;&#36739;&#30340;&#35821;&#26009;&#24211;&#65288;&#21363;&#20855;&#26377;&#31867;&#20284;&#21151;&#33021;&#30340;&#20195;&#30721;&#23545;&#65289;&#65292;&#21478;&#19968;&#31181;&#26159;&#29992;&#22810;&#20010;&#21442;&#32771;&#32763;&#35793;&#26469;&#22686;&#24378;&#29616;&#26377;&#30340;&#24179;&#34892;&#25968;&#25454;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#26500;&#24314;&#24182;&#20998;&#26512;&#20102;&#22810;&#31181;&#31867;&#22411;&#30340;&#21487;&#27604;&#36739;&#30340;&#35821;&#26009;&#24211;&#65292;&#21253;&#25324;&#20351;&#29992;&#20195;&#30721;&#29983;&#25104;&#27169;&#22411;&#20174;&#33258;&#28982;&#35821;&#35328;&#25991;&#26723;&#20013;&#29983;&#25104;&#30340;&#31243;&#24207;&#12290;&#27492;&#22806;&#65292;&#20026;&#20102;&#20943;&#23569;&#23545;&#21333;&#20010;&#21442;&#32771;&#32763;&#35793;&#30340;&#36807;&#25311;&#21512;&#65292;&#25105;&#20204;&#33258;&#21160;&#29983;&#25104;&#20102;&#21487;&#29992;&#24179;&#34892;&#25968;&#25454;&#30340;&#39069;&#22806;&#32763;&#35793;&#21442;&#32771;&#65292;&#24182;&#36890;&#36807;&#21333;&#20803;&#27979;&#35797;&#23545;&#32763;&#35793;&#36827;&#34892;&#31579;&#36873;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#30446;&#26631;&#32763;&#35793;&#30340;&#21464;&#21270;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;&#26174;&#33879;&#25552;&#39640;&#20102;CodeT5&#22312;Java&#12289;Python&#21644;C++&#20043;&#38388;&#30340;&#32763;&#35793;&#20934;&#30830;&#24615;&#65288;&#24179;&#22343;&#25552;&#21319;&#20102;7.5%&#30340;&#35745;&#31639;&#20934;&#30830;&#24615;&#65288;CA@1&#65289;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
One major challenge of translating code between programming languages is that parallel training data is often limited. To overcome this challenge, we present two data augmentation techniques, one that builds comparable corpora (i.e., code pairs with similar functionality), and another that augments existing parallel data with multiple reference translations. Specifically, we build and analyze multiple types of comparable corpora, including programs generated from natural language documentation using a code generation model. Furthermore, to reduce overfitting to a single reference translation, we automatically generate additional translation references for available parallel data and filter the translations by unit tests, which increases variation in target translations. Experiments show that our data augmentation techniques significantly improve CodeT5 for translation between Java, Python, and C++ by an average of 7.5% Computational Accuracy (CA@1), which verifies the correctness of tr
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25506;&#35752;&#20102;&#22312;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26102;&#20195;&#30340;&#33258;&#21160;&#32570;&#38519;&#29983;&#25104;&#38382;&#39064;&#65292;&#38024;&#23545;&#38590;&#20197;&#26816;&#27979;&#21644;&#38590;&#20197;&#20462;&#22797;&#30340;&#32570;&#38519;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#20998;&#26512;&#20102;&#22522;&#20110;&#23398;&#20064;&#30340;&#25216;&#26415;&#20013;&#36825;&#20004;&#20010;&#30446;&#26631;&#30340;&#20914;&#31361;&#12290;</title><link>http://arxiv.org/abs/2310.02407</link><description>&lt;p&gt;
&#22312;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26102;&#20195;&#30340;&#33258;&#21160;&#32570;&#38519;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Automated Bug Generation in the era of Large Language Models. (arXiv:2310.02407v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02407
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25506;&#35752;&#20102;&#22312;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26102;&#20195;&#30340;&#33258;&#21160;&#32570;&#38519;&#29983;&#25104;&#38382;&#39064;&#65292;&#38024;&#23545;&#38590;&#20197;&#26816;&#27979;&#21644;&#38590;&#20197;&#20462;&#22797;&#30340;&#32570;&#38519;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#20998;&#26512;&#20102;&#22522;&#20110;&#23398;&#20064;&#30340;&#25216;&#26415;&#20013;&#36825;&#20004;&#20010;&#30446;&#26631;&#30340;&#20914;&#31361;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32570;&#38519;&#22312;&#36719;&#20214;&#24037;&#31243;&#20013;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#65307;&#36807;&#21435;&#20960;&#21313;&#24180;&#30340;&#35768;&#22810;&#30740;&#31350;&#24050;&#32463;&#25552;&#20986;&#20102;&#26816;&#27979;&#12289;&#23450;&#20301;&#21644;&#20462;&#22797;&#36719;&#20214;&#31995;&#32479;&#20013;&#30340;&#32570;&#38519;&#30340;&#26041;&#27861;&#12290;&#35780;&#20272;&#36825;&#20123;&#25216;&#26415;&#30340;&#26377;&#25928;&#24615;&#38656;&#35201;&#22797;&#26434;&#30340;&#32570;&#38519;&#65292;&#21363;&#37027;&#20123;&#24456;&#38590;&#36890;&#36807;&#27979;&#35797;&#21644;&#35843;&#35797;&#26469;&#26816;&#27979;&#21644;&#20462;&#22797;&#30340;&#32570;&#38519;&#12290;&#20174;&#20256;&#32479;&#36719;&#20214;&#24037;&#31243;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#38590;&#20197;&#20462;&#22797;&#30340;&#32570;&#38519;&#19982;&#27491;&#30830;&#30340;&#20195;&#30721;&#22312;&#22810;&#20010;&#20301;&#32622;&#19978;&#26377;&#25152;&#24046;&#24322;&#65292;&#36825;&#20351;&#24471;&#23427;&#20204;&#38590;&#20197;&#23450;&#20301;&#21644;&#20462;&#22797;&#12290;&#32780;&#38590;&#20197;&#26816;&#27979;&#30340;&#32570;&#38519;&#21017;&#22312;&#29305;&#23450;&#30340;&#27979;&#35797;&#36755;&#20837;&#21644;&#21487;&#36798;&#26465;&#20214;&#19979;&#23637;&#29616;&#20986;&#26469;&#12290;&#36825;&#20004;&#20010;&#30446;&#26631;&#65292;&#21363;&#29983;&#25104;&#38590;&#20197;&#26816;&#27979;&#21644;&#38590;&#20197;&#20462;&#22797;&#30340;&#32570;&#38519;&#65292;&#22823;&#22810;&#25968;&#26159;&#19968;&#33268;&#30340;&#65307;&#32570;&#38519;&#29983;&#25104;&#25216;&#26415;&#21487;&#20197;&#23558;&#22810;&#20010;&#35821;&#21477;&#26356;&#25913;&#20026;&#20165;&#22312;&#29305;&#23450;&#36755;&#20837;&#38598;&#21512;&#19979;&#34987;&#35206;&#30422;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#22522;&#20110;&#23398;&#20064;&#30340;&#25216;&#26415;&#26469;&#35828;&#65292;&#36825;&#20004;&#20010;&#30446;&#26631;&#26159;&#30456;&#20114;&#20914;&#31361;&#30340;&#65306;&#19968;&#20010;&#32570;&#38519;&#24212;&#35813;&#26377;&#19982;&#35757;&#32451;&#25968;&#25454;&#20013;&#30340;&#27491;&#30830;&#20195;&#30721;&#30456;&#20284;&#30340;&#20195;&#30721;&#34920;&#31034;&#65292;&#20197;&#25361;&#25112;&#32570;&#38519;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bugs are essential in software engineering; many research studies in the past decades have been proposed to detect, localize, and repair bugs in software systems. Effectiveness evaluation of such techniques requires complex bugs, i.e., those that are hard to detect through testing and hard to repair through debugging. From the classic software engineering point of view, a hard-to-repair bug differs from the correct code in multiple locations, making it hard to localize and repair. Hard-to-detect bugs, on the other hand, manifest themselves under specific test inputs and reachability conditions. These two objectives, i.e., generating hard-to-detect and hard-to-repair bugs, are mostly aligned; a bug generation technique can change multiple statements to be covered only under a specific set of inputs. However, these two objectives are conflicting for learning-based techniques: A bug should have a similar code representation to the correct code in the training data to challenge a bug predi
&lt;/p&gt;</description></item></channel></rss>