<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#22270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#27169;&#22411;&#21270;&#21644;&#20998;&#26512;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#20869;&#29992;&#25143;&#20114;&#21160;&#65292;&#25581;&#31034;&#20102;&#27963;&#36291;&#29992;&#25143;&#20043;&#38388;&#30340;&#36830;&#25509;&#27169;&#24335;&#12289;&#23545;&#31038;&#21306;&#21160;&#24577;&#30340;&#36129;&#29486;&#29575;&#20197;&#21450;&#29992;&#25143;&#27963;&#21160;&#19982;&#21463;&#27426;&#36814;&#31243;&#24230;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.15937</link><description>&lt;p&gt;
&#27169;&#22411;&#12289;&#20998;&#26512;&#21644;&#29702;&#35299;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#20869;&#29992;&#25143;&#20114;&#21160;&#21644;&#21508;&#31181;&#23646;&#24615;
&lt;/p&gt;
&lt;p&gt;
Model, Analyze, and Comprehend User Interactions and Various Attributes within a Social Media Platform
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15937
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#22270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#27169;&#22411;&#21270;&#21644;&#20998;&#26512;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#20869;&#29992;&#25143;&#20114;&#21160;&#65292;&#25581;&#31034;&#20102;&#27963;&#36291;&#29992;&#25143;&#20043;&#38388;&#30340;&#36830;&#25509;&#27169;&#24335;&#12289;&#23545;&#31038;&#21306;&#21160;&#24577;&#30340;&#36129;&#29486;&#29575;&#20197;&#21450;&#29992;&#25143;&#27963;&#21160;&#19982;&#21463;&#27426;&#36814;&#31243;&#24230;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24086;&#23376;-&#35780;&#35770;&#20851;&#31995;&#30340;&#26032;&#39062;&#22522;&#20110;&#22270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#27169;&#22411;&#21270;&#21644;&#20998;&#26512;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#20869;&#29992;&#25143;&#20114;&#21160;&#65292;&#26500;&#24314;&#29992;&#25143;&#20114;&#21160;&#22270;&#24182;&#20998;&#26512;&#20197;&#28145;&#20837;&#20102;&#35299;&#31038;&#21306;&#21160;&#24577;&#12289;&#29992;&#25143;&#34892;&#20026;&#21644;&#20869;&#23481;&#20559;&#22909;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31038;&#21306;&#20869;56.05%&#30340;&#27963;&#36291;&#29992;&#25143;&#24378;&#36830;&#25509;&#22312;&#19968;&#36215;&#65292;&#20294;&#21482;&#26377;0.8%&#30340;&#29992;&#25143;&#23545;&#20854;&#21160;&#24577;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#31038;&#21306;&#27963;&#21160;&#23384;&#22312;&#26102;&#38388;&#21464;&#21270;&#65292;&#26576;&#20123;&#26102;&#26399;&#32463;&#21382;&#20102;&#26356;&#39640;&#30340;&#21442;&#19982;&#24230;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#21457;&#29616;&#24378;&#35843;&#20102;&#29992;&#25143;&#27963;&#21160;&#19982;&#21463;&#27426;&#36814;&#31243;&#24230;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#34920;&#26126;&#26356;&#27963;&#36291;&#30340;&#29992;&#25143;&#36890;&#24120;&#26356;&#21463;&#27426;&#36814;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15937v1 Announce Type: cross  Abstract: How can we effectively model, analyze, and comprehend user interactions and various attributes within a social media platform based on post-comment relationship? In this study, we propose a novel graph-based approach to model and analyze user interactions within a social media platform based on post-comment relationship. We construct a user interaction graph from social media data and analyze it to gain insights into community dynamics, user behavior, and content preferences. Our investigation reveals that while 56.05% of the active users are strongly connected within the community, only 0.8% of them significantly contribute to its dynamics. Moreover, we observe temporal variations in community activity, with certain periods experiencing heightened engagement. Additionally, our findings highlight a correlation between user activity and popularity showing that more active users are generally more popular. Alongside these, a preference f
&lt;/p&gt;</description></item></channel></rss>