<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27010;&#29575;&#39118;&#21147;&#21457;&#30005;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#29983;&#25104;&#27169;&#22411;&#20272;&#35745;&#29305;&#24449;&#21644;&#30446;&#26631;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#21516;&#26102;&#39044;&#27979;&#25152;&#26377;&#26410;&#30693;&#20540;&#65292;&#36991;&#20813;&#20102;&#39044;&#22788;&#29702;&#29615;&#33410;&#65292;&#22312;&#36830;&#32493;&#25490;&#21517;&#27010;&#29575;&#24471;&#20998;&#26041;&#38754;&#27604;&#20256;&#32479;&#26041;&#27861;&#34920;&#29616;&#26356;&#20248;&#12290;</title><link>https://arxiv.org/abs/2403.03631</link><description>&lt;p&gt;
&#22788;&#29702;&#27010;&#29575;&#39118;&#21147;&#21457;&#30005;&#39044;&#27979;&#20013;&#30340;&#32570;&#22833;&#20540;&#65306;&#19968;&#31181;&#29983;&#25104;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Tackling Missing Values in Probabilistic Wind Power Forecasting: A Generative Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03631
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27010;&#29575;&#39118;&#21147;&#21457;&#30005;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#29983;&#25104;&#27169;&#22411;&#20272;&#35745;&#29305;&#24449;&#21644;&#30446;&#26631;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#21516;&#26102;&#39044;&#27979;&#25152;&#26377;&#26410;&#30693;&#20540;&#65292;&#36991;&#20813;&#20102;&#39044;&#22788;&#29702;&#29615;&#33410;&#65292;&#22312;&#36830;&#32493;&#25490;&#21517;&#27010;&#29575;&#24471;&#20998;&#26041;&#38754;&#27604;&#20256;&#32479;&#26041;&#27861;&#34920;&#29616;&#26356;&#20248;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#24050;&#25104;&#21151;&#24212;&#29992;&#20110;&#27010;&#29575;&#39118;&#21147;&#21457;&#30005;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20256;&#24863;&#22120;&#25925;&#38556;&#31561;&#21407;&#22240;&#23548;&#33268;&#25968;&#25454;&#38598;&#20013;&#23384;&#22312;&#32570;&#22833;&#20540;&#30340;&#38382;&#39064;&#38271;&#26399;&#20197;&#26469;&#34987;&#24573;&#35270;&#12290;&#23613;&#31649;&#36890;&#24120;&#22312;&#27169;&#22411;&#20272;&#35745;&#21644;&#39044;&#27979;&#20043;&#21069;&#36890;&#36807;&#25554;&#34917;&#32570;&#22833;&#20540;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#26159;&#24456;&#33258;&#28982;&#30340;&#65292;&#20294;&#25105;&#20204;&#24314;&#35758;&#23558;&#32570;&#22833;&#20540;&#21644;&#39044;&#27979;&#30446;&#26631;&#35270;&#20026;&#21516;&#31561;&#37325;&#35201;&#65292;&#24182;&#22522;&#20110;&#35266;&#27979;&#20540;&#21516;&#26102;&#39044;&#27979;&#25152;&#26377;&#26410;&#30693;&#20540;&#12290;&#26412;&#25991;&#36890;&#36807;&#22522;&#20110;&#29983;&#25104;&#27169;&#22411;&#20272;&#35745;&#29305;&#24449;&#21644;&#30446;&#26631;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#26080;&#38656;&#39044;&#22788;&#29702;&#65292;&#36991;&#20813;&#24341;&#20837;&#28508;&#22312;&#30340;&#38169;&#35823;&#12290;&#19982;&#20256;&#32479;&#30340;&#8220;&#25554;&#34917;&#65292;&#28982;&#21518;&#39044;&#27979;&#8221;&#27969;&#31243;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#22312;&#36830;&#32493;&#25490;&#21517;&#27010;&#29575;&#24471;&#20998;&#26041;&#38754;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03631v1 Announce Type: new  Abstract: Machine learning techniques have been successfully used in probabilistic wind power forecasting. However, the issue of missing values within datasets due to sensor failure, for instance, has been overlooked for a long time. Although it is natural to consider addressing this issue by imputing missing values before model estimation and forecasting, we suggest treating missing values and forecasting targets indifferently and predicting all unknown values simultaneously based on observations. In this paper, we offer an efficient probabilistic forecasting approach by estimating the joint distribution of features and targets based on a generative model. It is free of preprocessing, and thus avoids introducing potential errors. Compared with the traditional "impute, then predict" pipeline, the proposed approach achieves better performance in terms of continuous ranked probability score.
&lt;/p&gt;</description></item></channel></rss>