<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#35774;&#35745;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#35268;&#21010;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#19981;&#30830;&#23450;&#30340;&#28023;&#27915;&#27915;&#27969;&#20013;&#26368;&#22823;&#21270;&#28023;&#34299;&#29983;&#38271;&#65292;&#36890;&#36807;&#21033;&#29992;&#38750;&#32447;&#24615;&#26102;&#21464;&#30340;&#27915;&#27969;&#23454;&#29616;&#39640;&#29983;&#38271;&#21306;&#22495;&#30340;&#25506;&#27979;&#12290;</title><link>http://arxiv.org/abs/2307.01916</link><description>&lt;p&gt;
&#22312;&#19981;&#30830;&#23450;&#30340;&#28023;&#27915;&#27915;&#27969;&#20013;&#36827;&#34892;&#21160;&#21147;&#32534;&#31243;&#30340;&#26080;&#25928;&#31995;&#32479;&#19978;&#30340;&#33258;&#20027;&#20892;&#22330;&#19978;&#30340;&#28023;&#34299;&#29983;&#38271;&#30340;&#26368;&#22823;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Maximizing Seaweed Growth on Autonomous Farms: A Dynamic Programming Approach for Underactuated Systems Navigating on Uncertain Ocean Currents. (arXiv:2307.01916v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01916
&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#35268;&#21010;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#19981;&#30830;&#23450;&#30340;&#28023;&#27915;&#27915;&#27969;&#20013;&#26368;&#22823;&#21270;&#28023;&#34299;&#29983;&#38271;&#65292;&#36890;&#36807;&#21033;&#29992;&#38750;&#32447;&#24615;&#26102;&#21464;&#30340;&#27915;&#27969;&#23454;&#29616;&#39640;&#29983;&#38271;&#21306;&#22495;&#30340;&#25506;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28023;&#34299;&#29983;&#29289;&#37327;&#22312;&#27668;&#20505;&#20943;&#32531;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#28508;&#21147;&#65292;&#20294;&#38656;&#35201;&#22823;&#35268;&#27169;&#30340;&#33258;&#20027;&#24320;&#25918;&#24335;&#28023;&#27915;&#20892;&#22330;&#26469;&#20805;&#20998;&#21033;&#29992;&#12290;&#36825;&#20123;&#20892;&#22330;&#36890;&#24120;&#20855;&#26377;&#20302;&#25512;&#36827;&#21147;&#65292;&#24182;&#21463;&#21040;&#28023;&#27915;&#27915;&#27969;&#30340;&#37325;&#22823;&#24433;&#21709;&#12290;&#25105;&#20204;&#24076;&#26395;&#35774;&#35745;&#19968;&#20010;&#25511;&#21046;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#38750;&#32447;&#24615;&#26102;&#21464;&#30340;&#28023;&#27915;&#27915;&#27969;&#26469;&#36798;&#21040;&#39640;&#29983;&#38271;&#21306;&#22495;&#65292;&#20174;&#32780;&#22312;&#20960;&#20010;&#26376;&#20869;&#26368;&#22823;&#21270;&#28023;&#34299;&#29983;&#38271;&#12290;&#22797;&#26434;&#30340;&#21160;&#21147;&#23398;&#21644;&#26080;&#25928;&#24615;&#20351;&#24471;&#21363;&#20351;&#30693;&#36947;&#27915;&#27969;&#24773;&#20917;&#65292;&#36825;&#20063;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#24403;&#21482;&#26377;&#30701;&#26399;&#19981;&#23436;&#21892;&#30340;&#39044;&#27979;&#19988;&#19981;&#30830;&#23450;&#24615;&#36880;&#28176;&#22686;&#22823;&#26102;&#65292;&#24773;&#20917;&#21464;&#24471;&#26356;&#21152;&#22256;&#38590;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21160;&#24577;&#35268;&#21010;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#24050;&#30693;&#30495;&#23454;&#27915;&#27969;&#24773;&#20917;&#26102;&#26377;&#25928;&#22320;&#27714;&#35299;&#26368;&#20248;&#29983;&#38271;&#20540;&#20989;&#25968;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19977;&#20010;&#25193;&#23637;&#65292;&#21363;&#22312;&#29616;&#23454;&#20013;&#21482;&#30693;&#36947;&#39044;&#27979;&#30340;&#24773;&#20917;&#19979;&#65306;&#65288;1&#65289;&#25105;&#20204;&#26041;&#27861;&#24471;&#21040;&#30340;&#20540;&#20989;&#25968;&#21487;&#20197;&#20316;&#20026;&#21453;&#39304;&#31574;&#30053;&#65292;&#20197;&#33719;&#24471;&#25152;&#26377;&#29366;&#24577;&#21644;&#26102;&#38388;&#30340;&#26368;&#20339;&#29983;&#38271;&#25511;&#21046;&#65292;&#23454;&#29616;&#38381;&#29615;&#25511;&#21046;&#30340;&#31561;&#20215;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Seaweed biomass offers significant potential for climate mitigation, but large-scale, autonomous open-ocean farms are required to fully exploit it. Such farms typically have low propulsion and are heavily influenced by ocean currents. We want to design a controller that maximizes seaweed growth over months by taking advantage of the non-linear time-varying ocean currents for reaching high-growth regions. The complex dynamics and underactuation make this challenging even when the currents are known. This is even harder when only short-term imperfect forecasts with increasing uncertainty are available. We propose a dynamic programming-based method to efficiently solve for the optimal growth value function when true currents are known. We additionally present three extensions when as in reality only forecasts are known: (1) our methods resulting value function can be used as feedback policy to obtain the growth-optimal control for all states and times, allowing closed-loop control equival
&lt;/p&gt;</description></item></channel></rss>