<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>DEEP-IoT&#36890;&#36807;&#8220;&#26356;&#22810;&#30417;&#21548;&#65292;&#26356;&#23569;&#20256;&#36755;&#8221;&#30340;&#31574;&#30053;&#65292;&#25361;&#25112;&#21644;&#36716;&#21464;&#20102;&#20256;&#32479;&#30340;&#29289;&#32852;&#32593;&#36890;&#20449;&#27169;&#22411;&#65292;&#22823;&#24133;&#38477;&#20302;&#33021;&#32791;&#24182;&#25552;&#39640;&#35774;&#22791;&#23551;&#21629;&#12290;</title><link>https://arxiv.org/abs/2403.00321</link><description>&lt;p&gt;
DEEP-IoT: &#19979;&#34892;&#22686;&#24378;&#22411;&#39640;&#25928;&#33021;&#29289;&#32852;&#32593;
&lt;/p&gt;
&lt;p&gt;
DEEP-IoT: Downlink-Enhanced Efficient-Power Internet of Things
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00321
&lt;/p&gt;
&lt;p&gt;
DEEP-IoT&#36890;&#36807;&#8220;&#26356;&#22810;&#30417;&#21548;&#65292;&#26356;&#23569;&#20256;&#36755;&#8221;&#30340;&#31574;&#30053;&#65292;&#25361;&#25112;&#21644;&#36716;&#21464;&#20102;&#20256;&#32479;&#30340;&#29289;&#32852;&#32593;&#36890;&#20449;&#27169;&#22411;&#65292;&#22823;&#24133;&#38477;&#20302;&#33021;&#32791;&#24182;&#25552;&#39640;&#35774;&#22791;&#23551;&#21629;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;DEEP-IoT&#65292;&#36825;&#26159;&#19968;&#31181;&#20855;&#26377;&#38761;&#21629;&#24847;&#20041;&#30340;&#36890;&#20449;&#33539;&#20363;&#65292;&#26088;&#22312;&#37325;&#26032;&#23450;&#20041;&#29289;&#32852;&#32593;&#35774;&#22791;&#20043;&#38388;&#30340;&#36890;&#20449;&#26041;&#24335;&#12290;&#36890;&#36807;&#24320;&#21019;&#24615;&#30340;&#8220;&#26356;&#22810;&#30417;&#21548;&#65292;&#26356;&#23569;&#20256;&#36755;&#8221;&#30340;&#31574;&#30053;&#65292;DEEP-IoT&#25361;&#25112;&#21644;&#36716;&#21464;&#20102;&#20256;&#32479;&#30340;&#21457;&#36865;&#26041;&#65288;&#29289;&#32852;&#32593;&#35774;&#22791;&#65289;&#20026;&#20013;&#24515;&#30340;&#36890;&#20449;&#27169;&#22411;&#65292;&#23558;&#25509;&#25910;&#26041;&#65288;&#25509;&#20837;&#28857;&#65289;&#20316;&#20026;&#20851;&#38190;&#35282;&#33394;&#65292;&#20174;&#32780;&#38477;&#20302;&#33021;&#32791;&#24182;&#24310;&#38271;&#35774;&#22791;&#23551;&#21629;&#12290;&#25105;&#20204;&#19981;&#20165;&#27010;&#24565;&#21270;&#20102;DEEP-IoT&#65292;&#36824;&#36890;&#36807;&#22312;&#31364;&#24102;&#31995;&#32479;&#20013;&#38598;&#25104;&#28145;&#24230;&#23398;&#20064;&#22686;&#24378;&#30340;&#21453;&#39304;&#20449;&#36947;&#32534;&#30721;&#26469;&#23454;&#29616;&#23427;&#12290;&#27169;&#25311;&#32467;&#26524;&#26174;&#31034;&#65292;IoT&#21333;&#20803;&#30340;&#36816;&#34892;&#23551;&#21629;&#26174;&#33879;&#25552;&#39640;&#65292;&#27604;&#20351;&#29992;Turbo&#21644;Polar&#32534;&#30721;&#30340;&#20256;&#32479;&#31995;&#32479;&#25552;&#39640;&#20102;&#26368;&#22810;52.71%&#12290;&#36825;&#19968;&#36827;&#23637;&#26631;&#24535;&#30528;&#19968;&#31181;&#21464;&#38761;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00321v1 Announce Type: cross  Abstract: At the heart of the Internet of Things (IoT) -- a domain witnessing explosive growth -- the imperative for energy efficiency and the extension of device lifespans has never been more pressing. This paper presents DEEP-IoT, a revolutionary communication paradigm poised to redefine how IoT devices communicate. Through a pioneering "listen more, transmit less" strategy, DEEP-IoT challenges and transforms the traditional transmitter (IoT devices)-centric communication model to one where the receiver (the access point) play a pivotal role, thereby cutting down energy use and boosting device longevity. We not only conceptualize DEEP-IoT but also actualize it by integrating deep learning-enhanced feedback channel codes within a narrow-band system. Simulation results show a significant enhancement in the operational lifespan of IoT cells -- surpassing traditional systems using Turbo and Polar codes by up to 52.71%. This leap signifies a paradi
&lt;/p&gt;</description></item></channel></rss>