<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20248;&#21270;&#32858;&#21512;&#28789;&#27963;&#24615;&#25552;&#20379;&#31574;&#30053;&#21644;&#35780;&#20272;HVAC&#31995;&#32479;&#30340;&#20998;&#25955;&#28789;&#27963;&#24615;&#25552;&#20379;&#65292;&#20026;&#32858;&#21512;&#22120;&#22312;&#21487;&#20877;&#29983;&#33021;&#28304;&#19981;&#30830;&#23450;&#24615;&#19979;&#23454;&#29616;&#38656;&#27714;&#21709;&#24212;&#25552;&#20379;&#20102;&#23454;&#29992;&#24037;&#20855;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#31283;&#20581;&#30340;&#33073;&#30899;&#21644;&#22686;&#24378;&#33021;&#28304;&#31995;&#32479;&#30340;&#38887;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.10726</link><description>&lt;p&gt;
&#29992;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#23454;&#29992;&#24037;&#20855;&#22686;&#24378;&#32858;&#21512;&#22120;&#33021;&#21147;&#65306;&#21033;&#29992;&#32858;&#21512;&#19982;&#20998;&#25955;&#30340;&#28789;&#27963;&#24615;&#23454;&#29616;&#38656;&#27714;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Empowering Aggregators with Practical Data-Driven Tools: Harnessing Aggregated and Disaggregated Flexibility for Demand Response. (arXiv:2401.10726v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10726
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20248;&#21270;&#32858;&#21512;&#28789;&#27963;&#24615;&#25552;&#20379;&#31574;&#30053;&#21644;&#35780;&#20272;HVAC&#31995;&#32479;&#30340;&#20998;&#25955;&#28789;&#27963;&#24615;&#25552;&#20379;&#65292;&#20026;&#32858;&#21512;&#22120;&#22312;&#21487;&#20877;&#29983;&#33021;&#28304;&#19981;&#30830;&#23450;&#24615;&#19979;&#23454;&#29616;&#38656;&#27714;&#21709;&#24212;&#25552;&#20379;&#20102;&#23454;&#29992;&#24037;&#20855;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#31283;&#20581;&#30340;&#33073;&#30899;&#21644;&#22686;&#24378;&#33021;&#28304;&#31995;&#32479;&#30340;&#38887;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#21487;&#20877;&#29983;&#33021;&#28304;&#24102;&#26469;&#19981;&#30830;&#23450;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#32858;&#21512;&#22120;&#21644;&#24314;&#31569;&#29289;&#23621;&#20303;&#32773;&#36890;&#36807;&#38656;&#27714;&#21709;&#24212;&#65288;DR&#65289;&#26041;&#26696;&#28608;&#27963;&#28789;&#27963;&#24615;&#30340;&#20851;&#38190;&#30456;&#20114;&#20316;&#29992;&#65292;&#30528;&#37325;&#20110;&#23454;&#29616;&#31283;&#20581;&#30340;&#33073;&#30899;&#21644;&#22686;&#24378;&#33021;&#28304;&#31995;&#32479;&#30340;&#38887;&#24615;&#12290;&#39318;&#20808;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#22312;&#25968;&#25454;&#26377;&#38480;&#30340;&#29615;&#22659;&#20013;&#20248;&#21270;&#32858;&#21512;&#28789;&#27963;&#24615;&#25552;&#20379;&#31574;&#30053;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#31163;&#25955;&#20613;&#37324;&#21494;&#21464;&#25442;&#65288;DFT&#65289;&#21644;&#32858;&#31867;&#25216;&#26415;&#35782;&#21035;&#24314;&#31569;&#29289;&#23621;&#27665;&#30340;&#27963;&#21160;&#27169;&#24335;&#12290;&#20854;&#27425;&#65292;&#30740;&#31350;&#35780;&#20272;&#20102;DR&#20107;&#20214;&#26399;&#38388;&#20379;&#28909;&#36890;&#39118;&#31354;&#35843;&#65288;HVAC&#65289;&#31995;&#32479;&#30340;&#20998;&#25955;&#28789;&#27963;&#24615;&#25552;&#20379;&#65292;&#37319;&#29992;&#26426;&#22120;&#23398;&#20064;&#21644;&#20248;&#21270;&#25216;&#26415;&#36827;&#34892;&#31934;&#30830;&#30340;&#35774;&#22791;&#32423;&#20998;&#26512;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#20026;&#32858;&#21512;&#22120;&#22312;&#25972;&#20010;&#24314;&#31569;&#29289;&#28040;&#36153;&#20165;&#26377;&#19968;&#20010;&#26234;&#33021;&#30005;&#34920;&#30340;&#29615;&#22659;&#20013;&#25552;&#20379;&#28789;&#27963;&#24615;&#26381;&#21153;&#25552;&#20379;&#20102;&#19968;&#26465;&#38750;&#20405;&#20837;&#24615;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study explores the crucial interplay between aggregators and building occupants in activating flexibility through Demand Response (DR) programs, with a keen focus on achieving robust decarbonization and fortifying the resilience of the energy system amidst the uncertainties presented by Renewable Energy Sources (RES). Firstly, it introduces a methodology of optimizing aggregated flexibility provision strategies in environments with limited data, utilizing Discrete Fourier Transformation (DFT) and clustering techniques to identify building occupant's activity patterns. Secondly, the study assesses the disaggregated flexibility provision of Heating Ventilation and Air Conditioning (HVAC) systems during DR events, employing machine learning and optimization techniques for precise, device-level analysis. The first approach offers a non-intrusive pathway for aggregators to provide flexibility services in environments of a single smart meter for the whole building's consumption, while t
&lt;/p&gt;</description></item></channel></rss>