<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#25552;&#20986;&#20102;&#22312;&#32447;&#20048;&#35266;&#29275;&#39039;&#27969;&#24418;&#65288;OONM&#65289;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#22522;&#20110;&#20989;&#25968;&#24207;&#21015;&#30340;&#31532;&#19968;&#21644;&#31532;&#20108;&#38454;&#20449;&#24687;&#39044;&#27979;&#30340;&#22312;&#32447;&#25511;&#21046;&#22120;&#65292;&#29992;&#20110;&#22312;&#32447;LQG&#32447;&#24615;&#32422;&#26463;&#25919;&#31574;&#20248;&#21270;&#12290;</title><link>https://arxiv.org/abs/2403.08553</link><description>&lt;p&gt;
&#22312;&#32447;LQG&#32447;&#24615;&#32422;&#26463;&#25919;&#31574;&#20248;&#21270;&#30340;&#36951;&#25022;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Regret Analysis of Policy Optimization over Submanifolds for Linearly Constrained Online LQG
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08553
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22312;&#32447;&#20048;&#35266;&#29275;&#39039;&#27969;&#24418;&#65288;OONM&#65289;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#22522;&#20110;&#20989;&#25968;&#24207;&#21015;&#30340;&#31532;&#19968;&#21644;&#31532;&#20108;&#38454;&#20449;&#24687;&#39044;&#27979;&#30340;&#22312;&#32447;&#25511;&#21046;&#22120;&#65292;&#29992;&#20110;&#22312;&#32447;LQG&#32447;&#24615;&#32422;&#26463;&#25919;&#31574;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32447;&#20248;&#21270;&#21644;&#25511;&#21046;&#30340;&#26368;&#26032;&#36827;&#23637;&#20026;&#30740;&#31350;&#22312;&#32447;&#32447;&#24615;&#20108;&#27425;&#35843;&#33410;&#22120;&#65288;LQR&#65289;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#24037;&#20855;&#65292;&#20854;&#20013;&#25104;&#26412;&#30697;&#38453;&#38543;&#26102;&#38388;&#21464;&#21270;&#23545;&#25239;&#24615;&#21464;&#21270;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#20316;&#21697;&#30340;&#25511;&#21046;&#22120;&#21442;&#25968;&#21270;&#21487;&#33021;&#19981;&#28385;&#36275;&#23454;&#38469;&#26465;&#20214;&#65292;&#22914;&#30001;&#20110;&#29289;&#29702;&#36830;&#25509;&#32780;&#23548;&#33268;&#30340;&#31232;&#30095;&#24615;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#32447;&#32447;&#24615;&#20108;&#27425;&#39640;&#26031;&#38382;&#39064;&#65292;&#20854;&#20013;&#23545;&#25511;&#21046;&#22120;&#26045;&#21152;&#20102;&#32473;&#23450;&#30340;&#32447;&#24615;&#32422;&#26463;&#12290;&#21463;[1]&#26368;&#36817;&#25552;&#20986;&#30340;&#20851;&#20110;&#32447;&#24615;&#32422;&#26463;&#30340;&#32447;&#19979;LQR&#25919;&#31574;&#20248;&#21270;&#30340;&#21551;&#21457;&#65292;&#35813;&#26041;&#27861;&#25552;&#20986;&#20102;&#19968;&#20010;&#20108;&#38454;&#26041;&#27861;&#65292;&#37197;&#22791;&#20102;&#19968;&#31181;&#22312;&#26368;&#20248;&#25511;&#21046;&#38382;&#39064;&#30340;&#32972;&#26223;&#19979;&#33258;&#28982;&#20135;&#29983;&#30340;&#40654;&#26364;&#24230;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22312;&#32447;&#20048;&#35266;&#29275;&#39039;&#27969;&#24418;&#65288;OONM&#65289;&#65292;&#25552;&#20379;&#22522;&#20110;&#20989;&#25968;&#24207;&#21015;&#30340;&#31532;&#19968;&#21644;&#31532;&#20108;&#38454;&#20449;&#24687;&#39044;&#27979;&#30340;&#22312;&#32447;&#25511;&#21046;&#22120;&#12290;&#20026;&#20102;&#37327;&#21270;&#25552;&#20986;&#30340;&#31639;&#27861;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#36951;&#25022;&#30340;&#27010;&#24565;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08553v1 Announce Type: cross  Abstract: Recent advancement in online optimization and control has provided novel tools to study online linear quadratic regulator (LQR) problems, where cost matrices are varying adversarially over time. However, the controller parameterization of existing works may not satisfy practical conditions like sparsity due to physical connections. In this work, we study online linear quadratic Gaussian problems with a given linear constraint imposed on the controller. Inspired by the recent work of [1] which proposed, for a linearly constrained policy optimization of an offline LQR, a second order method equipped with a Riemannian metric that emerges naturally in the context of optimal control problems, we propose online optimistic Newton on manifold (OONM) which provides an online controller based on the prediction on the first and second order information of the function sequence. To quantify the proposed algorithm, we leverage the notion of regret 
&lt;/p&gt;</description></item></channel></rss>