<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;A-KIT&#65292;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Kalman-informed transformer&#65292;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#20256;&#24863;&#22120;&#34701;&#21512;&#20013;&#21464;&#21270;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#12290;&#23427;&#36890;&#36807;&#36866;&#24212;&#23454;&#38469;&#24773;&#20917;&#20013;&#30340;&#36807;&#31243;&#22122;&#22768;&#21464;&#21270;&#65292;&#25913;&#36827;&#20102;&#20272;&#35745;&#29366;&#24577;&#30340;&#20934;&#30830;&#24615;&#65292;&#36991;&#20813;&#20102;&#28388;&#27874;&#22120;&#21457;&#25955;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.09987</link><description>&lt;p&gt;
A-KIT:&#33258;&#36866;&#24212;Kalman-Informed Transformer
&lt;/p&gt;
&lt;p&gt;
A-KIT: Adaptive Kalman-Informed Transformer. (arXiv:2401.09987v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09987
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;A-KIT&#65292;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Kalman-informed transformer&#65292;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#20256;&#24863;&#22120;&#34701;&#21512;&#20013;&#21464;&#21270;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#12290;&#23427;&#36890;&#36807;&#36866;&#24212;&#23454;&#38469;&#24773;&#20917;&#20013;&#30340;&#36807;&#31243;&#22122;&#22768;&#21464;&#21270;&#65292;&#25913;&#36827;&#20102;&#20272;&#35745;&#29366;&#24577;&#30340;&#20934;&#30830;&#24615;&#65292;&#36991;&#20813;&#20102;&#28388;&#27874;&#22120;&#21457;&#25955;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#23637;&#21345;&#23572;&#26364;&#28388;&#27874;&#22120;(EKF)&#26159;&#23548;&#33322;&#24212;&#29992;&#20013;&#24191;&#27867;&#37319;&#29992;&#30340;&#20256;&#24863;&#22120;&#34701;&#21512;&#26041;&#27861;&#12290;EKF&#30340;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#26159;&#22312;&#32447;&#30830;&#23450;&#21453;&#26144;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#23613;&#31649;&#24120;&#35265;&#30340;EKF&#23454;&#29616;&#20551;&#35774;&#36807;&#31243;&#22122;&#22768;&#26159;&#24658;&#23450;&#30340;&#65292;&#20294;&#22312;&#23454;&#38469;&#24773;&#20917;&#20013;&#65292;&#36807;&#31243;&#22122;&#22768;&#26159;&#21464;&#21270;&#30340;&#65292;&#23548;&#33268;&#20272;&#35745;&#29366;&#24577;&#30340;&#19981;&#20934;&#30830;&#65292;&#24182;&#21487;&#33021;&#23548;&#33268;&#28388;&#27874;&#22120;&#21457;&#25955;&#12290;&#20026;&#20102;&#24212;&#23545;&#36825;&#31181;&#24773;&#20917;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#27169;&#22411;&#30340;&#33258;&#36866;&#24212;EKF&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#24615;&#33021;&#25913;&#36827;&#65292;&#20984;&#26174;&#20102;&#23545;&#31283;&#20581;&#33258;&#36866;&#24212;&#26041;&#27861;&#30340;&#38656;&#27714;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25512;&#23548;&#24182;&#24341;&#20837;&#20102;A-KIT&#65292;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Kalman-informed transformer&#65292;&#29992;&#20110;&#22312;&#32447;&#23398;&#20064;&#21464;&#21270;&#30340;&#36807;&#31243;&#22122;&#22768;&#21327;&#26041;&#24046;&#12290;A-KIT&#26694;&#26550;&#36866;&#29992;&#20110;&#20219;&#20309;&#31867;&#22411;&#30340;&#20256;&#24863;&#22120;&#34701;&#21512;&#12290;&#25105;&#20204;&#22312;&#36825;&#37324;&#20171;&#32461;&#20102;&#22522;&#20110;&#24815;&#24615;&#23548;&#33322;&#31995;&#32479;&#21644;&#22810;&#26222;&#21202;&#36895;&#24230;&#26085;&#24535;&#30340;&#38750;&#32447;&#24615;&#20256;&#24863;&#22120;&#34701;&#21512;&#26041;&#27861;&#12290;&#36890;&#36807;&#20351;&#29992;&#26469;&#33258;&#33258;&#20027;&#26080;&#20154;&#28508;&#27700;&#22120;&#30340;&#30495;&#23454;&#35760;&#24405;&#25968;&#25454;&#65292;&#25105;&#20204;&#39564;&#35777;&#20102;A-KIT&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The extended Kalman filter (EKF) is a widely adopted method for sensor fusion in navigation applications. A crucial aspect of the EKF is the online determination of the process noise covariance matrix reflecting the model uncertainty. While common EKF implementation assumes a constant process noise, in real-world scenarios, the process noise varies, leading to inaccuracies in the estimated state and potentially causing the filter to diverge. To cope with such situations, model-based adaptive EKF methods were proposed and demonstrated performance improvements, highlighting the need for a robust adaptive approach. In this paper, we derive and introduce A-KIT, an adaptive Kalman-informed transformer to learn the varying process noise covariance online. The A-KIT framework is applicable to any type of sensor fusion. Here, we present our approach to nonlinear sensor fusion based on an inertial navigation system and Doppler velocity log. By employing real recorded data from an autonomous und
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#26234;&#33021;&#24211;&#23384;&#31649;&#29702;&#31995;&#32479;&#65292;&#36890;&#36807;&#32467;&#21512;&#26465;&#30721;&#21644;&#20998;&#24067;&#24335;flutter&#24212;&#29992;&#25216;&#26415;&#65292;&#20197;&#21450;&#22823;&#25968;&#25454;&#20998;&#26512;&#23454;&#29616;&#25968;&#25454;&#39537;&#21160;&#30340;&#20915;&#31574;&#65292;&#35299;&#20915;&#20102;&#24211;&#23384;&#31649;&#29702;&#20013;&#30340;&#20934;&#30830;&#24615;&#12289;&#30417;&#27979;&#24310;&#36831;&#21644;&#36807;&#24230;&#20381;&#36182;&#20027;&#35266;&#32463;&#39564;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2309.12365</link><description>&lt;p&gt;
&#19968;&#20010;&#39640;&#25928;&#30340;&#26234;&#33021;&#21322;&#33258;&#21160;&#20179;&#24211;&#24211;&#23384;&#30424;&#28857;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
An Efficient Intelligent Semi-Automated Warehouse Inventory Stocktaking System. (arXiv:2309.12365v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12365
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#26234;&#33021;&#24211;&#23384;&#31649;&#29702;&#31995;&#32479;&#65292;&#36890;&#36807;&#32467;&#21512;&#26465;&#30721;&#21644;&#20998;&#24067;&#24335;flutter&#24212;&#29992;&#25216;&#26415;&#65292;&#20197;&#21450;&#22823;&#25968;&#25454;&#20998;&#26512;&#23454;&#29616;&#25968;&#25454;&#39537;&#21160;&#30340;&#20915;&#31574;&#65292;&#35299;&#20915;&#20102;&#24211;&#23384;&#31649;&#29702;&#20013;&#30340;&#20934;&#30830;&#24615;&#12289;&#30417;&#27979;&#24310;&#36831;&#21644;&#36807;&#24230;&#20381;&#36182;&#20027;&#35266;&#32463;&#39564;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19981;&#26029;&#21457;&#23637;&#30340;&#20379;&#24212;&#38142;&#31649;&#29702;&#32972;&#26223;&#19979;&#65292;&#39640;&#25928;&#30340;&#24211;&#23384;&#31649;&#29702;&#23545;&#20110;&#20225;&#19994;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#30340;&#25163;&#24037;&#21644;&#32463;&#39564;&#39537;&#21160;&#30340;&#26041;&#27861;&#24448;&#24448;&#38590;&#20197;&#28385;&#36275;&#29616;&#20195;&#24066;&#22330;&#38656;&#27714;&#30340;&#22797;&#26434;&#24615;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26234;&#33021;&#24211;&#23384;&#31649;&#29702;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#19982;&#25968;&#25454;&#19981;&#20934;&#30830;&#12289;&#30417;&#27979;&#24310;&#36831;&#21644;&#36807;&#24230;&#20381;&#36182;&#20027;&#35266;&#32463;&#39564;&#30340;&#39044;&#27979;&#30456;&#20851;&#30340;&#25361;&#25112;&#12290;&#35813;&#31995;&#32479;&#32467;&#21512;&#20102;&#26465;&#30721;&#21644;&#20998;&#24067;&#24335; flutter &#24212;&#29992;&#25216;&#26415;&#65292;&#29992;&#20110;&#26234;&#33021;&#24863;&#30693;&#65292;&#24182;&#36890;&#36807;&#20840;&#38754;&#30340;&#22823;&#25968;&#25454;&#20998;&#26512;&#23454;&#29616;&#25968;&#25454;&#39537;&#21160;&#30340;&#20915;&#31574;&#12290;&#36890;&#36807;&#20180;&#32454;&#30340;&#20998;&#26512;&#12289;&#31995;&#32479;&#35774;&#35745;&#12289;&#20851;&#38190;&#25216;&#26415;&#25506;&#32034;&#21644;&#27169;&#25311;&#39564;&#35777;&#65292;&#25104;&#21151;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#12290;&#35813;&#26234;&#33021;&#31995;&#32479;&#23454;&#29616;&#20102;&#20108;&#32423;&#30417;&#27979;&#12289;&#39640;&#39057;&#26816;&#26597;&#21644;&#20154;&#24037;&#26234;&#33021;&#39537;&#21160;&#30340;&#39044;&#27979;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#33258;&#21160;&#21270;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the context of evolving supply chain management, the significance of efficient inventory management has grown substantially for businesses. However, conventional manual and experience-based approaches often struggle to meet the complexities of modern market demands. This research introduces an intelligent inventory management system to address challenges related to inaccurate data, delayed monitoring, and overreliance on subjective experience in forecasting. The proposed system integrates bar code and distributed flutter application technologies for intelligent perception, alongside comprehensive big data analytics to enable data-driven decision-making. Through meticulous analysis, system design, critical technology exploration, and simulation validation, the effectiveness of the proposed system is successfully demonstrated. The intelligent system facilitates second-level monitoring, high-frequency checks, and artificial intelligence-driven forecasting, consequently enhancing the au
&lt;/p&gt;</description></item></channel></rss>