<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#36890;&#36807;&#22240;&#26524;&#24178;&#39044;&#26694;&#26550;&#65292;&#35780;&#20272;&#31227;&#21160;&#22240;&#32032;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#24433;&#21709;&#65292;&#20135;&#29983;&#20855;&#26377;&#19981;&#21516;&#31227;&#21160;&#34892;&#20026;&#30340;&#20301;&#32622;&#24207;&#21015;&#65292;&#26377;&#21161;&#20110;&#29702;&#35299;&#21644;&#35299;&#37322;&#39044;&#27979;&#32593;&#32476;&#12290;</title><link>https://arxiv.org/abs/2311.11749</link><description>&lt;p&gt;
&#36890;&#36807;&#22240;&#26524;&#24178;&#39044;&#25581;&#31034;&#34892;&#20026;&#23545;&#31227;&#21160;&#39044;&#27979;&#32593;&#32476;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Revealing behavioral impact on mobility prediction networks through causal interventions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.11749
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22240;&#26524;&#24178;&#39044;&#26694;&#26550;&#65292;&#35780;&#20272;&#31227;&#21160;&#22240;&#32032;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#24433;&#21709;&#65292;&#20135;&#29983;&#20855;&#26377;&#19981;&#21516;&#31227;&#21160;&#34892;&#20026;&#30340;&#20301;&#32622;&#24207;&#21015;&#65292;&#26377;&#21161;&#20110;&#29702;&#35299;&#21644;&#35299;&#37322;&#39044;&#27979;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#22312;&#31227;&#21160;&#24615;&#39044;&#27979;&#20219;&#21153;&#20013;&#34987;&#36234;&#26469;&#36234;&#24191;&#27867;&#22320;&#20351;&#29992;&#65292;&#28982;&#32780;&#23427;&#20204;&#22797;&#26434;&#30340;&#20869;&#37096;&#36816;&#20316;&#26041;&#24335;&#32473;&#21487;&#35299;&#37322;&#24615;&#24102;&#26469;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#22312;&#29702;&#35299;&#21508;&#31181;&#31227;&#21160;&#34892;&#20026;&#22914;&#20309;&#24433;&#21709;&#39044;&#27979;&#26041;&#38754;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#20010;&#22240;&#26524;&#24178;&#39044;&#26694;&#26550;&#65292;&#35780;&#20272;&#19982;&#19979;&#19968;&#20010;&#20301;&#32622;&#39044;&#27979;&#30456;&#20851;&#30340;&#31227;&#21160;&#22240;&#32032;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#24433;&#21709; -- &#36825;&#26159;&#19968;&#39033;&#19987;&#27880;&#20110;&#39044;&#27979;&#20010;&#20307;&#21363;&#23558;&#21040;&#36798;&#20301;&#32622;&#30340;&#20219;&#21153;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#31227;&#21160;&#27169;&#22411;&#29983;&#25104;&#21512;&#25104;&#20301;&#32622;&#35775;&#38382;&#24207;&#21015;&#65292;&#24182;&#36890;&#36807;&#24178;&#39044;&#23427;&#20204;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#26469;&#25511;&#21046;&#34892;&#20026;&#21160;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;&#31227;&#21160;&#25351;&#26631;&#35780;&#20272;&#24178;&#39044;&#20301;&#32622;&#24207;&#21015;&#65292;&#24182;&#23558;&#20854;&#36755;&#20837;&#21040;&#35757;&#32451;&#33391;&#22909;&#30340;&#32593;&#32476;&#20013;&#20197;&#20998;&#26512;&#24615;&#33021;&#21464;&#21270;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20135;&#29983;&#20855;&#26377;&#19981;&#21516;&#31227;&#21160;&#34892;&#20026;&#30340;&#20301;&#32622;&#24207;&#21015;&#30340;&#26377;&#25928;&#24615;&#65292;&#20174;&#32780;&#20419;&#36827;&#20102;&#39044;&#27979;&#32593;&#32476;&#30340;&#29702;&#35299;&#21644;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.11749v2 Announce Type: replace-cross  Abstract: Deep neural networks are increasingly utilized in mobility prediction tasks, yet their intricate internal workings pose challenges for interpretability, especially in comprehending how various aspects of mobility behavior affect predictions. This study introduces a causal intervention framework to assess the impact of mobility-related factors on neural networks designed for next location prediction -- a task focusing on predicting the immediate next location of an individual. To achieve this, we employ individual mobility models to generate synthetic location visit sequences and control behavior dynamics by intervening in their data generation process. We evaluate the interventional location sequences using mobility metrics and input them into well-trained networks to analyze performance variations. The results demonstrate the effectiveness in producing location sequences with distinct mobility behaviors, thereby facilitating t
&lt;/p&gt;</description></item><item><title>DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#23545;&#27431;&#30431;&#20843;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#21069;100&#22825;&#25552;&#20132;&#30340;&#23457;&#26680;&#34892;&#21160;&#25968;&#25454;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#36825;&#20123;&#24179;&#21488;&#22312;&#23457;&#26680;&#34892;&#21160;&#26041;&#38754;&#30340;&#37096;&#20998;&#36981;&#24490;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2312.10269</link><description>&lt;p&gt;
DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#65306;&#31038;&#20132;&#23186;&#20307;&#33258;&#25105;&#25253;&#21578;&#30340;&#23457;&#26680;&#34892;&#21160;
&lt;/p&gt;
&lt;p&gt;
The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media. (arXiv:2312.10269v2 [cs.SI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.10269
&lt;/p&gt;
&lt;p&gt;
DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#23545;&#27431;&#30431;&#20843;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#21069;100&#22825;&#25552;&#20132;&#30340;&#23457;&#26680;&#34892;&#21160;&#25968;&#25454;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#36825;&#20123;&#24179;&#21488;&#22312;&#23457;&#26680;&#34892;&#21160;&#26041;&#38754;&#30340;&#37096;&#20998;&#36981;&#24490;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;2023&#24180;9&#26376;&#24320;&#22987;&#65292;&#25968;&#23383;&#26381;&#21153;&#27861;&#26696;(DSA)&#35201;&#27714;&#22823;&#22411;&#22312;&#32447;&#24179;&#21488;&#21521;DSA&#36879;&#26126;&#25968;&#25454;&#24211;&#25552;&#20132;&#20851;&#20110;&#20182;&#20204;&#22312;&#27431;&#30431;&#20869;&#37319;&#21462;&#30340;&#27599;&#20010;&#23457;&#26680;&#34892;&#21160;&#30340;&#35814;&#32454;&#25968;&#25454;&#12290;&#20174;&#19968;&#24320;&#22987;&#65292;&#36825;&#20010;&#38598;&#20013;&#24335;&#25968;&#25454;&#24211;&#23601;&#24341;&#36215;&#20102;&#23398;&#26415;&#30028;&#30340;&#20852;&#36259;&#65292;&#22240;&#20026;&#23427;&#26159;&#29616;&#23454;&#19990;&#30028;&#22312;&#32447;&#23457;&#26680;&#25968;&#25454;&#30340;&#19968;&#20010;&#21069;&#25152;&#26410;&#26377;&#30340;&#12289;&#21487;&#33021;&#26159;&#29420;&#29305;&#30340;&#23453;&#24211;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#28145;&#20837;&#20998;&#26512;&#20102;&#27431;&#30431;&#20843;&#20010;&#26368;&#22823;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#22312;&#25968;&#25454;&#24211;&#30340;&#21069;100&#22825;&#25552;&#20132;&#30340;&#25152;&#26377;3.53&#20159;&#26465;&#35760;&#24405;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23545;&#24179;&#21488;&#20043;&#38388;&#36827;&#34892;&#20102;&#27604;&#36739;&#30740;&#31350;&#65292;&#21253;&#25324;&#65306;&#23457;&#26680;&#34892;&#21160;&#30340;&#25968;&#37327;&#12289;&#20915;&#31574;&#20381;&#25454;&#12289;&#24212;&#29992;&#30340;&#38480;&#21046;&#31867;&#22411;&#12289;&#23457;&#26680;&#20869;&#23481;&#31867;&#22411;&#12289;&#23457;&#26680;&#34892;&#21160;&#30340;&#21450;&#26102;&#24615;&#21644;&#25552;&#20132;&#24773;&#20917;&#65292;&#20197;&#21450;&#20351;&#29992;&#30340;&#33258;&#21160;&#21270;&#31243;&#24230;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#31995;&#32479;&#22320;&#19982;&#24179;&#21488;&#33258;&#24049;&#30340;&#36879;&#26126;&#25253;&#21578;&#36827;&#34892;&#20102;&#20869;&#23481;&#20132;&#21449;&#26816;&#26597;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20197;&#19979;&#32467;&#26524;&#12290;(i)&#24179;&#21488;&#21482;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#36981;&#24490;&#20102;&#23457;&#26680;&#34892;&#21160;&#30340;&#21746;&#23398;&#21644;&#26041;&#27861;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since September 2023, the Digital Services Act (DSA) obliges large online platforms to submit detailed data on each moderation action they take within the European Union (EU) to the DSA Transparency Database. From its inception, this centralized database has sparked scholarly interest as an unprecedented and potentially unique trove of data on real-world online moderation. Here, we thoroughly analyze all 353.12M records submitted by the eight largest social media platforms in the EU during the first 100 days of the database. Specifically, we conduct a platform-wise comparative study of their: volume of moderation actions, grounds for decision, types of applied restrictions, types of moderated content, timeliness in undertaking and submitting moderation actions, and use of automation. Furthermore, we systematically cross-check the contents of the database with the platforms' own transparency reports. Our analyses reveal that (i) the platforms adhered only in part to the philosophy and s
&lt;/p&gt;</description></item></channel></rss>