<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#25308;&#21344;&#24237;&#23481;&#38169;&#30340;&#20998;&#25955;&#24335;&#22810;&#33218;&#36172;&#21338;&#26426;&#31639;&#27861;&#65292;&#36890;&#36807;&#20449;&#24687;&#28151;&#21512;&#21644;&#20540;&#30340;&#25130;&#26029;&#23454;&#29616;&#20102;&#23545;&#25308;&#21344;&#24237;&#20195;&#29702;&#30340;&#24674;&#22797;&#21644;&#40065;&#26834;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.07320</link><description>&lt;p&gt;
&#25308;&#21344;&#24237;&#23481;&#38169;&#30340;&#20998;&#25955;&#24335;&#22810;&#33218;&#36172;&#21338;&#26426;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Byzantine-Resilient Decentralized Multi-Armed Bandits. (arXiv:2310.07320v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07320
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#25308;&#21344;&#24237;&#23481;&#38169;&#30340;&#20998;&#25955;&#24335;&#22810;&#33218;&#36172;&#21338;&#26426;&#31639;&#27861;&#65292;&#36890;&#36807;&#20449;&#24687;&#28151;&#21512;&#21644;&#20540;&#30340;&#25130;&#26029;&#23454;&#29616;&#20102;&#23545;&#25308;&#21344;&#24237;&#20195;&#29702;&#30340;&#24674;&#22797;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20998;&#25955;&#24335;&#21512;&#20316;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#20013;&#65292;&#27599;&#20010;&#20195;&#29702;&#35266;&#23519;&#21040;&#19981;&#21516;&#30340;&#22870;&#21169;&#27969;&#65292;&#35797;&#22270;&#19982;&#20854;&#20182;&#20195;&#29702;&#20132;&#25442;&#20449;&#24687;&#20197;&#36873;&#25321;&#19968;&#31995;&#21015;&#25163;&#33218;&#20197;&#26368;&#23567;&#21270;&#36951;&#25022;&#12290;&#19982;&#29420;&#31435;&#36816;&#34892;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#31561;&#22810;&#33218;&#36172;&#21338;&#26426;&#26041;&#27861;&#30456;&#27604;&#65292;&#21327;&#20316;&#22330;&#26223;&#20013;&#30340;&#20195;&#29702;&#21487;&#20197;&#34920;&#29616;&#24471;&#26356;&#22909;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#22312;&#26410;&#30693;&#27604;&#20363;&#30340;&#20195;&#29702;&#21487;&#33021;&#26159;&#25308;&#21344;&#24237;&#65288;&#21363;&#65292;&#20197;&#22870;&#21169;&#22343;&#20540;&#20272;&#35745;&#25110;&#32622;&#20449;&#24230;&#38598;&#30340;&#24418;&#24335;&#20256;&#36882;&#20219;&#24847;&#38169;&#35823;&#20449;&#24687;&#65289;&#26102;&#24674;&#22797;&#27492;&#31867;&#31361;&#20986;&#34892;&#20026;&#12290;&#35813;&#26694;&#26550;&#21487;&#29992;&#20110;&#27169;&#25311;&#35745;&#31639;&#26426;&#32593;&#32476;&#20013;&#30340;&#25915;&#20987;&#32773;&#65292;&#21521;&#25512;&#33616;&#31995;&#32479;&#20013;&#25554;&#20837;&#25915;&#20987;&#24615;&#20869;&#23481;&#30340;&#31574;&#21010;&#32773;&#65292;&#25110;&#32773;&#37329;&#34701;&#24066;&#22330;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#24320;&#21457;&#20102;&#19968;&#31181;&#23436;&#20840;&#20998;&#25955;&#30340;&#20855;&#26377;&#23481;&#38169;&#19978;&#30028;&#32622;&#20449;&#24230;&#65288;UCB&#65289;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#23558;&#20195;&#29702;&#38388;&#30340;&#20449;&#24687;&#28151;&#21512;&#27493;&#39588;&#19982;&#19981;&#19968;&#33268;&#21644;&#26497;&#31471;&#20540;&#30340;&#25130;&#26029;&#30456;&#32467;&#21512;&#12290;&#36825;&#20010;&#25130;&#26029;&#27493;&#39588;&#20351;&#25105;&#20204;&#33021;&#22815;&#24314;&#31435;
&lt;/p&gt;
&lt;p&gt;
In decentralized cooperative multi-armed bandits (MAB), each agent observes a distinct stream of rewards, and seeks to exchange information with others to select a sequence of arms so as to minimize its regret. Agents in the cooperative setting can outperform a single agent running a MAB method such as Upper-Confidence Bound (UCB) independently. In this work, we study how to recover such salient behavior when an unknown fraction of the agents can be Byzantine, that is, communicate arbitrarily wrong information in the form of reward mean-estimates or confidence sets. This framework can be used to model attackers in computer networks, instigators of offensive content into recommender systems, or manipulators of financial markets. Our key contribution is the development of a fully decentralized resilient upper confidence bound (UCB) algorithm that fuses an information mixing step among agents with a truncation of inconsistent and extreme values. This truncation step enables us to establis
&lt;/p&gt;</description></item></channel></rss>