<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#36890;&#36807;&#36164;&#28304;&#24863;&#30693;&#30340;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#20197;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#30340;&#20869;&#23481;&#35831;&#27714;&#65292;&#24182;&#20943;&#36731;&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#22238;&#31243;&#27969;&#37327;&#25317;&#22622;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.04216</link><description>&lt;p&gt;
&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#30340;&#36164;&#28304;&#24863;&#30693;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Resource-Aware Hierarchical Federated Learning in Wireless Video Caching Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04216
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#36164;&#28304;&#24863;&#30693;&#30340;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#20197;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#30340;&#20869;&#23481;&#35831;&#27714;&#65292;&#24182;&#20943;&#36731;&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#22238;&#31243;&#27969;&#37327;&#25317;&#22622;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26080;&#32447;&#35270;&#39057;&#32531;&#23384;&#32593;&#32476;&#20013;&#65292;&#36890;&#36807;&#23558;&#24453;&#35831;&#27714;&#20869;&#23481;&#23384;&#20648;&#22312;&#19981;&#21516;&#32423;&#21035;&#19978;&#65292;&#21487;&#20197;&#20943;&#36731;&#30001;&#23569;&#25968;&#28909;&#38376;&#25991;&#20214;&#30340;&#35270;&#39057;&#27969;&#37327;&#36896;&#25104;&#30340;&#22238;&#31243;&#25317;&#22622;&#12290;&#36890;&#24120;&#65292;&#20869;&#23481;&#26381;&#21153;&#25552;&#20379;&#21830;&#65288;CSP&#65289;&#25317;&#26377;&#20869;&#23481;&#65292;&#29992;&#25143;&#20351;&#29992;&#20854;&#65288;&#26080;&#32447;&#65289;&#20114;&#32852;&#32593;&#26381;&#21153;&#25552;&#20379;&#21830;&#65288;ISP&#65289;&#20174;CSP&#35831;&#27714;&#20854;&#39318;&#36873;&#20869;&#23481;&#12290;&#30001;&#20110;&#36825;&#20123;&#21442;&#19982;&#26041;&#19981;&#20250;&#36879;&#38706;&#20854;&#31169;&#23494;&#20449;&#24687;&#21644;&#21830;&#19994;&#26426;&#23494;&#65292;&#20256;&#32479;&#25216;&#26415;&#21487;&#33021;&#26080;&#27861;&#29992;&#20110;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#38656;&#27714;&#30340;&#21160;&#24577;&#21464;&#21270;&#12290;&#20986;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#36164;&#28304;&#24863;&#30693;&#20998;&#23618;&#32852;&#37030;&#23398;&#20064;&#65288;RawHFL&#65289;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#39044;&#27979;&#29992;&#25143;&#26410;&#26469;&#30340;&#20869;&#23481;&#35831;&#27714;&#12290;&#37319;&#29992;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#25968;&#25454;&#33719;&#21462;&#25216;&#26415;&#65292;&#20801;&#35768;&#29992;&#25143;&#26681;&#25454;&#20854;&#35831;&#27714;&#30340;&#20869;&#23481;&#26356;&#26032;&#20854;&#26412;&#22320;&#35757;&#32451;&#25968;&#25454;&#38598;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#32593;&#32476;&#21644;&#20854;&#20182;&#35745;&#31639;&#36164;&#28304;&#26377;&#38480;&#65292;&#32771;&#34385;&#21040;&#21482;&#26377;&#19968;&#37096;&#20998;&#29992;&#25143;&#21442;&#19982;&#27169;&#22411;&#35757;&#32451;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;
&lt;/p&gt;
&lt;p&gt;
Backhaul traffic congestion caused by the video traffic of a few popular files can be alleviated by storing the to-be-requested content at various levels in wireless video caching networks. Typically, content service providers (CSPs) own the content, and the users request their preferred content from the CSPs using their (wireless) internet service providers (ISPs). As these parties do not reveal their private information and business secrets, traditional techniques may not be readily used to predict the dynamic changes in users' future demands. Motivated by this, we propose a novel resource-aware hierarchical federated learning (RawHFL) solution for predicting user's future content requests. A practical data acquisition technique is used that allows the user to update its local training dataset based on its requested content. Besides, since networking and other computational resources are limited, considering that only a subset of the users participate in the model training, we derive
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#28857;&#23545;&#28857;&#22810;&#26234;&#33021;&#20307;&#32593;&#32476;&#20013;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27604;&#20363;&#31215;&#20998;&#65288;PI&#65289;&#25511;&#21046;&#31574;&#30053;&#30340;&#39044;&#26465;&#20214;PI&#20849;&#35782;&#31639;&#27861;&#65292;&#20445;&#35777;&#20102;&#20854;&#22312;&#21463;&#38480;&#24378;&#20984;&#20989;&#25968;&#19979;&#30340;&#32447;&#24615;&#25910;&#25947;&#24615;&#65292;&#26080;&#38656;&#20010;&#20307;&#23616;&#37096;&#20195;&#20215;&#20989;&#25968;&#30340;&#20984;&#24615;&#65292;&#24182;&#19988;&#36890;&#36807;&#24341;&#20837;&#23616;&#37096;&#39044;&#26465;&#20214;&#36827;&#19968;&#27493;&#21152;&#36895;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.00419</link><description>&lt;p&gt;
&#21463;&#38480;&#24378;&#20984;&#24615;&#19979;&#30340;&#39044;&#26465;&#20214;PI&#20849;&#35782;&#31639;&#27861;&#30340;&#32447;&#24615;&#25910;&#25947;&#24615;
&lt;/p&gt;
&lt;p&gt;
Linear Convergence of Pre-Conditioned PI Consensus Algorithm under Restricted Strong Convexity. (arXiv:2310.00419v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00419
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#28857;&#23545;&#28857;&#22810;&#26234;&#33021;&#20307;&#32593;&#32476;&#20013;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#27604;&#20363;&#31215;&#20998;&#65288;PI&#65289;&#25511;&#21046;&#31574;&#30053;&#30340;&#39044;&#26465;&#20214;PI&#20849;&#35782;&#31639;&#27861;&#65292;&#20445;&#35777;&#20102;&#20854;&#22312;&#21463;&#38480;&#24378;&#20984;&#20989;&#25968;&#19979;&#30340;&#32447;&#24615;&#25910;&#25947;&#24615;&#65292;&#26080;&#38656;&#20010;&#20307;&#23616;&#37096;&#20195;&#20215;&#20989;&#25968;&#30340;&#20984;&#24615;&#65292;&#24182;&#19988;&#36890;&#36807;&#24341;&#20837;&#23616;&#37096;&#39044;&#26465;&#20214;&#36827;&#19968;&#27493;&#21152;&#36895;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#22312;&#28857;&#23545;&#28857;&#22810;&#26234;&#33021;&#20307;&#32593;&#32476;&#20013;&#35299;&#20915;&#20998;&#24067;&#24335;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;&#32593;&#32476;&#34987;&#20551;&#23450;&#20026;&#21516;&#27493;&#21644;&#36830;&#36890;&#30340;&#12290;&#37319;&#29992;&#27604;&#20363;&#31215;&#20998;&#65288;PI&#65289;&#25511;&#21046;&#31574;&#30053;&#65292;&#24320;&#21457;&#20102;&#22810;&#31181;&#20855;&#26377;&#22266;&#23450;&#27493;&#38271;&#30340;&#31639;&#27861;&#65292;&#20854;&#20013;&#26368;&#26089;&#30340;&#26159;PI&#20849;&#35782;&#31639;&#27861;&#12290;&#21033;&#29992;&#26446;&#38597;&#26222;&#35834;&#22827;&#29702;&#35770;&#65292;&#25105;&#20204;&#39318;&#27425;&#20445;&#35777;&#20102;&#20855;&#26377;&#36895;&#29575;&#21305;&#37197;&#31163;&#25955;&#21270;&#30340;&#21463;&#38480;&#24378;&#20984;&#20989;&#25968;&#30340;PI&#20849;&#35782;&#31639;&#27861;&#30340;&#25351;&#25968;&#25910;&#25947;&#24615;&#65292;&#32780;&#19981;&#38656;&#35201;&#20010;&#20307;&#23616;&#37096;&#20195;&#20215;&#20989;&#25968;&#30340;&#20984;&#24615;&#12290;&#20026;&#20102;&#21152;&#36895;PI&#20849;&#35782;&#31639;&#27861;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#23616;&#37096;&#39044;&#26465;&#20214;&#30340;&#24418;&#24335;&#65292;&#21363;&#24120;&#25968;&#27491;&#23450;&#30697;&#38453;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#39564;&#35777;&#20854;&#30456;&#27604;&#20110;&#31361;&#20986;&#30340;&#20998;&#24067;&#24335;&#20984;&#20248;&#21270;&#31639;&#27861;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers solving distributed convex optimization problems in peer-to-peer multi-agent networks. The network is assumed to be synchronous and connected. By using the proportional-integral (PI) control strategy, various algorithms with fixed stepsize have been developed. The earliest among them is the PI consensus algorithm. Using Lyapunov theory, we guarantee exponential convergence of the PI consensus algorithm for restricted strongly convex functions with rate-matching discretization, without requiring convexity of individual local cost functions, for the first time. In order to accelerate the PI consensus algorithm, we incorporate local pre-conditioning in the form of constant positive definite matrices and numerically validate its efficiency compared to the prominent distributed convex optimization algorithms. Unlike classical pre-conditioning, where only the gradients are multiplied by a pre-conditioner, the proposed pre-conditioning modifies both the gradients and the 
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26694;&#26550;&#26469;&#36890;&#36807;&#35777;&#20070;&#21512;&#25104;&#39564;&#35777;&#21160;&#24577;&#21644;&#25511;&#21046;&#27169;&#22411;&#12290;&#30740;&#31350;&#32773;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#26041;&#27861;&#26469;&#35774;&#35745;&#25511;&#21046;&#22120;&#24182;&#20998;&#26512;&#22797;&#26434;&#35268;&#33539;&#12290;&#36825;&#20010;&#26041;&#27861;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;SMT&#27714;&#35299;&#22120;&#26469;&#25552;&#20379;&#20505;&#36873;&#25511;&#21046;&#21644;&#35777;&#20070;&#20989;&#25968;&#65292;&#24182;&#20026;&#25511;&#21046;&#30340;&#23433;&#20840;&#23398;&#20064;&#39046;&#22495;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2309.06090</link><description>&lt;p&gt;
&#36890;&#36807;&#35777;&#20070;&#21512;&#25104;&#30340;&#21160;&#24577;&#19982;&#25511;&#21046;&#27169;&#22411;&#30340;&#36890;&#29992;&#39564;&#35777;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A General Verification Framework for Dynamical and Control Models via Certificate Synthesis. (arXiv:2309.06090v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06090
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26694;&#26550;&#26469;&#36890;&#36807;&#35777;&#20070;&#21512;&#25104;&#39564;&#35777;&#21160;&#24577;&#21644;&#25511;&#21046;&#27169;&#22411;&#12290;&#30740;&#31350;&#32773;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#26041;&#27861;&#26469;&#35774;&#35745;&#25511;&#21046;&#22120;&#24182;&#20998;&#26512;&#22797;&#26434;&#35268;&#33539;&#12290;&#36825;&#20010;&#26041;&#27861;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;SMT&#27714;&#35299;&#22120;&#26469;&#25552;&#20379;&#20505;&#36873;&#25511;&#21046;&#21644;&#35777;&#20070;&#20989;&#25968;&#65292;&#24182;&#20026;&#25511;&#21046;&#30340;&#23433;&#20840;&#23398;&#20064;&#39046;&#22495;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25511;&#21046;&#35770;&#30340;&#19968;&#20010;&#26032;&#20852;&#20998;&#25903;&#19987;&#38376;&#30740;&#31350;&#35777;&#20070;&#23398;&#20064;&#65292;&#28041;&#21450;&#23545;&#33258;&#20027;&#25110;&#25511;&#21046;&#27169;&#22411;&#30340;&#25152;&#38656;&#65288;&#21487;&#33021;&#26159;&#22797;&#26434;&#30340;&#65289;&#31995;&#32479;&#34892;&#20026;&#30340;&#35268;&#33539;&#65292;&#24182;&#36890;&#36807;&#22522;&#20110;&#20989;&#25968;&#30340;&#35777;&#26126;&#36827;&#34892;&#20998;&#26512;&#39564;&#35777;&#12290;&#28982;&#32780;&#65292;&#28385;&#36275;&#36825;&#20123;&#22797;&#26434;&#35201;&#27714;&#30340;&#25511;&#21046;&#22120;&#30340;&#21512;&#25104;&#36890;&#24120;&#26159;&#19968;&#20010;&#38750;&#24120;&#22256;&#38590;&#30340;&#20219;&#21153;&#65292;&#21487;&#33021;&#36229;&#20986;&#20102;&#22823;&#22810;&#25968;&#19987;&#23478;&#25511;&#21046;&#24037;&#31243;&#24072;&#30340;&#33021;&#21147;&#12290;&#22240;&#27492;&#65292;&#38656;&#35201;&#33258;&#21160;&#25216;&#26415;&#33021;&#22815;&#35774;&#35745;&#25511;&#21046;&#22120;&#24182;&#20998;&#26512;&#21508;&#31181;&#22797;&#26434;&#35268;&#33539;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#26469;&#32534;&#30721;&#31995;&#32479;&#35268;&#33539;&#24182;&#23450;&#20041;&#30456;&#24212;&#30340;&#35777;&#20070;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#26041;&#27861;&#26469;&#27491;&#24335;&#21512;&#25104;&#25511;&#21046;&#22120;&#21644;&#35777;&#20070;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20026;&#25511;&#21046;&#30340;&#23433;&#20840;&#23398;&#20064;&#39046;&#22495;&#20570;&#20986;&#20102;&#36129;&#29486;&#65292;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#30340;&#28789;&#27963;&#24615;&#25552;&#20379;&#20505;&#36873;&#30340;&#25511;&#21046;&#21644;&#35777;&#20070;&#20989;&#25968;&#65292;&#21516;&#26102;&#20351;&#29992;SMT&#27714;&#35299;&#22120;&#26469;&#25552;&#20379;&#24418;&#24335;&#21270;&#30340;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
An emerging branch of control theory specialises in certificate learning, concerning the specification of a desired (possibly complex) system behaviour for an autonomous or control model, which is then analytically verified by means of a function-based proof. However, the synthesis of controllers abiding by these complex requirements is in general a non-trivial task and may elude the most expert control engineers. This results in a need for automatic techniques that are able to design controllers and to analyse a wide range of elaborate specifications. In this paper, we provide a general framework to encode system specifications and define corresponding certificates, and we present an automated approach to formally synthesise controllers and certificates. Our approach contributes to the broad field of safe learning for control, exploiting the flexibility of neural networks to provide candidate control and certificate functions, whilst using SMT-solvers to offer a formal guarantee of co
&lt;/p&gt;</description></item></channel></rss>