<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21322;&#30417;&#30563;GNN&#30340;&#27450;&#35784;&#26816;&#27979;&#22120;SEC-GFD&#65292;&#36890;&#36807;&#28151;&#21512;&#36807;&#28388;&#27169;&#22359;&#21644;&#23616;&#37096;&#29615;&#22659;&#32422;&#26463;&#27169;&#22359;&#35299;&#20915;&#20102;&#24322;&#36136;&#24615;&#21644;&#26631;&#31614;&#21033;&#29992;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2312.06441</link><description>&lt;p&gt;
&#22312;&#24322;&#36136;&#24615;&#21644;&#35889;&#38382;&#39064;&#19979;&#37325;&#26032;&#23457;&#35270;&#22522;&#20110;&#22270;&#30340;&#27450;&#35784;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Revisiting Graph-Based Fraud Detection in Sight of Heterophily and Spectrum
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.06441
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21322;&#30417;&#30563;GNN&#30340;&#27450;&#35784;&#26816;&#27979;&#22120;SEC-GFD&#65292;&#36890;&#36807;&#28151;&#21512;&#36807;&#28388;&#27169;&#22359;&#21644;&#23616;&#37096;&#29615;&#22659;&#32422;&#26463;&#27169;&#22359;&#35299;&#20915;&#20102;&#24322;&#36136;&#24615;&#21644;&#26631;&#31614;&#21033;&#29992;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#22270;&#30340;&#27450;&#35784;&#26816;&#27979;&#65288;GFD&#65289;&#21487;&#35270;&#20026;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#21322;&#30417;&#30563;&#33410;&#28857;&#20108;&#20998;&#31867;&#20219;&#21153;&#12290;&#36817;&#24180;&#26469;&#65292;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#24050;&#24191;&#27867;&#24212;&#29992;&#20110;GFD&#65292;&#36890;&#36807;&#32858;&#21512;&#37051;&#23621;&#20449;&#24687;&#26469;&#21051;&#30011;&#33410;&#28857;&#30340;&#24322;&#24120;&#21487;&#33021;&#24615;&#12290;&#28982;&#32780;&#65292;&#27450;&#35784;&#22270;&#22312;&#26412;&#36136;&#19978;&#26159;&#24322;&#36136;&#30340;&#65292;&#22240;&#27492;&#22823;&#22810;&#25968;GNN&#30001;&#20110;&#20551;&#35774;&#21516;&#36136;&#24615;&#32780;&#34920;&#29616;&#19981;&#20339;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#23384;&#22312;&#24322;&#36136;&#24615;&#21644;&#31867;&#21035;&#19981;&#24179;&#34913;&#38382;&#39064;&#65292;&#29616;&#26377;&#27169;&#22411;&#26410;&#20805;&#20998;&#21033;&#29992;&#23453;&#36149;&#30340;&#33410;&#28857;&#26631;&#31614;&#20449;&#24687;&#12290;&#20026;&#20102;&#35299;&#20915;&#19978;&#36848;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21322;&#30417;&#30563;GNN&#30340;&#27450;&#35784;&#26816;&#27979;&#22120;SEC-GFD&#12290;&#35813;&#26816;&#27979;&#22120;&#21253;&#25324;&#28151;&#21512;&#36807;&#28388;&#27169;&#22359;&#21644;&#23616;&#37096;&#29615;&#22659;&#32422;&#26463;&#27169;&#22359;&#65292;&#36825;&#20004;&#20010;&#27169;&#22359;&#20998;&#21035;&#29992;&#20110;&#35299;&#20915;&#24322;&#36136;&#24615;&#21644;&#26631;&#31614;&#21033;&#29992;&#38382;&#39064;&#12290;&#31532;&#19968;&#20010;&#27169;&#22359;&#20174;&#35889;&#22495;&#30340;&#35282;&#24230;&#20986;&#21457;&#65292;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#35299;&#20915;&#20102;&#24322;&#36136;&#24615;&#38382;&#39064;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23427;&#23558;&#22270;&#20998;&#21106;&#31216;&#19981;&#21516;&#30340;&#35889;&#25104;&#20998;&#65292;
&lt;/p&gt;
&lt;p&gt;
Graph-based fraud detection (GFD) can be regarded as a challenging semi-supervised node binary classification task. In recent years, Graph Neural Networks (GNN) have been widely applied to GFD, characterizing the anomalous possibility of a node by aggregating neighbor information. However, fraud graphs are inherently heterophilic, thus most of GNNs perform poorly due to their assumption of homophily. In addition, due to the existence of heterophily and class imbalance problem, the existing models do not fully utilize the precious node label information. To address the above issues, this paper proposes a semi-supervised GNN-based fraud detector SEC-GFD. This detector includes a hybrid filtering module and a local environmental constraint module, the two modules are utilized to solve heterophily and label utilization problem respectively. The first module starts from the perspective of the spectral domain, and solves the heterophily problem to a certain extent. Specifically, it divides t
&lt;/p&gt;</description></item></channel></rss>