<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#21547;&#26377;93&#20010;&#20070;&#31821;&#21644;&#23545;&#24212;&#26377;&#22768;&#20070;&#30340;&#25968;&#25454;&#38598;&#65292;&#25552;&#20986;&#20102;&#25913;&#36827;&#30340;&#27169;&#22411;&#26469;&#39044;&#27979;&#26377;&#22768;&#20070;&#25991;&#26412;&#20013;&#30340;&#38901;&#24459;&#23646;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#25105;&#20204;&#30340;&#39044;&#27979;&#38901;&#24459;&#19982;&#20154;&#31867;&#26391;&#35835;&#27604;&#21830;&#19994;&#32423;TTS&#31995;&#32479;&#26356;&#30456;&#20851;&#65292;&#24182;&#19988;&#20154;&#20204;&#26356;&#21916;&#27426;&#38901;&#24459;&#22686;&#24378;&#30340;&#26377;&#22768;&#20070;&#26391;&#35835;&#12290;</title><link>http://arxiv.org/abs/2310.06930</link><description>&lt;p&gt;
&#12298;&#26377;&#22768;&#20070;&#30340;&#38901;&#24459;&#20998;&#26512;&#12299;
&lt;/p&gt;
&lt;p&gt;
Prosody Analysis of Audiobooks. (arXiv:2310.06930v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06930
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#21547;&#26377;93&#20010;&#20070;&#31821;&#21644;&#23545;&#24212;&#26377;&#22768;&#20070;&#30340;&#25968;&#25454;&#38598;&#65292;&#25552;&#20986;&#20102;&#25913;&#36827;&#30340;&#27169;&#22411;&#26469;&#39044;&#27979;&#26377;&#22768;&#20070;&#25991;&#26412;&#20013;&#30340;&#38901;&#24459;&#23646;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#25105;&#20204;&#30340;&#39044;&#27979;&#38901;&#24459;&#19982;&#20154;&#31867;&#26391;&#35835;&#27604;&#21830;&#19994;&#32423;TTS&#31995;&#32479;&#26356;&#30456;&#20851;&#65292;&#24182;&#19988;&#20154;&#20204;&#26356;&#21916;&#27426;&#38901;&#24459;&#22686;&#24378;&#30340;&#26377;&#22768;&#20070;&#26391;&#35835;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#22312;&#25991;&#26412;&#36716;&#35821;&#38899;&#26041;&#38754;&#21462;&#24471;&#20102;&#19968;&#20123;&#36827;&#23637;&#65292;&#20351;&#24471;&#20174;&#25991;&#26412;&#20013;&#29983;&#25104;&#33258;&#28982;&#38899;&#25928;&#30340;&#38899;&#39057;&#25104;&#20026;&#21487;&#33021;&#12290;&#28982;&#32780;&#65292;&#26377;&#22768;&#20070;&#26391;&#35835;&#28041;&#21450;&#21040;&#35835;&#32773;&#30340;&#25103;&#21095;&#24615;&#22768;&#38899;&#21644;&#35821;&#35843;&#65292;&#26356;&#22810;&#22320;&#20381;&#36182;&#24773;&#24863;&#12289;&#23545;&#35805;&#21644;&#21465;&#36848;&#12290;&#20351;&#29992;&#25105;&#20204;&#30340;&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;93&#26412;&#20070;&#19982;&#20854;&#23545;&#24212;&#30340;&#26377;&#22768;&#20070;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25913;&#36827;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#20174;&#21465;&#36848;&#25991;&#26412;&#20013;&#39044;&#27979;&#38901;&#24459;&#23646;&#24615;&#65288;&#38899;&#39640;&#12289;&#38899;&#37327;&#21644;&#35821;&#36895;&#65289;&#65292;&#24182;&#20351;&#29992;&#35821;&#35328;&#24314;&#27169;&#12290;&#25105;&#20204;&#39044;&#27979;&#30340;&#38901;&#24459;&#23646;&#24615;&#19982;&#20154;&#31867;&#26391;&#35835;&#30340;&#30456;&#20851;&#24615;&#35201;&#36828;&#39640;&#20110;&#21830;&#19994;&#32423;TTS&#31995;&#32479;&#30340;&#32467;&#26524;&#65306;&#22312;24&#26412;&#20070;&#20013;&#65292;&#25105;&#20204;&#39044;&#27979;&#30340;&#38899;&#39640;&#23545;22&#26412;&#20070;&#30340;&#20154;&#31867;&#38405;&#35835;&#26356;&#20855;&#30456;&#20851;&#24615;&#65292;&#32780;&#25105;&#20204;&#39044;&#27979;&#30340;&#38899;&#37327;&#23646;&#24615;&#23545;23&#26412;&#20070;&#30340;&#20154;&#31867;&#38405;&#35835;&#26356;&#21152;&#30456;&#20284;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#20154;&#31867;&#35780;&#20272;&#30740;&#31350;&#65292;&#20197;&#37327;&#21270;&#20154;&#20204;&#26356;&#21916;&#27426;&#38901;&#24459;&#22686;&#24378;&#30340;&#26377;&#22768;&#20070;&#26391;&#35835;&#36824;&#26159;&#21830;&#19994;&#32423;&#25991;&#26412;&#36716;&#35821;&#38899;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent advances in text-to-speech have made it possible to generate natural-sounding audio from text. However, audiobook narrations involve dramatic vocalizations and intonations by the reader, with greater reliance on emotions, dialogues, and descriptions in the narrative. Using our dataset of 93 aligned book-audiobook pairs, we present improved models for prosody prediction properties (pitch, volume, and rate of speech) from narrative text using language modeling. Our predicted prosody attributes correlate much better with human audiobook readings than results from a state-of-the-art commercial TTS system: our predicted pitch shows a higher correlation with human reading for 22 out of the 24 books, while our predicted volume attribute proves more similar to human reading for 23 out of the 24 books. Finally, we present a human evaluation study to quantify the extent that people prefer prosody-enhanced audiobook readings over commercial text-to-speech systems.
&lt;/p&gt;</description></item></channel></rss>