<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#19988;&#40065;&#26834;&#30340;&#20302;&#31209;&#22270;&#23545;&#27604;&#23398;&#20064;&#65288;LR-GCL&#65289;&#31639;&#27861;&#65292;&#24212;&#29992;&#20110;&#36716;&#23548;&#33410;&#28857;&#20998;&#31867;&#20219;&#21153;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#20302;&#31209;&#27491;&#35268;&#21270;&#30340;&#23545;&#27604;&#23398;&#20064;&#35757;&#32451;&#19968;&#20010;&#32534;&#30721;&#22120;&#65292;&#24182;&#20351;&#29992;&#29983;&#25104;&#30340;&#29305;&#24449;&#36827;&#34892;&#32447;&#24615;&#36716;&#23548;&#20998;&#31867;&#12290;</title><link>https://arxiv.org/abs/2402.09600</link><description>&lt;p&gt;
&#20302;&#31209;&#22270;&#23545;&#27604;&#23398;&#20064;&#29992;&#20110;&#33410;&#28857;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
Low-Rank Graph Contrastive Learning for Node Classification
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09600
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#19988;&#40065;&#26834;&#30340;&#20302;&#31209;&#22270;&#23545;&#27604;&#23398;&#20064;&#65288;LR-GCL&#65289;&#31639;&#27861;&#65292;&#24212;&#29992;&#20110;&#36716;&#23548;&#33410;&#28857;&#20998;&#31867;&#20219;&#21153;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#20302;&#31209;&#27491;&#35268;&#21270;&#30340;&#23545;&#27604;&#23398;&#20064;&#35757;&#32451;&#19968;&#20010;&#32534;&#30721;&#22120;&#65292;&#24182;&#20351;&#29992;&#29983;&#25104;&#30340;&#29305;&#24449;&#36827;&#34892;&#32447;&#24615;&#36716;&#23548;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#24191;&#27867;&#24212;&#29992;&#20110;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#65292;&#24182;&#22312;&#33410;&#28857;&#20998;&#31867;&#31561;&#21508;&#31181;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#33394;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#22270;&#25968;&#25454;&#20013;&#19981;&#21487;&#36991;&#20813;&#22320;&#23384;&#22312;&#22122;&#22768;&#65292;&#36825;&#20250;&#20005;&#37325;&#38477;&#20302;GNNs&#30340;&#24615;&#33021;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#19988;&#40065;&#26834;&#30340;GNN&#32534;&#30721;&#22120;&#65292;&#21363;&#20302;&#31209;&#22270;&#23545;&#27604;&#23398;&#20064;&#65288;LR-GCL&#65289;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#20004;&#20010;&#27493;&#39588;&#36827;&#34892;&#36716;&#23548;&#33410;&#28857;&#20998;&#31867;&#12290;&#39318;&#20808;&#65292;&#36890;&#36807;&#20302;&#31209;&#27491;&#24120;&#23545;&#27604;&#23398;&#20064;&#35757;&#32451;&#19968;&#20010;&#21517;&#20026;LR-GCL&#30340;&#20302;&#31209;GCL&#32534;&#30721;&#22120;&#12290;&#28982;&#21518;&#65292;&#20351;&#29992;LR-GCL&#29983;&#25104;&#30340;&#29305;&#24449;&#65292;&#20351;&#29992;&#32447;&#24615;&#36716;&#23548;&#20998;&#31867;&#31639;&#27861;&#23545;&#22270;&#20013;&#30340;&#26410;&#26631;&#35760;&#33410;&#28857;&#36827;&#34892;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;LR-GCL&#21463;&#21040;&#22270;&#25968;&#25454;&#21644;&#20854;&#26631;&#31614;&#30340;&#20302;&#39057;&#24615;&#36136;&#30340;&#21551;&#31034;&#65292;&#24182;&#22312;&#29702;&#35770;&#19978;&#21463;&#21040;&#25105;&#20204;&#20851;&#20110;&#36716;&#23548;&#23398;&#20064;&#30340;&#23574;&#38160;&#27867;&#21270;&#30028;&#38480;&#30340;&#25512;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09600v1 Announce Type: new  Abstract: Graph Neural Networks (GNNs) have been widely used to learn node representations and with outstanding performance on various tasks such as node classification. However, noise, which inevitably exists in real-world graph data, would considerably degrade the performance of GNNs revealed by recent studies. In this work, we propose a novel and robust GNN encoder, Low-Rank Graph Contrastive Learning (LR-GCL). Our method performs transductive node classification in two steps. First, a low-rank GCL encoder named LR-GCL is trained by prototypical contrastive learning with low-rank regularization. Next, using the features produced by LR-GCL, a linear transductive classification algorithm is used to classify the unlabeled nodes in the graph. Our LR-GCL is inspired by the low frequency property of the graph data and its labels, and it is also theoretically motivated by our sharp generalization bound for transductive learning. To the best of our kno
&lt;/p&gt;</description></item></channel></rss>