<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#21521;&#33021;&#28304;&#39640;&#25928;&#24615;&#21644;&#23454;&#26102;&#24615;&#30340;&#31038;&#20132;&#27675;&#22260;&#27979;&#37327;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#25628;&#32034;&#26694;&#26550;ERSAM&#12290;&#35813;&#26694;&#26550;&#21487;&#20197;&#33258;&#21160;&#25628;&#32034;&#36866;&#21512;SAM&#20219;&#21153;&#30340;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#24182;&#28385;&#36275;&#33021;&#28304;&#25928;&#29575;&#12289;&#23454;&#26102;&#22788;&#29702;&#21644;&#26377;&#38480;&#26631;&#31614;&#25968;&#25454;&#30340;&#35201;&#27714;&#12290;&#22312;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#65292;&#35813;&#26694;&#26550;&#20248;&#20110;&#29616;&#26377;&#35299;&#20915;&#26041;&#26696;&#65292;&#20855;&#26377;&#26356;&#22909;&#30340;&#31934;&#24230;&#21644;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2303.10727</link><description>&lt;p&gt;
ERSAM: &#38754;&#21521;&#33021;&#28304;&#39640;&#25928;&#21644;&#23454;&#26102;&#31038;&#20132;&#27675;&#22260;&#27979;&#37327;&#30340;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;
&lt;/p&gt;
&lt;p&gt;
ERSAM: Neural Architecture Search For Energy-Efficient and Real-Time Social Ambiance Measurement. (arXiv:2303.10727v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10727
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#21521;&#33021;&#28304;&#39640;&#25928;&#24615;&#21644;&#23454;&#26102;&#24615;&#30340;&#31038;&#20132;&#27675;&#22260;&#27979;&#37327;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#25628;&#32034;&#26694;&#26550;ERSAM&#12290;&#35813;&#26694;&#26550;&#21487;&#20197;&#33258;&#21160;&#25628;&#32034;&#36866;&#21512;SAM&#20219;&#21153;&#30340;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#24182;&#28385;&#36275;&#33021;&#28304;&#25928;&#29575;&#12289;&#23454;&#26102;&#22788;&#29702;&#21644;&#26377;&#38480;&#26631;&#31614;&#25968;&#25454;&#30340;&#35201;&#27714;&#12290;&#22312;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#65292;&#35813;&#26694;&#26550;&#20248;&#20110;&#29616;&#26377;&#35299;&#20915;&#26041;&#26696;&#65292;&#20855;&#26377;&#26356;&#22909;&#30340;&#31934;&#24230;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#27675;&#22260;&#25551;&#36848;&#20102;&#31038;&#20132;&#20114;&#21160;&#21457;&#29983;&#30340;&#32972;&#26223;&#65292;&#21487;&#20197;&#20351;&#29992;&#35821;&#38899;&#38899;&#39057;&#36890;&#36807;&#35745;&#31639;&#21516;&#26102;&#21457;&#35328;&#32773;&#30340;&#25968;&#37327;&#26469;&#27979;&#37327;&#12290;&#36825;&#31181;&#27979;&#37327;&#24050;&#32463;&#23454;&#29616;&#20102;&#21508;&#31181;&#24515;&#29702;&#20581;&#24247;&#36319;&#36394;&#21644;&#38754;&#21521;&#20154;&#31867;&#30340;&#29289;&#32852;&#32593;&#24212;&#29992;&#12290;&#34429;&#28982;&#35774;&#22791;&#19978;&#30340;&#31038;&#20132;&#27675;&#22260;&#27979;&#37327; (SAM) &#38750;&#24120;&#29702;&#24819;&#65292;&#20197;&#30830;&#20445;&#29992;&#25143;&#38544;&#31169;&#24182;&#20419;&#36827;&#19978;&#36848;&#24212;&#29992;&#30340;&#24191;&#27867;&#37319;&#29992;&#65292;&#20294;&#26368;&#20808;&#36827;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNNs&#65289;&#39537;&#21160;&#30340;SAM&#35299;&#20915;&#26041;&#26696;&#25152;&#38656;&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#19982;&#31227;&#21160;&#35774;&#22791;&#19978;&#30340;&#24120;&#35265;&#36164;&#28304;&#30456;&#30683;&#30462;&#12290;&#27492;&#22806;&#65292;&#22312;&#20020;&#24202;&#35774;&#32622;&#19979;&#65292;&#30001;&#20110;&#21508;&#31181;&#38544;&#31169;&#38480;&#21046;&#21644;&#25152;&#38656;&#30340;&#20154;&#21147;&#21171;&#21160;&#65292;&#21482;&#26377;&#26377;&#38480;&#30340;&#26631;&#35760;&#25968;&#25454;&#21487;&#29992;&#25110;&#23454;&#38469;&#21487;&#34892;&#65292;&#36825;&#36827;&#19968;&#27493;&#25361;&#25112;&#20102;&#35774;&#22791;&#19978;SAM&#35299;&#20915;&#26041;&#26696;&#30340;&#21487;&#23454;&#29616;&#20934;&#30830;&#24615;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#19987;&#38376;&#30340;&#31070;&#32463;&#26550;&#26500;&#25628;&#32034;&#26694;&#26550;&#65292;&#29992;&#20110;&#38754;&#21521;&#33021;&#28304;&#39640;&#25928;&#21644;&#23454;&#26102;SAM&#30340;ERSAM&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30340;ERSAM&#26694;&#26550;&#21487;&#20197;&#33258;&#21160;&#25628;&#32034;&#36866;&#21512;SAM&#20219;&#21153;&#30340;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65292;&#24182;&#28385;&#36275;&#33021;&#28304;&#25928;&#29575;&#12289;&#23454;&#26102;&#22788;&#29702;&#21644;&#26377;&#38480;&#26631;&#31614;&#25968;&#25454;&#30340;&#20005;&#26684;&#35201;&#27714;&#12290;&#25105;&#20204;&#22312;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#23637;&#31034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;ERSAM&#26694;&#26550;&#30340;&#26377;&#25928;&#24615;&#65292;&#23427;&#20248;&#20110;&#26368;&#20808;&#36827;&#30340;SAM&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#25552;&#39640;&#20102;&#31934;&#24230;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social ambiance describes the context in which social interactions happen, and can be measured using speech audio by counting the number of concurrent speakers. This measurement has enabled various mental health tracking and human-centric IoT applications. While on-device Socal Ambiance Measure (SAM) is highly desirable to ensure user privacy and thus facilitate wide adoption of the aforementioned applications, the required computational complexity of state-of-the-art deep neural networks (DNNs) powered SAM solutions stands at odds with the often constrained resources on mobile devices. Furthermore, only limited labeled data is available or practical when it comes to SAM under clinical settings due to various privacy constraints and the required human effort, further challenging the achievable accuracy of on-device SAM solutions. To this end, we propose a dedicated neural architecture search framework for Energy-efficient and Real-time SAM (ERSAM). Specifically, our ERSAM framework can
&lt;/p&gt;</description></item></channel></rss>