<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#25552;&#20986;&#19968;&#31181;&#35821;&#38899;&#25351;&#20196;&#24863;&#30693;&#30340;&#39134;&#34892;&#36712;&#36857;&#39044;&#27979;&#26694;&#26550;&#65292;&#36890;&#36807;&#34701;&#21512;&#21363;&#26102;&#30340;&#35821;&#38899;&#25351;&#20196;&#21644;&#39134;&#34892;&#36712;&#36857;&#34920;&#31034;&#65292;&#35299;&#20915;&#20102;&#35821;&#38899;&#25351;&#20196;&#21644;&#39134;&#34892;&#36712;&#36857;&#30340;&#27169;&#24577;&#24046;&#36317;&#38382;&#39064;&#65292;&#22312;&#22810;&#20010;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20248;&#24322;&#12290;</title><link>http://arxiv.org/abs/2305.01661</link><description>&lt;p&gt;
SIA-FTP: &#19968;&#31181;&#35821;&#38899;&#25351;&#20196;&#24863;&#30693;&#30340;&#39134;&#34892;&#36712;&#36857;&#39044;&#27979;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
SIA-FTP: A Spoken Instruction Aware Flight Trajectory Prediction Framework. (arXiv:2305.01661v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01661
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#19968;&#31181;&#35821;&#38899;&#25351;&#20196;&#24863;&#30693;&#30340;&#39134;&#34892;&#36712;&#36857;&#39044;&#27979;&#26694;&#26550;&#65292;&#36890;&#36807;&#34701;&#21512;&#21363;&#26102;&#30340;&#35821;&#38899;&#25351;&#20196;&#21644;&#39134;&#34892;&#36712;&#36857;&#34920;&#31034;&#65292;&#35299;&#20915;&#20102;&#35821;&#38899;&#25351;&#20196;&#21644;&#39134;&#34892;&#36712;&#36857;&#30340;&#27169;&#24577;&#24046;&#36317;&#38382;&#39064;&#65292;&#22312;&#22810;&#20010;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20248;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35821;&#38899;&#36890;&#35759;&#36827;&#34892;&#22320;&#31354;&#21327;&#21830;&#26159;&#30830;&#20445;&#31354;&#20013;&#20132;&#36890;&#31649;&#21046;&#65288;ATC&#65289;&#25805;&#20316;&#23433;&#20840;&#21644;&#25928;&#29575;&#30340;&#37325;&#35201;&#21069;&#25552;&#12290;&#20294;&#26159;&#65292;&#38543;&#30528;&#20132;&#36890;&#27969;&#37327;&#30340;&#22686;&#21152;&#65292;&#30001;&#20110;&#20154;&#20026;&#22240;&#32032;&#23548;&#33268;&#30340;&#38169;&#35823;&#25351;&#20196;&#32473;ATC&#23433;&#20840;&#24102;&#26469;&#20102;&#24040;&#22823;&#23041;&#32961;&#12290;&#29616;&#26377;&#30340;&#39134;&#34892;&#36712;&#36857;&#39044;&#27979;&#65288;FTP&#65289;&#26041;&#27861;&#20027;&#35201;&#20381;&#36182;&#20110;&#21382;&#21490;&#36712;&#36857;&#30340;&#39134;&#34892;&#29366;&#24577;&#65292;&#22312;&#23454;&#26102;&#26426;&#21160;&#25351;&#20196;&#30340;&#39044;&#27979;&#19978;&#20250;&#20986;&#29616;&#26174;&#33879;&#30340;&#24310;&#36831;&#65292;&#36825;&#19981;&#21033;&#20110;&#20914;&#31361;&#26816;&#27979;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;SIA-FTP&#30340;&#35821;&#38899;&#25351;&#20196;&#24863;&#30693;FTP&#26694;&#26550;&#65292;&#36890;&#36807;&#21253;&#21547;&#21363;&#26102;&#30340;&#35821;&#38899;&#25351;&#20196;&#26469;&#25903;&#25345;&#39640;&#26426;&#21160;FTP&#20219;&#21153;&#12290;&#20026;&#20102;&#35299;&#20915;&#27169;&#24577;&#24046;&#36317;&#24182;&#26368;&#23567;&#21270;&#25968;&#25454;&#38656;&#27714;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#32852;&#21512;&#27880;&#24847;&#26426;&#21046;&#26469;&#34701;&#21512;&#35821;&#38899;&#25351;&#20196;&#23884;&#20837;&#21644;&#39134;&#34892;&#36712;&#36857;&#34920;&#31034;&#12290;&#22312;&#22810;&#20010;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#19978;&#35780;&#20272;&#20102;&#25152;&#25552;&#20986;&#30340;SIA-FTP&#65292;&#19982;&#29616;&#26377;&#30340;FTP&#26041;&#27861;&#30456;&#27604;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ground-air negotiation via speech communication is a vital prerequisite for ensuring safety and efficiency in air traffic control (ATC) operations. However, with the increase in traffic flow, incorrect instructions caused by human factors bring a great threat to ATC safety. Existing flight trajectory prediction (FTP) approaches primarily rely on the flight status of historical trajectory, leading to significant delays in the prediction of real-time maneuvering instruction, which is not conducive to conflict detection. A major reason is that spoken instructions and flight trajectories are presented in different modalities in the current air traffic control (ATC) system, bringing great challenges to considering the maneuvering instruction in the FTP tasks. In this paper, a spoken instruction-aware FTP framework, called SIA-FTP, is innovatively proposed to support high-maneuvering FTP tasks by incorporating instant spoken instruction. To address the modality gap and minimize the data requ
&lt;/p&gt;</description></item></channel></rss>