<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#21033;&#29992;&#28151;&#21512;Mixup&#26041;&#27861;&#26469;&#35299;&#20915;&#31232;&#26377;&#26080;&#23614;&#34521;&#22768;&#22810;&#26631;&#31614;&#20998;&#31867;&#20013;&#30340;&#25361;&#25112;&#65292;&#23454;&#39564;&#35777;&#26126;&#36825;&#31181;&#26041;&#27861;&#22312;&#22788;&#29702;&#31867;&#21035;&#19981;&#24179;&#34913;&#21644;&#22810;&#26631;&#31614;&#31034;&#20363;&#26041;&#38754;&#20855;&#26377;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.09598</link><description>&lt;p&gt;
&#28151;&#21512;Mixup&#29992;&#20110;&#31232;&#26377;&#26080;&#23614;&#34521;&#22768;&#22810;&#26631;&#31614;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
Mixture of Mixups for Multi-label Classification of Rare Anuran Sounds
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09598
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#21033;&#29992;&#28151;&#21512;Mixup&#26041;&#27861;&#26469;&#35299;&#20915;&#31232;&#26377;&#26080;&#23614;&#34521;&#22768;&#22810;&#26631;&#31614;&#20998;&#31867;&#20013;&#30340;&#25361;&#25112;&#65292;&#23454;&#39564;&#35777;&#26126;&#36825;&#31181;&#26041;&#27861;&#22312;&#22788;&#29702;&#31867;&#21035;&#19981;&#24179;&#34913;&#21644;&#22810;&#26631;&#31614;&#31034;&#20363;&#26041;&#38754;&#20855;&#26377;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#26631;&#31614;&#19981;&#24179;&#34913;&#20998;&#31867;&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#26159;&#19968;&#20010;&#37325;&#35201;&#25361;&#25112;&#65292;&#29305;&#21035;&#22312;&#29983;&#29289;&#22768;&#23398;&#20013;&#23588;&#20026;&#26126;&#26174;&#65292;&#21160;&#29289;&#22768;&#38899;&#32463;&#24120;&#21516;&#26102;&#20986;&#29616;&#65292;&#32780;&#26576;&#20123;&#22768;&#38899;&#27604;&#20854;&#20182;&#22768;&#38899;&#35201;&#23569;&#24471;&#22810;&#12290;&#26412;&#25991;&#38024;&#23545;&#20351;&#29992;&#21253;&#21547;&#31867;&#21035;&#19981;&#24179;&#34913;&#21644;&#22810;&#26631;&#31614;&#31034;&#20363;&#30340;&#25968;&#25454;&#38598;AnuraSet&#65292;&#19987;&#27880;&#20110;&#20998;&#31867;&#26080;&#23614;&#30446;&#29289;&#31181;&#22768;&#38899;&#30340;&#29305;&#23450;&#24773;&#20917;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Mixture of Mixups (Mix2)&#65292;&#36825;&#26159;&#19968;&#20010;&#21033;&#29992;&#28151;&#21512;&#27491;&#21017;&#21270;&#26041;&#27861;Mixup&#12289;Manifold Mixup&#21644;MultiMix&#30340;&#26694;&#26550;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#20123;&#26041;&#27861;&#21333;&#29420;&#20351;&#29992;&#21487;&#33021;&#23548;&#33268;&#27425;&#20248;&#32467;&#26524;&#65307;&#28982;&#32780;&#65292;&#24403;&#38543;&#26426;&#24212;&#29992;&#23427;&#20204;&#26102;&#65292;&#27599;&#27425;&#35757;&#32451;&#36845;&#20195;&#36873;&#21462;&#19968;&#20010;&#26041;&#27861;&#65292;&#23427;&#20204;&#22312;&#35299;&#20915;&#25552;&#21040;&#30340;&#25361;&#25112;&#26041;&#38754;&#34920;&#29616;&#20986;&#26377;&#25928;&#24615;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#21457;&#29983;&#27425;&#25968;&#36739;&#23569;&#30340;&#31232;&#26377;&#31867;&#21035;&#12290;&#36827;&#19968;&#27493;&#20998;&#26512;&#34920;&#26126;&#65292;Mix2&#22312;&#36328;&#21508;&#31181;&#31867;&#21035;&#21516;&#26102;&#20986;&#29616;&#27700;&#24179;&#19978;&#20063;&#33021;&#26377;&#25928;&#20998;&#31867;&#22768;&#38899;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09598v1 Announce Type: cross  Abstract: Multi-label imbalanced classification poses a significant challenge in machine learning, particularly evident in bioacoustics where animal sounds often co-occur, and certain sounds are much less frequent than others. This paper focuses on the specific case of classifying anuran species sounds using the dataset AnuraSet, that contains both class imbalance and multi-label examples. To address these challenges, we introduce Mixture of Mixups (Mix2), a framework that leverages mixing regularization methods Mixup, Manifold Mixup, and MultiMix. Experimental results show that these methods, individually, may lead to suboptimal results; however, when applied randomly, with one selected at each training iteration, they prove effective in addressing the mentioned challenges, particularly for rare classes with few occurrences. Further analysis reveals that Mix2 is also proficient in classifying sounds across various levels of class co-occurrences
&lt;/p&gt;</description></item></channel></rss>