<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>inGRASS&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22823;&#22411;&#26080;&#21521;&#22270;&#22686;&#37327;&#35889;&#31232;&#30095;&#21270;&#30340;&#26032;&#31639;&#27861;&#65292;&#20854;&#20855;&#26377;&#39640;&#24230;&#21487;&#25193;&#23637;&#24615;&#21644;&#24182;&#34892;&#21451;&#22909;&#24615;&#65292;&#20851;&#38190;&#21019;&#26032;&#22312;&#20110;&#20302;&#38459;&#25239;&#30452;&#24452;&#20998;&#35299;&#26041;&#26696;&#65292;&#33021;&#22815;&#39640;&#25928;&#35782;&#21035;&#20851;&#38190;&#36793;&#21644;&#26816;&#27979;&#22810;&#20313;&#36793;&#12290;</title><link>https://arxiv.org/abs/2402.16990</link><description>&lt;p&gt;
inGRASS: &#36890;&#36807;&#20302;&#38459;&#25239;&#30452;&#24452;&#20998;&#35299;&#23454;&#29616;&#22686;&#37327;&#22270;&#35889;&#31232;&#30095;&#21270;
&lt;/p&gt;
&lt;p&gt;
inGRASS: Incremental Graph Spectral Sparsification via Low-Resistance-Diameter Decomposition
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16990
&lt;/p&gt;
&lt;p&gt;
inGRASS&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22823;&#22411;&#26080;&#21521;&#22270;&#22686;&#37327;&#35889;&#31232;&#30095;&#21270;&#30340;&#26032;&#31639;&#27861;&#65292;&#20854;&#20855;&#26377;&#39640;&#24230;&#21487;&#25193;&#23637;&#24615;&#21644;&#24182;&#34892;&#21451;&#22909;&#24615;&#65292;&#20851;&#38190;&#21019;&#26032;&#22312;&#20110;&#20302;&#38459;&#25239;&#30452;&#24452;&#20998;&#35299;&#26041;&#26696;&#65292;&#33021;&#22815;&#39640;&#25928;&#35782;&#21035;&#20851;&#38190;&#36793;&#21644;&#26816;&#27979;&#22810;&#20313;&#36793;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;inGRASS&#65292;&#36825;&#26159;&#19968;&#31181;&#26088;&#22312;&#23545;&#22823;&#22411;&#26080;&#21521;&#22270;&#36827;&#34892;&#22686;&#37327;&#35889;&#31232;&#30095;&#21270;&#30340;&#26032;&#31639;&#27861;&#12290;&#25152;&#25552;&#20986;&#30340;inGRASS&#31639;&#27861;&#20855;&#26377;&#39640;&#24230;&#21487;&#25193;&#23637;&#24615;&#21644;&#24182;&#34892;&#21451;&#22909;&#24615;&#65292;&#35774;&#32622;&#38454;&#27573;&#30340;&#26102;&#38388;&#22797;&#26434;&#24230;&#20960;&#20046;&#26159;&#32447;&#24615;&#30340;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#23545;&#20855;&#26377;N&#20010;&#33410;&#28857;&#30340;&#21407;&#22987;&#22270;&#36827;&#34892;&#22686;&#37327;&#26356;&#25913;&#26102;&#65292;&#20197;$O(\log N)$&#30340;&#26102;&#38388;&#26356;&#26032;&#35889;&#31232;&#30095;&#22120;&#12290;&#22312;inGRASS&#30340;&#35774;&#32622;&#38454;&#27573;&#20013;&#65292;&#19968;&#20010;&#20851;&#38190;&#32452;&#20214;&#26159;&#24341;&#20837;&#20102;&#22810;&#32423;&#38459;&#25239;&#23884;&#20837;&#26694;&#26550;&#65292;&#29992;&#20110;&#39640;&#25928;&#35782;&#21035;&#35889;&#20851;&#38190;&#36793;&#24182;&#26377;&#25928;&#26816;&#27979;&#22810;&#20313;&#36793;&#65292;&#36825;&#26159;&#36890;&#36807;&#23558;&#21021;&#22987;&#31232;&#30095;&#22120;&#20998;&#35299;&#20026;&#35768;&#22810;&#33410;&#28857;&#32676;&#38598;&#24182;&#21033;&#29992;&#20302;&#38459;&#25239;&#30452;&#24452;&#20998;&#35299;&#65288;LRD&#65289;&#26041;&#26696;&#26469;&#23454;&#29616;&#30340;&#12290;inGRASS&#30340;&#26356;&#26032;&#38454;&#27573;&#21033;&#29992;&#20302;&#32500;&#33410;&#28857;&#23884;&#20837;&#21521;&#37327;&#65292;&#26377;&#25928;&#20272;&#35745;&#27599;&#20010;&#26032;&#28155;&#21152;&#36793;&#30340;&#37325;&#35201;&#24615;&#21644;&#21807;&#19968;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16990v1 Announce Type: cross  Abstract: This work presents inGRASS, a novel algorithm designed for incremental spectral sparsification of large undirected graphs. The proposed inGRASS algorithm is highly scalable and parallel-friendly, having a nearly-linear time complexity for the setup phase and the ability to update the spectral sparsifier in $O(\log N)$ time for each incremental change made to the original graph with $N$ nodes. A key component in the setup phase of inGRASS is a multilevel resistance embedding framework introduced for efficiently identifying spectrally-critical edges and effectively detecting redundant ones, which is achieved by decomposing the initial sparsifier into many node clusters with bounded effective-resistance diameters leveraging a low-resistance-diameter decomposition (LRD) scheme. The update phase of inGRASS exploits low-dimensional node embedding vectors for efficiently estimating the importance and uniqueness of each newly added edge. As de
&lt;/p&gt;</description></item></channel></rss>