<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#30740;&#31350;&#20102;&#20855;&#26377;&#35821;&#20041;&#24847;&#35782;&#30340;&#36828;&#31243;&#22810;&#39532;&#23572;&#21487;&#22827;&#28304;&#20272;&#35745;&#30340;&#26368;&#20248;&#35843;&#24230;&#31574;&#30053;&#20197;&#21450;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31574;&#30053;&#25628;&#32034;&#31639;&#27861; Insec-RVI&#12290;</title><link>https://arxiv.org/abs/2403.16855</link><description>&lt;p&gt;
&#20855;&#26377;&#35821;&#20041;&#24847;&#35782;&#30340;&#36828;&#31243;&#22810;&#39532;&#23572;&#21487;&#22827;&#28304;&#20272;&#35745;&#22312;&#32422;&#26463;&#26465;&#20214;&#19979;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Semantic-Aware Remote Estimation of Multiple Markov Sources Under Constraints
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16855
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#20855;&#26377;&#35821;&#20041;&#24847;&#35782;&#30340;&#36828;&#31243;&#22810;&#39532;&#23572;&#21487;&#22827;&#28304;&#20272;&#35745;&#30340;&#26368;&#20248;&#35843;&#24230;&#31574;&#30053;&#20197;&#21450;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31574;&#30053;&#25628;&#32034;&#31639;&#27861; Insec-RVI&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20002;&#22833;&#21644;&#21463;&#36895;&#29575;&#38480;&#21046;&#30340;&#36890;&#36947;&#19978;&#23545;&#22810;&#20010;&#39532;&#23572;&#21487;&#22827;&#28304;&#36827;&#34892;&#35821;&#20041;&#24863;&#30693;&#36890;&#20449;&#30340;&#36828;&#31243;&#20272;&#35745;&#12290;&#19982;&#22823;&#22810;&#25968;&#29616;&#26377;&#30740;&#31350;&#23558;&#25152;&#26377;&#28304;&#29366;&#24577;&#35270;&#20026;&#30456;&#31561;&#19981;&#21516;&#65292;&#25105;&#20204;&#21033;&#29992;&#20449;&#24687;&#30340;&#35821;&#20041;&#24182;&#32771;&#34385;&#36828;&#31243;&#25191;&#34892;&#22120;&#23545;&#19981;&#21516;&#29366;&#24577;&#30340;&#20272;&#35745;&#35823;&#24046;&#20855;&#26377;&#19981;&#21516;&#30340;&#23481;&#24525;&#24230;&#12290;&#25105;&#20204;&#26088;&#22312;&#25214;&#21040;&#19968;&#20010;&#26368;&#20248;&#35843;&#24230;&#31574;&#30053;&#65292;&#20197;&#22312;&#20256;&#36755;&#39057;&#29575;&#32422;&#26463;&#19979;&#26368;&#23567;&#21270;&#20272;&#35745;&#35823;&#24046;&#30340;&#38271;&#26399;&#29366;&#24577;&#30456;&#20851;&#25104;&#26412;&#12290;&#25105;&#20204;&#20174;&#29702;&#35770;&#19978;&#36890;&#36807;&#21033;&#29992;&#24179;&#22343;&#25104;&#26412;&#32422;&#26463;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#65288;CMDP&#65289;&#29702;&#35770;&#21644;Lagrange&#21160;&#24577;&#35268;&#21010;&#23637;&#31034;&#20102;&#26368;&#20248;&#31574;&#30053;&#30340;&#32467;&#26500;&#12290;&#36890;&#36807;&#21033;&#29992;&#26368;&#20248;&#32467;&#26500;&#32467;&#26524;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31574;&#30053;&#25628;&#32034;&#31639;&#27861;&#65292;&#31216;&#20026;&#20132;&#21449;&#25628;&#32034;&#21152;&#30456;&#23545;&#20540;&#36845;&#20195;&#65288;Insec-RVI&#65289;&#65292;&#21487;&#20197;&#20165;&#36890;&#36807;&#23569;&#37327;&#36845;&#20195;&#25214;&#21040;&#26368;&#20248;&#31574;&#30053;&#12290;&#20026;&#20102;&#36991;&#20813;&#8220;&#32500;&#24230;&#35781;&#21650;&#8221;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16855v1 Announce Type: cross  Abstract: This paper studies semantic-aware communication for remote estimation of multiple Markov sources over a lossy and rate-constrained channel. Unlike most existing studies that treat all source states equally, we exploit the semantics of information and consider that the remote actuator has different tolerances for the estimation errors of different states. We aim to find an optimal scheduling policy that minimizes the long-term state-dependent costs of estimation errors under a transmission frequency constraint. We theoretically show the structure of the optimal policy by leveraging the average-cost Constrained Markov Decision Process (CMDP) theory and the Lagrangian dynamic programming. By exploiting the optimal structural results, we develop a novel policy search algorithm, termed intersection search plus relative value iteration (Insec-RVI), that can find the optimal policy using only a few iterations. To avoid the ``curse of dimensio
&lt;/p&gt;</description></item></channel></rss>