<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#30340;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#25910;&#38598;&#26469;&#33258;&#20013;&#22269;&#19971;&#20010;&#20379;&#24212;&#21830;&#30340;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#21021;&#27493;&#30740;&#31350;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#36827;&#19968;&#27493;&#21457;&#23637;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#26041;&#27861;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#24182;&#22312;&#27169;&#22411;&#29256;&#26435;&#20445;&#25252;&#21644;&#25968;&#23383;&#35777;&#25454;&#21462;&#35777;&#31561;&#23454;&#38469;&#22330;&#26223;&#20013;&#20855;&#26377;&#37325;&#35201;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2208.10489</link><description>&lt;p&gt;
&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#30340;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#65306;&#21021;&#22987;&#25968;&#25454;&#38598;&#19982;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
System Fingerprint Recognition for Deepfake Audio: An Initial Dataset and Investigation. (arXiv:2208.10489v3 [cs.SD] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.10489
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#30340;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#25910;&#38598;&#26469;&#33258;&#20013;&#22269;&#19971;&#20010;&#20379;&#24212;&#21830;&#30340;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#21021;&#27493;&#30740;&#31350;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#36827;&#19968;&#27493;&#21457;&#23637;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#26041;&#27861;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#24182;&#22312;&#27169;&#22411;&#29256;&#26435;&#20445;&#25252;&#21644;&#25968;&#23383;&#35777;&#25454;&#21462;&#35777;&#31561;&#23454;&#38469;&#22330;&#26223;&#20013;&#20855;&#26377;&#37325;&#35201;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#35821;&#38899;&#21512;&#25104;&#27169;&#22411;&#30340;&#24555;&#36895;&#21457;&#23637;&#32473;&#31038;&#20250;&#24102;&#26469;&#20102;&#37325;&#22823;&#23041;&#32961;&#65292;&#20363;&#22914;&#24694;&#24847;&#20869;&#23481;&#25805;&#32437;&#12290;&#22240;&#27492;&#65292;&#35768;&#22810;&#30740;&#31350;&#20986;&#29616;&#20102;&#65292;&#26088;&#22312;&#26816;&#27979;&#25152;&#35859;&#30340;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#24037;&#20316;&#37117;&#38598;&#20013;&#22312;&#23545;&#30495;&#23454;&#38899;&#39057;&#21644;&#20266;&#36896;&#38899;&#39057;&#36827;&#34892;&#20108;&#20803;&#26816;&#27979;&#12290;&#22312;&#27169;&#22411;&#29256;&#26435;&#20445;&#25252;&#21644;&#25968;&#23383;&#35777;&#25454;&#21462;&#35777;&#31561;&#23454;&#38469;&#22330;&#26223;&#20013;&#65292;&#38656;&#35201;&#30693;&#36947;&#29983;&#25104;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#30340;&#24037;&#20855;&#25110;&#27169;&#22411;&#26469;&#35299;&#37322;&#20915;&#31574;&#12290;&#36825;&#20419;&#20351;&#25105;&#20204;&#25552;&#20986;&#19968;&#20010;&#38382;&#39064;&#65306;&#25105;&#20204;&#33021;&#35782;&#21035;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#30340;&#31995;&#32479;&#25351;&#32441;&#21527;&#65311;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#65288;SFR&#65289;&#30340;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#25968;&#25454;&#38598;&#65292;&#24182;&#36827;&#34892;&#20102;&#21021;&#27493;&#30740;&#31350;&#12290;&#25105;&#20204;&#20174;&#20351;&#29992;&#26368;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#30340;&#19971;&#20010;&#20013;&#22269;&#20379;&#24212;&#21830;&#30340;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#20013;&#25910;&#38598;&#20102;&#35813;&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;&#28165;&#26224;&#21644;&#21387;&#32553;&#38598;&#12290;&#27492;&#22806;&#65292;&#20026;&#20102;&#20419;&#36827;&#31995;&#32479;&#25351;&#32441;&#35782;&#21035;&#26041;&#27861;&#30340;&#36827;&#19968;&#27493;&#21457;&#23637;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22806;&#37096;&#21442;&#32771;&#38899;&#39057;&#65292;&#20197;&#20415;&#36827;&#34892;&#35780;&#20272;&#21644;&#23545;&#27604;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rapid progress of deep speech synthesis models has posed significant threats to society such as malicious content manipulation. Therefore, many studies have emerged to detect the so-called deepfake audio. However, existing works focus on the binary detection of real audio and fake audio. In real-world scenarios such as model copyright protection and digital evidence forensics, it is needed to know what tool or model generated the deepfake audio to explain the decision. This motivates us to ask: Can we recognize the system fingerprints of deepfake audio? In this paper, we present the first deepfake audio dataset for system fingerprint recognition (SFR) and conduct an initial investigation. We collected the dataset from the speech synthesis systems of seven Chinese vendors that use the latest state-of-the-art deep learning technologies, including both clean and compressed sets. In addition, to facilitate the further development of system fingerprint recognition methods, we provide ex
&lt;/p&gt;</description></item></channel></rss>