<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36882;&#24402;&#21487;&#34892;&#30340;&#27010;&#29575;&#23433;&#20840;&#22312;&#32447;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#21644;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#65292;&#20351;&#24471;&#31995;&#32479;&#22312;&#22312;&#32447;&#35757;&#32451;&#21644;&#25191;&#34892;&#36807;&#31243;&#20013;&#20445;&#25345;&#23433;&#20840;&#12290;</title><link>http://arxiv.org/abs/2208.10733</link><description>&lt;p&gt;
&#36882;&#24402;&#21487;&#34892;&#30340;&#24102;&#26377;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#30340;&#27010;&#29575;&#23433;&#20840;&#22312;&#32447;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Recursively Feasible Probabilistic Safe Online Learning with Control Barrier Functions. (arXiv:2208.10733v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.10733
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36882;&#24402;&#21487;&#34892;&#30340;&#27010;&#29575;&#23433;&#20840;&#22312;&#32447;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#21644;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#65292;&#20351;&#24471;&#31995;&#32479;&#22312;&#22312;&#32447;&#35757;&#32451;&#21644;&#25191;&#34892;&#36807;&#31243;&#20013;&#20445;&#25345;&#23433;&#20840;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#22522;&#20110;&#23398;&#20064;&#30340;&#25511;&#21046;&#26041;&#26696;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#23637;&#31034;&#20986;&#20102;&#25191;&#34892;&#22797;&#26434;&#20219;&#21153;&#30340;&#39640;&#25928;&#24615;&#12290;&#28982;&#32780;&#65292;&#20026;&#20102;&#22312;&#23454;&#38469;&#31995;&#32479;&#20013;&#37096;&#32626;&#36825;&#20123;&#26041;&#26696;&#65292;&#20445;&#35777;&#31995;&#32479;&#22312;&#22312;&#32447;&#35757;&#32451;&#21644;&#25191;&#34892;&#36807;&#31243;&#20013;&#20445;&#25345;&#23433;&#20840;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#24403;&#21069;&#26368;&#27969;&#34892;&#30340;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#30340;&#26041;&#27861;&#20013;&#65292;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65288;CBFs&#65289;&#20316;&#20026;&#25968;&#23398;&#24037;&#20855;&#65292;&#20026;&#20855;&#26377;&#24050;&#30693;&#21160;&#21147;&#23398;&#30340;&#31995;&#32479;&#25552;&#20379;&#27491;&#24335;&#30340;&#20445;&#25345;&#23433;&#20840;&#30340;&#25511;&#21046;&#21512;&#25104;&#36807;&#31243;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#24341;&#20837;&#20102;&#19968;&#20010;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#24863;&#30693;&#30340;CBF&#23433;&#20840;&#20851;&#38190;&#25511;&#21046;&#22120;&#30340;&#37325;&#26500;&#65292;&#20351;&#29992;&#39640;&#26031;&#36807;&#31243;&#65288;GP&#65289;&#22238;&#24402;&#26469;&#24314;&#31435;&#36817;&#20284;&#25968;&#23398;&#27169;&#22411;&#19982;&#30495;&#23454;&#31995;&#32479;&#20043;&#38388;&#30340;&#20851;&#32852;&#12290;&#19982;&#20197;&#21069;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#24471;&#21040;&#30340;&#40065;&#26834;&#23433;&#20840;&#20851;&#38190;&#25511;&#21046;&#22120;&#30340;&#21487;&#34892;&#24615;&#12290;&#35813;&#21487;&#34892;&#24615;&#20998;&#26512;&#32467;&#26524;&#23548;&#33268;&#20102;&#20851;&#20110;&#31995;&#32479;&#21487;&#29992;&#20449;&#24687;&#24212;&#28385;&#36275;&#30340;&#19968;&#31995;&#21015;&#20016;&#23500;&#26465;&#20214;&#65292;&#20197;&#30830;&#20445;&#12290;
&lt;/p&gt;
&lt;p&gt;
Learning-based control schemes have recently shown great efficacy performing complex tasks for a wide variety of applications. However, in order to deploy them in real systems, it is of vital importance to guarantee that the system will remain safe during online training and execution. Among the currently most popular methods to tackle this challenge, Control Barrier Functions (CBFs) serve as mathematical tools that provide a formal safety-preserving control synthesis procedure for systems with known dynamics. In this paper, we first introduce a model-uncertainty-aware reformulation of CBF-based safety-critical controllers using Gaussian Process (GP) regression to bridge the gap between an approximate mathematical model and the real system. Compared to previous approaches, we study the feasibility of the resulting robust safety-critical controller. This feasibility analysis results in a set of richness conditions that the available information about the system should satisfy to guarant
&lt;/p&gt;</description></item></channel></rss>