<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#22823;&#22411;&#36807;&#31243;&#27169;&#22411;&#65288;LPM&#65289;&#32467;&#21512;&#20102;&#22823;&#35268;&#27169;&#20449;&#24687;&#35821;&#26009;&#24211;&#21644;&#22522;&#20110;&#30693;&#35782;&#31995;&#32479;&#30340;&#26041;&#27861;&#30340;&#20248;&#21183;&#65292;&#26088;&#22312;&#20026;&#32452;&#32455;&#25552;&#20379;&#36807;&#31243;&#24314;&#35758;&#21644;&#20248;&#21270;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2309.00900</link><description>&lt;p&gt;
&#22823;&#22411;&#36807;&#31243;&#27169;&#22411;&#65306;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#26102;&#20195;&#30340;&#19994;&#21153;&#27969;&#31243;&#31649;&#29702;
&lt;/p&gt;
&lt;p&gt;
Large Process Models: Business Process Management in the Age of Generative AI. (arXiv:2309.00900v2 [cs.SE] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00900
&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#36807;&#31243;&#27169;&#22411;&#65288;LPM&#65289;&#32467;&#21512;&#20102;&#22823;&#35268;&#27169;&#20449;&#24687;&#35821;&#26009;&#24211;&#21644;&#22522;&#20110;&#30693;&#35782;&#31995;&#32479;&#30340;&#26041;&#27861;&#30340;&#20248;&#21183;&#65292;&#26088;&#22312;&#20026;&#32452;&#32455;&#25552;&#20379;&#36807;&#31243;&#24314;&#35758;&#21644;&#20248;&#21270;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#21644;&#20854;&#20182;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#26041;&#27861;&#30340;&#25345;&#32493;&#25104;&#21151;&#31361;&#26174;&#20102;&#22823;&#35268;&#27169;&#20449;&#24687;&#35821;&#26009;&#24211;&#30456;&#23545;&#20110;&#20005;&#26684;&#23450;&#20041;&#30340;&#31526;&#21495;&#27169;&#22411;&#30340;&#20248;&#21183;&#65292;&#20294;&#20063;&#35777;&#26126;&#20102;&#32431;&#32479;&#35745;&#26041;&#27861;&#22312;&#23433;&#20840;&#24615;&#21644;&#21487;&#20449;&#24230;&#26041;&#38754;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;&#20026;&#20102;&#23545;LLMs&#21644;&#20854;&#20182;&#22522;&#20110;&#22522;&#30784;&#27169;&#22411;&#30340;&#25216;&#26415;&#30340;&#28508;&#21147;&#21644;&#38480;&#21046;&#36827;&#34892;&#26694;&#26550;&#21270;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22823;&#22411;&#36807;&#31243;&#27169;&#22411;&#65288;LPM&#65289;&#30340;&#27010;&#24565;&#65292;&#23427;&#23558;LLMs&#30340;&#30456;&#20851;&#24615;&#33021;&#21147;&#19982;&#22522;&#20110;&#30693;&#35782;&#31995;&#32479;&#21644;&#33258;&#21160;&#25512;&#29702;&#26041;&#27861;&#30340;&#20998;&#26512;&#31934;&#24230;&#21644;&#21487;&#38752;&#24615;&#30456;&#32467;&#21512;&#12290;LPMs&#34987;&#35774;&#24819;&#20026;&#30452;&#25509;&#21033;&#29992;&#19987;&#23478;&#31215;&#32047;&#30340;&#36807;&#31243;&#31649;&#29702;&#32463;&#39564;&#21644;&#20855;&#26377;&#19981;&#21516;&#29305;&#24449;&#65288;&#20363;&#22914;&#35268;&#27169;&#12289;&#22320;&#21306;&#25110;&#34892;&#19994;&#65289;&#30340;&#32452;&#32455;&#30340;&#36807;&#31243;&#32489;&#25928;&#25968;&#25454;&#12290;&#22312;&#36825;&#20010;&#24895;&#26223;&#20013;&#65292;&#25552;&#20986;&#30340;LPM&#23558;&#20801;&#35768;&#32452;&#32455;&#25509;&#25910;&#21040;&#23545;&#20854;&#29305;&#24449;&#36827;&#34892;&#20102;&#24314;&#27169;&#30340;&#36807;&#31243;&#24314;&#35758;&#21644;&#20248;&#21270;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
The continued success of Large Language Models (LLMs) and other generative artificial intelligence approaches highlights the advantages that large information corpora can have over rigidly defined symbolic models, but also serves as a proof-point of the challenges that purely statistics-based approaches have in terms of safety and trustworthiness. As a framework for contextualizing the potential, as well as the limitations of LLMs and other foundation model-based technologies, we propose the concept of a Large Process Model (LPM) that combines the correlation power of LLMs with the analytical precision and reliability of knowledge-based systems and automated reasoning approaches. LPMs are envisioned to directly utilize the wealth of process management experience that experts have accumulated, as well as process performance data of organizations with diverse characteristics, e.g., regarding size, region, or industry. In this vision, the proposed LPM would allow organizations to receive 
&lt;/p&gt;</description></item></channel></rss>