<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#32447;&#25511;&#21046;&#38382;&#39064;&#20013;&#65292;&#23545;&#20110;&#20984;&#25104;&#26412;&#65292;&#21487;&#20197;&#23454;&#29616; $ \widetilde{O}(\sqrt{T}) $ &#30340;&#36951;&#25022;&#30028;&#65292;&#29978;&#33267;&#22312;&#23384;&#22312;&#26080;&#30028;&#22122;&#22768;&#30340;&#24773;&#20917;&#19979;&#65307;&#21516;&#26102;&#65292;&#22312;&#25104;&#26412;&#20855;&#26377;&#24378;&#20984;&#24615;&#26102;&#65292;&#21487;&#20197;&#22312;&#19981;&#38656;&#35201;&#22122;&#22768;&#21327;&#26041;&#24046;&#26159;&#38750;&#36864;&#21270;&#30340;&#24773;&#20917;&#19979;&#24314;&#31435; $ O({\rm poly} (\log T)) $ &#30340;&#36951;&#25022;&#30028;&#12290;</title><link>https://arxiv.org/abs/2402.10252</link><description>&lt;p&gt;
&#20855;&#26377;&#26080;&#30028;&#21644;&#36864;&#21270;&#22122;&#22768;&#30340;&#32447;&#24615;&#31995;&#32479;&#22312;&#32447;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Online Control of Linear Systems with Unbounded and Degenerate Noise
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10252
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#32447;&#25511;&#21046;&#38382;&#39064;&#20013;&#65292;&#23545;&#20110;&#20984;&#25104;&#26412;&#65292;&#21487;&#20197;&#23454;&#29616; $ \widetilde{O}(\sqrt{T}) $ &#30340;&#36951;&#25022;&#30028;&#65292;&#29978;&#33267;&#22312;&#23384;&#22312;&#26080;&#30028;&#22122;&#22768;&#30340;&#24773;&#20917;&#19979;&#65307;&#21516;&#26102;&#65292;&#22312;&#25104;&#26412;&#20855;&#26377;&#24378;&#20984;&#24615;&#26102;&#65292;&#21487;&#20197;&#22312;&#19981;&#38656;&#35201;&#22122;&#22768;&#21327;&#26041;&#24046;&#26159;&#38750;&#36864;&#21270;&#30340;&#24773;&#20917;&#19979;&#24314;&#31435; $ O({\rm poly} (\log T)) $ &#30340;&#36951;&#25022;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21487;&#33021;&#23384;&#22312;&#26080;&#30028;&#21644;&#36864;&#21270;&#22122;&#22768;&#30340;&#24773;&#20917;&#19979;&#25511;&#21046;&#32447;&#24615;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#25104;&#26412;&#20989;&#25968;&#26410;&#30693;&#65292;&#34987;&#31216;&#20026;&#22312;&#32447;&#25511;&#21046;&#38382;&#39064;&#12290;&#19982;&#29616;&#26377;&#30340;&#20165;&#20551;&#35774;&#22122;&#22768;&#26377;&#30028;&#24615;&#30340;&#30740;&#31350;&#19981;&#21516;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#23545;&#20110;&#20984;&#25104;&#26412;&#65292;&#21363;&#20351;&#22312;&#23384;&#22312;&#26080;&#30028;&#22122;&#22768;&#30340;&#24773;&#20917;&#19979;&#20063;&#21487;&#20197;&#23454;&#29616; $ \widetilde{O}(\sqrt{T}) $ &#30340;&#36951;&#25022;&#30028;&#65292;&#20854;&#20013; $ T $ &#34920;&#31034;&#26102;&#38388;&#36328;&#24230;&#12290;&#27492;&#22806;&#65292;&#24403;&#25104;&#26412;&#20855;&#26377;&#24378;&#20984;&#24615;&#26102;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010; $ O({\rm poly} (\log T)) $ &#30340;&#36951;&#25022;&#30028;&#65292;&#32780;&#19981;&#38656;&#35201;&#22122;&#22768;&#21327;&#26041;&#24046;&#26159;&#38750;&#36864;&#21270;&#30340;&#20551;&#35774;&#65292;&#36825;&#22312;&#25991;&#29486;&#20013;&#26159;&#24517;&#38656;&#30340;&#12290;&#28040;&#38500;&#22122;&#22768;&#31209;&#30340;&#20851;&#38190;&#26159;&#19982;&#22122;&#22768;&#21327;&#26041;&#24046;&#30456;&#20851;&#32852;&#30340;&#31995;&#32479;&#36716;&#21270;&#12290;&#36825;&#21516;&#26102;&#23454;&#29616;&#20102;&#22312;&#32447;&#25511;&#21046;&#31639;&#27861;&#30340;&#21442;&#25968;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10252v1 Announce Type: cross  Abstract: This paper investigates the problem of controlling a linear system under possibly unbounded and degenerate noise with unknown cost functions, known as an online control problem. In contrast to the existing work, which assumes the boundedness of noise, we reveal that for convex costs, an $ \widetilde{O}(\sqrt{T}) $ regret bound can be achieved even for unbounded noise, where $ T $ denotes the time horizon. Moreover, when the costs are strongly convex, we establish an $ O({\rm poly} (\log T)) $ regret bound without the assumption that noise covariance is non-degenerate, which has been required in the literature. The key ingredient in removing the rank assumption on noise is a system transformation associated with the noise covariance. This simultaneously enables the parameter reduction of an online control algorithm.
&lt;/p&gt;</description></item></channel></rss>