<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#22686;&#24378;&#26041;&#27861;Hyperedge Augmentation (HyperAug)&#65292;&#36890;&#36807;&#26500;&#24314;&#30452;&#25509;&#20174;&#21407;&#22987;&#25968;&#25454;&#24418;&#25104;&#30340;&#34394;&#25311;&#36229;&#36793;&#65292;&#20197;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#22797;&#26434;&#32593;&#32476;&#34920;&#31034;&#20013;&#39640;&#38454;&#33410;&#28857;&#20851;&#31995;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2402.13033</link><description>&lt;p&gt;
&#29992;&#36229;&#36793;&#22686;&#24378;&#25913;&#36827;&#29616;&#23454;&#19990;&#30028;&#22797;&#26434;&#32593;&#32476;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Enhancing Real-World Complex Network Representations with Hyperedge Augmentation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13033
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#22686;&#24378;&#26041;&#27861;Hyperedge Augmentation (HyperAug)&#65292;&#36890;&#36807;&#26500;&#24314;&#30452;&#25509;&#20174;&#21407;&#22987;&#25968;&#25454;&#24418;&#25104;&#30340;&#34394;&#25311;&#36229;&#36793;&#65292;&#20197;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#22797;&#26434;&#32593;&#32476;&#34920;&#31034;&#20013;&#39640;&#38454;&#33410;&#28857;&#20851;&#31995;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13033v1 &#20844;&#21578;&#31867;&#22411;: &#26032;&#25688;&#35201;: &#22270;&#22686;&#24378;&#26041;&#27861;&#22312;&#25913;&#36827;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#30340;&#24615;&#33021;&#21644;&#22686;&#24378;&#27867;&#21270;&#33021;&#21147;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#29616;&#26377;&#30340;&#22270;&#22686;&#24378;&#26041;&#27861;&#20027;&#35201;&#25200;&#21160;&#22270;&#32467;&#26500;&#65292;&#36890;&#24120;&#38480;&#20110;&#25104;&#23545;&#33410;&#28857;&#20851;&#31995;&#12290;&#36825;&#20123;&#26041;&#27861;&#26080;&#27861;&#23436;&#20840;&#35299;&#20915;&#30495;&#23454;&#19990;&#30028;&#22823;&#35268;&#27169;&#32593;&#32476;&#30340;&#22797;&#26434;&#24615;&#65292;&#36825;&#20123;&#32593;&#32476;&#36890;&#24120;&#28041;&#21450;&#39640;&#38454;&#33410;&#28857;&#20851;&#31995;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#25104;&#23545;&#20851;&#31995;&#12290;&#21516;&#26102;&#65292;&#30001;&#20110;&#32570;&#20047;&#21487;&#29992;&#20110;&#24418;&#25104;&#39640;&#38454;&#36793;&#30340;&#25968;&#25454;&#65292;&#30495;&#23454;&#19990;&#30028;&#22270;&#25968;&#25454;&#38598;&#20027;&#35201;&#34987;&#24314;&#27169;&#20026;&#31616;&#21333;&#22270;&#12290;&#22240;&#27492;&#65292;&#23558;&#39640;&#38454;&#36793;&#37325;&#26032;&#37197;&#32622;&#20026;&#22270;&#22686;&#24378;&#31574;&#30053;&#30340;&#19968;&#37096;&#20998;&#26159;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#30740;&#31350;&#36335;&#24452;&#65292;&#21487;&#35299;&#20915;&#21069;&#36848;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#36229;&#36793;&#22686;&#24378;&#65288;HyperAug&#65289;&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#22686;&#24378;&#26041;&#27861;&#65292;&#30452;&#25509;&#20174;&#21407;&#22987;&#25968;&#25454;&#26500;&#24314;&#34394;&#25311;&#36229;&#36793;&#65292;&#24182;&#20135;&#29983;&#36741;&#21161;&#33410;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13033v1 Announce Type: new  Abstract: Graph augmentation methods play a crucial role in improving the performance and enhancing generalisation capabilities in Graph Neural Networks (GNNs). Existing graph augmentation methods mainly perturb the graph structures and are usually limited to pairwise node relations. These methods cannot fully address the complexities of real-world large-scale networks that often involve higher-order node relations beyond only being pairwise. Meanwhile, real-world graph datasets are predominantly modelled as simple graphs, due to the scarcity of data that can be used to form higher-order edges. Therefore, reconfiguring the higher-order edges as an integration into graph augmentation strategies lights up a promising research path to address the aforementioned issues. In this paper, we present Hyperedge Augmentation (HyperAug), a novel graph augmentation method that constructs virtual hyperedges directly form the raw data, and produces auxiliary nod
&lt;/p&gt;</description></item></channel></rss>