<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;PromptCodec&#65292;&#19968;&#31181;&#20351;&#29992;&#31163;&#25955;&#34920;&#31034;&#23398;&#20064;&#30340;&#29305;&#24449;&#24863;&#30693;&#25552;&#31034;&#32534;&#30721;&#22120;&#30340;&#39640;&#20445;&#30495;&#31070;&#32463;&#35821;&#38899;&#32534;&#35299;&#30721;&#22120;&#65292;&#36890;&#36807;&#24341;&#20837;&#39069;&#22806;&#29305;&#24449;&#34920;&#31034;&#12289;&#33258;&#36866;&#24212;&#29305;&#24449;&#21152;&#26435;&#34701;&#21512;&#21644;&#25928;&#29575;&#20248;&#21270;&#26469;&#35299;&#20915;&#39640;&#21387;&#32553;&#29575;&#19979;&#30340;&#39640;&#20445;&#30495;&#38899;&#39057;&#37325;&#24314;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2404.02702</link><description>&lt;p&gt;
PromptCodec: &#20351;&#29992;&#22522;&#20110;&#33258;&#36866;&#24212;&#29305;&#24449;&#24863;&#30693;&#30340;&#31163;&#25955;&#34920;&#31034;&#23398;&#20064;&#30340;&#39640;&#20445;&#30495;&#31070;&#32463;&#35821;&#38899;&#32534;&#35299;&#30721;&#22120;
&lt;/p&gt;
&lt;p&gt;
PromptCodec: High-Fidelity Neural Speech Codec using Disentangled Representation Learning based Adaptive Feature-aware Prompt Encoders
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02702
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;PromptCodec&#65292;&#19968;&#31181;&#20351;&#29992;&#31163;&#25955;&#34920;&#31034;&#23398;&#20064;&#30340;&#29305;&#24449;&#24863;&#30693;&#25552;&#31034;&#32534;&#30721;&#22120;&#30340;&#39640;&#20445;&#30495;&#31070;&#32463;&#35821;&#38899;&#32534;&#35299;&#30721;&#22120;&#65292;&#36890;&#36807;&#24341;&#20837;&#39069;&#22806;&#29305;&#24449;&#34920;&#31034;&#12289;&#33258;&#36866;&#24212;&#29305;&#24449;&#21152;&#26435;&#34701;&#21512;&#21644;&#25928;&#29575;&#20248;&#21270;&#26469;&#35299;&#20915;&#39640;&#21387;&#32553;&#29575;&#19979;&#30340;&#39640;&#20445;&#30495;&#38899;&#39057;&#37325;&#24314;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#35821;&#38899;&#32534;&#35299;&#30721;&#22120;&#36817;&#26469;&#22312;&#29983;&#25104;&#35821;&#38899;&#24314;&#27169;&#39046;&#22495;&#24341;&#36215;&#24191;&#27867;&#20851;&#27880;&#65292;&#20363;&#22914;&#35821;&#38899;&#36716;&#25442;&#12289;&#25991;&#26412;&#36716;&#35821;&#38899;&#21512;&#25104;&#31561;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#21387;&#32553;&#29575;&#19979;&#30830;&#20445;&#35821;&#38899;&#32534;&#35299;&#30721;&#22120;&#30340;&#39640;&#20445;&#30495;&#38899;&#39057;&#37325;&#24314;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#19988;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;PromptCodec&#65292;&#19968;&#31181;&#20351;&#29992;&#22522;&#20110;&#31163;&#25955;&#34920;&#31034;&#23398;&#20064;&#30340;&#29305;&#24449;&#24863;&#30693;&#25552;&#31034;&#32534;&#30721;&#22120;&#30340;&#26032;&#22411;&#31471;&#21040;&#31471;&#31070;&#32463;&#35821;&#38899;&#32534;&#35299;&#30721;&#22120;&#27169;&#22411;&#12290;&#36890;&#36807;&#24341;&#20837;&#26469;&#33258;&#25552;&#31034;&#32534;&#30721;&#22120;&#30340;&#39069;&#22806;&#29305;&#24449;&#34920;&#31034;&#65292;PromptCodec&#21487;&#20197;&#20998;&#37197;&#38656;&#35201;&#22788;&#29702;&#30340;&#35821;&#38899;&#20449;&#24687;&#24182;&#22686;&#24378;&#20854;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#33258;&#36866;&#24212;&#29305;&#24449;&#21152;&#26435;&#34701;&#21512;&#26041;&#27861;&#65292;&#20197;&#25972;&#21512;&#19981;&#21516;&#32534;&#30721;&#22120;&#30340;&#29305;&#24449;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20313;&#24358;&#36317;&#31163;&#30340;&#26032;&#39062;&#31163;&#25955;&#34920;&#31034;&#23398;&#20064;&#31574;&#30053;&#65292;&#20197;&#20248;&#21270;PromptCodec&#30340;&#32534;&#30721;&#22120;&#20197;&#30830;&#20445;&#20854;&#25928;&#29575;&#65292;&#36827;&#19968;&#27493;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02702v1 Announce Type: cross  Abstract: Neural speech codec has recently gained widespread attention in generative speech modeling domains, like voice conversion, text-to-speech synthesis, etc. However, ensuring high-fidelity audio reconstruction of speech codecs under high compression rates remains an open and challenging issue. In this paper, we propose PromptCodec, a novel end-to-end neural speech codec model using disentangled representation learning based feature-aware prompt encoders. By incorporating additional feature representations from prompt encoders, PromptCodec can distribute the speech information requiring processing and enhance its capabilities. Moreover, a simple yet effective adaptive feature weighted fusion approach is introduced to integrate features of different encoders. Meanwhile, we propose a novel disentangled representation learning strategy based on cosine distance to optimize PromptCodec's encoders to ensure their efficiency, thereby further impr
&lt;/p&gt;</description></item></channel></rss>