<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#36890;&#36807;&#32852;&#21512;&#25193;&#25955;&#33410;&#28857;&#21644;&#36793;&#23646;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#22270;&#24418;&#29983;&#25104;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#25152;&#26377;&#22270;&#32452;&#20214;&#65292;&#24182;&#36890;&#36807;&#27880;&#24847;&#27169;&#22359;&#21644;&#30456;&#20114;&#20381;&#36182;&#30340;&#33410;&#28857;&#12289;&#36793;&#21644;&#37051;&#25509;&#20449;&#24687;&#23454;&#29616;&#20102;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.04046</link><description>&lt;p&gt;
&#36890;&#36807;&#33410;&#28857;&#21644;&#36793;&#23646;&#24615;&#30340;&#32852;&#21512;&#25193;&#25955;&#65292;&#23454;&#29616;&#22270;&#24418;&#30340;&#29983;&#25104;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Generative Modeling of Graphs via Joint Diffusion of Node and Edge Attributes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04046
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#32852;&#21512;&#25193;&#25955;&#33410;&#28857;&#21644;&#36793;&#23646;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#22270;&#24418;&#29983;&#25104;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#25152;&#26377;&#22270;&#32452;&#20214;&#65292;&#24182;&#36890;&#36807;&#27880;&#24847;&#27169;&#22359;&#21644;&#30456;&#20114;&#20381;&#36182;&#30340;&#33410;&#28857;&#12289;&#36793;&#21644;&#37051;&#25509;&#20449;&#24687;&#23454;&#29616;&#20102;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#29983;&#25104;&#26159;&#21508;&#31181;&#24037;&#31243;&#21644;&#31185;&#23398;&#23398;&#31185;&#30340;&#22522;&#30784;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#26041;&#27861;&#24448;&#24448;&#24573;&#35270;&#20102;&#36793;&#23646;&#24615;&#30340;&#29983;&#25104;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20123;&#20851;&#38190;&#24212;&#29992;&#20013;&#36793;&#23646;&#24615;&#30340;&#37325;&#35201;&#24615;&#65292;&#36825;&#20351;&#24471;&#20808;&#21069;&#30340;&#26041;&#27861;&#22312;&#36825;&#20123;&#24773;&#22659;&#20013;&#21487;&#33021;&#19981;&#36866;&#29992;&#12290;&#27492;&#22806;&#65292;&#34429;&#28982;&#23384;&#22312;&#19968;&#20123;&#31616;&#21333;&#30340;&#36866;&#24212;&#26041;&#27861;&#65292;&#20294;&#32463;&#39564;&#35843;&#26597;&#26174;&#31034;&#23427;&#20204;&#30340;&#25928;&#26524;&#26377;&#38480;&#65292;&#22240;&#20026;&#23427;&#20204;&#27809;&#26377;&#24456;&#22909;&#22320;&#27169;&#25311;&#22270;&#32452;&#20214;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#33410;&#28857;&#21644;&#36793;&#30340;&#32852;&#21512;&#35780;&#20998;&#27169;&#22411;&#65292;&#29992;&#20110;&#22270;&#24418;&#29983;&#25104;&#65292;&#32771;&#34385;&#20102;&#25152;&#26377;&#22270;&#32452;&#20214;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#20004;&#20010;&#20851;&#38190;&#21019;&#26032;&#28857;&#65306;(i) &#23558;&#33410;&#28857;&#21644;&#36793;&#23646;&#24615;&#32467;&#21512;&#22312;&#19968;&#20010;&#27880;&#24847;&#27169;&#22359;&#20013;&#65292;&#22522;&#20110;&#36825;&#20004;&#20010;&#22240;&#32032;&#29983;&#25104;&#26679;&#26412;&#65307;(ii) &#22312;&#22270;&#24418;&#25193;&#25955;&#36807;&#31243;&#20013;&#65292;&#33410;&#28857;&#12289;&#36793;&#21644;&#37051;&#25509;&#20449;&#24687;&#30456;&#20114;&#20381;&#36182;&#12290;&#25105;&#20204;&#22312;&#28041;&#21450;&#23454;&#38469;&#21644;&#21512;&#25104;&#25968;&#25454;&#38598;&#30340;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#22522;&#20934;&#27979;&#35797;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#20854;&#20013;&#21253;&#21547;&#36793;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph generation is integral to various engineering and scientific disciplines. Nevertheless, existing methodologies tend to overlook the generation of edge attributes. However, we identify critical applications where edge attributes are essential, making prior methods potentially unsuitable in such contexts. Moreover, while trivial adaptations are available, empirical investigations reveal their limited efficacy as they do not properly model the interplay among graph components. To address this, we propose a joint score-based model of nodes and edges for graph generation that considers all graph components. Our approach offers two key novelties: (i) node and edge attributes are combined in an attention module that generates samples based on the two ingredients; and (ii) node, edge and adjacency information are mutually dependent during the graph diffusion process. We evaluate our method on challenging benchmarks involving real-world and synthetic datasets in which edge features are cr
&lt;/p&gt;</description></item></channel></rss>