<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24320;&#21457;SmartonAI&#25554;&#20214;&#65292;&#22522;&#20110;GPT&#21644;BERT&#31561;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#25552;&#20379;&#19968;&#31181;&#26032;&#30340;&#20132;&#20114;&#33539;&#24335;&#26469;&#35299;&#20915;EDA&#36719;&#20214;&#20013;&#21021;&#23398;&#32773;&#38754;&#20020;&#30340;&#22797;&#26434;&#21629;&#20196;&#32467;&#26500;&#21644;&#39640;&#23398;&#20064;&#26354;&#32447;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2307.14740</link><description>&lt;p&gt;
&#22522;&#20110;GPT&#30340;&#22797;&#26434;EDA&#36719;&#20214;&#26032;&#20132;&#20114;&#33539;&#24335;
&lt;/p&gt;
&lt;p&gt;
New Interaction Paradigm for Complex EDA Software Leveraging GPT. (arXiv:2307.14740v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14740
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24320;&#21457;SmartonAI&#25554;&#20214;&#65292;&#22522;&#20110;GPT&#21644;BERT&#31561;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#25552;&#20379;&#19968;&#31181;&#26032;&#30340;&#20132;&#20114;&#33539;&#24335;&#26469;&#35299;&#20915;EDA&#36719;&#20214;&#20013;&#21021;&#23398;&#32773;&#38754;&#20020;&#30340;&#22797;&#26434;&#21629;&#20196;&#32467;&#26500;&#21644;&#39640;&#23398;&#20064;&#26354;&#32447;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#30005;&#23376;&#35774;&#35745;&#33258;&#21160;&#21270;&#65288;EDA&#65289;&#39046;&#22495;&#20013;&#65292;&#19987;&#19994;&#36719;&#20214;&#22914;KiCad&#12289;Cadence&#21644;Altium Designer&#25552;&#20379;&#36234;&#26469;&#36234;&#24191;&#27867;&#30340;&#35774;&#35745;&#21151;&#33021;&#12290;&#28982;&#32780;&#65292;&#22797;&#26434;&#30340;&#21629;&#20196;&#32467;&#26500;&#21644;&#36739;&#39640;&#30340;&#23398;&#20064;&#26354;&#32447;&#23545;&#20110;&#21021;&#23398;&#32773;&#30340;&#21360;&#21047;&#30005;&#36335;&#26495;&#65288;PCB&#65289;&#35774;&#35745;&#24072;&#26469;&#35828;&#36896;&#25104;&#20102;&#38556;&#30861;&#12290;&#36825;&#23548;&#33268;&#38590;&#20197;&#36873;&#25321;&#36866;&#21512;&#19981;&#21516;&#35774;&#35745;&#30446;&#30340;&#30340;&#21151;&#33021;&#25110;&#25554;&#20214;&#65292;&#24182;&#19988;&#20256;&#32479;&#25991;&#26723;&#12289;&#35270;&#39057;&#21644;&#22312;&#32447;&#35770;&#22363;&#20043;&#22806;&#32570;&#20047;&#30452;&#35266;&#30340;&#23398;&#20064;&#26041;&#27861;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#21517;&#20026;SmartonAI&#30340;EDA&#36719;&#20214;&#20154;&#24037;&#26234;&#33021;&#20132;&#20114;&#36741;&#21161;&#25554;&#20214;&#65292;&#20854;&#20013;&#20197;KiCad&#20316;&#20026;&#31532;&#19968;&#20010;&#31034;&#20363;&#12290;SmartonAI&#21463;&#21040;HuggingGPT&#26694;&#26550;&#30340;&#21551;&#21457;&#65292;&#37319;&#29992;&#20102;GPT&#21644;BERT&#31561;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#20197;&#20419;&#36827;&#20219;&#21153;&#35268;&#21010;&#21644;&#25191;&#34892;&#12290;&#24403;&#25509;&#25910;&#21040;&#35774;&#35745;&#24072;&#30340;&#35831;&#27714;&#26102;&#65292;SmartonAI&#20250;&#36827;&#34892;&#20219;&#21153;&#20998;&#35299;&#24182;&#39640;&#25928;&#25191;&#34892;&#30456;&#20851;&#30340;&#23376;&#20219;&#21153;&#65292;
&lt;/p&gt;
&lt;p&gt;
In the rapidly growing field of electronic design automation (EDA), professional software such as KiCad, Cadence , and Altium Designer provide increasingly extensive design functionalities. However, the intricate command structure and high learning curve create a barrier, particularly for novice printed circuit board (PCB) designers. This results in difficulties in selecting appropriate functions or plugins for varying design purposes, compounded by the lack of intuitive learning methods beyond traditional documentation, videos, and online forums. To address this challenge, an artificial intelligence (AI) interaction assist plugin for EDA software named SmartonAl is developed here, also KiCad is taken as the first example. SmartonAI is inspired by the HuggingGPT framework and employs large language models, such as GPT and BERT, to facilitate task planning and execution. On receiving a designer request, SmartonAI conducts a task breakdown and efficiently executes relevant subtasks, such
&lt;/p&gt;</description></item></channel></rss>