<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.05024</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#26159;&#21542;&#26377;&#21161;&#20110;&#26356;&#22823;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05024
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#25968;&#25454;&#38598;&#22312;&#24403;&#20195;&#25968;&#25454;&#39537;&#21160;&#30740;&#31350;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#23427;&#20204;&#36890;&#36807;&#20419;&#36827;&#26032;&#27169;&#24335;&#21644;&#29616;&#35937;&#30340;&#21457;&#29616;&#65292;&#25512;&#21160;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;&#36825;&#31181;&#23545;&#23454;&#35777;&#30740;&#31350;&#30340;&#19981;&#26029;&#38656;&#27714;&#24341;&#21457;&#20102;&#20851;&#20110;&#22914;&#20309;&#22312;&#30740;&#31350;&#39033;&#30446;&#20013;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#25968;&#25454;&#20197;&#20419;&#36827;&#31185;&#23398;&#36827;&#27493;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#37325;&#32452;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#21019;&#26032;&#24615;&#22320;&#32452;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#21253;&#25324;&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#65292;&#21487;&#20197;&#23548;&#33268;&#39640;&#24433;&#21709;&#30340;&#21457;&#29616;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36229;&#36807;30,000&#31687;&#25991;&#31456;&#20013;&#20351;&#29992;&#20102;&#36229;&#36807;6,000&#20010;&#25968;&#25454;&#38598;&#30340;&#31038;&#20250;&#31185;&#23398;&#25968;&#25454;&#24211;ICPSR&#20013;&#36825;&#31181;&#38750;&#20856;&#22411;&#25968;&#25454;&#32452;&#21512;&#30340;&#31185;&#23398;&#25104;&#26524;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22235;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#32452;&#21512;&#25968;&#25454;&#38598;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#19981;&#24120;&#35265;&#30340;&#32452;&#21512;&#65292;&#23545;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#21521;&#19968;&#33324;&#20844;&#20247;&#20256;&#25773;&#65289;&#37117;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;&#65288;MHSNs&#65289;&#65292;&#21033;&#29992;&#22810;&#23610;&#24230;&#22522;&#30784;&#35789;&#20856;&#21644;&#21367;&#31215;&#32467;&#26500;&#65292;&#29983;&#25104;&#23545;&#33410;&#28857;&#25490;&#21015;&#19981;&#21464;&#30340;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2311.10270</link><description>&lt;p&gt;
&#29992;&#20110;&#25968;&#25454;&#20998;&#26512;&#30340;&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Multiscale Hodge Scattering Networks for Data Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.10270
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;&#65288;MHSNs&#65289;&#65292;&#21033;&#29992;&#22810;&#23610;&#24230;&#22522;&#30784;&#35789;&#20856;&#21644;&#21367;&#31215;&#32467;&#26500;&#65292;&#29983;&#25104;&#23545;&#33410;&#28857;&#25490;&#21015;&#19981;&#21464;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25955;&#23556;&#32593;&#32476;&#65292;&#29992;&#20110;&#22312;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#19978;&#27979;&#37327;&#30340;&#20449;&#21495;&#65292;&#31216;&#20026;\emph{&#22810;&#23610;&#24230;&#38669;&#22855;&#25955;&#23556;&#32593;&#32476;}&#65288;MHSNs&#65289;&#12290;&#25105;&#20204;&#30340;&#26500;&#36896;&#22522;&#20110;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#19978;&#30340;&#22810;&#23610;&#24230;&#22522;&#30784;&#35789;&#20856;&#65292;&#21363;$\kappa$-GHWT&#21644;$\kappa$-HGLET&#65292;&#25105;&#20204;&#26368;&#36817;&#20026;&#32473;&#23450;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#20013;&#30340;&#32500;&#24230;$\kappa \in \mathbb{N}$&#25512;&#24191;&#20102;&#22522;&#20110;&#33410;&#28857;&#30340;&#24191;&#20041;&#21704;-&#27779;&#20160;&#21464;&#25442;&#65288;GHWT&#65289;&#21644;&#20998;&#23618;&#22270;&#25289;&#26222;&#25289;&#26031;&#29305;&#24449;&#21464;&#25442;&#65288;HGLET&#65289;&#12290;$\kappa$-GHWT&#21644;$\kappa$-HGLET&#37117;&#24418;&#25104;&#20887;&#20313;&#38598;&#21512;&#65288;&#21363;&#35789;&#20856;&#65289;&#30340;&#22810;&#23610;&#24230;&#22522;&#30784;&#21521;&#37327;&#21644;&#32473;&#23450;&#20449;&#21495;&#30340;&#30456;&#24212;&#25193;&#23637;&#31995;&#25968;&#12290;&#25105;&#20204;&#30340;MHSNs&#20351;&#29992;&#31867;&#20284;&#20110;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#30340;&#20998;&#23618;&#32467;&#26500;&#26469;&#32423;&#32852;&#35789;&#20856;&#31995;&#25968;&#27169;&#30340;&#30697;&#12290;&#25152;&#24471;&#29305;&#24449;&#23545;&#21333;&#32431;&#22797;&#21512;&#20223;&#23556;&#30340;&#37325;&#26032;&#25490;&#24207;&#19981;&#21464;&#65288;&#21363;&#33410;&#28857;&#25490;&#21015;&#30340;&#32622;&#25442;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.10270v2 Announce Type: replace  Abstract: We propose new scattering networks for signals measured on simplicial complexes, which we call \emph{Multiscale Hodge Scattering Networks} (MHSNs). Our construction is based on multiscale basis dictionaries on simplicial complexes, i.e., the $\kappa$-GHWT and $\kappa$-HGLET, which we recently developed for simplices of dimension $\kappa \in \mathbb{N}$ in a given simplicial complex by generalizing the node-based Generalized Haar-Walsh Transform (GHWT) and Hierarchical Graph Laplacian Eigen Transform (HGLET). The $\kappa$-GHWT and the $\kappa$-HGLET both form redundant sets (i.e., dictionaries) of multiscale basis vectors and the corresponding expansion coefficients of a given signal. Our MHSNs use a layered structure analogous to a convolutional neural network (CNN) to cascade the moments of the modulus of the dictionary coefficients. The resulting features are invariant to reordering of the simplices (i.e., node permutation of the u
&lt;/p&gt;</description></item></channel></rss>