<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#19981;&#21464;&#37051;&#22495;&#27169;&#24335;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#33258;&#36866;&#24212;&#37051;&#22495;&#20256;&#25773;&#27169;&#22359;&#21644;&#19981;&#21464;&#38750;&#21516;&#28304;&#22270;&#23398;&#20064;&#27169;&#22359;&#65292;&#35299;&#20915;&#20102;&#38750;&#21516;&#28304;&#22270;&#19978;&#37051;&#22495;&#27169;&#24335;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.10572</link><description>&lt;p&gt;
&#21457;&#29616;&#24322;&#24615;&#22270;&#30340;&#19981;&#21464;&#37051;&#22495;&#27169;&#24335;
&lt;/p&gt;
&lt;p&gt;
Discovering Invariant Neighborhood Patterns for Heterophilic Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10572
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#19981;&#21464;&#37051;&#22495;&#27169;&#24335;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#33258;&#36866;&#24212;&#37051;&#22495;&#20256;&#25773;&#27169;&#22359;&#21644;&#19981;&#21464;&#38750;&#21516;&#28304;&#22270;&#23398;&#20064;&#27169;&#22359;&#65292;&#35299;&#20915;&#20102;&#38750;&#21516;&#28304;&#22270;&#19978;&#37051;&#22495;&#27169;&#24335;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21516;&#28304;&#22270;&#19978;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#12290;&#22823;&#22810;&#25968;&#29616;&#26377;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#20381;&#36182;&#20110;&#21516;&#28304;&#20551;&#35774;&#65292;&#21363;&#21516;&#19968;&#31867;&#21035;&#30340;&#33410;&#28857;&#26356;&#26377;&#21487;&#33021;&#34987;&#36830;&#25509;&#12290;&#28982;&#32780;&#65292;&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#22270;&#20013;&#65292;&#36825;&#31181;&#21516;&#28304;&#24615;&#20551;&#35774;&#24182;&#19981;&#24635;&#26159;&#25104;&#31435;&#65292;&#36825;&#23548;&#33268;&#20102;&#22312;&#20808;&#21069;&#30340;&#26041;&#27861;&#20013;&#26410;&#33021;&#35299;&#37322;&#30340;&#26356;&#22797;&#26434;&#30340;&#20998;&#24067;&#20559;&#31227;&#12290;&#22312;&#38750;&#21516;&#28304;&#22270;&#19978;&#65292;&#37051;&#22495;&#27169;&#24335;&#30340;&#20998;&#24067;&#20559;&#31227;&#26356;&#21152;&#22810;&#26679;&#21270;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#19981;&#21464;&#37051;&#22495;&#27169;&#24335;&#23398;&#20064;&#65288;INPL&#65289;&#26041;&#27861;&#65292;&#20197;&#32531;&#35299;&#38750;&#21516;&#28304;&#22270;&#19978;&#30340;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#37051;&#22495;&#20256;&#25773;&#65288;ANP&#65289;&#27169;&#22359;&#26469;&#25429;&#33719;&#33258;&#36866;&#24212;&#30340;&#37051;&#22495;&#20449;&#24687;&#65292;&#36825;&#21487;&#20197;&#32531;&#35299;&#38750;&#21516;&#28304;&#22270;&#19978;&#30340;&#37051;&#22495;&#27169;&#24335;&#20998;&#24067;&#20559;&#31227;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19981;&#21464;&#38750;&#21516;&#28304;&#22270;&#23398;&#20064;&#65288;INHGL&#65289;&#27169;&#22359;&#65292;&#20854;&#32422;&#26463;&#20102;ANP&#24182;&#36827;&#34892;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10572v1 Announce Type: new  Abstract: This paper studies the problem of distribution shifts on non-homophilous graphs Mosting existing graph neural network methods rely on the homophilous assumption that nodes from the same class are more likely to be linked. However, such assumptions of homophily do not always hold in real-world graphs, which leads to more complex distribution shifts unaccounted for in previous methods. The distribution shifts of neighborhood patterns are much more diverse on non-homophilous graphs. We propose a novel Invariant Neighborhood Pattern Learning (INPL) to alleviate the distribution shifts problem on non-homophilous graphs. Specifically, we propose the Adaptive Neighborhood Propagation (ANP) module to capture the adaptive neighborhood information, which could alleviate the neighborhood pattern distribution shifts problem on non-homophilous graphs. We propose Invariant Non-Homophilous Graph Learning (INHGL) module to constrain the ANP and learn in
&lt;/p&gt;</description></item></channel></rss>