<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#25552;&#20986;&#20102;BirdSet&#22522;&#20934;&#65292;&#29992;&#20110;&#40479;&#31867;&#29983;&#29289;&#22768;&#23398;&#20013;&#30340;&#20998;&#31867;&#20219;&#21153;&#65292;&#25972;&#21512;&#24320;&#28304;&#40479;&#31867;&#24405;&#38899;&#25968;&#25454;&#38598;&#21512;&#65292;&#20840;&#38754;&#35780;&#20272;&#27169;&#22411;&#24615;&#33021;&#21644;&#35782;&#21035;&#28508;&#22312;&#19981;&#36275;&#12290;</title><link>https://arxiv.org/abs/2403.10380</link><description>&lt;p&gt;
BirdSet&#65306;&#40479;&#31867;&#29983;&#29289;&#22768;&#23398;&#20998;&#31867;&#30340;&#22810;&#20219;&#21153;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
BirdSet: A Multi-Task Benchmark for Classification in Avian Bioacoustics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10380
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;BirdSet&#22522;&#20934;&#65292;&#29992;&#20110;&#40479;&#31867;&#29983;&#29289;&#22768;&#23398;&#20013;&#30340;&#20998;&#31867;&#20219;&#21153;&#65292;&#25972;&#21512;&#24320;&#28304;&#40479;&#31867;&#24405;&#38899;&#25968;&#25454;&#38598;&#21512;&#65292;&#20840;&#38754;&#35780;&#20272;&#27169;&#22411;&#24615;&#33021;&#21644;&#35782;&#21035;&#28508;&#22312;&#19981;&#36275;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#24050;&#32463;&#25104;&#20026;&#40479;&#31867;&#29983;&#29289;&#22768;&#23398;&#39046;&#22495;&#35786;&#26029;&#29615;&#22659;&#20581;&#24247;&#21644;&#29983;&#29289;&#22810;&#26679;&#24615;&#30340;&#24378;&#22823;&#24037;&#20855;&#65292;&#20294;&#30740;&#31350;&#20013;&#23384;&#22312;&#30340;&#19981;&#19968;&#33268;&#24615;&#32473;&#36825;&#19968;&#39046;&#22495;&#30340;&#36827;&#23637;&#24102;&#26469;&#20102;&#26174;&#33879;&#25361;&#25112;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;BirdSet&#22522;&#20934;&#65292;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#32508;&#21512;&#30740;&#31350;&#21162;&#21147;&#65292;&#20197;&#20840;&#38754;&#20998;&#31867;&#40479;&#31867;&#40483;&#21483;&#22768;&#12290;BirdSet&#23558;&#24320;&#28304;&#40479;&#31867;&#24405;&#38899;&#25972;&#21512;&#21040;&#19968;&#20010;&#31934;&#24515;&#31574;&#21010;&#30340;&#25968;&#25454;&#38598;&#21512;&#20013;&#65292;&#25552;&#20379;&#23545;&#27169;&#22411;&#24615;&#33021;&#30340;&#28145;&#20837;&#29702;&#35299;&#65292;&#24182;&#35782;&#21035;&#36328;&#19981;&#21516;&#30740;&#31350;&#30340;&#28508;&#22312;&#19981;&#36275;&#20043;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10380v1 Announce Type: cross  Abstract: Deep learning (DL) models have emerged as a powerful tool in avian bioacoustics to diagnose environmental health and biodiversity. However, inconsistencies in research pose notable challenges hindering progress in this domain. Reliable DL models need to analyze bird calls flexibly across various species and environments to fully harness the potential of bioacoustics in a cost-effective passive acoustic monitoring scenario. Data fragmentation and opacity across studies complicate a comprehensive evaluation of general model performance. To overcome these challenges, we present the BirdSet benchmark, a unified framework consolidating research efforts with a holistic approach for classifying bird vocalizations in avian bioacoustics. BirdSet harmonizes open-source bird recordings into a curated dataset collection. This unified approach provides an in-depth understanding of model performance and identifies potential shortcomings across diffe
&lt;/p&gt;</description></item></channel></rss>