<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#24378;&#22768;&#38899;&#20107;&#20214;&#26816;&#27979;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#40784;&#38899;&#39057;&#29305;&#24449;&#21644;&#25991;&#26412;&#29305;&#24449;&#26469;&#23454;&#29616;&#22768;&#38899;&#20107;&#20214;&#20998;&#31867;&#21644;&#26102;&#38388;&#23450;&#20301;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#35821;&#35328;&#27169;&#22411;&#30340;&#35821;&#20041;&#33021;&#21147;&#30452;&#25509;&#29983;&#25104;&#24207;&#21015;&#65292;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#26356;&#31616;&#27905;&#20840;&#38754;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#22312;&#26102;&#38388;&#25139;&#25429;&#33719;&#21644;&#20107;&#20214;&#20998;&#31867;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.11530</link><description>&lt;p&gt;
&#22686;&#24378;&#22768;&#38899;&#20107;&#20214;&#26816;&#27979;&#30340;&#35821;&#35328;&#27169;&#22411;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
Furnishing Sound Event Detection with Language Model Abilities. (arXiv:2308.11530v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11530
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#24378;&#22768;&#38899;&#20107;&#20214;&#26816;&#27979;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#40784;&#38899;&#39057;&#29305;&#24449;&#21644;&#25991;&#26412;&#29305;&#24449;&#26469;&#23454;&#29616;&#22768;&#38899;&#20107;&#20214;&#20998;&#31867;&#21644;&#26102;&#38388;&#23450;&#20301;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992;&#35821;&#35328;&#27169;&#22411;&#30340;&#35821;&#20041;&#33021;&#21147;&#30452;&#25509;&#29983;&#25104;&#24207;&#21015;&#65292;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#26356;&#31616;&#27905;&#20840;&#38754;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#22312;&#26102;&#38388;&#25139;&#25429;&#33719;&#21644;&#20107;&#20214;&#20998;&#31867;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;&#35821;&#35328;&#27169;&#22411;&#65288;LMs&#65289;&#22312;&#35270;&#35273;&#36328;&#27169;&#24577;&#20013;&#30340;&#33021;&#21147;&#24341;&#36215;&#20102;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#25506;&#32034;&#20102;LMs&#22312;&#22768;&#38899;&#20107;&#20214;&#26816;&#27979;&#65288;SED&#65289;&#20013;&#30340;&#29983;&#25104;&#33021;&#21147;&#65292;&#36229;&#36234;&#20102;&#35270;&#35273;&#39046;&#22495;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20248;&#38597;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#40784;&#38899;&#39057;&#29305;&#24449;&#21644;&#25991;&#26412;&#29305;&#24449;&#26469;&#23436;&#25104;&#22768;&#38899;&#20107;&#20214;&#20998;&#31867;&#21644;&#26102;&#38388;&#23450;&#20301;&#12290;&#35813;&#26694;&#26550;&#30001;&#19968;&#20010;&#22768;&#23398;&#32534;&#30721;&#22120;&#12289;&#19968;&#20010;&#23545;&#24212;&#30340;&#25991;&#26412;&#21644;&#38899;&#39057;&#34920;&#31034;&#23545;&#40784;&#30340;&#23545;&#27604;&#27169;&#22359;&#65292;&#20197;&#21450;&#19968;&#20010;&#35299;&#32806;&#30340;&#35821;&#35328;&#35299;&#30721;&#22120;&#32452;&#25104;&#65292;&#29992;&#20110;&#20174;&#38899;&#39057;&#29305;&#24449;&#20013;&#29983;&#25104;&#26102;&#38388;&#21644;&#20107;&#20214;&#24207;&#21015;&#12290;&#19982;&#38656;&#35201;&#22797;&#26434;&#22788;&#29702;&#24182;&#20960;&#20046;&#19981;&#20351;&#29992;&#26377;&#38480;&#38899;&#39057;&#29305;&#24449;&#30340;&#20256;&#32479;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#26356;&#31616;&#27905;&#20840;&#38754;&#65292;&#22240;&#20026;&#35821;&#35328;&#27169;&#22411;&#30452;&#25509;&#21033;&#29992;&#20854;&#35821;&#20041;&#33021;&#21147;&#29983;&#25104;&#24207;&#21015;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#30340;&#35299;&#32806;&#27169;&#22359;&#65292;&#20197;&#23637;&#31034;&#20854;&#23545;&#26102;&#38388;&#25139;&#25429;&#25417;&#21644;&#20107;&#20214;&#20998;&#31867;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recently, the ability of language models (LMs) has attracted increasing attention in visual cross-modality. In this paper, we further explore the generation capacity of LMs for sound event detection (SED), beyond the visual domain. Specifically, we propose an elegant method that aligns audio features and text features to accomplish sound event classification and temporal location. The framework consists of an acoustic encoder, a contrastive module that align the corresponding representations of the text and audio, and a decoupled language decoder that generates temporal and event sequences from the audio characteristic. Compared with conventional works that require complicated processing and barely utilize limited audio features, our model is more concise and comprehensive since language model directly leverage its semantic capabilities to generate the sequences. We investigate different decoupling modules to demonstrate the effectiveness for timestamps capture and event classification
&lt;/p&gt;</description></item></channel></rss>