<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20027;&#39064;&#20998;&#26512;&#23545;LLM&#29983;&#25104;&#30340;&#20195;&#30721;&#20013;&#30340;&#24187;&#35273;&#36827;&#34892;&#20102;&#24635;&#32467;&#21644;&#20998;&#31867;&#65292;&#24314;&#31435;&#20102;&#20195;&#30721;&#20013;&#24187;&#35273;&#30340;&#20840;&#38754;&#20998;&#31867;&#27861;&#12290;</title><link>https://arxiv.org/abs/2404.00971</link><description>&lt;p&gt;
&#25506;&#32034;&#21644;&#35780;&#20272;LLM&#39537;&#21160;&#30340;&#20195;&#30721;&#29983;&#25104;&#20013;&#30340;&#24187;&#35273;
&lt;/p&gt;
&lt;p&gt;
Exploring and Evaluating Hallucinations in LLM-Powered Code Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00971
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20027;&#39064;&#20998;&#26512;&#23545;LLM&#29983;&#25104;&#30340;&#20195;&#30721;&#20013;&#30340;&#24187;&#35273;&#36827;&#34892;&#20102;&#24635;&#32467;&#21644;&#20998;&#31867;&#65292;&#24314;&#31435;&#20102;&#20195;&#30721;&#20013;&#24187;&#35273;&#30340;&#20840;&#38754;&#20998;&#31867;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#23835;&#36215;&#24050;&#32463;&#26497;&#22823;&#22320;&#25512;&#21160;&#20102;&#36719;&#20214;&#24037;&#31243;&#20219;&#21153;&#20013;&#35768;&#22810;&#24212;&#29992;&#30340;&#21457;&#23637;&#65292;&#29305;&#21035;&#26159;&#22312;&#20195;&#30721;&#29983;&#25104;&#26041;&#38754;&#12290;&#23613;&#31649;&#34920;&#29616;&#20986;&#33394;&#65292;LLMs&#23481;&#26131;&#20135;&#29983;&#24187;&#35273;&#65292;&#21363;LLMs&#21487;&#33021;&#20135;&#29983;&#19982;&#29992;&#25143;&#24847;&#22270;&#20559;&#31163;&#12289;&#34920;&#29616;&#20986;&#20869;&#37096;&#19981;&#19968;&#33268;&#25110;&#19982;&#20107;&#23454;&#30693;&#35782;&#19981;&#31526;&#30340;&#36755;&#20986;&#65292;&#20351;&#24471;&#22312;&#24191;&#27867;&#24212;&#29992;&#20013;&#37096;&#32626;LLMs&#21487;&#33021;&#23384;&#22312;&#39118;&#38505;&#12290;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#33258;&#28982;&#35821;&#35328;&#29983;&#25104;&#65288;NLG&#65289;&#39046;&#22495;&#30340;&#24187;&#35273;&#65292;&#32570;&#20047;&#23545;&#20195;&#30721;&#29983;&#25104;&#29615;&#22659;&#20013;&#24187;&#35273;&#31867;&#22411;&#21644;&#31243;&#24230;&#30340;&#29702;&#35299;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#23545;LLM&#29983;&#25104;&#30340;&#20195;&#30721;&#36827;&#34892;&#20102;&#20027;&#39064;&#20998;&#26512;&#65292;&#24635;&#32467;&#21644;&#24402;&#31867;&#20854;&#20013;&#23384;&#22312;&#30340;&#24187;&#35273;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24314;&#31435;&#20102;LLM&#29983;&#25104;&#30340;&#20195;&#30721;&#20013;&#24187;&#35273;&#30340;&#20840;&#38754;&#20998;&#31867;&#27861;&#65292;&#28085;&#30422;&#20102;5&#20010;&#20027;&#35201;&#24187;&#35273;&#31867;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00971v1 Announce Type: cross  Abstract: The rise of Large Language Models (LLMs) has significantly advanced many applications on software engineering tasks, particularly in code generation. Despite the promising performance, LLMs are prone to generate hallucinations, which means LLMs might produce outputs that deviate from users' intent, exhibit internal inconsistencies, or misalign with the factual knowledge, making the deployment of LLMs potentially risky in a wide range of applications. Existing work mainly focuses on investing the hallucination in the domain of natural language generation (NLG), leaving a gap in understanding the types and extent of hallucinations in the context of code generation. To bridge the gap, we conducted a thematic analysis of the LLM-generated code to summarize and categorize the hallucinations present in it. Our study established a comprehensive taxonomy of hallucinations in LLM-generated code, encompassing 5 primary categories of hallucinatio
&lt;/p&gt;</description></item></channel></rss>