<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#22312;&#22343;&#22330;&#21338;&#24328;&#20013;&#24341;&#20837;&#32593;&#32476;&#36890;&#20449;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25552;&#39640;&#20998;&#24067;&#24335;&#26234;&#33021;&#20307;&#23398;&#20064;&#25928;&#29575;&#30340;&#26041;&#26696;&#65292;&#24182;&#36827;&#34892;&#20102;&#23454;&#38469;&#23454;&#39564;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2306.02766</link><description>&lt;p&gt;
&#20998;&#24067;&#24335;&#26234;&#33021;&#20307;&#22312;&#22343;&#22330;&#21338;&#24328;&#20013;&#30340;&#32593;&#32476;&#36890;&#20449;
&lt;/p&gt;
&lt;p&gt;
Networked Communication for Decentralised Agents in Mean-Field Games. (arXiv:2306.02766v2 [cs.MA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02766
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#22343;&#22330;&#21338;&#24328;&#20013;&#24341;&#20837;&#32593;&#32476;&#36890;&#20449;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25552;&#39640;&#20998;&#24067;&#24335;&#26234;&#33021;&#20307;&#23398;&#20064;&#25928;&#29575;&#30340;&#26041;&#26696;&#65292;&#24182;&#36827;&#34892;&#20102;&#23454;&#38469;&#23454;&#39564;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;&#32593;&#32476;&#36890;&#20449;&#24341;&#20837;&#22343;&#22330;&#21338;&#24328;&#26694;&#26550;&#65292;&#29305;&#21035;&#26159;&#22312;&#26080;oracle&#30340;&#24773;&#20917;&#19979;&#65292;N&#20010;&#20998;&#24067;&#24335;&#26234;&#33021;&#20307;&#27839;&#30528;&#32463;&#36807;&#30340;&#32463;&#39564;&#31995;&#32479;&#30340;&#21333;&#19968;&#38750;&#21608;&#26399;&#28436;&#21270;&#36335;&#24452;&#23398;&#20064;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#26550;&#26500;&#22312;&#21482;&#26377;&#19968;&#20123;&#20851;&#20110;&#32593;&#32476;&#32467;&#26500;&#30340;&#21512;&#29702;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#20855;&#26377;&#26679;&#26412;&#20445;&#35777;&#65292;&#22312;&#38598;&#20013;&#23398;&#20064;&#21644;&#29420;&#31435;&#23398;&#20064;&#24773;&#20917;&#20043;&#38388;&#26377;&#30028;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#19977;&#20010;&#29702;&#35770;&#31639;&#27861;&#30340;&#26679;&#26412;&#20445;&#35777;&#23454;&#38469;&#19978;&#24182;&#19981;&#20250;&#23548;&#33268;&#23454;&#38469;&#25910;&#25947;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#23454;&#38469;&#35774;&#32622;&#20013;&#65292;&#24403;&#29702;&#35770;&#21442;&#25968;&#26410;&#34987;&#35266;&#23519;&#21040;&#65288;&#23548;&#33268;Q&#20989;&#25968;&#30340;&#20272;&#35745;&#19981;&#20934;&#30830;&#65289;&#26102;&#65292;&#25105;&#20204;&#30340;&#36890;&#20449;&#26041;&#26696;&#26174;&#33879;&#21152;&#36895;&#20102;&#25910;&#25947;&#36895;&#24230;&#65292;&#32780;&#26080;&#38656;&#20381;&#36182;&#20110;&#19968;&#20010;&#19981;&#21487;&#21462;&#30340;&#38598;&#20013;&#24335;&#25511;&#21046;&#22120;&#30340;&#20551;&#35774;&#12290;&#25105;&#20204;&#23545;&#19977;&#20010;&#29702;&#35770;&#31639;&#27861;&#36827;&#34892;&#20102;&#20960;&#31181;&#23454;&#38469;&#30340;&#25913;&#36827;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#23637;&#31034;&#23427;&#20204;&#30340;&#31532;&#19968;&#20010;&#23454;&#35777;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce networked communication to the mean-field game framework, in particular to oracle-free settings where $N$ decentralised agents learn along a single, non-episodic evolution path of the empirical system. We prove that our architecture, with only a few reasonable assumptions about network structure, has sample guarantees bounded between those of the centralised- and independent-learning cases. We discuss how the sample guarantees of the three theoretical algorithms do not actually result in practical convergence. Accordingly, we show that in practical settings where the theoretical parameters are not observed (leading to poor estimation of the Q-function), our communication scheme significantly accelerates convergence over the independent case, without relying on the undesirable assumption of a centralised controller. We contribute several further practical enhancements to all three theoretical algorithms, allowing us to showcase their first empirical demonstrations. Our expe
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102; G&#19981;&#21464;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376; &#29992;&#20110;&#22788;&#29702;&#25968;&#25454;&#38598;&#19981;&#20165;&#22312;&#27969;&#24418;&#19978;&#65292;&#32780;&#19988;&#22312;&#19968;&#20010;&#36830;&#32493;&#32676;&#30340;&#20316;&#29992;&#19979;&#20063;&#26159;&#23553;&#38381;&#30340;&#24773;&#24418;&#65292;&#30456;&#36739;&#20110;&#26631;&#20934;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#25910;&#25947;&#36895;&#24230;&#26356;&#24555;&#12290;</title><link>http://arxiv.org/abs/2303.17001</link><description>&lt;p&gt;
G&#19981;&#21464;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;
&lt;/p&gt;
&lt;p&gt;
The G-invariant graph Laplacian. (arXiv:2303.17001v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.17001
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102; G&#19981;&#21464;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376; &#29992;&#20110;&#22788;&#29702;&#25968;&#25454;&#38598;&#19981;&#20165;&#22312;&#27969;&#24418;&#19978;&#65292;&#32780;&#19988;&#22312;&#19968;&#20010;&#36830;&#32493;&#32676;&#30340;&#20316;&#29992;&#19979;&#20063;&#26159;&#23553;&#38381;&#30340;&#24773;&#24418;&#65292;&#30456;&#36739;&#20110;&#26631;&#20934;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#25910;&#25947;&#36895;&#24230;&#26356;&#24555;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#30340;&#31639;&#27861;&#24050;&#32463;&#34987;&#35777;&#26126;&#22312;&#38477;&#32500;&#12289;&#32858;&#31867;&#21644;&#21435;&#22122;&#31561;&#39046;&#22495;&#23545;&#27969;&#24418;&#25968;&#25454;&#38750;&#24120;&#26377;&#25928;&#12290;&#26412;&#25991;&#32771;&#34385;&#30340;&#25968;&#25454;&#38598;&#19981;&#20165;&#22312;&#27969;&#24418;&#19978;&#65292;&#32780;&#19988;&#22312;&#19968;&#20010;&#36830;&#32493;&#32676;&#30340;&#20316;&#29992;&#19979;&#20063;&#26159;&#23553;&#38381;&#30340;&#12290;&#36825;&#31867;&#25968;&#25454;&#38598;&#30340;&#19968;&#20010;&#20363;&#23376;&#26159;&#27839;&#30528;&#20302;&#32500;&#27969;&#24418;&#20256;&#25773;&#30340;&#20307;&#31215;&#65292;&#20854;&#20013;&#27599;&#20010;&#20307;&#31215;&#21487;&#20197;&#22312;&#19977;&#32500;&#31354;&#38388;&#20013;&#26059;&#36716;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;G&#19981;&#21464;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#65292;&#36890;&#36807;&#32771;&#34385;&#25968;&#25454;&#38598;&#19978;&#30340;&#32676;&#30340;&#20316;&#29992;&#26469;&#24191;&#20041;&#21270;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#12290;&#25105;&#20204;&#26174;&#31034;&#20102;&#19982;&#26631;&#20934;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#31867;&#20284;&#65292;G&#19981;&#21464;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#25910;&#25947;&#20110;&#25968;&#25454;&#27969;&#24418;&#19978;&#30340;Laplace-Beltrami&#31639;&#23376;&#65292;&#20294;&#25910;&#25947;&#36895;&#24230;&#26174;&#33879;&#25552;&#39640;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;G&#19981;&#21464;&#22270;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#30340;&#29305;&#24449;&#20989;&#25968;&#20855;&#26377;&#32676;&#20803;&#32032;&#21644;&#26576;&#20123;&#30697;&#38453;&#30340;&#29305;&#24449;&#21521;&#37327;&#30340;&#24352;&#37327;&#31215;&#24418;&#24335;&#65292;&#21487;&#20197;&#20351;&#29992;F&#39640;&#25928;&#22320;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph Laplacian based algorithms for data lying on a manifold have been proven effective for tasks such as dimensionality reduction, clustering, and denoising. In this work, we consider data sets whose data point not only lie on a manifold, but are also closed under the action of a continuous group. An example of such data set is volumes that line on a low dimensional manifold, where each volume may be rotated in three-dimensional space. We introduce the G-invariant graph Laplacian that generalizes the graph Laplacian by accounting for the action of the group on the data set. We show that like the standard graph Laplacian, the G-invariant graph Laplacian converges to the Laplace-Beltrami operator on the data manifold, but with a significantly improved convergence rate. Furthermore, we show that the eigenfunctions of the G-invariant graph Laplacian admit the form of tensor products between the group elements and eigenvectors of certain matrices, which can be computed efficiently using F
&lt;/p&gt;</description></item></channel></rss>