<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#25913;&#36827;&#30340;&#35889;&#32858;&#31867;&#31639;&#27861;&#22312;&#22810;&#23618;&#32593;&#32476;&#20013;&#23454;&#29616;&#20102;&#26356;&#22909;&#30340;&#31038;&#21306;&#26816;&#27979;&#24615;&#33021;&#65292;&#24182;&#35777;&#26126;&#22810;&#23618;&#32593;&#32476;&#23545;&#31038;&#21306;&#26816;&#27979;&#26377;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2403.12540</link><description>&lt;p&gt;
&#22810;&#23618;&#32593;&#32476;&#20013;&#22522;&#20110;&#35889;&#26041;&#27861;&#30340;&#31038;&#21306;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Community detection by spectral methods in multi-layer networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12540
&lt;/p&gt;
&lt;p&gt;
&#25913;&#36827;&#30340;&#35889;&#32858;&#31867;&#31639;&#27861;&#22312;&#22810;&#23618;&#32593;&#32476;&#20013;&#23454;&#29616;&#20102;&#26356;&#22909;&#30340;&#31038;&#21306;&#26816;&#27979;&#24615;&#33021;&#65292;&#24182;&#35777;&#26126;&#22810;&#23618;&#32593;&#32476;&#23545;&#31038;&#21306;&#26816;&#27979;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#23618;&#32593;&#32476;&#20013;&#30340;&#31038;&#21306;&#26816;&#27979;&#26159;&#32593;&#32476;&#20998;&#26512;&#20013;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#20004;&#31181;&#35889;&#32858;&#31867;&#31639;&#27861;&#22312;&#22810;&#23618;&#24230;&#26657;&#27491;&#38543;&#26426;&#22359;&#27169;&#22411;&#65288;MLDCSBM&#65289;&#26694;&#26550;&#19979;&#36827;&#34892;&#31038;&#21306;&#26816;&#27979;&#30340;&#24615;&#33021;&#12290;&#19968;&#31181;&#31639;&#27861;&#22522;&#20110;&#37051;&#25509;&#30697;&#38453;&#30340;&#21644;&#65292;&#21478;&#19968;&#31181;&#21033;&#29992;&#20102;&#21435;&#20559;&#21644;&#30340;&#24179;&#26041;&#37051;&#25509;&#30697;&#38453;&#30340;&#21644;&#12290;&#25105;&#20204;&#22312;&#32593;&#32476;&#35268;&#27169;&#21644;/&#25110;&#23618;&#25968;&#22686;&#21152;&#26102;&#24314;&#31435;&#20102;&#36825;&#20123;&#26041;&#27861;&#22312;MLDCSBM&#19979;&#36827;&#34892;&#31038;&#21306;&#26816;&#27979;&#30340;&#19968;&#33268;&#24615;&#32467;&#26524;&#12290;&#25105;&#20204;&#30340;&#23450;&#29702;&#23637;&#31034;&#20102;&#21033;&#29992;&#22810;&#23618;&#36827;&#34892;&#31038;&#21306;&#26816;&#27979;&#30340;&#20248;&#21183;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#21033;&#29992;&#21435;&#20559;&#21644;&#30340;&#24179;&#26041;&#37051;&#25509;&#30697;&#38453;&#30340;&#35889;&#32858;&#31867;&#36890;&#24120;&#20248;&#20110;&#21033;&#29992;&#37051;&#25509;&#30697;&#38453;&#30340;&#35889;&#32858;&#31867;&#12290;&#25968;&#20540;&#27169;&#25311;&#35777;&#23454;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#65292;&#37319;&#29992;&#20102;&#21435;&#20559;&#21644;&#30340;&#24179;&#26041;&#37051;&#25509;&#30697;&#38453;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12540v1 Announce Type: cross  Abstract: Community detection in multi-layer networks is a crucial problem in network analysis. In this paper, we analyze the performance of two spectral clustering algorithms for community detection within the multi-layer degree-corrected stochastic block model (MLDCSBM) framework. One algorithm is based on the sum of adjacency matrices, while the other utilizes the debiased sum of squared adjacency matrices. We establish consistency results for community detection using these methods under MLDCSBM as the size of the network and/or the number of layers increases. Our theorems demonstrate the advantages of utilizing multiple layers for community detection. Moreover, our analysis indicates that spectral clustering with the debiased sum of squared adjacency matrices is generally superior to spectral clustering with the sum of adjacency matrices. Numerical simulations confirm that our algorithm, employing the debiased sum of squared adjacency matri
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22823;&#35268;&#27169;&#30693;&#35782;&#22270;&#35889;&#19978;&#36827;&#34892;&#39640;&#25928;&#21644;&#33258;&#36866;&#24212;&#39044;&#27979;&#30340;&#19968;&#27425;&#24615;&#23376;&#22270;&#38142;&#25509;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#39044;&#27979;&#36807;&#31243;&#20998;&#35299;&#20026;&#20174;&#26597;&#35810;&#20013;&#25552;&#21462;&#19968;&#20010;&#23376;&#22270;&#24182;&#22312;&#35813;&#21333;&#20010;&#12289;&#26597;&#35810;&#30456;&#20851;&#23376;&#22270;&#19978;&#36827;&#34892;&#39044;&#27979;&#30340;&#20004;&#20010;&#27493;&#39588;&#65292;&#21033;&#29992;&#38750;&#21442;&#25968;&#21270;&#21644;&#35745;&#31639;&#39640;&#25928;&#30340;&#21551;&#21457;&#24335;&#26041;&#27861;&#26469;&#25552;&#39640;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.10231</link><description>&lt;p&gt;
&#23569;&#21363;&#26159;&#22810;&#65306;&#22823;&#35268;&#27169;&#30693;&#35782;&#22270;&#35889;&#19978;&#30340;&#19968;&#27425;&#24615;&#23376;&#22270;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Less is More: One-shot Subgraph Reasoning on Large-scale Knowledge Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10231
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22823;&#35268;&#27169;&#30693;&#35782;&#22270;&#35889;&#19978;&#36827;&#34892;&#39640;&#25928;&#21644;&#33258;&#36866;&#24212;&#39044;&#27979;&#30340;&#19968;&#27425;&#24615;&#23376;&#22270;&#38142;&#25509;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#39044;&#27979;&#36807;&#31243;&#20998;&#35299;&#20026;&#20174;&#26597;&#35810;&#20013;&#25552;&#21462;&#19968;&#20010;&#23376;&#22270;&#24182;&#22312;&#35813;&#21333;&#20010;&#12289;&#26597;&#35810;&#30456;&#20851;&#23376;&#22270;&#19978;&#36827;&#34892;&#39044;&#27979;&#30340;&#20004;&#20010;&#27493;&#39588;&#65292;&#21033;&#29992;&#38750;&#21442;&#25968;&#21270;&#21644;&#35745;&#31639;&#39640;&#25928;&#30340;&#21551;&#21457;&#24335;&#26041;&#27861;&#26469;&#25552;&#39640;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35201;&#22312;&#30693;&#35782;&#22270;&#35889;&#65288;KG&#65289;&#19978;&#25512;&#23548;&#26032;&#30340;&#20107;&#23454;&#65292;&#38142;&#25509;&#39044;&#27979;&#22120;&#20174;&#22270;&#32467;&#26500;&#20013;&#23398;&#20064;&#65292;&#24182;&#25910;&#38598;&#23616;&#37096;&#35777;&#25454;&#20197;&#25214;&#21040;&#23545;&#32473;&#23450;&#26597;&#35810;&#30340;&#31572;&#26696;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#30001;&#20110;&#21033;&#29992;&#25972;&#20010;KG&#36827;&#34892;&#39044;&#27979;&#32780;&#23384;&#22312;&#20005;&#37325;&#30340;&#21487;&#25193;&#23637;&#24615;&#38382;&#39064;&#65292;&#36825;&#38459;&#30861;&#20102;&#23427;&#20204;&#22312;&#22823;&#35268;&#27169;KG&#19978;&#30340;&#24212;&#29992;&#65292;&#24182;&#19988;&#26080;&#27861;&#30452;&#25509;&#36890;&#36807;&#24120;&#35268;&#25277;&#26679;&#26041;&#27861;&#35299;&#20915;&#12290; &#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#27425;&#24615;&#23376;&#22270;&#38142;&#25509;&#39044;&#27979;&#20197;&#23454;&#29616;&#39640;&#25928;&#19988;&#33258;&#36866;&#24212;&#30340;&#39044;&#27979;&#12290; &#35774;&#35745;&#21407;&#21017;&#26159;&#65292;&#39044;&#27979;&#36807;&#31243;&#19981;&#30452;&#25509;&#20316;&#29992;&#20110;&#25972;&#20010;KG&#65292;&#32780;&#26159;&#20998;&#20026;&#20004;&#20010;&#27493;&#39588;&#65292;&#21363;&#65288;i&#65289;&#26681;&#25454;&#26597;&#35810;&#20165;&#25552;&#21462;&#19968;&#20010;&#23376;&#22270;&#21644;&#65288;ii&#65289;&#22312;&#36825;&#20010;&#21333;&#19968;&#30340;&#12289;&#26597;&#35810;&#30456;&#20851;&#30340;&#23376;&#22270;&#19978;&#36827;&#34892;&#39044;&#27979;&#12290; &#25105;&#20204;&#21457;&#29616;&#65292;&#38750;&#21442;&#25968;&#21270;&#21644;&#35745;&#31639;&#39640;&#25928;&#30340;&#21551;&#21457;&#24335;&#26041;&#27861;&#20010;&#24615;&#21270;PageRank&#65288;PPR&#65289;&#21487;&#20197;&#26377;&#25928;&#22320;&#35782;&#21035;&#28508;&#22312;&#31572;&#26696;&#21644;&#25903;&#25345;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10231v1 Announce Type: cross  Abstract: To deduce new facts on a knowledge graph (KG), a link predictor learns from the graph structure and collects local evidence to find the answer to a given query. However, existing methods suffer from a severe scalability problem due to the utilization of the whole KG for prediction, which hinders their promise on large scale KGs and cannot be directly addressed by vanilla sampling methods. In this work, we propose the one-shot-subgraph link prediction to achieve efficient and adaptive prediction. The design principle is that, instead of directly acting on the whole KG, the prediction procedure is decoupled into two steps, i.e., (i) extracting only one subgraph according to the query and (ii) predicting on this single, query dependent subgraph. We reveal that the non-parametric and computation-efficient heuristics Personalized PageRank (PPR) can effectively identify the potential answers and supporting evidence. With efficient subgraph-b
&lt;/p&gt;</description></item></channel></rss>