<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;L-BFGS-B&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#22312;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#35782;&#21035;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31995;&#32479;&#65292;&#30456;&#27604;&#20256;&#32479;&#32447;&#24615;&#23376;&#31354;&#38388;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#32467;&#26524;&#12289;&#25439;&#22833;&#21644;&#27491;&#21017;&#21270;&#39033;&#20351;&#29992;&#30340;&#36890;&#29992;&#24615;&#20197;&#21450;&#25968;&#20540;&#31283;&#23450;&#24615;&#26041;&#38754;&#36890;&#24120;&#25552;&#20379;&#26356;&#22909;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#21487;&#20197;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#31181;&#21442;&#25968;&#21270;&#38750;&#32447;&#24615;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;</title><link>https://arxiv.org/abs/2403.03827</link><description>&lt;p&gt;
&#22312;L-BFGS-B&#31639;&#27861;&#30340;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#36827;&#34892;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31995;&#32479;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Linear and nonlinear system identification under $\ell_1$- and group-Lasso regularization via L-BFGS-B
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03827
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;L-BFGS-B&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#22312;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#35782;&#21035;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31995;&#32479;&#65292;&#30456;&#27604;&#20256;&#32479;&#32447;&#24615;&#23376;&#31354;&#38388;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#32467;&#26524;&#12289;&#25439;&#22833;&#21644;&#27491;&#21017;&#21270;&#39033;&#20351;&#29992;&#30340;&#36890;&#29992;&#24615;&#20197;&#21450;&#25968;&#20540;&#31283;&#23450;&#24615;&#26041;&#38754;&#36890;&#24120;&#25552;&#20379;&#26356;&#22909;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#21487;&#20197;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#31181;&#21442;&#25968;&#21270;&#38750;&#32447;&#24615;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;L-BFGS-B&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#21487;&#33021;&#22312;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#30340;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31163;&#25955;&#26102;&#38388;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;&#38024;&#23545;&#32447;&#24615;&#27169;&#22411;&#30340;&#35782;&#21035;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19982;&#32463;&#20856;&#32447;&#24615;&#23376;&#31354;&#38388;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#25552;&#20379;&#26356;&#22909;&#30340;&#32467;&#26524;&#65292;&#22312;&#25439;&#22833;&#21644;&#27491;&#21017;&#21270;&#39033;&#30340;&#20351;&#29992;&#26041;&#38754;&#26356;&#21152;&#36890;&#29992;&#65292;&#20063;&#22312;&#25968;&#20540;&#19978;&#26356;&#21152;&#31283;&#23450;&#12290;&#35813;&#26041;&#27861;&#19981;&#20165;&#20016;&#23500;&#20102;&#29616;&#26377;&#30340;&#32447;&#24615;&#31995;&#32479;&#35782;&#21035;&#24037;&#20855;&#38598;&#65292;&#36824;&#21487;&#20197;&#24212;&#29992;&#20110;&#35782;&#21035;&#21253;&#25324;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#22312;&#20869;&#30340;&#38750;&#24120;&#24191;&#27867;&#30340;&#21442;&#25968;&#21270;&#38750;&#32447;&#24615;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;&#25105;&#20204;&#22312;&#21512;&#25104;&#21644;&#23454;&#39564;&#25968;&#25454;&#38598;&#19978;&#28436;&#31034;&#20102;&#35813;&#26041;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#35299;&#20915;Weigand&#31561;&#20154;&#65288;2022&#24180;&#65289;&#25552;&#20986;&#30340;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#24037;&#19994;&#26426;&#22120;&#20154;&#22522;&#20934;&#30340;&#38750;&#32447;&#24615;&#22810;&#36755;&#20837;/&#22810;&#36755;&#20986;&#31995;&#32479;&#35782;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03827v1 Announce Type: cross  Abstract: In this paper, we propose an approach for identifying linear and nonlinear discrete-time state-space models, possibly under $\ell_1$- and group-Lasso regularization, based on the L-BFGS-B algorithm. For the identification of linear models, we show that, compared to classical linear subspace methods, the approach often provides better results, is much more general in terms of the loss and regularization terms used, and is also more stable from a numerical point of view. The proposed method not only enriches the existing set of linear system identification tools but can be also applied to identifying a very broad class of parametric nonlinear state-space models, including recurrent neural networks. We illustrate the approach on synthetic and experimental datasets and apply it to solve the challenging industrial robot benchmark for nonlinear multi-input/multi-output system identification proposed by Weigand et al. (2022). A Python impleme
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#26234;&#33021;&#22478;&#24066;&#33021;&#28304;&#31649;&#29702;&#30340;&#29289;&#32852;&#32593;&#26694;&#26550;&#65292;&#32467;&#21512;&#26234;&#33021;&#20998;&#26512;&#21644;&#22810;&#32452;&#20214;&#30340;&#26550;&#26500;&#65292;&#30740;&#31350;&#20102;&#22522;&#20110;&#26234;&#33021;&#26426;&#21046;&#30340;&#26234;&#33021;&#33021;&#28304;&#31649;&#29702;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#26399;&#33410;&#33021;&#21644;&#20248;&#21270;&#31649;&#29702;&#12290;</title><link>http://arxiv.org/abs/2306.05567</link><description>&lt;p&gt;
&#26234;&#33021;&#20998;&#26512;&#65292;&#22312;&#29289;&#32852;&#32593;&#26694;&#26550;&#19979;&#30340;&#26234;&#33021;&#22478;&#24066;&#33021;&#28304;&#31649;&#29702;&#65306;&#22797;&#26434;&#32593;&#32476;&#21644;&#31995;&#32479;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#24212;&#29992;&#30340;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Intelligent Energy Management with IoT Framework in Smart Cities Using Intelligent Analysis: An Application of Machine Learning Methods for Complex Networks and Systems. (arXiv:2306.05567v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05567
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#26234;&#33021;&#22478;&#24066;&#33021;&#28304;&#31649;&#29702;&#30340;&#29289;&#32852;&#32593;&#26694;&#26550;&#65292;&#32467;&#21512;&#26234;&#33021;&#20998;&#26512;&#21644;&#22810;&#32452;&#20214;&#30340;&#26550;&#26500;&#65292;&#30740;&#31350;&#20102;&#22522;&#20110;&#26234;&#33021;&#26426;&#21046;&#30340;&#26234;&#33021;&#33021;&#28304;&#31649;&#29702;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#26399;&#33410;&#33021;&#21644;&#20248;&#21270;&#31649;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26234;&#33021;&#24314;&#31569;&#36234;&#26469;&#36234;&#22810;&#22320;&#20351;&#29992;&#22522;&#20110;&#29289;&#32852;&#32593;&#30340;&#26080;&#32447;&#20256;&#24863;&#31995;&#32479;&#26469;&#38477;&#20302;&#33021;&#28304;&#28040;&#32791;&#21644;&#29615;&#22659;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#24320;&#21457;&#20102;&#19968;&#20010;&#20840;&#38754;&#30340;&#22522;&#20110;&#29289;&#32852;&#32593;&#30340;&#26234;&#33021;&#22478;&#24066;&#33021;&#28304;&#31649;&#29702;&#26694;&#26550;&#65292;&#34701;&#21512;&#20102;&#22810;&#20010;&#29289;&#32852;&#32593;&#26550;&#26500;&#21644;&#26694;&#26550;&#30340;&#32452;&#20214;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#26234;&#33021;&#20998;&#26512;&#65292;&#19981;&#20165;&#25910;&#38598;&#21644;&#23384;&#20648;&#20449;&#24687;&#65292;&#32780;&#19988;&#36824;&#26159;&#20854;&#20182;&#20225;&#19994;&#24320;&#21457;&#24212;&#29992;&#30340;&#24179;&#21488;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#22522;&#20110;&#26234;&#33021;&#26426;&#21046;&#30340;&#26234;&#33021;&#33021;&#28304;&#31649;&#29702;&#35299;&#20915;&#26041;&#26696;&#12290;&#33021;&#28304;&#36164;&#28304;&#30340;&#28040;&#32791;&#21644;&#38656;&#27714;&#22686;&#21152;&#23548;&#33268;&#20102;&#33410;&#33021;&#19982;&#20248;&#21270;&#31649;&#29702;&#30340;&#38656;&#27714;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
Smart buildings are increasingly using Internet of Things (IoT)-based wireless sensing systems to reduce their energy consumption and environmental impact. As a result of their compact size and ability to sense, measure, and compute all electrical properties, Internet of Things devices have become increasingly important in our society. A major contribution of this study is the development of a comprehensive IoT-based framework for smart city energy management, incorporating multiple components of IoT architecture and framework. An IoT framework for intelligent energy management applications that employ intelligent analysis is an essential system component that collects and stores information. Additionally, it serves as a platform for the development of applications by other companies. Furthermore, we have studied intelligent energy management solutions based on intelligent mechanisms. The depletion of energy resources and the increase in energy demand have led to an increase in energy 
&lt;/p&gt;</description></item></channel></rss>