<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#30740;&#31350;&#20102;&#22312;&#28151;&#21512;LiFi&#21644;WiFi&#32593;&#32476;&#20013;&#22522;&#20110;&#29992;&#25143;&#20013;&#24515;&#30340;&#36127;&#36733;&#24179;&#34913;&#26041;&#27861;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#32593;&#32476;&#20013;&#24515;&#21270;&#26041;&#27861;&#22312;&#22788;&#29702;&#31227;&#21160;&#24615;&#26041;&#38754;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.16823</link><description>&lt;p&gt;
&#28151;&#21512;LiFi&#21644;WiFi&#32593;&#32476;&#20013;&#30340;&#36164;&#28304;&#21644;&#31227;&#21160;&#31649;&#29702;&#65306;&#22522;&#20110;&#29992;&#25143;&#20013;&#24515;&#30340;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Resource and Mobility Management in Hybrid LiFi and WiFi Networks: A User-Centric Learning Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16823
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#28151;&#21512;LiFi&#21644;WiFi&#32593;&#32476;&#20013;&#22522;&#20110;&#29992;&#25143;&#20013;&#24515;&#30340;&#36127;&#36733;&#24179;&#34913;&#26041;&#27861;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#32593;&#32476;&#20013;&#24515;&#21270;&#26041;&#27861;&#22312;&#22788;&#29702;&#31227;&#21160;&#24615;&#26041;&#38754;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28151;&#21512;&#20809;&#36890;&#20449;&#65288;LiFi&#65289;&#21644;&#26080;&#32447;&#23616;&#22495;&#32593;&#65288;WiFi&#65289;&#32593;&#32476;&#65288;HLWNets&#65289;&#26159;&#19968;&#31181;&#26032;&#20852;&#30340;&#23460;&#20869;&#26080;&#32447;&#36890;&#20449;&#33539;&#24335;&#65292;&#32467;&#21512;&#20102;LiFi&#30340;&#23485;&#23637;&#20809;&#35889;&#20248;&#21183;&#21644;WiFi&#30340;&#26080;&#22788;&#19981;&#22312;&#30340;&#35206;&#30422;&#20248;&#21183;&#12290;&#28982;&#32780;&#65292;&#36127;&#36733;&#24179;&#34913;&#65288;LB&#65289;&#25104;&#20026;&#36825;&#31181;&#28151;&#21512;&#32593;&#32476;&#36164;&#28304;&#31649;&#29702;&#30340;&#20851;&#38190;&#25361;&#25112;&#12290;&#29616;&#26377;&#30340;&#36127;&#36733;&#24179;&#34913;&#26041;&#27861;&#22823;&#22810;&#26159;&#32593;&#32476;&#20013;&#24515;&#21270;&#30340;&#65292;&#20381;&#36182;&#20013;&#22830;&#21333;&#20803;&#19968;&#27425;&#24615;&#20026;&#25152;&#26377;&#29992;&#25143;&#21046;&#23450;&#35299;&#20915;&#26041;&#26696;&#12290;&#22240;&#27492;&#65292;&#19981;&#35770;&#29992;&#25143;&#30340;&#31227;&#21160;&#29366;&#24577;&#22914;&#20309;&#65292;&#35299;&#20915;&#26041;&#26696;&#37117;&#38656;&#35201;&#21516;&#27493;&#26356;&#26032;&#25152;&#26377;&#29992;&#25143;&#12290;&#36825;&#20250;&#24433;&#21709;&#32593;&#32476;&#24615;&#33021;&#30340;&#20004;&#20010;&#26041;&#38754;&#65306;i&#65289;&#24403;&#26356;&#26032;&#39057;&#29575;&#36739;&#20302;&#26102;&#65292;&#20250;&#24433;&#21709;&#24555;&#36895;&#31227;&#21160;&#29992;&#25143;&#30340;&#36830;&#25509;&#24615;&#65307;ii&#65289;&#24403;&#26356;&#26032;&#39057;&#29575;&#36739;&#39640;&#26102;&#65292;&#20250;&#23548;&#33268;&#23545;&#20110;&#24930;&#36895;&#31227;&#21160;&#29992;&#25143;&#19981;&#24517;&#35201;&#30340;&#20999;&#25442;&#20197;&#21450;&#24040;&#22823;&#30340;&#21453;&#39304;&#25104;&#26412;&#12290;&#21463;&#27492;&#21551;&#21457;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20801;&#35768;&#29992;&#25143;&#26356;&#26032;&#20854;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16823v1 Announce Type: cross  Abstract: Hybrid light fidelity (LiFi) and wireless fidelity (WiFi) networks (HLWNets) are an emerging indoor wireless communication paradigm, which combines the advantages of the capacious optical spectra of LiFi and ubiquitous coverage of WiFi. Meanwhile, load balancing (LB) becomes a key challenge in resource management for such hybrid networks. The existing LB methods are mostly network-centric, relying on a central unit to make a solution for the users all at once. Consequently, the solution needs to be updated for all users at the same pace, regardless of their moving status. This would affect the network performance in two aspects: i) when the update frequency is low, it would compromise the connectivity of fast-moving users; ii) when the update frequency is high, it would cause unnecessary handovers as well as hefty feedback costs for slow-moving users. Motivated by this, we investigate user-centric LB which allows users to update their 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#20013;&#30340;&#28418;&#31227;&#21644;&#25193;&#25955;&#31995;&#25968;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#24555;&#36895;&#30340;&#25910;&#25947;&#29575;&#65292;&#20351;&#24471;&#23398;&#20064;&#36895;&#29575;&#38543;&#30528;&#26410;&#30693;&#31995;&#25968;&#30340;&#20809;&#28369;&#24230;&#22686;&#21152;&#32780;&#21464;&#24471;&#26356;&#21152;&#32039;&#23494;&#12290;</title><link>http://arxiv.org/abs/2305.15557</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#23398;&#20064;&#20855;&#26377;&#24555;&#36895;&#25910;&#25947;&#29575;&#30340;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Non-Parametric Learning of Stochastic Differential Equations with Fast Rates of Convergence. (arXiv:2305.15557v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15557
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#20013;&#30340;&#28418;&#31227;&#21644;&#25193;&#25955;&#31995;&#25968;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#24555;&#36895;&#30340;&#25910;&#25947;&#29575;&#65292;&#20351;&#24471;&#23398;&#20064;&#36895;&#29575;&#38543;&#30528;&#26410;&#30693;&#31995;&#25968;&#30340;&#20809;&#28369;&#24230;&#22686;&#21152;&#32780;&#21464;&#24471;&#26356;&#21152;&#32039;&#23494;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38750;&#21442;&#25968;&#23398;&#20064;&#33539;&#24335;&#26469;&#35782;&#21035;&#38750;&#32447;&#24615;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#30340;&#28418;&#31227;&#21644;&#25193;&#25955;&#31995;&#25968;&#65292;&#35813;&#33539;&#24335;&#20381;&#36182;&#20110;&#29366;&#24577;&#30340;&#31163;&#25955;&#26102;&#38388;&#35266;&#27979;&#12290;&#20854;&#20851;&#38190;&#24605;&#24819;&#26159;&#23558;&#30456;&#24212;&#30340;Fokker-Planck&#26041;&#31243;&#30340;&#22522;&#20110;RKHS&#30340;&#36817;&#20284;&#25311;&#21512;&#21040;&#36825;&#20123;&#35266;&#27979;&#20540;&#65292;&#20174;&#32780;&#24471;&#20986;&#29702;&#35770;&#23398;&#20064;&#36895;&#29575;&#30340;&#20272;&#35745;&#20540;&#65292;&#36825;&#19982;&#20197;&#24448;&#30340;&#24037;&#20316;&#19981;&#21516;&#65292;&#24403;&#26410;&#30693;&#28418;&#31227;&#21644;&#25193;&#25955;&#31995;&#25968;&#30340;&#20809;&#28369;&#24230;&#36234;&#39640;&#26102;&#65292;&#29702;&#35770;&#20272;&#35745;&#20540;&#36234;&#26469;&#36234;&#32039;&#12290;&#30001;&#20110;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#22522;&#20110;&#20869;&#26680;&#30340;&#65292;&#22240;&#27492;&#31163;&#32447;&#39044;&#22788;&#29702;&#21487;&#20197;&#22312;&#21407;&#21017;&#19978;&#24471;&#21040;&#26377;&#25928;&#30340;&#25968;&#20540;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a novel non-parametric learning paradigm for the identification of drift and diffusion coefficients of non-linear stochastic differential equations, which relies upon discrete-time observations of the state. The key idea essentially consists of fitting a RKHS-based approximation of the corresponding Fokker-Planck equation to such observations, yielding theoretical estimates of learning rates which, unlike previous works, become increasingly tighter when the regularity of the unknown drift and diffusion coefficients becomes higher. Our method being kernel-based, offline pre-processing may in principle be profitably leveraged to enable efficient numerical implementation.
&lt;/p&gt;</description></item></channel></rss>