<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#36890;&#36807;&#23558;&#20154;&#24037;&#21183;&#22330;&#20449;&#24687;&#25972;&#21512;&#21040;CBF-QP&#26694;&#26550;&#20013;&#65292;&#24314;&#31435;&#20102;&#20154;&#24037;&#21183;&#22330;&#19982;&#23433;&#20840;&#28388;&#27874;&#22120;&#20043;&#38388;&#30340;&#36830;&#25509;&#65292;&#24182;&#25193;&#23637;&#20102;CBF-QP&#23433;&#20840;&#28388;&#27874;&#22120;&#30340;&#35774;&#35745;&#20197;&#36866;&#24212;&#26356;&#19968;&#33324;&#30340;&#21160;&#21147;&#23398;&#27169;&#22411;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#25511;&#21046;&#20223;&#23556;&#21160;&#21147;&#23398;&#27169;&#22411;&#30340;&#19968;&#33324;APF&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2403.15743</link><description>&lt;p&gt;
&#20154;&#24037;&#21183;&#22330;&#19982;&#23433;&#20840;&#28388;&#27874;&#22120;&#30340;&#27604;&#36739;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Comparative Study of Artificial Potential Fields and Safety Filters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15743
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#20154;&#24037;&#21183;&#22330;&#20449;&#24687;&#25972;&#21512;&#21040;CBF-QP&#26694;&#26550;&#20013;&#65292;&#24314;&#31435;&#20102;&#20154;&#24037;&#21183;&#22330;&#19982;&#23433;&#20840;&#28388;&#27874;&#22120;&#20043;&#38388;&#30340;&#36830;&#25509;&#65292;&#24182;&#25193;&#23637;&#20102;CBF-QP&#23433;&#20840;&#28388;&#27874;&#22120;&#30340;&#35774;&#35745;&#20197;&#36866;&#24212;&#26356;&#19968;&#33324;&#30340;&#21160;&#21147;&#23398;&#27169;&#22411;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#25511;&#21046;&#20223;&#23556;&#21160;&#21147;&#23398;&#27169;&#22411;&#30340;&#19968;&#33324;APF&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#30001;&#32463;&#20856;&#36816;&#21160;&#35268;&#21010;&#24037;&#20855;&#35774;&#35745;&#30340;&#25511;&#21046;&#22120;&#65292;&#21363;&#20154;&#24037;&#21183;&#22330;&#65288;APFs&#65289;&#65292;&#21487;&#20197;&#20174;&#26368;&#36817;&#26222;&#21450;&#30340;&#26041;&#27861;&#20013;&#24471;&#21040;&#65306;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#20108;&#27425;&#35268;&#21010;&#65288;CBF-QP&#65289;&#23433;&#20840;&#28388;&#27874;&#22120;&#12290;&#36890;&#36807;&#23558;APF&#20449;&#24687;&#25972;&#21512;&#21040;CBF-QP&#26694;&#26550;&#20013;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#36825;&#20004;&#31181;&#26041;&#27861;&#20043;&#38388;&#30340;&#26725;&#26753;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36825;&#26159;&#36890;&#36807;&#23558;&#26377;&#21560;&#24341;&#21147;&#30340;&#21183;&#22330;&#20316;&#20026;&#25511;&#21046;&#26446;&#38597;&#26222;&#35834;&#22827;&#20989;&#25968;&#65288;CLF&#65289;&#26469;&#24341;&#23548;&#21517;&#20041;&#25511;&#21046;&#22120;&#30340;&#35774;&#35745;&#65292;&#28982;&#21518;&#23558;&#25490;&#26021;&#24615;&#21183;&#22330;&#20316;&#20026;&#30456;&#20114;&#20316;&#29992;CBF&#65288;RCBF&#65289;&#26469;&#23450;&#20041;&#19968;&#20010;CBF-QP&#23433;&#20840;&#28388;&#27874;&#22120;&#12290;&#22522;&#20110;&#36825;&#31181;&#25972;&#21512;&#65292;&#25105;&#20204;&#23558;CBF-QP&#23433;&#20840;&#28388;&#27874;&#22120;&#30340;&#35774;&#35745;&#25193;&#23637;&#21040;&#36866;&#24212;&#26356;&#19968;&#33324;&#30340;&#21253;&#21547;&#25511;&#21046;&#20223;&#23556;&#32467;&#26500;&#30340;&#21160;&#21147;&#23398;&#27169;&#22411;&#31867;&#12290;&#36825;&#31181;&#25193;&#23637;&#20135;&#29983;&#20102;&#19968;&#31181;&#29305;&#27530;&#30340;CBF-QP&#23433;&#20840;&#28388;&#27874;&#22120;&#21644;&#36866;&#29992;&#20110;&#25511;&#21046;&#20223;&#23556;&#21160;&#21147;&#23398;&#27169;&#22411;&#30340;&#19968;&#33324;APF&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15743v1 Announce Type: cross  Abstract: In this paper, we have demonstrated that the controllers designed by a classical motion planning tool, namely artificial potential fields (APFs), can be derived from a recently prevalent approach: control barrier function quadratic program (CBF-QP) safety filters. By integrating APF information into the CBF-QP framework, we establish a bridge between these two methodologies. Specifically, this is achieved by employing the attractive potential field as a control Lyapunov function (CLF) to guide the design of the nominal controller, and then the repulsive potential field serves as a reciprocal CBF (RCBF) to define a CBF-QP safety filter. Building on this integration, we extend the design of the CBF-QP safety filter to accommodate a more general class of dynamical models featuring a control-affine structure. This extension yields a special CBF-QP safety filter and a general APF solution suitable for control-affine dynamical models. Throug
&lt;/p&gt;</description></item></channel></rss>