<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26631;&#20934;&#26469;&#37327;&#21270;&#21776;&#32435;&#24503;&#183;&#29305;&#26391;&#26222;&#22312;&#24635;&#32479;&#28436;&#35762;&#20013;&#30340;&#29420;&#29305;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#20182;&#22312;&#20351;&#29992;&#20855;&#26377;&#20998;&#35010;&#24615;&#21644;&#23545;&#25239;&#24615;&#30340;&#35821;&#35328;&#12289;&#37325;&#22797;&#24378;&#35843;&#31561;&#26041;&#38754;&#19982;&#20854;&#20182;&#24635;&#32479;&#20505;&#36873;&#20154;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;&#27492;&#22806;&#65292;&#29305;&#26391;&#26222;&#27604;&#20849;&#21644;&#20826;&#21516;&#20698;&#26356;&#20855;&#29420;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.01405</link><description>&lt;p&gt;
&#37327;&#21270;&#21776;&#32435;&#24503;&#183;&#29305;&#26391;&#26222;&#22312;&#24635;&#32479;&#28436;&#35762;&#20013;&#30340;&#29420;&#29305;&#24615;
&lt;/p&gt;
&lt;p&gt;
Quantifying the Uniqueness of Donald Trump in Presidential Discourse. (arXiv:2401.01405v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01405
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26631;&#20934;&#26469;&#37327;&#21270;&#21776;&#32435;&#24503;&#183;&#29305;&#26391;&#26222;&#22312;&#24635;&#32479;&#28436;&#35762;&#20013;&#30340;&#29420;&#29305;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#20182;&#22312;&#20351;&#29992;&#20855;&#26377;&#20998;&#35010;&#24615;&#21644;&#23545;&#25239;&#24615;&#30340;&#35821;&#35328;&#12289;&#37325;&#22797;&#24378;&#35843;&#31561;&#26041;&#38754;&#19982;&#20854;&#20182;&#24635;&#32479;&#20505;&#36873;&#20154;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;&#27492;&#22806;&#65292;&#29305;&#26391;&#26222;&#27604;&#20849;&#21644;&#20826;&#21516;&#20698;&#26356;&#20855;&#29420;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21776;&#32435;&#24503;&#183;&#29305;&#26391;&#26222;&#19982;&#20854;&#20182;&#24635;&#32479;&#22312;&#28436;&#35762;&#20013;&#26159;&#21542;&#34920;&#36798;&#20986;&#19981;&#21516;&#30340;&#39118;&#26684;&#65311;&#22914;&#26524;&#26159;&#65292;&#26377;&#21738;&#20123;&#26041;&#38754;&#30340;&#19981;&#21516;&#65311;&#36825;&#20123;&#24046;&#24322;&#26159;&#21542;&#23616;&#38480;&#20110;&#20219;&#20309;&#21333;&#19968;&#30340;&#27807;&#36890;&#23186;&#20171;&#65311;&#20026;&#20102;&#35843;&#26597;&#36825;&#20123;&#38382;&#39064;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#29420;&#29305;&#24615;&#24230;&#37327;&#26631;&#20934;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#20998;&#35010;&#24615;&#28436;&#35762;&#35789;&#24211;&#65292;&#24182;&#25552;&#20986;&#20102;&#27604;&#36739;&#25919;&#27835;&#23545;&#25163;&#35789;&#27719;&#29305;&#24449;&#30340;&#26694;&#26550;&#12290;&#23558;&#36825;&#20123;&#24037;&#20855;&#24212;&#29992;&#20110;&#22810;&#31181;&#24635;&#32479;&#28436;&#35762;&#35821;&#26009;&#24211;&#65292;&#25105;&#20204;&#21457;&#29616;&#26377;&#30456;&#24403;&#22810;&#30340;&#35777;&#25454;&#34920;&#26126;&#29305;&#26391;&#26222;&#30340;&#35762;&#35805;&#27169;&#24335;&#19982;&#36817;&#20195;&#21382;&#20219;&#20027;&#35201;&#24635;&#32479;&#20505;&#36873;&#20154;&#19981;&#21516;&#12290;&#19968;&#20123;&#26174;&#33879;&#30340;&#21457;&#29616;&#21253;&#25324;&#29305;&#26391;&#26222;&#20351;&#29992;&#29305;&#21035;&#20855;&#26377;&#20998;&#35010;&#24615;&#21644;&#23545;&#25239;&#24615;&#30340;&#35821;&#35328;&#38024;&#23545;&#20182;&#30340;&#25919;&#27835;&#23545;&#25163;&#65292;&#24182;&#19988;&#20182;&#37325;&#22797;&#24378;&#35843;&#30340;&#27169;&#24335;&#12290;&#27492;&#22806;&#65292;&#29305;&#26391;&#26222;&#27604;&#20182;&#30340;&#20849;&#21644;&#20826;&#21516;&#20698;&#26356;&#21152;&#29420;&#29305;&#65292;&#32780;&#20182;&#20204;&#30340;&#29420;&#29305;&#24615;&#20540;&#19982;&#27665;&#20027;&#20826;&#30456;&#23545;&#36739;&#25509;&#36817;&#12290;&#36825;&#20123;&#24046;&#24322;&#22312;&#22810;&#31181;&#24230;&#37327;&#26041;&#27861;&#19979;&#20445;&#25345;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
Does Donald Trump speak differently from other presidents? If so, in what ways? Are these differences confined to any single medium of communication? To investigate these questions, this paper introduces a novel metric of uniqueness based on large language models, develops a new lexicon for divisive speech, and presents a framework for comparing the lexical features of political opponents. Applying these tools to a variety of corpora of presidential speeches, we find considerable evidence that Trump's speech patterns diverge from those of all major party nominees for the presidency in recent history. Some notable findings include Trump's employment of particularly divisive and antagonistic language targeting of his political opponents and his patterns of repetition for emphasis. Furthermore, Trump is significantly more distinctive than his fellow Republicans, whose uniqueness values are comparably closer to those of the Democrats. These differences hold across a variety of measurement 
&lt;/p&gt;</description></item></channel></rss>