<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;L-BFGS-B&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#22312;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#35782;&#21035;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31995;&#32479;&#65292;&#30456;&#27604;&#20256;&#32479;&#32447;&#24615;&#23376;&#31354;&#38388;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#32467;&#26524;&#12289;&#25439;&#22833;&#21644;&#27491;&#21017;&#21270;&#39033;&#20351;&#29992;&#30340;&#36890;&#29992;&#24615;&#20197;&#21450;&#25968;&#20540;&#31283;&#23450;&#24615;&#26041;&#38754;&#36890;&#24120;&#25552;&#20379;&#26356;&#22909;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#21487;&#20197;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#31181;&#21442;&#25968;&#21270;&#38750;&#32447;&#24615;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;</title><link>https://arxiv.org/abs/2403.03827</link><description>&lt;p&gt;
&#22312;L-BFGS-B&#31639;&#27861;&#30340;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#36827;&#34892;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31995;&#32479;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Linear and nonlinear system identification under $\ell_1$- and group-Lasso regularization via L-BFGS-B
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03827
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;L-BFGS-B&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#22312;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#35782;&#21035;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31995;&#32479;&#65292;&#30456;&#27604;&#20256;&#32479;&#32447;&#24615;&#23376;&#31354;&#38388;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#32467;&#26524;&#12289;&#25439;&#22833;&#21644;&#27491;&#21017;&#21270;&#39033;&#20351;&#29992;&#30340;&#36890;&#29992;&#24615;&#20197;&#21450;&#25968;&#20540;&#31283;&#23450;&#24615;&#26041;&#38754;&#36890;&#24120;&#25552;&#20379;&#26356;&#22909;&#30340;&#34920;&#29616;&#65292;&#24182;&#19988;&#21487;&#20197;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#31181;&#21442;&#25968;&#21270;&#38750;&#32447;&#24615;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;L-BFGS-B&#31639;&#27861;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#21487;&#33021;&#22312;$\ell_1$&#21644;group-Lasso&#27491;&#21017;&#21270;&#19979;&#30340;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#31163;&#25955;&#26102;&#38388;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;&#38024;&#23545;&#32447;&#24615;&#27169;&#22411;&#30340;&#35782;&#21035;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19982;&#32463;&#20856;&#32447;&#24615;&#23376;&#31354;&#38388;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#25552;&#20379;&#26356;&#22909;&#30340;&#32467;&#26524;&#65292;&#22312;&#25439;&#22833;&#21644;&#27491;&#21017;&#21270;&#39033;&#30340;&#20351;&#29992;&#26041;&#38754;&#26356;&#21152;&#36890;&#29992;&#65292;&#20063;&#22312;&#25968;&#20540;&#19978;&#26356;&#21152;&#31283;&#23450;&#12290;&#35813;&#26041;&#27861;&#19981;&#20165;&#20016;&#23500;&#20102;&#29616;&#26377;&#30340;&#32447;&#24615;&#31995;&#32479;&#35782;&#21035;&#24037;&#20855;&#38598;&#65292;&#36824;&#21487;&#20197;&#24212;&#29992;&#20110;&#35782;&#21035;&#21253;&#25324;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#22312;&#20869;&#30340;&#38750;&#24120;&#24191;&#27867;&#30340;&#21442;&#25968;&#21270;&#38750;&#32447;&#24615;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#12290;&#25105;&#20204;&#22312;&#21512;&#25104;&#21644;&#23454;&#39564;&#25968;&#25454;&#38598;&#19978;&#28436;&#31034;&#20102;&#35813;&#26041;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#35299;&#20915;Weigand&#31561;&#20154;&#65288;2022&#24180;&#65289;&#25552;&#20986;&#30340;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#24037;&#19994;&#26426;&#22120;&#20154;&#22522;&#20934;&#30340;&#38750;&#32447;&#24615;&#22810;&#36755;&#20837;/&#22810;&#36755;&#20986;&#31995;&#32479;&#35782;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03827v1 Announce Type: cross  Abstract: In this paper, we propose an approach for identifying linear and nonlinear discrete-time state-space models, possibly under $\ell_1$- and group-Lasso regularization, based on the L-BFGS-B algorithm. For the identification of linear models, we show that, compared to classical linear subspace methods, the approach often provides better results, is much more general in terms of the loss and regularization terms used, and is also more stable from a numerical point of view. The proposed method not only enriches the existing set of linear system identification tools but can be also applied to identifying a very broad class of parametric nonlinear state-space models, including recurrent neural networks. We illustrate the approach on synthetic and experimental datasets and apply it to solve the challenging industrial robot benchmark for nonlinear multi-input/multi-output system identification proposed by Weigand et al. (2022). A Python impleme
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#36741;&#21161;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#22823;&#35268;&#27169;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#12290;&#36890;&#36807;&#26500;&#24314;&#21644;&#27714;&#35299;&#21487;&#34892;&#30340;&#26102;&#38388;&#32858;&#21512;&#20195;&#29702;&#38382;&#39064;&#65292;&#35782;&#21035;&#20986;&#20302;&#25104;&#26412;&#30340;&#35268;&#21010;&#20915;&#31574;&#12290;&#36890;&#36807;&#22312;&#39564;&#35777;&#38598;&#21644;&#27979;&#35797;&#39044;&#27979;&#19978;&#35780;&#20272;&#35299;&#20915;&#30340;&#35268;&#21010;&#32467;&#26524;&#65292;&#23454;&#29616;&#20102;&#38543;&#26426;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#30340;&#21487;&#34892;&#35299;&#20915;&#12290;</title><link>http://arxiv.org/abs/2401.10451</link><description>&lt;p&gt;
&#23398;&#20064;&#36741;&#21161;&#30340;&#38543;&#26426;&#23481;&#37327;&#25193;&#23637;&#35268;&#21010;&#65306;&#19968;&#31181;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Learning-assisted Stochastic Capacity Expansion Planning: A Bayesian Optimization Approach. (arXiv:2401.10451v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10451
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#36741;&#21161;&#30340;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#22823;&#35268;&#27169;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#12290;&#36890;&#36807;&#26500;&#24314;&#21644;&#27714;&#35299;&#21487;&#34892;&#30340;&#26102;&#38388;&#32858;&#21512;&#20195;&#29702;&#38382;&#39064;&#65292;&#35782;&#21035;&#20986;&#20302;&#25104;&#26412;&#30340;&#35268;&#21010;&#20915;&#31574;&#12290;&#36890;&#36807;&#22312;&#39564;&#35777;&#38598;&#21644;&#27979;&#35797;&#39044;&#27979;&#19978;&#35780;&#20272;&#35299;&#20915;&#30340;&#35268;&#21010;&#32467;&#26524;&#65292;&#23454;&#29616;&#20102;&#38543;&#26426;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#30340;&#21487;&#34892;&#35299;&#20915;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35299;&#20915;&#22823;&#35268;&#27169;&#30340;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#23545;&#20110;&#21306;&#22495;&#33021;&#28304;&#31995;&#32479;&#30340;&#25104;&#26412;&#25928;&#30410;&#20302;&#30899;&#21270;&#33267;&#20851;&#37325;&#35201;&#12290;&#20026;&#20102;&#30830;&#20445;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#30340;&#39044;&#26399;&#32467;&#26524;&#65292;&#24314;&#27169;&#32771;&#34385;&#21040;&#22825;&#27668;&#30456;&#20851;&#30340;&#21487;&#20877;&#29983;&#33021;&#28304;&#20379;&#24212;&#21644;&#33021;&#28304;&#38656;&#27714;&#30340;&#19981;&#30830;&#23450;&#24615;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#30001;&#27492;&#20135;&#29983;&#30340;&#38543;&#26426;&#20248;&#21270;&#27169;&#22411;&#36890;&#24120;&#27604;&#30830;&#23450;&#24615;&#27169;&#22411;&#38590;&#20197;&#35745;&#31639;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23398;&#20064;&#36741;&#21161;&#30340;&#36817;&#20284;&#35299;&#27861;&#26469;&#21487;&#34892;&#22320;&#35299;&#20915;&#20004;&#38454;&#27573;&#38543;&#26426;&#23481;&#37327;&#25193;&#23637;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#26500;&#24314;&#21644;&#27714;&#35299;&#19968;&#31995;&#21015;&#21487;&#34892;&#30340;&#26102;&#38388;&#32858;&#21512;&#20195;&#29702;&#38382;&#39064;&#65292;&#35782;&#21035;&#20986;&#20302;&#25104;&#26412;&#30340;&#35268;&#21010;&#20915;&#31574;&#12290;&#25105;&#20204;&#37319;&#29992;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;&#25628;&#32034;&#26102;&#38388;&#24207;&#21015;&#32858;&#21512;&#36229;&#21442;&#25968;&#30340;&#31354;&#38388;&#65292;&#24182;&#35745;&#31639;&#22312;&#20379;&#38656;&#39044;&#27979;&#30340;&#39564;&#35777;&#38598;&#19978;&#26368;&#23567;&#21270;&#25104;&#26412;&#30340;&#36817;&#20284;&#35299;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#22312;&#19968;&#32452;&#20445;&#30041;&#30340;&#27979;&#35797;&#39044;&#27979;&#19978;&#35780;&#20272;&#35299;&#20915;&#30340;&#35268;&#21010;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Solving large-scale capacity expansion problems (CEPs) is central to cost-effective decarbonization of regional-scale energy systems. To ensure the intended outcomes of CEPs, modeling uncertainty due to weather-dependent variable renewable energy (VRE) supply and energy demand becomes crucially important. However, the resulting stochastic optimization models are often less computationally tractable than their deterministic counterparts. Here, we propose a learning-assisted approximate solution method to tractably solve two-stage stochastic CEPs. Our method identifies low-cost planning decisions by constructing and solving a sequence of tractable temporally aggregated surrogate problems. We adopt a Bayesian optimization approach to searching the space of time series aggregation hyperparameters and compute approximate solutions that minimize costs on a validation set of supply-demand projections. Importantly, we evaluate solved planning outcomes on a held-out set of test projections. We 
&lt;/p&gt;</description></item></channel></rss>