<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#31038;&#21306;&#25289;&#31080;&#30340;&#21160;&#24577;&#22810;&#27493;&#23545;&#25239;&#24615;&#25915;&#20987;&#65292;&#20351;&#24471;&#23545;&#25163;&#33021;&#22815;&#21033;&#29992;&#22522;&#20110;&#26799;&#24230;&#30340;&#25915;&#20987;&#26469;&#31574;&#21010;&#30446;&#26631;&#36873;&#27665;&#30340;&#25805;&#32437;&#12290;</title><link>https://arxiv.org/abs/2403.12399</link><description>&lt;p&gt;
&#23558;&#32593;&#32476;&#36873;&#20030;&#21270;&#65306;&#29992;&#20110;&#31038;&#21306;&#25289;&#31080;&#30340;&#21160;&#24577;&#22810;&#27493;&#23545;&#25239;&#24615;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Electioneering the Network: Dynamic Multi-Step Adversarial Attacks for Community Canvassing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#31038;&#21306;&#25289;&#31080;&#30340;&#21160;&#24577;&#22810;&#27493;&#23545;&#25239;&#24615;&#25915;&#20987;&#65292;&#20351;&#24471;&#23545;&#25163;&#33021;&#22815;&#21033;&#29992;&#22522;&#20110;&#26799;&#24230;&#30340;&#25915;&#20987;&#26469;&#31574;&#21010;&#30446;&#26631;&#36873;&#27665;&#30340;&#25805;&#32437;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20170;&#22825;&#30340;&#19990;&#30028;&#20013;&#65292;&#23545;&#20110;&#31038;&#21306;&#25289;&#31080;&#30340;&#22312;&#32447;&#31038;&#20132;&#32593;&#32476;&#25805;&#32437;&#38382;&#39064;&#26159;&#19968;&#20010;&#30495;&#27491;&#20851;&#27880;&#30340;&#38382;&#39064;&#12290;&#21463;&#36873;&#27665;&#27169;&#22411;&#12289;&#32593;&#32476;&#19978;&#30340;&#35266;&#28857;&#21644;&#26497;&#21270;&#21160;&#24577;&#30340;&#30740;&#31350;&#21551;&#21457;&#65292;&#25105;&#20204;&#23558;&#31038;&#21306;&#25289;&#31080;&#24314;&#27169;&#20026;&#19968;&#20010;&#36890;&#36807;&#23545;GNN&#36827;&#34892;&#22522;&#20110;&#26799;&#24230;&#30340;&#25915;&#20987;&#32780;&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#30340;&#21160;&#24577;&#36807;&#31243;&#12290;&#29616;&#26377;&#30340;GNN&#25915;&#20987;&#37117;&#26159;&#21333;&#27493;&#30340;&#65292;&#27809;&#26377;&#32771;&#34385;&#32593;&#32476;&#20013;&#20449;&#24687;&#20256;&#25773;&#30340;&#21160;&#24577;&#32423;&#32852;&#29305;&#24615;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#29616;&#23454;&#30340;&#22330;&#26223;&#65292;&#21363;&#23545;&#25163;&#20351;&#29992;GNN&#20316;&#20026;&#20195;&#29702;&#26469;&#39044;&#27979;&#21644;&#25805;&#32437;&#36873;&#27665;&#20559;&#22909;&#65292;&#29305;&#21035;&#26159;&#19981;&#30830;&#23450;&#30340;&#36873;&#27665;&#12290;&#23545;GNN&#30340;&#22522;&#20110;&#26799;&#24230;&#30340;&#25915;&#20987;&#36890;&#30693;&#23545;&#25163;&#21487;&#20197;&#36827;&#34892;&#25112;&#30053;&#25805;&#32437;&#65292;&#20197;&#20351;&#24471;&#30446;&#26631;&#36873;&#27665;&#20837;&#25945;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;$\textit{&#31038;&#21306;&#25289;&#31080;&#30340;&#26368;&#23567;&#39044;&#31639;&#25915;&#20987;}$&#65288;MBACC&#65289;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;MBACC&#38382;&#39064;&#26159;NP&#22256;&#38590;&#30340;&#65292;&#24182;&#25552;&#20986;&#20102;&#21160;&#24577;&#22810;&#27493;&#23545;&#25239;&#24615;&#31038;&#21306;&#25289;&#31080;&#65288;MAC&#65289;&#26469;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#12290;MAC m
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12399v1 Announce Type: new  Abstract: The problem of online social network manipulation for community canvassing is of real concern in today's world. Motivated by the study of voter models, opinion and polarization dynamics on networks, we model community canvassing as a dynamic process over a network enabled via gradient-based attacks on GNNs. Existing attacks on GNNs are all single-step and do not account for the dynamic cascading nature of information diffusion in networks. We consider the realistic scenario where an adversary uses a GNN as a proxy to predict and manipulate voter preferences, especially uncertain voters. Gradient-based attacks on the GNN inform the adversary of strategic manipulations that can be made to proselytize targeted voters. In particular, we explore $\textit{minimum budget attacks for community canvassing}$ (MBACC). We show that the MBACC problem is NP-Hard and propose Dynamic Multi-Step Adversarial Community Canvassing (MAC) to address it. MAC m
&lt;/p&gt;</description></item></channel></rss>