<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>SmartChoices &#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#26426;&#22120;&#23398;&#20064;&#19982;&#29616;&#26377;&#36719;&#20214;&#31995;&#32479;&#36731;&#26494;&#12289;&#23433;&#20840;&#12289;&#26377;&#25928;&#22320;&#32467;&#21512;&#30340;&#26032;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2304.13033</link><description>&lt;p&gt;
SmartChoices: &#23398;&#20064;&#23454;&#29616;&#22686;&#24378;&#36719;&#20214;
&lt;/p&gt;
&lt;p&gt;
SmartChoices: Augmenting Software with Learned Implementations. (arXiv:2304.13033v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13033
&lt;/p&gt;
&lt;p&gt;
SmartChoices &#25552;&#20986;&#20102;&#19968;&#31181;&#23558;&#26426;&#22120;&#23398;&#20064;&#19982;&#29616;&#26377;&#36719;&#20214;&#31995;&#32479;&#36731;&#26494;&#12289;&#23433;&#20840;&#12289;&#26377;&#25928;&#22320;&#32467;&#21512;&#30340;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#27491;&#22788;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#40644;&#37329;&#26102;&#20195;&#12290;&#24378;&#22823;&#30340;&#27169;&#22411;&#27491;&#22312;&#35757;&#32451;&#20013;&#65292;&#36828;&#27604;&#20165;&#20351;&#29992;&#20256;&#32479;&#36719;&#20214;&#24037;&#31243;&#26041;&#27861;&#26356;&#22909;&#22320;&#25191;&#34892;&#35768;&#22810;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#23558;&#36825;&#20123;&#27169;&#22411;&#24320;&#21457;&#24182;&#37096;&#32626;&#21040;&#29616;&#26377;&#36719;&#20214;&#31995;&#32479;&#20013;&#20173;&#28982;&#24456;&#22256;&#38590;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102; SmartChoices&#65292;&#19968;&#31181;&#23558;&#26426;&#22120;&#23398;&#20064;&#36731;&#26494;&#12289;&#23433;&#20840;&#12289;&#26377;&#25928;&#22320;&#32467;&#21512;&#21040;&#25104;&#29087;&#36719;&#20214;&#22534;&#26632;&#20013;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#35299;&#37322;&#20102;&#24635;&#20307;&#35774;&#35745;&#29702;&#24565;&#65292;&#24182;&#23637;&#31034;&#20102;&#20351;&#29992; SmartChoices &#22312;&#22823;&#22411;&#24037;&#19994;&#31995;&#32479;&#20013;&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
We are living in a golden age of machine learning. Powerful models are being trained to perform many tasks far better than is possible using traditional software engineering approaches alone. However, developing and deploying those models in existing software systems remains difficult. In this paper we present SmartChoices, a novel approach to incorporating machine learning into mature software stacks easily, safely, and effectively. We explain the overall design philosophy and present case studies using SmartChoices within large scale industrial systems.
&lt;/p&gt;</description></item></channel></rss>