<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36816;&#33829;&#21253;&#32476;&#30340;&#20998;&#25955;&#24335;&#33021;&#28304;&#31038;&#21306;&#24066;&#22330;&#26426;&#21046;&#65292;&#36890;&#36807;&#21452;&#37096;&#23450;&#20215;&#23454;&#29616;&#20102;&#32435;&#20160;&#22343;&#34913;&#65292;&#26368;&#22823;&#21270;&#31038;&#21306;&#30340;&#31038;&#20250;&#31119;&#21033;&#65292;&#21516;&#26102;&#20445;&#35777;&#31038;&#21306;&#30340;&#36816;&#33829;&#36981;&#23432;&#32422;&#26463;&#12290;</title><link>https://arxiv.org/abs/2402.17201</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#36816;&#33829;&#21253;&#32476;&#30340;&#20998;&#25955;&#24335;&#33021;&#28304;&#31038;&#21306;&#24066;&#22330;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
A Decentralized Market Mechanism for Energy Communities under Operating Envelopes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17201
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36816;&#33829;&#21253;&#32476;&#30340;&#20998;&#25955;&#24335;&#33021;&#28304;&#31038;&#21306;&#24066;&#22330;&#26426;&#21046;&#65292;&#36890;&#36807;&#21452;&#37096;&#23450;&#20215;&#23454;&#29616;&#20102;&#32435;&#20160;&#22343;&#34913;&#65292;&#26368;&#22823;&#21270;&#31038;&#21306;&#30340;&#31038;&#20250;&#31119;&#21033;&#65292;&#21516;&#26102;&#20445;&#35777;&#31038;&#21306;&#30340;&#36816;&#33829;&#36981;&#23432;&#32422;&#26463;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36816;&#33829;&#21253;&#32476;&#65288;OEs&#65289;&#30340;&#33021;&#28304;&#31038;&#21306;&#24066;&#22330;&#26426;&#21046;&#65292;&#26681;&#25454;&#21452;&#37096;&#23450;&#20215;&#21160;&#24577;&#25910;&#36153;/&#22870;&#21169;&#20854;&#25104;&#21592;&#12290;OE&#30001;&#30417;&#31649;&#30340;&#37197;&#30005;&#31995;&#32479;&#36816;&#33829;&#21830;&#65288;DSO&#65289;&#22806;&#37096;&#24378;&#21152;&#22312;&#33021;&#28304;&#31038;&#21306;&#30340;&#25910;&#20837;&#34920;&#19978;&#65292;&#35813;&#34920;&#21463;&#21040;&#24191;&#20041;&#20928;&#33021;&#37327;&#35745;&#37327;&#65288;NEM&#65289;&#30005;&#20215;&#35774;&#35745;&#30340;&#32422;&#26463;&#12290;&#36890;&#36807;&#23558;&#31038;&#21306;&#31649;&#29702;&#32773;&#19982;&#20854;&#25104;&#21592;&#30340;&#20114;&#21160;&#24314;&#27169;&#20026;Stackelberg&#21338;&#24328;&#65292;&#25105;&#20204;&#34920;&#26126;&#25152;&#25552;&#20986;&#30340;&#21452;&#37096;&#23450;&#20215;&#23454;&#29616;&#20102;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#36890;&#36807;&#20998;&#25955;&#24335;&#26041;&#24335;&#26368;&#22823;&#21270;&#20102;&#31038;&#21306;&#30340;&#31038;&#20250;&#31119;&#21033;&#65292;&#21516;&#26102;&#30830;&#20445;&#31038;&#21306;&#30340;&#36816;&#33829;&#36981;&#23432;OE&#12290;&#24066;&#22330;&#26426;&#21046;&#31526;&#21512;&#25104;&#26412;&#22240;&#26524;&#20851;&#31995;&#21407;&#21017;&#65292;&#20445;&#35777;&#31038;&#21306;&#25104;&#21592;&#30340;&#21097;&#20313;&#27700;&#24179;&#33267;&#23569;&#19981;&#20302;&#20110;&#20182;&#20204;&#33258;&#20027;&#38754;&#23545;DSO&#26102;&#30340;&#26368;&#22823;&#21097;&#20313;&#12290;&#21160;&#24577;&#19988;&#32479;&#19968;&#30340;&#31038;&#21306;&#20215;&#26684;&#26159;&#31038;&#21306;&#24635;&#20307;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#21333;&#20943;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17201v1 Announce Type: cross  Abstract: We propose an operating envelopes (OEs) aware energy community market mechanism that dynamically charges/rewards its members based on two-part pricing. The OEs are imposed exogenously by a regulated distribution system operator (DSO) on the energy community's revenue meter that is subject to a generalized net energy metering (NEM) tariff design. By formulating the interaction of the community manager and its members as a Stackelberg game, we show that the proposed two-part pricing achieves a Nash equilibrium and maximizes the community's social welfare in a decentralized fashion while ensuring that the community's operation abides by the OEs. The market mechanism conforms with the cost-causation principle and guarantees community members a surplus level no less than their maximum surplus when they autonomously face the DSO. The dynamic and uniform community price is a monotonically decreasing function of the community's aggregate renew
&lt;/p&gt;</description></item></channel></rss>