<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>RepairAgent&#26159;&#39318;&#20010;&#36890;&#36807;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#33258;&#20027;&#20195;&#29702;&#31243;&#24207;&#26469;&#35299;&#20915;&#31243;&#24207;&#20462;&#22797;&#25361;&#25112;&#30340;&#24037;&#20316;&#65292;&#20854;&#20851;&#38190;&#36129;&#29486;&#22312;&#20110;&#25552;&#20379;&#20102;&#19968;&#32452;&#26377;&#21161;&#20110;&#31243;&#24207;&#20462;&#22797;&#30340;&#24037;&#20855;&#20197;&#21450;&#21160;&#24577;&#26356;&#26032;&#30340;&#25552;&#31034;&#26684;&#24335;&#12290;</title><link>https://arxiv.org/abs/2403.17134</link><description>&lt;p&gt;
RepairAgent&#65306;&#19968;&#31181;&#22522;&#20110;LLM&#30340;&#33258;&#20027;&#20195;&#29702;&#31243;&#24207;&#20462;&#22797;&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;
RepairAgent: An Autonomous, LLM-Based Agent for Program Repair
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17134
&lt;/p&gt;
&lt;p&gt;
RepairAgent&#26159;&#39318;&#20010;&#36890;&#36807;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#33258;&#20027;&#20195;&#29702;&#31243;&#24207;&#26469;&#35299;&#20915;&#31243;&#24207;&#20462;&#22797;&#25361;&#25112;&#30340;&#24037;&#20316;&#65292;&#20854;&#20851;&#38190;&#36129;&#29486;&#22312;&#20110;&#25552;&#20379;&#20102;&#19968;&#32452;&#26377;&#21161;&#20110;&#31243;&#24207;&#20462;&#22797;&#30340;&#24037;&#20855;&#20197;&#21450;&#21160;&#24577;&#26356;&#26032;&#30340;&#25552;&#31034;&#26684;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#31243;&#24207;&#20462;&#22797;&#24050;&#32463;&#25104;&#20026;&#19968;&#31181;&#24378;&#22823;&#30340;&#25216;&#26415;&#65292;&#21487;&#20197;&#20943;&#36731;&#36719;&#20214;&#28431;&#27934;&#23545;&#31995;&#32479;&#21487;&#38752;&#24615;&#21644;&#29992;&#25143;&#20307;&#39564;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;RepairAgent&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#36890;&#36807;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;(LLM)&#30340;&#33258;&#20027;&#20195;&#29702;&#35299;&#20915;&#31243;&#24207;&#20462;&#22797;&#25361;&#25112;&#30340;&#24037;&#20316;&#12290;&#19982;&#29616;&#26377;&#30340;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#19981;&#21516;&#65292;&#36825;&#20123;&#26041;&#27861;&#20250;&#29992;&#22266;&#23450;&#30340;&#25552;&#31034;&#25110;&#22312;&#22266;&#23450;&#30340;&#21453;&#39304;&#24490;&#29615;&#20013;&#25552;&#31034;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#23558;LLM&#35270;&#20026;&#19968;&#31181;&#33021;&#22815;&#33258;&#20027;&#35268;&#21010;&#21644;&#25191;&#34892;&#20462;&#22797;&#25805;&#20316;&#30340;&#20195;&#29702;&#31243;&#24207;&#65292;&#36890;&#36807;&#35843;&#29992;&#36866;&#24403;&#30340;&#24037;&#20855;&#20462;&#22797;&#28431;&#27934;&#12290;RepairAgent&#33258;&#30001;&#22320;&#20132;&#32455;&#30528;&#25910;&#38598;&#26377;&#20851;&#28431;&#27934;&#30340;&#20449;&#24687;&#12289;&#25910;&#38598;&#20462;&#22797;&#26448;&#26009;&#20197;&#21450;&#39564;&#35777;&#20462;&#22797;&#36807;&#31243;&#65292;&#24182;&#26681;&#25454;&#25910;&#38598;&#21040;&#30340;&#20449;&#24687;&#21644;&#20808;&#21069;&#30340;&#20462;&#22797;&#23581;&#35797;&#21453;&#39304;&#20915;&#23450;&#35843;&#29992;&#21738;&#20123;&#24037;&#20855;&#12290;&#23454;&#29616;RepairAgent&#30340;&#20851;&#38190;&#36129;&#29486;&#21253;&#25324;&#19968;&#32452;&#26377;&#21161;&#20110;&#31243;&#24207;&#20462;&#22797;&#30340;&#24037;&#20855;&#65292;&#20197;&#21450;&#19968;&#20010;&#21160;&#24577;&#26356;&#26032;&#30340;&#25552;&#31034;&#26684;&#24335;&#65292;&#20351;LLM&#33021;&#22815;&#36827;&#34892;&#20132;&#20114;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17134v1 Announce Type: cross  Abstract: Automated program repair has emerged as a powerful technique to mitigate the impact of software bugs on system reliability and user experience. This paper introduces RepairAgent, the first work to address the program repair challenge through an autonomous agent based on a large language model (LLM). Unlike existing deep learning-based approaches, which prompt a model with a fixed prompt or in a fixed feedback loop, our work treats the LLM as an agent capable of autonomously planning and executing actions to fix bugs by invoking suitable tools. RepairAgent freely interleaves gathering information about the bug, gathering repair ingredients, and validating fixes, while deciding which tools to invoke based on the gathered information and feedback from previous fix attempts. Key contributions that enable RepairAgent include a set of tools that are useful for program repair, a dynamically updated prompt format that allows the LLM to interac
&lt;/p&gt;</description></item></channel></rss>