<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#20174;&#25511;&#21046;&#29702;&#35770;&#30340;&#35282;&#24230;&#65292;&#25552;&#20379;&#20102;Roesser&#31867;&#22411;&#30340;2-D&#21367;&#31215;&#23618;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#65292;&#20855;&#26377;&#26368;&#23567;&#21270;&#30340;&#29366;&#24577;&#25968;&#37327;&#65292;&#22312;$c_\mathrm{in}=c_\mathrm{out}$&#30340;&#24773;&#20917;&#19979;&#35777;&#26126;&#20102;&#36825;&#19968;&#28857;&#65292;&#24182;&#36827;&#19968;&#27493;&#23454;&#29616;&#20102;&#25193;&#24352;&#12289;&#36328;&#36234;&#21644;N-D&#21367;&#31215;&#30340;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#12290;</title><link>https://arxiv.org/abs/2403.11938</link><description>&lt;p&gt;
Roesser&#31867;&#22411;&#30340;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#29992;&#20110;&#21367;&#31215;&#23618;
&lt;/p&gt;
&lt;p&gt;
State space representations of the Roesser type for convolutional layers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11938
&lt;/p&gt;
&lt;p&gt;
&#20174;&#25511;&#21046;&#29702;&#35770;&#30340;&#35282;&#24230;&#65292;&#25552;&#20379;&#20102;Roesser&#31867;&#22411;&#30340;2-D&#21367;&#31215;&#23618;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#65292;&#20855;&#26377;&#26368;&#23567;&#21270;&#30340;&#29366;&#24577;&#25968;&#37327;&#65292;&#22312;$c_\mathrm{in}=c_\mathrm{out}$&#30340;&#24773;&#20917;&#19979;&#35777;&#26126;&#20102;&#36825;&#19968;&#28857;&#65292;&#24182;&#36827;&#19968;&#27493;&#23454;&#29616;&#20102;&#25193;&#24352;&#12289;&#36328;&#36234;&#21644;N-D&#21367;&#31215;&#30340;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#25511;&#21046;&#29702;&#35770;&#30340;&#35282;&#24230;&#30475;&#65292;&#21367;&#31215;&#23618;&#65288;&#31070;&#32463;&#32593;&#32476;&#30340;&#65289;&#26159;2-D&#65288;&#25110;N-D&#65289;&#32447;&#24615;&#26102;&#19981;&#21464;&#21160;&#24577;&#31995;&#32479;&#12290;&#21367;&#31215;&#23618;&#36890;&#24120;&#36890;&#36807;&#21367;&#31215;&#26680;&#34920;&#31034;&#65292;&#23545;&#24212;&#20110;&#21160;&#24577;&#31995;&#32479;&#36890;&#36807;&#20854;&#33033;&#20914;&#21709;&#24212;&#34920;&#31034;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#25511;&#21046;&#29702;&#35770;&#30340;&#20998;&#26512;&#24037;&#20855;&#65292;&#20363;&#22914;&#28041;&#21450;&#32447;&#24615;&#30697;&#38453;&#19981;&#31561;&#24335;&#30340;&#24037;&#20855;&#65292;&#38656;&#35201;&#19968;&#20010;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#26126;&#30830;&#25552;&#20379;&#20102;Roesser&#31867;&#22411;&#30340;2-D&#21367;&#31215;&#23618;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#65292;&#20855;&#26377;$c_\mathrm{in}r_1+c_\mathrm{out}r_2$&#20010;&#29366;&#24577;&#65292;&#20854;&#20013;$c_\mathrm{in}/c_\mathrm{out}$&#26159;&#23618;&#30340;&#36755;&#20837;/&#36755;&#20986;&#36890;&#36947;&#25968;&#65292;$r_1/r_2$ &#34920;&#31034;&#21367;&#31215;&#26680;&#30340;&#23485;&#24230;/&#38271;&#24230;&#12290;&#23545;&#20110;$c_\mathrm{in}=c_\mathrm{out}$&#65292;&#24050;&#32463;&#35777;&#26126;&#36825;&#31181;&#34920;&#31034;&#26159;&#26368;&#23567;&#30340;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#26500;&#24314;&#20102;&#25193;&#24352;&#12289;&#36328;&#36234;&#21644;N-D&#21367;&#31215;&#30340;&#29366;&#24577;&#31354;&#38388;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11938v1 Announce Type: cross  Abstract: From the perspective of control theory, convolutional layers (of neural networks) are 2-D (or N-D) linear time-invariant dynamical systems. The usual representation of convolutional layers by the convolution kernel corresponds to the representation of a dynamical system by its impulse response. However, many analysis tools from control theory, e.g., involving linear matrix inequalities, require a state space representation. For this reason, we explicitly provide a state space representation of the Roesser type for 2-D convolutional layers with $c_\mathrm{in}r_1 + c_\mathrm{out}r_2$ states, where $c_\mathrm{in}$/$c_\mathrm{out}$ is the number of input/output channels of the layer and $r_1$/$r_2$ characterizes the width/length of the convolution kernel. This representation is shown to be minimal for $c_\mathrm{in} = c_\mathrm{out}$. We further construct state space representations for dilated, strided, and N-D convolutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#24341;&#20837;&#23433;&#20840;&#32771;&#34385;&#20316;&#20026;&#32467;&#26500;&#20803;&#32032;&#65292;&#20197;&#31995;&#32479;&#32508;&#21512;&#30340;&#26041;&#24335;&#30830;&#20445;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#36825;&#19968;&#27010;&#24565;&#19981;&#20165;&#19982;&#29616;&#26377;&#30340;&#23433;&#20840;&#26631;&#20934;&#30456;&#22865;&#21512;&#65292;&#36824;&#20026;AI&#23433;&#20840;&#30456;&#20851;&#30340;&#23398;&#26415;&#20986;&#29256;&#29289;&#21644;&#26631;&#20934;&#25552;&#20379;&#20102;&#26032;&#30340;&#21551;&#31034;&#12290;</title><link>http://arxiv.org/abs/2309.03774</link><description>&lt;p&gt;
&#33258;&#21160;&#39550;&#39542;&#24863;&#30693;&#20013;&#30340;&#28145;&#24230;&#23398;&#20064;&#23433;&#20840;&#32771;&#34385;
&lt;/p&gt;
&lt;p&gt;
Deep Learning Safety Concerns in Automated Driving Perception. (arXiv:2309.03774v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03774
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#24341;&#20837;&#23433;&#20840;&#32771;&#34385;&#20316;&#20026;&#32467;&#26500;&#20803;&#32032;&#65292;&#20197;&#31995;&#32479;&#32508;&#21512;&#30340;&#26041;&#24335;&#30830;&#20445;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#12290;&#36825;&#19968;&#27010;&#24565;&#19981;&#20165;&#19982;&#29616;&#26377;&#30340;&#23433;&#20840;&#26631;&#20934;&#30456;&#22865;&#21512;&#65292;&#36824;&#20026;AI&#23433;&#20840;&#30456;&#20851;&#30340;&#23398;&#26415;&#20986;&#29256;&#29289;&#21644;&#26631;&#20934;&#25552;&#20379;&#20102;&#26032;&#30340;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#20197;&#21450;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNNs&#65289;&#22312;&#24863;&#30693;&#26041;&#38754;&#30340;&#20986;&#33394;&#24615;&#33021;&#23548;&#33268;&#20102;&#23545;&#20854;&#22312;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#20013;&#24212;&#29992;&#30340;&#22686;&#21152;&#38656;&#27714;&#12290;&#36825;&#31867;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#33267;&#20851;&#37325;&#35201;&#65292;&#22240;&#27492;&#38656;&#35201;&#32771;&#34385;DNNs&#30340;&#29420;&#29305;&#23646;&#24615;&#12290;&#20026;&#20102;&#20197;&#31995;&#32479;&#32508;&#21512;&#30340;&#26041;&#24335;&#30830;&#20445;&#22522;&#20110;DNNs&#30340;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#65292;&#24341;&#20837;&#20102;&#25152;&#35859;&#30340;&#23433;&#20840;&#32771;&#34385;&#20316;&#20026;&#36866;&#24403;&#30340;&#32467;&#26500;&#20803;&#32032;&#12290;&#19968;&#26041;&#38754;&#65292;&#23433;&#20840;&#32771;&#34385;&#30340;&#27010;&#24565;&#35774;&#35745;&#19982;&#29616;&#26377;&#30340;&#19982;&#33258;&#21160;&#39550;&#39542;&#31995;&#32479;&#23433;&#20840;&#30456;&#20851;&#30340;&#26631;&#20934;&#22914;ISO 21448&#65288;SOTIF&#65289;&#38750;&#24120;&#22865;&#21512;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#23427;&#24050;&#32463;&#28608;&#21457;&#20102;&#20960;&#31687;&#23398;&#26415;&#20986;&#29256;&#29289;&#21644;&#21363;&#23558;&#20986;&#21488;&#30340;&#20851;&#20110;AI&#23433;&#20840;&#30340;&#26631;&#20934;&#65292;&#22914;ISO PAS 8800&#12290;&#34429;&#28982;&#23433;&#20840;&#32771;&#34385;&#30340;&#27010;&#24565;&#20197;&#21069;&#24050;&#32463;&#34987;&#20171;&#32461;&#36807;&#65292;&#20294;&#26412;&#25991;&#23545;&#20854;&#36827;&#34892;&#20102;&#25193;&#23637;&#21644;&#20248;&#21270;&#65292;&#20511;&#37492;&#20102;&#21508;&#20010;&#39046;&#22495;&#21644;&#23433;&#20840;&#19987;&#23478;&#30340;&#21453;&#39304;&#24847;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent advances in the field of deep learning and impressive performance of deep neural networks (DNNs) for perception have resulted in an increased demand for their use in automated driving (AD) systems. The safety of such systems is of utmost importance and thus requires to consider the unique properties of DNNs.  In order to achieve safety of AD systems with DNN-based perception components in a systematic and comprehensive approach, so-called safety concerns have been introduced as a suitable structuring element. On the one hand, the concept of safety concerns is -- by design -- well aligned to existing standards relevant for safety of AD systems such as ISO 21448 (SOTIF). On the other hand, it has already inspired several academic publications and upcoming standards on AI safety such as ISO PAS 8800.  While the concept of safety concerns has been previously introduced, this paper extends and refines it, leveraging feedback from various domain and safety experts in the field. In par
&lt;/p&gt;</description></item></channel></rss>