<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#25552;&#20986;&#20102;&#38754;&#21521;&#26410;&#30693;&#20107;&#20214;&#30340;&#36866;&#24212;&#24615;&#20551;&#26032;&#38395;&#26816;&#27979;&#26694;&#26550;FADE&#65292;&#36890;&#36807;&#33258;&#36866;&#24212;&#22686;&#24378;&#21644;&#22270;&#23545;&#27604;&#23398;&#20064;&#35757;&#32451;&#30446;&#26631;&#39044;&#27979;&#22120;&#65292;&#21516;&#26102;&#29420;&#31435;&#35757;&#32451;&#20107;&#20214;&#39044;&#27979;&#22120;&#65292;&#26368;&#32456;&#20943;&#36731;&#20107;&#20214;&#20559;&#35265;&#12290;</title><link>https://arxiv.org/abs/2403.00037</link><description>&lt;p&gt;
&#26410;&#26469;&#21457;&#23637;&#65306;&#31038;&#20132;&#23186;&#20307;&#19978;&#30475;&#19981;&#35265;&#20107;&#20214;&#30340;&#36866;&#24212;&#24615;&#20551;&#26032;&#38395;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Evolving to the Future: Unseen Event Adaptive Fake News Detection on Social Media
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00037
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#38754;&#21521;&#26410;&#30693;&#20107;&#20214;&#30340;&#36866;&#24212;&#24615;&#20551;&#26032;&#38395;&#26816;&#27979;&#26694;&#26550;FADE&#65292;&#36890;&#36807;&#33258;&#36866;&#24212;&#22686;&#24378;&#21644;&#22270;&#23545;&#27604;&#23398;&#20064;&#35757;&#32451;&#30446;&#26631;&#39044;&#27979;&#22120;&#65292;&#21516;&#26102;&#29420;&#31435;&#35757;&#32451;&#20107;&#20214;&#39044;&#27979;&#22120;&#65292;&#26368;&#32456;&#20943;&#36731;&#20107;&#20214;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#31038;&#20132;&#23186;&#20307;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#20551;&#26032;&#38395;&#22312;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#24191;&#27867;&#20256;&#25773;&#26085;&#30410;&#23041;&#32961;&#20010;&#20154;&#21644;&#31038;&#20250;&#12290;&#22312;&#31038;&#20132;&#23186;&#20307;&#21160;&#24577;&#29615;&#22659;&#20013;&#65292;&#20551;&#26032;&#38395;&#26816;&#27979;&#26088;&#22312;&#24320;&#21457;&#19968;&#20010;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22312;&#26032;&#38395;&#25253;&#36947;&#36807;&#21435;&#20107;&#20214;&#30340;&#22522;&#30784;&#19978;&#36827;&#34892;&#35757;&#32451;&#12290;&#30446;&#26631;&#26159;&#39044;&#27979;&#21644;&#35782;&#21035;&#26377;&#20851;&#26410;&#26469;&#20107;&#20214;&#30340;&#20551;&#26032;&#38395;&#65292;&#36825;&#20123;&#20107;&#20214;&#36890;&#24120;&#19982;&#36807;&#21435;&#23436;&#20840;&#19981;&#21516;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#20551;&#26032;&#38395;&#26816;&#27979;&#26041;&#27861;&#23384;&#22312;&#40065;&#26834;&#24615;&#19981;&#36275;&#65292;&#26080;&#27861;&#27867;&#21270;&#21040;&#30475;&#19981;&#35265;&#30340;&#20107;&#20214;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#22522;&#20110;&#26410;&#26469;&#33258;&#36866;&#24212;&#20107;&#20214;&#30340;&#20551;&#26032;&#38395;&#26816;&#27979;&#65288;FADE&#65289;&#26694;&#26550;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#36890;&#36807;&#33258;&#36866;&#24212;&#22686;&#24378;&#31574;&#30053;&#21644;&#22270;&#23545;&#27604;&#23398;&#20064;&#35757;&#32451;&#30446;&#26631;&#39044;&#27979;&#22120;&#65292;&#20197;&#36827;&#34892;&#26356;&#31283;&#20581;&#30340;&#25972;&#20307;&#39044;&#27979;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#29420;&#31435;&#35757;&#32451;&#19968;&#20010;&#20165;&#20107;&#20214;&#30340;&#39044;&#27979;&#22120;&#20197;&#33719;&#24471;&#26377;&#20559;&#35265;&#30340;&#39044;&#27979;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#33719;&#24471;&#26368;&#32456;&#39044;&#27979;&#26469;&#36827;&#19968;&#27493;&#20943;&#36731;&#20107;&#20214;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00037v1 Announce Type: cross  Abstract: With the rapid development of social media, the wide dissemination of fake news on social media is increasingly threatening both individuals and society. In the dynamic landscape of social media, fake news detection aims to develop a model trained on news reporting past events. The objective is to predict and identify fake news about future events, which often relate to subjects entirely different from those in the past. However, existing fake detection methods exhibit a lack of robustness and cannot generalize to unseen events. To address this, we introduce Future ADaptive Event-based Fake news Detection (FADE) framework. Specifically, we train a target predictor through an adaptive augmentation strategy and graph contrastive learning to make more robust overall predictions. Simultaneously, we independently train an event-only predictor to obtain biased predictions. Then we further mitigate event bias by obtaining the final prediction
&lt;/p&gt;</description></item></channel></rss>