<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>ComTraQ-MPC&#26159;&#19968;&#20010;&#32467;&#21512;&#20102;DQN&#21644;MPC&#30340;&#26032;&#26694;&#26550;&#65292;&#26088;&#22312;&#20248;&#21270;&#22312;&#26377;&#38480;&#20027;&#21160;&#23450;&#20301;&#26356;&#26032;&#19979;&#30340;&#36712;&#36857;&#36319;&#36394;&#12290;</title><link>https://arxiv.org/abs/2403.01564</link><description>&lt;p&gt;
ComTraQ-MPC&#65306;&#20803;&#35757;&#32451;&#30340;DQN-MPC&#38598;&#25104;&#29992;&#20110;&#20855;&#26377;&#26377;&#38480;&#20027;&#21160;&#23450;&#20301;&#26356;&#26032;&#30340;&#36712;&#36857;&#36319;&#36394;
&lt;/p&gt;
&lt;p&gt;
ComTraQ-MPC: Meta-Trained DQN-MPC Integration for Trajectory Tracking with Limited Active Localization Updates
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01564
&lt;/p&gt;
&lt;p&gt;
ComTraQ-MPC&#26159;&#19968;&#20010;&#32467;&#21512;&#20102;DQN&#21644;MPC&#30340;&#26032;&#26694;&#26550;&#65292;&#26088;&#22312;&#20248;&#21270;&#22312;&#26377;&#38480;&#20027;&#21160;&#23450;&#20301;&#26356;&#26032;&#19979;&#30340;&#36712;&#36857;&#36319;&#36394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23616;&#37096;&#21487;&#35266;&#23519;&#12289;&#38543;&#26426;&#29615;&#22659;&#20013;&#36827;&#34892;&#36712;&#36857;&#36319;&#36394;&#30340;&#26368;&#20339;&#20915;&#31574;&#24448;&#24448;&#38754;&#20020;&#30528;&#19968;&#20010;&#37325;&#35201;&#25361;&#25112;&#65292;&#21363;&#20027;&#21160;&#23450;&#20301;&#26356;&#26032;&#25968;&#37327;&#26377;&#38480;&#65292;&#36825;&#26159;&#25351;&#20195;&#29702;&#20174;&#20256;&#24863;&#22120;&#33719;&#21462;&#30495;&#23454;&#29366;&#24577;&#20449;&#24687;&#30340;&#36807;&#31243;&#12290;&#20256;&#32479;&#26041;&#27861;&#24448;&#24448;&#38590;&#20197;&#24179;&#34913;&#36164;&#28304;&#20445;&#23384;&#12289;&#20934;&#30830;&#29366;&#24577;&#20272;&#35745;&#21644;&#31934;&#30830;&#36319;&#36394;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#23548;&#33268;&#24615;&#33021;&#27425;&#20248;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;ComTraQ-MPC&#65292;&#36825;&#26159;&#19968;&#20010;&#32467;&#21512;&#20102;Deep Q-Networks (DQN)&#21644;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(MPC)&#30340;&#26032;&#39062;&#26694;&#26550;&#65292;&#26088;&#22312;&#20248;&#21270;&#26377;&#38480;&#20027;&#21160;&#23450;&#20301;&#26356;&#26032;&#19979;&#30340;&#36712;&#36857;&#36319;&#36394;&#12290;&#20803;&#35757;&#32451;&#30340;DQN&#30830;&#20445;&#20102;&#33258;&#36866;&#24212;&#20027;&#21160;&#23450;&#20301;&#35843;&#24230;&#65292;&#21516;&#26102;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01564v1 Announce Type: cross  Abstract: Optimal decision-making for trajectory tracking in partially observable, stochastic environments where the number of active localization updates -- the process by which the agent obtains its true state information from the sensors -- are limited, presents a significant challenge. Traditional methods often struggle to balance resource conservation, accurate state estimation and precise tracking, resulting in suboptimal performance. This problem is particularly pronounced in environments with large action spaces, where the need for frequent, accurate state data is paramount, yet the capacity for active localization updates is restricted by external limitations. This paper introduces ComTraQ-MPC, a novel framework that combines Deep Q-Networks (DQN) and Model Predictive Control (MPC) to optimize trajectory tracking with constrained active localization updates. The meta-trained DQN ensures adaptive active localization scheduling, while the
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#27169;&#22411;&#26041;&#27861;&#65292;&#21487;&#20197;&#20165;&#36890;&#36807;&#31995;&#32479;&#22312;&#24050;&#30693;&#24378;&#36843;&#20989;&#25968;&#24433;&#21709;&#19979;&#30340;&#35266;&#27979;&#65292;&#35782;&#21035;&#21644;&#25233;&#21046;&#26410;&#30693;&#31995;&#32479;&#30340;&#26410;&#30693;&#24178;&#25200;&#12290;&#36825;&#39033;&#26041;&#27861;&#23545;&#35757;&#32451;&#20989;&#25968;&#26377;&#38750;&#24120;&#28201;&#21644;&#30340;&#38480;&#21046;&#65292;&#33021;&#22815;&#31283;&#20581;&#22320;&#35782;&#21035;&#21644;&#25233;&#21046;&#22823;&#31867;&#21035;&#30340;&#26410;&#30693;&#24178;&#25200;&#12290;</title><link>http://arxiv.org/abs/2307.03690</link><description>&lt;p&gt;
&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#25233;&#21046;&#21160;&#21147;&#31995;&#32479;&#20013;&#30340;&#26410;&#30693;&#24178;&#25200;
&lt;/p&gt;
&lt;p&gt;
Suppressing unknown disturbances to dynamical systems using machine learning. (arXiv:2307.03690v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03690
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#30340;&#26080;&#27169;&#22411;&#26041;&#27861;&#65292;&#21487;&#20197;&#20165;&#36890;&#36807;&#31995;&#32479;&#22312;&#24050;&#30693;&#24378;&#36843;&#20989;&#25968;&#24433;&#21709;&#19979;&#30340;&#35266;&#27979;&#65292;&#35782;&#21035;&#21644;&#25233;&#21046;&#26410;&#30693;&#31995;&#32479;&#30340;&#26410;&#30693;&#24178;&#25200;&#12290;&#36825;&#39033;&#26041;&#27861;&#23545;&#35757;&#32451;&#20989;&#25968;&#26377;&#38750;&#24120;&#28201;&#21644;&#30340;&#38480;&#21046;&#65292;&#33021;&#22815;&#31283;&#20581;&#22320;&#35782;&#21035;&#21644;&#25233;&#21046;&#22823;&#31867;&#21035;&#30340;&#26410;&#30693;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35782;&#21035;&#21644;&#25233;&#21046;&#21160;&#21147;&#31995;&#32479;&#20013;&#30340;&#26410;&#30693;&#24178;&#25200;&#26159;&#19968;&#20010;&#22312;&#35768;&#22810;&#19981;&#21516;&#39046;&#22495;&#20013;&#24212;&#29992;&#30340;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#20165;&#22522;&#20110;&#31995;&#32479;&#22312;&#24050;&#30693;&#24378;&#36843;&#20989;&#25968;&#24433;&#21709;&#19979;&#30340;&#20808;&#21069;&#35266;&#27979;&#26469;&#35782;&#21035;&#21644;&#25233;&#21046;&#26410;&#30693;&#31995;&#32479;&#30340;&#26410;&#30693;&#24178;&#25200;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#23545;&#35757;&#32451;&#20989;&#25968;&#26377;&#38750;&#24120;&#28201;&#21644;&#30340;&#38480;&#21046;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#31283;&#20581;&#22320;&#35782;&#21035;&#21644;&#25233;&#21046;&#22823;&#31867;&#21035;&#30340;&#26410;&#30693;&#24178;&#25200;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#31034;&#20363;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#26696;&#65292;&#20854;&#20013;&#35782;&#21035;&#21644;&#25233;&#21046;&#20102; Lorenz &#31995;&#32479;&#30340;&#28151;&#27788;&#24178;&#25200;&#12290;
&lt;/p&gt;
&lt;p&gt;
Identifying and suppressing unknown disturbances to dynamical systems is a problem with applications in many different fields. In this Letter, we present a model-free method to identify and suppress an unknown disturbance to an unknown system based only on previous observations of the system under the influence of a known forcing function. We find that, under very mild restrictions on the training function, our method is able to robustly identify and suppress a large class of unknown disturbances. We illustrate our scheme with an example where a chaotic disturbance to the Lorenz system is identified and suppressed.
&lt;/p&gt;</description></item></channel></rss>