<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#20010;&#26032;&#30340;&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#32769;&#34382;&#26426;&#35774;&#32622;&#65292;&#24182;&#21457;&#23637;&#20102;&#21435;&#20013;&#24515;&#21270;&#31639;&#27861;&#20197;&#20943;&#23569;&#20195;&#29702;&#20043;&#38388;&#30340;&#38598;&#20307;&#36951;&#25022;&#65292;&#22312;&#25968;&#23398;&#20998;&#26512;&#20013;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#23454;&#29616;&#20102;&#36817;&#20046;&#26368;&#20248;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2305.18784</link><description>&lt;p&gt;
&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#24322;&#26500;&#22810;&#33218;&#32769;&#34382;&#26426;&#32763;&#35793;&#35770;&#25991;
&lt;/p&gt;
&lt;p&gt;
Collaborative Multi-Agent Heterogeneous Multi-Armed Bandits. (arXiv:2305.18784v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18784
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#20010;&#26032;&#30340;&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#32769;&#34382;&#26426;&#35774;&#32622;&#65292;&#24182;&#21457;&#23637;&#20102;&#21435;&#20013;&#24515;&#21270;&#31639;&#27861;&#20197;&#20943;&#23569;&#20195;&#29702;&#20043;&#38388;&#30340;&#38598;&#20307;&#36951;&#25022;&#65292;&#22312;&#25968;&#23398;&#20998;&#26512;&#20013;&#35777;&#26126;&#20102;&#35813;&#31639;&#27861;&#23454;&#29616;&#20102;&#36817;&#20046;&#26368;&#20248;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#21512;&#20316;&#22810;&#26234;&#33021;&#20307;&#32769;&#34382;&#26426;&#30340;&#30740;&#31350;&#21560;&#24341;&#20102;&#24456;&#22810;&#20851;&#27880;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24320;&#22987;&#30740;&#31350;&#19968;&#20010;&#26032;&#30340;&#21512;&#20316;&#35774;&#32622;&#65292;&#20854;&#20013;$N$&#20010;&#26234;&#33021;&#20307;&#20013;&#30340;&#27599;&#20010;&#26234;&#33021;&#20307;&#27491;&#22312;&#23398;&#20064;$M$&#20010;&#20855;&#26377;&#38543;&#26426;&#24615;&#30340;&#22810;&#33218;&#32769;&#34382;&#26426;&#65292;&#20197;&#20943;&#23569;&#20182;&#20204;&#30340;&#38598;&#20307;&#32047;&#35745;&#36951;&#25022;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#21435;&#20013;&#24515;&#21270;&#31639;&#27861;&#65292;&#20419;&#36827;&#20102;&#20195;&#29702;&#20043;&#38388;&#30340;&#21512;&#20316;&#65292;&#24182;&#38024;&#23545;&#20004;&#31181;&#24773;&#20917;&#36827;&#34892;&#20102;&#24615;&#33021;&#34920;&#24449;&#12290;&#36890;&#36807;&#25512;&#23548;&#27599;&#20010;&#20195;&#29702;&#30340;&#32047;&#31215;&#36951;&#25022;&#21644;&#38598;&#20307;&#36951;&#25022;&#30340;&#19978;&#38480;&#65292;&#25105;&#20204;&#23545;&#36825;&#20123;&#31639;&#27861;&#30340;&#24615;&#33021;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#36825;&#31181;&#24773;&#20917;&#19979;&#38598;&#20307;&#36951;&#25022;&#30340;&#19979;&#38480;&#65292;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#31639;&#27861;&#30340;&#36817;&#20046;&#26368;&#20248;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
The study of collaborative multi-agent bandits has attracted significant attention recently. In light of this, we initiate the study of a new collaborative setting, consisting of $N$ agents such that each agent is learning one of $M$ stochastic multi-armed bandits to minimize their group cumulative regret. We develop decentralized algorithms which facilitate collaboration between the agents under two scenarios. We characterize the performance of these algorithms by deriving the per agent cumulative regret and group regret upper bounds. We also prove lower bounds for the group regret in this setting, which demonstrates the near-optimal behavior of the proposed algorithms.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#30740;&#31350;&#22810;&#21464;&#37327;&#32593;&#32476;&#30340;&#35270;&#35273;&#20998;&#26512;&#24037;&#20316;&#27969;&#31243;&#65292;&#20854;&#20013;&#21253;&#25324;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#38454;&#27573;&#12289;&#38477;&#32500;&#21644;&#20248;&#21270;&#38454;&#27573;&#20197;&#21450;&#29992;&#25143;&#20132;&#20114;&#24335;&#21487;&#35270;&#21270;&#25509;&#21475;&#36827;&#34892;&#35299;&#37322;&#12290;&#20851;&#38190;&#30340;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#27493;&#39588;&#23558;&#38750;&#32447;&#24615;&#29305;&#24449;&#37325;&#22609;&#20026;&#32447;&#24615;&#29305;&#24449;&#65292;&#20197;&#26041;&#20415;&#26816;&#26597;&#21644;&#29702;&#35299;&#12290;&#26696;&#20363;&#30740;&#31350;&#34920;&#26126;&#35813;&#24037;&#20316;&#27969;&#31243;&#20855;&#26377;&#26377;&#25928;&#24615;&#21644;&#21487;&#29702;&#35299;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.09590</link><description>&lt;p&gt;
&#29992;&#34920;&#31034;&#23398;&#20064;&#21644;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#22810;&#21464;&#37327;&#32593;&#32476;&#30340;&#35270;&#35273;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Visual Analytics of Multivariate Networks with Representation Learning and Composite Variable Construction. (arXiv:2303.09590v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09590
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#30740;&#31350;&#22810;&#21464;&#37327;&#32593;&#32476;&#30340;&#35270;&#35273;&#20998;&#26512;&#24037;&#20316;&#27969;&#31243;&#65292;&#20854;&#20013;&#21253;&#25324;&#31070;&#32463;&#32593;&#32476;&#23398;&#20064;&#38454;&#27573;&#12289;&#38477;&#32500;&#21644;&#20248;&#21270;&#38454;&#27573;&#20197;&#21450;&#29992;&#25143;&#20132;&#20114;&#24335;&#21487;&#35270;&#21270;&#25509;&#21475;&#36827;&#34892;&#35299;&#37322;&#12290;&#20851;&#38190;&#30340;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#27493;&#39588;&#23558;&#38750;&#32447;&#24615;&#29305;&#24449;&#37325;&#22609;&#20026;&#32447;&#24615;&#29305;&#24449;&#65292;&#20197;&#26041;&#20415;&#26816;&#26597;&#21644;&#29702;&#35299;&#12290;&#26696;&#20363;&#30740;&#31350;&#34920;&#26126;&#35813;&#24037;&#20316;&#27969;&#31243;&#20855;&#26377;&#26377;&#25928;&#24615;&#21644;&#21487;&#29702;&#35299;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#21464;&#37327;&#32593;&#32476;&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#25968;&#25454;&#39537;&#21160;&#24212;&#29992;&#20013;&#32463;&#24120;&#34987;&#21457;&#29616;&#12290;&#21457;&#25496;&#21644;&#29702;&#35299;&#22810;&#21464;&#37327;&#32593;&#32476;&#20013;&#30340;&#20851;&#31995;&#24182;&#19981;&#26159;&#19968;&#39033;&#31616;&#21333;&#30340;&#20219;&#21153;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#30740;&#31350;&#22810;&#21464;&#37327;&#32593;&#32476;&#20197;&#25552;&#21462;&#32593;&#32476;&#19981;&#21516;&#32467;&#26500;&#21644;&#35821;&#20041;&#29305;&#24449;&#20043;&#38388;&#20851;&#32852;&#30340;&#35270;&#35273;&#20998;&#26512;&#24037;&#20316;&#27969;&#31243;&#65288;&#20363;&#22914;&#65292;&#20160;&#20040;&#26159;&#22312;&#31038;&#20132;&#32593;&#32476;&#23494;&#24230;&#26041;&#38754;&#19982;&#19981;&#21516;&#23646;&#24615;&#30340;&#32452;&#21512;&#20851;&#31995;&#65289;&#12290;&#35813;&#24037;&#20316;&#27969;&#31243;&#21253;&#25324;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#23398;&#20064;&#38454;&#27573;&#65292;&#26681;&#25454;&#25152;&#36873;&#36755;&#20837;&#21644;&#36755;&#20986;&#23646;&#24615;&#26469;&#23545;&#25968;&#25454;&#36827;&#34892;&#20998;&#31867;&#65292;&#38477;&#32500;&#21644;&#20248;&#21270;&#38454;&#27573;&#20197;&#20135;&#29983;&#19968;&#20010;&#31616;&#21270;&#30340;&#32467;&#26524;&#38598;&#21512;&#20197;&#20415;&#26816;&#26597;&#65292;&#26368;&#21518;&#36890;&#36807;&#29992;&#25143;&#20132;&#20114;&#24335;&#21487;&#35270;&#21270;&#25509;&#21475;&#36827;&#34892;&#35299;&#37322;&#38454;&#27573;&#30340;&#25805;&#20316;&#12290;&#25105;&#20204;&#35774;&#35745;&#30340;&#19968;&#20010;&#20851;&#38190;&#37096;&#20998;&#26159;&#32452;&#21512;&#21464;&#37327;&#26500;&#24314;&#27493;&#39588;&#65292;&#35813;&#27493;&#39588;&#23558;&#30001;&#31070;&#32463;&#32593;&#32476;&#33719;&#24471;&#30340;&#38750;&#32447;&#24615;&#29305;&#24449;&#37325;&#22609;&#20026;&#30452;&#35266;&#35299;&#37322;&#30340;&#32447;&#24615;&#29305;&#24449;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#22823;&#22411;&#32452;&#32455;&#21592;&#24037;&#20043;&#38388;&#30340;&#30005;&#23376;&#37038;&#20214;&#36890;&#20449;&#25968;&#25454;&#38598;&#36827;&#34892;&#26696;&#20363;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#24037;&#20316;&#27969;&#31243;&#30340;&#26377;&#25928;&#24615;&#21644;&#21487;&#29702;&#35299;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multivariate networks are commonly found in real-world data-driven applications. Uncovering and understanding the relations of interest in multivariate networks is not a trivial task. This paper presents a visual analytics workflow for studying multivariate networks to extract associations between different structural and semantic characteristics of the networks (e.g., what are the combinations of attributes largely relating to the density of a social network?). The workflow consists of a neural-network-based learning phase to classify the data based on the chosen input and output attributes, a dimensionality reduction and optimization phase to produce a simplified set of results for examination, and finally an interpreting phase conducted by the user through an interactive visualization interface. A key part of our design is a composite variable construction step that remodels nonlinear features obtained by neural networks into linear features that are intuitive to interpret. We demon
&lt;/p&gt;</description></item></channel></rss>