<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>SafEDMD&#26159;&#19968;&#31181;&#22522;&#20110;EDMD&#30340;&#23398;&#20064;&#26550;&#26500;&#65292;&#36890;&#36807;&#31283;&#23450;&#24615;&#21644;&#35748;&#35777;&#23548;&#21521;&#65292;&#29983;&#25104;&#21487;&#38752;&#30340;&#25968;&#25454;&#39537;&#21160;&#26367;&#20195;&#27169;&#22411;&#65292;&#24182;&#22522;&#20110;&#21322;&#23450;&#35268;&#21010;&#36827;&#34892;&#35748;&#35777;&#25511;&#21046;&#22120;&#35774;&#35745;&#12290;&#23427;&#22312;&#22810;&#20010;&#22522;&#20934;&#31034;&#20363;&#19978;&#23637;&#31034;&#20102;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2402.03145</link><description>&lt;p&gt;
SafEDMD&#65306;&#19968;&#31181;&#19987;&#20026;&#38750;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#25968;&#25454;&#39537;&#21160;&#25511;&#21046;&#32780;&#35774;&#35745;&#30340;&#35748;&#35777;&#23398;&#20064;&#26550;&#26500;
&lt;/p&gt;
&lt;p&gt;
SafEDMD: A certified learning architecture tailored to data-driven control of nonlinear dynamical systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03145
&lt;/p&gt;
&lt;p&gt;
SafEDMD&#26159;&#19968;&#31181;&#22522;&#20110;EDMD&#30340;&#23398;&#20064;&#26550;&#26500;&#65292;&#36890;&#36807;&#31283;&#23450;&#24615;&#21644;&#35748;&#35777;&#23548;&#21521;&#65292;&#29983;&#25104;&#21487;&#38752;&#30340;&#25968;&#25454;&#39537;&#21160;&#26367;&#20195;&#27169;&#22411;&#65292;&#24182;&#22522;&#20110;&#21322;&#23450;&#35268;&#21010;&#36827;&#34892;&#35748;&#35777;&#25511;&#21046;&#22120;&#35774;&#35745;&#12290;&#23427;&#22312;&#22810;&#20010;&#22522;&#20934;&#31034;&#20363;&#19978;&#23637;&#31034;&#20102;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Koopman&#31639;&#23376;&#20316;&#20026;&#26426;&#22120;&#23398;&#20064;&#21160;&#24577;&#25511;&#21046;&#31995;&#32479;&#30340;&#29702;&#35770;&#22522;&#30784;&#65292;&#20854;&#20013;&#31639;&#23376;&#36890;&#36807;&#25193;&#23637;&#21160;&#24577;&#27169;&#24577;&#20998;&#35299;&#65288;EDMD&#65289;&#21551;&#21457;&#24335;&#36817;&#20284;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#31283;&#23450;&#24615;&#21644;&#35748;&#35777;&#23548;&#21521;&#30340;EDMD&#65288;SafEDMD&#65289;&#65306;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;EDMD&#30340;&#23398;&#20064;&#26550;&#26500;&#65292;&#23427;&#25552;&#20379;&#20102;&#20005;&#26684;&#30340;&#35777;&#20070;&#65292;&#20174;&#32780;&#20197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#29983;&#25104;&#21487;&#38752;&#30340;&#26367;&#20195;&#27169;&#22411;&#12290;&#20026;&#20102;&#30830;&#20445;SafEDMD&#30340;&#21487;&#38752;&#24615;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#27604;&#20363;&#35823;&#24046;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#21407;&#28857;&#22788;&#28040;&#22833;&#65292;&#24182;&#19988;&#36866;&#29992;&#20110;&#25511;&#21046;&#20219;&#21153;&#65292;&#20174;&#32780;&#22522;&#20110;&#21322;&#23450;&#35268;&#21010;&#36827;&#34892;&#35748;&#35777;&#25511;&#21046;&#22120;&#35774;&#35745;&#12290;&#25105;&#20204;&#36890;&#36807;&#20960;&#20010;&#22522;&#20934;&#31034;&#20363;&#35828;&#26126;&#20102;&#25152;&#24320;&#21457;&#30340;&#26426;&#21046;&#65292;&#24182;&#24378;&#35843;&#20854;&#30456;&#23545;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Koopman operator serves as the theoretical backbone for machine learning of dynamical control systems, where the operator is heuristically approximated by extended dynamic mode decomposition (EDMD). In this paper, we propose Stability- and certificate-oriented EDMD (SafEDMD): a novel EDMD-based learning architecture which comes along with rigorous certificates, resulting in a reliable surrogate model generated in a data-driven fashion. To ensure trustworthiness of SafEDMD, we derive proportional error bounds, which vanish at the origin and are tailored for control tasks, leading to certified controller design based on semi-definite programming. We illustrate the developed machinery by means of several benchmark examples and highlight the advantages over state-of-the-art methods.
&lt;/p&gt;</description></item></channel></rss>