<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22823;&#35268;&#27169;&#30340;&#25968;&#25454;&#38598;&#33258;&#21160;&#20272;&#31639;&#33258;&#35748;&#25216;&#26415;&#20538;&#21153;&#30340;&#36824;&#27454;&#24037;&#20316;&#37327;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;&#33258;&#35748;&#25216;&#26415;&#20538;&#21153;&#38656;&#35201;&#19981;&#21516;&#31243;&#24230;&#30340;&#36824;&#27454;&#24037;&#20316;&#37327;&#12290;</title><link>http://arxiv.org/abs/2309.06020</link><description>&lt;p&gt;
&#33258;&#21160;&#35780;&#20272;&#20607;&#36824;&#33258;&#35748;&#25216;&#26415;&#20538;&#21153;&#25152;&#38656;&#30340;&#24037;&#20316;&#37327;
&lt;/p&gt;
&lt;p&gt;
Automatically Estimating the Effort Required to Repay Self-Admitted Technical Debt. (arXiv:2309.06020v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06020
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22823;&#35268;&#27169;&#30340;&#25968;&#25454;&#38598;&#33258;&#21160;&#20272;&#31639;&#33258;&#35748;&#25216;&#26415;&#20538;&#21153;&#30340;&#36824;&#27454;&#24037;&#20316;&#37327;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;&#33258;&#35748;&#25216;&#26415;&#20538;&#21153;&#38656;&#35201;&#19981;&#21516;&#31243;&#24230;&#30340;&#36824;&#27454;&#24037;&#20316;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25216;&#26415;&#20538;&#21153;&#26159;&#25351;&#22312;&#36719;&#20214;&#24320;&#21457;&#36807;&#31243;&#20013;&#20026;&#20102;&#30701;&#26399;&#21033;&#30410;&#32780;&#20570;&#20986;&#30340;&#27425;&#20248;&#20915;&#31574;&#25152;&#24102;&#26469;&#30340;&#21518;&#26524;&#12290;&#33258;&#35748;&#25216;&#26415;&#20538;&#21153;(SATD)&#26159;&#19968;&#31181;&#29305;&#23450;&#24418;&#24335;&#30340;&#25216;&#26415;&#20538;&#21153;&#65292;&#24320;&#21457;&#20154;&#21592;&#26126;&#30830;&#22320;&#22312;&#36719;&#20214;&#30340;&#28304;&#20195;&#30721;&#27880;&#37322;&#21644;&#25552;&#20132;&#28040;&#24687;&#20013;&#35760;&#24405;&#19979;&#26469;&#12290;&#30001;&#20110;SATD&#21487;&#33021;&#38459;&#30861;&#36719;&#20214;&#30340;&#24320;&#21457;&#21644;&#32500;&#25252;&#65292;&#22240;&#27492;&#26377;&#25928;&#22320;&#35299;&#20915;&#21644;&#20248;&#20808;&#22788;&#29702;&#23427;&#38750;&#24120;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#30340;&#26041;&#27861;&#32570;&#20047;&#26681;&#25454;SATD&#30340;&#25991;&#26412;&#25551;&#36848;&#33258;&#21160;&#35780;&#20272;&#20854;&#36824;&#27454;&#24037;&#20316;&#37327;&#30340;&#33021;&#21147;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#19968;&#20010;&#21253;&#25324;1,060&#20010;Apache&#20195;&#30721;&#24211;&#20013;&#20849;2,568,728&#20010;&#25552;&#20132;&#30340;341,740&#20010;SATD&#39033;&#30446;&#30340;&#20840;&#38754;&#25968;&#25454;&#38598;&#26469;&#33258;&#21160;&#20272;&#31639;SATD&#36824;&#27454;&#24037;&#20316;&#37327;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;SATD&#38656;&#35201;&#19981;&#21516;&#31243;&#24230;&#30340;&#36824;&#27454;&#24037;&#20316;&#37327;&#65292;&#20854;&#20013;&#20195;&#30721;/&#35774;&#35745;&#12289;&#38656;&#27714;&#21644;&#27979;&#35797;&#20538;&#21153;&#38656;&#35201;&#26356;&#22810;&#30340;&#24037;&#20316;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Technical debt refers to the consequences of sub-optimal decisions made during software development that prioritize short-term benefits over long-term maintainability. Self-Admitted Technical Debt (SATD) is a specific form of technical debt, explicitly documented by developers within software artifacts such as source code comments and commit messages. As SATD can hinder software development and maintenance, it is crucial to address and prioritize it effectively. However, current methodologies lack the ability to automatically estimate the repayment effort of SATD based on its textual descriptions. To address this limitation, we propose a novel approach for automatically estimating SATD repayment effort, utilizing a comprehensive dataset comprising 341,740 SATD items from 2,568,728 commits across 1,060 Apache repositories. Our findings show that different types of SATD require varying levels of repayment effort, with code/design, requirement, and test debt demanding greater effort compa
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;&#24182;&#34892;&#28151;&#21512;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#26469;&#39044;&#27979;&#21457;&#30005;&#21378;&#20013;&#30340;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#65292;&#30456;&#27604;&#32431;&#32463;&#20856;&#21644;&#32431;&#37327;&#23376;&#27169;&#22411;&#65292;&#35813;&#28151;&#21512;&#27169;&#22411;&#22312;&#27979;&#35797;&#38598;&#19978;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#24179;&#22343;&#24179;&#26041;&#35823;&#24046;&#38477;&#20302;&#20102;5.7&#20493;&#21644;4.9&#20493;&#65292;&#24182;&#19988;&#30456;&#23545;&#35823;&#24046;&#36739;&#23567;&#65292;&#26368;&#22810;&#25552;&#21319;&#20102;2&#20493;&#12290;</title><link>http://arxiv.org/abs/2307.09483</link><description>&lt;p&gt;
&#20351;&#29992;&#24182;&#34892;&#28151;&#21512;&#32593;&#32476;&#39044;&#27979;&#21457;&#30005;&#21378;&#20013;&#30340;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;
&lt;/p&gt;
&lt;p&gt;
Forecasting the steam mass flow in a powerplant using the parallel hybrid network. (arXiv:2307.09483v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09483
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;&#24182;&#34892;&#28151;&#21512;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#26469;&#39044;&#27979;&#21457;&#30005;&#21378;&#20013;&#30340;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#65292;&#30456;&#27604;&#32431;&#32463;&#20856;&#21644;&#32431;&#37327;&#23376;&#27169;&#22411;&#65292;&#35813;&#28151;&#21512;&#27169;&#22411;&#22312;&#27979;&#35797;&#38598;&#19978;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#24179;&#22343;&#24179;&#26041;&#35823;&#24046;&#38477;&#20302;&#20102;5.7&#20493;&#21644;4.9&#20493;&#65292;&#24182;&#19988;&#30456;&#23545;&#35823;&#24046;&#36739;&#23567;&#65292;&#26368;&#22810;&#25552;&#21319;&#20102;2&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#25928;&#21487;&#25345;&#32493;&#30340;&#21457;&#30005;&#26159;&#33021;&#28304;&#39046;&#22495;&#30340;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#23588;&#20854;&#26159;&#28909;&#30005;&#21378;&#22312;&#20934;&#30830;&#39044;&#27979;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#26041;&#38754;&#38754;&#20020;&#22256;&#38590;&#65292;&#36825;&#23545;&#20110;&#36816;&#33829;&#25928;&#29575;&#21644;&#25104;&#26412;&#38477;&#20302;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#24182;&#34892;&#28151;&#21512;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#65292;&#35813;&#32467;&#26500;&#23558;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#21644;&#20256;&#32479;&#30340;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#29305;&#21035;&#35774;&#35745;&#29992;&#20110;&#24037;&#19994;&#29615;&#22659;&#20013;&#30340;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65292;&#20197;&#25552;&#39640;&#23545;&#26410;&#26469;15&#20998;&#38047;&#20869;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#24182;&#34892;&#28151;&#21512;&#27169;&#22411;&#20248;&#20110;&#29420;&#31435;&#30340;&#32463;&#20856;&#21644;&#37327;&#23376;&#27169;&#22411;&#65292;&#22312;&#35757;&#32451;&#21518;&#30340;&#27979;&#35797;&#38598;&#19978;&#30456;&#23545;&#20110;&#32431;&#32463;&#20856;&#27169;&#22411;&#21644;&#32431;&#37327;&#23376;&#32593;&#32476;&#65292;&#24179;&#22343;&#24179;&#26041;&#35823;&#24046;&#65288;MSE&#65289;&#25439;&#22833;&#20998;&#21035;&#38477;&#20302;&#20102;5.7&#20493;&#21644;4.9&#20493;&#12290;&#27492;&#22806;&#65292;&#35813;&#28151;&#21512;&#27169;&#22411;&#22312;&#27979;&#35797;&#38598;&#19978;&#34920;&#29616;&#20986;&#30456;&#23545;&#35823;&#24046;&#36739;&#23567;&#65292;&#27604;&#32431;&#32463;&#20856;&#27169;&#22411;&#26356;&#22909;&#65292;&#26368;&#22810;&#25552;&#21319;&#20102;2&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Efficient and sustainable power generation is a crucial concern in the energy sector. In particular, thermal power plants grapple with accurately predicting steam mass flow, which is crucial for operational efficiency and cost reduction. In this study, we use a parallel hybrid neural network architecture that combines a parametrized quantum circuit and a conventional feed-forward neural network specifically designed for time-series prediction in industrial settings to enhance predictions of steam mass flow 15 minutes into the future. Our results show that the parallel hybrid model outperforms standalone classical and quantum models, achieving more than 5.7 and 4.9 times lower mean squared error (MSE) loss on the test set after training compared to pure classical and pure quantum networks, respectively. Furthermore, the hybrid model demonstrates smaller relative errors between the ground truth and the model predictions on the test set, up to 2 times better than the pure classical model.
&lt;/p&gt;</description></item></channel></rss>