<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#30740;&#31350;&#23545;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#20174;&#35821;&#38899;&#35760;&#24405;&#20013;&#26816;&#27979;&#21897;&#30284;&#30340;&#25991;&#29486;&#36827;&#34892;&#20102;&#32508;&#36848;&#65292;&#21457;&#29616;&#20102;22&#31687;&#30456;&#20851;&#35770;&#25991;&#65292;&#35752;&#35770;&#20102;&#23427;&#20204;&#30340;&#26041;&#27861;&#21644;&#32467;&#26524;&#12290;&#30740;&#31350;&#20351;&#29992;&#20102;&#31070;&#32463;&#32593;&#32476;&#21644;&#26757;&#23572;&#39057;&#29575;&#20498;&#35889;&#31995;&#25968;&#25552;&#21462;&#38899;&#39057;&#29305;&#24449;&#65292;&#24182;&#36890;&#36807;&#36801;&#31227;&#23398;&#20064;&#23454;&#29616;&#20102;&#20998;&#31867;&#65292;&#21462;&#24471;&#20102;&#19968;&#23450;&#30340;&#20934;&#30830;&#29575;&#12290;</title><link>http://arxiv.org/abs/2307.09230</link><description>&lt;p&gt;
&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#20174;&#35821;&#38899;&#20449;&#21495;&#20013;&#26816;&#27979;&#21897;&#30284;&#65306;&#21487;&#22797;&#29616;&#30340;&#25991;&#29486;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Detecting Throat Cancer from Speech Signals Using Machine Learning: A Reproducible Literature Review. (arXiv:2307.09230v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09230
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#20174;&#35821;&#38899;&#35760;&#24405;&#20013;&#26816;&#27979;&#21897;&#30284;&#30340;&#25991;&#29486;&#36827;&#34892;&#20102;&#32508;&#36848;&#65292;&#21457;&#29616;&#20102;22&#31687;&#30456;&#20851;&#35770;&#25991;&#65292;&#35752;&#35770;&#20102;&#23427;&#20204;&#30340;&#26041;&#27861;&#21644;&#32467;&#26524;&#12290;&#30740;&#31350;&#20351;&#29992;&#20102;&#31070;&#32463;&#32593;&#32476;&#21644;&#26757;&#23572;&#39057;&#29575;&#20498;&#35889;&#31995;&#25968;&#25552;&#21462;&#38899;&#39057;&#29305;&#24449;&#65292;&#24182;&#36890;&#36807;&#36801;&#31227;&#23398;&#20064;&#23454;&#29616;&#20102;&#20998;&#31867;&#65292;&#21462;&#24471;&#20102;&#19968;&#23450;&#30340;&#20934;&#30830;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#20174;&#35821;&#38899;&#35760;&#24405;&#20013;&#26816;&#27979;&#21897;&#30284;&#30340;&#24403;&#21069;&#25991;&#29486;&#36827;&#34892;&#20102;&#33539;&#22260;&#35780;&#20272;&#12290;&#25105;&#20204;&#25214;&#21040;&#20102;22&#31687;&#30456;&#20851;&#35770;&#25991;&#65292;&#24182;&#35752;&#35770;&#20102;&#23427;&#20204;&#30340;&#26041;&#27861;&#21644;&#32467;&#26524;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#35770;&#25991;&#20998;&#20026;&#20004;&#32452; - &#20061;&#31687;&#36827;&#34892;&#20108;&#20998;&#31867;&#65292;13&#31687;&#36827;&#34892;&#22810;&#31867;&#21035;&#20998;&#31867;&#12290;&#36825;&#20123;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#26041;&#27861;&#65292;&#20854;&#20013;&#26368;&#24120;&#35265;&#30340;&#26159;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#12290;&#22312;&#20998;&#31867;&#20043;&#21069;&#36824;&#20174;&#38899;&#39057;&#20013;&#25552;&#21462;&#20102;&#35768;&#22810;&#29305;&#24449;&#65292;&#20854;&#20013;&#26368;&#24120;&#35265;&#30340;&#26159;&#26757;&#23572;&#39057;&#29575;&#20498;&#35889;&#31995;&#25968;&#12290;&#22312;&#36825;&#27425;&#25628;&#32034;&#20013;&#26410;&#25214;&#21040;&#20219;&#20309;&#24102;&#26377;&#20195;&#30721;&#24211;&#30340;&#35770;&#25991;&#65292;&#22240;&#27492;&#26080;&#27861;&#22797;&#29616;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#20010;&#20844;&#24320;&#21487;&#29992;&#30340;&#20195;&#30721;&#24211;&#26469;&#35757;&#32451;&#33258;&#24049;&#30340;&#20998;&#31867;&#22120;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#22810;&#31867;&#21035;&#38382;&#39064;&#19978;&#20351;&#29992;&#36801;&#31227;&#23398;&#20064;&#65292;&#23558;&#19977;&#31181;&#30149;&#29702;&#21644;&#20581;&#24247;&#23545;&#29031;&#36827;&#34892;&#20998;&#31867;&#12290;&#20351;&#29992;&#36825;&#31181;&#25216;&#26415;&#65292;&#25105;&#20204;&#21462;&#24471;&#20102;53.54%&#30340;&#21152;&#26435;&#24179;&#22343;&#21484;&#22238;&#29575;&#12289;83.14%&#30340;&#25935;&#24863;&#24615;&#21644;&#29305;&#24322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work we perform a scoping review of the current literature on the detection of throat cancer from speech recordings using machine learning and artificial intelligence. We find 22 papers within this area and discuss their methods and results. We split these papers into two groups - nine performing binary classification, and 13 performing multi-class classification. The papers present a range of methods with neural networks being most commonly implemented. Many features are also extracted from the audio before classification, with the most common bring mel-frequency cepstral coefficients. None of the papers found in this search have associated code repositories and as such are not reproducible. Therefore, we create a publicly available code repository of our own classifiers. We use transfer learning on a multi-class problem, classifying three pathologies and healthy controls. Using this technique we achieve an unweighted average recall of 53.54%, sensitivity of 83.14%, and specif
&lt;/p&gt;</description></item></channel></rss>