<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;Stackelberg&#21338;&#24328;&#20013;&#20248;&#21270;&#20247;&#22810;&#26426;&#22120;&#20154;&#30340;&#34892;&#21160;&#39034;&#24207;&#30340;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#39640;&#25928;&#20934;&#30830;&#30340;&#31639;&#27861;(B&amp;P)&#26469;&#27714;&#35299;&#30456;&#20851;&#30340;&#20248;&#21270;&#38382;&#39064;&#21644;&#22343;&#34913;&#12290;&#35813;&#31639;&#27861;&#20855;&#26377;&#24191;&#27867;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.09246</link><description>&lt;p&gt;
&#35841;&#20808;&#34892;&#21160;&#65311;&#20248;&#21270;Stackelberg&#21338;&#24328;&#20013;&#20247;&#22810;&#26426;&#22120;&#20154;&#30340;&#34892;&#21160;&#39034;&#24207;
&lt;/p&gt;
&lt;p&gt;
Who Plays First? Optimizing the Order of Play in Stackelberg Games with Many Robots
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09246
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;Stackelberg&#21338;&#24328;&#20013;&#20248;&#21270;&#20247;&#22810;&#26426;&#22120;&#20154;&#30340;&#34892;&#21160;&#39034;&#24207;&#30340;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#39640;&#25928;&#20934;&#30830;&#30340;&#31639;&#27861;(B&amp;P)&#26469;&#27714;&#35299;&#30456;&#20851;&#30340;&#20248;&#21270;&#38382;&#39064;&#21644;&#22343;&#34913;&#12290;&#35813;&#31639;&#27861;&#20855;&#26377;&#24191;&#27867;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#35745;&#31639;&#22810;&#26234;&#33021;&#20307;&#31354;&#38388;&#23548;&#33322;&#38382;&#39064;&#30340;&#31038;&#20250;&#26368;&#20248;&#34892;&#21160;&#39034;&#24207;&#30340;&#38382;&#39064;&#65292;&#21363;&#26234;&#33021;&#20307;&#20915;&#31574;&#39034;&#24207;&#65292;&#20197;&#21450;&#19982;&#20043;&#30456;&#20851;&#30340;N&#20154;Stackelberg&#36712;&#36857;&#21338;&#24328;&#30340;&#22343;&#34913;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#38382;&#39064;&#24314;&#27169;&#20026;&#19968;&#20010;&#28151;&#21512;&#25972;&#25968;&#20248;&#21270;&#38382;&#39064;&#65292;&#28041;&#21450;&#21040;&#25152;&#26377;&#21487;&#33021;&#30340;&#34892;&#21160;&#39034;&#24207;&#30340;Stackelberg&#21338;&#24328;&#31354;&#38388;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Branch and Play (B&amp;P)&#65292;&#36825;&#26159;&#19968;&#20010;&#39640;&#25928;&#19988;&#20934;&#30830;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#25910;&#25947;&#21040;&#31038;&#20250;&#26368;&#20248;&#34892;&#21160;&#39034;&#24207;&#21450;&#20854;Stackelberg&#22343;&#34913;&#12290;&#20316;&#20026;B&amp;P&#30340;&#19968;&#20010;&#23376;&#20363;&#31243;&#65292;&#25105;&#20204;&#25552;&#20986;&#24182;&#25193;&#23637;&#20102;&#39034;&#24207;&#36712;&#36857;&#35268;&#21010;&#65292;&#21363;&#19968;&#31181;&#27969;&#34892;&#30340;&#22810;&#26234;&#33021;&#20307;&#25511;&#21046;&#26041;&#27861;&#65292;&#20197;&#20415;&#20026;&#20219;&#20309;&#32473;&#23450;&#30340;&#34892;&#21160;&#39034;&#24207;&#21487;&#25193;&#23637;&#22320;&#35745;&#31639;&#26377;&#25928;&#30340;&#26412;&#22320;Stackelberg&#22343;&#34913;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;B&amp;P&#22312;&#21327;&#35843;&#31354;&#20013;&#20132;&#36890;&#25511;&#21046;&#12289;&#32676;&#20307;&#24418;&#25104;&#21644;&#20132;&#20184;&#36710;&#38431;&#26041;&#38754;&#30340;&#23454;&#38469;&#25928;&#29992;&#12290;&#25105;&#20204;&#21457;&#29616;B&amp;P&#30340;&#32467;&#26524;&#26159;&#19968;&#33268;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09246v1 Announce Type: cross Abstract: We consider the multi-agent spatial navigation problem of computing the socially optimal order of play, i.e., the sequence in which the agents commit to their decisions, and its associated equilibrium in an N-player Stackelberg trajectory game. We model this problem as a mixed-integer optimization problem over the space of all possible Stackelberg games associated with the order of play's permutations. To solve the problem, we introduce Branch and Play (B&amp;P), an efficient and exact algorithm that provably converges to a socially optimal order of play and its Stackelberg equilibrium. As a subroutine for B&amp;P, we employ and extend sequential trajectory planning, i.e., a popular multi-agent control approach, to scalably compute valid local Stackelberg equilibria for any given order of play. We demonstrate the practical utility of B&amp;P to coordinate air traffic control, swarm formation, and delivery vehicle fleets. We find that B&amp;P consistent
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#38656;&#35201;&#20551;&#35774;&#26410;&#30693;&#36755;&#20837;&#20026;&#32447;&#24615;&#30340;&#26041;&#27861;&#65292;&#32467;&#21512;&#38750;&#32447;&#24615;&#20248;&#21270;&#21644;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#23545;&#26410;&#30693;&#36755;&#20837;&#30340;&#20272;&#35745;&#65292;&#24182;&#36890;&#36807;&#32852;&#21512; sigma-point &#21464;&#25442;&#26041;&#26696;&#23558;&#29366;&#24577;&#21644;&#26410;&#30693;&#36755;&#20837;&#30340;&#19981;&#30830;&#23450;&#24615;&#32435;&#20837;&#20272;&#35745;&#20013;&#65292;&#30830;&#20445;&#20854;&#31283;&#23450;&#24615;&#12290;&#36825;&#20010;&#26041;&#27861;&#36866;&#29992;&#20110;&#35768;&#22810;&#26234;&#33021;&#33258;&#20027;&#31995;&#32479;&#12290;</title><link>http://arxiv.org/abs/2306.12361</link><description>&lt;p&gt;
&#22522;&#20110;&#20248;&#21270;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340; sigma-point &#21345;&#23572;&#26364;&#28388;&#27874;&#22120;&#19982;&#38750;&#32447;&#24615;&#26410;&#30693;&#36755;&#20837;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Sigma-point Kalman Filter with Nonlinear Unknown Input Estimation via Optimization and Data-driven Approach for Dynamic Systems. (arXiv:2306.12361v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12361
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#38656;&#35201;&#20551;&#35774;&#26410;&#30693;&#36755;&#20837;&#20026;&#32447;&#24615;&#30340;&#26041;&#27861;&#65292;&#32467;&#21512;&#38750;&#32447;&#24615;&#20248;&#21270;&#21644;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#23545;&#26410;&#30693;&#36755;&#20837;&#30340;&#20272;&#35745;&#65292;&#24182;&#36890;&#36807;&#32852;&#21512; sigma-point &#21464;&#25442;&#26041;&#26696;&#23558;&#29366;&#24577;&#21644;&#26410;&#30693;&#36755;&#20837;&#30340;&#19981;&#30830;&#23450;&#24615;&#32435;&#20837;&#20272;&#35745;&#20013;&#65292;&#30830;&#20445;&#20854;&#31283;&#23450;&#24615;&#12290;&#36825;&#20010;&#26041;&#27861;&#36866;&#29992;&#20110;&#35768;&#22810;&#26234;&#33021;&#33258;&#20027;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#25968;&#20851;&#20110;&#29366;&#24577;&#21644;&#26410;&#30693;&#36755;&#20837;(UI)&#20272;&#35745;&#30340;&#25991;&#29486;&#37117;&#35201;&#27714;UI&#26159;&#32447;&#24615;&#30340;&#65292;&#36825;&#20010;&#38480;&#21046;&#21487;&#33021;&#22826;&#20005;&#26684;&#20102;&#65292;&#22240;&#20026;&#23427;&#24182;&#19981;&#36866;&#29992;&#20110;&#35768;&#22810;&#26234;&#33021;&#33258;&#20027;&#31995;&#32479;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#23548;&#25968;&#26410;&#30693;&#36755;&#20837; Sigma-point &#21345;&#23572;&#26364;&#28388;&#27874;&#22120;(SPKE-nUI)&#65292;&#20854;&#20013; SPKF &#19982;&#26222;&#36890;&#38750;&#32447;&#24615; UI &#20272;&#35745;&#22120;&#30456;&#20114;&#36830;&#25509;&#65292;&#21487;&#20197;&#36890;&#36807;&#38750;&#32447;&#24615;&#20248;&#21270;&#21644;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#23454;&#29616;&#12290;&#38750;&#32447;&#24615; UI &#20272;&#35745;&#22120;&#20351;&#29992;&#21518;&#39564;&#29366;&#24577;&#20272;&#35745;&#65292;&#36825;&#23545;&#29366;&#24577;&#39044;&#27979;&#35823;&#24046;&#19981;&#22826;&#25935;&#24863;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#32852;&#21512; sigma-point &#21464;&#25442;&#26041;&#26696;&#65292;&#23558;&#29366;&#24577;&#21644; UI &#30340;&#19981;&#30830;&#23450;&#24615;&#32435;&#20837; SPKF-nUI &#30340;&#20272;&#35745;&#20013;&#12290;&#28145;&#20837;&#30340;&#38543;&#26426;&#31283;&#23450;&#24615;&#20998;&#26512;&#35777;&#26126;&#20102;&#22312;&#21512;&#29702;&#30340;&#20551;&#35774;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340; SPKF-nUI &#21487;&#20197;&#20135;&#29983;&#25351;&#25968;&#32423;&#25910;&#25947;&#30340;&#20272;&#35745;&#35823;&#24046;&#30028;&#38480;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#22522;&#20110;&#27169;&#25311;&#30340;&#36335;&#38754;&#36710;&#36742;&#25511;&#21046;&#38382;&#39064;&#19978;&#36827;&#34892;&#20102;&#20004;&#20010;&#26696;&#20363;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Most works on joint state and unknown input (UI) estimation require the assumption that the UIs are linear; this is potentially restrictive as it does not hold in many intelligent autonomous systems. To overcome this restriction and circumvent the need to linearize the system, we propose a derivative-free Unknown Input Sigma-point Kalman Filter (SPKF-nUI) where the SPKF is interconnected with a general nonlinear UI estimator that can be implemented via nonlinear optimization and data-driven approaches. The nonlinear UI estimator uses the posterior state estimate which is less susceptible to state prediction error. In addition, we introduce a joint sigma-point transformation scheme to incorporate both the state and UI uncertainties in the estimation of SPKF-nUI. An in-depth stochastic stability analysis proves that the proposed SPKF-nUI yields exponentially converging estimation error bounds under reasonable assumptions. Finally, two case studies are carried out on a simulation-based ri
&lt;/p&gt;</description></item></channel></rss>