<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#20351;&#29992;&#22343;&#22330;&#21338;&#24328;&#27169;&#22411;&#30740;&#31350;&#22823;&#38134;&#34892;&#23545;&#37329;&#34701;&#31995;&#32479;&#31283;&#23450;&#24615;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#22823;&#38134;&#34892;&#22312;&#35268;&#27169;&#19981;&#22826;&#22823;&#30340;&#24773;&#20917;&#19979;&#21487;&#20197;&#23545;&#31283;&#23450;&#24615;&#20135;&#29983;&#31215;&#26497;&#30340;&#36129;&#29486;&#65292;&#20294;&#22312;&#36829;&#32422;&#20107;&#20214;&#20013;&#20063;&#26377;&#21487;&#33021;&#20135;&#29983;&#36127;&#38754;&#28322;&#20986;&#25928;&#24212;&#65292;&#23548;&#33268;&#31995;&#32479;&#24615;&#39118;&#38505;&#22686;&#21152;&#12290;&#38543;&#30528;&#38134;&#34892;&#23545;&#36328;&#34892;&#19994;&#24066;&#22330;&#30340;&#20381;&#36182;&#31243;&#24230;&#36234;&#26469;&#36234;&#39640;&#65292;&#25972;&#20010;&#31995;&#32479;&#21464;&#24471;&#26356;&#21152;&#31283;&#23450;&#65292;&#20294;&#32597;&#35265;&#31995;&#32479;&#24615;&#23849;&#28291;&#30340;&#27010;&#29575;&#20063;&#20250;&#22686;&#21152;&#12290;&#32780;&#22823;&#38134;&#34892;&#30340;&#23384;&#22312;&#36827;&#19968;&#27493;&#25918;&#22823;&#20102;&#36825;&#31181;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2305.17830</link><description>&lt;p&gt;
&#22823;&#38134;&#34892;&#19982;&#31995;&#32479;&#39118;&#38505;&#65306;&#22522;&#20110;&#22343;&#22330;&#21338;&#24328;&#27169;&#22411;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Large Banks and Systemic Risk: Insights from a Mean-Field Game Model. (arXiv:2305.17830v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17830
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#22343;&#22330;&#21338;&#24328;&#27169;&#22411;&#30740;&#31350;&#22823;&#38134;&#34892;&#23545;&#37329;&#34701;&#31995;&#32479;&#31283;&#23450;&#24615;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#22823;&#38134;&#34892;&#22312;&#35268;&#27169;&#19981;&#22826;&#22823;&#30340;&#24773;&#20917;&#19979;&#21487;&#20197;&#23545;&#31283;&#23450;&#24615;&#20135;&#29983;&#31215;&#26497;&#30340;&#36129;&#29486;&#65292;&#20294;&#22312;&#36829;&#32422;&#20107;&#20214;&#20013;&#20063;&#26377;&#21487;&#33021;&#20135;&#29983;&#36127;&#38754;&#28322;&#20986;&#25928;&#24212;&#65292;&#23548;&#33268;&#31995;&#32479;&#24615;&#39118;&#38505;&#22686;&#21152;&#12290;&#38543;&#30528;&#38134;&#34892;&#23545;&#36328;&#34892;&#19994;&#24066;&#22330;&#30340;&#20381;&#36182;&#31243;&#24230;&#36234;&#26469;&#36234;&#39640;&#65292;&#25972;&#20010;&#31995;&#32479;&#21464;&#24471;&#26356;&#21152;&#31283;&#23450;&#65292;&#20294;&#32597;&#35265;&#31995;&#32479;&#24615;&#23849;&#28291;&#30340;&#27010;&#29575;&#20063;&#20250;&#22686;&#21152;&#12290;&#32780;&#22823;&#38134;&#34892;&#30340;&#23384;&#22312;&#36827;&#19968;&#27493;&#25918;&#22823;&#20102;&#36825;&#31181;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#30740;&#31350;&#22823;&#38134;&#34892;&#23545;&#37329;&#34701;&#31995;&#32479;&#31283;&#23450;&#24615;&#30340;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#37319;&#29992;&#19968;&#20010;&#32447;&#24615;&#20108;&#27425;&#39640;&#26031;&#65288;LQG&#65289;&#22343;&#22330;&#21338;&#24328;&#65288;MFG&#65289;&#27169;&#22411;&#26469;&#30740;&#31350;&#36328;&#34892;&#19994;&#24066;&#22330;&#65292;&#20854;&#20013;&#21253;&#25324;&#19968;&#20010;&#22823;&#38134;&#34892;&#21644;&#22810;&#20010;&#23567;&#38134;&#34892;&#12290;&#25105;&#20204;&#37319;&#29992;MFG&#26041;&#27861;&#25512;&#23548;&#27599;&#20010;&#38134;&#34892;&#30340;&#26368;&#20248;&#20132;&#26131;&#31574;&#30053;&#65292;&#24182;&#24471;&#20986;&#24066;&#22330;&#30340;&#22343;&#34913;&#29366;&#24577;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#36827;&#34892;Monte Carlo&#27169;&#25311;&#65292;&#25506;&#35752;&#22823;&#38134;&#34892;&#22312;&#21508;&#31181;&#24773;&#20917;&#19979;&#23545;&#31995;&#32479;&#24615;&#39118;&#38505;&#25198;&#28436;&#30340;&#35282;&#33394;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#34429;&#28982;&#22823;&#38134;&#34892;&#22914;&#26524;&#35268;&#27169;&#19981;&#22826;&#22823;&#21487;&#20197;&#23545;&#31283;&#23450;&#24615;&#20135;&#29983;&#31215;&#26497;&#30340;&#36129;&#29486;&#65292;&#20294;&#22312;&#36829;&#32422;&#20107;&#20214;&#20013;&#20063;&#26377;&#21487;&#33021;&#20135;&#29983;&#36127;&#38754;&#28322;&#20986;&#25928;&#24212;&#65292;&#23548;&#33268;&#31995;&#32479;&#24615;&#39118;&#38505;&#22686;&#21152;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#38543;&#30528;&#38134;&#34892;&#23545;&#36328;&#34892;&#19994;&#24066;&#22330;&#30340;&#20381;&#36182;&#31243;&#24230;&#36234;&#26469;&#36234;&#39640;&#65292;&#25972;&#20010;&#31995;&#32479;&#21464;&#24471;&#26356;&#21152;&#31283;&#23450;&#65292;&#20294;&#32597;&#35265;&#31995;&#32479;&#24615;&#23849;&#28291;&#30340;&#27010;&#29575;&#20063;&#20250;&#22686;&#21152;&#12290;&#32780;&#22823;&#38134;&#34892;&#30340;&#23384;&#22312;&#36827;&#19968;&#27493;&#25918;&#22823;&#20102;&#36825;&#31181;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to investigate the impact of large banks on the financial system stability. To achieve this, we employ a linear-quadratic-Gaussian (LQG) mean-field game (MFG) model of an interbank market, which involves one large bank and multiple small banks. Our approach involves utilizing the MFG methodology to derive the optimal trading strategies for each bank, resulting in an equilibrium for the market. Subsequently, we conduct Monte Carlo simulations to explore the role played by the large bank in systemic risk under various scenarios. Our findings indicate that while the major bank, if its size is not too large, can contribute positively to stability, it also has the potential to generate negative spillover effects in the event of default, leading to increased systemic risk. We also discover that as banks become more reliant on the interbank market, the overall system becomes more stable but the probability of a rare systemic failure increases. This risk is further amplified by
&lt;/p&gt;</description></item></channel></rss>