<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>Het-node2vec&#26159;&#19968;&#20010;&#31639;&#27861;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#24322;&#26500;&#22810;&#22270;&#19978;&#36827;&#34892;&#20108;&#38454;&#38543;&#26426;&#28216;&#36208;&#37319;&#26679;&#65292;&#33021;&#22815;&#25429;&#33719;&#22270;&#30340;&#32467;&#26500;&#29305;&#24449;&#21644;&#19981;&#21516;&#31867;&#22411;&#33410;&#28857;&#36793;&#30340;&#35821;&#20041;&#65292;&#26377;&#25928;&#22320;&#25552;&#39640;&#23545;&#24322;&#26500;&#22270;&#30340;&#26080;&#30417;&#30563;&#21644;&#26377;&#30417;&#30563;&#23398;&#20064;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2101.01425</link><description>&lt;p&gt;
Het-node2vec&#65306;&#24322;&#26500;&#22810;&#22270;&#23884;&#20837;&#30340;&#20108;&#38454;&#38543;&#26426;&#28216;&#36208;&#37319;&#26679;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Het-node2vec: second order random walk sampling for heterogeneous multigraphs embedding. (arXiv:2101.01425v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2101.01425
&lt;/p&gt;
&lt;p&gt;
Het-node2vec&#26159;&#19968;&#20010;&#31639;&#27861;&#26694;&#26550;&#65292;&#36890;&#36807;&#22312;&#24322;&#26500;&#22810;&#22270;&#19978;&#36827;&#34892;&#20108;&#38454;&#38543;&#26426;&#28216;&#36208;&#37319;&#26679;&#65292;&#33021;&#22815;&#25429;&#33719;&#22270;&#30340;&#32467;&#26500;&#29305;&#24449;&#21644;&#19981;&#21516;&#31867;&#22411;&#33410;&#28857;&#36793;&#30340;&#35821;&#20041;&#65292;&#26377;&#25928;&#22320;&#25552;&#39640;&#23545;&#24322;&#26500;&#22270;&#30340;&#26080;&#30417;&#30563;&#21644;&#26377;&#30417;&#30563;&#23398;&#20064;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20010;&#30495;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#65292;&#20026;&#24322;&#26500;&#22270;&#24320;&#21457;&#22270;&#34920;&#31034;&#23398;&#20064;&#26041;&#27861;&#26159;&#22522;&#30784;&#24615;&#30340;&#65292;&#22240;&#20026;&#22312;&#22810;&#20010;&#19978;&#19979;&#25991;&#20013;&#65292;&#22270;&#30001;&#19981;&#21516;&#31867;&#22411;&#30340;&#33410;&#28857;&#21644;&#36793;&#25152;&#29305;&#24449;&#21270;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31639;&#27861;&#26694;&#26550;&#65288;Het-node2vec&#65289;&#65292;&#23558;&#21407;&#22987;&#30340;node2vec&#33410;&#28857;&#37051;&#22495;&#37319;&#26679;&#26041;&#27861;&#25193;&#23637;&#21040;&#20102;&#24322;&#26500;&#22810;&#22270;&#19978;&#12290;&#25152;&#24471;&#21040;&#30340;&#38543;&#26426;&#28216;&#36208;&#26679;&#26412;&#25429;&#33719;&#20102;&#22270;&#30340;&#32467;&#26500;&#29305;&#24449;&#20197;&#21450;&#19981;&#21516;&#31867;&#22411;&#30340;&#33410;&#28857;&#21644;&#36793;&#30340;&#35821;&#20041;&#12290;&#25152;&#25552;&#20986;&#30340;&#31639;&#27861;&#21487;&#20197;&#32858;&#28966;&#20110;&#29305;&#23450;&#30340;&#33410;&#28857;&#25110;&#36793;&#31867;&#22411;&#65292;&#20026;&#25152;&#30740;&#31350;&#30340;&#39044;&#27979;&#38382;&#39064;&#20013;&#26377;&#20852;&#36259;&#30340;&#23569;&#25968;&#33410;&#28857;/&#36793;&#31867;&#22411;&#25552;&#20379;&#20934;&#30830;&#30340;&#34920;&#31034;&#12290;&#36825;&#20123;&#20016;&#23500;&#32780;&#26377;&#38024;&#23545;&#24615;&#30340;&#34920;&#31034;&#21487;&#20197;&#22686;&#24378;&#23545;&#24322;&#26500;&#22270;&#30340;&#26080;&#30417;&#30563;&#21644;&#26377;&#30417;&#30563;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;
The development of Graph Representation Learning methods for heterogeneous graphs is fundamental in several real-world applications, since in several contexts graphs are characterized by different types of nodes and edges. We introduce a an algorithmic framework (Het-node2vec) that extends the original node2vec node-neighborhood sampling method to heterogeneous multigraphs. The resulting random walk samples capture both the structural characteristics of the graph and the semantics of the different types of nodes and edges. The proposed algorithms can focus their attention on specific node or edge types, allowing accurate representations also for underrepresented types of nodes/edges that are of interest for the prediction problem under investigation. These rich and well-focused representations can boost unsupervised and supervised learning on heterogeneous graphs.
&lt;/p&gt;</description></item></channel></rss>