<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#24341;&#20837;&#20102;&#21487;&#25511;&#20559;&#22909;&#20248;&#21270;&#65288;CPO&#65289;&#26041;&#27861;&#65292;&#26126;&#30830;&#20026;&#19981;&#21516;&#30446;&#26631;&#25351;&#23450;&#20559;&#22909;&#20998;&#25968;&#65292;&#20174;&#32780;&#24341;&#23548;&#27169;&#22411;&#29983;&#25104;&#31526;&#21512;&#38656;&#27714;&#30340;&#21709;&#24212;&#12290;</title><link>https://arxiv.org/abs/2402.19085</link><description>&lt;p&gt;
&#21487;&#25511;&#20559;&#22909;&#20248;&#21270;&#65306;&#26397;&#30528;&#21487;&#25511;&#22810;&#30446;&#26631;&#23545;&#40784;&#26041;&#21521;&#21457;&#23637;
&lt;/p&gt;
&lt;p&gt;
Controllable Preference Optimization: Toward Controllable Multi-Objective Alignment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19085
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#21487;&#25511;&#20559;&#22909;&#20248;&#21270;&#65288;CPO&#65289;&#26041;&#27861;&#65292;&#26126;&#30830;&#20026;&#19981;&#21516;&#30446;&#26631;&#25351;&#23450;&#20559;&#22909;&#20998;&#25968;&#65292;&#20174;&#32780;&#24341;&#23548;&#27169;&#22411;&#29983;&#25104;&#31526;&#21512;&#38656;&#27714;&#30340;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#20013;&#30340;&#23545;&#40784;&#24037;&#20316;&#26088;&#22312;&#36861;&#27714;&#27169;&#22411;&#21709;&#24212;&#19982;&#20154;&#31867;&#20559;&#22909;&#21644;&#20215;&#20540;&#30340;&#19968;&#33268;&#24615;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#21487;&#25511;&#20559;&#22909;&#20248;&#21270;&#65288;CPO&#65289;&#26041;&#27861;&#65292;&#26126;&#30830;&#20026;&#19981;&#21516;&#30446;&#26631;&#25351;&#23450;&#20559;&#22909;&#20998;&#25968;&#65292;&#20174;&#32780;&#24341;&#23548;&#27169;&#22411;&#29983;&#25104;&#31526;&#21512;&#38656;&#27714;&#30340;&#21709;&#24212;&#12290;&#23454;&#39564;&#20998;&#26512;&#34920;&#26126;&#65292;&#32463;&#36807;&#23545;&#40784;&#30340;&#27169;&#22411;&#21487;&#20197;&#25552;&#20379;&#31526;&#21512;&#21508;&#31181;&#20559;&#22909;&#30340;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19085v1 Announce Type: new  Abstract: Alignment in artificial intelligence pursues the consistency between model responses and human preferences as well as values. In practice, the multifaceted nature of human preferences inadvertently introduces what is known as the "alignment tax" -a compromise where enhancements in alignment within one objective (e.g.,harmlessness) can diminish performance in others (e.g.,helpfulness). However, existing alignment techniques are mostly unidirectional, leading to suboptimal trade-offs and poor flexibility over various objectives. To navigate this challenge, we argue the prominence of grounding LLMs with evident preferences. We introduce controllable preference optimization (CPO), which explicitly specifies preference scores for different objectives, thereby guiding the model to generate responses that meet the requirements. Our experimental analysis reveals that the aligned models can provide responses that match various preferences among t
&lt;/p&gt;</description></item><item><title>GPSINDy&#26159;&#19968;&#31181;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#19982;SINDy&#30456;&#32467;&#21512;&#65292;&#33021;&#22815;&#20174;&#22122;&#22768;&#25968;&#25454;&#20013;&#21457;&#29616;&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#31995;&#32479;&#27169;&#22411;&#65292;&#24182;&#22312;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#22312;&#31995;&#32479;&#21160;&#24577;&#21644;&#39044;&#27979;&#26410;&#26469;&#36712;&#36857;&#26041;&#38754;&#30340;&#25913;&#36827;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2309.11076</link><description>&lt;p&gt;
GPSINDy: &#25968;&#25454;&#39537;&#21160;&#30340;&#21160;&#21147;&#23398;&#31995;&#32479;&#26041;&#31243;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
GPSINDy: Data-Driven Discovery of Equations of Motion. (arXiv:2309.11076v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11076
&lt;/p&gt;
&lt;p&gt;
GPSINDy&#26159;&#19968;&#31181;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#19982;SINDy&#30456;&#32467;&#21512;&#65292;&#33021;&#22815;&#20174;&#22122;&#22768;&#25968;&#25454;&#20013;&#21457;&#29616;&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#31995;&#32479;&#27169;&#22411;&#65292;&#24182;&#22312;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#22312;&#31995;&#32479;&#21160;&#24577;&#21644;&#39044;&#27979;&#26410;&#26469;&#36712;&#36857;&#26041;&#38754;&#30340;&#25913;&#36827;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#32771;&#34385;&#20174;&#26377;&#22122;&#22768;&#25968;&#25454;&#20013;&#21457;&#29616;&#21160;&#21147;&#23398;&#31995;&#32479;&#27169;&#22411;&#30340;&#38382;&#39064;&#12290;&#24050;&#30693;&#22122;&#22768;&#23384;&#22312;&#23545;&#31526;&#21495;&#22238;&#24402;&#31639;&#27861;&#26469;&#35828;&#26159;&#19968;&#20010;&#37325;&#35201;&#38382;&#39064;&#12290;&#25105;&#20204;&#23558;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#65288;&#19968;&#31181;&#38750;&#21442;&#25968;&#23398;&#20064;&#26041;&#27861;&#65289;&#19982;SINDy&#65288;&#19968;&#31181;&#21442;&#25968;&#23398;&#20064;&#26041;&#27861;&#65289;&#30456;&#32467;&#21512;&#65292;&#20174;&#25968;&#25454;&#20013;&#35782;&#21035;&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#31995;&#32479;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#31616;&#21333;&#24615;&#21644;&#19982;SINDy&#30456;&#27604;&#22312;&#26377;&#22122;&#22768;&#25968;&#25454;&#19978;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#40065;&#26834;&#24615;&#30340;&#20248;&#28857;&#12290;&#25105;&#20204;&#22312;Lotka-Volterra&#27169;&#22411;&#21644;&#20223;&#30495;&#20013;&#30340;&#21333;&#36718;&#36710;&#21160;&#24577;&#27169;&#22411;&#19978;&#20197;&#21450;&#22312;&#20351;&#29992;&#30828;&#20214;&#25968;&#25454;&#30340;NVIDIA JetRacer&#31995;&#32479;&#19978;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#30456;&#36739;&#20110;SINDy&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#21457;&#29616;&#31995;&#32479;&#21160;&#24577;&#21644;&#39044;&#27979;&#26410;&#26469;&#36712;&#36857;&#26041;&#38754;&#30340;&#25913;&#36827;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we consider the problem of discovering dynamical system models from noisy data. The presence of noise is known to be a significant problem for symbolic regression algorithms. We combine Gaussian process regression, a nonparametric learning method, with SINDy, a parametric learning approach, to identify nonlinear dynamical systems from data. The key advantages of our proposed approach are its simplicity coupled with the fact that it demonstrates improved robustness properties with noisy data over SINDy. We demonstrate our proposed approach on a Lotka-Volterra model and a unicycle dynamic model in simulation and on an NVIDIA JetRacer system using hardware data. We demonstrate improved performance over SINDy for discovering the system dynamics and predicting future trajectories.
&lt;/p&gt;</description></item></channel></rss>