<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>MacroSwarm&#26159;&#19968;&#31181;&#22522;&#20110;&#22330;&#30340;&#32676;&#20307;&#32534;&#31243;&#26694;&#26550;&#65292;&#36890;&#36807;&#21487;&#32452;&#21512;&#30340;&#21151;&#33021;&#27169;&#22359;&#23454;&#29616;&#22797;&#26434;&#30340;&#32676;&#20307;&#34892;&#20026;&#65292;&#36890;&#36807;&#23558;&#24863;&#30693;&#22330;&#26144;&#23556;&#20026;&#25191;&#34892;&#30446;&#26631;&#22330;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#31995;&#32479;&#21270;&#30340;&#35774;&#35745;&#21644;&#23454;&#29616;&#32676;&#20307;&#34892;&#20026;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.10969</link><description>&lt;p&gt;
MacroSwarm: &#19968;&#31181;&#22522;&#20110;&#22330;&#30340;&#32452;&#21512;&#26694;&#26550;&#29992;&#20110;&#32676;&#20307;&#32534;&#31243;
&lt;/p&gt;
&lt;p&gt;
MacroSwarm: A Field-based Compositional Framework for Swarm Programming. (arXiv:2401.10969v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10969
&lt;/p&gt;
&lt;p&gt;
MacroSwarm&#26159;&#19968;&#31181;&#22522;&#20110;&#22330;&#30340;&#32676;&#20307;&#32534;&#31243;&#26694;&#26550;&#65292;&#36890;&#36807;&#21487;&#32452;&#21512;&#30340;&#21151;&#33021;&#27169;&#22359;&#23454;&#29616;&#22797;&#26434;&#30340;&#32676;&#20307;&#34892;&#20026;&#65292;&#36890;&#36807;&#23558;&#24863;&#30693;&#22330;&#26144;&#23556;&#20026;&#25191;&#34892;&#30446;&#26631;&#22330;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#31995;&#32479;&#21270;&#30340;&#35774;&#35745;&#21644;&#23454;&#29616;&#32676;&#20307;&#34892;&#20026;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32676;&#20307;&#34892;&#20026;&#24037;&#31243;&#26159;&#19968;&#39033;&#26088;&#22312;&#30740;&#31350;&#21327;&#35843;&#31616;&#21333;&#26234;&#33021;&#20307;&#22242;&#20307;&#20869;&#35745;&#31639;&#21644;&#34892;&#21160;&#30340;&#26041;&#27861;&#21644;&#25216;&#26415;&#65292;&#20197;&#23454;&#29616;&#22797;&#26434;&#30340;&#20840;&#23616;&#30446;&#26631;&#65292;&#22914;&#22270;&#26696;&#24418;&#25104;&#12289;&#38598;&#20307;&#31227;&#21160;&#12289;&#32858;&#31867;&#21644;&#20998;&#24067;&#24335;&#24863;&#30693;&#12290;&#23613;&#31649;&#22312;&#32676;&#20307;&#65288;&#26080;&#20154;&#26426;&#12289;&#26426;&#22120;&#20154;&#12289;&#36710;&#36742;&#65289;&#20998;&#26512;&#21644;&#24037;&#31243;&#26041;&#38754;&#21462;&#24471;&#20102;&#19968;&#20123;&#36827;&#23637;&#65292;&#20294;&#20173;&#28982;&#38656;&#35201;&#36890;&#29992;&#30340;&#35774;&#35745;&#21644;&#23454;&#29616;&#26041;&#27861;&#21644;&#24037;&#20855;&#65292;&#20197;&#31995;&#32479;&#21270;&#30340;&#26041;&#24335;&#23450;&#20041;&#22797;&#26434;&#30340;&#32676;&#20307;&#34892;&#20026;&#12290;&#20026;&#20102;&#23545;&#27492;&#20570;&#20986;&#36129;&#29486;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#22330;&#30340;&#21327;&#35843;&#26041;&#27861;&#65292;&#31216;&#20026;MacroSwarm&#65292;&#20197;&#21487;&#37325;&#29992;&#19988;&#23436;&#20840;&#21487;&#32452;&#21512;&#30340;&#21151;&#33021;&#27169;&#22359;&#20026;&#22522;&#30784;&#65292;&#23884;&#20837;&#38598;&#20307;&#35745;&#31639;&#21644;&#21327;&#35843;&#12290;&#22522;&#20110;&#38598;&#25104;&#35745;&#31639;&#30340;&#23439;&#32534;&#31243;&#33539;&#24335;&#65292;MacroSwarm&#25552;&#20986;&#20102;&#23558;&#27599;&#20010;&#32676;&#20307;&#34892;&#20026;&#22359;&#34920;&#31034;&#20026;&#23558;&#24863;&#30693;&#22330;&#26144;&#23556;&#20026;&#25191;&#34892;&#30446;&#26631;&#22330;&#30340;&#32431;&#20989;&#25968;&#30340;&#24605;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Swarm behaviour engineering is an area of research that seeks to investigate methods and techniques for coordinating computation and action within groups of simple agents to achieve complex global goals like pattern formation, collective movement, clustering, and distributed sensing. Despite recent progress in the analysis and engineering of swarms (of drones, robots, vehicles), there is still a need for general design and implementation methods and tools that can be used to define complex swarm behaviour in a principled way. To contribute to this quest, this article proposes a new field-based coordination approach, called MacroSwarm, to design and program swarm behaviour in terms of reusable and fully composable functional blocks embedding collective computation and coordination. Based on the macroprogramming paradigm of aggregate computing, MacroSwarm builds on the idea of expressing each swarm behaviour block as a pure function mapping sensing fields into actuation goal fields, e.g.
&lt;/p&gt;</description></item></channel></rss>