<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#33258;&#30417;&#30563;&#23398;&#20064;&#34920;&#31034;&#27861;&#65288;SSLR&#65289;&#30340;&#24555;&#36895;WER&#20272;&#35745;&#22120;&#65288;Fe-WER&#65289;&#65292;&#22312;&#22823;&#25968;&#25454;&#22330;&#26223;&#19979;&#20855;&#26377;&#36739;&#39640;&#30340;&#35745;&#31639;&#25928;&#29575;&#21644;&#24615;&#33021;&#25552;&#21319;&#12290;</title><link>http://arxiv.org/abs/2310.08225</link><description>&lt;p&gt;
&#20351;&#29992;&#33258;&#30417;&#30563;&#34920;&#31034;&#27861;&#23545;&#35821;&#38899;&#21644;&#25991;&#26412;&#36827;&#34892;&#24555;&#36895;&#23383;&#38169;&#29575;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Fast Word Error Rate Estimation Using Self-Supervised Representations For Speech And Text. (arXiv:2310.08225v1 [eess.AS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08225
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#33258;&#30417;&#30563;&#23398;&#20064;&#34920;&#31034;&#27861;&#65288;SSLR&#65289;&#30340;&#24555;&#36895;WER&#20272;&#35745;&#22120;&#65288;Fe-WER&#65289;&#65292;&#22312;&#22823;&#25968;&#25454;&#22330;&#26223;&#19979;&#20855;&#26377;&#36739;&#39640;&#30340;&#35745;&#31639;&#25928;&#29575;&#21644;&#24615;&#33021;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21160;&#35821;&#38899;&#35782;&#21035;&#65288;ASR&#65289;&#30340;&#36136;&#37327;&#36890;&#24120;&#36890;&#36807;&#23383;&#38169;&#29575;&#65288;WER&#65289;&#26469;&#34913;&#37327;&#12290;WER&#20272;&#35745;&#26159;&#19968;&#39033;&#20219;&#21153;&#65292;&#26088;&#22312;&#39044;&#27979;ASR&#31995;&#32479;&#30340;WER&#65292;&#32473;&#23450;&#19968;&#20010;&#35821;&#38899;&#35828;&#35805;&#21644;&#19968;&#20010;&#36716;&#24405;&#12290;&#22312;&#22823;&#37327;&#25968;&#25454;&#19978;&#35757;&#32451;&#20808;&#36827;&#30340;ASR&#31995;&#32479;&#30340;&#21516;&#26102;&#65292;&#36825;&#20010;&#20219;&#21153;&#36234;&#26469;&#36234;&#21463;&#21040;&#20851;&#27880;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;WER&#20272;&#35745;&#22312;&#35768;&#22810;&#22330;&#26223;&#20013;&#21464;&#24471;&#24517;&#35201;&#65292;&#20363;&#22914;&#36873;&#25321;&#20855;&#26377;&#26410;&#30693;&#36716;&#24405;&#36136;&#37327;&#30340;&#35757;&#32451;&#25968;&#25454;&#65292;&#25110;&#22312;&#27809;&#26377;&#22320;&#38754;&#30495;&#23454;&#36716;&#24405;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;ASR&#31995;&#32479;&#30340;&#27979;&#35797;&#24615;&#33021;&#12290;&#38754;&#23545;&#22823;&#37327;&#25968;&#25454;&#65292;WER&#20272;&#35745;&#20202;&#30340;&#36816;&#31639;&#25928;&#29575;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#21464;&#24471;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#20197;&#21069;&#30340;&#30740;&#31350;&#36890;&#24120;&#26410;&#23558;&#20854;&#35270;&#20026;&#20248;&#20808;&#32771;&#34385;&#30340;&#38382;&#39064;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#33258;&#30417;&#30563;&#23398;&#20064;&#34920;&#31034;&#27861;&#65288;SSLR&#65289;&#30340;&#24555;&#36895;WER&#20272;&#35745;&#22120;&#65288;Fe-WER&#65289;&#12290;&#35813;&#20272;&#35745;&#22120;&#22522;&#20110;&#36890;&#36807;&#24179;&#22343;&#27744;&#32858;&#21512;&#30340;SSLR&#26500;&#24314;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#30456;&#23545;&#20110;e-WER3&#22522;&#32447;&#65292;Fe-WER&#30340;&#24615;&#33021;&#25552;&#39640;&#20102;19.69&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;
The quality of automatic speech recognition (ASR) is typically measured by word error rate (WER). WER estimation is a task aiming to predict the WER of an ASR system, given a speech utterance and a transcription. This task has gained increasing attention while advanced ASR systems are trained on large amounts of data. In this case, WER estimation becomes necessary in many scenarios, for example, selecting training data with unknown transcription quality or estimating the testing performance of an ASR system without ground truth transcriptions. Facing large amounts of data, the computation efficiency of a WER estimator becomes essential in practical applications. However, previous works usually did not consider it as a priority. In this paper, a Fast WER estimator (Fe-WER) using self-supervised learning representation (SSLR) is introduced. The estimator is built upon SSLR aggregated by average pooling. The results show that Fe-WER outperformed the e-WER3 baseline relatively by 19.69% an
&lt;/p&gt;</description></item></channel></rss>