<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>RepoHyper&#25552;&#20986;&#20102;Repo&#32423;&#35821;&#20041;&#22270;&#65288;RSG&#65289;&#21644;Expand&#21644;Refine&#26816;&#32034;&#26041;&#27861;&#65292;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#25216;&#26415;&#65292;&#28385;&#36275;&#20179;&#24211;&#32423;&#20195;&#30721;&#34917;&#20840;&#30340;&#38656;&#27714;</title><link>https://arxiv.org/abs/2403.06095</link><description>&lt;p&gt;
RepoHyper&#65306;&#26356;&#22909;&#30340;&#19978;&#19979;&#25991;&#26816;&#32034;&#26159;&#20179;&#24211;&#32423;&#20195;&#30721;&#34917;&#20840;&#25152;&#38656;&#30340;&#19968;&#20999;
&lt;/p&gt;
&lt;p&gt;
RepoHyper: Better Context Retrieval Is All You Need for Repository-Level Code Completion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06095
&lt;/p&gt;
&lt;p&gt;
RepoHyper&#25552;&#20986;&#20102;Repo&#32423;&#35821;&#20041;&#22270;&#65288;RSG&#65289;&#21644;Expand&#21644;Refine&#26816;&#32034;&#26041;&#27861;&#65292;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#25216;&#26415;&#65292;&#28385;&#36275;&#20179;&#24211;&#32423;&#20195;&#30721;&#34917;&#20840;&#30340;&#38656;&#27714;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06095v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#20132;&#21449;&#25688;&#35201;&#65306;&#20195;&#30721;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;CodeLLMs&#65289;&#22312;&#20195;&#30721;&#34917;&#20840;&#20219;&#21153;&#20013;&#23637;&#31034;&#20986;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#29087;&#32451;&#31243;&#24230;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#32463;&#24120;&#26080;&#27861;&#23436;&#20840;&#29702;&#35299;&#39033;&#30446;&#20179;&#24211;&#30340;&#24191;&#27867;&#19978;&#19979;&#25991;&#65292;&#27604;&#22914;&#30456;&#20851;&#25991;&#20214;&#21644;&#31867;&#23618;&#27425;&#32467;&#26500;&#30340;&#22797;&#26434;&#24615;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#34917;&#20840;&#19981;&#22815;&#31934;&#30830;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;RepoHyper&#65292;&#19968;&#20010;&#26088;&#22312;&#35299;&#20915;&#19982;&#20179;&#24211;&#32423;&#20195;&#30721;&#34917;&#20840;&#30456;&#20851;&#30340;&#22797;&#26434;&#25361;&#25112;&#30340;&#22810;&#26041;&#38754;&#26694;&#26550;&#12290;RepoHyper&#30340;&#26680;&#24515;&#26159;Repo&#32423;&#35821;&#20041;&#22270;&#65288;RSG&#65289;&#65292;&#19968;&#31181;&#23553;&#35013;&#20195;&#30721;&#20179;&#24211;&#24191;&#27867;&#19978;&#19979;&#25991;&#30340;&#26032;&#39062;&#35821;&#20041;&#22270;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;RepoHyper&#21033;&#29992;&#25193;&#23637;&#21644;&#32454;&#21270;&#26816;&#32034;&#26041;&#27861;&#65292;&#21253;&#25324;&#24212;&#29992;&#20110;RSG&#30340;&#22270;&#25193;&#23637;&#21644;&#38142;&#25509;&#39044;&#27979;&#31639;&#27861;&#65292;&#20174;&#32780;&#23454;&#29616;&#23545;&#30456;&#20851;&#20195;&#30721;&#29255;&#27573;&#30340;&#26377;&#25928;&#26816;&#32034;&#21644;&#20248;&#20808;&#25490;&#24207;&#12290;&#25105;&#20204;&#30340;&#35780;&#20272;&#34920;&#26126;&#65292;RepoHyper&#22312;&#37325;&#26032;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06095v1 Announce Type: cross  Abstract: Code Large Language Models (CodeLLMs) have demonstrated impressive proficiency in code completion tasks. However, they often fall short of fully understanding the extensive context of a project repository, such as the intricacies of relevant files and class hierarchies, which can result in less precise completions. To overcome these limitations, we present RepoHyper, a multifaceted framework designed to address the complex challenges associated with repository-level code completion. Central to RepoHyper is the Repo-level Semantic Graph (RSG), a novel semantic graph structure that encapsulates the vast context of code repositories. Furthermore, RepoHyper leverages Expand and Refine retrieval method, including a graph expansion and a link prediction algorithm applied to the RSG, enabling the effective retrieval and prioritization of relevant code snippets. Our evaluations show that RepoHyper markedly outperforms existing techniques in re
&lt;/p&gt;</description></item></channel></rss>