<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;HiGNN&#65292;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#35843;&#26597;&#33410;&#28857;&#30340;&#37051;&#23621;&#20998;&#24067;&#26469;&#26377;&#25928;&#21033;&#29992;&#24322;&#36136;&#20449;&#24687;&#65292;&#20174;&#32780;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#23398;&#20064;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.17351</link><description>&lt;p&gt;
&#20174;&#24322;&#36136;&#24615;&#23398;&#20064;&#65306;&#24322;&#36136;&#20449;&#24687;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Learn from Heterophily: Heterophilous Information-enhanced Graph Neural Network
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17351
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;HiGNN&#65292;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#35843;&#26597;&#33410;&#28857;&#30340;&#37051;&#23621;&#20998;&#24067;&#26469;&#26377;&#25928;&#21033;&#29992;&#24322;&#36136;&#20449;&#24687;&#65292;&#20174;&#32780;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#23398;&#20064;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24322;&#36136;&#24615;&#29615;&#22659;&#20013;&#65292;Graph Neural Networks (GNNs)&#36890;&#24120;&#34920;&#29616;&#20986;&#27425;&#20248;&#24615;&#33021;&#65292;&#22240;&#20026;&#19981;&#21516;&#26631;&#31614;&#30340;&#33410;&#28857;&#20542;&#21521;&#20110;&#22522;&#20110;&#35821;&#20041;&#21547;&#20041;&#30456;&#36830;&#12290;&#30446;&#21069;&#20851;&#20110;&#22270;&#24322;&#36136;&#24615;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#32858;&#21512;&#26657;&#20934;&#25110;&#37051;&#23621;&#25193;&#23637;&#19978;&#65292;&#36890;&#36807;&#21033;&#29992;&#33410;&#28857;&#29305;&#24449;&#25110;&#32467;&#26500;&#20449;&#24687;&#26469;&#25913;&#21892;GNN&#34920;&#31034;&#20197;&#35299;&#20915;&#24322;&#36136;&#24615;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#24182;&#35777;&#26126;&#20102;&#24322;&#36136;&#24615;&#20013;&#20869;&#22312;&#30340;&#23453;&#36149;&#35821;&#20041;&#20449;&#24687;&#21487;&#20197;&#36890;&#36807;&#35843;&#26597;&#22270;&#20013;&#27599;&#20010;&#21333;&#29420;&#33410;&#28857;&#30340;&#37051;&#23621;&#20998;&#24067;&#26469;&#26377;&#25928;&#22320;&#21033;&#29992;&#22312;&#22270;&#23398;&#20064;&#20013;&#12290;&#36890;&#36807;&#29702;&#35770;&#20998;&#26512;&#65292;&#35770;&#35777;&#20102;&#36825;&#19968;&#29702;&#24565;&#22312;&#22686;&#24378;&#22270;&#23398;&#20064;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#22522;&#20110;&#27492;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;HiGNN&#65292;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#26500;&#24314;&#20102;&#19968;&#20010;&#39069;&#22806;&#30340;&#26032;&#22270;&#32467;&#26500;&#65292;&#36890;&#36807;&#21033;&#29992;&#33410;&#28857;&#20998;&#24067;&#25972;&#21512;&#24322;&#36136;&#20449;&#24687;&#26469;&#22686;&#24378;&#22270;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17351v1 Announce Type: new  Abstract: Under circumstances of heterophily, where nodes with different labels tend to be connected based on semantic meanings, Graph Neural Networks (GNNs) often exhibit suboptimal performance. Current studies on graph heterophily mainly focus on aggregation calibration or neighbor extension and address the heterophily issue by utilizing node features or structural information to improve GNN representations. In this paper, we propose and demonstrate that the valuable semantic information inherent in heterophily can be utilized effectively in graph learning by investigating the distribution of neighbors for each individual node within the graph. The theoretical analysis is carried out to demonstrate the efficacy of the idea in enhancing graph learning. Based on this analysis, we propose HiGNN, an innovative approach that constructs an additional new graph structure, that integrates heterophilous information by leveraging node distribution to enha
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#35299;&#37322;&#21644;&#35782;&#21035;&#20234;&#26031;&#20848;&#25945;&#20167;&#24680;&#35328;&#35770;&#65292;&#27169;&#22411;&#22312;&#20445;&#25345;&#20986;&#33394;&#24615;&#33021;&#30340;&#21516;&#26102;&#33021;&#22815;&#35299;&#37322;&#30456;&#20851;&#24615;&#21644;&#22240;&#26524;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2311.04916</link><description>&lt;p&gt;
&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#35299;&#37322;&#20234;&#26031;&#20848;&#25945;&#20167;&#24680;&#35328;&#35770;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Explainable Identification of Hate Speech towards Islam using Graph Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.04916
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#35299;&#37322;&#21644;&#35782;&#21035;&#20234;&#26031;&#20848;&#25945;&#20167;&#24680;&#35328;&#35770;&#65292;&#27169;&#22411;&#22312;&#20445;&#25345;&#20986;&#33394;&#24615;&#33021;&#30340;&#21516;&#26102;&#33021;&#22815;&#35299;&#37322;&#30456;&#20851;&#24615;&#21644;&#22240;&#26524;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20234;&#26031;&#20848;&#25945;&#20167;&#24680;&#35328;&#35770;&#22312;&#22312;&#32447;&#31038;&#20132;&#20114;&#21160;&#24179;&#21488;&#19978;&#26159;&#19968;&#20010;&#26222;&#36941;&#23384;&#22312;&#30340;&#25361;&#25112;&#12290;&#35782;&#21035;&#21644;&#28040;&#38500;&#36825;&#31181;&#20167;&#24680;&#26159;&#36808;&#21521;&#21644;&#35856;&#19982;&#21644;&#24179;&#26410;&#26469;&#30340;&#20851;&#38190;&#19968;&#27493;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33539;&#20363;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#35782;&#21035;&#21644;&#35299;&#37322;&#38024;&#23545;&#20234;&#26031;&#20848;&#25945;&#30340;&#20167;&#24680;&#35328;&#35770;&#12290;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21457;&#29616;&#12289;&#25552;&#21462;&#24182;&#21033;&#29992;&#19981;&#21516;&#25968;&#25454;&#28857;&#20043;&#38388;&#30340;&#20851;&#31995;&#30340;&#20869;&#22312;&#33021;&#21147;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22987;&#32456;&#33021;&#22815;&#22312;&#20445;&#25345;&#20986;&#33394;&#24615;&#33021;&#30340;&#21516;&#26102;&#25552;&#20379;&#23545;&#28508;&#22312;&#30456;&#20851;&#24615;&#21644;&#22240;&#26524;&#20851;&#31995;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.04916v2 Announce Type: cross  Abstract: Islamophobic language is a prevalent challenge on online social interaction platforms. Identifying and eliminating such hatred is a crucial step towards a future of harmony and peace. This study presents a novel paradigm for identifying and explaining hate speech towards Islam using graph neural networks. Utilizing the intrinsic ability of graph neural networks to find, extract, and use relationships across disparate data points, our model consistently achieves outstanding performance while offering explanations for the underlying correlations and causation.
&lt;/p&gt;</description></item></channel></rss>