<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#26410;&#30693;&#21040;&#36798;&#21644;&#26381;&#21153;&#29575;&#30340;&#25490;&#38431;&#31995;&#32479;&#20013;&#30340;&#20837;&#22330;&#25511;&#21046;&#38382;&#39064;&#12290;&#36890;&#36807;&#35266;&#23519;&#21040;&#21040;&#36798;&#26102;&#38388;&#21644;&#31995;&#32479;&#29366;&#24577;&#65292;&#25105;&#20204;&#26088;&#22312;&#35774;&#35745;&#19968;&#31181;&#35843;&#24230;&#31574;&#30053;&#65292;&#20197;&#26368;&#22823;&#21270;&#35843;&#24230;&#21592;&#30340;&#38271;&#26399;&#24179;&#22343;&#22238;&#25253;&#12290;&#26631;&#20934;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#19981;&#36866;&#29992;&#20110;&#27492;&#38382;&#39064;&#65292;&#22240;&#20026;&#35843;&#24230;&#21592;&#26080;&#27861;&#35266;&#23519;&#21040;&#26381;&#21153;&#26102;&#38388;&#21644;&#31163;&#24320;&#26102;&#38388;&#12290;</title><link>http://arxiv.org/abs/2202.02419</link><description>&lt;p&gt;
&#23398;&#20064;&#20855;&#26377;&#26410;&#30693;&#26381;&#21153;&#29575;&#30340;&#25490;&#38431;&#31995;&#32479;&#20013;&#19968;&#32452;&#31163;&#25955;&#30340;&#26368;&#20248;&#20998;&#37197;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Learning a Discrete Set of Optimal Allocation Rules in a Queueing System with Unknown Service Rate. (arXiv:2202.02419v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.02419
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#26410;&#30693;&#21040;&#36798;&#21644;&#26381;&#21153;&#29575;&#30340;&#25490;&#38431;&#31995;&#32479;&#20013;&#30340;&#20837;&#22330;&#25511;&#21046;&#38382;&#39064;&#12290;&#36890;&#36807;&#35266;&#23519;&#21040;&#21040;&#36798;&#26102;&#38388;&#21644;&#31995;&#32479;&#29366;&#24577;&#65292;&#25105;&#20204;&#26088;&#22312;&#35774;&#35745;&#19968;&#31181;&#35843;&#24230;&#31574;&#30053;&#65292;&#20197;&#26368;&#22823;&#21270;&#35843;&#24230;&#21592;&#30340;&#38271;&#26399;&#24179;&#22343;&#22238;&#25253;&#12290;&#26631;&#20934;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#19981;&#36866;&#29992;&#20110;&#27492;&#38382;&#39064;&#65292;&#22240;&#20026;&#35843;&#24230;&#21592;&#26080;&#27861;&#35266;&#23519;&#21040;&#26381;&#21153;&#26102;&#38388;&#21644;&#31163;&#24320;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24191;&#27867;&#24212;&#29992;&#20110;&#36890;&#20449;&#32593;&#32476;&#12289;&#21628;&#21483;&#20013;&#24515;&#20197;&#21450;&#35774;&#35745;&#29983;&#20135;&#31995;&#32479;&#12289;&#28040;&#24687;&#31995;&#32479;&#21644;&#22522;&#20110;&#24212;&#29992;&#30340;&#20572;&#36710;&#31995;&#32479;&#31561;&#29616;&#20195;&#24212;&#29992;&#39046;&#22495;&#20043;&#22806;&#30340;Erlang-B&#38459;&#22622;&#27169;&#22411;&#20013;&#65292;&#32771;&#34385;&#21040;&#21040;&#36798;&#21644;&#26381;&#21153;&#29575;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#23545;&#35813;&#31995;&#32479;&#30340;&#20837;&#22330;&#25511;&#21046;&#36827;&#34892;&#30740;&#31350;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#22312;&#27599;&#20010;&#20316;&#19994;&#21040;&#36798;&#26102;&#65292;&#35843;&#24230;&#21592;&#20915;&#23450;&#23558;&#20316;&#19994;&#20998;&#37197;&#32473;&#19968;&#20010;&#21487;&#29992;&#30340;&#26381;&#21153;&#22120;&#25110;&#32773;&#38459;&#22622;&#23427;&#12290;&#27599;&#20010;&#24050;&#26381;&#21153;&#30340;&#20316;&#19994;&#20026;&#35843;&#24230;&#21592;&#24102;&#26469;&#20102;&#22266;&#23450;&#30340;&#22238;&#25253;&#65292;&#20294;&#20063;&#23548;&#33268;&#20102;&#27599;&#21333;&#20301;&#26381;&#21153;&#26102;&#38388;&#30340;&#25104;&#26412;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#35774;&#35745;&#19968;&#31181;&#35843;&#24230;&#31574;&#30053;&#65292;&#22522;&#20110;&#20165;&#35266;&#23519;&#21040;&#21040;&#36798;&#26102;&#38388;&#21644;&#27599;&#27425;&#21040;&#36798;&#26102;&#31995;&#32479;&#29366;&#24577;&#30340;&#24773;&#20917;&#65292;&#20174;&#32780;&#26368;&#22823;&#21270;&#35843;&#24230;&#21592;&#30340;&#38271;&#26399;&#24179;&#22343;&#22238;&#25253;&#65292;&#36825;&#21453;&#26144;&#20102;&#23545;&#36825;&#31181;&#31995;&#32479;&#30340;&#29616;&#23454;&#37319;&#26679;&#12290;&#20851;&#38190;&#26159;&#65292;&#35843;&#24230;&#21592;&#26082;&#19981;&#35266;&#23519;&#26381;&#21153;&#26102;&#38388;&#20063;&#19981;&#35266;&#23519;&#31163;&#24320;&#26102;&#38388;&#65292;&#22240;&#27492;&#19981;&#33021;&#24212;&#29992;&#20351;&#29992;&#22870;&#21169;&#20449;&#21495;&#30340;&#26631;&#20934;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#21457;&#23637;&#20102;&#25105;&#20204;&#30340;&#23398;&#20064;&#22522;&#20110;...
&lt;/p&gt;
&lt;p&gt;
Motivated by the wide range of modern applications of the Erlang-B blocking model beyond communication networks and call centers to sizing and pricing in design production systems, messaging systems, and app-based parking systems, we study admission control for such a system but with unknown arrival and service rates. In our model, at every job arrival, a dispatcher decides to assign the job to an available server or block it. Every served job yields a fixed reward for the dispatcher, but it also results in a cost per unit time of service. Our goal is to design a dispatching policy that maximizes the long-term average reward for the dispatcher based on observing only the arrival times and the state of the system at each arrival that reflects a realistic sampling of such systems. Critically, the dispatcher observes neither the service times nor departure times so that standard reinforcement learning-based approaches that use reward signals do not apply. Hence, we develop our learning-ba
&lt;/p&gt;</description></item></channel></rss>