<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#35813;&#30740;&#31350;&#23637;&#31034;&#20102;&#19968;&#31181;&#24378;&#22823;&#26377;&#25928;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#21033;&#29992;&#22768;&#38899;&#29983;&#29289;&#26631;&#24535;&#29289;&#26469;&#39044;&#27979;&#20303;&#38498;&#24515;&#21147;&#34928;&#31469;&#24739;&#32773;&#30340;&#27515;&#20129;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.13812</link><description>&lt;p&gt;
&#22522;&#20110;&#22768;&#38899;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22686;&#24378;&#30340;&#20303;&#38498;&#24515;&#21147;&#34928;&#31469;&#24739;&#32773;&#27515;&#20129;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Voice-Driven Mortality Prediction in Hospitalized Heart Failure Patients: A Machine Learning Approach Enhanced with Diagnostic Biomarkers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13812
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23637;&#31034;&#20102;&#19968;&#31181;&#24378;&#22823;&#26377;&#25928;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#21033;&#29992;&#22768;&#38899;&#29983;&#29289;&#26631;&#24535;&#29289;&#26469;&#39044;&#27979;&#20303;&#38498;&#24515;&#21147;&#34928;&#31469;&#24739;&#32773;&#30340;&#27515;&#20129;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24212;&#23545;&#24515;&#21147;&#34928;&#31469;&#20316;&#20026;&#19968;&#31181;&#26222;&#36941;&#23384;&#22312;&#30340;&#20840;&#29699;&#20581;&#24247;&#38382;&#39064;&#65292;&#23454;&#26045;&#21019;&#26032;&#26041;&#27861;&#20197;&#22686;&#24378;&#24739;&#32773;&#25252;&#29702;&#23384;&#22312;&#22256;&#38590;&#12290;&#29305;&#21035;&#26159;&#22312;&#24515;&#21147;&#34928;&#31469;&#24739;&#32773;&#20013;&#39044;&#27979;&#27515;&#20129;&#29575;&#26082;&#22256;&#38590;&#21448;&#20851;&#38190;&#65292;&#38656;&#35201;&#20010;&#24615;&#21270;&#25252;&#29702;&#12289;&#31215;&#26497;&#31649;&#29702;&#65292;&#24182;&#25903;&#25345;&#30693;&#24773;&#20915;&#31574;&#20197;&#22686;&#24378;&#32467;&#26524;&#12290;&#26368;&#36817;&#65292;&#22768;&#38899;&#29983;&#29289;&#26631;&#24535;&#29289;&#19982;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30456;&#32467;&#21512;&#30340;&#37325;&#35201;&#24615;&#26085;&#30410;&#31361;&#20986;&#65292;&#29305;&#21035;&#22312;&#39044;&#27979;&#24515;&#21147;&#34928;&#31469;&#26041;&#38754;&#34920;&#29616;&#20986;&#26174;&#33879;&#26377;&#25928;&#24615;&#12290;&#22768;&#38899;&#20998;&#26512;&#19982;ML&#31639;&#27861;&#30340;&#21327;&#21516;&#20316;&#29992;&#25552;&#20379;&#20102;&#19968;&#31181;&#38750;&#20405;&#20837;&#24335;&#19988;&#26131;&#20110;&#33719;&#21462;&#30340;&#35780;&#20272;&#24739;&#32773;&#20581;&#24247;&#29366;&#20917;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#38024;&#23545;&#31526;&#21512;&#26631;&#20934;&#21270;&#35821;&#38899;&#21327;&#35758;&#30340;&#24515;&#21147;&#34928;&#31469;&#24739;&#32773;&#39044;&#27979;&#27515;&#20129;&#29575;&#32570;&#20047;&#22768;&#38899;&#29983;&#29289;&#26631;&#24535;&#29289;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#24378;&#22823;&#26377;&#25928;&#30340;ML&#27169;&#22411;&#65292;&#36890;&#36807;&#21033;&#29992;&#22768;&#38899;&#29983;&#29289;&#26631;&#24535;&#29289;&#26469;&#39044;&#27979;&#20303;&#38498;&#24515;&#21147;&#34928;&#31469;&#24739;&#32773;&#30340;&#27515;&#20129;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13812v1 Announce Type: new  Abstract: Addressing heart failure (HF) as a prevalent global health concern poses difficulties in implementing innovative approaches for enhanced patient care. Predicting mortality rates in HF patients, in particular, is difficult yet critical, necessitating individualized care, proactive management, and enabling educated decision-making to enhance outcomes. Recently, the significance of voice biomarkers coupled with Machine Learning (ML) has surged, demonstrating remarkable efficacy, particularly in predicting heart failure. The synergy of voice analysis and ML algorithms provides a non-invasive and easily accessible means to evaluate patients' health. However, there is a lack of voice biomarkers for predicting mortality rates among heart failure patients with standardized speech protocols. Here, we demonstrate a powerful and effective ML model for predicting mortality rates in hospitalized HF patients through the utilization of voice biomarkers
&lt;/p&gt;</description></item></channel></rss>