<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;</title><link>https://arxiv.org/abs/2403.18166</link><description>&lt;p&gt;
&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#20013;&#30340;Vertiport&#39044;&#35746;&#65306;&#22522;&#20110;&#25293;&#21334;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35745;&#26410;&#26469;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#65288;AAM&#65289;&#30340;&#23835;&#36215;&#23558;&#25104;&#20026;&#19968;&#20010;&#25968;&#21313;&#20159;&#32654;&#20803;&#30340;&#20135;&#19994;&#12290;&#24066;&#22330;&#26426;&#21046;&#34987;&#35748;&#20026;&#26159;AAM&#36816;&#33829;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20854;&#20013;&#21253;&#25324;&#20855;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#24322;&#26500;&#36816;&#33829;&#21830;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#35774;&#35745;&#19968;&#31181;&#26426;&#21046;&#26469;&#21327;&#35843;&#30001;&#22810;&#20010;&#20855;&#26377;&#19982;&#20854;&#26426;&#32676;&#20851;&#32852;&#30340;&#24322;&#26500;&#20272;&#20540;&#30340;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#24378;&#21046;&#25191;&#34892;vertiports&#30340;&#21040;&#36798;&#12289;&#31163;&#24320;&#21644;&#20572;&#36710;&#32422;&#26463;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26368;&#22823;&#21270;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#24230;&#37327;&#26631;&#20934;&#65292;&#20174;&#32780;&#21253;&#25324;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#39640;&#20102;&#35774;&#35745;&#36825;&#19968;&#26426;&#21046;&#30340;&#35745;&#31639;&#21487;&#22788;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18166v1 Announce Type: cross  Abstract: The rise of advanced air mobility (AAM) is expected to become a multibillion-dollar industry in the near future. Market-based mechanisms are touted to be an integral part of AAM operations, which comprise heterogeneous operators with private valuations. In this work, we study the problem of designing a mechanism to coordinate the movement of electric vertical take-off and landing (eVTOL) aircraft, operated by multiple operators each having heterogeneous valuations associated with their fleet, between vertiports, while enforcing the arrival, departure, and parking constraints at vertiports. Particularly, we propose an incentive-compatible and individually rational vertiport reservation mechanism that maximizes a social welfare metric, which encapsulates the objective of maximizing the overall valuations of all operators while minimizing the congestion at vertiports. Additionally, we improve the computational tractability of designing th
&lt;/p&gt;</description></item><item><title>&#25506;&#32034;&#19968;&#31181;&#22312;&#21160;&#24577;&#28216;&#25103;&#20013;&#23558;&#25968;&#25454;&#39537;&#21160;&#21442;&#32771;&#25919;&#31574;&#19982;&#22522;&#20110;&#20248;&#21270;&#21338;&#24328;&#25919;&#31574;&#30456;&#34701;&#21512;&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21512;&#20316;&#21160;&#24577;&#21338;&#24328;KLGame&#65292;&#20854;&#20013;&#21253;&#21547;&#20102;&#38024;&#23545;&#27599;&#20010;&#20915;&#31574;&#32773;&#30340;&#21487;&#35843;&#21442;&#25968;&#12290;</title><link>https://arxiv.org/abs/2402.14174</link><description>&lt;p&gt;
&#22312;&#21160;&#24577;&#28216;&#25103;&#20013;&#34701;&#21512;&#25968;&#25454;&#39537;&#21160;&#30340;&#20808;&#39564;&#30693;&#35782;
&lt;/p&gt;
&lt;p&gt;
Blending Data-Driven Priors in Dynamic Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14174
&lt;/p&gt;
&lt;p&gt;
&#25506;&#32034;&#19968;&#31181;&#22312;&#21160;&#24577;&#28216;&#25103;&#20013;&#23558;&#25968;&#25454;&#39537;&#21160;&#21442;&#32771;&#25919;&#31574;&#19982;&#22522;&#20110;&#20248;&#21270;&#21338;&#24328;&#25919;&#31574;&#30456;&#34701;&#21512;&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21512;&#20316;&#21160;&#24577;&#21338;&#24328;KLGame&#65292;&#20854;&#20013;&#21253;&#21547;&#20102;&#38024;&#23545;&#27599;&#20010;&#20915;&#31574;&#32773;&#30340;&#21487;&#35843;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#26234;&#33021;&#26426;&#22120;&#20154;&#22914;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#22312;&#20154;&#32676;&#20013;&#30340;&#37096;&#32626;&#36234;&#26469;&#36234;&#22810;&#65292;&#36825;&#20123;&#31995;&#32479;&#24212;&#35813;&#22312;&#23433;&#20840;&#30340;&#12289;&#19982;&#20154;&#20114;&#21160;&#24847;&#35782;&#30456;&#20851;&#30340;&#36816;&#21160;&#35268;&#21010;&#20013;&#21033;&#29992;&#22522;&#20110;&#27169;&#22411;&#30340;&#21338;&#24328;&#35770;&#35268;&#21010;&#22120;&#19982;&#25968;&#25454;&#39537;&#21160;&#25919;&#31574;&#30340;&#31243;&#24230;&#20173;&#28982;&#26159;&#19968;&#20010;&#24748;&#32780;&#26410;&#20915;&#30340;&#38382;&#39064;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#19968;&#31181;&#34701;&#21512;&#25968;&#25454;&#39537;&#21160;&#21442;&#32771;&#25919;&#31574;&#21644;&#22522;&#20110;&#20248;&#21270;&#30340;&#21338;&#24328;&#35770;&#25919;&#31574;&#30340;&#21407;&#21017;&#24615;&#26041;&#27861;&#12290;&#25105;&#20204;&#21046;&#23450;&#20102;KLGame&#65292;&#36825;&#26159;&#19968;&#31181;&#24102;&#26377;Kullback-Leibler&#65288;KL&#65289;&#27491;&#21017;&#21270;&#30340;&#38750;&#21512;&#20316;&#21160;&#24577;&#21338;&#24328;&#65292;&#38024;&#23545;&#19968;&#20010;&#19968;&#33324;&#30340;&#12289;&#38543;&#26426;&#30340;&#65292;&#21487;&#33021;&#26159;&#22810;&#27169;&#24335;&#30340;&#21442;&#32771;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14174v1 Announce Type: cross  Abstract: As intelligent robots like autonomous vehicles become increasingly deployed in the presence of people, the extent to which these systems should leverage model-based game-theoretic planners versus data-driven policies for safe, interaction-aware motion planning remains an open question. Existing dynamic game formulations assume all agents are task-driven and behave optimally. However, in reality, humans tend to deviate from the decisions prescribed by these models, and their behavior is better approximated under a noisy-rational paradigm. In this work, we investigate a principled methodology to blend a data-driven reference policy with an optimization-based game-theoretic policy. We formulate KLGame, a type of non-cooperative dynamic game with Kullback-Leibler (KL) regularization with respect to a general, stochastic, and possibly multi-modal reference policy. Our method incorporates, for each decision maker, a tunable parameter that pe
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#20027;&#21160;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#31454;&#20105;&#24615;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#21644;&#25511;&#21046;&#38382;&#39064;&#12290;&#36890;&#36807;&#37325;&#26500;&#31169;&#26377;&#31574;&#30053;&#21644;&#39044;&#27979;&#31283;&#24577;&#34892;&#21160;&#37197;&#32622;&#25991;&#20214;&#65292;&#22806;&#37096;&#35266;&#23519;&#32773;&#21487;&#20197;&#25104;&#21151;&#36827;&#34892;&#39044;&#27979;&#21644;&#20248;&#21270;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2212.12561</link><description>&lt;p&gt;
&#35299;&#20915;&#31454;&#20105;&#24615;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#21644;&#25511;&#21046;&#38382;&#39064;&#30340;&#20027;&#21160;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
An active learning method for solving competitive multi-agent decision-making and control problems. (arXiv:2212.12561v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.12561
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#20027;&#21160;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#31454;&#20105;&#24615;&#22810;&#26234;&#33021;&#20307;&#20915;&#31574;&#21644;&#25511;&#21046;&#38382;&#39064;&#12290;&#36890;&#36807;&#37325;&#26500;&#31169;&#26377;&#31574;&#30053;&#21644;&#39044;&#27979;&#31283;&#24577;&#34892;&#21160;&#37197;&#32622;&#25991;&#20214;&#65292;&#22806;&#37096;&#35266;&#23519;&#32773;&#21487;&#20197;&#25104;&#21151;&#36827;&#34892;&#39044;&#27979;&#21644;&#20248;&#21270;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20027;&#21160;&#23398;&#20064;&#30340;&#26041;&#26696;&#65292;&#29992;&#20110;&#37325;&#26500;&#30001;&#30456;&#20114;&#20316;&#29992;&#20195;&#29702;&#20154;&#32676;&#20307;&#25191;&#34892;&#30340;&#31169;&#26377;&#31574;&#30053;&#65292;&#24182;&#39044;&#27979;&#24213;&#23618;&#22810;&#26234;&#33021;&#20307;&#20132;&#20114;&#36807;&#31243;&#30340;&#30830;&#20999;&#32467;&#26524;&#65292;&#36825;&#37324;&#34987;&#35748;&#20026;&#26159;&#19968;&#20010;&#31283;&#23450;&#30340;&#34892;&#21160;&#37197;&#32622;&#25991;&#20214;&#12290;&#25105;&#20204;&#35774;&#24819;&#20102;&#19968;&#20010;&#22330;&#26223;&#65292;&#22312;&#36825;&#20010;&#22330;&#26223;&#20013;&#65292;&#19968;&#20010;&#20855;&#26377;&#23398;&#20064;&#31243;&#24207;&#30340;&#22806;&#37096;&#35266;&#23519;&#32773;&#21487;&#20197;&#36890;&#36807;&#31169;&#26377;&#30340;&#34892;&#21160;-&#21453;&#24212;&#26144;&#23556;&#36827;&#34892;&#26597;&#35810;&#21644;&#35266;&#23519;&#20195;&#29702;&#20154;&#30340;&#21453;&#24212;&#65292;&#38598;&#20307;&#30340;&#19981;&#21160;&#28857;&#23545;&#24212;&#20110;&#19968;&#20010;&#31283;&#24577;&#37197;&#32622;&#25991;&#20214;&#12290;&#36890;&#36807;&#36845;&#20195;&#22320;&#25910;&#38598;&#26377;&#24847;&#20041;&#30340;&#25968;&#25454;&#21644;&#26356;&#26032;&#34892;&#21160;-&#21453;&#24212;&#26144;&#23556;&#30340;&#21442;&#25968;&#20272;&#35745;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#35780;&#20272;&#25152;&#25552;&#20986;&#30340;&#20027;&#21160;&#23398;&#20064;&#26041;&#27861;&#30340;&#28176;&#36817;&#24615;&#36136;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20197;&#20415;&#22914;&#26524;&#25910;&#25947;&#21457;&#29983;&#65292;&#23427;&#21482;&#33021;&#26397;&#21521;&#19968;&#20010;&#31283;&#24577;&#34892;&#21160;&#37197;&#32622;&#25991;&#20214;&#12290;&#36825;&#19968;&#20107;&#23454;&#23548;&#33268;&#20102;&#20004;&#20010;&#20027;&#35201;&#32467;&#26524;&#65306;i&#65289;&#23398;&#20064;&#23616;&#37096;&#31934;&#30830;&#30340;&#34892;&#21160;-&#21453;&#24212;&#26144;&#23556;&#26367;&#20195;&#29289;&#20351;&#24471;&#22806;&#37096;&#35266;&#23519;&#32773;&#33021;&#22815;&#25104;&#21151;&#23436;&#25104;&#20854;&#39044;&#27979;&#20219;&#21153;&#65292;ii&#65289;&#19982;&#20195;&#29702;&#20154;&#30340;&#20114;&#21160;&#25552;&#20379;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#20248;&#21270;&#31574;&#30053;&#20197;&#36798;&#21040;&#26368;&#20339;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a scheme based on active learning to reconstruct private strategies executed by a population of interacting agents and predict an exact outcome of the underlying multi-agent interaction process, here identified as a stationary action profile. We envision a scenario where an external observer, endowed with a learning procedure, can make queries and observe the agents' reactions through private action-reaction mappings, whose collective fixed point corresponds to a stationary profile. By iteratively collecting sensible data and updating parametric estimates of the action-reaction mappings, we establish sufficient conditions to assess the asymptotic properties of the proposed active learning methodology so that, if convergence happens, it can only be towards a stationary action profile. This fact yields two main consequences: i) learning locally-exact surrogates of the action-reaction mappings allows the external observer to succeed in its prediction task, and ii) working with 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#20351;&#29992;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#26469;&#25913;&#36827;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#21453;&#39304;&#24490;&#29615;&#36845;&#20195;&#22320;&#25913;&#36827;&#39044;&#27979;&#22120;&#65292;&#23454;&#29616;&#20102;&#23545;&#26426;&#32452;&#32452;&#21512;&#30340;&#26368;&#20339;&#25805;&#20316;&#12290;</title><link>http://arxiv.org/abs/2208.13065</link><description>&lt;p&gt;
&#25913;&#21892;&#36816;&#33829;&#32463;&#27982;&#23398;&#65306;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#26469;&#39044;&#27979;&#26426;&#32452;&#32452;&#21512;&#30340;&#25805;&#20316;&#35745;&#21010;
&lt;/p&gt;
&lt;p&gt;
Towards Improving Operation Economics: A Bilevel MIP-Based Closed-Loop Predict-and-Optimize Framework for Prescribing Unit Commitment. (arXiv:2208.13065v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.13065
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#20351;&#29992;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#26469;&#25913;&#36827;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#21453;&#39304;&#24490;&#29615;&#36845;&#20195;&#22320;&#25913;&#36827;&#39044;&#27979;&#22120;&#65292;&#23454;&#29616;&#20102;&#23545;&#26426;&#32452;&#32452;&#21512;&#30340;&#26368;&#20339;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#24120;&#65292;&#31995;&#32479;&#25805;&#20316;&#21592;&#22312;&#24320;&#29615;&#39044;&#27979;&#20248;&#21270;&#36807;&#31243;&#20013;&#36827;&#34892;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#65306;&#39318;&#20808;&#39044;&#27979;&#21487;&#20877;&#29983;&#33021;&#28304;(RES)&#30340;&#21487;&#29992;&#24615;&#21644;&#31995;&#32479;&#20648;&#22791;&#38656;&#27714;&#65307;&#26681;&#25454;&#36825;&#20123;&#39044;&#27979;&#65292;&#31995;&#32479;&#25805;&#20316;&#21592;&#35299;&#20915;&#35832;&#22914;&#26426;&#32452;&#32452;&#21512;(UC)&#30340;&#20248;&#21270;&#27169;&#22411;&#65292;&#20197;&#30830;&#23450;&#30456;&#24212;&#30340;&#32463;&#27982;&#36816;&#34892;&#35745;&#21010;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#24320;&#29615;&#36807;&#31243;&#21487;&#33021;&#20250;&#23454;&#36136;&#24615;&#22320;&#25439;&#23475;&#25805;&#20316;&#32463;&#27982;&#24615;&#65292;&#22240;&#20026;&#23427;&#30340;&#39044;&#27979;&#22120;&#30446;&#20809;&#30701;&#27973;&#22320;&#23547;&#27714;&#25913;&#21892;&#21363;&#26102;&#30340;&#32479;&#35745;&#39044;&#27979;&#35823;&#24046;&#65292;&#32780;&#19981;&#26159;&#26368;&#32456;&#30340;&#25805;&#20316;&#25104;&#26412;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#25552;&#20379;&#19968;&#31181;&#39044;&#27979;&#26426;&#32452;&#32452;&#21512;&#20197;&#25913;&#21892;&#25805;&#20316;&#32463;&#27982;&#24615;&#30340;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#21033;&#29992;&#21452;&#23618;&#28151;&#21512;&#25972;&#25968;&#35268;&#21010;&#27169;&#22411;&#38024;&#23545;&#26368;&#20339;&#31995;&#32479;&#25805;&#20316;&#35757;&#32451;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#12290;&#19978;&#23618;&#22522;&#20110;&#20854;&#24341;&#36215;&#30340;&#25805;&#20316;&#25104;&#26412;&#26469;&#35757;&#32451; RES &#21644;&#20648;&#22791;&#39044;&#27979;&#22120;&#65307;&#19979;&#23618;&#21017;&#22312;&#32473;&#23450;&#39044;&#27979;&#30340; RES &#21644;&#20648;&#22791;&#30340;&#24773;&#20917;&#19979;&#65292;&#20381;&#25454;&#26368;&#20339;&#25805;&#20316;&#21407;&#21017;&#27714;&#35299; UC&#12290;&#36825;&#20004;&#20010;&#23618;&#32423;&#36890;&#36807;&#21453;&#39304;&#29615;&#36335;&#36827;&#34892;&#20132;&#20114;&#24615;&#20114;&#21160;&#65292;&#30452;&#21040;&#25910;&#25947;&#20026;&#27490;&#12290;&#22312;&#20462;&#25913;&#21518;&#30340;IEEE 24-bus&#31995;&#32479;&#19978;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#19982;&#19977;&#31181;&#26368;&#20808;&#36827;&#30340; UC &#22522;&#20934;&#32447;&#30456;&#27604;&#65292;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#20855;&#26377;&#39640;&#25928;&#24615;&#21644;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generally, system operators conduct the economic operation of power systems in an open-loop predict-then-optimize process: the renewable energy source (RES) availability and system reserve requirements are first predicted; given the predictions, system operators solve optimization models such as unit commitment (UC) to determine the economical operation plans accordingly. However, such an open-loop process could essentially compromise the operation economics because its predictors myopically seek to improve the immediate statistical prediction errors instead of the ultimate operation cost. To this end, this paper presents a closed-loop predict-and-optimize framework, offering a prescriptive UC to improve the operation economics. First, a bilevel mixed-integer programming model is leveraged to train cost-oriented predictors tailored for optimal system operations: the upper level trains the RES and reserve predictors based on their induced operation cost; the lower level, with given pred
&lt;/p&gt;</description></item></channel></rss>