<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#22522;&#20110;&#35889;&#22270;&#29702;&#35770;&#30340;&#38142;&#25509;&#25512;&#33616;&#31639;&#27861;ERA-Link&#65292;&#26088;&#22312;&#32531;&#35299;&#29616;&#26377;&#25512;&#33616;&#31639;&#27861;&#24102;&#26469;&#30340;&#20449;&#24687;&#23396;&#23707;&#21644;&#31038;&#20250;&#25104;&#35265;&#65292;&#23454;&#29616;&#31038;&#20132;&#32593;&#32476;&#24179;&#21488;&#30340;&#31038;&#20250;&#27491;&#20041;&#30446;&#26631;&#12290;</title><link>http://arxiv.org/abs/2305.03223</link><description>&lt;p&gt;
&#31038;&#20250;&#27491;&#20041;&#31639;&#27861;&#65306;&#31038;&#20132;&#32593;&#32476;&#20013;&#30340;&#24179;&#26435;&#34892;&#21160;
&lt;/p&gt;
&lt;p&gt;
Algorithms for Social Justice: Affirmative Action in Social Networks. (arXiv:2305.03223v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03223
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#22522;&#20110;&#35889;&#22270;&#29702;&#35770;&#30340;&#38142;&#25509;&#25512;&#33616;&#31639;&#27861;ERA-Link&#65292;&#26088;&#22312;&#32531;&#35299;&#29616;&#26377;&#25512;&#33616;&#31639;&#27861;&#24102;&#26469;&#30340;&#20449;&#24687;&#23396;&#23707;&#21644;&#31038;&#20250;&#25104;&#35265;&#65292;&#23454;&#29616;&#31038;&#20132;&#32593;&#32476;&#24179;&#21488;&#30340;&#31038;&#20250;&#27491;&#20041;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38142;&#25509;&#25512;&#33616;&#31639;&#27861;&#23545;&#20110;&#19990;&#30028;&#21508;&#22320;&#25968;&#21313;&#20159;&#29992;&#25143;&#30340;&#20154;&#38469;&#20851;&#31995;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;&#20026;&#20102;&#26368;&#22823;&#21270;&#30456;&#20851;&#24615;&#65292;&#23427;&#20204;&#36890;&#24120;&#24314;&#35758;&#36830;&#25509;&#30456;&#20114;&#30456;&#20284;&#30340;&#29992;&#25143;&#12290;&#28982;&#32780;&#65292;&#36825;&#34987;&#21457;&#29616;&#20250;&#20135;&#29983;&#20449;&#24687;&#23396;&#23707;&#65292;&#21152;&#21095;&#24369;&#21183;&#31361;&#20986;&#32676;&#20307;&#25152;&#36973;&#21463;&#30340;&#23396;&#31435;&#65292;&#24182;&#24310;&#32493;&#31038;&#20250;&#25104;&#35265;&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#20123;&#38480;&#21046;&#65292;&#22823;&#37327;&#30740;&#31350;&#33268;&#21147;&#20110;&#23454;&#29616;&#20844;&#24179;&#30340;&#38142;&#25509;&#25512;&#33616;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#26041;&#27861;&#24182;&#19981;&#36136;&#30097;&#38142;&#25509;&#25512;&#33616;&#31639;&#27861;&#30340;&#26368;&#32456;&#30446;&#26631;&#65292;&#21363;&#25968;&#25454;&#20132;&#26131;&#30340;&#22797;&#26434;&#21830;&#19994;&#27169;&#22411;&#20013;&#29992;&#25143;&#21442;&#19982;&#30340;&#36135;&#24065;&#21270;&#12290;&#26412;&#25991;&#20027;&#24352;&#23454;&#29616;&#31038;&#20132;&#32593;&#32476;&#24179;&#21488;&#29609;&#23478;&#21644;&#30446;&#30340;&#30340;&#22810;&#26679;&#21270;&#65292;&#20197;&#23454;&#29616;&#31038;&#20250;&#27491;&#20041;&#12290;&#20026;&#20102;&#35828;&#26126;&#36825;&#19968;&#27010;&#24565;&#30446;&#26631;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;ERA-Link&#65292;&#36825;&#26159;&#19968;&#31181;&#22522;&#20110;&#35889;&#22270;&#29702;&#35770;&#30340;&#26032;&#22411;&#38142;&#25509;&#25512;&#33616;&#31639;&#27861;&#65292;&#21487;&#20197;&#25269;&#28040;&#31995;&#32479;&#24615;&#30340;&#31038;&#20250;&#27495;&#35270;&#12290;
&lt;/p&gt;
&lt;p&gt;
Link recommendation algorithms contribute to shaping human relations of billions of users worldwide in social networks. To maximize relevance, they typically propose connecting users that are similar to each other. This has been found to create information silos, exacerbating the isolation suffered by vulnerable salient groups and perpetuating societal stereotypes. To mitigate these limitations, a significant body of work has been devoted to the implementation of fair link recommendation methods. However, most approaches do not question the ultimate goal of link recommendation algorithms, namely the monetization of users' engagement in intricate business models of data trade. This paper advocates for a diversification of players and purposes of social network platforms, aligned with the pursue of social justice. To illustrate this conceptual goal, we present ERA-Link, a novel link recommendation algorithm based on spectral graph theory that counteracts the systemic societal discriminat
&lt;/p&gt;</description></item></channel></rss>