<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;&#31181;&#29305;&#24449;&#21644;&#27880;&#24847;&#26426;&#21046;&#26469;&#20272;&#35745;&#22768;&#28304;&#30340;&#20301;&#32622;&#21644;&#31867;&#21035;&#65292;&#21253;&#25324;&#24341;&#20837;"&#22768;&#38899;&#22320;&#22270;"&#29305;&#24449;&#12289;&#20351;&#29992;Gammatone&#28388;&#27874;&#22120;&#29983;&#25104;&#26356;&#36866;&#21512;&#23460;&#22806;&#29615;&#22659;&#30340;&#22768;&#23398;&#29305;&#24449;&#65292;&#20197;&#21450;&#38598;&#25104;&#27880;&#24847;&#26426;&#21046;&#26469;&#23398;&#20064;&#36890;&#36947;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.20130</link><description>&lt;p&gt;
&#22312;&#23460;&#22806;&#29615;&#22659;&#20013;&#20351;&#29992;WASN&#36827;&#34892;&#22768;&#20107;&#20214;&#23450;&#20301;&#21644;&#20998;&#31867;
&lt;/p&gt;
&lt;p&gt;
Sound event localization and classification using WASN in Outdoor Environment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.20130
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;&#31181;&#29305;&#24449;&#21644;&#27880;&#24847;&#26426;&#21046;&#26469;&#20272;&#35745;&#22768;&#28304;&#30340;&#20301;&#32622;&#21644;&#31867;&#21035;&#65292;&#21253;&#25324;&#24341;&#20837;"&#22768;&#38899;&#22320;&#22270;"&#29305;&#24449;&#12289;&#20351;&#29992;Gammatone&#28388;&#27874;&#22120;&#29983;&#25104;&#26356;&#36866;&#21512;&#23460;&#22806;&#29615;&#22659;&#30340;&#22768;&#23398;&#29305;&#24449;&#65292;&#20197;&#21450;&#38598;&#25104;&#27880;&#24847;&#26426;&#21046;&#26469;&#23398;&#20064;&#36890;&#36947;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#22768;&#20107;&#20214;&#23450;&#20301;&#21644;&#20998;&#31867;&#26159;&#26080;&#32447;&#22768;&#23398;&#20256;&#24863;&#22120;&#32593;&#32476;&#20013;&#30340;&#26032;&#20852;&#30740;&#31350;&#39046;&#22495;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#22768;&#20107;&#20214;&#23450;&#20301;&#21644;&#20998;&#31867;&#26041;&#27861;&#36890;&#24120;&#20381;&#36182;&#20110;&#21333;&#20010;&#40614;&#20811;&#39118;&#38453;&#21015;&#65292;&#23481;&#26131;&#21463;&#21040;&#20449;&#21495;&#34928;&#20943;&#21644;&#29615;&#22659;&#22122;&#38899;&#30340;&#24433;&#21709;&#65292;&#36825;&#38480;&#21046;&#20102;&#23427;&#20204;&#30340;&#30417;&#27979;&#33539;&#22260;&#12290;&#27492;&#22806;&#65292;&#20351;&#29992;&#22810;&#20010;&#40614;&#20811;&#39118;&#38453;&#21015;&#30340;&#26041;&#27861;&#36890;&#24120;&#21482;&#20851;&#27880;&#28304;&#23450;&#20301;&#65292;&#24573;&#30053;&#20102;&#22768;&#20107;&#20214;&#20998;&#31867;&#26041;&#38754;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;&#31181;&#29305;&#24449;&#21644;&#27880;&#24847;&#26426;&#21046;&#26469;&#20272;&#35745;&#22768;&#28304;&#30340;&#20301;&#32622;&#21644;&#31867;&#21035;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;"&#22768;&#38899;&#22320;&#22270;"&#29305;&#24449;&#65292;&#20197;&#25429;&#33719;&#22810;&#20010;&#39057;&#27573;&#30340;&#31354;&#38388;&#20449;&#24687;&#12290;&#25105;&#20204;&#36824;&#20351;&#29992;Gammatone&#28388;&#27874;&#22120;&#29983;&#25104;&#26356;&#36866;&#21512;&#23460;&#22806;&#29615;&#22659;&#30340;&#22768;&#23398;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#38598;&#25104;&#20102;&#27880;&#24847;&#26426;&#21046;&#26469;&#23398;&#20064;&#36890;&#36947;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.20130v1 Announce Type: cross  Abstract: Deep learning-based sound event localization and classification is an emerging research area within wireless acoustic sensor networks. However, current methods for sound event localization and classification typically rely on a single microphone array, making them susceptible to signal attenuation and environmental noise, which limits their monitoring range. Moreover, methods using multiple microphone arrays often focus solely on source localization, neglecting the aspect of sound event classification. In this paper, we propose a deep learning-based method that employs multiple features and attention mechanisms to estimate the location and class of sound source. We introduce a Soundmap feature to capture spatial information across multiple frequency bands. We also use the Gammatone filter to generate acoustic features more suitable for outdoor environments. Furthermore, we integrate attention mechanisms to learn channel-wise relationsh
&lt;/p&gt;</description></item></channel></rss>