<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#29992;&#20110;Blizzard Challenge 2023&#30340;&#27861;&#35821;&#25991;&#26412;&#21040;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#65292;&#36890;&#36807;&#23545;&#25968;&#25454;&#30340;&#31579;&#36873;&#21644;&#22686;&#24378;&#65292;&#20197;&#21450;&#28155;&#21152;&#35789;&#36793;&#30028;&#21644;&#36215;&#22987;/&#32467;&#26463;&#31526;&#21495;&#30340;&#26041;&#24335;&#65292;&#25552;&#39640;&#20102;&#35821;&#38899;&#36136;&#37327;&#24182;&#36827;&#34892;&#20102;&#26631;&#20934;&#21270;&#36716;&#24405;&#12290;</title><link>http://arxiv.org/abs/2309.00223</link><description>&lt;p&gt;
FruitShell&#27861;&#35821;&#21512;&#25104;&#31995;&#32479;&#22312;Blizzard 2023&#25361;&#25112;&#36187;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
The FruitShell French synthesis system at the Blizzard 2023 Challenge. (arXiv:2309.00223v1 [eess.AS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00223
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#29992;&#20110;Blizzard Challenge 2023&#30340;&#27861;&#35821;&#25991;&#26412;&#21040;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#65292;&#36890;&#36807;&#23545;&#25968;&#25454;&#30340;&#31579;&#36873;&#21644;&#22686;&#24378;&#65292;&#20197;&#21450;&#28155;&#21152;&#35789;&#36793;&#30028;&#21644;&#36215;&#22987;/&#32467;&#26463;&#31526;&#21495;&#30340;&#26041;&#24335;&#65292;&#25552;&#39640;&#20102;&#35821;&#38899;&#36136;&#37327;&#24182;&#36827;&#34892;&#20102;&#26631;&#20934;&#21270;&#36716;&#24405;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#29992;&#20110;Blizzard Challenge 2023&#30340;&#27861;&#35821;&#25991;&#26412;&#21040;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#12290;&#35813;&#25361;&#25112;&#21253;&#25324;&#20004;&#20010;&#20219;&#21153;&#65306;&#20174;&#22899;&#24615;&#28436;&#35762;&#32773;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#35821;&#38899;&#21644;&#29983;&#25104;&#19982;&#29305;&#23450;&#20010;&#20307;&#30456;&#20284;&#30340;&#35821;&#38899;&#12290;&#20851;&#20110;&#27604;&#36187;&#25968;&#25454;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#31579;&#36873;&#36807;&#31243;&#65292;&#21435;&#38500;&#20102;&#32570;&#22833;&#25110;&#38169;&#35823;&#30340;&#25991;&#26412;&#25968;&#25454;&#12290;&#25105;&#20204;&#23545;&#38500;&#38899;&#32032;&#20197;&#22806;&#30340;&#25152;&#26377;&#31526;&#21495;&#36827;&#34892;&#20102;&#25972;&#29702;&#65292;&#24182;&#28040;&#38500;&#20102;&#27809;&#26377;&#21457;&#38899;&#25110;&#25345;&#32493;&#26102;&#38388;&#20026;&#38646;&#30340;&#31526;&#21495;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#22312;&#25991;&#26412;&#20013;&#28155;&#21152;&#20102;&#35789;&#36793;&#30028;&#21644;&#36215;&#22987;/&#32467;&#26463;&#31526;&#21495;&#65292;&#26681;&#25454;&#25105;&#20204;&#20043;&#21069;&#30340;&#32463;&#39564;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#26679;&#21487;&#20197;&#25552;&#39640;&#35821;&#38899;&#36136;&#37327;&#12290;&#23545;&#20110;Spoke&#20219;&#21153;&#65292;&#25105;&#20204;&#26681;&#25454;&#27604;&#36187;&#35268;&#21017;&#36827;&#34892;&#20102;&#25968;&#25454;&#22686;&#24378;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#20010;&#24320;&#28304;&#30340;G2P&#27169;&#22411;&#23558;&#27861;&#35821;&#25991;&#26412;&#36716;&#24405;&#20026;&#38899;&#32032;&#12290;&#30001;&#20110;G2P&#27169;&#22411;&#20351;&#29992;&#22269;&#38469;&#38899;&#26631;&#65288;IPA&#65289;&#65292;&#25105;&#20204;&#23545;&#25552;&#20379;&#30340;&#27604;&#36187;&#25968;&#25454;&#24212;&#29992;&#20102;&#30456;&#21516;&#30340;&#36716;&#24405;&#36807;&#31243;&#65292;&#20197;&#36827;&#34892;&#26631;&#20934;&#21270;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#32534;&#35793;&#22120;&#23545;&#26576;&#20123;&#25216;&#26415;&#38480;&#21046;&#30340;&#35782;&#21035;&#33021;&#21147;&#26377;&#38480;&#65292;&#25152;&#20197;&#25105;&#20204;&#20026;&#20102;&#20445;&#25345;&#31454;&#20105;&#30340;&#20844;&#27491;&#65292;&#23558;&#25968;&#25454;&#25353;&#38899;&#26631;&#21010;&#20998;&#20026;&#19981;&#21516;&#30340;&#29255;&#27573;&#36827;&#34892;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a French text-to-speech synthesis system for the Blizzard Challenge 2023. The challenge consists of two tasks: generating high-quality speech from female speakers and generating speech that closely resembles specific individuals. Regarding the competition data, we conducted a screening process to remove missing or erroneous text data. We organized all symbols except for phonemes and eliminated symbols that had no pronunciation or zero duration. Additionally, we added word boundary and start/end symbols to the text, which we have found to improve speech quality based on our previous experience. For the Spoke task, we performed data augmentation according to the competition rules. We used an open-source G2P model to transcribe the French texts into phonemes. As the G2P model uses the International Phonetic Alphabet (IPA), we applied the same transcription process to the provided competition data for standardization. However, due to compiler limitations in recognizing 
&lt;/p&gt;</description></item></channel></rss>