<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26102;&#38388;&#20998;&#23618;&#26550;&#26500;&#65292;&#21033;&#29992;&#26102;&#38388;&#25277;&#35937;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#36830;&#32493;&#25511;&#21046;&#65292;&#20855;&#26377;&#33410;&#33021;&#12289;&#25345;&#32493;&#25506;&#32034;&#12289;&#20943;&#23569;&#20915;&#31574;&#12289;&#20943;&#23569;&#25238;&#21160;&#21644;&#22686;&#21152;&#21160;&#20316;&#37325;&#22797;&#31561;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2305.18701</link><description>&lt;p&gt;
&#39640;&#25928;&#36830;&#32493;&#25511;&#21046;&#30340;&#26102;&#38388;&#20998;&#23618;&#26550;&#26500;
&lt;/p&gt;
&lt;p&gt;
Temporally Layered Architecture for Efficient Continuous Control. (arXiv:2305.18701v2 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18701
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26102;&#38388;&#20998;&#23618;&#26550;&#26500;&#65292;&#21033;&#29992;&#26102;&#38388;&#25277;&#35937;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#36830;&#32493;&#25511;&#21046;&#65292;&#20855;&#26377;&#33410;&#33021;&#12289;&#25345;&#32493;&#25506;&#32034;&#12289;&#20943;&#23569;&#20915;&#31574;&#12289;&#20943;&#23569;&#25238;&#21160;&#21644;&#22686;&#21152;&#21160;&#20316;&#37325;&#22797;&#31561;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26102;&#38388;&#20998;&#23618;&#26550;&#26500;&#65288;TLA&#65289;&#65292;&#29992;&#20110;&#20855;&#26377;&#26368;&#23567;&#33021;&#37327;&#28040;&#32791;&#30340;&#26102;&#38388;&#33258;&#36866;&#24212;&#25511;&#21046;&#12290;TLA&#23558;&#24555;&#36895;&#31574;&#30053;&#21644;&#24930;&#36895;&#31574;&#30053;&#23618;&#21472;&#22312;&#19968;&#36215;&#65292;&#23454;&#29616;&#26102;&#38388;&#25277;&#35937;&#65292;&#20351;&#27599;&#20010;&#23618;&#21487;&#20197;&#19987;&#27880;&#20110;&#19981;&#21516;&#30340;&#26102;&#38388;&#23610;&#24230;&#12290;&#25105;&#20204;&#30340;&#35774;&#35745;&#20511;&#37492;&#20102;&#20154;&#33041;&#30340;&#33410;&#33021;&#26426;&#21046;&#65292;&#26681;&#25454;&#29615;&#22659;&#38656;&#27714;&#22312;&#19981;&#21516;&#30340;&#26102;&#38388;&#23610;&#24230;&#19978;&#25191;&#34892;&#21160;&#20316;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;TLA&#38500;&#20102;&#33410;&#33021;&#20043;&#22806;&#65292;&#36824;&#25552;&#20379;&#20102;&#35768;&#22810;&#39069;&#22806;&#30340;&#20248;&#21183;&#65292;&#21253;&#25324;&#25345;&#32493;&#25506;&#32034;&#12289;&#20943;&#23569;&#38656;&#27714;&#20915;&#31574;&#12289;&#20943;&#23569;&#25238;&#21160;&#21644;&#22686;&#21152;&#21160;&#20316;&#37325;&#22797;&#12290;&#25105;&#20204;&#22312;&#19968;&#31995;&#21015;&#36830;&#32493;&#25511;&#21046;&#20219;&#21153;&#19978;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;TLA&#22312;&#22810;&#20010;&#37325;&#35201;&#25351;&#26631;&#19978;&#30456;&#23545;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#26174;&#33879;&#20248;&#21183;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#22810;&#30446;&#26631;&#35780;&#20998;&#26469;&#23450;&#24615;&#35780;&#20272;&#36830;&#32493;&#25511;&#21046;&#31574;&#30053;&#65292;&#24182;&#23637;&#31034;&#20102;TLA&#20855;&#26377;&#26174;&#33879;&#26356;&#22909;&#30340;&#35780;&#20998;&#12290;&#25105;&#20204;&#30340;&#35757;&#32451;&#31639;&#27861;&#22312;&#24930;&#36895;&#31574;&#30053;&#21644;
&lt;/p&gt;
&lt;p&gt;
We present a temporally layered architecture (TLA) for temporally adaptive control with minimal energy expenditure. The TLA layers a fast and a slow policy together to achieve temporal abstraction that allows each layer to focus on a different time scale. Our design draws on the energy-saving mechanism of the human brain, which executes actions at different timescales depending on the environment's demands. We demonstrate that beyond energy saving, TLA provides many additional advantages, including persistent exploration, fewer required decisions, reduced jerk, and increased action repetition. We evaluate our method on a suite of continuous control tasks and demonstrate the significant advantages of TLA over existing methods when measured over multiple important metrics. We also introduce a multi-objective score to qualitatively assess continuous control policies and demonstrate a significantly better score for TLA. Our training algorithm uses minimal communication between the slow and
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#20013;&#30340;&#30693;&#35782;&#31561;&#20215;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#27169;&#22411;&#19982;&#29289;&#29702;&#31995;&#32479;&#20043;&#38388;&#21516;&#27493;&#30693;&#35782;&#30340;&#26032;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2204.07481</link><description>&lt;p&gt;
&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#20013;&#30340;&#30693;&#35782;&#31561;&#20215;&#24615;
&lt;/p&gt;
&lt;p&gt;
Knowledge Equivalence in Digital Twins of Intelligent Systems. (arXiv:2204.07481v2 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.07481
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#20013;&#30340;&#30693;&#35782;&#31561;&#20215;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#27169;&#22411;&#19982;&#29289;&#29702;&#31995;&#32479;&#20043;&#38388;&#21516;&#27493;&#30693;&#35782;&#30340;&#26032;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#21253;&#21547;&#20102;&#23545;&#25152;&#30740;&#31350;&#30340;&#29289;&#29702;&#19990;&#30028;&#36827;&#34892;&#23454;&#26102;&#25968;&#25454;&#39537;&#21160;&#24314;&#27169;&#30340;&#27169;&#22411;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#27169;&#25311;&#26469;&#20248;&#21270;&#29289;&#29702;&#19990;&#30028;&#12290;&#28982;&#32780;&#65292;&#25968;&#23383;&#23402;&#29983;&#25152;&#20570;&#30340;&#20998;&#26512;&#21482;&#26377;&#22312;&#27169;&#22411;&#19982;&#23454;&#38469;&#29289;&#29702;&#19990;&#30028;&#31561;&#20215;&#30340;&#24773;&#20917;&#19979;&#25165;&#26159;&#26377;&#25928;&#21644;&#21487;&#38752;&#30340;&#12290;&#22312;&#29289;&#29702;&#31995;&#32479;&#26159;&#26234;&#33021;&#21644;&#33258;&#20027;&#30340;&#24773;&#20917;&#19979;&#65292;&#20445;&#25345;&#36825;&#26679;&#19968;&#20010;&#31561;&#20215;&#27169;&#22411;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#29305;&#21035;&#20851;&#27880;&#26234;&#33021;&#31995;&#32479;&#25968;&#23383;&#23402;&#29983;&#27169;&#22411;&#65292;&#20854;&#20013;&#31995;&#32479;&#20855;&#26377;&#30693;&#35782;&#24863;&#30693;&#33021;&#21147;&#20294;&#33021;&#21147;&#26377;&#38480;&#12290;&#25968;&#23383;&#23402;&#29983;&#36890;&#36807;&#22312;&#27169;&#25311;&#29615;&#22659;&#20013;&#31215;&#32047;&#26356;&#22810;&#30693;&#35782;&#65292;&#20174;&#20803;&#23618;&#38754;&#19978;&#25913;&#36827;&#20102;&#29289;&#29702;&#31995;&#32479;&#30340;&#34892;&#20026;&#12290;&#22312;&#34394;&#25311;&#31354;&#38388;&#20013;&#22797;&#21046;&#36825;&#26679;&#19968;&#20010;&#26234;&#33021;&#29289;&#29702;&#31995;&#32479;&#30340;&#30693;&#35782;&#24863;&#30693;&#33021;&#21147;&#38656;&#35201;&#37319;&#29992;&#26032;&#39062;&#30340;&#31561;&#20215;&#24615;&#32500;&#25252;&#25216;&#26415;&#65292;&#29305;&#21035;&#26159;&#22312;&#27169;&#22411;&#19982;&#29289;&#29702;&#31995;&#32479;&#20043;&#38388;&#21516;&#27493;&#30693;&#35782;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#30693;&#35782;&#31561;&#20215;&#24615;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
A digital twin contains up-to-date data-driven models of the physical world being studied and can use simulation to optimise the physical world. However, the analysis made by the digital twin is valid and reliable only when the model is equivalent to the physical world. Maintaining such an equivalent model is challenging, especially when the physical systems being modelled are intelligent and autonomous. The paper focuses in particular on digital twin models of intelligent systems where the systems are knowledge-aware but with limited capability. The digital twin improves the acting of the physical system at a meta-level by accumulating more knowledge in the simulated environment. The modelling of such an intelligent physical system requires replicating the knowledge-awareness capability in the virtual space. Novel equivalence maintaining techniques are needed, especially in synchronising the knowledge between the model and the physical system. This paper proposes the notion of knowled
&lt;/p&gt;</description></item></channel></rss>