<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;(NNs)&#30340;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(MPC)&#30340;&#36817;&#20284;&#26041;&#27861;&#65292;&#31216;&#20026;&#23433;&#20840;&#22686;&#24378;&#65292;&#21487;&#20197;&#20351;&#35299;&#20915;&#26041;&#26696;&#22312;&#32447;&#21487;&#34892;&#24182;&#20855;&#26377;&#25910;&#25947;&#21644;&#32422;&#26463;&#26465;&#20214;&#30340;&#30830;&#23450;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2304.09575</link><description>&lt;p&gt;
&#22522;&#20110;&#23433;&#20840;&#22686;&#24378;&#31070;&#32463;&#32593;&#32476;&#30340;&#38750;&#32447;&#24615;&#36817;&#20284;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Approximate non-linear model predictive control with safety-augmented neural networks. (arXiv:2304.09575v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09575
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;(NNs)&#30340;&#38750;&#32447;&#24615;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(MPC)&#30340;&#36817;&#20284;&#26041;&#27861;&#65292;&#31216;&#20026;&#23433;&#20840;&#22686;&#24378;&#65292;&#21487;&#20197;&#20351;&#35299;&#20915;&#26041;&#26696;&#22312;&#32447;&#21487;&#34892;&#24182;&#20855;&#26377;&#25910;&#25947;&#21644;&#32422;&#26463;&#26465;&#20214;&#30340;&#30830;&#23450;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;(MPC)&#21487;&#20197;&#23454;&#29616;&#23545;&#20110;&#19968;&#33324;&#38750;&#32447;&#24615;&#31995;&#32479;&#30340;&#31283;&#23450;&#24615;&#21644;&#32422;&#26463;&#26465;&#20214;&#30340;&#28385;&#36275;&#65292;&#20294;&#38656;&#35201;&#36827;&#34892;&#35745;&#31639;&#24320;&#38144;&#24456;&#22823;&#30340;&#22312;&#32447;&#20248;&#21270;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;(NNs)&#23545;&#36825;&#31181;MPC&#25511;&#21046;&#22120;&#30340;&#36817;&#20284;&#65292;&#20197;&#23454;&#29616;&#24555;&#36895;&#30340;&#22312;&#32447;&#35780;&#20272;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#23433;&#20840;&#22686;&#24378;&#65292;&#23613;&#31649;&#23384;&#22312;&#36817;&#20284;&#19981;&#20934;&#30830;&#24615;&#65292;&#20294;&#21487;&#20197;&#33719;&#24471;&#25910;&#25947;&#21644;&#32422;&#26463;&#26465;&#20214;&#30340;&#30830;&#23450;&#20445;&#35777;&#12290;&#25105;&#20204;&#20351;&#29992;NN&#36817;&#20284;MPC&#30340;&#25972;&#20010;&#36755;&#20837;&#24207;&#21015;&#65292;&#36825;&#20351;&#24471;&#25105;&#20204;&#22312;&#32447;&#39564;&#35777;&#23427;&#26159;&#21542;&#26159;MPC&#38382;&#39064;&#30340;&#21487;&#34892;&#35299;&#12290;&#24403;&#35813;&#35299;&#20915;&#26041;&#26696;&#19981;&#21487;&#34892;&#25110;&#25104;&#26412;&#26356;&#39640;&#26102;&#65292;&#25105;&#20204;&#22522;&#20110;&#26631;&#20934;MPC&#25216;&#26415;&#23558;NN&#35299;&#20915;&#26041;&#26696;&#26367;&#25442;&#20026;&#23433;&#20840;&#20505;&#36873;&#35299;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20165;&#38656;&#35201;&#23545;NN&#36827;&#34892;&#19968;&#27425;&#35780;&#20272;&#21644;&#23545;&#36755;&#20837;&#24207;&#21015;&#36827;&#34892;&#22312;&#32447;&#21069;&#21521;&#31215;&#20998;&#65292;&#36825;&#22312;&#36164;&#28304;&#21463;&#38480;&#31995;&#32479;&#19978;&#30340;&#35745;&#31639;&#36895;&#24230;&#24456;&#24555;&#12290;&#25152;&#25552;&#20986;&#30340;&#25511;&#21046;&#26694;&#26550;&#22312;&#19977;&#20010;&#19981;&#21516;&#22797;&#26434;&#24230;&#30340;&#38750;&#32447;&#24615;MPC&#22522;&#20934;&#19978;&#36827;&#34892;&#20102;&#28436;&#31034;&#65292;&#23637;&#31034;&#20102;&#35745;&#31639;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Model predictive control (MPC) achieves stability and constraint satisfaction for general nonlinear systems, but requires computationally expensive online optimization. This paper studies approximations of such MPC controllers via neural networks (NNs) to achieve fast online evaluation. We propose safety augmentation that yields deterministic guarantees for convergence and constraint satisfaction despite approximation inaccuracies. We approximate the entire input sequence of the MPC with NNs, which allows us to verify online if it is a feasible solution to the MPC problem. We replace the NN solution by a safe candidate based on standard MPC techniques whenever it is infeasible or has worse cost. Our method requires a single evaluation of the NN and forward integration of the input sequence online, which is fast to compute on resource-constrained systems. The proposed control framework is illustrated on three non-linear MPC benchmarks of different complexity, demonstrating computational
&lt;/p&gt;</description></item></channel></rss>