<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>HiGen&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#24418;&#29983;&#25104;&#32593;&#32476;&#65292;&#33021;&#22815;&#20197;&#31895;&#21040;&#32454;&#30340;&#26041;&#24335;&#25429;&#25417;&#22270;&#24418;&#30340;&#23618;&#27425;&#32467;&#26500;&#65292;&#24182;&#20351;&#29992;&#22810;&#39033;&#24335;&#20998;&#24067;&#26469;&#29983;&#25104;&#20855;&#26377;&#25972;&#25968;&#20540;&#30340;&#23376;&#22270;&#30340;&#36793;&#26435;&#12290;&#23427;&#33021;&#22815;&#26377;&#25928;&#22320;&#25429;&#25417;&#22270;&#24418;&#30340;&#23616;&#37096;&#21644;&#20840;&#23616;&#23646;&#24615;&#65292;&#24182;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2305.19337</link><description>&lt;p&gt;
HiGen&#65306;&#23618;&#27425;&#22270;&#29983;&#25104;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
HiGen: Hierarchical Graph Generative Networks. (arXiv:2305.19337v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19337
&lt;/p&gt;
&lt;p&gt;
HiGen&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#24418;&#29983;&#25104;&#32593;&#32476;&#65292;&#33021;&#22815;&#20197;&#31895;&#21040;&#32454;&#30340;&#26041;&#24335;&#25429;&#25417;&#22270;&#24418;&#30340;&#23618;&#27425;&#32467;&#26500;&#65292;&#24182;&#20351;&#29992;&#22810;&#39033;&#24335;&#20998;&#24067;&#26469;&#29983;&#25104;&#20855;&#26377;&#25972;&#25968;&#20540;&#30340;&#23376;&#22270;&#30340;&#36793;&#26435;&#12290;&#23427;&#33021;&#22815;&#26377;&#25928;&#22320;&#25429;&#25417;&#22270;&#24418;&#30340;&#23616;&#37096;&#21644;&#20840;&#23616;&#23646;&#24615;&#65292;&#24182;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22810;&#25968;&#30495;&#23454;&#19990;&#30028;&#30340;&#22270;&#34920;&#29616;&#20986;&#23618;&#27425;&#32467;&#26500;&#65292;&#36825;&#36890;&#24120;&#34987;&#29616;&#26377;&#30340;&#22270;&#24418;&#29983;&#25104;&#26041;&#27861;&#25152;&#24573;&#35270;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#24418;&#29983;&#25104;&#32593;&#32476;&#65292;&#33021;&#22815;&#20197;&#31895;&#21040;&#32454;&#30340;&#26041;&#24335;&#25429;&#25417;&#22270;&#24418;&#30340;&#23618;&#27425;&#32467;&#26500;&#24182;&#25104;&#21151;&#22320;&#29983;&#25104;&#22270;&#24418;&#23376;&#32467;&#26500;&#12290;&#22312;&#27599;&#20010;&#23618;&#27425;&#19978;&#65292;&#35813;&#27169;&#22411;&#24182;&#34892;&#29983;&#25104;&#31038;&#21306;&#65292;&#20351;&#29992;&#29420;&#31435;&#30340;&#27169;&#22411;&#39044;&#27979;&#31038;&#21306;&#20043;&#38388;&#30340;&#36328;&#36793;&#12290;&#36825;&#31181;&#27169;&#22359;&#21270;&#26041;&#27861;&#20351;&#29983;&#25104;&#30340;&#22270;&#24418;&#32593;&#32476;&#39640;&#24230;&#21487;&#25193;&#23637;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#29992;&#22810;&#39033;&#24335;&#20998;&#24067;&#24314;&#27169;&#23618;&#27425;&#22270;&#24418;&#30340;&#36755;&#20986;&#20998;&#24067;&#65292;&#24182;&#38024;&#23545;&#27492;&#20998;&#24067;&#25512;&#23548;&#20102;&#36882;&#24402;&#20998;&#35299;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#20197;&#33258;&#22238;&#24402;&#30340;&#26041;&#24335;&#29983;&#25104;&#20855;&#26377;&#25972;&#25968;&#20540;&#30340;&#23376;&#22270;&#30340;&#36793;&#26435;&#12290;&#23454;&#35777;&#30740;&#31350;&#35777;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#29983;&#25104;&#27169;&#22411;&#33021;&#22815;&#26377;&#25928;&#22320;&#25429;&#25417;&#22270;&#24418;&#30340;&#23616;&#37096;&#21644;&#20840;&#23616;&#23646;&#24615;&#65292;&#24182;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Most real-world graphs exhibit a hierarchical structure, which is often overlooked by existing graph generation methods. To address this limitation, we propose a novel graph generative network that captures the hierarchical nature of graphs and successively generates the graph sub-structures in a coarse-to-fine fashion. At each level of hierarchy, this model generates communities in parallel, followed by the prediction of cross-edges between communities using a separate model. This modular approach results in a highly scalable graph generative network. Moreover, we model the output distribution of edges in the hierarchical graph with a multinomial distribution and derive a recursive factorization for this distribution, enabling us to generate sub-graphs with integer-valued edge weights in an autoregressive approach. Empirical studies demonstrate that the proposed generative model can effectively capture both local and global properties of graphs and achieves state-of-the-art performanc
&lt;/p&gt;</description></item></channel></rss>