<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#35813;&#35770;&#25991;&#26088;&#22312;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#36890;&#29992;&#22270;&#22522;&#30784;&#27169;&#22411;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#27867;&#21270;&#21040;&#19982;&#35757;&#32451;&#25968;&#25454;&#26174;&#33879;&#19981;&#21516;&#30340;&#26410;&#35265;&#22270;&#25968;&#25454;&#26102;&#36935;&#21040;&#30340;&#22256;&#38590;&#12290;</title><link>https://arxiv.org/abs/2403.01121</link><description>&lt;p&gt;
OpenGraph: &#36808;&#21521;&#24320;&#25918;&#22270;&#22522;&#30784;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
OpenGraph: Towards Open Graph Foundation Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01121
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#26088;&#22312;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#36890;&#29992;&#22270;&#22522;&#30784;&#27169;&#22411;&#65292;&#20197;&#35299;&#20915;&#29616;&#26377;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#27867;&#21270;&#21040;&#19982;&#35757;&#32451;&#25968;&#25454;&#26174;&#33879;&#19981;&#21516;&#30340;&#26410;&#35265;&#22270;&#25968;&#25454;&#26102;&#36935;&#21040;&#30340;&#22256;&#38590;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01121v1 &#20844;&#21578;&#31867;&#22411;: &#36328;&#20132;&#20114;   &#25688;&#35201;: &#22270;&#23398;&#20064;&#24050;&#25104;&#20026;&#35299;&#37322;&#21644;&#21033;&#29992;&#21508;&#39046;&#22495;&#30340;&#20851;&#31995;&#25968;&#25454;&#30340;&#19981;&#21487;&#25110;&#32570;&#37096;&#20998;&#65292;&#20174;&#25512;&#33616;&#31995;&#32479;&#21040;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#21508;&#31181;GNN&#24050;&#32463;&#25104;&#20026;&#32534;&#30721;&#22270;&#30340;&#32467;&#26500;&#20449;&#24687;&#30340;&#26377;&#24076;&#26395;&#30340;&#26041;&#27861;&#35770;&#65292;&#36890;&#36807;&#26377;&#25928;&#22320;&#25429;&#25417;&#22270;&#30340;&#28508;&#22312;&#32467;&#26500;&#65292;&#36825;&#20123;GNN&#24050;&#32463;&#23637;&#31034;&#20986;&#22312;&#22686;&#24378;&#22270;&#23398;&#20064;&#20219;&#21153;&#24615;&#33021;&#26041;&#38754;&#30340;&#24040;&#22823;&#28508;&#21147;&#65292;&#20363;&#22914;&#38142;&#25509;&#39044;&#27979;&#21644;&#33410;&#28857;&#20998;&#31867;&#12290;&#28982;&#32780;&#65292;&#23613;&#31649;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#19968;&#20010;&#26174;&#33879;&#30340;&#25361;&#25112;&#20173;&#28982;&#23384;&#22312;: &#36825;&#20123;&#20808;&#36827;&#26041;&#27861;&#36890;&#24120;&#22312;&#23558;&#26174;&#33879;&#19981;&#21516;&#20110;&#35757;&#32451;&#23454;&#20363;&#30340;&#26410;&#35265;&#22270;&#25968;&#25454;&#27867;&#21270;&#26102;&#36935;&#21040;&#22256;&#38590;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#36890;&#29992;&#22270;&#22522;&#30784;&#27169;&#22411;&#26469;&#25512;&#36827;&#22270;&#23398;&#20064;&#33539;&#24335;&#12290;&#35813;&#27169;&#22411;&#26088;&#22312;&#29702;&#35299;&#22810;&#26679;&#22270;&#25968;&#25454;&#20013;&#23384;&#22312;&#30340;&#22797;&#26434;&#25299;&#25169;&#27169;&#24335;&#65292;&#20351;&#20854;&#22312;&#38646;-shot&#24773;&#20917;&#19979;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01121v1 Announce Type: cross  Abstract: Graph learning has become indispensable for interpreting and harnessing relational data in diverse fields, ranging from recommendation systems to social network analysis. In this context, a variety of GNNs have emerged as promising methodologies for encoding the structural information of graphs. By effectively capturing the graph's underlying structure, these GNNs have shown great potential in enhancing performance in graph learning tasks, such as link prediction and node classification. However, despite their successes, a significant challenge persists: these advanced methods often face difficulties in generalizing to unseen graph data that significantly differs from the training instances. In this work, our aim is to advance the graph learning paradigm by developing a general graph foundation model. This model is designed to understand the complex topological patterns present in diverse graph data, enabling it to excel in zero-shot g
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#37051;&#22495;&#28151;&#28102;&#24230;&#37327;&#26469;&#20998;&#31163;&#23398;&#20064;&#35299;&#20915;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#28151;&#28102;&#33410;&#28857;&#30340;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26356;&#21487;&#38752;&#22320;&#21306;&#20998;&#24322;&#36136;&#33410;&#28857;&#21644;&#21516;&#36136;&#33410;&#28857;&#65292;&#24182;&#25913;&#21892;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2306.02285</link><description>&lt;p&gt;
&#36890;&#36807;&#20998;&#31163;&#23398;&#20064;&#35299;&#20915;&#28151;&#28102;&#33410;&#28857;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Clarify Confused Nodes Through Separated Learning. (arXiv:2306.02285v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02285
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#37051;&#22495;&#28151;&#28102;&#24230;&#37327;&#26469;&#20998;&#31163;&#23398;&#20064;&#35299;&#20915;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#28151;&#28102;&#33410;&#28857;&#30340;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26356;&#21487;&#38752;&#22320;&#21306;&#20998;&#24322;&#36136;&#33410;&#28857;&#21644;&#21516;&#36136;&#33410;&#28857;&#65292;&#24182;&#25913;&#21892;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#22312;&#22270;&#23548;&#21521;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#36827;&#23637;&#12290;&#28982;&#32780;&#65292;&#29616;&#23454;&#19990;&#30028;&#30340;&#22270;&#20013;&#19981;&#21487;&#36991;&#20813;&#22320;&#21253;&#21547;&#19968;&#23450;&#27604;&#20363;&#30340;&#24322;&#36136;&#33410;&#28857;&#65292;&#36825;&#25361;&#25112;&#20102;&#32463;&#20856;GNN&#30340;&#21516;&#36136;&#24615;&#20551;&#35774;&#65292;&#24182;&#38459;&#30861;&#20102;&#20854;&#24615;&#33021;&#12290;&#29616;&#26377;&#30740;&#31350;&#22823;&#22810;&#25968;&#20173;&#35774;&#35745;&#20102;&#20855;&#26377;&#24322;&#36136;&#33410;&#28857;&#21644;&#21516;&#36136;&#33410;&#28857;&#38388;&#20849;&#20139;&#26435;&#37325;&#30340;&#36890;&#29992;&#27169;&#22411;&#12290;&#23613;&#31649;&#36825;&#20123;&#21162;&#21147;&#20013;&#21253;&#21547;&#20102;&#39640;&#38454;&#20449;&#24687;&#21644;&#22810;&#36890;&#36947;&#26550;&#26500;&#65292;&#20294;&#24448;&#24448;&#25928;&#26524;&#19981;&#20339;&#12290;&#23569;&#25968;&#30740;&#31350;&#23581;&#35797;&#35757;&#32451;&#19981;&#21516;&#33410;&#28857;&#32452;&#30340;&#20998;&#31163;&#23398;&#20064;&#65292;&#20294;&#21463;&#21040;&#20102;&#19981;&#21512;&#36866;&#30340;&#20998;&#31163;&#24230;&#37327;&#21644;&#20302;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#39318;&#20808;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#25351;&#26631;&#65292;&#31216;&#20026;&#37051;&#22495;&#28151;&#28102;&#65288;NC&#65289;&#65292;&#20197;&#20415;&#26356;&#21487;&#38752;&#22320;&#20998;&#31163;&#33410;&#28857;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#20855;&#26377;&#19981;&#21516;NC&#20540;&#30340;&#33410;&#28857;&#32452;&#22312;&#32452;&#20869;&#20934;&#30830;&#24230;&#21644;&#21487;&#35270;&#21270;&#23884;&#20837;&#19978;&#23384;&#22312;&#19968;&#23450;&#24046;&#24322;&#12290;&#36825;&#20026;&#22522;&#20110;&#37051;&#22495;&#28151;&#28102;&#30340;&#22270;&#21367;&#31215;&#32593;&#32476;&#65288;NC-GCN&#65289;&#38138;&#24179;&#20102;&#36947;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph neural networks (GNNs) have achieved remarkable advances in graph-oriented tasks. However, real-world graphs invariably contain a certain proportion of heterophilous nodes, challenging the homophily assumption of classical GNNs and hindering their performance. Most existing studies continue to design generic models with shared weights between heterophilous and homophilous nodes. Despite the incorporation of high-order messages or multi-channel architectures, these efforts often fall short. A minority of studies attempt to train different node groups separately but suffer from inappropriate separation metrics and low efficiency. In this paper, we first propose a new metric, termed Neighborhood Confusion (NC), to facilitate a more reliable separation of nodes. We observe that node groups with different levels of NC values exhibit certain differences in intra-group accuracy and visualized embeddings. These pave the way for Neighborhood Confusion-guided Graph Convolutional Network (N
&lt;/p&gt;</description></item></channel></rss>