<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;Daisy-TTS&#35774;&#35745;&#65292;&#36890;&#36807;&#22768;&#35843;&#23884;&#20837;&#20998;&#35299;&#65292;&#27169;&#25311;&#20102;&#26356;&#24191;&#27867;&#30340;&#24773;&#24863;&#33539;&#22260;&#65292;&#21253;&#25324; primary emotions&#12289;secondary emotions&#12289;intensity-level &#21644; emotions polarity&#12290;</title><link>https://arxiv.org/abs/2402.14523</link><description>&lt;p&gt;
Daisy-TTS: &#36890;&#36807;&#22768;&#35843;&#23884;&#20837;&#20998;&#35299;&#27169;&#25311;&#26356;&#24191;&#27867;&#30340;&#24773;&#24863;&#33539;&#22260;
&lt;/p&gt;
&lt;p&gt;
Daisy-TTS: Simulating Wider Spectrum of Emotions via Prosody Embedding Decomposition
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14523
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;Daisy-TTS&#35774;&#35745;&#65292;&#36890;&#36807;&#22768;&#35843;&#23884;&#20837;&#20998;&#35299;&#65292;&#27169;&#25311;&#20102;&#26356;&#24191;&#27867;&#30340;&#24773;&#24863;&#33539;&#22260;&#65292;&#21253;&#25324; primary emotions&#12289;secondary emotions&#12289;intensity-level &#21644; emotions polarity&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32463;&#24120;&#20197;&#22810;&#26041;&#38754;&#30340;&#26041;&#24335;&#21475;&#22836;&#34920;&#36798;&#24773;&#24863;&#65292;&#23427;&#20204;&#22312;&#24378;&#24230;&#19978;&#21487;&#33021;&#26377;&#25152;&#21464;&#21270;&#65292;&#34920;&#36798;&#30340;&#19981;&#20165;&#26159;&#21333;&#19968;&#30340;&#24773;&#24863;&#65292;&#36824;&#21487;&#33021;&#26159;&#21508;&#31181;&#24773;&#24863;&#30340;&#28151;&#21512;&#20307;&#12290;&#36825;&#31181;&#24191;&#27867;&#30340;&#24773;&#24863;&#33539;&#22260;&#22312;&#24773;&#24863;&#32467;&#26500;&#27169;&#22411;&#20013;&#24471;&#21040;&#20102;&#28145;&#20837;&#30740;&#31350;&#65292;&#35813;&#27169;&#22411;&#23558;&#21508;&#31181;&#24773;&#24863;&#34920;&#31034;&#20026;&#21407;&#22987;&#24773;&#24863;&#30340;&#27966;&#29983;&#20135;&#21697;&#65292;&#20855;&#26377;&#19981;&#21516;&#31243;&#24230;&#30340;&#24378;&#24230;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24773;&#24863;&#25991;&#26412;&#36716;&#35821;&#38899;&#35774;&#35745;&#65292;&#26088;&#22312;&#27169;&#25311;&#22522;&#20110;&#32467;&#26500;&#27169;&#22411;&#30340;&#26356;&#24191;&#27867;&#24773;&#24863;&#33539;&#22260;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#35774;&#35745;Daisy-TTS&#65292;&#32467;&#21512;&#20102;&#19968;&#20010;&#22768;&#35843;&#32534;&#30721;&#22120;&#65292;&#29992;&#20110;&#23398;&#20064;&#20316;&#20026;&#24773;&#24863;&#20195;&#29702;&#30340;&#21487;&#20998;&#31163;&#30340;&#22768;&#35843;&#23884;&#20837;&#12290;&#36825;&#31181;&#24773;&#24863;&#34920;&#31034;&#20351;&#27169;&#22411;&#33021;&#22815;&#27169;&#25311;&#65306;&#65288;1&#65289;&#20174;&#35757;&#32451;&#26679;&#26412;&#20013;&#23398;&#21040;&#30340;&#21407;&#22987;&#24773;&#24863;&#65292;&#65288;2&#65289;&#20316;&#20026;&#21407;&#22987;&#24773;&#24863;&#30340;&#28151;&#21512;&#20307;&#30340;&#27425;&#32423;&#24773;&#24863;&#65292;&#65288;3&#65289;&#36890;&#36807;&#35843;&#25972;&#24773;&#24863;&#23884;&#20837;&#26469;&#23454;&#29616;&#24378;&#24230;&#32423;&#21035;&#65292;&#65288;4&#65289;&#36890;&#36807;&#21542;&#23450;&#24773;&#24863;&#23884;&#20837;&#26469;&#23454;&#29616;&#24773;&#24863;&#26497;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14523v1 Announce Type: new  Abstract: We often verbally express emotions in a multifaceted manner, they may vary in their intensities and may be expressed not just as a single but as a mixture of emotions. This wide spectrum of emotions is well-studied in the structural model of emotions, which represents variety of emotions as derivative products of primary emotions with varying degrees of intensity. In this paper, we propose an emotional text-to-speech design to simulate a wider spectrum of emotions grounded on the structural model. Our proposed design, Daisy-TTS, incorporates a prosody encoder to learn emotionally-separable prosody embedding as a proxy for emotion. This emotion representation allows the model to simulate: (1) Primary emotions, as learned from the training samples, (2) Secondary emotions, as a mixture of primary emotions, (3) Intensity-level, by scaling the emotion embedding, and (4) Emotions polarity, by negating the emotion embedding. Through a series of
&lt;/p&gt;</description></item><item><title>MuTox&#26159;&#31532;&#19968;&#20010;&#39640;&#24230;&#22810;&#35821;&#35328;&#30340;&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#25968;&#25454;&#38598;&#65292;&#36890;&#36807;&#35757;&#32451;&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#20998;&#31867;&#22120;&#65292;&#23454;&#29616;&#20102;&#36328;&#22810;&#35821;&#35328;&#30340;&#38646;&#26679;&#26412;&#27602;&#24615;&#26816;&#27979;&#65292;&#30456;&#36739;&#20110;&#29616;&#26377;&#22522;&#20110;&#25991;&#26412;&#30340;&#20998;&#31867;&#22120;&#65292;&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#21644;&#26356;&#24191;&#27867;&#30340;&#35821;&#35328;&#35206;&#30422;&#65292;&#30456;&#36739;&#20110;&#22522;&#20110;&#35789;&#27719;&#21015;&#34920;&#30340;&#20998;&#31867;&#22120;&#65292;&#31934;&#24230;&#21644;&#21484;&#22238;&#29575;&#25552;&#39640;&#20102;&#32422;2.5&#20493;&#12290;</title><link>http://arxiv.org/abs/2401.05060</link><description>&lt;p&gt;
MuTox: &#36890;&#29992;&#22810;&#35821;&#35328;&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#25968;&#25454;&#38598;&#21644;&#38646;&#26679;&#26412;&#26816;&#27979;&#22120;
&lt;/p&gt;
&lt;p&gt;
MuTox: Universal MUltilingual Audio-based TOXicity Dataset and Zero-shot Detector. (arXiv:2401.05060v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05060
&lt;/p&gt;
&lt;p&gt;
MuTox&#26159;&#31532;&#19968;&#20010;&#39640;&#24230;&#22810;&#35821;&#35328;&#30340;&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#25968;&#25454;&#38598;&#65292;&#36890;&#36807;&#35757;&#32451;&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#20998;&#31867;&#22120;&#65292;&#23454;&#29616;&#20102;&#36328;&#22810;&#35821;&#35328;&#30340;&#38646;&#26679;&#26412;&#27602;&#24615;&#26816;&#27979;&#65292;&#30456;&#36739;&#20110;&#29616;&#26377;&#22522;&#20110;&#25991;&#26412;&#30340;&#20998;&#31867;&#22120;&#65292;&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#21644;&#26356;&#24191;&#27867;&#30340;&#35821;&#35328;&#35206;&#30422;&#65292;&#30456;&#36739;&#20110;&#22522;&#20110;&#35789;&#27719;&#21015;&#34920;&#30340;&#20998;&#31867;&#22120;&#65292;&#31934;&#24230;&#21644;&#21484;&#22238;&#29575;&#25552;&#39640;&#20102;&#32422;2.5&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#38899;&#27169;&#24577;&#65288;&#22522;&#20110;&#38899;&#39057;&#65289;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20013;&#30340;&#27602;&#24615;&#26816;&#27979;&#30740;&#31350;&#30456;&#23545;&#26377;&#38480;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#38750;&#33521;&#35821;&#35821;&#35328;&#32780;&#35328;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#24182;&#20026;&#30495;&#27491;&#22810;&#35821;&#35328;&#30340;&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#26816;&#27979;&#22880;&#23450;&#22522;&#30784;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;MuTox&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#20855;&#26377;&#27602;&#24615;&#26631;&#31614;&#30340;&#39640;&#24230;&#22810;&#35821;&#35328;&#30340;&#22522;&#20110;&#38899;&#39057;&#30340;&#25968;&#25454;&#38598;&#12290;&#35813;&#25968;&#25454;&#38598;&#21253;&#21547;20,000&#20010;&#33521;&#35821;&#21644;&#35199;&#29677;&#29273;&#35821;&#38899;&#39057;&#29255;&#27573;&#65292;&#20197;&#21450;&#20854;&#20182;19&#31181;&#35821;&#35328;&#30340;4,000&#20010;&#29255;&#27573;&#12290;&#20026;&#20102;&#35777;&#26126;&#25968;&#25454;&#38598;&#30340;&#36136;&#37327;&#65292;&#25105;&#20204;&#35757;&#32451;&#20102;MuTox&#22522;&#20110;&#38899;&#39057;&#30340;&#27602;&#24615;&#20998;&#31867;&#22120;&#65292;&#23427;&#33021;&#22815;&#22312;&#21508;&#31181;&#35821;&#35328;&#20013;&#36827;&#34892;&#38646;&#26679;&#26412;&#27602;&#24615;&#26816;&#27979;&#12290;&#19982;&#29616;&#26377;&#30340;&#22522;&#20110;&#25991;&#26412;&#35757;&#32451;&#30340;&#20998;&#31867;&#22120;&#30456;&#27604;&#65292;&#35813;&#20998;&#31867;&#22120;&#30340;AUC&#24615;&#33021;&#25552;&#39640;&#20102;&#36229;&#36807;1%&#65292;&#21516;&#26102;&#25193;&#22823;&#20102;&#35821;&#35328;&#35206;&#30422;&#33539;&#22260;&#21313;&#20493;&#20197;&#19978;&#12290;&#19982;&#22522;&#20110;&#35789;&#27719;&#21015;&#34920;&#30340;&#20855;&#26377;&#30456;&#20284;&#35821;&#35328;&#35206;&#30422;&#25968;&#37327;&#30340;&#20998;&#31867;&#22120;&#30456;&#27604;&#65292;MuTox&#30340;&#31934;&#24230;&#21644;&#21484;&#22238;&#29575;&#25552;&#39640;&#20102;&#32422;2.5&#20493;&#12290;&#36825;&#20010;&#26174;&#33879;&#30340;&#25913;&#36827;&#31361;&#26174;&#20102;&#20854;&#28508;&#22312;&#30340;&#21019;&#26032;&#24615;&#21644;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research in toxicity detection in natural language processing for the speech modality (audio-based) is quite limited, particularly for languages other than English. To address these limitations and lay the groundwork for truly multilingual audio-based toxicity detection, we introduce MuTox, the first highly multilingual audio-based dataset with toxicity labels. The dataset comprises 20,000 audio utterances for English and Spanish, and 4,000 for the other 19 languages. To demonstrate the quality of this dataset, we trained the MuTox audio-based toxicity classifier, which enables zero-shot toxicity detection across a wide range of languages. This classifier outperforms existing text-based trainable classifiers by more than 1% AUC, while expanding the language coverage more than tenfold. When compared to a wordlist-based classifier that covers a similar number of languages, MuTox improves precision and recall by approximately 2.5 times. This significant improvement underscores the potenti
&lt;/p&gt;</description></item></channel></rss>