<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#23884;&#20837;&#30340;&#26102;&#38388;&#22270;&#36317;&#31163;&#35745;&#31639;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#32467;&#26500;&#21644;&#26102;&#38388;&#23646;&#24615;&#30340;&#22270;&#65292;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#26102;&#38388;&#22270;&#12290;</title><link>http://arxiv.org/abs/2401.12843</link><description>&lt;p&gt;
&#22522;&#20110;&#23884;&#20837;&#36317;&#31163;&#35745;&#31639;&#30340;&#26102;&#38388;&#22270;
&lt;/p&gt;
&lt;p&gt;
An embedding-based distance for temporal graphs. (arXiv:2401.12843v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12843
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#23884;&#20837;&#30340;&#26102;&#38388;&#22270;&#36317;&#31163;&#35745;&#31639;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#32467;&#26500;&#21644;&#26102;&#38388;&#23646;&#24615;&#30340;&#22270;&#65292;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#26102;&#38388;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22522;&#20110;&#20351;&#29992;&#26102;&#38388;&#23562;&#37325;&#30340;&#38543;&#26426;&#28216;&#36208;&#26500;&#24314;&#30340;&#22270;&#23884;&#20837;&#26469;&#23450;&#20041;&#20102;&#19968;&#31181;&#26102;&#38388;&#22270;&#20043;&#38388;&#30340;&#36317;&#31163;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21305;&#37197;&#22270;&#21644;&#19981;&#21305;&#37197;&#22270;&#30340;&#24773;&#20917;&#65292;&#24403;&#23384;&#22312;&#24050;&#30693;&#30340;&#33410;&#28857;&#20851;&#31995;&#26102;&#65292;&#20197;&#21450;&#24403;&#19981;&#23384;&#22312;&#35813;&#20851;&#31995;&#24182;&#19988;&#22270;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#30340;&#22823;&#23567;&#26102;&#30340;&#24773;&#20917;&#12290;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#21644;&#21512;&#25104;&#30340;&#26102;&#38388;&#32593;&#32476;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#25152;&#25552;&#20986;&#30340;&#36317;&#31163;&#23450;&#20041;&#30340;&#20248;&#21183;&#65292;&#34920;&#26126;&#23427;&#33021;&#22815;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#32467;&#26500;&#21644;&#26102;&#38388;&#23646;&#24615;&#30340;&#22270;&#12290;&#21033;&#29992;&#26368;&#20808;&#36827;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#26102;&#38388;&#22270;&#30340;&#36317;&#31163;&#35745;&#31639;&#30340;&#39640;&#25928;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define a distance between temporal graphs based on graph embeddings built using time-respecting random walks. We study both the case of matched graphs, when there exists a known relation between the nodes, and the unmatched case, when such a relation is unavailable and the graphs may be of different sizes. We illustrate the interest of our distance definition, using both real and synthetic temporal network data, by showing its ability to discriminate between graphs with different structural and temporal properties. Leveraging state-of-the-art machine learning techniques, we propose an efficient implementation of distance computation that is viable for large-scale temporal graphs.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;&#31216;&#20026;DPPDCC&#65289;&#65292;&#29992;&#20110;&#23558;&#35770;&#25991;&#30340;&#28508;&#22312;&#24433;&#21709;&#20998;&#35299;&#20026;&#20256;&#25773;&#12289;&#19968;&#33268;&#24615;&#21644;&#36129;&#29486;&#20540;&#12290;&#36890;&#36807;&#32534;&#30721;&#26102;&#24577;&#21644;&#32467;&#26500;&#29305;&#24449;&#65292;&#25429;&#25417;&#30693;&#35782;&#27969;&#21160;&#65292;&#24182;&#20351;&#29992;&#23545;&#27604;&#22686;&#24378;&#22270;&#25581;&#31034;&#27969;&#34892;&#24230;&#65292;&#36827;&#19968;&#27493;&#39044;&#27979;&#24341;&#29992;&#20998;&#32452;&#26469;&#24314;&#27169;&#19968;&#33268;&#24615;&#12290;&#24212;&#29992;&#27491;&#20132;&#32422;&#26463;&#26469;&#40723;&#21169;&#29420;&#29305;&#24314;&#27169;&#65292;&#24182;&#20445;&#30041;&#21407;&#22987;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2311.09262</link><description>&lt;p&gt;
&#23558;&#35770;&#25991;&#30340;&#28508;&#22312;&#24433;&#21709;&#20998;&#35299;&#20026;&#20256;&#25773;&#12289;&#19968;&#33268;&#24615;&#21644;&#36129;&#29486;&#20540;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Disentangling the Potential Impacts of Papers into Diffusion, Conformity, and Contribution Values. (arXiv:2311.09262v2 [cs.SI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.09262
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;&#31216;&#20026;DPPDCC&#65289;&#65292;&#29992;&#20110;&#23558;&#35770;&#25991;&#30340;&#28508;&#22312;&#24433;&#21709;&#20998;&#35299;&#20026;&#20256;&#25773;&#12289;&#19968;&#33268;&#24615;&#21644;&#36129;&#29486;&#20540;&#12290;&#36890;&#36807;&#32534;&#30721;&#26102;&#24577;&#21644;&#32467;&#26500;&#29305;&#24449;&#65292;&#25429;&#25417;&#30693;&#35782;&#27969;&#21160;&#65292;&#24182;&#20351;&#29992;&#23545;&#27604;&#22686;&#24378;&#22270;&#25581;&#31034;&#27969;&#34892;&#24230;&#65292;&#36827;&#19968;&#27493;&#39044;&#27979;&#24341;&#29992;&#20998;&#32452;&#26469;&#24314;&#27169;&#19968;&#33268;&#24615;&#12290;&#24212;&#29992;&#27491;&#20132;&#32422;&#26463;&#26469;&#40723;&#21169;&#29420;&#29305;&#24314;&#27169;&#65292;&#24182;&#20445;&#30041;&#21407;&#22987;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30340;&#28508;&#22312;&#24433;&#21709;&#21463;&#21040;&#22810;&#31181;&#22240;&#32032;&#30340;&#24433;&#21709;&#65292;&#21253;&#25324;&#20854;&#27969;&#34892;&#24230;&#21644;&#36129;&#29486;&#12290;&#29616;&#26377;&#27169;&#22411;&#36890;&#24120;&#22522;&#20110;&#38745;&#24577;&#22270;&#26469;&#20272;&#35745;&#21407;&#22987;&#24341;&#29992;&#35745;&#25968;&#65292;&#26410;&#33021;&#20174;&#32454;&#24494;&#30340;&#35282;&#24230;&#21306;&#20998;&#20215;&#20540;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#29992;&#20110;&#23558;&#35770;&#25991;&#30340;&#28508;&#22312;&#24433;&#21709;&#20998;&#35299;&#20026;&#20256;&#25773;&#12289;&#19968;&#33268;&#24615;&#21644;&#36129;&#29486;&#20540;&#65288;&#31216;&#20026;DPPDCC&#65289;&#12290;&#32473;&#23450;&#19968;&#20010;&#30446;&#26631;&#35770;&#25991;&#65292;DPPDCC&#22312;&#26500;&#24314;&#30340;&#21160;&#24577;&#24322;&#26500;&#22270;&#20013;&#32534;&#30721;&#20102;&#26102;&#24577;&#21644;&#32467;&#26500;&#29305;&#24449;&#12290;&#29305;&#21035;&#22320;&#65292;&#20026;&#20102;&#25429;&#25417;&#30693;&#35782;&#27969;&#21160;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#35770;&#25991;&#20043;&#38388;&#30340;&#27604;&#36739;&#21644;&#20849;&#24341;/&#34987;&#24341;&#20449;&#24687;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#36827;&#34892;&#20102;&#24555;&#29031;&#28436;&#21270;&#30340;&#32858;&#21512;&#12290;&#20026;&#20102;&#25581;&#31034;&#27969;&#34892;&#24230;&#65292;&#25105;&#20204;&#36890;&#36807;&#23545;&#27604;&#22686;&#24378;&#22270;&#26469;&#25552;&#21462;&#20256;&#25773;&#30340;&#26412;&#36136;&#65292;&#24182;&#39044;&#27979;&#32047;&#31215;&#30340;&#24341;&#29992;&#20998;&#32452;&#20197;&#24314;&#27169;&#19968;&#33268;&#24615;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#24212;&#29992;&#27491;&#20132;&#32422;&#26463;&#26469;&#40723;&#21169;&#27599;&#20010;&#35282;&#24230;&#30340;&#29420;&#29305;&#24314;&#27169;&#65292;&#24182;&#20445;&#30041;&#20854;&#22266;&#26377;&#33719;&#24471;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
The potential impact of an academic paper is determined by various factors, including its popularity and contribution. Existing models usually estimate original citation counts based on static graphs and fail to differentiate values from nuanced perspectives. In this study, we propose a novel graph neural network to Disentangle the Potential impacts of Papers into Diffusion, Conformity, and Contribution values (called DPPDCC). Given a target paper, DPPDCC encodes temporal and structural features within the constructed dynamic heterogeneous graph. Particularly, to capture the knowledge flow, we emphasize the importance of comparative and co-cited/citing information between papers and aggregate snapshots evolutionarily. To unravel popularity, we contrast augmented graphs to extract the essence of diffusion and predict the accumulated citation binning to model conformity. We further apply orthogonal constraints to encourage distinct modeling of each perspective and preserve the inherent v
&lt;/p&gt;</description></item></channel></rss>