<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#21512;&#20316;&#33021;&#20135;&#29983;&#26356;&#22823;&#24433;&#21709;&#21147;&#65292;&#26368;&#36817;&#25968;&#25454;&#26174;&#31034;&#20004;&#22269;&#33258;2000&#24180;&#26469;&#19968;&#30452;&#22788;&#20110;&#39046;&#23548;&#22320;&#20301;&#65292;&#32780;&#22823;&#22810;&#25968;&#20154;&#25165;&#27969;&#22833;&#22312;&#20004;&#22269;&#20043;&#38388;&#12290;</title><link>http://arxiv.org/abs/2304.11123</link><description>&lt;p&gt;
&#20013;&#32654;&#21512;&#20316;&#26102;&#65292;&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#33021;&#22815;&#20135;&#29983;&#26356;&#22823;&#30340;&#24433;&#21709;&#21147;
&lt;/p&gt;
&lt;p&gt;
China and the U.S. produce more impactful AI research when collaborating together. (arXiv:2304.11123v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11123
&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#21512;&#20316;&#33021;&#20135;&#29983;&#26356;&#22823;&#24433;&#21709;&#21147;&#65292;&#26368;&#36817;&#25968;&#25454;&#26174;&#31034;&#20004;&#22269;&#33258;2000&#24180;&#26469;&#19968;&#30452;&#22788;&#20110;&#39046;&#23548;&#22320;&#20301;&#65292;&#32780;&#22823;&#22810;&#25968;&#20154;&#25165;&#27969;&#22833;&#22312;&#20004;&#22269;&#20043;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#24050;&#32463;&#25104;&#20026;&#39072;&#35206;&#24615;&#25216;&#26415;&#65292;&#26377;&#26395;&#20026;&#25484;&#25569;&#20854;&#21147;&#37327;&#30340;&#22269;&#23478;&#24102;&#26469;&#26174;&#33879;&#30340;&#32463;&#27982;&#21644;&#25112;&#30053;&#20248;&#21183;&#12290;&#26368;&#36817;&#65292;&#20013;&#22269;&#25512;&#21160;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#30340;&#37319;&#29992;&#65292;&#27491;&#22312;&#25361;&#25112;&#32654;&#22269;&#22312;&#36825;&#19968;&#39046;&#22495;&#30340;&#20840;&#29699;&#39046;&#23548;&#22320;&#20301;&#12290;&#32771;&#34385;&#21040;&#20154;&#24037;&#26234;&#33021;&#30340;&#24040;&#22823;&#28508;&#21147;&#65292;&#20197;&#21450;&#20004;&#22269;&#20043;&#38388;&#28608;&#28872;&#30340;&#22320;&#32536;&#25919;&#27835;&#32039;&#24352;&#23616;&#21183;&#65292;&#24050;&#32463;&#21046;&#23450;&#20102;&#19968;&#20123;&#25919;&#31574;&#65292;&#20197;&#38450;&#27490;&#20154;&#24037;&#26234;&#33021;&#31185;&#23398;&#23478;&#31227;&#27665;&#21040;&#23545;&#26041;&#22269;&#23478;&#25110;&#19982;&#20043;&#21512;&#20316;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#20154;&#25165;&#27969;&#22833;&#21644;&#36328;&#22659;&#21512;&#20316;&#30340;&#31243;&#24230;&#36824;&#27809;&#26377;&#34987;&#23436;&#20840;&#20102;&#35299;&#12290;&#22312;&#27492;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#36229;&#36807;350,000&#21517;&#20154;&#24037;&#26234;&#33021;&#31185;&#23398;&#23478;&#21644;5,000,000&#31687;&#20154;&#24037;&#26234;&#33021;&#25991;&#29486;&#30340;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#21457;&#29616;&#33258;2000&#24180;&#20197;&#26469;&#65292;&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#24433;&#21709;&#21147;&#12289;&#21019;&#26032;&#24615;&#12289;&#29983;&#20135;&#21147;&#21644;&#21171;&#21160;&#21147;&#26041;&#38754;&#19968;&#30452;&#22788;&#20110;&#39046;&#20808;&#22320;&#20301;&#12290;&#22823;&#22810;&#25968;&#31227;&#27665;&#21040;&#20013;&#22269;&#30340;&#20154;&#24037;&#26234;&#33021;&#31185;&#23398;&#23478;&#26469;&#33258;&#32654;&#22269;&#65292;&#32780;&#31227;&#27665;&#21040;&#32654;&#22269;&#30340;&#20154;&#24037;&#26234;&#33021;&#31185;&#23398;&#23478;&#26469;&#33258;&#20013;&#22269;&#65292;&#20984;&#26174;&#20986;&#26126;&#26174;&#30340;&#20154;&#25165;&#27969;&#22833;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence (AI) has become a disruptive technology, promising to grant a significant economic and strategic advantage to the nations that harness its power. China, with its recent push towards AI adoption, is challenging the U.S.'s position as the global leader in this field. Given AI's massive potential, as well as the fierce geopolitical tensions between the two nations, a number of policies have been put in place that discourage AI scientists from migrating to, or collaborating with, the other country. However, the extents of such brain drain and cross-border collaboration are not fully understood. Here, we analyze a dataset of over 350,000 AI scientists and 5,000,000 AI papers. We find that, since the year 2000, China and the U.S. have been leading the field in terms of impact, novelty, productivity, and workforce. Most AI scientists who migrate to China come from the U.S., and most who migrate to the U.S. come from China, highlighting a notable brain drain in both dir
&lt;/p&gt;</description></item></channel></rss>