<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20445;&#30041;&#35821;&#20041;&#30340;&#36716;&#25442;&#30340;&#33258;&#28982;&#24615;&#21450;&#20854;&#23545;NPR&#35780;&#20272;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#20102;NPR&#31995;&#32479;&#22312;&#38754;&#23545;&#19981;&#33258;&#28982;&#30340;&#20195;&#30721;&#36716;&#25442;&#26102;&#20250;&#20135;&#29983;&#36739;&#39640;&#30340;&#35823;&#25253;&#29575;&#65292;&#19988;&#22312;&#20351;&#29992;&#33258;&#28982;&#36716;&#25442;&#36827;&#34892;&#35780;&#20272;&#26102;&#24615;&#33021;&#26126;&#26174;&#19979;&#38477;&#12290;</title><link>https://arxiv.org/abs/2402.11892</link><description>&lt;p&gt;
&#29992;&#20445;&#30041;&#35821;&#20041;&#30340;&#36716;&#25442;&#35780;&#20272;&#31243;&#24207;&#20462;&#22797;&#65306;&#33258;&#28982;&#24615;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Evaluating Program Repair with Semantic-Preserving Transformations: A Naturalness Assessment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11892
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20445;&#30041;&#35821;&#20041;&#30340;&#36716;&#25442;&#30340;&#33258;&#28982;&#24615;&#21450;&#20854;&#23545;NPR&#35780;&#20272;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#20102;NPR&#31995;&#32479;&#22312;&#38754;&#23545;&#19981;&#33258;&#28982;&#30340;&#20195;&#30721;&#36716;&#25442;&#26102;&#20250;&#20135;&#29983;&#36739;&#39640;&#30340;&#35823;&#25253;&#29575;&#65292;&#19988;&#22312;&#20351;&#29992;&#33258;&#28982;&#36716;&#25442;&#36827;&#34892;&#35780;&#20272;&#26102;&#24615;&#33021;&#26126;&#26174;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20445;&#30041;&#35821;&#20041;&#30340;&#36716;&#25442;&#30340;&#33258;&#28982;&#24615;&#21450;&#20854;&#23545;NPR&#35780;&#20272;&#30340;&#24433;&#21709;&#12290;&#20026;&#20102;&#36798;&#21040;&#36825;&#20010;&#30446;&#30340;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#30340;&#20154;&#31867;&#30740;&#31350;&#65292;&#21253;&#25324;(1)&#19982;&#36164;&#28145;&#36719;&#20214;&#24320;&#21457;&#20154;&#21592;&#30340;&#35775;&#35848;&#65292;&#20197;&#24314;&#31435;&#35780;&#20272;&#20195;&#30721;&#36716;&#25442;&#33258;&#28982;&#24615;&#30340;&#31532;&#19968;&#20010;&#20855;&#20307;&#26631;&#20934;&#65307;(2)&#36827;&#34892;&#20102;&#19968;&#39033;&#28041;&#21450;10&#21517;&#24320;&#21457;&#20154;&#21592;&#30340;&#35843;&#26597;&#65292;&#35780;&#20272;&#20102;&#24212;&#29992;&#20110;225&#20010;&#30495;&#23454;&#19990;&#30028;bug&#30340;1178&#20010;&#36716;&#25442;&#65288;&#21363;&#21407;&#22987;&#21644;&#36716;&#25442;&#31243;&#24207;&#25104;&#23545;&#30340;&#24773;&#20917;&#65289;&#30340;&#33258;&#28982;&#24615;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#20854;&#20013;&#25509;&#36817;60%&#30340;&#36716;&#25442;&#34987;&#35748;&#20026;&#26159;&#33258;&#28982;&#30340;&#65292;20%&#30340;&#36716;&#25442;&#34987;&#35748;&#20026;&#26159;&#19981;&#33258;&#28982;&#30340;&#65292;&#24182;&#19988;&#22312;&#20154;&#31867;&#26631;&#27880;&#32773;&#20043;&#38388;&#26377;&#30456;&#24403;&#39640;&#30340;&#19968;&#33268;&#24615;&#12290;&#27492;&#22806;&#65292;&#19981;&#33258;&#28982;&#30340;&#20195;&#30721;&#36716;&#25442;&#24341;&#20837;&#20102;&#20116;&#20010;&#30693;&#21517;NPR&#31995;&#32479;&#30340;&#31283;&#20581;&#24615;&#30340;25.2%&#35823;&#25253;&#29575;&#12290;&#27492;&#22806;&#65292;&#24403;&#20351;&#29992;&#33258;&#28982;&#36716;&#25442;&#36827;&#34892;&#35780;&#20272;&#26102;&#65292;NPR&#31995;&#32479;&#30340;&#24615;&#33021;&#26174;&#30528;&#19979;&#38477;&#65292;&#21363;&#24615;&#33021;&#19979;&#38477;&#39640;&#36798;22.9%&#21644;23.6%&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11892v1 Announce Type: cross  Abstract: In this paper, we investigate the naturalness of semantic-preserving transformations and their impacts on the evaluation of NPR. To achieve this, we conduct a two-stage human study, including (1) interviews with senior software developers to establish the first concrete criteria for assessing the naturalness of code transformations and (2) a survey involving 10 developers to assess the naturalness of 1178 transformations, i.e., pairs of original and transformed programs, applied to 225 real-world bugs. Our findings reveal that nearly 60% and 20% of these transformations are considered natural and unnatural with substantially high agreement among human annotators. Furthermore, the unnatural code transformations introduce a 25.2% false alarm rate on robustness of five well-known NPR systems. Additionally, the performance of the NPR systems drops notably when evaluated using natural transformations, i.e., a drop of up to 22.9% and 23.6% i
&lt;/p&gt;</description></item></channel></rss>