<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;&#31354;&#38388;&#20998;&#35299;&#26469;&#36817;&#20284;&#30005;&#21147;&#31995;&#32479;&#21160;&#21147;&#23398;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#30340;&#26041;&#27861;&#65292;&#26088;&#22312;&#21152;&#36895;&#20223;&#30495;&#65292;&#25552;&#39640;&#25968;&#20540;&#31283;&#23450;&#24615;&#21644;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2303.10256</link><description>&lt;p&gt;
&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;&#31354;&#38388;&#20998;&#35299;&#22312;&#30005;&#21147;&#31995;&#32479;&#21160;&#21147;&#23398;&#20013;&#27714;&#35299;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Solving Differential-Algebraic Equations in Power Systems Dynamics with Neural Networks and Spatial Decomposition. (arXiv:2303.10256v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10256
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21644;&#31354;&#38388;&#20998;&#35299;&#26469;&#36817;&#20284;&#30005;&#21147;&#31995;&#32479;&#21160;&#21147;&#23398;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#30340;&#26041;&#27861;&#65292;&#26088;&#22312;&#21152;&#36895;&#20223;&#30495;&#65292;&#25552;&#39640;&#25968;&#20540;&#31283;&#23450;&#24615;&#21644;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#31995;&#32479;&#30340;&#21160;&#21147;&#23398;&#30001;&#19968;&#32452;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#25551;&#36848;&#12290;&#26102;&#38388;&#22495;&#20223;&#30495;&#29992;&#20110;&#29702;&#35299;&#31995;&#32479;&#21160;&#24577;&#30340;&#28436;&#21464;&#12290;&#30001;&#20110;&#31995;&#32479;&#30340;&#21018;&#24230;&#38656;&#35201;&#20351;&#29992;&#31934;&#32454;&#31163;&#25955;&#21270;&#30340;&#26102;&#38388;&#27493;&#38271;&#65292;&#22240;&#27492;&#36825;&#20123;&#20223;&#30495;&#21487;&#33021;&#20855;&#26377;&#35745;&#31639;&#20195;&#20215;&#36739;&#39640;&#30340;&#29305;&#28857;&#12290;&#36890;&#36807;&#22686;&#21152;&#20801;&#35768;&#30340;&#26102;&#38388;&#27493;&#38271;&#65292;&#25105;&#20204;&#26088;&#22312;&#21152;&#24555;&#36825;&#26679;&#30340;&#20223;&#30495;&#12290;&#26412;&#25991;&#20351;&#29992;&#35266;&#23519;&#32467;&#26524;&#65292;&#21363;&#23613;&#31649;&#21508;&#20010;&#32452;&#20214;&#20351;&#29992;&#20195;&#25968;&#21644;&#24494;&#20998;&#26041;&#31243;&#26469;&#25551;&#36848;&#65292;&#20294;&#23427;&#20204;&#30340;&#32806;&#21512;&#20165;&#28041;&#21450;&#20195;&#25968;&#26041;&#31243;&#30340;&#35266;&#23519;&#32467;&#26524;&#65292;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#26469;&#36817;&#20284;&#32452;&#20214;&#29366;&#24577;&#28436;&#21464;&#65292;&#20174;&#32780;&#20135;&#29983;&#24555;&#36895;&#12289;&#20934;&#30830;&#21644;&#25968;&#20540;&#31283;&#23450;&#30340;&#36817;&#20284;&#22120;&#65292;&#20351;&#24471;&#21487;&#20197;&#20351;&#29992;&#26356;&#22823;&#30340;&#26102;&#38388;&#27493;&#38271;&#12290;&#20026;&#20102;&#35299;&#37322;&#32593;&#32476;&#23545;&#32452;&#20214;&#20197;&#21450;&#32452;&#20214;&#23545;&#32593;&#32476;&#30340;&#24433;&#21709;&#65292;NN&#23558;&#32806;&#21512;&#20195;&#25968;&#21464;&#37327;&#30340;&#26102;&#38388;&#28436;&#21270;&#20316;&#20026;&#20854;&#39044;&#27979;&#30340;&#36755;&#20837;&#12290;&#25105;&#20204;&#26368;&#21021;&#20351;&#29992;&#31354;&#38388;&#20998;&#35299;&#26041;&#27861;&#26469;&#20272;&#35745;NN&#65292;&#20854;&#20013;&#31995;&#32479;&#34987;&#20998;&#25104;&#31354;&#38388;&#21306;&#22495;&#65292;&#27599;&#20010;&#21306;&#22495;&#26377;&#21333;&#29420;&#30340;NN&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#23558;&#22522;&#20110;NN&#30340;&#20223;&#30495;&#19982;&#20256;&#32479;&#30340;&#25968;&#20540;&#31215;&#20998;&#26041;&#26696;&#36827;&#34892;&#27604;&#36739;&#65292;&#20197;&#23637;&#31034;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The dynamics of the power system are described by a system of differential-algebraic equations. Time-domain simulations are used to understand the evolution of the system dynamics. These simulations can be computationally expensive due to the stiffness of the system which requires the use of finely discretized time-steps. By increasing the allowable time-step size, we aim to accelerate such simulations. In this paper, we use the observation that even though the individual components are described using both algebraic and differential equations, their coupling only involves algebraic equations. Following this observation, we use Neural Networks (NNs) to approximate the components' state evolution, leading to fast, accurate, and numerically stable approximators, which enable larger time-steps. To account for effects of the network on the components and vice-versa, the NNs take the temporal evolution of the coupling algebraic variables as an input for their prediction. We initially estima
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#25509;&#35302;&#38544;&#24335;&#21452;&#23618;&#20248;&#21270;&#26469;&#35268;&#21010;&#25903;&#28857;&#25805;&#32437;&#24182;&#22686;&#21152;&#40065;&#26834;&#24615;&#65292;&#36890;&#36807;&#21033;&#29992;&#25705;&#25830;&#21147;&#26469;&#24357;&#34917;&#29289;&#20307;&#21644;&#29615;&#22659;&#29289;&#29702;&#23646;&#24615;&#20272;&#35745;&#20013;&#30340;&#19981;&#20934;&#30830;&#24615;&#65292;&#20197;&#24212;&#23545;&#19981;&#30830;&#23450;&#24615;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.08965</link><description>&lt;p&gt;
&#20351;&#29992;&#25509;&#35302;&#38544;&#24335;&#21452;&#23618;&#20248;&#21270;&#23454;&#29616;&#40065;&#26834;&#30340;&#25903;&#28857;&#25805;&#20316;
&lt;/p&gt;
&lt;p&gt;
Robust Pivoting Manipulation using Contact Implicit Bilevel Optimization. (arXiv:2303.08965v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08965
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#25509;&#35302;&#38544;&#24335;&#21452;&#23618;&#20248;&#21270;&#26469;&#35268;&#21010;&#25903;&#28857;&#25805;&#32437;&#24182;&#22686;&#21152;&#40065;&#26834;&#24615;&#65292;&#36890;&#36807;&#21033;&#29992;&#25705;&#25830;&#21147;&#26469;&#24357;&#34917;&#29289;&#20307;&#21644;&#29615;&#22659;&#29289;&#29702;&#23646;&#24615;&#20272;&#35745;&#20013;&#30340;&#19981;&#20934;&#30830;&#24615;&#65292;&#20197;&#24212;&#23545;&#19981;&#30830;&#23450;&#24615;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#29992;&#25805;&#32437;&#35201;&#27714;&#26426;&#22120;&#20154;&#33021;&#22815;&#19982;&#26032;&#29289;&#20307;&#21644;&#29615;&#22659;&#36827;&#34892;&#20132;&#20114;&#12290;&#36825;&#20010;&#35201;&#27714;&#20351;&#24471;&#25805;&#32437;&#21464;&#24471;&#24322;&#24120;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#26426;&#22120;&#20154;&#24517;&#39035;&#32771;&#34385;&#21040;&#19981;&#30830;&#23450;&#22240;&#32032;&#19979;&#30340;&#22797;&#26434;&#25705;&#25830;&#30456;&#20114;&#20316;&#29992;&#21450;&#29289;&#20307;&#21644;&#29615;&#22659;&#30340;&#29289;&#29702;&#23646;&#24615;&#20272;&#35745;&#30340;&#19981;&#20934;&#30830;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#25903;&#28857;&#25805;&#20316;&#35268;&#21010;&#30340;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#22914;&#20309;&#21033;&#29992;&#25705;&#25830;&#21147;&#26469;&#24357;&#34917;&#29289;&#29702;&#29305;&#24615;&#20272;&#35745;&#20013;&#30340;&#19981;&#20934;&#30830;&#24615;&#30340;&#35265;&#35299;&#12290;&#22312;&#26576;&#20123;&#20551;&#35774;&#19979;&#65292;&#23548;&#20986;&#20102;&#25705;&#25830;&#21147;&#25552;&#20379;&#30340;&#25903;&#28857;&#25805;&#20316;&#31283;&#23450;&#35029;&#24230;&#30340;&#35299;&#26512;&#34920;&#36798;&#24335;&#12290;&#28982;&#21518;&#65292;&#22312;&#25509;&#35302;&#38544;&#24335;&#21452;&#23618;&#20248;&#21270;(CIBO)&#26694;&#26550;&#20013;&#20351;&#29992;&#35813;&#35029;&#24230;&#26469;&#20248;&#21270;&#36712;&#36857; &#65292;&#20197;&#22686;&#24378;&#23545;&#29289;&#20307;&#22810;&#20010;&#29289;&#29702;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#30340;&#40065;&#26834;&#24615;&#12290;&#25105;&#20204;&#22312;&#23454;&#38469;&#26426;&#22120;&#20154;&#19978;&#30340;&#23454;&#39564;&#20013;&#65292;&#23545;&#20110;&#20005;&#37325;&#24178;&#25200;&#30340;&#21442;&#25968;&#65292;&#20998;&#26512;&#20102;&#31283;&#23450;&#35029;&#24230;&#65292;&#24182;&#26174;&#31034;&#20102;&#20248;&#21270;&#36712;&#36857;&#30340;&#25913;&#21892;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generalizable manipulation requires that robots be able to interact with novel objects and environment. This requirement makes manipulation extremely challenging as a robot has to reason about complex frictional interactions with uncertainty in physical properties of the object and the environment. In this paper, we study robust optimization for planning of pivoting manipulation in the presence of uncertainties. We present insights about how friction can be exploited to compensate for inaccuracies in the estimates of the physical properties during manipulation. Under certain assumptions, we derive analytical expressions for stability margin provided by friction during pivoting manipulation. This margin is then used in a Contact Implicit Bilevel Optimization (CIBO) framework to optimize a trajectory that maximizes this stability margin to provide robustness against uncertainty in several physical parameters of the object. We present analysis of the stability margin with respect to sever
&lt;/p&gt;</description></item></channel></rss>