<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>ZS4C&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;ChatGPT&#36827;&#34892;&#38646;&#23556;&#20987;&#21512;&#25104;&#21487;&#32534;&#35793;&#20195;&#30721;&#30340;&#36731;&#37327;&#32423;&#26041;&#27861;&#65292;&#24110;&#21161;&#29992;&#25143;&#37325;&#29992;&#25110;&#20998;&#26512;&#19981;&#23436;&#25972;&#30340;Q&amp;A&#20195;&#30721;&#29255;&#27573;&#65292;&#36890;&#36807;&#35782;&#21035;&#32570;&#22833;&#30340;&#23548;&#20837;&#35821;&#21477;&#24182;&#20462;&#22797;&#32534;&#35793;&#38169;&#35823;&#26469;&#23454;&#29616;&#12290;</title><link>http://arxiv.org/abs/2401.14279</link><description>&lt;p&gt;
ZS4C: &#20351;&#29992;ChatGPT&#36827;&#34892;&#38646;&#23556;&#20987;&#21512;&#25104;&#19981;&#23436;&#25972;&#20195;&#30721;&#29255;&#27573;&#30340;&#21487;&#32534;&#35793;&#20195;&#30721;
&lt;/p&gt;
&lt;p&gt;
ZS4C: Zero-Shot Synthesis of Compilable Code for Incomplete Code Snippets using ChatGPT. (arXiv:2401.14279v1 [cs.SE] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14279
&lt;/p&gt;
&lt;p&gt;
ZS4C&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;ChatGPT&#36827;&#34892;&#38646;&#23556;&#20987;&#21512;&#25104;&#21487;&#32534;&#35793;&#20195;&#30721;&#30340;&#36731;&#37327;&#32423;&#26041;&#27861;&#65292;&#24110;&#21161;&#29992;&#25143;&#37325;&#29992;&#25110;&#20998;&#26512;&#19981;&#23436;&#25972;&#30340;Q&amp;A&#20195;&#30721;&#29255;&#27573;&#65292;&#36890;&#36807;&#35782;&#21035;&#32570;&#22833;&#30340;&#23548;&#20837;&#35821;&#21477;&#24182;&#20462;&#22797;&#32534;&#35793;&#38169;&#35823;&#26469;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25216;&#26415;&#38382;&#31572;&#65288;Q&amp;A&#65289;&#32593;&#31449;&#22914;Stack Overflow&#24050;&#25104;&#20026;&#36719;&#20214;&#24320;&#21457;&#32773;&#23547;&#27714;&#30693;&#35782;&#30340;&#37325;&#35201;&#26469;&#28304;&#12290;&#28982;&#32780;&#65292;Q&amp;A&#32593;&#31449;&#19978;&#30340;&#20195;&#30721;&#29255;&#27573;&#36890;&#24120;&#30001;&#20110;&#26410;&#35299;&#26512;&#30340;&#31867;&#22411;&#21644;&#32570;&#22833;&#30340;&#20381;&#36182;&#24211;&#32780;&#26080;&#27861;&#32534;&#35793;&#21644;&#35821;&#20041;&#19978;&#19981;&#23436;&#25972;&#65292;&#36825;&#22686;&#21152;&#20102;&#29992;&#25143;&#37325;&#29992;&#25110;&#20998;&#26512;Q&amp;A&#20195;&#30721;&#29255;&#27573;&#30340;&#38556;&#30861;&#12290;&#20043;&#21069;&#30340;&#26041;&#27861;&#35201;&#20040;&#19981;&#36866;&#29992;&#20110;&#21512;&#25104;&#21487;&#32534;&#35793;&#20195;&#30721;&#65292;&#35201;&#20040;&#32534;&#35793;&#25104;&#21151;&#29575;&#20302;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;ZS4C&#65292;&#19968;&#31181;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#20174;&#19981;&#23436;&#25972;&#30340;&#20195;&#30721;&#29255;&#27573;&#20013;&#36827;&#34892;&#38646;&#23556;&#20987;&#21512;&#25104;&#21487;&#32534;&#35793;&#20195;&#30721;&#30340;&#36731;&#37327;&#32423;&#26041;&#27861;&#12290;ZS4C&#20998;&#20026;&#20004;&#20010;&#38454;&#27573;&#12290;&#22312;&#31532;&#19968;&#38454;&#27573;&#65292;ZS4C&#21033;&#29992;&#19968;&#20010;LLM&#65292;&#21363;ChatGPT&#65292;&#26681;&#25454;&#25105;&#20204;&#35774;&#35745;&#30340;&#19987;&#29992;&#20219;&#21153;&#25552;&#31034;&#27169;&#26495;&#65292;&#20026;&#32473;&#23450;&#30340;&#20195;&#30721;&#29255;&#27573;&#35782;&#21035;&#32570;&#22833;&#30340;&#23548;&#20837;&#35821;&#21477;&#12290;&#22312;&#31532;&#20108;&#38454;&#27573;&#65292;ZS4C&#36890;&#36807;&#20462;&#22797;&#30001;&#20110;&#19981;&#27491;&#30830;&#30340;&#23548;&#20837;&#35821;&#21477;&#21644;&#35821;&#27861;&#38169;&#35823;&#24341;&#36215;&#30340;&#32534;&#35793;&#38169;&#35823;&#26469;&#20462;&#22797;&#20195;&#30721;&#12290;
&lt;/p&gt;
&lt;p&gt;
Technical question and answering (Q&amp;A) sites such as Stack Overflow have become an important source for software developers to seek knowledge. However, code snippets on Q&amp;A sites are usually uncompilable and semantically incomplete for compilation due to unresolved types and missing dependent libraries, which raises the obstacle for users to reuse or analyze Q&amp;A code snippets. Prior approaches either are not designed for synthesizing compilable code or suffer from a low compilation success rate. To address this problem, we propose ZS4C, a lightweight approach to perform zero-shot synthesis of compilable code from incomplete code snippets using Large Language Model (LLM). ZS4C operates in two stages. In the first stage, ZS4C utilizes an LLM, i.e., ChatGPT, to identify missing import statements for a given code snippet, leveraging our designed task-specific prompt template. In the second stage, ZS4C fixes compilation errors caused by incorrect import statements and syntax errors through 
&lt;/p&gt;</description></item></channel></rss>