<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#23884;&#20837;&#30340;&#26102;&#38388;&#22270;&#36317;&#31163;&#35745;&#31639;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#32467;&#26500;&#21644;&#26102;&#38388;&#23646;&#24615;&#30340;&#22270;&#65292;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#26102;&#38388;&#22270;&#12290;</title><link>http://arxiv.org/abs/2401.12843</link><description>&lt;p&gt;
&#22522;&#20110;&#23884;&#20837;&#36317;&#31163;&#35745;&#31639;&#30340;&#26102;&#38388;&#22270;
&lt;/p&gt;
&lt;p&gt;
An embedding-based distance for temporal graphs. (arXiv:2401.12843v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12843
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#23884;&#20837;&#30340;&#26102;&#38388;&#22270;&#36317;&#31163;&#35745;&#31639;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#32467;&#26500;&#21644;&#26102;&#38388;&#23646;&#24615;&#30340;&#22270;&#65292;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#26102;&#38388;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22522;&#20110;&#20351;&#29992;&#26102;&#38388;&#23562;&#37325;&#30340;&#38543;&#26426;&#28216;&#36208;&#26500;&#24314;&#30340;&#22270;&#23884;&#20837;&#26469;&#23450;&#20041;&#20102;&#19968;&#31181;&#26102;&#38388;&#22270;&#20043;&#38388;&#30340;&#36317;&#31163;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21305;&#37197;&#22270;&#21644;&#19981;&#21305;&#37197;&#22270;&#30340;&#24773;&#20917;&#65292;&#24403;&#23384;&#22312;&#24050;&#30693;&#30340;&#33410;&#28857;&#20851;&#31995;&#26102;&#65292;&#20197;&#21450;&#24403;&#19981;&#23384;&#22312;&#35813;&#20851;&#31995;&#24182;&#19988;&#22270;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#30340;&#22823;&#23567;&#26102;&#30340;&#24773;&#20917;&#12290;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#21644;&#21512;&#25104;&#30340;&#26102;&#38388;&#32593;&#32476;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#25152;&#25552;&#20986;&#30340;&#36317;&#31163;&#23450;&#20041;&#30340;&#20248;&#21183;&#65292;&#34920;&#26126;&#23427;&#33021;&#22815;&#21306;&#20998;&#20855;&#26377;&#19981;&#21516;&#32467;&#26500;&#21644;&#26102;&#38388;&#23646;&#24615;&#30340;&#22270;&#12290;&#21033;&#29992;&#26368;&#20808;&#36827;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#22823;&#35268;&#27169;&#26102;&#38388;&#22270;&#30340;&#36317;&#31163;&#35745;&#31639;&#30340;&#39640;&#25928;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define a distance between temporal graphs based on graph embeddings built using time-respecting random walks. We study both the case of matched graphs, when there exists a known relation between the nodes, and the unmatched case, when such a relation is unavailable and the graphs may be of different sizes. We illustrate the interest of our distance definition, using both real and synthetic temporal network data, by showing its ability to discriminate between graphs with different structural and temporal properties. Leveraging state-of-the-art machine learning techniques, we propose an efficient implementation of distance computation that is viable for large-scale temporal graphs.
&lt;/p&gt;</description></item></channel></rss>