<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#24418;&#24577;&#23545;&#31216;&#24615;&#26159;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#30340;&#22266;&#26377;&#24615;&#36136;&#65292;&#36890;&#36807;&#23545;&#36816;&#21160;&#32467;&#26500;&#21644;&#36136;&#37327;&#30340;&#23545;&#31216;&#20998;&#24067;&#65292;&#24310;&#20280;&#33267;&#26426;&#22120;&#20154;&#29366;&#24577;&#31354;&#38388;&#21644;&#20256;&#24863;&#22120;&#27979;&#37327;&#65292;&#36827;&#32780;&#24433;&#21709;&#26426;&#22120;&#20154;&#30340;&#36816;&#21160;&#26041;&#31243;&#21644;&#26368;&#20248;&#25511;&#21046;&#31574;&#30053;&#65292;&#24182;&#22312;&#26426;&#22120;&#20154;&#23398;&#24314;&#27169;&#12289;&#25511;&#21046;&#21644;&#35774;&#35745;&#20013;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>https://arxiv.org/abs/2402.15552</link><description>&lt;p&gt;
&#26426;&#22120;&#20154;&#23398;&#20013;&#30340;&#24418;&#24577;&#23545;&#31216;&#24615;
&lt;/p&gt;
&lt;p&gt;
Morphological Symmetries in Robotics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15552
&lt;/p&gt;
&lt;p&gt;
&#24418;&#24577;&#23545;&#31216;&#24615;&#26159;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#30340;&#22266;&#26377;&#24615;&#36136;&#65292;&#36890;&#36807;&#23545;&#36816;&#21160;&#32467;&#26500;&#21644;&#36136;&#37327;&#30340;&#23545;&#31216;&#20998;&#24067;&#65292;&#24310;&#20280;&#33267;&#26426;&#22120;&#20154;&#29366;&#24577;&#31354;&#38388;&#21644;&#20256;&#24863;&#22120;&#27979;&#37327;&#65292;&#36827;&#32780;&#24433;&#21709;&#26426;&#22120;&#20154;&#30340;&#36816;&#21160;&#26041;&#31243;&#21644;&#26368;&#20248;&#25511;&#21046;&#31574;&#30053;&#65292;&#24182;&#22312;&#26426;&#22120;&#20154;&#23398;&#24314;&#27169;&#12289;&#25511;&#21046;&#21644;&#35774;&#35745;&#20013;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20840;&#38754;&#30340;&#26694;&#26550;&#26469;&#30740;&#31350;&#21644;&#21033;&#29992;&#26426;&#22120;&#20154;&#31995;&#32479;&#20013;&#30340;&#24418;&#24577;&#23545;&#31216;&#24615;&#12290;&#36825;&#20123;&#26159;&#26426;&#22120;&#20154;&#24418;&#24577;&#30340;&#22266;&#26377;&#29305;&#24615;&#65292;&#32463;&#24120;&#22312;&#21160;&#29289;&#29983;&#29289;&#23398;&#21644;&#26426;&#22120;&#20154;&#23398;&#20013;&#35266;&#23519;&#21040;&#65292;&#28304;&#20110;&#36816;&#21160;&#32467;&#26500;&#30340;&#22797;&#21046;&#21644;&#36136;&#37327;&#30340;&#23545;&#31216;&#20998;&#24067;&#12290;&#25105;&#20204;&#35828;&#26126;&#20102;&#36825;&#20123;&#23545;&#31216;&#24615;&#22914;&#20309;&#24310;&#20280;&#21040;&#26426;&#22120;&#20154;&#30340;&#29366;&#24577;&#31354;&#38388;&#20197;&#21450;&#26412;&#20307;&#24863;&#30693;&#21644;&#22806;&#37096;&#24863;&#30693;&#20256;&#24863;&#22120;&#27979;&#37327;&#65292;&#23548;&#33268;&#26426;&#22120;&#20154;&#30340;&#36816;&#21160;&#26041;&#31243;&#21644;&#26368;&#20248;&#25511;&#21046;&#31574;&#30053;&#30340;&#31561;&#19981;&#21464;&#24615;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#35748;&#35782;&#21040;&#24418;&#24577;&#23545;&#31216;&#24615;&#20316;&#20026;&#19968;&#20010;&#30456;&#20851;&#19988;&#20197;&#21069;&#26410;&#34987;&#25506;&#32034;&#30340;&#21463;&#29289;&#29702;&#21551;&#31034;&#30340;&#20960;&#20309;&#20808;&#39564;&#65292;&#23545;&#26426;&#22120;&#20154;&#24314;&#27169;&#12289;&#25511;&#21046;&#12289;&#20272;&#35745;&#21644;&#35774;&#35745;&#20013;&#20351;&#29992;&#30340;&#25968;&#25454;&#39537;&#21160;&#21644;&#20998;&#26512;&#26041;&#27861;&#37117;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;&#23545;&#20110;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#65292;&#25105;&#20204;&#28436;&#31034;&#20102;&#24418;&#24577;&#23545;&#31216;&#24615;&#22914;&#20309;&#25552;&#39640;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#26679;&#26412;&#25928;&#29575;&#21644;&#27867;&#21270;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15552v1 Announce Type: cross  Abstract: We present a comprehensive framework for studying and leveraging morphological symmetries in robotic systems. These are intrinsic properties of the robot's morphology, frequently observed in animal biology and robotics, which stem from the replication of kinematic structures and the symmetrical distribution of mass. We illustrate how these symmetries extend to the robot's state space and both proprioceptive and exteroceptive sensor measurements, resulting in the equivariance of the robot's equations of motion and optimal control policies. Thus, we recognize morphological symmetries as a relevant and previously unexplored physics-informed geometric prior, with significant implications for both data-driven and analytical methods used in modeling, control, estimation and design in robotics. For data-driven methods, we demonstrate that morphological symmetries can enhance the sample efficiency and generalization of machine learning models 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#30005;&#21160;&#27773;&#36710;&#20805;&#30005;&#31449;&#27169;&#22411;&#65292;&#36890;&#36807;&#29992;&#25143;&#34892;&#20026;&#24314;&#27169;&#21644;&#38543;&#26426;&#35268;&#21010;&#65292;&#35299;&#20915;&#20102;&#20805;&#30005;&#20250;&#35805;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#20248;&#21270;&#25104;&#26412;&#24182;&#25552;&#39640;&#29992;&#25143;&#28385;&#24847;&#24230;&#12290;</title><link>https://arxiv.org/abs/2402.13224</link><description>&lt;p&gt;
&#36890;&#36807;&#29992;&#25143;&#34892;&#20026;&#24314;&#27169;&#21644;&#38543;&#26426;&#35268;&#21010;&#25511;&#21046;&#22823;&#22411;&#30005;&#21160;&#27773;&#36710;&#20805;&#30005;&#31449;
&lt;/p&gt;
&lt;p&gt;
Controlling Large Electric Vehicle Charging Stations via User Behavior Modeling and Stochastic Programming
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13224
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#30005;&#21160;&#27773;&#36710;&#20805;&#30005;&#31449;&#27169;&#22411;&#65292;&#36890;&#36807;&#29992;&#25143;&#34892;&#20026;&#24314;&#27169;&#21644;&#38543;&#26426;&#35268;&#21010;&#65292;&#35299;&#20915;&#20102;&#20805;&#30005;&#20250;&#35805;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#20248;&#21270;&#25104;&#26412;&#24182;&#25552;&#39640;&#29992;&#25143;&#28385;&#24847;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#30005;&#21160;&#27773;&#36710;&#20805;&#30005;&#31449;&#65288;EVCS&#65289;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#34701;&#21512;&#20102;&#30495;&#23454;&#19990;&#30028;&#30340;&#32422;&#26463;&#26465;&#20214;&#65292;&#22914;&#25554;&#27133;&#21151;&#29575;&#38480;&#21046;&#12289;&#21512;&#21516;&#38408;&#20540;&#36229;&#38480;&#24809;&#32602;&#20197;&#21450;&#30005;&#21160;&#27773;&#36710;&#65288;EVs&#65289;&#30340;&#26089;&#26399;&#26029;&#24320;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22312;&#19981;&#30830;&#23450;&#24615;&#19979;&#25511;&#21046;EVCS&#30340;&#38382;&#39064;&#24418;&#24335;&#65292;&#24182;&#23454;&#26045;&#20102;&#20004;&#31181;&#22810;&#38454;&#27573;&#38543;&#26426;&#35268;&#21010;&#26041;&#27861;&#65292;&#21033;&#29992;&#29992;&#25143;&#25552;&#20379;&#30340;&#20449;&#24687;&#65292;&#21363;&#27169;&#22411;&#39044;&#27979;&#25511;&#21046;&#21644;&#20108;&#38454;&#27573;&#38543;&#26426;&#35268;&#21010;&#12290;&#35813;&#27169;&#22411;&#35299;&#20915;&#20102;&#20805;&#30005;&#20250;&#35805;&#24320;&#22987;&#21644;&#32467;&#26463;&#26102;&#38388;&#20197;&#21450;&#33021;&#37327;&#38656;&#27714;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#22522;&#20110;&#39547;&#30041;&#26102;&#38388;&#20381;&#36182;&#38543;&#26426;&#36807;&#31243;&#30340;&#29992;&#25143;&#34892;&#20026;&#27169;&#22411;&#22686;&#24378;&#20102;&#25104;&#26412;&#38477;&#20302;&#30340;&#21516;&#26102;&#20445;&#25345;&#23458;&#25143;&#28385;&#24847;&#24230;&#12290;&#36890;&#36807;&#20351;&#29992;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#38598;&#36827;&#34892;&#30340;22&#22825;&#27169;&#25311;&#23637;&#31034;&#20102;&#20004;&#31181;&#25552;&#20986;&#26041;&#27861;&#30456;&#23545;&#20110;&#20004;&#20010;&#22522;&#32447;&#30340;&#20248;&#21183;&#12290;&#20004;&#38454;&#27573;&#26041;&#27861;&#35777;&#26126;&#20102;&#38024;&#23545;&#26089;&#26399;&#26029;&#24320;&#30340;&#40065;&#26834;&#24615;&#65292;&#32771;&#34385;&#20102;&#26356;&#22810;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13224v1 Announce Type: cross  Abstract: This paper introduces an Electric Vehicle Charging Station (EVCS) model that incorporates real-world constraints, such as slot power limitations, contract threshold overruns penalties, or early disconnections of electric vehicles (EVs). We propose a formulation of the problem of EVCS control under uncertainty, and implement two Multi-Stage Stochastic Programming approaches that leverage user-provided information, namely, Model Predictive Control and Two-Stage Stochastic Programming. The model addresses uncertainties in charging session start and end times, as well as in energy demand. A user's behavior model based on a sojourn-time-dependent stochastic process enhances cost reduction while maintaining customer satisfaction. The benefits of the two proposed methods are showcased against two baselines over a 22-day simulation using a real-world dataset. The two-stage approach proves robust against early disconnections, considering a more
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#26469;&#38477;&#20302;&#26080;&#26381;&#21153;&#22120;&#35745;&#31639;&#20013;&#30340;&#20919;&#21551;&#21160;&#39057;&#29575;&#12290;&#36890;&#36807;&#20351;&#29992;Q&#23398;&#20064;&#21644;&#32771;&#34385;&#22810;&#31181;&#25351;&#26631;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312;&#39044;&#26399;&#38656;&#27714;&#30340;&#22522;&#30784;&#19978;&#25552;&#21069;&#21021;&#22987;&#21270;&#20989;&#25968;&#65292;&#20174;&#32780;&#20943;&#23569;&#20919;&#21551;&#21160;&#27425;&#25968;&#12290;</title><link>http://arxiv.org/abs/2308.07541</link><description>&lt;p&gt;
&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26080;&#26381;&#21153;&#22120;&#35745;&#31639;&#20013;&#20919;&#21551;&#21160;&#39057;&#29575;&#38477;&#20302;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Reinforcement Learning (RL) Augmented Cold Start Frequency Reduction in Serverless Computing. (arXiv:2308.07541v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07541
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#26469;&#38477;&#20302;&#26080;&#26381;&#21153;&#22120;&#35745;&#31639;&#20013;&#30340;&#20919;&#21551;&#21160;&#39057;&#29575;&#12290;&#36890;&#36807;&#20351;&#29992;Q&#23398;&#20064;&#21644;&#32771;&#34385;&#22810;&#31181;&#25351;&#26631;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312;&#39044;&#26399;&#38656;&#27714;&#30340;&#22522;&#30784;&#19978;&#25552;&#21069;&#21021;&#22987;&#21270;&#20989;&#25968;&#65292;&#20174;&#32780;&#20943;&#23569;&#20919;&#21551;&#21160;&#27425;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20989;&#25968;&#21363;&#26381;&#21153;&#26159;&#19968;&#31181;&#20113;&#35745;&#31639;&#33539;&#20363;&#65292;&#20026;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;&#20107;&#20214;&#39537;&#21160;&#25191;&#34892;&#27169;&#22411;&#12290;&#23427;&#36890;&#36807;&#20174;&#24320;&#21457;&#32773;&#37027;&#37324;&#28040;&#38500;&#36164;&#28304;&#31649;&#29702;&#36131;&#20219;&#65292;&#25552;&#20379;&#36879;&#26126;&#21644;&#25353;&#38656;&#21487;&#25193;&#23637;&#24615;&#26469;&#23454;&#29616;&#26080;&#26381;&#21153;&#22120;&#29305;&#24615;&#12290;&#20856;&#22411;&#30340;&#26080;&#26381;&#21153;&#22120;&#24212;&#29992;&#31243;&#24207;&#23545;&#21709;&#24212;&#26102;&#38388;&#21644;&#21487;&#25193;&#23637;&#24615;&#26377;&#20005;&#26684;&#35201;&#27714;&#65292;&#22240;&#27492;&#20381;&#36182;&#20110;&#37096;&#32626;&#30340;&#26381;&#21153;&#20026;&#23458;&#25143;&#25552;&#20379;&#24555;&#36895;&#21644;&#23481;&#38169;&#30340;&#21453;&#39304;&#12290;&#28982;&#32780;&#65292;&#20989;&#25968;&#21363;&#26381;&#21153;&#33539;&#20363;&#22312;&#38656;&#35201;&#25353;&#38656;&#21021;&#22987;&#21270;&#20989;&#25968;&#26102;&#23384;&#22312;&#38750;&#24120;&#21487;&#35266;&#30340;&#24310;&#36831;&#65292;&#21363;&#20919;&#21551;&#21160;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#26469;&#20943;&#23569;&#24179;&#21488;&#19978;&#30340;&#20919;&#21551;&#21160;&#39057;&#29575;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;Q&#23398;&#20064;&#65292;&#24182;&#32771;&#34385;&#20989;&#25968;&#30340;CPU&#21033;&#29992;&#29575;&#12289;&#24050;&#26377;&#20989;&#25968;&#23454;&#20363;&#21644;&#21709;&#24212;&#22833;&#36133;&#29575;&#31561;&#25351;&#26631;&#65292;&#26681;&#25454;&#39044;&#26399;&#38656;&#27714;&#25552;&#21069;&#20027;&#21160;&#21021;&#22987;&#21270;&#20989;&#25968;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#35299;&#20915;&#26041;&#26696;&#22312;Kubeless&#19978;&#23454;&#29616;&#24182;&#36827;&#34892;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
Function-as-a-Service is a cloud computing paradigm offering an event-driven execution model to applications. It features serverless attributes by eliminating resource management responsibilities from developers and offers transparent and on-demand scalability of applications. Typical serverless applications have stringent response time and scalability requirements and therefore rely on deployed services to provide quick and fault-tolerant feedback to clients. However, the FaaS paradigm suffers from cold starts as there is a non-negligible delay associated with on-demand function initialization. This work focuses on reducing the frequency of cold starts on the platform by using Reinforcement Learning. Our approach uses Q-learning and considers metrics such as function CPU utilization, existing function instances, and response failure rate to proactively initialize functions in advance based on the expected demand. The proposed solution was implemented on Kubeless and was evaluated usin
&lt;/p&gt;</description></item></channel></rss>