<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#26500;&#24314;&#21487;&#23548;&#20989;&#25968;&#26469;&#36817;&#20284;&#23433;&#20840;&#38598;&#21512;&#65292;&#24182;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#21270;&#25511;&#21046;&#38556;&#30861;&#20989;&#25968;&#65292;&#20197;&#35299;&#20915;&#22312;&#22797;&#26434;&#23433;&#20840;&#32422;&#26463;&#21644;&#26377;&#38480;&#25191;&#34892;&#33021;&#21147;&#19979;&#23547;&#25214;&#26368;&#20248;CBF&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2401.05629</link><description>&lt;p&gt;
&#22312;&#22797;&#26434;&#23433;&#20840;&#32422;&#26463;&#21644;&#26377;&#38480;&#25191;&#34892;&#33021;&#21147;&#19979;&#23398;&#20064;&#20197;&#24615;&#33021;&#20026;&#23548;&#21521;&#30340;&#25511;&#21046;&#38556;&#30861;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Learning Performance-Oriented Control Barrier Functions Under Complex Safety Constraints and Limited Actuation. (arXiv:2401.05629v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05629
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65292;&#36890;&#36807;&#26500;&#24314;&#21487;&#23548;&#20989;&#25968;&#26469;&#36817;&#20284;&#23433;&#20840;&#38598;&#21512;&#65292;&#24182;&#20351;&#29992;&#31070;&#32463;&#32593;&#32476;&#21442;&#25968;&#21270;&#25511;&#21046;&#38556;&#30861;&#20989;&#25968;&#65292;&#20197;&#35299;&#20915;&#22312;&#22797;&#26434;&#23433;&#20840;&#32422;&#26463;&#21644;&#26377;&#38480;&#25191;&#34892;&#33021;&#21147;&#19979;&#23547;&#25214;&#26368;&#20248;CBF&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25511;&#21046;&#38556;&#30861;&#20989;&#25968;&#65288;CBFs&#65289;&#25552;&#20379;&#20102;&#19968;&#20010;&#20248;&#38597;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#23558;&#38750;&#32447;&#24615;&#25511;&#21046;&#31995;&#32479;&#30340;&#36712;&#36857;&#32422;&#26463;&#22312;&#39044;&#23450;&#20041;&#23433;&#20840;&#38598;&#21512;&#30340;&#19981;&#21464;&#23376;&#38598;&#19978;&#65292;&#35774;&#35745;&#23433;&#20840;&#36807;&#28388;&#22120;&#12290;&#28982;&#32780;&#65292;&#25214;&#21040;&#19968;&#20010;&#21516;&#26102;&#22312;&#26368;&#22823;&#21270;&#25511;&#21046;&#19981;&#21464;&#38598;&#20307;&#31215;&#21644;&#36866;&#24212;&#22797;&#26434;&#23433;&#20840;&#32422;&#26463;&#26041;&#38754;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;CBF&#65292;&#23588;&#20854;&#26159;&#22312;&#20855;&#26377;&#25191;&#34892;&#32422;&#26463;&#30340;&#39640;&#30456;&#23545;&#24230;&#30340;&#31995;&#32479;&#20013;&#65292;&#20173;&#28982;&#26159;&#19968;&#20010;&#38382;&#39064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#26694;&#26550;&#65292;&#20840;&#38754;&#35299;&#20915;&#20102;&#36825;&#20123;&#38556;&#30861;&#12290;&#32473;&#23450;&#23450;&#20041;&#23433;&#20840;&#38598;&#21512;&#30340;&#22810;&#20010;&#29366;&#24577;&#32422;&#26463;&#30340;&#24067;&#23572;&#32452;&#21512;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20174;&#26500;&#24314;&#19968;&#20010;&#21333;&#19968;&#30340;&#21487;&#23548;&#20989;&#25968;&#24320;&#22987;&#65292;&#20854;0&#36229;&#32423;&#32423;&#21035;&#38598;&#21512;&#25552;&#20379;&#20102;&#23433;&#20840;&#38598;&#21512;&#30340;&#20869;&#37096;&#36817;&#20284;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#36825;&#20010;&#20989;&#25968;&#20197;&#21450;&#19968;&#20010;&#24179;&#28369;&#30340;&#31070;&#32463;&#32593;&#32476;&#26469;&#21442;&#25968;&#21270;CBF&#20505;&#36873;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#22522;&#20110;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;&#30340;&#35757;&#32451;&#25439;&#22833;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Control Barrier Functions (CBFs) provide an elegant framework for designing safety filters for nonlinear control systems by constraining their trajectories to an invariant subset of a prespecified safe set. However, the task of finding a CBF that concurrently maximizes the volume of the resulting control invariant set while accommodating complex safety constraints, particularly in high relative degree systems with actuation constraints, continues to pose a substantial challenge. In this work, we propose a novel self-supervised learning framework that holistically addresses these hurdles. Given a Boolean composition of multiple state constraints that define the safe set, our approach starts with building a single continuously differentiable function whose 0-superlevel set provides an inner approximation of the safe set. We then use this function together with a smooth neural network to parameterize the CBF candidate. Finally, we design a training loss function based on a Hamilton-Jacobi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#31070;&#32463;&#20250;&#21512;&#65292;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#23548;&#33322;&#21644;&#25511;&#21046;&#26694;&#26550;&#65292;&#29992;&#20110;&#21487;&#38752;&#12289;&#20934;&#30830;&#21644;&#33258;&#20027;&#22320;&#36973;&#36935;&#24555;&#36895;&#31227;&#21160;&#30340;&#26143;&#38469;&#29289;&#20307;&#12290;&#23427;&#36890;&#36807;&#28857;&#26368;&#23567;&#33539;&#25968;&#36861;&#36394;&#25511;&#21046;&#21644;&#35889;&#24402;&#19968;&#21270;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#24341;&#23548;&#31574;&#30053;&#26469;&#25552;&#20379;&#39640;&#27010;&#29575;&#25351;&#25968;&#19978;&#30028;&#30340;&#39134;&#34892;&#22120;&#20132;&#20184;&#35823;&#24046;&#12290;</title><link>http://arxiv.org/abs/2208.04883</link><description>&lt;p&gt;
&#31070;&#32463;&#20250;&#21512;&#65306;&#38754;&#21521;&#26143;&#38469;&#29289;&#20307;&#30340;&#21487;&#38752;&#23548;&#33322;&#21644;&#25511;&#21046;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Neural-Rendezvous: Provably Robust Guidance and Control to Encounter Interstellar Objects. (arXiv:2208.04883v2 [cs.RO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.04883
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#31070;&#32463;&#20250;&#21512;&#65292;&#19968;&#31181;&#28145;&#24230;&#23398;&#20064;&#23548;&#33322;&#21644;&#25511;&#21046;&#26694;&#26550;&#65292;&#29992;&#20110;&#21487;&#38752;&#12289;&#20934;&#30830;&#21644;&#33258;&#20027;&#22320;&#36973;&#36935;&#24555;&#36895;&#31227;&#21160;&#30340;&#26143;&#38469;&#29289;&#20307;&#12290;&#23427;&#36890;&#36807;&#28857;&#26368;&#23567;&#33539;&#25968;&#36861;&#36394;&#25511;&#21046;&#21644;&#35889;&#24402;&#19968;&#21270;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#24341;&#23548;&#31574;&#30053;&#26469;&#25552;&#20379;&#39640;&#27010;&#29575;&#25351;&#25968;&#19978;&#30028;&#30340;&#39134;&#34892;&#22120;&#20132;&#20184;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26143;&#38469;&#29289;&#20307;&#65288;ISOs&#65289;&#24456;&#21487;&#33021;&#26159;&#19981;&#21487;&#26367;&#20195;&#30340;&#21407;&#22987;&#26448;&#26009;&#65292;&#22312;&#29702;&#35299;&#31995;&#22806;&#34892;&#26143;&#26143;&#31995;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#20215;&#20540;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20854;&#36816;&#34892;&#36712;&#36947;&#38590;&#20197;&#32422;&#26463;&#65292;&#36890;&#24120;&#20855;&#26377;&#36739;&#39640;&#30340;&#20542;&#35282;&#21644;&#30456;&#23545;&#36895;&#24230;&#65292;&#20351;&#29992;&#20256;&#32479;&#30340;&#20154;&#22312;&#29615;&#36335;&#26041;&#27861;&#25506;&#32034;ISOs&#20855;&#26377;&#30456;&#24403;&#22823;&#30340;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#31070;&#32463;&#20250;&#21512;&#30340;&#28145;&#24230;&#23398;&#20064;&#23548;&#33322;&#21644;&#25511;&#21046;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#23454;&#26102;&#20013;&#20197;&#21487;&#38752;&#12289;&#20934;&#30830;&#21644;&#33258;&#20027;&#30340;&#26041;&#24335;&#36973;&#36935;&#24555;&#36895;&#31227;&#21160;&#30340;&#29289;&#20307;&#65292;&#21253;&#25324;ISOs&#12290;&#23427;&#22312;&#22522;&#20110;&#35889;&#24402;&#19968;&#21270;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#24341;&#23548;&#31574;&#30053;&#20043;&#19978;&#20351;&#29992;&#28857;&#26368;&#23567;&#33539;&#25968;&#36861;&#36394;&#25511;&#21046;&#65292;&#20854;&#20013;&#21442;&#25968;&#36890;&#36807;&#30452;&#25509;&#24809;&#32602;MPC&#29366;&#24577;&#36712;&#36857;&#36319;&#36394;&#35823;&#24046;&#30340;&#25439;&#22833;&#20989;&#25968;&#36827;&#34892;&#35843;&#20248;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31070;&#32463;&#20250;&#21512;&#22312;&#39044;&#26399;&#30340;&#39134;&#34892;&#22120;&#20132;&#20184;&#35823;&#24046;&#19978;&#25552;&#20379;&#20102;&#39640;&#27010;&#29575;&#25351;&#25968;&#19978;&#30028;&#65292;&#20854;&#35777;&#26126;&#21033;&#29992;&#20102;&#38543;&#26426;&#36882;&#22686;&#31283;&#23450;&#24615;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Interstellar objects (ISOs) are likely representatives of primitive materials invaluable in understanding exoplanetary star systems. Due to their poorly constrained orbits with generally high inclinations and relative velocities, however, exploring ISOs with conventional human-in-the-loop approaches is significantly challenging. This paper presents Neural-Rendezvous, a deep learning-based guidance and control framework for encountering fast-moving objects, including ISOs, robustly, accurately, and autonomously in real time. It uses pointwise minimum norm tracking control on top of a guidance policy modeled by a spectrally-normalized deep neural network, where its hyperparameters are tuned with a loss function directly penalizing the MPC state trajectory tracking error. We show that Neural-Rendezvous provides a high probability exponential bound on the expected spacecraft delivery error, the proof of which leverages stochastic incremental stability analysis. In particular, it is used to
&lt;/p&gt;</description></item></channel></rss>