<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102; PathMLP&#65292;&#19968;&#31181;&#22522;&#20110;&#30456;&#20284;&#24615;&#36335;&#24452;&#37319;&#26679;&#31574;&#30053;&#30340;&#36731;&#37327;&#21270;&#27169;&#22411;&#65292;&#23427;&#33021;&#22815;&#20811;&#26381;&#20256;&#32479; GNNs &#20013;&#22312;&#33719;&#24471;&#39640;&#38454;&#20449;&#24687;&#36807;&#31243;&#20013;&#23384;&#22312;&#30340;&#32570;&#38519;&#65292;&#21363;&#36807;&#24230;&#24179;&#28369;&#38382;&#39064;&#12289;&#39640;&#38454;&#20449;&#24687;&#26410;&#20805;&#20998;&#21033;&#29992;&#20197;&#21450;&#35745;&#31639;&#25928;&#29575;&#20302;&#31561;&#38382;&#39064;&#65292;&#24182;&#33021;&#22815;&#21033;&#29992;&#39640;&#38454;&#20449;&#24687;&#36827;&#34892;&#33410;&#28857;&#34920;&#31034;&#23398;&#20064;&#12290;</title><link>http://arxiv.org/abs/2306.13532</link><description>&lt;p&gt;
PathMLP&#65306;&#39640;&#38454;&#21516;&#36136;&#24615;&#30340;&#24179;&#28369;&#36335;&#24452;
&lt;/p&gt;
&lt;p&gt;
PathMLP: Smooth Path Towards High-order Homophily. (arXiv:2306.13532v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13532
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102; PathMLP&#65292;&#19968;&#31181;&#22522;&#20110;&#30456;&#20284;&#24615;&#36335;&#24452;&#37319;&#26679;&#31574;&#30053;&#30340;&#36731;&#37327;&#21270;&#27169;&#22411;&#65292;&#23427;&#33021;&#22815;&#20811;&#26381;&#20256;&#32479; GNNs &#20013;&#22312;&#33719;&#24471;&#39640;&#38454;&#20449;&#24687;&#36807;&#31243;&#20013;&#23384;&#22312;&#30340;&#32570;&#38519;&#65292;&#21363;&#36807;&#24230;&#24179;&#28369;&#38382;&#39064;&#12289;&#39640;&#38454;&#20449;&#24687;&#26410;&#20805;&#20998;&#21033;&#29992;&#20197;&#21450;&#35745;&#31639;&#25928;&#29575;&#20302;&#31561;&#38382;&#39064;&#65292;&#24182;&#33021;&#22815;&#21033;&#29992;&#39640;&#38454;&#20449;&#24687;&#36827;&#34892;&#33410;&#28857;&#34920;&#31034;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#38469;&#30340;&#22270;&#34920;&#29616;&#20986;&#36234;&#26469;&#36234;&#22810;&#30340;&#24322;&#36136;&#24615;&#65292;&#33410;&#28857;&#19981;&#20877;&#20542;&#21521;&#20110;&#36830;&#25509;&#20855;&#26377;&#30456;&#21516;&#26631;&#31614;&#30340;&#33410;&#28857;&#65292;&#25361;&#25112;&#20102;&#32463;&#20856;&#22270;&#31070;&#32463;&#32593;&#32476;(GNNs)&#30340;&#21516;&#36136;&#24615;&#20551;&#35774;&#24182;&#38459;&#30861;&#20102;&#23427;&#20204;&#30340;&#24615;&#33021;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#26576;&#20123;&#24322;&#36136;&#25968;&#25454;&#30340;&#39640;&#38454;&#20449;&#24687;&#34920;&#29616;&#20986;&#39640;&#21516;&#36136;&#24615;&#65292;&#36825;&#20419;&#20351;&#25105;&#20204;&#22312;&#33410;&#28857;&#34920;&#31034;&#23398;&#20064;&#20013;&#28041;&#21450;&#39640;&#38454;&#20449;&#24687;&#12290;&#28982;&#32780;&#65292;GNNs&#20013;&#33719;&#24471;&#39640;&#38454;&#20449;&#24687;&#30340;&#24120;&#35265;&#20570;&#27861;&#20027;&#35201;&#36890;&#36807;&#22686;&#21152;&#27169;&#22411;&#28145;&#24230;&#21644;&#25913;&#21464;&#28040;&#24687;&#20256;&#36882;&#26426;&#21046;&#65292;&#34429;&#28982;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#26159;&#26377;&#25928;&#30340;&#65292;&#20294;&#23427;&#20204;&#23384;&#22312;&#19977;&#20010;&#32570;&#28857;&#65306;1&#65289;&#30001;&#20110;&#36807;&#24230;&#30340;&#27169;&#22411;&#28145;&#24230;&#21644;&#20256;&#25773;&#26102;&#38388;&#32780;&#36807;&#24230;&#24179;&#28369;; 2&#65289;&#39640;&#38454;&#20449;&#24687;&#27809;&#26377;&#20805;&#20998;&#21033;&#29992;; 3&#65289;&#35745;&#31639;&#25928;&#29575;&#20302;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#22522;&#20110;&#30456;&#20284;&#24615;&#30340;&#36335;&#24452;&#37319;&#26679;&#31574;&#30053;&#65292;&#29992;&#20110;&#25429;&#33719;&#21253;&#21547;&#39640;&#38454;&#21516;&#36136;&#24615;&#30340;&#24179;&#28369;&#36335;&#24452;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#22810;&#23618;&#24863;&#30693;&#22120;(Multi-layer Perceptrons, MLP)&#30340;&#36731;&#37327;&#21270;&#27169;&#22411;&#65292;&#31216;&#20043;&#20026;PathMLP&#12290;
&lt;/p&gt;
&lt;p&gt;
Real-world graphs exhibit increasing heterophily, where nodes no longer tend to be connected to nodes with the same label, challenging the homophily assumption of classical graph neural networks (GNNs) and impeding their performance. Intriguingly, we observe that certain high-order information on heterophilous data exhibits high homophily, which motivates us to involve high-order information in node representation learning. However, common practices in GNNs to acquire high-order information mainly through increasing model depth and altering message-passing mechanisms, which, albeit effective to a certain extent, suffer from three shortcomings: 1) over-smoothing due to excessive model depth and propagation times; 2) high-order information is not fully utilized; 3) low computational efficiency. In this regard, we design a similarity-based path sampling strategy to capture smooth paths containing high-order homophily. Then we propose a lightweight model based on multi-layer perceptrons (M
&lt;/p&gt;</description></item></channel></rss>