<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38647;&#36798;&#25968;&#25454;&#23398;&#20064;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#25856;&#21319;&#39134;&#26426;&#30340;&#36712;&#36857;&#65292;&#24182;&#36890;&#36807;&#23398;&#20064;&#20462;&#27491;&#25512;&#21147;&#30340;&#20989;&#25968;&#26469;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#35813;&#26041;&#27861;&#30340;&#20248;&#21183;&#21253;&#25324;&#65306;&#19982;&#26631;&#20934;&#27169;&#22411;&#30456;&#27604;&#65292;&#21040;&#36798;&#26102;&#38388;&#30340;&#39044;&#27979;&#35823;&#24046;&#20943;&#23569;&#20102;66.3%&#65307;&#29983;&#25104;&#30340;&#36712;&#36857;&#19982;&#27979;&#35797;&#25968;&#25454;&#30456;&#27604;&#26356;&#21152;&#30495;&#23454;&#65307;&#24182;&#19988;&#33021;&#22815;&#20197;&#26368;&#23567;&#30340;&#35745;&#31639;&#25104;&#26412;&#35745;&#31639;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2309.14941</link><description>&lt;p&gt;
&#20174;&#38647;&#36798;&#25968;&#25454;&#23398;&#20064;&#25856;&#21319;&#39134;&#26426;&#30340;&#29983;&#25104;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Learning Generative Models for Climbing Aircraft from Radar Data. (arXiv:2309.14941v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14941
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38647;&#36798;&#25968;&#25454;&#23398;&#20064;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#25856;&#21319;&#39134;&#26426;&#30340;&#36712;&#36857;&#65292;&#24182;&#36890;&#36807;&#23398;&#20064;&#20462;&#27491;&#25512;&#21147;&#30340;&#20989;&#25968;&#26469;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#35813;&#26041;&#27861;&#30340;&#20248;&#21183;&#21253;&#25324;&#65306;&#19982;&#26631;&#20934;&#27169;&#22411;&#30456;&#27604;&#65292;&#21040;&#36798;&#26102;&#38388;&#30340;&#39044;&#27979;&#35823;&#24046;&#20943;&#23569;&#20102;66.3%&#65307;&#29983;&#25104;&#30340;&#36712;&#36857;&#19982;&#27979;&#35797;&#25968;&#25454;&#30456;&#27604;&#26356;&#21152;&#30495;&#23454;&#65307;&#24182;&#19988;&#33021;&#22815;&#20197;&#26368;&#23567;&#30340;&#35745;&#31639;&#25104;&#26412;&#35745;&#31639;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25856;&#21319;&#39134;&#26426;&#30340;&#20934;&#30830;&#36712;&#36857;&#39044;&#27979;&#21463;&#21040;&#26426;&#36733;&#35774;&#22791;&#25805;&#20316;&#30340;&#19981;&#30830;&#23450;&#24615;&#30340;&#24433;&#21709;&#65292;&#21487;&#33021;&#23548;&#33268;&#39044;&#27979;&#36712;&#36857;&#19982;&#35266;&#27979;&#36712;&#36857;&#20043;&#38388;&#23384;&#22312;&#26174;&#33879;&#30340;&#24046;&#24322;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#27169;&#22411;&#65292;&#36890;&#36807;&#20174;&#25968;&#25454;&#20013;&#23398;&#20064;&#20462;&#27491;&#25512;&#21147;&#30340;&#20989;&#25968;&#26469;&#20016;&#23500;&#26631;&#20934;&#30340;&#39134;&#26426;&#22522;&#30784;&#25968;&#25454;&#65288;BADA&#65289;&#27169;&#22411;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#19977;&#20010;&#29305;&#28857;&#65306;&#19982;BADA&#30456;&#27604;&#65292;&#21040;&#36798;&#26102;&#38388;&#30340;&#39044;&#27979;&#35823;&#24046;&#20943;&#23569;&#20102;66.3%&#65307;&#29983;&#25104;&#30340;&#36712;&#36857;&#19982;&#27979;&#35797;&#25968;&#25454;&#30456;&#27604;&#26356;&#21152;&#30495;&#23454;&#65307;&#24182;&#19988;&#33021;&#22815;&#20197;&#26368;&#23567;&#30340;&#35745;&#31639;&#25104;&#26412;&#35745;&#31639;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurate trajectory prediction (TP) for climbing aircraft is hampered by the presence of epistemic uncertainties concerning aircraft operation, which can lead to significant misspecification between predicted and observed trajectories. This paper proposes a generative model for climbing aircraft in which the standard Base of Aircraft Data (BADA) model is enriched by a functional correction to the thrust that is learned from data. The method offers three features: predictions of the arrival time with 66.3% less error when compared to BADA; generated trajectories that are realistic when compared to test data; and a means of computing confidence bounds for minimal computational cost.
&lt;/p&gt;</description></item></channel></rss>