<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;Data Center Carbon Footprint Reduction (DC-CFR) &#22810;&#20195;&#29702;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#26694;&#26550;&#65292;&#26088;&#22312;&#23454;&#26102;&#20248;&#21270;&#25968;&#25454;&#20013;&#24515;&#20197;&#20943;&#23569;&#30899;&#36275;&#36857;&#12290;</title><link>https://arxiv.org/abs/2403.14092</link><description>&lt;p&gt;
&#21487;&#25345;&#32493;&#25968;&#25454;&#20013;&#24515;&#23454;&#26102;&#20943;&#23569;&#30899;&#36275;&#36857;
&lt;/p&gt;
&lt;p&gt;
Carbon Footprint Reduction for Sustainable Data Centers in Real-Time
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14092
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;Data Center Carbon Footprint Reduction (DC-CFR) &#22810;&#20195;&#29702;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#26694;&#26550;&#65292;&#26088;&#22312;&#23454;&#26102;&#20248;&#21270;&#25968;&#25454;&#20013;&#24515;&#20197;&#20943;&#23569;&#30899;&#36275;&#36857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#26426;&#22120;&#23398;&#20064;&#24037;&#20316;&#36127;&#36733;&#26174;&#33879;&#22686;&#21152;&#33021;&#28304;&#28040;&#32791;&#65292;&#30899;&#25490;&#25918;&#20302;&#30340;&#21487;&#25345;&#32493;&#25968;&#25454;&#20013;&#24515;&#27491;&#25104;&#20026;&#20840;&#29699;&#25919;&#24220;&#21644;&#20225;&#19994;&#20851;&#27880;&#30340;&#37325;&#28857;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#38656;&#35201;&#22312;&#20919;&#21364;&#21644;IT&#36127;&#36733;&#20013;&#36827;&#34892;&#21151;&#32791;&#20248;&#21270;&#30340;&#33539;&#24335;&#36716;&#21464;&#65292;&#22522;&#20110;&#21487;&#20877;&#29983;&#33021;&#28304;&#22312;&#30005;&#32593;&#20013;&#30340;&#21487;&#29992;&#24615;&#26469;&#35843;&#25972;&#28789;&#27963;&#36127;&#36733;&#65292;&#21033;&#29992;&#25968;&#25454;&#20013;&#24515;&#19981;&#38388;&#26029;&#30005;&#28304;&#20013;&#30340;&#30005;&#27744;&#23384;&#20648;&#65292;&#20351;&#29992;&#21327;&#20316;&#20195;&#29702;&#12290;&#36825;&#20123;&#20248;&#21270;&#31574;&#30053;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#20197;&#21450;&#23427;&#20204;&#23545;&#21464;&#21270;&#30340;&#22806;&#37096;&#22240;&#32032;&#65288;&#22914;&#22825;&#27668;&#21644;&#30005;&#32593;&#30899;&#25490;&#25918;&#24378;&#24230;&#65289;&#30340;&#20381;&#36182;&#20351;&#24471;&#36825;&#26159;&#19968;&#20010;&#22256;&#38590;&#30340;&#38382;&#39064;&#12290;&#30446;&#21069;&#32570;&#20047;&#19968;&#20010;&#33021;&#22815;&#22312;&#21160;&#24577;&#23454;&#38469;&#29615;&#22659;&#20013;&#21516;&#26102;&#20248;&#21270;&#25152;&#26377;&#36825;&#20123;&#30446;&#26631;&#30340;&#23454;&#26102;&#25511;&#21046;&#22120;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#25454;&#20013;&#24515;&#30899;&#36275;&#36857;&#20943;&#23569;&#65288;DC-CFR&#65289;&#22810;&#20195;&#29702;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#26694;&#26550;&#65292;&#33021;&#22815;&#20248;&#21270;&#22810;&#20010;&#35282;&#24230;&#30340;&#25968;&#25454;&#20013;&#24515;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14092v1 Announce Type: cross  Abstract: As machine learning workloads significantly increase energy consumption, sustainable data centers with low carbon emissions are becoming a top priority for governments and corporations worldwide. This requires a paradigm shift in optimizing power consumption in cooling and IT loads, shifting flexible loads based on the availability of renewable energy in the power grid, and leveraging battery storage from the uninterrupted power supply in data centers, using collaborative agents. The complex association between these optimization strategies and their dependencies on variable external factors like weather and the power grid carbon intensity makes this a hard problem. Currently, a real-time controller to optimize all these goals simultaneously in a dynamic real-world setting is lacking. We propose a Data Center Carbon Footprint Reduction (DC-CFR) multi-agent Reinforcement Learning (MARL) framework that optimizes data centers for the mult
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20197;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#20998;&#26512;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#20013;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#22797;&#26434;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.03340</link><description>&lt;p&gt;
&#23450;&#21521;&#28436;&#21270;&#21644;&#29983;&#24577;&#36827;&#21270;&#21160;&#21147;&#23398;&#30340;&#29983;&#29289;&#29289;&#29702;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Biophysical Cybernetics of Directed Evolution and Eco-evolutionary Dynamics. (arXiv:2305.03340v1 [q-bio.PE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03340
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20197;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#20998;&#26512;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#20013;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#22797;&#26434;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36827;&#21270;&#21160;&#21147;&#23398;&#20013;&#30340;&#35768;&#22810;&#37325;&#35201;&#38382;&#39064;&#21487;&#20197;&#22312;&#21338;&#24328;&#29702;&#35770;&#32972;&#26223;&#19979;&#20197;&#38543;&#26426;&#36712;&#36857;&#20998;&#26512;&#30340;&#26041;&#24335;&#26377;&#24847;&#20041;&#22320;&#26144;&#23556;&#21040;&#20998;&#26512;&#20013;&#12290;&#36890;&#24120;&#30340;&#26041;&#27861;&#26159;&#20998;&#26512;&#23569;&#37327;&#19981;&#21516;&#30340;&#32676;&#20307;&#21644;/&#25110;&#20551;&#35774;&#21160;&#21147;&#23398;&#21457;&#29983;&#22312;&#20154;&#21475;&#35268;&#27169;&#22823;&#21040;&#36275;&#20197;&#20351;&#30830;&#23450;&#24615;&#36712;&#36857;&#25104;&#20026;&#29616;&#23454;&#30340;&#21306;&#22495;&#12290;&#34987;&#31216;&#20026;&#8220;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#8221;&#30340;&#29983;&#24577;&#22240;&#32032;&#30340;&#28155;&#21152;&#36827;&#19968;&#27493;&#22797;&#26434;&#21270;&#20102;&#21160;&#21147;&#23398;&#65292;&#24182;&#23548;&#33268;&#35768;&#22810;&#38382;&#39064;&#38590;&#20197;&#22788;&#29702;&#25110;&#24403;&#21069;&#30340;&#29702;&#35770;&#26041;&#27861;&#38590;&#20197;&#23454;&#38469;&#24212;&#29992;&#12290;&#20294;&#26159;&#65292;&#19968;&#31181;&#31867;&#20284;&#20294;&#26410;&#34987;&#20805;&#20998;&#25506;&#35752;&#30340;&#26041;&#27861;&#26159;&#23558;&#37325;&#28857;&#25918;&#22312;&#27169;&#22411;&#26412;&#36523;&#30340;&#19981;&#30830;&#23450;&#24615;&#19978;&#65292;&#20381;&#25454;&#24378;&#21270;&#23398;&#20064;&#39046;&#22495;&#21644;&#30456;&#37051;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#30340;&#35821;&#35328;&#65292;&#32780;&#34987;&#31216;&#20026;&#8220;&#37096;&#20998;&#21487;&#35266;&#23519;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#8221;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#23545;&#20598;&#24615;&#65292;&#23558;&#21516;&#26102;&#32771;&#34385;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#30340;&#22797;&#26434;&#24615;&#26144;&#23556;&#21040;&#19968;&#20010;&#26032;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many major questions in the theory of evolutionary dynamics can in a meaningful sense be mapped to analyses of stochastic trajectories in game theoretic contexts. Often the approach is to analyze small numbers of distinct populations and/or to assume dynamics occur within a regime of population sizes large enough that deterministic trajectories are an excellent approximation of reality. The addition of ecological factors, termed "eco-evolutionary dynamics", further complicates the dynamics and results in many problems which are intractable or impractically messy for current theoretical methods. However, an analogous but underexplored approach is to analyze these systems with an eye primarily towards uncertainty in the models themselves. In the language of researchers in Reinforcement Learning and adjacent fields, a Partially Observable Markov Process. Here we introduce a duality which maps the complexity of accounting for both ecology and individual genotypic/phenotypic types onto a pr
&lt;/p&gt;</description></item></channel></rss>