<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#30740;&#31350;&#22312;VoIP&#36890;&#20449;&#39046;&#22495;&#20013;&#25506;&#32034;&#20102;&#22768;&#23398;&#36716;&#25442;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#24515;&#29702;&#22768;&#23398;&#25351;&#26631;&#65292;&#25581;&#31034;&#20102;&#35821;&#38899;&#22686;&#24378;&#23545;VoIP&#31995;&#32479;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.07161</link><description>&lt;p&gt;
VoIP&#24179;&#21488;&#19978;&#35821;&#38899;&#22686;&#24378;&#30340;&#24515;&#29702;&#22768;&#23398;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
Psychoacoustic Challenges Of Speech Enhancement On VoIP Platforms. (arXiv:2310.07161v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07161
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;VoIP&#36890;&#20449;&#39046;&#22495;&#20013;&#25506;&#32034;&#20102;&#22768;&#23398;&#36716;&#25442;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#24515;&#29702;&#22768;&#23398;&#25351;&#26631;&#65292;&#25581;&#31034;&#20102;&#35821;&#38899;&#22686;&#24378;&#23545;VoIP&#31995;&#32479;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;VoIP&#65288;&#20114;&#32852;&#32593;&#35821;&#38899;&#20256;&#36755;&#21327;&#35758;&#65289;&#36890;&#20449;&#20013;&#65292;&#30001;&#22768;&#23398;&#36716;&#25442;&#24341;&#20837;&#30340;&#22797;&#26434;&#24615;&#38656;&#35201;&#36827;&#34892;&#20005;&#26684;&#30340;&#20998;&#26512;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#23545;&#19987;&#26377;&#21457;&#36865;&#31471;&#38477;&#22122;&#25928;&#26524;&#30340;&#25506;&#32034;&#65292;&#23545;Google Meets&#21644;Zoom&#31561;&#24179;&#21488;&#36827;&#34892;&#20102;&#32454;&#33268;&#35780;&#20272;&#12290;&#30740;&#31350;&#21033;&#29992;Deep Noise Suppression&#65288;DNS&#65289;2020&#25968;&#25454;&#38598;&#65292;&#30830;&#20445;&#20102;&#38024;&#23545;&#21508;&#31181;&#38477;&#22122;&#35774;&#32622;&#21644;&#25509;&#25910;&#22120;&#25509;&#21475;&#30340;&#32467;&#26500;&#21270;&#32771;&#23519;&#12290;&#36890;&#36807;&#23558;Oaxaca&#20998;&#35299;&#24341;&#20837;&#21040;&#22768;&#23398;-&#35821;&#38899;&#25200;&#21160;&#20998;&#26512;&#20013;&#65292;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26041;&#27861;&#35770;&#30340;&#21019;&#26032;&#65292;&#35813;&#20998;&#35299;&#36890;&#24120;&#26159;&#32463;&#27982;&#35745;&#37327;&#23398;&#24037;&#20855;&#65292;&#22312;&#27492;&#22788;&#37325;&#26032;&#29992;&#20110;&#20998;&#26512;VoIP&#31995;&#32479;&#20013;&#30340;&#22768;&#23398;-&#35821;&#38899;&#25200;&#21160;&#12290;&#20026;&#20102;&#36827;&#19968;&#27493;&#30830;&#23450;&#36825;&#20123;&#36716;&#25442;&#30340;&#24433;&#21709;&#65292;&#21033;&#29992;&#24515;&#29702;&#22768;&#23398;&#25351;&#26631;&#65292;&#29305;&#21035;&#26159;PESQ&#21644;STOI&#65292;&#26469;&#25552;&#20379;&#23545;&#35821;&#38899;&#25913;&#21464;&#30340;&#20840;&#38754;&#29702;&#35299;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25152;&#33719;&#24471;&#30340;&#35266;&#28857;&#31361;&#20986;&#26174;&#31034;&#20102;VoIP&#24433;&#21709;&#30340;&#22768;&#23398;&#21160;&#21147;&#23398;&#30340;&#22797;&#26434;&#26223;&#35266;&#12290;
&lt;/p&gt;
&lt;p&gt;
Within the ambit of VoIP (Voice over Internet Protocol) telecommunications, the complexities introduced by acoustic transformations merit rigorous analysis. This research, rooted in the exploration of proprietary sender-side denoising effects, meticulously evaluates platforms such as Google Meets and Zoom. The study draws upon the Deep Noise Suppression (DNS) 2020 dataset, ensuring a structured examination tailored to various denoising settings and receiver interfaces. A methodological novelty is introduced via the Oaxaca decomposition, traditionally an econometric tool, repurposed herein to analyze acoustic-phonetic perturbations within VoIP systems. To further ground the implications of these transformations, psychoacoustic metrics, specifically PESQ and STOI, were harnessed to furnish a comprehensive understanding of speech alterations. Cumulatively, the insights garnered underscore the intricate landscape of VoIP-influenced acoustic dynamics. In addition to the primary findings, a 
&lt;/p&gt;</description></item></channel></rss>