<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38899;&#20048;&#35821;&#27861;&#35843;&#33410;&#23574;&#23792;&#31070;&#32463;&#32593;&#32476;&#28608;&#27963;&#30340;&#26032;&#39062;&#26041;&#27861;&#65292;&#36890;&#36807;&#24212;&#29992;&#38899;&#20048;&#29702;&#35770;&#20013;&#30340;&#21644;&#24358;&#36827;&#34892;&#35268;&#21017;&#65292;&#23637;&#31034;&#20102;&#22914;&#20309;&#33258;&#28982;&#22320;&#36319;&#38543;&#20854;&#20182;&#28608;&#27963;&#65292;&#26368;&#32456;&#23558;&#27010;&#24565;&#30340;&#26144;&#23556;&#32467;&#26500;&#21270;&#20026;&#38899;&#20048;&#20116;&#24230;&#22278;&#12290;</title><link>https://arxiv.org/abs/2403.00790</link><description>&lt;p&gt;
&#21033;&#29992;&#38899;&#20048;&#20116;&#24230;&#22278;&#26500;&#24314;&#27010;&#24565;&#31354;&#38388;&#65306;&#22522;&#20110;&#38899;&#20048;&#35821;&#27861;&#28608;&#27963;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Structuring Concept Space with the Musical Circle of Fifths by Utilizing Music Grammar Based Activations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00790
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38899;&#20048;&#35821;&#27861;&#35843;&#33410;&#23574;&#23792;&#31070;&#32463;&#32593;&#32476;&#28608;&#27963;&#30340;&#26032;&#39062;&#26041;&#27861;&#65292;&#36890;&#36807;&#24212;&#29992;&#38899;&#20048;&#29702;&#35770;&#20013;&#30340;&#21644;&#24358;&#36827;&#34892;&#35268;&#21017;&#65292;&#23637;&#31034;&#20102;&#22914;&#20309;&#33258;&#28982;&#22320;&#36319;&#38543;&#20854;&#20182;&#28608;&#27963;&#65292;&#26368;&#32456;&#23558;&#27010;&#24565;&#30340;&#26144;&#23556;&#32467;&#26500;&#21270;&#20026;&#38899;&#20048;&#20116;&#24230;&#22278;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#31163;&#25955;&#31070;&#32463;&#32593;&#32476;&#65288;&#22914;&#23574;&#23792;&#32593;&#32476;&#65289;&#30340;&#32467;&#26500;&#19982;&#38050;&#29748;&#26354;&#30340;&#26500;&#25104;&#20043;&#38388;&#30340;&#26377;&#36259;&#30456;&#20284;&#20043;&#22788;&#12290;&#34429;&#28982;&#20004;&#32773;&#37117;&#28041;&#21450;&#25353;&#39034;&#24207;&#25110;&#24182;&#34892;&#28608;&#27963;&#30340;&#33410;&#28857;&#25110;&#38899;&#31526;&#65292;&#20294;&#21518;&#32773;&#21463;&#30410;&#20110;&#20016;&#23500;&#30340;&#38899;&#20048;&#29702;&#35770;&#65292;&#20197;&#25351;&#23548;&#26377;&#24847;&#20041;&#30340;&#32452;&#21512;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#38899;&#20048;&#35821;&#27861;&#26469;&#35843;&#33410;&#23574;&#23792;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#28608;&#27963;&#65292;&#20801;&#35768;&#23558;&#31526;&#21495;&#34920;&#31034;&#20026;&#21560;&#24341;&#23376;&#12290;&#36890;&#36807;&#24212;&#29992;&#38899;&#20048;&#29702;&#35770;&#20013;&#30340;&#21644;&#24358;&#36827;&#34892;&#35268;&#21017;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#26576;&#20123;&#28608;&#27963;&#22914;&#20309;&#33258;&#28982;&#22320;&#36319;&#38543;&#20854;&#20182;&#28608;&#27963;&#65292;&#31867;&#20284;&#20110;&#21560;&#24341;&#30340;&#27010;&#24565;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#35843;&#21046;&#38899;&#35843;&#30340;&#27010;&#24565;&#65292;&#20197;&#22312;&#32593;&#32476;&#20869;&#23548;&#33322;&#19981;&#21516;&#30340;&#21560;&#24341;&#30406;&#22320;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#27169;&#22411;&#20013;&#27010;&#24565;&#30340;&#26144;&#23556;&#26159;&#30001;&#38899;&#20048;&#20116;&#24230;&#22278;&#26500;&#25104;&#30340;&#65292;&#31361;&#20986;&#20102;&#21033;&#29992;&#38899;&#20048;&#29702;&#35770;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00790v1 Announce Type: cross  Abstract: In this paper, we explore the intriguing similarities between the structure of a discrete neural network, such as a spiking network, and the composition of a piano piece. While both involve nodes or notes that are activated sequentially or in parallel, the latter benefits from the rich body of music theory to guide meaningful combinations. We propose a novel approach that leverages musical grammar to regulate activations in a spiking neural network, allowing for the representation of symbols as attractors. By applying rules for chord progressions from music theory, we demonstrate how certain activations naturally follow others, akin to the concept of attraction. Furthermore, we introduce the concept of modulating keys to navigate different basins of attraction within the network. Ultimately, we show that the map of concepts in our model is structured by the musical circle of fifths, highlighting the potential for leveraging music theor
&lt;/p&gt;</description></item></channel></rss>