<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#20445;&#30041;&#36793;&#30340;&#31526;&#21495;&#22312;&#32593;&#32476;&#26500;&#24314;&#36807;&#31243;&#20013;&#25552;&#39640;&#20102;&#20272;&#35745;&#21644;&#32858;&#31867;&#31934;&#24230;&#65292;&#26377;&#21161;&#20110;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.10242</link><description>&lt;p&gt;
&#26377;&#31526;&#21495;&#22810;&#26679;&#21270;&#22810;&#37325;&#32593;&#32476;&#65306;&#32858;&#31867;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Signed Diverse Multiplex Networks: Clustering and Inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10242
&lt;/p&gt;
&lt;p&gt;
&#20445;&#30041;&#36793;&#30340;&#31526;&#21495;&#22312;&#32593;&#32476;&#26500;&#24314;&#36807;&#31243;&#20013;&#25552;&#39640;&#20102;&#20272;&#35745;&#21644;&#32858;&#31867;&#31934;&#24230;&#65292;&#26377;&#21161;&#20110;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26377;&#31526;&#21495;&#30340;&#24191;&#20041;&#38543;&#26426;&#28857;&#31215;&#22270;&#65288;SGRDPG&#65289;&#27169;&#22411;&#65292;&#36825;&#26159;&#24191;&#20041;&#38543;&#26426;&#28857;&#31215;&#22270;&#65288;GRDPG&#65289;&#30340;&#19968;&#20010;&#21464;&#31181;&#65292;&#20854;&#20013;&#36793;&#21487;&#20197;&#26159;&#27491;&#30340;&#20063;&#21487;&#20197;&#26159;&#36127;&#30340;&#12290;&#35813;&#35774;&#32622;&#34987;&#25193;&#23637;&#20026;&#22810;&#37325;&#32593;&#32476;&#29256;&#26412;&#65292;&#20854;&#20013;&#25152;&#26377;&#23618;&#20855;&#26377;&#30456;&#21516;&#30340;&#33410;&#28857;&#38598;&#21512;&#24182;&#36981;&#24490;SGRDPG&#12290;&#32593;&#32476;&#23618;&#30340;&#21807;&#19968;&#20844;&#20849;&#29305;&#24449;&#26159;&#23427;&#20204;&#21487;&#20197;&#34987;&#21010;&#20998;&#20026;&#20855;&#26377;&#20849;&#21516;&#23376;&#31354;&#38388;&#32467;&#26500;&#30340;&#32452;&#65292;&#32780;&#20854;&#20182;&#24773;&#20917;&#19979;&#25152;&#26377;&#36830;&#25509;&#27010;&#29575;&#30697;&#38453;&#21487;&#33021;&#26159;&#23436;&#20840;&#19981;&#21516;&#30340;&#12290;&#19978;&#36848;&#35774;&#32622;&#38750;&#24120;&#28789;&#27963;&#65292;&#24182;&#21253;&#25324;&#21508;&#31181;&#29616;&#26377;&#22810;&#37325;&#32593;&#32476;&#27169;&#22411;&#20316;&#20026;&#20854;&#29305;&#20363;&#12290;&#35770;&#25991;&#23454;&#29616;&#20102;&#20004;&#20010;&#30446;&#26631;&#12290;&#39318;&#20808;&#65292;&#23427;&#34920;&#26126;&#22312;&#32593;&#32476;&#26500;&#24314;&#36807;&#31243;&#20013;&#20445;&#30041;&#36793;&#30340;&#31526;&#21495;&#20250;&#23548;&#33268;&#26356;&#22909;&#30340;&#20272;&#35745;&#21644;&#32858;&#31867;&#31934;&#24230;&#65292;&#22240;&#27492;&#26377;&#21161;&#20110;&#24212;&#23545;&#35832;&#22914;&#22823;&#33041;&#32593;&#32476;&#20998;&#26512;&#20043;&#31867;&#30340;&#29616;&#23454;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10242v1 Announce Type: cross  Abstract: The paper introduces a Signed Generalized Random Dot Product Graph (SGRDPG) model, which is a variant of the Generalized Random Dot Product Graph (GRDPG), where, in addition, edges can be positive or negative. The setting is extended to a multiplex version, where all layers have the same collection of nodes and follow the SGRDPG. The only common feature of the layers of the network is that they can be partitioned into groups with common subspace structures, while otherwise all matrices of connection probabilities can be all different. The setting above is extremely flexible and includes a variety of existing multiplex network models as its particular cases. The paper fulfills two objectives. First, it shows that keeping signs of the edges in the process of network construction leads to a better precision of estimation and clustering and, hence, is beneficial for tackling real world problems such as analysis of brain networks. Second, b
&lt;/p&gt;</description></item></channel></rss>