<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>GFairHint&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#36741;&#21161;&#38142;&#25509;&#39044;&#27979;&#20219;&#21153;&#23398;&#20064;&#20844;&#24179;&#34920;&#31034;&#65292;&#24182;&#23558;&#20854;&#19982;&#21407;&#22987;&#22270;&#23884;&#20837;&#36830;&#25509;&#20197;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#21516;&#26102;&#19981;&#29306;&#29298;&#24615;&#33021;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2305.15622</link><description>&lt;p&gt;
GFairHint&#65306;&#36890;&#36807;&#20844;&#24179;&#24615;&#25552;&#31034;&#25552;&#39640;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#20010;&#20307;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
GFairHint: Improving Individual Fairness for Graph Neural Networks via Fairness Hint. (arXiv:2305.15622v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15622
&lt;/p&gt;
&lt;p&gt;
GFairHint&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#36741;&#21161;&#38142;&#25509;&#39044;&#27979;&#20219;&#21153;&#23398;&#20064;&#20844;&#24179;&#34920;&#31034;&#65292;&#24182;&#23558;&#20854;&#19982;&#21407;&#22987;&#22270;&#23884;&#20837;&#36830;&#25509;&#20197;&#22686;&#24378;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#21516;&#26102;&#19981;&#29306;&#29298;&#24615;&#33021;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#26426;&#22120;&#23398;&#20064;&#20013;&#20844;&#24179;&#24615;&#38382;&#39064;&#26085;&#30410;&#21463;&#21040;&#20851;&#27880;&#20197;&#21450;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#22312;&#22270;&#25968;&#25454;&#23398;&#20064;&#19978;&#30340;&#21331;&#36234;&#34920;&#29616;&#65292;GNN&#20013;&#30340;&#31639;&#27861;&#20844;&#24179;&#24615;&#21463;&#21040;&#20102;&#24191;&#27867;&#20851;&#27880;&#12290;&#34429;&#28982;&#35768;&#22810;&#29616;&#26377;&#30340;&#30740;&#31350;&#22312;&#32676;&#20307;&#23618;&#38754;&#19978;&#25913;&#21892;&#20102;&#20844;&#24179;&#24615;&#65292;&#20294;&#21482;&#26377;&#23569;&#25968;&#24037;&#20316;&#20419;&#36827;&#20102;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#36825;&#20351;&#24471;&#30456;&#20284;&#30340;&#20010;&#20307;&#20855;&#26377;&#30456;&#20284;&#30340;&#32467;&#26524;&#12290;&#20419;&#36827;&#20010;&#20307;&#20844;&#24179;&#24615;&#30340;&#29702;&#24819;&#26694;&#26550;&#24212;&#35813;&#65288;1&#65289;&#22312;&#20844;&#24179;&#24615;&#21644;&#24615;&#33021;&#20043;&#38388;&#24179;&#34913;&#65292;&#65288;2&#65289;&#36866;&#24212;&#20004;&#31181;&#24120;&#29992;&#30340;&#20010;&#20307;&#30456;&#20284;&#24615;&#24230;&#37327;&#65288;&#20174;&#22806;&#37096;&#27880;&#37322;&#21644;&#20174;&#36755;&#20837;&#29305;&#24449;&#35745;&#31639;&#65289;&#65292;&#65288;3&#65289;&#27178;&#36328;&#21508;&#31181;GNN&#27169;&#22411;&#36827;&#34892;&#25512;&#24191;&#65292;&#65288;4&#65289;&#20855;&#26377;&#39640;&#25928;&#30340;&#35745;&#31639;&#33021;&#21147;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#20043;&#21069;&#30340;&#24037;&#20316;&#37117;&#27809;&#26377;&#23454;&#29616;&#25152;&#26377;&#30340;&#29702;&#24819;&#26465;&#20214;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;GFairHint&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#36741;&#21161;&#38142;&#25509;&#39044;&#27979;&#20219;&#21153;&#23398;&#20064;&#20844;&#24179;&#34920;&#31034;&#65292;&#28982;&#21518;&#23558;&#20854;&#19982;&#21407;&#22987;&#22270;&#23884;&#20837;&#36830;&#25509;&#20197;&#22686;&#24378;&#20010;&#20307;&#20844;&#24179;&#24615;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;GFairHint&#22312;&#19981;&#29306;&#29298;&#22826;&#22810;&#24615;&#33021;&#30340;&#24773;&#20917;&#19979;&#25552;&#39640;&#20102;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#30340;&#26368;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given the growing concerns about fairness in machine learning and the impressive performance of Graph Neural Networks (GNNs) on graph data learning, algorithmic fairness in GNNs has attracted significant attention. While many existing studies improve fairness at the group level, only a few works promote individual fairness, which renders similar outcomes for similar individuals. A desirable framework that promotes individual fairness should (1) balance between fairness and performance, (2) accommodate two commonly-used individual similarity measures (externally annotated and computed from input features), (3) generalize across various GNN models, and (4) be computationally efficient. Unfortunately, none of the prior work achieves all the desirables. In this work, we propose a novel method, GFairHint, which promotes individual fairness in GNNs and achieves all aforementioned desirables. GFairHint learns fairness representations through an auxiliary link prediction task, and then concate
&lt;/p&gt;</description></item></channel></rss>