<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31354;&#38388;-&#26102;&#38388;&#22270;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#65288;STGED&#65289;&#26694;&#26550;&#65292;&#29992;&#20110;&#25112;&#26415;&#36890;&#20449;&#32593;&#32476;&#65292;&#36890;&#36807;&#26377;&#25928;&#21033;&#29992;&#32593;&#32476;&#29366;&#24577;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#29305;&#24449;&#65292;&#23454;&#29616;&#20102;&#23545;&#26410;&#26469;&#29366;&#24577;&#30340;&#20934;&#30830;&#39044;&#27979;&#12290;</title><link>https://arxiv.org/abs/2403.13872</link><description>&lt;p&gt;
&#31354;&#38388;-&#26102;&#38388;&#22270;&#34920;&#31034;&#23398;&#20064;&#29992;&#20110;&#25112;&#26415;&#32593;&#32476;&#26410;&#26469;&#29366;&#24577;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Spatial-Temporal Graph Representation Learning for Tactical Networks Future State Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13872
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31354;&#38388;-&#26102;&#38388;&#22270;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#65288;STGED&#65289;&#26694;&#26550;&#65292;&#29992;&#20110;&#25112;&#26415;&#36890;&#20449;&#32593;&#32476;&#65292;&#36890;&#36807;&#26377;&#25928;&#21033;&#29992;&#32593;&#32476;&#29366;&#24577;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#29305;&#24449;&#65292;&#23454;&#29616;&#20102;&#23545;&#26410;&#26469;&#29366;&#24577;&#30340;&#20934;&#30830;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
tbd:&#25112;&#26415;&#33258;&#32452;&#32455;&#32593;&#32476;&#20013;&#30340;&#36164;&#28304;&#20998;&#37197;&#23384;&#22312;&#29420;&#29305;&#25361;&#25112;&#65292;&#22240;&#20026;&#20854;&#21160;&#24577;&#21644;&#22810;&#36339;&#29305;&#24615;&#12290;&#22312;&#36825;&#31181;&#29615;&#22659;&#20013;&#65292;&#20934;&#30830;&#39044;&#27979;&#26410;&#26469;&#30340;&#32593;&#32476;&#36830;&#25509;&#23545;&#20110;&#26377;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#31354;&#38388;-&#26102;&#38388;&#22270;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#65288;STGED&#65289;&#26694;&#26550;&#65292;&#29992;&#20110;&#25112;&#26415;&#36890;&#20449;&#32593;&#32476;&#65292;&#26377;&#25928;&#21033;&#29992;&#32593;&#32476;&#29366;&#24577;&#30340;&#31354;&#38388;&#21644;&#26102;&#38388;&#29305;&#24449;&#26469;&#23398;&#20064;&#28508;&#22312;&#30340;&#25112;&#26415;&#34892;&#20026;&#12290;STGED&#23618;&#27425;&#22320;&#21033;&#29992;&#22522;&#20110;&#22270;&#30340;&#27880;&#24847;&#26426;&#21046;&#23545;&#19968;&#31995;&#21015;&#36890;&#20449;&#32593;&#32476;&#29366;&#24577;&#36827;&#34892;&#31354;&#38388;&#32534;&#30721;&#65292;&#21033;&#29992;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#23545;&#29366;&#24577;&#30340;&#28436;&#21464;&#36827;&#34892;&#26102;&#38388;&#32534;&#30721;&#65292;&#24182;&#21033;&#29992;&#20840;&#36830;&#25509;&#21069;&#39304;&#32593;&#32476;&#26469;&#35299;&#30721;&#26410;&#26469;&#29366;&#24577;&#19979;&#30340;&#36830;&#25509;&#24615;&#12290;&#36890;&#36807;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;STGED&#22312;&#19981;&#21516;&#26102;&#38388;&#27493;&#36755;&#20837;&#19979;&#19968;&#30452;&#27604;&#22522;&#32447;&#27169;&#22411;&#34920;&#29616;&#26356;&#20986;&#33394;&#65292;&#33719;&#24471;&#20102;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13872v1 Announce Type: new  Abstract: Resource allocation in tactical ad-hoc networks presents unique challenges due to their dynamic and multi-hop nature. Accurate prediction of future network connectivity is essential for effective resource allocation in such environments. In this paper, we introduce the Spatial-Temporal Graph Encoder-Decoder (STGED) framework for Tactical Communication Networks that leverages both spatial and temporal features of network states to learn latent tactical behaviors effectively. STGED hierarchically utilizes graph-based attention mechanism to spatially encode a series of communication network states, leverages a recurrent neural network to temporally encode the evolution of states, and a fully-connected feed-forward network to decode the connectivity in the future state. Through extensive experiments, we demonstrate that STGED consistently outperforms baseline models by large margins across different time-steps input, achieving an accuracy of
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#20808;&#36827;&#21151;&#33021;&#65292;&#20197;&#26426;&#22120;&#22312;&#24490;&#29615;&#20013;&#26041;&#27861;&#65292;&#22788;&#29702;&#31038;&#20132;&#23186;&#20307;&#28040;&#24687;&#20027;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.10707</link><description>&lt;p&gt;
&#21033;&#29992;LLMs&#38598;&#25104;&#25581;&#31034;&#31038;&#20132;&#23186;&#20307;&#28040;&#24687;&#30340;&#28508;&#22312;&#20027;&#39064;&#65306;&#27668;&#20505;&#36816;&#21160;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Uncovering Latent Themes of Messaging on Social Media by Integrating LLMs: A Case Study on Climate Campaigns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10707
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#20808;&#36827;&#21151;&#33021;&#65292;&#20197;&#26426;&#22120;&#22312;&#24490;&#29615;&#20013;&#26041;&#27861;&#65292;&#22788;&#29702;&#31038;&#20132;&#23186;&#20307;&#28040;&#24687;&#20027;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#25581;&#31034;&#21644;&#20998;&#26512;&#31038;&#20132;&#23186;&#20307;&#28040;&#24687;&#20027;&#39064;&#30340;&#26032;&#26041;&#27861;&#12290;&#37492;&#20110;&#20256;&#32479;&#20027;&#39064;&#32423;&#20998;&#26512;&#30340;&#23616;&#38480;&#24615;&#65292;&#24448;&#24448;&#21482;&#25429;&#25417;&#21040;&#25972;&#20307;&#27169;&#24335;&#65292;&#26412;&#30740;&#31350;&#24378;&#35843;&#20102;&#23545;&#26356;&#31934;&#32454;&#12289;&#20027;&#39064;&#32858;&#28966;&#30340;&#25506;&#32034;&#30340;&#38656;&#27714;&#12290;&#20256;&#32479;&#30340;&#20027;&#39064;&#21457;&#29616;&#26041;&#27861;&#65292;&#28041;&#21450;&#25163;&#21160;&#27969;&#31243;&#21644;&#20154;&#22312;&#24490;&#29615;&#20013;&#30340;&#26041;&#27861;&#65292;&#20855;&#26377;&#20215;&#20540;&#65292;&#20294;&#22312;&#20280;&#32553;&#24615;&#12289;&#19968;&#33268;&#24615;&#21644;&#36164;&#28304;&#24378;&#24230;&#26041;&#38754;&#38754;&#20020;&#25361;&#25112;&#65292;&#28041;&#21450;&#26102;&#38388;&#21644;&#25104;&#26412;&#12290;&#20026;&#20102;&#24212;&#23545;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#20808;&#36827;&#21151;&#33021;&#30340;&#26426;&#22120;&#22312;&#24490;&#29615;&#20013;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#26356;&#28145;&#20837;&#22320;&#35843;&#26597;&#31038;&#20132;&#23186;&#20307;&#35805;&#35821;&#30340;&#20027;&#39064;&#26041;&#38754;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#25581;&#31034;&#22810;&#26679;&#30340;&#20027;&#39064;&#65292;&#27599;&#20010;&#20027;&#39064;&#20855;&#26377;&#29420;&#29305;&#30340;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#65292;&#20174;&#32780;&#25552;&#20379;&#23545;&#26356;&#24191;&#27867;&#20027;&#39064;&#20869;&#26377;&#30340;&#24494;&#22937;&#32454;&#33410;&#30340;&#20840;&#38754;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10707v1 Announce Type: cross  Abstract: This paper introduces a novel approach to uncovering and analyzing themes in social media messaging. Recognizing the limitations of traditional topic-level analysis, which tends to capture only the overarching patterns, this study emphasizes the need for a finer-grained, theme-focused exploration. Conventional methods of theme discovery, involving manual processes and a human-in-the-loop approach, are valuable but face challenges in scalability, consistency, and resource intensity in terms of time and cost. To address these challenges, we propose a machine-in-the-loop approach that leverages the advanced capabilities of Large Language Models (LLMs). This approach allows for a deeper investigation into the thematic aspects of social media discourse, enabling us to uncover a diverse array of themes, each with unique characteristics and relevance, thereby offering a comprehensive understanding of the nuances present within broader topics.
&lt;/p&gt;</description></item></channel></rss>