<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#29983;&#25104;&#24615;&#20154;&#24037;&#26234;&#33021;&#20013;&#25968;&#25454;&#38544;&#31169;&#21644;&#29256;&#26435;&#20445;&#25252;&#30340;&#22810;&#26041;&#38754;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#23558;&#25216;&#26415;&#21019;&#26032;&#19982;&#20262;&#29702;&#21069;&#30651;&#30456;&#32467;&#21512;&#30340;&#32508;&#21512;&#26041;&#27861;&#65292;&#26088;&#22312;&#20840;&#38754;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2311.18252</link><description>&lt;p&gt;
&#36328;&#36234;&#29983;&#25104;&#24615;&#20154;&#24037;&#26234;&#33021;&#25968;&#25454;&#29983;&#21629;&#21608;&#26399;&#30340;&#38544;&#31169;&#21644;&#29256;&#26435;&#25361;&#25112;&#23548;&#33322;
&lt;/p&gt;
&lt;p&gt;
Navigating Privacy and Copyright Challenges Across the Data Lifecycle of Generative AI. (arXiv:2311.18252v2 [cs.SE] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.18252
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#29983;&#25104;&#24615;&#20154;&#24037;&#26234;&#33021;&#20013;&#25968;&#25454;&#38544;&#31169;&#21644;&#29256;&#26435;&#20445;&#25252;&#30340;&#22810;&#26041;&#38754;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#23558;&#25216;&#26415;&#21019;&#26032;&#19982;&#20262;&#29702;&#21069;&#30651;&#30456;&#32467;&#21512;&#30340;&#32508;&#21512;&#26041;&#27861;&#65292;&#26088;&#22312;&#20840;&#38754;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24615;&#20154;&#24037;&#26234;&#33021;&#30340;&#20986;&#29616;&#26631;&#24535;&#30528;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#30340;&#37325;&#35201;&#37324;&#31243;&#30865;&#65292;&#23637;&#31034;&#20986;&#22312;&#29983;&#25104;&#30495;&#23454;&#22270;&#20687;&#12289;&#25991;&#26412;&#21644;&#25968;&#25454;&#27169;&#24335;&#26041;&#38754;&#30340;&#21331;&#36234;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#36827;&#23637;&#20063;&#24102;&#26469;&#20102;&#23545;&#25968;&#25454;&#38544;&#31169;&#21644;&#29256;&#26435;&#20405;&#29359;&#30340;&#26356;&#39640;&#20851;&#27880;&#65292;&#20027;&#35201;&#26159;&#30001;&#20110;&#27169;&#22411;&#35757;&#32451;&#23545;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#30340;&#20381;&#36182;&#12290;&#20256;&#32479;&#26041;&#27861;&#22914;&#24046;&#20998;&#38544;&#31169;&#12289;&#26426;&#22120;&#36951;&#24536;&#21644;&#25968;&#25454;&#20013;&#27602;&#21482;&#25552;&#20379;&#20102;&#23545;&#36825;&#20123;&#22797;&#26434;&#38382;&#39064;&#30340;&#29255;&#38754;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#28145;&#20837;&#25506;&#35752;&#20102;&#25968;&#25454;&#29983;&#21629;&#21608;&#26399;&#20869;&#38544;&#31169;&#21644;&#29256;&#26435;&#20445;&#25252;&#30340;&#22810;&#26041;&#38754;&#25361;&#25112;&#12290;&#25105;&#20204;&#20027;&#24352;&#37319;&#29992;&#23558;&#25216;&#26415;&#21019;&#26032;&#19982;&#20262;&#29702;&#21069;&#30651;&#30456;&#32467;&#21512;&#30340;&#32508;&#21512;&#26041;&#27861;&#65292;&#36890;&#36807;&#30740;&#31350;&#21644;&#21046;&#23450;&#22312;&#29983;&#21629;&#21608;&#26399;&#35270;&#35282;&#19979;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20840;&#38754;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#25512;&#21160;&#26356;&#24191;&#27867;&#30340;&#35752;&#35770;&#65292;&#24182;&#28608;&#21169;&#23545;&#29983;&#25104;&#24615;&#20154;&#24037;&#26234;&#33021;&#20013;&#25968;&#25454;&#38544;&#31169;&#21644;&#29256;&#26435;&#23436;&#25972;&#24615;&#30340;&#21327;&#21516;&#21162;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
The advent of Generative AI has marked a significant milestone in artificial intelligence, demonstrating remarkable capabilities in generating realistic images, texts, and data patterns. However, these advancements come with heightened concerns over data privacy and copyright infringement, primarily due to the reliance on vast datasets for model training. Traditional approaches like differential privacy, machine unlearning, and data poisoning only offer fragmented solutions to these complex issues. Our paper delves into the multifaceted challenges of privacy and copyright protection within the data lifecycle. We advocate for integrated approaches that combines technical innovation with ethical foresight, holistically addressing these concerns by investigating and devising solutions that are informed by the lifecycle perspective. This work aims to catalyze a broader discussion and inspire concerted efforts towards data privacy and copyright integrity in Generative AI.
&lt;/p&gt;</description></item><item><title>Clover&#26159;&#19968;&#31181;&#38381;&#29615;&#21487;&#39564;&#35777;&#20195;&#30721;&#29983;&#25104;&#30340;&#33539;&#24335;&#65292;&#36890;&#36807;&#22312;&#20195;&#30721;&#12289;docstrings&#21644;&#24418;&#24335;&#27880;&#37322;&#20043;&#38388;&#36827;&#34892;&#19968;&#33268;&#24615;&#26816;&#26597;&#65292;&#30830;&#20445;&#29983;&#25104;&#30340;&#20195;&#30721;&#30340;&#27491;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.17807</link><description>&lt;p&gt;
Clover: &#38381;&#29615;&#21487;&#39564;&#35777;&#20195;&#30721;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Clover: Closed-Loop Verifiable Code Generation. (arXiv:2310.17807v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17807
&lt;/p&gt;
&lt;p&gt;
Clover&#26159;&#19968;&#31181;&#38381;&#29615;&#21487;&#39564;&#35777;&#20195;&#30721;&#29983;&#25104;&#30340;&#33539;&#24335;&#65292;&#36890;&#36807;&#22312;&#20195;&#30721;&#12289;docstrings&#21644;&#24418;&#24335;&#27880;&#37322;&#20043;&#38388;&#36827;&#34892;&#19968;&#33268;&#24615;&#26816;&#26597;&#65292;&#30830;&#20445;&#29983;&#25104;&#30340;&#20195;&#30721;&#30340;&#27491;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36719;&#20214;&#24320;&#21457;&#20013;&#65292;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#20195;&#30721;&#29983;&#25104;&#26159;&#19968;&#20010;&#24555;&#36895;&#22686;&#38271;&#30340;&#36235;&#21183;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#27809;&#26377;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#30830;&#20445;&#29983;&#25104;&#30340;&#20195;&#30721;&#30340;&#27491;&#30830;&#24615;&#65292;&#36825;&#20010;&#36235;&#21183;&#21487;&#33021;&#20250;&#23548;&#33268;&#35768;&#22810;&#19981;&#33391;&#32467;&#26524;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#30340;&#24895;&#26223;&#65306;Clover&#33539;&#24335;&#65292;&#21363;&#38381;&#29615;&#21487;&#39564;&#35777;&#20195;&#30721;&#29983;&#25104;&#65292;&#23427;&#23558;&#27491;&#30830;&#24615;&#26816;&#26597;&#31616;&#21270;&#20026;&#26356;&#21487;&#35775;&#38382;&#30340;&#19968;&#33268;&#24615;&#26816;&#26597;&#38382;&#39064;&#12290;&#22312;Clover&#30340;&#26680;&#24515;&#26159;&#19968;&#20010;&#26816;&#26597;&#22120;&#65292;&#23427;&#22312;&#20195;&#30721;&#12289;docstrings&#21644;&#24418;&#24335;&#27880;&#37322;&#20043;&#38388;&#36827;&#34892;&#19968;&#33268;&#24615;&#26816;&#26597;&#12290;&#35813;&#26816;&#26597;&#22120;&#20351;&#29992;&#20102;&#24418;&#24335;&#39564;&#35777;&#24037;&#20855;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26032;&#39062;&#38598;&#25104;&#23454;&#29616;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#29702;&#35770;&#20998;&#26512;&#26469;&#25903;&#25345;&#25105;&#20204;&#30340;&#35770;&#28857;&#65292;&#21363;Clover&#22312;&#19968;&#33268;&#24615;&#26816;&#26597;&#26041;&#38754;&#24212;&#35813;&#26159;&#26377;&#25928;&#30340;&#12290;&#25105;&#20204;&#36824;&#22312;&#19968;&#20010;&#30001;&#25163;&#24037;&#35774;&#35745;&#30340;&#25968;&#25454;&#38598;&#65288;CloverBench&#65289;&#19978;&#36827;&#34892;&#20102;&#23454;&#35777;&#35843;&#26597;&#65292;&#35813;&#25968;&#25454;&#38598;&#21253;&#21547;&#20102;&#27880;&#37322;&#30340;Dafny&#31243;&#24207;&#65292;&#38590;&#24230;&#27700;&#24179;&#19982;&#25945;&#31185;&#20070;&#30456;&#24403;&#12290;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;
&lt;/p&gt;
&lt;p&gt;
The use of large language models for code generation is a rapidly growing trend in software development. However, without effective methods for ensuring the correctness of generated code, this trend could lead to any number of undesirable outcomes. In this paper, we lay out a vision for addressing this challenge: the Clover paradigm, short for Closed-Loop Verifiable Code Generation, which reduces correctness checking to the more accessible problem of consistency checking. At the core of Clover lies a checker that performs consistency checks among code, docstrings, and formal annotations. The checker is implemented using a novel integration of formal verification tools and large language models. We provide a theoretical analysis to support our thesis that Clover should be effective at consistency checking. We also empirically investigate its feasibility on a hand-designed dataset (CloverBench) featuring annotated Dafny programs at a textbook level of difficulty. Experimental results sho
&lt;/p&gt;</description></item></channel></rss>