<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#21033;&#29992;&#22270;&#20998;&#26512;&#21644;&#25991;&#26412;&#25968;&#25454;&#27969;&#30340;&#27010;&#24565;&#65292;&#22312;&#24180;&#24230;&#24555;&#29031;&#20013;&#20998;&#26512;&#20102;&#38543;&#26102;&#38388;&#28418;&#31227;&#30340;&#26631;&#31614;&#65292;&#25581;&#31034;&#20102;&#26631;&#31614;&#31038;&#21306;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#65283;mybodymychoice&#26631;&#31614;&#30340;&#20998;&#26512;&#65292;&#24182;&#20026;&#30417;&#27979;&#31038;&#20132;&#23186;&#20307;&#20013;&#20851;&#20110;&#23454;&#20307;&#30340;&#24847;&#35265;&#21644;&#24773;&#24863;&#27169;&#24335;&#38543;&#26102;&#38388;&#21464;&#21270;&#25552;&#20379;&#20102;&#26377;&#29992;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.10230</link><description>&lt;p&gt;
&#22312;&#25991;&#26412;&#25968;&#25454;&#27969;&#20013;&#28418;&#31227;&#26631;&#31614;&#30340;&#26102;&#38388;&#20998;&#26512;&#65306;&#22522;&#20110;&#22270;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Temporal Analysis of Drifting Hashtags in Textual Data Streams: A Graph-Based Application
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10230
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#22270;&#20998;&#26512;&#21644;&#25991;&#26412;&#25968;&#25454;&#27969;&#30340;&#27010;&#24565;&#65292;&#22312;&#24180;&#24230;&#24555;&#29031;&#20013;&#20998;&#26512;&#20102;&#38543;&#26102;&#38388;&#28418;&#31227;&#30340;&#26631;&#31614;&#65292;&#25581;&#31034;&#20102;&#26631;&#31614;&#31038;&#21306;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#65283;mybodymychoice&#26631;&#31614;&#30340;&#20998;&#26512;&#65292;&#24182;&#20026;&#30417;&#27979;&#31038;&#20132;&#23186;&#20307;&#20013;&#20851;&#20110;&#23454;&#20307;&#30340;&#24847;&#35265;&#21644;&#24773;&#24863;&#27169;&#24335;&#38543;&#26102;&#38388;&#21464;&#21270;&#25552;&#20379;&#20102;&#26377;&#29992;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#33258;&#20986;&#29616;&#20197;&#26469;&#23601;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#20154;&#20204;&#21033;&#29992;&#20114;&#32852;&#32593;&#34920;&#36798;&#23545;&#20219;&#20309;&#20107;&#29289;&#30340;&#30475;&#27861;&#65292;&#20351;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#25104;&#20026;&#31038;&#20250;&#20256;&#24863;&#22120;&#12290;&#26368;&#21021;&#30001;Twitter&#25903;&#25345;&#65292;&#29616;&#22312;&#24050;&#22312;&#22810;&#20010;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19978;&#20351;&#29992;&#26631;&#31614;&#12290;&#26631;&#31614;&#26377;&#21161;&#20110;&#26631;&#35760;&#12289;&#36319;&#36394;&#21644;&#23545;&#31867;&#20284;&#20027;&#39064;&#30340;&#24086;&#23376;&#36827;&#34892;&#20998;&#32452;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#22270;&#20998;&#26512;&#21644;&#25991;&#26412;&#25968;&#25454;&#27969;&#30340;&#27010;&#24565;&#65292;&#36816;&#29992;Girvan-Newman&#26041;&#27861;&#26469;&#20998;&#26512;&#38543;&#26102;&#38388;&#28418;&#31227;&#30340;&#26631;&#31614;&#65292;&#24182;&#22312;&#24180;&#24230;&#24555;&#29031;&#20013;&#25581;&#31034;&#26631;&#31614;&#31038;&#21306;&#12290;&#26356;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;2018&#24180;&#33267;2022&#24180;&#38388;&#30340;&#65283;mybodymychoice&#26631;&#31614;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22312;&#30740;&#31350;&#20013;&#21457;&#29616;&#30340;&#19968;&#20123;&#26631;&#31614;&#30340;&#35265;&#35299;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#29992;&#20110;&#30417;&#27979;&#31038;&#20132;&#23186;&#20307;&#19978;&#20851;&#20110;&#26576;&#20010;&#23454;&#20307;&#30340;&#24847;&#35265;&#21644;&#24773;&#24863;&#27169;&#24335;&#38543;&#26102;&#38388;&#30340;&#21464;&#21270;&#12290;&#23613;&#31649;&#65283;mybodymychoice&#26631;&#31614;&#26368;&#21021;&#19982;&#22919;&#22899;&#26435;&#21033;&#12289;&#22549;&#32974;&#21644;&#36523;&#20307;&#33258;&#20027;&#26377;&#20851;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10230v1 Announce Type: cross  Abstract: Social media has played an important role since its emergence. People use the internet to express opinions about anything, making social media platforms a social sensor. Initially supported by Twitter, the hashtags are now in use on several social media platforms. Hashtags are helpful to tag, track, and group posts on similar topics. In this paper, we analyze hashtag drifts over time using concepts from graph analysis and textual data streams using the Girvan-Newman method to uncover hashtag communities in annual snapshots. More specifically, we analyzed the #mybodymychoice hashtag between 2018 and 2022. In addition, we offer insights about some hashtags found in the study. Furthermore, our approach can be useful for monitoring changes over time in opinions and sentiment patterns about an entity on social media. Even though the hashtag #mybodymychoice was initially coupled with women's rights, abortion, and bodily autonomy, we observe 
&lt;/p&gt;</description></item></channel></rss>