<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20027;&#21160;&#23398;&#20064;&#26694;&#26550;&#8212;&#8212;&#20998;&#26742;&#20027;&#21160;&#37319;&#26679;&#65288;BAS&#65289;&#65292;&#26088;&#22312;&#22312;&#26102;&#38388;&#38480;&#21046;&#20869;&#35757;&#32451;&#26368;&#20339;&#30340;OPF&#20195;&#29702;&#12290;BAS&#23558;&#36755;&#20837;&#20998;&#24067;&#20998;&#25104;&#26742;&#65292;&#24182;&#20351;&#29992;&#25910;&#38598;&#20989;&#25968;&#30830;&#23450;&#19979;&#19968;&#27425;&#37319;&#26679;&#30340;&#20301;&#32622;&#12290;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#20102;BAS&#30340;&#22909;&#22788;&#12290;</title><link>http://arxiv.org/abs/2208.07497</link><description>&lt;p&gt;
&#23398;&#20064;ACOPF&#30340;&#20998;&#26742;&#20027;&#21160;&#37319;&#26679;
&lt;/p&gt;
&lt;p&gt;
Bucketized Active Sampling for Learning ACOPF. (arXiv:2208.07497v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.07497
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20027;&#21160;&#23398;&#20064;&#26694;&#26550;&#8212;&#8212;&#20998;&#26742;&#20027;&#21160;&#37319;&#26679;&#65288;BAS&#65289;&#65292;&#26088;&#22312;&#22312;&#26102;&#38388;&#38480;&#21046;&#20869;&#35757;&#32451;&#26368;&#20339;&#30340;OPF&#20195;&#29702;&#12290;BAS&#23558;&#36755;&#20837;&#20998;&#24067;&#20998;&#25104;&#26742;&#65292;&#24182;&#20351;&#29992;&#25910;&#38598;&#20989;&#25968;&#30830;&#23450;&#19979;&#19968;&#27425;&#37319;&#26679;&#30340;&#20301;&#32622;&#12290;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#20102;BAS&#30340;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#26368;&#20248;&#28526;&#27969;&#65288;OPF&#65289;&#30340;&#20248;&#21270;&#20195;&#29702;&#65292;&#21363;&#36817;&#20284;OPF&#30340;&#36755;&#20837;/&#36755;&#20986;&#20851;&#31995;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#38598;&#20013;&#22312;&#35777;&#26126;&#36825;&#20123;&#20195;&#29702;&#21487;&#20197;&#20855;&#26377;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#30340;&#35757;&#32451;&#38656;&#35201;&#22823;&#37327;&#30340;&#25968;&#25454;&#65292;&#27599;&#20010;&#23454;&#20363;&#37117;&#38656;&#35201;&#23545;&#36755;&#20837;&#20998;&#24067;&#30340;&#26679;&#26412;&#36827;&#34892;OPF&#30340;&#65288;&#31163;&#32447;&#65289;&#27714;&#35299;&#12290;&#20026;&#20102;&#28385;&#36275;&#24066;&#22330;&#28165;&#31639;&#24212;&#29992;&#30340;&#35201;&#27714;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20027;&#21160;&#23398;&#20064;&#26694;&#26550;&#8212;&#8212;&#20998;&#26742;&#20027;&#21160;&#37319;&#26679;&#65288;BAS&#65289;&#65292;&#26088;&#22312;&#22312;&#26102;&#38388;&#38480;&#21046;&#20869;&#35757;&#32451;&#26368;&#20339;&#30340;OPF&#20195;&#29702;&#12290;BAS&#23558;&#36755;&#20837;&#20998;&#24067;&#20998;&#25104;&#26742;&#65292;&#24182;&#20351;&#29992;&#25910;&#38598;&#20989;&#25968;&#30830;&#23450;&#19979;&#19968;&#27425;&#37319;&#26679;&#30340;&#20301;&#32622;&#12290;&#36890;&#36807;&#23558;&#30456;&#21516;&#30340;&#20998;&#26742;&#24212;&#29992;&#20110;&#39564;&#35777;&#38598;&#65292;BAS&#21033;&#29992;&#26631;&#35760;&#30340;&#39564;&#35777;&#26679;&#26412;&#26469;&#36873;&#25321;&#26410;&#26631;&#35760;&#30340;&#26679;&#26412;&#12290;BAS&#36824;&#20381;&#36182;&#20110;&#38543;&#26102;&#38388;&#22686;&#21152;&#21644;&#20943;&#23569;&#30340;&#33258;&#36866;&#24212;&#23398;&#20064;&#29575;&#12290;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#20102;BAS&#30340;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers optimization proxies for Optimal Power Flow (OPF), i.e., machine-learning models that approximate the input/output relationship of OPF. Recent work has focused on showing that such proxies can be of high fidelity. However, their training requires significant data, each instance necessitating the (offline) solving of an OPF for a sample of the input distribution. To meet the requirements of market-clearing applications, this paper proposes Bucketized Active Sampling (BAS), a novel active learning framework that aims at training the best possible OPF proxy within a time limit. BAS partitions the input distribution into buckets and uses an acquisition function to determine where to sample next. By applying the same partitioning to the validation set, BAS leverages labeled validation samples in the selection of unlabeled samples. BAS also relies on an adaptive learning rate that increases and decreases over time. Experimental results demonstrate the benefits of BAS.
&lt;/p&gt;</description></item></channel></rss>