<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22522;&#26412;&#24341;&#29702;&#30340;&#25512;&#24191;&#21644;&#26680;&#22238;&#24402;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#36890;&#36807;&#38750;&#32447;&#24615;&#25193;&#23637;&#21644;&#21464;&#25442;&#65292;&#24471;&#21040;&#20102;&#31995;&#32479;&#36712;&#36857;&#30340;&#26032;&#26680;&#34920;&#31034;&#26041;&#27861;&#65292;&#23637;&#31034;&#20986;&#20102;&#19982;&#29305;&#23450;&#26680;&#22238;&#24402;&#38382;&#39064;&#30340;&#31561;&#25928;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#28508;&#22312;&#26680;&#30340;&#32467;&#26500;&#21450;&#20854;&#23545;&#24212;&#30340;&#31995;&#32479;&#31867;&#21035;&#12290;</title><link>https://arxiv.org/abs/2403.05368</link><description>&lt;p&gt;
&#25506;&#35752;&#22522;&#26412;&#24341;&#29702;&#19982;&#26680;&#22238;&#24402;&#20043;&#38388;&#30340;&#32852;&#31995;
&lt;/p&gt;
&lt;p&gt;
Exploring the Links between the Fundamental Lemma and Kernel Regression
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05368
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22522;&#26412;&#24341;&#29702;&#30340;&#25512;&#24191;&#21644;&#26680;&#22238;&#24402;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#36890;&#36807;&#38750;&#32447;&#24615;&#25193;&#23637;&#21644;&#21464;&#25442;&#65292;&#24471;&#21040;&#20102;&#31995;&#32479;&#36712;&#36857;&#30340;&#26032;&#26680;&#34920;&#31034;&#26041;&#27861;&#65292;&#23637;&#31034;&#20986;&#20102;&#19982;&#29305;&#23450;&#26680;&#22238;&#24402;&#38382;&#39064;&#30340;&#31561;&#25928;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#28508;&#22312;&#26680;&#30340;&#32467;&#26500;&#21450;&#20854;&#23545;&#24212;&#30340;&#31995;&#32479;&#31867;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Willems&#31561;&#20154;&#20851;&#20110;&#22522;&#26412;&#24341;&#29702;&#30340;&#25512;&#24191;&#21644;&#21464;&#31181;&#26159;&#26368;&#36817;&#30740;&#31350;&#30340;&#28909;&#38376;&#35805;&#39064;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#24182;&#24418;&#24335;&#21270;&#20102;&#26680;&#22238;&#24402;&#19982;&#24050;&#30693;&#38750;&#32447;&#24615;&#22522;&#26412;&#24341;&#29702;&#25193;&#23637;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#36890;&#36807;&#23545;Hankel&#30697;&#38453;&#20013;&#30340;&#20256;&#32479;&#32447;&#24615;&#26041;&#31243;&#36827;&#34892;&#21464;&#25442;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#31995;&#32479;&#36712;&#36857;&#30340;&#21478;&#19968;&#31181;&#38544;&#24335;&#26680;&#34920;&#31034;&#65292;&#21516;&#26102;&#20445;&#25345;&#23545;&#28608;&#21169;&#25345;&#20037;&#24615;&#30340;&#35201;&#27714;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#34920;&#31034;&#31561;&#21516;&#20110;&#29305;&#23450;&#26680;&#22238;&#24402;&#38382;&#39064;&#30340;&#35299;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#28508;&#22312;&#26680;&#30340;&#21487;&#33021;&#32467;&#26500;&#20197;&#21450;&#23427;&#20204;&#23545;&#24212;&#30340;&#31995;&#32479;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05368v1 Announce Type: cross  Abstract: Generalizations and variations of the fundamental lemma by Willems et al. are an active topic of recent research. In this note, we explore and formalize the links between kernel regression and known nonlinear extensions of the fundamental lemma. Applying a transformation to the usual linear equation in Hankel matrices, we arrive at an alternative implicit kernel representation of the system trajectories while keeping the requirements on persistency of excitation. We show that this representation is equivalent to the solution of a specific kernel regression problem. We explore the possible structures of the underlying kernel as well as the system classes to which they correspond.
&lt;/p&gt;</description></item></channel></rss>