<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>AutoML&#20316;&#20026;&#19968;&#31181;&#33258;&#21160;&#21270;&#26500;&#24314;&#31471;&#21040;&#31471;AI/ML&#27969;&#27700;&#32447;&#30340;&#35299;&#20915;&#26041;&#26696;&#34987;&#24191;&#27867;&#20851;&#27880;&#65292;&#20294;&#30446;&#21069;&#23545;&#20854;&#22312;&#24320;&#21457;AI/ML&#31995;&#32479;&#30340;&#22242;&#38431;&#20013;&#30340;&#37319;&#29992;&#31243;&#24230;&#21644;&#24863;&#30693;&#31243;&#24230;&#32570;&#20047;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2307.10774</link><description>&lt;p&gt;
&#35780;&#20272;AutoML&#22312;&#25968;&#25454;&#39537;&#21160;&#36719;&#20214;&#24037;&#31243;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Assessing the Use of AutoML for Data-Driven Software Engineering. (arXiv:2307.10774v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10774
&lt;/p&gt;
&lt;p&gt;
AutoML&#20316;&#20026;&#19968;&#31181;&#33258;&#21160;&#21270;&#26500;&#24314;&#31471;&#21040;&#31471;AI/ML&#27969;&#27700;&#32447;&#30340;&#35299;&#20915;&#26041;&#26696;&#34987;&#24191;&#27867;&#20851;&#27880;&#65292;&#20294;&#30446;&#21069;&#23545;&#20854;&#22312;&#24320;&#21457;AI/ML&#31995;&#32479;&#30340;&#22242;&#38431;&#20013;&#30340;&#37319;&#29992;&#31243;&#24230;&#21644;&#24863;&#30693;&#31243;&#24230;&#32570;&#20047;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32972;&#26223;&#65306;&#30001;&#20110;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21644;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#22312;&#26500;&#24314;&#36719;&#20214;&#24212;&#29992;&#26041;&#38754;&#30340;&#24191;&#27867;&#24212;&#29992;&#65292;&#20844;&#21496;&#27491;&#21162;&#21147;&#25307;&#32856;&#20855;&#26377;&#28145;&#20837;&#20102;&#35299;&#36825;&#20123;&#25216;&#26415;&#30340;&#21592;&#24037;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;AutoML&#20316;&#20026;&#22635;&#34917;AI / ML&#25216;&#33021;&#32570;&#21475;&#30340;&#26377;&#24076;&#26395;&#30340;&#35299;&#20915;&#26041;&#26696;&#22823;&#21463;&#27426;&#36814;&#65292;&#22240;&#20026;&#23427;&#25215;&#35834;&#33258;&#21160;&#21270;&#26500;&#24314;&#31471;&#21040;&#31471;AI / ML&#27969;&#27700;&#32447;&#65292;&#36825;&#20123;&#27969;&#27700;&#32447;&#36890;&#24120;&#30001;&#19987;&#38376;&#30340;&#22242;&#38431;&#25104;&#21592;&#35774;&#35745;&#12290;&#30446;&#26631;&#65306;&#23613;&#31649;&#21463;&#21040;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#21644;&#39640;&#26399;&#26395;&#65292;&#20294;&#30446;&#21069;&#23545;&#20110;&#24320;&#21457;AI / ML&#31995;&#32479;&#30340;&#22242;&#38431;&#24403;&#21069;&#37319;&#29992;AutoML&#30340;&#31243;&#24230;&#20197;&#21450;&#20174;&#23454;&#36341;&#32773;&#21644;&#30740;&#31350;&#32773;&#30340;&#35270;&#35282;&#26469;&#30475;&#23427;&#30340;&#24863;&#30693;&#31243;&#24230;&#32570;&#20047;&#20449;&#24687;&#12290;&#26041;&#27861;&#65306;&#20026;&#20102;&#22635;&#34917;&#36825;&#20123;&#31354;&#30333;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#39033;&#28151;&#21512;&#26041;&#27861;&#30740;&#31350;&#65292;&#21253;&#25324;&#23545;&#20004;&#20010;&#36719;&#20214;&#24037;&#31243;&#25968;&#25454;&#38598;&#20013;12&#20010;&#31471;&#21040;&#31471;AutoML&#24037;&#20855;&#30340;&#22522;&#20934;&#27979;&#35797;&#20197;&#21450;&#29992;&#25143;&#35843;&#26597;&#21644;&#21518;&#32493;&#35775;&#35848;&#65292;&#20197;&#36827;&#19968;&#27493;&#20102;&#35299;AutoML&#30340;&#37319;&#29992;&#21644;&#24863;&#30693;&#12290;&#32467;&#26524;&#65306;&#25105;&#20204;&#21457;&#29616;AutoML&#35299;&#20915;&#26041;&#26696;&#21487;&#20197;
&lt;/p&gt;
&lt;p&gt;
Background. Due to the widespread adoption of Artificial Intelligence (AI) and Machine Learning (ML) for building software applications, companies are struggling to recruit employees with a deep understanding of such technologies. In this scenario, AutoML is soaring as a promising solution to fill the AI/ML skills gap since it promises to automate the building of end-to-end AI/ML pipelines that would normally be engineered by specialized team members. Aims. Despite the growing interest and high expectations, there is a dearth of information about the extent to which AutoML is currently adopted by teams developing AI/ML-enabled systems and how it is perceived by practitioners and researchers. Method. To fill these gaps, in this paper, we present a mixed-method study comprising a benchmark of 12 end-to-end AutoML tools on two SE datasets and a user survey with follow-up interviews to further our understanding of AutoML adoption and perception. Results. We found that AutoML solutions can 
&lt;/p&gt;</description></item></channel></rss>