<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>GRAPHGINI&#22312;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#39318;&#27425;&#24341;&#20837;&#20102;&#22522;&#23612;&#31995;&#25968;&#20316;&#20026;&#20844;&#24179;&#24615;&#24230;&#37327;&#30340;&#26041;&#27861;&#65292;&#21516;&#26102;&#23454;&#29616;&#20010;&#20307;&#21644;&#32676;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#65292;&#24182;&#20445;&#25345;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.12937</link><description>&lt;p&gt;
GRAPHGINI&#65306;&#22312;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#20419;&#36827;&#20010;&#20307;&#21644;&#32676;&#20307;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
GRAPHGINI: Fostering Individual and Group Fairness in Graph Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12937
&lt;/p&gt;
&lt;p&gt;
GRAPHGINI&#22312;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#39318;&#27425;&#24341;&#20837;&#20102;&#22522;&#23612;&#31995;&#25968;&#20316;&#20026;&#20844;&#24179;&#24615;&#24230;&#37327;&#30340;&#26041;&#27861;&#65292;&#21516;&#26102;&#23454;&#29616;&#20010;&#20307;&#21644;&#32676;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#65292;&#24182;&#20445;&#25345;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35299;&#20915;&#20102;&#26085;&#30410;&#22686;&#38271;&#30340;&#25285;&#24551;&#65292;&#21363;&#22312;&#32570;&#20047;&#20844;&#24179;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#65292;GNN&#21487;&#33021;&#20250;&#20135;&#29983;&#20559;&#35265;&#20915;&#31574;&#65292;&#20174;&#32780;&#19981;&#25104;&#27604;&#20363;&#22320;&#24433;&#21709;&#21040;&#24369;&#21183;&#32676;&#20307;&#25110;&#20010;&#20154;&#12290;&#19982;&#20808;&#21069;&#30340;&#24037;&#20316;&#19981;&#21516;&#65292;&#25105;&#20204;&#39318;&#27425;&#24341;&#20837;&#20102;&#19968;&#31181;&#23558;&#22522;&#23612;&#31995;&#25968;&#20316;&#20026;&#20844;&#24179;&#24615;&#24230;&#37327;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;GNN&#26694;&#26550;&#20869;&#20351;&#29992;&#12290;&#25105;&#20204;&#30340;&#25552;&#35758;&#65292;GRAPHGINI&#65292;&#22312;&#21333;&#20010;&#31995;&#32479;&#20013;&#22788;&#29702;&#20010;&#20307;&#21644;&#32676;&#20307;&#20844;&#24179;&#24615;&#30340;&#20004;&#20010;&#19981;&#21516;&#30446;&#26631;&#65292;&#21516;&#26102;&#20445;&#25345;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;GRAPHGINI&#36890;&#36807;&#21487;&#23398;&#20064;&#30340;&#27880;&#24847;&#21147;&#20998;&#25968;&#26469;&#23454;&#26045;&#20010;&#20307;&#20844;&#24179;&#24615;&#65292;&#36825;&#26377;&#21161;&#20110;&#36890;&#36807;&#31867;&#20284;&#33410;&#28857;&#32858;&#21512;&#26356;&#22810;&#20449;&#24687;&#12290;&#22522;&#20110;&#21551;&#21457;&#24335;&#30340;&#26368;&#22823;&#32435;&#20160;&#31038;&#20250;&#31119;&#21033;&#32422;&#26463;&#30830;&#20445;&#20102;&#26368;&#22823;&#21487;&#33021;&#30340;&#32676;&#20307;&#20844;&#24179;&#12290;&#20010;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#21644;&#32676;&#20307;&#20844;&#24179;&#24615;&#32422;&#26463;&#37117;&#26159;&#20197;&#21487;&#24494;&#20998;&#30340;&#22522;&#23612;&#31995;&#25968;&#30340;&#36817;&#20284;&#24418;&#24335;&#38472;&#36848;&#30340;&#12290;&#36825;&#31181;&#36817;&#20284;&#26159;&#19968;&#20010;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12937v1 Announce Type: new  Abstract: We address the growing apprehension that GNNs, in the absence of fairness constraints, might produce biased decisions that disproportionately affect underprivileged groups or individuals. Departing from previous work, we introduce for the first time a method for incorporating the Gini coefficient as a measure of fairness to be used within the GNN framework. Our proposal, GRAPHGINI, works with the two different goals of individual and group fairness in a single system, while maintaining high prediction accuracy. GRAPHGINI enforces individual fairness through learnable attention scores that help in aggregating more information through similar nodes. A heuristic-based maximum Nash social welfare constraint ensures the maximum possible group fairness. Both the individual fairness constraint and the group fairness constraint are stated in terms of a differentiable approximation of the Gini coefficient. This approximation is a contribution tha
&lt;/p&gt;</description></item></channel></rss>