<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#24341;&#20837;&#20102;&#19968;&#20010;&#36890;&#29992;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;GenCode&#65292;&#36890;&#36807;&#37325;&#35201;&#24615;&#25351;&#26631;&#36873;&#25321;&#29983;&#25104;&#30340;&#20195;&#30721;&#20316;&#20026;&#35757;&#32451;&#25968;&#25454;&#65292;&#20197;&#22686;&#24378;&#20195;&#30721;&#29702;&#35299;&#27169;&#22411;&#30340;&#35757;&#32451;&#12290;</title><link>https://arxiv.org/abs/2402.15769</link><description>&lt;p&gt;
&#37325;&#28857;&#24341;&#23548;&#30340;&#25968;&#25454;&#22686;&#24378;&#29992;&#20110;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#20195;&#30721;&#29702;&#35299;
&lt;/p&gt;
&lt;p&gt;
Importance Guided Data Augmentation for Neural-Based Code Understanding
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15769
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#20010;&#36890;&#29992;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;GenCode&#65292;&#36890;&#36807;&#37325;&#35201;&#24615;&#25351;&#26631;&#36873;&#25321;&#29983;&#25104;&#30340;&#20195;&#30721;&#20316;&#20026;&#35757;&#32451;&#25968;&#25454;&#65292;&#20197;&#22686;&#24378;&#20195;&#30721;&#29702;&#35299;&#27169;&#22411;&#30340;&#35757;&#32451;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15769v1 &#31867;&#22411;&#65306;&#20132;&#21449; &#25688;&#35201;&#65306;&#39044;&#35757;&#32451;&#30340;&#20195;&#30721;&#27169;&#22411;&#24320;&#21551;&#20102;&#20195;&#30721;&#26234;&#33021;&#26102;&#20195;&#12290;&#26368;&#36817;&#35768;&#22810;&#27169;&#22411;&#37117;&#34920;&#29616;&#20986;&#33394;&#12290;&#28982;&#32780;&#65292;&#22312;&#20195;&#30721;&#23398;&#20064;&#39046;&#22495;&#65292;&#19968;&#20010;&#37325;&#35201;&#38382;&#39064;&#26159;&#33258;&#21160;&#36827;&#34892;&#20195;&#30721;&#25968;&#25454;&#22686;&#24378;&#65292;&#20197;&#24110;&#21161;&#24320;&#21457;&#32773;&#20934;&#22791;&#35757;&#32451;&#25968;&#25454;&#65292;&#36825;&#26041;&#38754;&#30340;&#30740;&#31350;&#23578;&#19981;&#36275;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#25968;&#25454;&#22686;&#24378;&#26694;&#26550;GenCode&#65292;&#29992;&#20110;&#22686;&#24378;&#20195;&#30721;&#29702;&#35299;&#27169;&#22411;&#30340;&#35757;&#32451;&#12290;GenCode&#36981;&#24490;&#19968;&#31181;&#29983;&#25104;&#21644;&#36873;&#25321;&#30340;&#33539;&#24335;&#26469;&#20934;&#22791;&#26377;&#29992;&#30340;&#35757;&#32451;&#20195;&#30721;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#23427;&#20351;&#29992;&#20195;&#30721;&#36716;&#25442;&#25216;&#26415;&#39318;&#20808;&#29983;&#25104;&#26032;&#30340;&#20195;&#30721;&#20505;&#36873;&#65292;&#28982;&#21518;&#36890;&#36807;&#37325;&#35201;&#24615;&#25351;&#26631;&#36873;&#25321;&#37325;&#35201;&#30340;&#20195;&#30721;&#20316;&#20026;&#35757;&#32451;&#25968;&#25454;&#12290;&#20026;&#20102;&#35780;&#20272;GenCode&#19982;&#36890;&#29992;&#37325;&#35201;&#24615;&#25351;&#26631;&#65288;&#25439;&#22833;&#20540;&#65289;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#22312;&#22235;&#20010;&#20195;&#30721;&#29702;&#35299;&#20219;&#21153;&#65288;&#22914;&#20195;&#30721;&#20811;&#38534;&#26816;&#27979;&#65289;&#21644;&#19977;&#20010;&#39044;&#35757;&#32451;&#20195;&#30721;&#27169;&#22411;&#65288;&#22914;CodeT5&#65289;&#19978;&#36827;&#34892;&#23454;&#39564;&#12290;&#19982;&#26368;&#20808;&#36827;&#30340;&#20195;&#30721;&#22686;&#24378;&#25216;&#26415;&#30456;&#27604;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15769v1 Announce Type: cross  Abstract: Pre-trained code models lead the era of code intelligence. Many models have been designed with impressive performance recently. However, one important problem, data augmentation for code data that automatically helps developers prepare training data lacks study in the field of code learning. In this paper, we introduce a general data augmentation framework, GenCode, to enhance the training of code understanding models. GenCode follows a generation-and-selection paradigm to prepare useful training codes. Specifically, it uses code transformation techniques to generate new code candidates first and then selects important ones as the training data by importance metrics. To evaluate the effectiveness of GenCode with a general importance metric -- loss value, we conduct experiments on four code understanding tasks (e.g., code clone detection) and three pre-trained code models (e.g., CodeT5). Compared to the state-of-the-art (SOTA) code augm
&lt;/p&gt;</description></item></channel></rss>