<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>ChatDBG&#26159;&#31532;&#19968;&#20010;AI-Powered&#35843;&#35797;&#21161;&#25163;&#65292;&#36890;&#36807;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#38598;&#25104;&#21040;&#20256;&#32479;&#35843;&#35797;&#22120;&#20013;&#65292;&#23454;&#29616;&#20102;&#31243;&#24207;&#21592;&#19982;&#35843;&#35797;&#22120;&#20043;&#38388;&#30340;&#21327;&#20316;&#23545;&#35805;&#65292;&#33021;&#22815;&#22788;&#29702;&#22797;&#26434;&#38382;&#39064;&#12289;&#25191;&#34892;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;&#65292;&#24182;&#25506;&#32034;&#24320;&#25918;&#24615;&#26597;&#35810;&#12290;</title><link>https://arxiv.org/abs/2403.16354</link><description>&lt;p&gt;
ChatDBG: &#19968;&#31181;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#35843;&#35797;&#21161;&#25163;
&lt;/p&gt;
&lt;p&gt;
ChatDBG: An AI-Powered Debugging Assistant
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16354
&lt;/p&gt;
&lt;p&gt;
ChatDBG&#26159;&#31532;&#19968;&#20010;AI-Powered&#35843;&#35797;&#21161;&#25163;&#65292;&#36890;&#36807;&#23558;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#38598;&#25104;&#21040;&#20256;&#32479;&#35843;&#35797;&#22120;&#20013;&#65292;&#23454;&#29616;&#20102;&#31243;&#24207;&#21592;&#19982;&#35843;&#35797;&#22120;&#20043;&#38388;&#30340;&#21327;&#20316;&#23545;&#35805;&#65292;&#33021;&#22815;&#22788;&#29702;&#22797;&#26434;&#38382;&#39064;&#12289;&#25191;&#34892;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;&#65292;&#24182;&#25506;&#32034;&#24320;&#25918;&#24615;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;ChatDBG&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;&#30340;&#35843;&#35797;&#21161;&#25163;&#12290;ChatDBG&#38598;&#25104;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;(LLMs)&#65292;&#26174;&#33879;&#22686;&#24378;&#20102;&#20256;&#32479;&#35843;&#35797;&#22120;&#30340;&#21151;&#33021;&#21644;&#29992;&#25143;&#21451;&#22909;&#24615;&#12290;ChatDBG&#20801;&#35768;&#31243;&#24207;&#21592;&#19982;&#35843;&#35797;&#22120;&#36827;&#34892;&#21327;&#20316;&#23545;&#35805;&#65292;&#20351;&#20182;&#20204;&#33021;&#22815;&#25552;&#20986;&#20851;&#20110;&#31243;&#24207;&#29366;&#24577;&#30340;&#22797;&#26434;&#38382;&#39064;&#65292;&#23545;&#23849;&#28291;&#25110;&#26029;&#35328;&#22833;&#36133;&#36827;&#34892;&#26681;&#26412;&#21407;&#22240;&#20998;&#26512;&#65292;&#24182;&#25506;&#32034;&#35832;&#22914;&#8220;&#20026;&#20160;&#20040;x&#20026;&#31354;&#65311;&#8221;&#20043;&#31867;&#30340;&#24320;&#25918;&#24615;&#26597;&#35810;&#12290;&#20026;&#20102;&#22788;&#29702;&#36825;&#20123;&#26597;&#35810;&#65292;ChatDBG&#25480;&#20104;LLM&#33258;&#20027;&#26435;&#65292;&#36890;&#36807;&#21457;&#20986;&#21629;&#20196;&#26469;&#27983;&#35272;&#22534;&#26632;&#21644;&#26816;&#26597;&#31243;&#24207;&#29366;&#24577;&#36827;&#34892;&#35843;&#35797;&#65307;&#28982;&#21518;&#25253;&#21578;&#20854;&#21457;&#29616;&#24182;&#23558;&#25511;&#21046;&#26435;&#20132;&#36824;&#32473;&#31243;&#24207;&#21592;&#12290;&#25105;&#20204;&#30340;ChatDBG&#21407;&#22411;&#19982;&#26631;&#20934;&#35843;&#35797;&#22120;&#38598;&#25104;&#65292;&#21253;&#25324;LLDB&#12289;GDB&#21644;WinDBG&#29992;&#20110;&#26412;&#22320;&#20195;&#30721;&#20197;&#21450;&#29992;&#20110;Python&#30340;Pdb&#12290;&#25105;&#20204;&#22312;&#21508;&#31181;&#20195;&#30721;&#38598;&#21512;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#21253;&#25324;&#20855;&#26377;&#24050;&#30693;&#38169;&#35823;&#30340;C/C++&#20195;&#30721;&#21644;&#19968;&#22871;Python&#20195;&#30721;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16354v1 Announce Type: cross  Abstract: This paper presents ChatDBG, the first AI-powered debugging assistant. ChatDBG integrates large language models (LLMs) to significantly enhance the capabilities and user-friendliness of conventional debuggers. ChatDBG lets programmers engage in a collaborative dialogue with the debugger, allowing them to pose complex questions about program state, perform root cause analysis for crashes or assertion failures, and explore open-ended queries like "why is x null?". To handle these queries, ChatDBG grants the LLM autonomy to take the wheel and drive debugging by issuing commands to navigate through stacks and inspect program state; it then reports its findings and yields back control to the programmer. Our ChatDBG prototype integrates with standard debuggers including LLDB, GDB, and WinDBG for native code and Pdb for Python. Our evaluation across a diverse set of code, including C/C++ code with known bugs and a suite of Python code includi
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#23545;Stack Overflow&#38382;&#39064;&#30340;&#20998;&#26512;&#65292;&#30740;&#31350;&#20102;ChatGPT&#21644;LLaMA&#23545;&#20110;&#35813;&#24179;&#21488;&#30340;&#24433;&#21709;&#21644;&#21487;&#38752;&#24615;&#65292;&#20197;&#21450;&#23427;&#20204;&#22312;&#38271;&#26399;&#20869;&#21462;&#20195;Stack Overflow&#30340;&#25361;&#25112;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;LLMs&#22312;&#26576;&#20123;&#26041;&#38754;&#22833;&#36133;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#27604;LLMs&#30340;&#23454;&#35777;&#27604;&#36739;&#12290;</title><link>https://arxiv.org/abs/2402.08801</link><description>&lt;p&gt;
ChatGPT&#19982;LLaMA&#22312;Stack Overflow&#35752;&#35770;&#20013;&#30340;&#24433;&#21709;&#65292;&#21487;&#38752;&#24615;&#21644;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
ChatGPT vs LLaMA: Impact, Reliability, and Challenges in Stack Overflow Discussions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08801
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#23545;Stack Overflow&#38382;&#39064;&#30340;&#20998;&#26512;&#65292;&#30740;&#31350;&#20102;ChatGPT&#21644;LLaMA&#23545;&#20110;&#35813;&#24179;&#21488;&#30340;&#24433;&#21709;&#21644;&#21487;&#38752;&#24615;&#65292;&#20197;&#21450;&#23427;&#20204;&#22312;&#38271;&#26399;&#20869;&#21462;&#20195;Stack Overflow&#30340;&#25361;&#25112;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;LLMs&#22312;&#26576;&#20123;&#26041;&#38754;&#22833;&#36133;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#27604;LLMs&#30340;&#23454;&#35777;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;2022&#24180;11&#26376;&#21457;&#24067;&#20197;&#26469;&#65292;ChatGPT&#24050;&#32463;&#22312;Stack Overflow&#19978;&#24341;&#36215;&#36720;&#21160;&#65292;&#36825;&#26159;&#24320;&#21457;&#20154;&#21592;&#20851;&#20110;&#32534;&#31243;&#21644;&#36719;&#20214;&#24320;&#21457;&#38382;&#39064;&#30340;&#39318;&#36873;&#24179;&#21488;&#12290;ChatGPT&#23637;&#31034;&#20102;&#29983;&#25104;&#21363;&#26102;&#12289;&#20154;&#31867;&#33324;&#22238;&#31572;&#25216;&#26415;&#38382;&#39064;&#30340;&#33021;&#21147;&#65292;&#24341;&#36215;&#20102;&#24320;&#21457;&#32773;&#31038;&#21306;&#23545;&#20154;&#24037;&#26234;&#33021;&#29983;&#25104;&#26102;&#20195;&#19979;&#20154;&#31867;&#39537;&#21160;&#24179;&#21488;&#28436;&#21464;&#35282;&#33394;&#30340;&#36777;&#35770;&#12290;ChatGPT&#21457;&#24067;&#20004;&#20010;&#26376;&#21518;&#65292;Meta&#21457;&#24067;&#20102;&#23427;&#33258;&#24049;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;(LLM) LLaMA&#12290;&#20026;&#20102; (i) &#27979;&#37327;&#29992;&#25143;&#23545;Stack Overflow&#30340;&#26102;&#38388;&#28436;&#36827;&#19979;&#30340;&#21442;&#19982;&#31243;&#24230;&#65307;(ii) &#37327;&#21270;LLMs&#22238;&#31572;&#30340;&#21487;&#38752;&#24615;&#21450;&#20854;&#22312;&#38271;&#26399;&#20869;&#21462;&#20195;Stack Overflow&#30340;&#28508;&#21147;&#65307;(iii) &#30830;&#23450;&#21644;&#29702;&#35299;LLMs&#22833;&#36133;&#30340;&#21407;&#22240;&#65307;(iv) &#23545;&#27604;LLMs&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#65292;&#20998;&#26512;Stack Overflow&#19978;&#30340;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#36825;&#20123;LLMs&#26469;&#22238;&#31572;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08801v1 Announce Type: cross Abstract: Since its release in November 2022, ChatGPT has shaken up Stack Overflow, the premier platform for developers' queries on programming and software development. Demonstrating an ability to generate instant, human-like responses to technical questions, ChatGPT has ignited debates within the developer community about the evolving role of human-driven platforms in the age of generative AI. Two months after ChatGPT's release, Meta released its answer with its own Large Language Model (LLM) called LLaMA: the race was on. We conducted an empirical study analyzing questions from Stack Overflow and using these LLMs to address them. This way, we aim to (ii) measure user engagement evolution with Stack Overflow over time; (ii) quantify the reliability of LLMs' answers and their potential to replace Stack Overflow in the long term; (iii) identify and understand why LLMs fails; and (iv) compare LLMs together. Our empirical results are unequivocal: C
&lt;/p&gt;</description></item></channel></rss>