<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#25552;&#20986;&#20102;&#22522;&#20110;&#36830;&#32493;&#26102;&#24207;&#27979;&#37327;&#21644;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#30005;&#32593;&#30417;&#27979;&#21644;&#25511;&#21046;&#31995;&#32479;&#65292;&#36890;&#36807;&#25968;&#25454;&#21387;&#32553;&#21644;&#25925;&#38556;&#26816;&#27979;&#65292;&#23454;&#29616;&#20102;&#23545;&#20256;&#32479;&#30417;&#25511;&#31995;&#32479;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2403.06942</link><description>&lt;p&gt;
&#20351;&#29992;&#36830;&#32493;&#26102;&#24207;&#27979;&#37327;&#21644;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#36827;&#34892;&#30005;&#32593;&#30417;&#27979;&#21644;&#20445;&#25252;
&lt;/p&gt;
&lt;p&gt;
Grid Monitoring and Protection with Continuous Point-on-Wave Measurements and Generative AI
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06942
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22522;&#20110;&#36830;&#32493;&#26102;&#24207;&#27979;&#37327;&#21644;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#30005;&#32593;&#30417;&#27979;&#21644;&#25511;&#21046;&#31995;&#32479;&#65292;&#36890;&#36807;&#25968;&#25454;&#21387;&#32553;&#21644;&#25925;&#38556;&#26816;&#27979;&#65292;&#23454;&#29616;&#20102;&#23545;&#20256;&#32479;&#30417;&#25511;&#31995;&#32479;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#19979;&#19968;&#20195;&#30005;&#32593;&#30417;&#27979;&#21644;&#25511;&#21046;&#31995;&#32479;&#30340;&#26696;&#20363;&#65292;&#21033;&#29992;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#12289;&#26426;&#22120;&#23398;&#20064;&#21644;&#32479;&#35745;&#25512;&#26029;&#26041;&#38754;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36830;&#32493;&#26102;&#24207;&#27979;&#37327;&#21644;AI&#25903;&#25345;&#30340;&#25968;&#25454;&#21387;&#32553;&#21644;&#25925;&#38556;&#26816;&#27979;&#30340;&#30417;&#27979;&#21644;&#25511;&#21046;&#26694;&#26550;&#65292;&#36229;&#36234;&#20102;&#20808;&#21069;&#22522;&#20110;SCADA&#21644;&#21516;&#27493;&#30456;&#37327;&#25216;&#26415;&#26500;&#24314;&#30340;&#24191;&#22495;&#30417;&#27979;&#31995;&#32479;&#30340;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06942v1 Announce Type: cross  Abstract: Purpose This article presents a case for a next-generation grid monitoring and control system, leveraging recent advances in generative artificial intelligence (AI), machine learning, and statistical inference. Advancing beyond earlier generations of wide-area monitoring systems built upon supervisory control and data acquisition (SCADA) and synchrophasor technologies, we argue for a monitoring and control framework based on the streaming of continuous point-on-wave (CPOW) measurements with AI-powered data compression and fault detection.   Methods and Results: The architecture of the proposed design originates from the Wiener-Kallianpur innovation representation of a random process that transforms causally a stationary random process into an innovation sequence with independent and identically distributed random variables. This work presents a generative AI approach that (i) learns an innovation autoencoder that extracts innovation se
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;LQR&#25511;&#21046;&#22120;&#65292;&#22312;&#20960;&#20046;&#24517;&#28982;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377; $\tilde{ \mathcal{O}}(\sqrt{T})$ &#21518;&#24724;&#19978;&#38480;&#35777;&#26126;&#65292;&#19988;&#20855;&#26377;&#26029;&#30005;&#26426;&#21046;&#20445;&#35777;&#23433;&#20840;&#24182;&#23545;&#24615;&#33021;&#24433;&#21709;&#24456;&#23567;&#12290;</title><link>http://arxiv.org/abs/2301.05537</link><description>&lt;p&gt;
&#33258;&#36866;&#24212; LQR &#31639;&#27861;&#30340;&#36817;&#20046;&#24517;&#28982; $\sqrt{T}$ &#21518;&#24724;&#19978;&#38480;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Almost Surely $\sqrt{T}$ Regret Bound for Adaptive LQR. (arXiv:2301.05537v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05537
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;LQR&#25511;&#21046;&#22120;&#65292;&#22312;&#20960;&#20046;&#24517;&#28982;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377; $\tilde{ \mathcal{O}}(\sqrt{T})$ &#21518;&#24724;&#19978;&#38480;&#35777;&#26126;&#65292;&#19988;&#20855;&#26377;&#26029;&#30005;&#26426;&#21046;&#20445;&#35777;&#23433;&#20840;&#24182;&#23545;&#24615;&#33021;&#24433;&#21709;&#24456;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#26410;&#30693;&#31995;&#32479;&#21442;&#25968;&#30340;&#32447;&#24615;&#20108;&#27425;&#35843;&#33410;&#38382;&#39064;(LQR)&#24050;&#32463;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#65292;&#20294;&#26159;&#33267;&#20170;&#20173;&#19981;&#28165;&#26970;&#26159;&#21542;&#33021;&#20960;&#20046;&#24517;&#28982;&#22320;&#36798;&#21040; $\tilde{ \mathcal{O}}(\sqrt{T})$ &#30340;&#21518;&#24724;&#19978;&#38480;&#65292;&#32780;&#26412;&#25991;&#21017;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;LQR&#25511;&#21046;&#22120;&#65292;&#22312;&#20960;&#20046;&#24517;&#28982;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377; $\tilde{ \mathcal{O}}(\sqrt{T})$ &#21518;&#24724;&#19978;&#38480;&#30340;&#35777;&#26126;&#12290;&#35813;&#25511;&#21046;&#22120;&#20855;&#26377;&#26029;&#30005;&#26426;&#21046;&#65292;&#21487;&#20197;&#32469;&#36807;&#28508;&#22312;&#30340;&#23433;&#20840;&#38544;&#24739;&#24182;&#30830;&#20445;&#31995;&#32479;&#21442;&#25968;&#20272;&#35745;&#30340;&#25910;&#25947;&#24615;&#65292;&#20294;&#34987;&#35777;&#26126;&#21482;&#20250;&#26377;&#26377;&#38480;&#27425;&#35302;&#21457;&#65292;&#24182;&#23545;&#25511;&#21046;&#22120;&#30340;&#28176;&#36817;&#24615;&#33021;&#20960;&#20046;&#27809;&#26377;&#24433;&#21709;&#12290;&#36890;&#36807;&#22312;&#30000;&#32435;&#35199;&#20234;&#22763;&#26364;(Tennessee Eastman)&#24037;&#33402;&#20013;&#36827;&#34892;&#20223;&#30495;&#39564;&#35777;&#20102;&#35813;&#25511;&#21046;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Linear-Quadratic Regulation (LQR) problem with unknown system parameters has been widely studied, but it has remained unclear whether $\tilde{ \mathcal{O}}(\sqrt{T})$ regret, which is the best known dependence on time, can be achieved almost surely. In this paper, we propose an adaptive LQR controller with almost surely $\tilde{ \mathcal{O}}(\sqrt{T})$ regret upper bound. The controller features a circuit-breaking mechanism, which circumvents potential safety breach and guarantees the convergence of the system parameter estimate, but is shown to be triggered only finitely often and hence has negligible effect on the asymptotic performance of the controller. The proposed controller is also validated via simulation on Tennessee Eastman Process~(TEP), a commonly used industrial process example.
&lt;/p&gt;</description></item></channel></rss>