<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>StyleSinger&#26159;&#38024;&#23545;&#39046;&#22495;&#22806;&#28436;&#21809;&#22768;&#38899;&#21512;&#25104;&#30340;&#39118;&#26684;&#36716;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27531;&#24046;&#39118;&#26684;&#36866;&#37197;&#22120;&#65288;RSA&#65289;&#25429;&#25417;&#22810;&#26679;&#30340;&#39118;&#26684;&#29305;&#24449;&#23454;&#29616;&#39640;&#36136;&#37327;&#30340;&#21512;&#25104;&#28436;&#21809;&#22768;&#38899;&#12290;</title><link>http://arxiv.org/abs/2312.10741</link><description>&lt;p&gt;
StyleSinger: &#38024;&#23545;&#39046;&#22495;&#22806;&#28436;&#21809;&#22768;&#38899;&#21512;&#25104;&#30340;&#39118;&#26684;&#36716;&#31227;
&lt;/p&gt;
&lt;p&gt;
StyleSinger: Style Transfer for Out-of-Domain Singing Voice Synthesis. (arXiv:2312.10741v2 [eess.AS] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.10741
&lt;/p&gt;
&lt;p&gt;
StyleSinger&#26159;&#38024;&#23545;&#39046;&#22495;&#22806;&#28436;&#21809;&#22768;&#38899;&#21512;&#25104;&#30340;&#39118;&#26684;&#36716;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27531;&#24046;&#39118;&#26684;&#36866;&#37197;&#22120;&#65288;RSA&#65289;&#25429;&#25417;&#22810;&#26679;&#30340;&#39118;&#26684;&#29305;&#24449;&#23454;&#29616;&#39640;&#36136;&#37327;&#30340;&#21512;&#25104;&#28436;&#21809;&#22768;&#38899;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#39046;&#22495;&#22806;&#28436;&#21809;&#22768;&#38899;&#21512;&#25104;&#65288;SVS&#65289;&#30340;&#39118;&#26684;&#36716;&#31227;&#19987;&#27880;&#20110;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#28436;&#21809;&#22768;&#38899;&#65292;&#35813;&#22768;&#38899;&#20855;&#26377;&#20174;&#21442;&#32771;&#28436;&#21809;&#22768;&#38899;&#26679;&#26412;&#20013;&#34893;&#29983;&#30340;&#26410;&#35265;&#39118;&#26684;&#65288;&#22914;&#38899;&#33394;&#12289;&#24773;&#24863;&#12289;&#21457;&#38899;&#21644;&#21457;&#38899;&#25216;&#24039;&#65289;&#12290;&#28982;&#32780;&#65292;&#27169;&#25311;&#28436;&#21809;&#22768;&#38899;&#39118;&#26684;&#30340;&#31934;&#32454;&#24046;&#24322;&#26159;&#19968;&#39033;&#33392;&#24040;&#30340;&#20219;&#21153;&#65292;&#22240;&#20026;&#28436;&#21809;&#22768;&#38899;&#20855;&#26377;&#38750;&#24120;&#39640;&#30340;&#34920;&#29616;&#21147;&#12290;&#27492;&#22806;&#65292;&#29616;&#26377;&#30340;SVS&#26041;&#27861;&#22312;&#39046;&#22495;&#22806;&#22330;&#26223;&#20013;&#21512;&#25104;&#30340;&#28436;&#21809;&#22768;&#38899;&#36136;&#37327;&#19979;&#38477;&#65292;&#22240;&#20026;&#23427;&#20204;&#22522;&#20110;&#35757;&#32451;&#38454;&#27573;&#21487;&#36776;&#21035;&#20986;&#30446;&#26631;&#22768;&#38899;&#23646;&#24615;&#30340;&#20551;&#35774;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;StyleSinger&#65292;&#36825;&#26159;&#31532;&#19968;&#20010;&#29992;&#20110;&#39046;&#22495;&#22806;&#21442;&#32771;&#28436;&#21809;&#22768;&#38899;&#26679;&#26412;&#30340;&#38646;&#26679;&#24335;&#36716;&#31227;&#30340;&#28436;&#21809;&#22768;&#38899;&#21512;&#25104;&#27169;&#22411;&#12290;StyleSinger&#37319;&#29992;&#20102;&#20004;&#31181;&#20851;&#38190;&#26041;&#27861;&#20197;&#25552;&#39640;&#25928;&#26524;&#65306;1&#65289;&#27531;&#24046;&#39118;&#26684;&#36866;&#37197;&#22120;&#65288;RSA&#65289;&#65292;&#23427;&#20351;&#29992;&#27531;&#24046;&#37327;&#21270;&#27169;&#22359;&#26469;&#25429;&#25417;&#22810;&#26679;&#30340;&#39118;&#26684;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
Style transfer for out-of-domain (OOD) singing voice synthesis (SVS) focuses on generating high-quality singing voices with unseen styles (such as timbre, emotion, pronunciation, and articulation skills) derived from reference singing voice samples. However, the endeavor to model the intricate nuances of singing voice styles is an arduous task, as singing voices possess a remarkable degree of expressiveness. Moreover, existing SVS methods encounter a decline in the quality of synthesized singing voices in OOD scenarios, as they rest upon the assumption that the target vocal attributes are discernible during the training phase. To overcome these challenges, we propose StyleSinger, the first singing voice synthesis model for zero-shot style transfer of out-of-domain reference singing voice samples. StyleSinger incorporates two critical approaches for enhanced effectiveness: 1) the Residual Style Adaptor (RSA) which employs a residual quantization module to capture diverse style character
&lt;/p&gt;</description></item></channel></rss>