<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>DurFlex-EVC&#36890;&#36807;&#24341;&#20837;&#39118;&#26684;&#33258;&#32534;&#30721;&#22120;&#21644;&#20132;&#21449;&#27880;&#24847;&#21147;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#24773;&#32490;&#35821;&#38899;&#36716;&#25442;&#27169;&#22411;&#20013;&#23545;&#35821;&#35328;&#21644;&#35821;&#38899;&#20449;&#24687;&#30340;&#21516;&#27493;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2401.08095</link><description>&lt;p&gt;
DurFlex-EVC: &#20855;&#26377;&#24182;&#34892;&#29983;&#25104;&#30340;&#25345;&#32493;&#28789;&#27963;&#24773;&#32490;&#35821;&#38899;&#36716;&#25442;
&lt;/p&gt;
&lt;p&gt;
DurFlex-EVC: Duration-Flexible Emotional Voice Conversion with Parallel Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.08095
&lt;/p&gt;
&lt;p&gt;
DurFlex-EVC&#36890;&#36807;&#24341;&#20837;&#39118;&#26684;&#33258;&#32534;&#30721;&#22120;&#21644;&#20132;&#21449;&#27880;&#24847;&#21147;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#24773;&#32490;&#35821;&#38899;&#36716;&#25442;&#27169;&#22411;&#20013;&#23545;&#35821;&#35328;&#21644;&#35821;&#38899;&#20449;&#24687;&#30340;&#21516;&#27493;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24773;&#32490;&#35821;&#38899;&#36716;&#25442;&#65288;EVC&#65289;&#26088;&#22312;&#20462;&#25913;&#35828;&#35805;&#32773;&#22768;&#38899;&#30340;&#24773;&#32490;&#33394;&#24425;&#65292;&#21516;&#26102;&#20445;&#30041;&#21407;&#22987;&#30340;&#35821;&#35328;&#20869;&#23481;&#21644;&#35828;&#35805;&#32773;&#29420;&#29305;&#30340;&#22768;&#38899;&#29305;&#24449;&#12290;&#26368;&#36817;EVC&#30340;&#36827;&#23637;&#28041;&#21450;&#21516;&#26102;&#24314;&#27169;&#38899;&#39640;&#21644;&#25345;&#32493;&#26102;&#38388;&#65292;&#21033;&#29992;&#24207;&#21015;&#21040;&#24207;&#21015;&#65288;seq2seq&#65289;&#27169;&#22411;&#30340;&#28508;&#21147;&#12290;&#20026;&#20102;&#22686;&#24378;&#36716;&#25442;&#30340;&#21487;&#38752;&#24615;&#21644;&#25928;&#29575;&#65292;&#26412;&#30740;&#31350;&#23558;&#37325;&#28857;&#36716;&#21521;&#24182;&#34892;&#35821;&#38899;&#29983;&#25104;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;DurFlex-EVC&#65292;&#23427;&#38598;&#25104;&#20102;&#39118;&#26684;&#33258;&#32534;&#30721;&#22120;&#21644;&#21333;&#20803;&#23545;&#40784;&#22120;&#12290;&#20256;&#32479;&#27169;&#22411;&#34429;&#28982;&#34701;&#20837;&#20102;&#21253;&#21547;&#35821;&#35328;&#21644;&#35821;&#38899;&#20449;&#24687;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#65288;SSL&#65289;&#34920;&#31034;&#65292;&#20294;&#21364;&#24573;&#35270;&#20102;&#36825;&#31181;&#21452;&#37325;&#24615;&#36136;&#65292;&#23548;&#33268;&#20102;&#21487;&#25511;&#24615;&#30340;&#38477;&#20302;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#20132;&#21449;&#27880;&#24847;&#21147;&#20197;&#23558;&#36825;&#20123;&#34920;&#31034;&#19982;&#19981;&#21516;&#24773;&#32490;&#36827;&#34892;&#21516;&#27493;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#39118;&#26684;&#33258;&#32534;&#30721;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2401.08095v2 Announce Type: replace-cross  Abstract: Emotional voice conversion (EVC) seeks to modify the emotional tone of a speaker's voice while preserving the original linguistic content and the speaker's unique vocal characteristics. Recent advancements in EVC have involved the simultaneous modeling of pitch and duration, utilizing the potential of sequence-to-sequence (seq2seq) models. To enhance reliability and efficiency in conversion, this study shifts focus towards parallel speech generation. We introduce Duration-Flexible EVC (DurFlex-EVC), which integrates a style autoencoder and unit aligner. Traditional models, while incorporating self-supervised learning (SSL) representations that contain both linguistic and paralinguistic information, have neglected this dual nature, leading to reduced controllability. Addressing this issue, we implement cross-attention to synchronize these representations with various emotions. Additionally, a style autoencoder is developed for t
&lt;/p&gt;</description></item></channel></rss>