<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#35745;&#31639;&#26041;&#27861;&#65292;&#29992;&#20110;&#28418;&#31227;&#25511;&#21046;&#39640;&#32500;RBMs&#12290;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#25216;&#26415;&#65292;&#35813;&#26041;&#27861;&#22312;&#27979;&#35797;&#38382;&#39064;&#19978;&#36798;&#21040;&#20102;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.11651</link><description>&lt;p&gt;
&#39640;&#32500;RBM&#30340;&#28418;&#31227;&#25511;&#21046;&#65306;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#35745;&#31639;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Drift Control of High-Dimensional RBM: A Computational Method Based on Neural Networks. (arXiv:2309.11651v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11651
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#30340;&#35745;&#31639;&#26041;&#27861;&#65292;&#29992;&#20110;&#28418;&#31227;&#25511;&#21046;&#39640;&#32500;RBMs&#12290;&#36890;&#36807;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#25216;&#26415;&#65292;&#35813;&#26041;&#27861;&#22312;&#27979;&#35797;&#38382;&#39064;&#19978;&#36798;&#21040;&#20102;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#25490;&#38431;&#29702;&#35770;&#24212;&#29992;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#29366;&#24577;&#31354;&#38388;&#20026;d&#32500;&#27491;&#21322;&#36724;&#30340;&#38543;&#26426;&#25511;&#21046;&#38382;&#39064;&#12290;&#25511;&#21046;&#36807;&#31243;Z&#25353;&#29031;&#19968;&#20010;&#21453;&#23556;&#24067;&#26391;&#36816;&#21160;&#28436;&#21270;&#65292;&#20854;&#21327;&#26041;&#24046;&#30697;&#38453;&#26159;&#22806;&#29983;&#25351;&#23450;&#30340;&#65292;&#21453;&#23556;&#26041;&#21521;&#26159;&#20174;&#27491;&#21322;&#36724;&#36793;&#30028;&#34920;&#38754;&#21453;&#23556;&#12290;&#31995;&#32479;&#31649;&#29702;&#21592;&#26681;&#25454;Z&#30340;&#21382;&#21490;&#36873;&#25321;&#27599;&#20010;&#26102;&#38388;&#28857;t&#19978;&#30340;&#28418;&#31227;&#21521;&#37327;&#952;(t)&#65292;&#32780;&#26102;&#38388;&#28857;t&#19978;&#30340;&#25104;&#26412;&#29575;&#21462;&#20915;&#20110;Z(t)&#21644;&#952;(t)&#12290;&#22312;&#25105;&#20204;&#30340;&#21021;&#22987;&#38382;&#39064;&#34920;&#36848;&#20013;&#65292;&#30446;&#26631;&#26159;&#22312;&#26080;&#38480;&#35268;&#21010;&#26102;&#38388;&#33539;&#22260;&#20869;&#26368;&#23567;&#21270;&#26399;&#26395;&#36148;&#29616;&#25104;&#26412;&#65292;&#20043;&#21518;&#25105;&#20204;&#22788;&#29702;&#30456;&#24212;&#30340;&#20154;&#22343;&#25511;&#21046;&#38382;&#39064;&#12290;&#20511;&#37492;&#38889;&#28023;&#20142;&#31561;&#20154;&#65288;&#22269;&#23478;&#31185;&#23398;&#38498;&#23398;&#25253;&#65292;2018, 8505-8510&#65289;&#30340;&#26089;&#26399;&#24037;&#20316;&#65292;&#25105;&#20204;&#24320;&#21457;&#24182;&#23637;&#31034;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#25216;&#26415;&#30340;&#22522;&#20110;&#27169;&#25311;&#30340;&#35745;&#31639;&#26041;&#27861;&#12290;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#25105;&#20204;&#30740;&#31350;&#30340;&#27979;&#35797;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#31934;&#24230;&#22312;&#19968;&#20010;&#23567;&#25968;&#33539;&#22260;&#20869;&#20934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by applications in queueing theory, we consider a stochastic control problem whose state space is the $d$-dimensional positive orthant. The controlled process $Z$ evolves as a reflected Brownian motion whose covariance matrix is exogenously specified, as are its directions of reflection from the orthant's boundary surfaces. A system manager chooses a drift vector $\theta(t)$ at each time $t$ based on the history of $Z$, and the cost rate at time $t$ depends on both $Z(t)$ and $\theta(t)$. In our initial problem formulation, the objective is to minimize expected discounted cost over an infinite planning horizon, after which we treat the corresponding ergodic control problem. Extending earlier work by Han et al. (Proceedings of the National Academy of Sciences, 2018, 8505-8510), we develop and illustrate a simulation-based computational method that relies heavily on deep neural network technology. For test problems studied thus far, our method is accurate to within a fraction o
&lt;/p&gt;</description></item></channel></rss>