<rss version="2.0"><channel><title>Chat Arxiv cs.SC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SC</description><item><title>&#26412;&#25991;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#21644;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#33258;&#21160;&#21270;&#22320;&#25214;&#21040;&#22522;&#26412;&#21464;&#25442;&#35268;&#21017;&#21644;&#36880;&#27493;&#35299;&#20915;&#26041;&#26696;&#65292;&#23454;&#29616;&#20102;&#31526;&#21495;&#26041;&#31243;&#30340;&#27714;&#35299;&#12290;</title><link>http://arxiv.org/abs/2401.13447</link><description>&lt;p&gt;
&#36890;&#36807;&#24378;&#21270;&#23398;&#20064;&#27714;&#35299;&#31526;&#21495;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Symbolic Equation Solving via Reinforcement Learning. (arXiv:2401.13447v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13447
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#21644;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#33258;&#21160;&#21270;&#22320;&#25214;&#21040;&#22522;&#26412;&#21464;&#25442;&#35268;&#21017;&#21644;&#36880;&#27493;&#35299;&#20915;&#26041;&#26696;&#65292;&#23454;&#29616;&#20102;&#31526;&#21495;&#26041;&#31243;&#30340;&#27714;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#36880;&#28176;&#22312;&#21508;&#31181;&#31038;&#20250;&#12289;&#32463;&#27982;&#21644;&#31185;&#23398;&#29615;&#22659;&#20013;&#24471;&#21040;&#24212;&#29992;&#65292;&#28982;&#32780;&#22312;&#31934;&#30830;&#25968;&#23398;&#19978;&#23427;&#20204;&#24120;&#24120;&#36935;&#21040;&#22256;&#38590;&#12290;&#19968;&#20010;&#20856;&#22411;&#30340;&#20363;&#23376;&#26159;&#35745;&#31639;&#26426;&#20195;&#25968;&#65292;&#21253;&#25324;&#31616;&#21270;&#25968;&#23398;&#26415;&#35821;&#12289;&#35745;&#31639;&#24418;&#24335;&#23548;&#25968;&#25110;&#25214;&#21040;&#20195;&#25968;&#26041;&#31243;&#30340;&#31934;&#30830;&#35299;&#31561;&#20219;&#21153;&#12290;&#20256;&#32479;&#30340;&#36719;&#20214;&#21253;&#36890;&#24120;&#22522;&#20110;&#19968;&#20010;&#24040;&#22823;&#30340;&#35268;&#21017;&#25968;&#25454;&#24211;&#65292;&#36825;&#20123;&#35268;&#21017;&#25551;&#36848;&#20102;&#19968;&#20010;&#29305;&#23450;&#25805;&#20316;&#65288;&#20363;&#22914;&#23548;&#25968;&#65289;&#22914;&#20309;&#23558;&#19968;&#20010;&#26415;&#35821;&#65288;&#20363;&#22914;&#27491;&#24358;&#20989;&#25968;&#65289;&#36716;&#21270;&#20026;&#21478;&#19968;&#20010;&#65288;&#20363;&#22914;&#20313;&#24358;&#20989;&#25968;&#65289;&#12290;&#36804;&#20170;&#20026;&#27490;&#65292;&#36825;&#20123;&#35268;&#21017;&#36890;&#24120;&#38656;&#35201;&#20154;&#31867;&#21457;&#29616;&#24182;&#32534;&#31243;&#12290;&#37325;&#28857;&#35752;&#35770;&#35299;&#20915;&#31526;&#21495;&#24418;&#24335;&#30340;&#32447;&#24615;&#26041;&#31243;&#30340;&#33539;&#20363;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#24378;&#21270;&#23398;&#20064;&#33258;&#21160;&#21270;&#22320;&#25214;&#21040;&#22522;&#26412;&#21464;&#25442;&#35268;&#21017;&#21644;&#36880;&#27493;&#35299;&#20915;&#26041;&#26696;&#30340;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine-learning methods are gradually being adopted in a great variety of social, economic, and scientific contexts, yet they are notorious for struggling with exact mathematics. A typical example is computer algebra, which includes tasks like simplifying mathematical terms, calculating formal derivatives, or finding exact solutions of algebraic equations. Traditional software packages for these purposes are commonly based on a huge database of rules for how a specific operation (e.g., differentiation) transforms a certain term (e.g., sine function) into another one (e.g., cosine function). Thus far, these rules have usually needed to be discovered and subsequently programmed by humans. Focusing on the paradigmatic example of solving linear equations in symbolic form, we demonstrate how the process of finding elementary transformation rules and step-by-step solutions can be automated using reinforcement learning with deep neural networks.
&lt;/p&gt;</description></item></channel></rss>