<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>A-X&#20381;&#36182;&#20851;&#31995;&#26159;&#24433;&#21709;&#22270;&#21367;&#31215;&#25928;&#26524;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#29305;&#24449;&#37325;&#25490;&#21487;&#20197;&#26174;&#33879;&#25552;&#21319;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.04621</link><description>&lt;p&gt;
&#22270;&#25299;&#25169;&#32467;&#26500;&#19978;&#30340;&#29305;&#24449;&#20998;&#24067;&#35843;&#33410;&#20102;&#22270;&#21367;&#31215;&#30340;&#25928;&#26524;&#65306;&#21516;&#36136;&#24615;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Feature Distribution on Graph Topology Mediates the Effect of Graph Convolution: Homophily Perspective
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04621
&lt;/p&gt;
&lt;p&gt;
A-X&#20381;&#36182;&#20851;&#31995;&#26159;&#24433;&#21709;&#22270;&#21367;&#31215;&#25928;&#26524;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#29305;&#24449;&#37325;&#25490;&#21487;&#20197;&#26174;&#33879;&#25552;&#21319;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#37325;&#25490;&#21516;&#19968;&#31867;&#21035;&#33410;&#28857;&#20043;&#38388;&#30340;&#29305;&#24449;&#21521;&#37327;&#22914;&#20309;&#24433;&#21709;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#65311;&#30452;&#35266;&#22320;&#35828;&#65292;&#29305;&#24449;&#37325;&#25490;&#25200;&#20081;&#20102;GNNs&#20174;&#22270;&#25299;&#25169;&#21644;&#29305;&#24449;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65288;A-X&#20381;&#36182;&#20851;&#31995;&#65289;&#65292;&#20174;&#32780;&#24433;&#21709;&#20102;GNNs&#30340;&#23398;&#20064;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#22312;&#29305;&#24449;&#37325;&#25490;&#20043;&#21518;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;GNNs&#30340;&#24615;&#33021;&#26174;&#33879;&#25552;&#21319;&#12290;&#30001;&#20110;&#24573;&#35270;&#20102;A-X&#20381;&#36182;&#20851;&#31995;&#23545;GNNs&#30340;&#24433;&#21709;&#65292;&#20808;&#21069;&#30340;&#25991;&#29486;&#27809;&#26377;&#32473;&#20986;&#23545;&#35813;&#29616;&#35937;&#30340;&#28385;&#24847;&#35299;&#37322;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#30740;&#31350;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#22914;&#20309;&#22312;&#25511;&#21046;&#28508;&#22312;&#28151;&#28102;&#22240;&#32032;&#30340;&#24773;&#20917;&#19979;&#24230;&#37327;A-X&#20381;&#36182;&#20851;&#31995;&#65311;&#20854;&#27425;&#65292;A-X&#20381;&#36182;&#20851;&#31995;&#22914;&#20309;&#24433;&#21709;GNNs&#65311;&#20316;&#20026;&#22238;&#24212;&#65292;&#25105;&#20204;&#65288;i&#65289;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#24230;&#37327;A-X&#20381;&#36182;&#20851;&#31995;&#30340;&#26041;&#27861;&#65292;&#65288;ii&#65289;&#35774;&#35745;&#20102;&#19968;&#20010;&#25511;&#21046;A-X&#20381;&#36182;&#20851;&#31995;&#30340;&#38543;&#26426;&#22270;&#27169;&#22411;&#65292;&#65288;iii&#65289;&#24314;&#31435;&#20102;A-X&#20381;&#36182;&#20851;&#31995;&#19982;&#22270;&#21367;&#31215;&#20043;&#38388;&#20851;&#31995;&#30340;&#29702;&#35770;&#65292;&#20197;&#21450;&#65288;iv&#65289;&#23545;&#23454;&#38469;&#22270;&#36827;&#34892;&#20102;&#19982;&#29702;&#35770;&#19968;&#33268;&#30340;&#23454;&#35777;&#20998;&#26512;&#12290;&#25105;&#20204;&#35748;&#20026;A-X&#20381;&#36182;&#20851;&#31995;&#23545;GNNs&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
How would randomly shuffling feature vectors among nodes from the same class affect graph neural networks (GNNs)? The feature shuffle, intuitively, perturbs the dependence between graph topology and features (A-X dependence) for GNNs to learn from. Surprisingly, we observe a consistent and significant improvement in GNN performance following the feature shuffle. Having overlooked the impact of A-X dependence on GNNs, the prior literature does not provide a satisfactory understanding of the phenomenon. Thus, we raise two research questions. First, how should A-X dependence be measured, while controlling for potential confounds? Second, how does A-X dependence affect GNNs? In response, we (i) propose a principled measure for A-X dependence, (ii) design a random graph model that controls A-X dependence, (iii) establish a theory on how A-X dependence relates to graph convolution, and (iv) present empirical analysis on real-world graphs that aligns with the theory. We conclude that A-X depe
&lt;/p&gt;</description></item></channel></rss>