<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#33258;&#20027;&#20379;&#24212;&#38142;&#65288;ASC&#65289;&#30340;&#27491;&#24335;&#23450;&#20041;&#12289;&#29305;&#24449;&#21644;&#36741;&#21161;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#27010;&#24565;&#26694;&#26550;&#21644;&#20379;&#24212;&#38142;&#33258;&#27835;&#21442;&#32771;&#27169;&#22411;&#12290;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#22522;&#20110;&#36825;&#20123;&#27010;&#24565;&#30340;&#21021;&#22987;ASC&#23454;&#26045;&#12290;</title><link>http://arxiv.org/abs/2401.14183</link><description>&lt;p&gt;
&#24378;&#35843;&#33258;&#20027;&#20379;&#24212;&#38142;&#65306;&#23450;&#20041;&#12289;&#29305;&#24449;&#12289;&#27010;&#24565;&#26694;&#26550;&#21644;&#33258;&#20027;&#27700;&#24179;
&lt;/p&gt;
&lt;p&gt;
Towards Autonomous Supply Chains: Definition, Characteristics, Conceptual Framework, and Autonomy Levels. (arXiv:2401.14183v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14183
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#33258;&#20027;&#20379;&#24212;&#38142;&#65288;ASC&#65289;&#30340;&#27491;&#24335;&#23450;&#20041;&#12289;&#29305;&#24449;&#21644;&#36741;&#21161;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#23618;&#27010;&#24565;&#26694;&#26550;&#21644;&#20379;&#24212;&#38142;&#33258;&#27835;&#21442;&#32771;&#27169;&#22411;&#12290;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#22522;&#20110;&#36825;&#20123;&#27010;&#24565;&#30340;&#21021;&#22987;ASC&#23454;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#20840;&#29699;&#24615;&#24178;&#25200;&#65292;&#22914;&#22823;&#27969;&#34892;&#21644;&#22320;&#32536;&#25919;&#27835;&#20914;&#31361;&#65292;&#28145;&#21051;&#26292;&#38706;&#20102;&#20256;&#32479;&#20379;&#24212;&#38142;&#30340;&#33030;&#24369;&#24615;&#65292;&#38656;&#35201;&#25506;&#32034;&#26356;&#26377;&#24377;&#24615;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#33258;&#20027;&#20379;&#24212;&#38142;&#65288;ASC&#65289;&#20316;&#20026;&#28508;&#22312;&#35299;&#20915;&#26041;&#26696;&#20986;&#29616;&#65292;&#25552;&#20379;&#20102;&#22312;&#21160;&#33633;&#30340;&#36152;&#26131;&#29615;&#22659;&#20013;&#22686;&#21152;&#21487;&#35265;&#24615;&#12289;&#28789;&#27963;&#24615;&#21644;&#24377;&#24615;&#30340;&#20248;&#21183;&#12290;&#23613;&#31649;&#24037;&#19994;&#30028;&#21644;&#23398;&#26415;&#30028;&#22810;&#24180;&#26469;&#19968;&#30452;&#22312;&#35752;&#35770;ASC&#65292;&#20294;&#32570;&#20047;&#33391;&#22909;&#24314;&#31435;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;&#26412;&#25991;&#36890;&#36807;&#25552;&#20379;ASC&#30340;&#27491;&#24335;&#23450;&#20041;&#20197;&#21450;&#20854;&#23450;&#20041;&#29305;&#24449;&#21644;&#36741;&#21161;&#27010;&#24565;&#26469;&#22635;&#34917;&#36825;&#19968;&#30740;&#31350;&#31354;&#30333;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;MIISI&#27169;&#22411;&#30340;&#20998;&#23618;&#27010;&#24565;&#26694;&#26550;&#12290;&#36890;&#36807;&#19968;&#20010;&#37325;&#28857;&#20851;&#27880;&#32905;&#31867;&#20379;&#24212;&#38142;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;&#22522;&#20110;&#36825;&#19968;&#27010;&#24565;&#27169;&#22411;&#30340;&#21021;&#22987;ASC&#23454;&#26045;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#19968;&#20010;&#19971;&#32423;&#20379;&#24212;&#38142;&#33258;&#27835;&#21442;&#32771;&#27169;&#22411;&#65292;&#25551;&#32472;&#20102;&#23454;&#29616;&#23436;&#20840;&#20379;&#24212;&#38142;&#33258;&#27835;&#30340;&#36712;&#36857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent global disruptions, such as the pandemic and geopolitical conflicts, have profoundly exposed vulnerabilities in traditional supply chains, requiring exploration of more resilient alternatives. Autonomous supply chains (ASCs) have emerged as a potential solution, offering increased visibility, flexibility, and resilience in turbulent trade environments. Despite discussions in industry and academia over several years, ASCs lack well-established theoretical foundations. This paper addresses this research gap by presenting a formal definition of ASC along with its defining characteristics and auxiliary concepts. We propose a layered conceptual framework called the MIISI model. An illustrative case study focusing on the meat supply chain demonstrates an initial ASC implementation based on this conceptual model. Additionally, we introduce a seven-level supply chain autonomy reference model, delineating a trajectory towards achieving a full supply chain autonomy. Recognising that this 
&lt;/p&gt;</description></item></channel></rss>