<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>HetTree&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#24322;&#26500;&#26641;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#36890;&#36807;&#26500;&#24314;&#35821;&#20041;&#26641;&#25968;&#25454;&#32467;&#26500;&#25429;&#25417;&#20803;&#36335;&#24452;&#20043;&#38388;&#30340;&#23618;&#27425;&#20851;&#31995;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#24573;&#30053;&#30340;&#24322;&#26500;&#22270;&#20013;&#30340;&#26641;&#24418;&#23618;&#27425;&#32467;&#26500;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.13496</link><description>&lt;p&gt;
HetTree: &#24322;&#26500;&#26641;&#22270;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
HetTree: Heterogeneous Tree Graph Neural Network
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13496
&lt;/p&gt;
&lt;p&gt;
HetTree&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#24322;&#26500;&#26641;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#36890;&#36807;&#26500;&#24314;&#35821;&#20041;&#26641;&#25968;&#25454;&#32467;&#26500;&#25429;&#25417;&#20803;&#36335;&#24452;&#20043;&#38388;&#30340;&#23618;&#27425;&#20851;&#31995;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#24573;&#30053;&#30340;&#24322;&#26500;&#22270;&#20013;&#30340;&#26641;&#24418;&#23618;&#27425;&#32467;&#26500;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#36807;&#21435;&#30475;&#21040;&#20102;&#23545;&#24322;&#26500;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;HGNNs&#65289;&#30340;&#20852;&#36259;&#26085;&#30410;&#22686;&#38271;&#65292;&#22240;&#20026;&#35768;&#22810;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#22270;&#26159;&#24322;&#26500;&#30340;&#65292;&#20174;&#24341;&#29992;&#22270;&#21040;&#30005;&#23376;&#37038;&#20214;&#22270;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#24573;&#30053;&#20102;&#20803;&#36335;&#24452;&#20043;&#38388;&#30340;&#26641;&#24418;&#23618;&#27425;&#32467;&#26500;&#65292;&#35813;&#32467;&#26500;&#26159;&#30001;&#19981;&#21516;&#30340;&#33410;&#28857;&#31867;&#22411;&#21644;&#20851;&#31995;&#31867;&#22411;&#33258;&#28982;&#26500;&#25104;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;HetTree&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#24322;&#26500;&#26641;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#20197;&#21487;&#25193;&#23637;&#19988;&#26377;&#25928;&#30340;&#26041;&#24335;&#24314;&#27169;&#22270;&#32467;&#26500;&#21644;&#24322;&#26500;&#26041;&#38754;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;HetTree&#26500;&#24314;&#20102;&#19968;&#20010;&#35821;&#20041;&#26641;&#25968;&#25454;&#32467;&#26500;&#65292;&#29992;&#20110;&#25429;&#25417;&#20803;&#36335;&#24452;&#20043;&#38388;&#30340;&#23618;&#27425;&#20851;&#31995;&#12290;&#29616;&#26377;&#30340;&#26641;&#24418;&#32534;&#30721;&#25216;&#26415;&#36890;&#36807;&#26681;&#25454;&#23376;&#33410;&#28857;&#19982;&#29238;&#33410;&#28857;&#30340;&#30456;&#20284;&#24615;&#26469;&#21152;&#26435;&#23376;&#33410;&#28857;&#30340;&#36129;&#29486;&#26469;&#32858;&#21512;&#23376;&#33410;&#28857;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#31181;&#26641;&#24418;&#32534;&#30721;&#26410;&#33021;&#25429;&#25417;&#25972;&#20010;&#29238;&#23376;&#23618;&#27425;&#32467;&#26500;&#65292;&#22240;&#20026;&#21482;&#32771;&#34385;&#20102;&#29238;&#33410;&#28857;&#12290;&#22240;&#27492;&#65292;HetTree&#20351;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#23376;&#26641;&#27880;&#24847;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13496v1 Announce Type: new  Abstract: The recent past has seen an increasing interest in Heterogeneous Graph Neural Networks (HGNNs) since many real-world graphs are heterogeneous in nature, from citation graphs to email graphs. However, existing methods ignore a tree hierarchy among metapaths, which is naturally constituted by different node types and relation types. In this paper, we present HetTree, a novel heterogeneous tree graph neural network that models both the graph structure and heterogeneous aspects in a scalable and effective manner. Specifically, HetTree builds a semantic tree data structure to capture the hierarchy among metapaths. Existing tree encoding techniques aggregate children nodes by weighting the contribution of children nodes based on similarity to the parent node. However, we find that this tree encoding fails to capture the entire parent-children hierarchy by only considering the parent node. Hence, HetTree uses a novel subtree attention mechanism
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#25299;&#25169;&#30340;&#28857;&#32858;&#31867;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#21033;&#29992;&#25299;&#25169;&#29305;&#24449;&#25551;&#36848;&#28857;&#20113;&#20869;&#30340;&#25968;&#25454;&#28857;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#22270;&#27169;&#22411;&#26041;&#27861;&#26356;&#20855;&#26377;&#20581;&#22766;&#24615;&#21644;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2303.16716</link><description>&lt;p&gt;
&#22522;&#20110;&#25299;&#25169;&#30340;&#28857;&#20113;&#32858;&#31867;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Topological Point Cloud Clustering. (arXiv:2303.16716v1 [math.AT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16716
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#25299;&#25169;&#30340;&#28857;&#32858;&#31867;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#21033;&#29992;&#25299;&#25169;&#29305;&#24449;&#25551;&#36848;&#28857;&#20113;&#20869;&#30340;&#25968;&#25454;&#28857;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#22270;&#27169;&#22411;&#26041;&#27861;&#26356;&#20855;&#26377;&#20581;&#22766;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21483;&#20570;&#25299;&#25169;&#28857;&#20113;&#32858;&#31867;&#65288;TPCC&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#23427;&#22522;&#20110;&#28857;&#20113;&#23545;&#20110;&#20840;&#23616;&#25299;&#25169;&#29305;&#24449;&#30340;&#36129;&#29486;&#26469;&#32858;&#31867;&#28857;&#12290;TPCC&#20174;&#35889;&#32858;&#31867;&#21644;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#32508;&#21512;&#20102;&#26377;&#21033;&#30340;&#29305;&#24449;&#65292;&#22522;&#20110;&#32771;&#34385;&#19982;&#25152;&#32771;&#34385;&#30340;&#28857;&#20113;&#30456;&#20851;&#32852;&#30340;&#19968;&#20010;&#21333;&#24418;&#22797;&#21512;&#20307;&#30340;&#35889;&#29305;&#24615;&#12290;&#30001;&#20110;&#23427;&#22522;&#20110;&#32771;&#34385;&#31232;&#30095;&#29305;&#24449;&#21521;&#37327;&#35745;&#31639;&#65292;TPCC&#21516;&#26679;&#23481;&#26131;&#35299;&#37322;&#21644;&#23454;&#29616;&#65292;&#23601;&#20687;&#35889;&#32858;&#31867;&#19968;&#26679;&#12290;&#28982;&#32780;&#65292;&#36890;&#36807;&#19981;&#20165;&#20851;&#27880;&#19982;&#20174;&#28857;&#20113;&#25968;&#25454;&#21019;&#24314;&#30340;&#22270;&#30456;&#20851;&#32852;&#30340;&#21333;&#20010;&#30697;&#38453;&#65292;&#32780;&#26159;&#20851;&#27880;&#19982;&#24688;&#24403;&#26500;&#36896;&#30340;&#21333;&#24418;&#22797;&#21512;&#20307;&#30456;&#20851;&#32852;&#30340;&#25972;&#20010;Hodge-Laplacian&#30340;&#19968;&#25972;&#22871;&#30697;&#38453;&#65292;&#25105;&#20204;&#21487;&#20197;&#21033;&#29992;&#26356;&#20016;&#23500;&#30340;&#25299;&#25169;&#29305;&#24449;&#26469;&#25551;&#36848;&#28857;&#20113;&#20869;&#30340;&#25968;&#25454;&#28857;&#65292;&#24182;&#21463;&#30410;&#20110;&#25299;&#25169;&#25216;&#26415;&#30456;&#23545;&#20110;&#22122;&#22768;&#30340;&#30456;&#23545;&#20581;&#22766;&#24615;&#12290;&#25105;&#20204;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#19978;&#27979;&#35797;&#20102;TPCC&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present Topological Point Cloud Clustering (TPCC), a new method to cluster points in an arbitrary point cloud based on their contribution to global topological features. TPCC synthesizes desirable features from spectral clustering and topological data analysis and is based on considering the spectral properties of a simplicial complex associated to the considered point cloud. As it is based on considering sparse eigenvector computations, TPCC is similarly easy to interpret and implement as spectral clustering. However, by focusing not just on a single matrix associated to a graph created from the point cloud data, but on a whole set of Hodge-Laplacians associated to an appropriately constructed simplicial complex, we can leverage a far richer set of topological features to characterize the data points within the point cloud and benefit from the relative robustness of topological techniques against noise. We test the performance of TPCC on both synthetic and real-world data and compa
&lt;/p&gt;</description></item></channel></rss>