<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#35813;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#31639;&#26415;&#30005;&#36335;&#32422;&#26463;&#32534;&#30721;&#20026;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#20195;&#25968;&#35745;&#31639;&#22312;&#26377;&#38480;&#22495;&#19978;&#35299;&#20915;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#20197;&#31934;&#30830;&#23450;&#20301;ZKP&#30005;&#36335;&#20013;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#38169;&#35823;&#12290;</title><link>https://arxiv.org/abs/2403.15676</link><description>&lt;p&gt;
AC4&#65306;&#29992;&#20110;ZKP&#20013;&#30005;&#36335;&#32422;&#26463;&#30340;&#20195;&#25968;&#35745;&#31639;&#26816;&#26597;&#22120;
&lt;/p&gt;
&lt;p&gt;
AC4: Algebraic Computation Checker for Circuit Constraints in ZKPs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15676
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#31639;&#26415;&#30005;&#36335;&#32422;&#26463;&#32534;&#30721;&#20026;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#20195;&#25968;&#35745;&#31639;&#22312;&#26377;&#38480;&#22495;&#19978;&#35299;&#20915;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#20197;&#31934;&#30830;&#23450;&#20301;ZKP&#30005;&#36335;&#20013;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
ZKP&#31995;&#32479;&#24050;&#32463;&#24341;&#36215;&#20102;&#20154;&#20204;&#30340;&#20851;&#27880;&#65292;&#22312;&#24403;&#20195;&#23494;&#30721;&#23398;&#20013;&#21457;&#25381;&#30528;&#22522;&#30784;&#24615;&#20316;&#29992;&#12290; Zk-SNARK&#21327;&#35758;&#20027;&#23548;&#20102;ZKP&#30340;&#20351;&#29992;&#65292;&#36890;&#24120;&#36890;&#36807;&#31639;&#26415;&#30005;&#36335;&#32534;&#31243;&#33539;&#24335;&#23454;&#29616;&#12290;&#28982;&#32780;&#65292;&#27424;&#32422;&#26463;&#25110;&#36807;&#32422;&#26463;&#30340;&#30005;&#36335;&#21487;&#33021;&#23548;&#33268;&#38169;&#35823;&#12290; &#27424;&#32422;&#26463;&#30340;&#30005;&#36335;&#25351;&#30340;&#26159;&#32570;&#20047;&#24517;&#35201;&#32422;&#26463;&#30340;&#30005;&#36335;&#65292;&#23548;&#33268;&#30005;&#36335;&#20013;&#20986;&#29616;&#24847;&#22806;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#23548;&#33268;&#39564;&#35777;&#32773;&#25509;&#21463;&#38169;&#35823;&#35265;&#35777;&#12290; &#36807;&#32422;&#26463;&#30340;&#30005;&#36335;&#26159;&#25351;&#32422;&#26463;&#36807;&#24230;&#30340;&#30005;&#36335;&#65292;&#23548;&#33268;&#30005;&#36335;&#32570;&#20047;&#24517;&#35201;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#23548;&#33268;&#39564;&#35777;&#32773;&#25509;&#21463;&#27809;&#26377;&#35265;&#35777;&#65292;&#20351;&#30005;&#36335;&#27627;&#26080;&#24847;&#20041;&#12290; &#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#25214;&#20986;ZKP&#30005;&#36335;&#20013;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#38169;&#35823;&#12290; &#35813;&#26041;&#27861;&#28041;&#21450;&#23558;&#31639;&#26415;&#30005;&#36335;&#32422;&#26463;&#32534;&#30721;&#20026;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#65292;&#24182;&#36890;&#36807;&#20195;&#25968;&#35745;&#31639;&#22312;&#26377;&#38480;&#22495;&#19978;&#35299;&#20915;&#22810;&#39033;&#24335;&#26041;&#31243;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15676v1 Announce Type: cross  Abstract: ZKP systems have surged attention and held a fundamental role in contemporary cryptography. Zk-SNARK protocols dominate the ZKP usage, often implemented through arithmetic circuit programming paradigm. However, underconstrained or overconstrained circuits may lead to bugs. Underconstrained circuits refer to circuits that lack the necessary constraints, resulting in unexpected solutions in the circuit and causing the verifier to accept a bogus witness. Overconstrained circuits refer to circuits that are constrained excessively, resulting in the circuit lacking necessary solutions and causing the verifier to accept no witness, rendering the circuit meaningless. This paper introduces a novel approach for pinpointing two distinct types of bugs in ZKP circuits. The method involves encoding the arithmetic circuit constraints to polynomial equation systems and solving polynomial equation systems over a finite field by algebraic computation. T
&lt;/p&gt;</description></item><item><title>CodeTF&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;Transformer&#24211;&#65292;&#25552;&#20379;&#20102;&#21253;&#25324;&#39044;&#35757;&#32451;&#30340;Code LLM&#27169;&#22411;&#21644;&#26631;&#20934;&#21270;&#25509;&#21475;&#31561;&#19968;&#31995;&#21015;&#21151;&#33021;&#65292;&#21487;&#20197;&#36731;&#26494;&#22320;&#23558;&#26368;&#20808;&#36827;&#30340;Code LLM&#27169;&#22411;&#24212;&#29992;&#20110;&#21508;&#31181;&#36719;&#20214;&#24037;&#31243;&#20219;&#21153;&#20013;&#12290;</title><link>http://arxiv.org/abs/2306.00029</link><description>&lt;p&gt;
CodeTF&#65306;&#19968;&#31449;&#24335;Transformer&#24211;&#65292;&#23454;&#29616;&#26368;&#20808;&#36827;&#30340;&#20195;&#30721;LLM
&lt;/p&gt;
&lt;p&gt;
CodeTF: One-stop Transformer Library for State-of-the-art Code LLM. (arXiv:2306.00029v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00029
&lt;/p&gt;
&lt;p&gt;
CodeTF&#26159;&#19968;&#20010;&#24320;&#28304;&#30340;Transformer&#24211;&#65292;&#25552;&#20379;&#20102;&#21253;&#25324;&#39044;&#35757;&#32451;&#30340;Code LLM&#27169;&#22411;&#21644;&#26631;&#20934;&#21270;&#25509;&#21475;&#31561;&#19968;&#31995;&#21015;&#21151;&#33021;&#65292;&#21487;&#20197;&#36731;&#26494;&#22320;&#23558;&#26368;&#20808;&#36827;&#30340;Code LLM&#27169;&#22411;&#24212;&#29992;&#20110;&#21508;&#31181;&#36719;&#20214;&#24037;&#31243;&#20219;&#21153;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20195;&#30721;&#26234;&#33021;&#22312;&#36716;&#22411;&#29616;&#20195;&#36719;&#20214;&#24037;&#31243;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#12290;&#36817;&#24180;&#26469;&#65292;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#27169;&#22411;&#65292;&#23588;&#20854;&#26159;&#21033;&#29992;&#22823;&#37327;&#24320;&#28304;&#20195;&#30721;&#21644;&#32534;&#31243;&#35821;&#35328;&#29305;&#24449;&#30340;Transformer-based&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#24050;&#32463;&#23637;&#31034;&#20986;&#20102;&#23545;&#36825;&#20123;&#20219;&#21153;&#30340;&#26174;&#33879;&#28508;&#21147;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#27169;&#22411;&#30340;&#24320;&#21457;&#21644;&#37096;&#32626;&#36890;&#24120;&#38656;&#35201;&#23545;&#26426;&#22120;&#23398;&#20064;&#21644;&#36719;&#20214;&#24037;&#31243;&#30340;&#19987;&#19994;&#30693;&#35782;&#65292;&#20174;&#32780;&#20026;&#27169;&#22411;&#24212;&#29992;&#24102;&#26469;&#20102;&#19968;&#23450;&#30340;&#38556;&#30861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;CodeTF&#65292;&#19968;&#20010;&#22522;&#20110;Transformer&#30340;&#24320;&#25918;&#28304;&#20195;&#30721;&#24211;&#65292;&#29992;&#20110;&#23454;&#29616;&#26368;&#20808;&#36827;&#30340;Code LLM&#21644;&#20195;&#30721;&#26234;&#33021;&#12290;&#25105;&#20204;&#37319;&#29992;&#27169;&#22359;&#21270;&#35774;&#35745;&#21644;&#21487;&#25193;&#23637;&#26694;&#26550;&#30340;&#21407;&#21017;&#65292;&#35774;&#35745;CodeTF&#24182;&#25552;&#20379;&#32479;&#19968;&#25509;&#21475;&#65292;&#20197;&#20415;&#24555;&#36895;&#35775;&#38382;&#21644;&#24320;&#21457;&#19981;&#21516;&#31867;&#22411;&#30340;&#27169;&#22411;&#12289;&#25968;&#25454;&#38598;&#21644;&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#24211;&#25903;&#25345;&#39044;&#35757;&#32451;&#30340;Code LLM&#27169;&#22411;&#21644;&#27969;&#34892;&#30340;&#20195;&#30721;&#22522;&#20934;&#27979;&#35797;&#65292;&#21253;&#25324;&#26631;&#20934;&#21270;&#25509;&#21475;&#20197;&#26377;&#25928;&#22320;&#35757;&#32451;&#21644;&#26381;&#21153;&#20195;&#30721;LLMs&#65292;&#24182;&#25903;&#25345;&#21452;GPU&#35757;&#32451;&#21644;&#25512;&#29702;&#12290;&#20351;&#29992;CodeTF&#65292;&#29992;&#25143;&#21487;&#20197;&#36731;&#26494;&#23558;&#26368;&#20808;&#36827;&#30340;Code LLM&#27169;&#22411;&#24212;&#29992;&#20110;&#21508;&#31181;&#36719;&#20214;&#24037;&#31243;&#20219;&#21153;&#20013;&#65292;&#20943;&#23569;&#35757;&#32451;&#24037;&#20316;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Code intelligence plays a key role in transforming modern software engineering. Recently, deep learning-based models, especially Transformer-based large language models (LLMs), have demonstrated remarkable potential in tackling these tasks by leveraging massive open-source code data and programming language features. However, the development and deployment of such models often require expertise in both machine learning and software engineering, creating a barrier for the model adoption. In this paper, we present CodeTF, an open-source Transformer-based library for state-of-the-art Code LLMs and code intelligence. Following the principles of modular design and extensible framework, we design CodeTF with a unified interface to enable rapid access and development across different types of models, datasets and tasks. Our library supports a collection of pretrained Code LLM models and popular code benchmarks, including a standardized interface to train and serve code LLMs efficiently, and d
&lt;/p&gt;</description></item></channel></rss>