<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.05024</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#26159;&#21542;&#26377;&#21161;&#20110;&#26356;&#22823;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05024
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#25968;&#25454;&#38598;&#22312;&#24403;&#20195;&#25968;&#25454;&#39537;&#21160;&#30740;&#31350;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#23427;&#20204;&#36890;&#36807;&#20419;&#36827;&#26032;&#27169;&#24335;&#21644;&#29616;&#35937;&#30340;&#21457;&#29616;&#65292;&#25512;&#21160;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;&#36825;&#31181;&#23545;&#23454;&#35777;&#30740;&#31350;&#30340;&#19981;&#26029;&#38656;&#27714;&#24341;&#21457;&#20102;&#20851;&#20110;&#22914;&#20309;&#22312;&#30740;&#31350;&#39033;&#30446;&#20013;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#25968;&#25454;&#20197;&#20419;&#36827;&#31185;&#23398;&#36827;&#27493;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#37325;&#32452;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#21019;&#26032;&#24615;&#22320;&#32452;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#21253;&#25324;&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#65292;&#21487;&#20197;&#23548;&#33268;&#39640;&#24433;&#21709;&#30340;&#21457;&#29616;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36229;&#36807;30,000&#31687;&#25991;&#31456;&#20013;&#20351;&#29992;&#20102;&#36229;&#36807;6,000&#20010;&#25968;&#25454;&#38598;&#30340;&#31038;&#20250;&#31185;&#23398;&#25968;&#25454;&#24211;ICPSR&#20013;&#36825;&#31181;&#38750;&#20856;&#22411;&#25968;&#25454;&#32452;&#21512;&#30340;&#31185;&#23398;&#25104;&#26524;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22235;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#32452;&#21512;&#25968;&#25454;&#38598;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#19981;&#24120;&#35265;&#30340;&#32452;&#21512;&#65292;&#23545;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#21521;&#19968;&#33324;&#20844;&#20247;&#20256;&#25773;&#65289;&#37117;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera
&lt;/p&gt;</description></item><item><title>&#26412;&#35843;&#26597;&#32508;&#21512;&#27010;&#36848;&#20102;&#20851;&#20110;&#20174;&#24102;&#26377;&#24322;&#36136;&#24615;&#30340;&#22270;&#20013;&#23398;&#20064;&#30340;&#29616;&#26377;&#30740;&#31350;&#65292;&#24182;&#26681;&#25454;&#23398;&#20064;&#31574;&#30053;&#12289;&#27169;&#22411;&#26550;&#26500;&#21644;&#23454;&#38469;&#24212;&#29992;&#31561;&#26041;&#38754;&#23545;&#26041;&#27861;&#36827;&#34892;&#20102;&#20998;&#31867;&#12290;&#21516;&#26102;&#35752;&#35770;&#20102;&#29616;&#26377;&#30740;&#31350;&#30340;&#20027;&#35201;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;</title><link>http://arxiv.org/abs/2401.09769</link><description>&lt;p&gt;
&#36208;&#21521;&#24322;&#36136;&#22270;&#23398;&#20064;&#65306;&#36827;&#23637;&#19982;&#26410;&#26469;
&lt;/p&gt;
&lt;p&gt;
Towards Learning from Graphs with Heterophily: Progress and Future. (arXiv:2401.09769v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09769
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35843;&#26597;&#32508;&#21512;&#27010;&#36848;&#20102;&#20851;&#20110;&#20174;&#24102;&#26377;&#24322;&#36136;&#24615;&#30340;&#22270;&#20013;&#23398;&#20064;&#30340;&#29616;&#26377;&#30740;&#31350;&#65292;&#24182;&#26681;&#25454;&#23398;&#20064;&#31574;&#30053;&#12289;&#27169;&#22411;&#26550;&#26500;&#21644;&#23454;&#38469;&#24212;&#29992;&#31561;&#26041;&#38754;&#23545;&#26041;&#27861;&#36827;&#34892;&#20102;&#20998;&#31867;&#12290;&#21516;&#26102;&#35752;&#35770;&#20102;&#29616;&#26377;&#30740;&#31350;&#30340;&#20027;&#35201;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#26159;&#29992;&#26469;&#27169;&#25311;&#29616;&#23454;&#19990;&#30028;&#23454;&#20307;&#20043;&#38388;&#22797;&#26434;&#20851;&#31995;&#30340;&#32467;&#26500;&#21270;&#25968;&#25454;&#12290;&#26368;&#36817;&#65292;&#24322;&#36136;&#22270;&#65292;&#20854;&#20013;&#36830;&#25509;&#30340;&#33410;&#28857;&#24448;&#24448;&#20855;&#26377;&#19981;&#21516;&#30340;&#26631;&#31614;&#25110;&#19981;&#21516;&#30340;&#29305;&#24449;&#65292;&#24341;&#36215;&#20102;&#24191;&#27867;&#20851;&#27880;&#24182;&#25214;&#21040;&#20102;&#35768;&#22810;&#24212;&#29992;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#20154;&#20204;&#20063;&#22312;&#19981;&#26029;&#21162;&#21147;&#25512;&#36827;&#20174;&#24322;&#36136;&#22270;&#20013;&#23398;&#20064;&#12290;&#34429;&#28982;&#26377;&#20851;&#35813;&#20027;&#39064;&#30340;&#35843;&#26597;&#23384;&#22312;&#65292;&#20294;&#23427;&#20204;&#21482;&#20851;&#27880;&#20110;&#24322;&#36136;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#65292;&#32780;&#24573;&#30053;&#20102;&#24322;&#36136;&#22270;&#23398;&#20064;&#30340;&#20854;&#20182;&#23376;&#20027;&#39064;&#12290;&#22312;&#26412;&#35843;&#26597;&#20013;&#65292;&#25105;&#20204;&#20840;&#38754;&#22238;&#39038;&#20102;&#20851;&#20110;&#20174;&#24102;&#26377;&#24322;&#36136;&#24615;&#30340;&#22270;&#20013;&#23398;&#20064;&#30340;&#29616;&#26377;&#30740;&#31350;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25910;&#38598;&#20102;180&#22810;&#31687;&#35770;&#25991;&#65292;&#20171;&#32461;&#20102;&#35813;&#39046;&#22495;&#30340;&#21457;&#23637;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#26681;&#25454;&#23618;&#27425;&#20998;&#31867;&#27861;&#23545;&#29616;&#26377;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#31867;&#65292;&#21253;&#25324;&#23398;&#20064;&#31574;&#30053;&#12289;&#27169;&#22411;&#26550;&#26500;&#21644;&#23454;&#38469;&#24212;&#29992;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#29616;&#26377;&#30740;&#31350;&#30340;&#20027;&#35201;&#25361;&#25112;&#65292;&#24182;&#31361;&#20986;&#20102;&#26410;&#26469;&#30740;&#31350;&#30340;&#28508;&#22312;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graphs are structured data that models complex relations between real-world entities. Heterophilous graphs, where linked nodes are prone to be with different labels or dissimilar features, have recently attracted significant attention and found many applications. Meanwhile, increasing efforts have been made to advance learning from heterophilous graphs. Although there exist surveys on the relevant topic, they focus on heterophilous GNNs, which are only sub-topics of heterophilous graph learning. In this survey, we comprehensively overview existing works on learning from graphs with heterophily.First, we collect over 180 publications and introduce the development of this field. Then, we systematically categorize existing methods based on a hierarchical taxonomy including learning strategies, model architectures and practical applications. Finally, we discuss the primary challenges of existing studies and highlight promising avenues for future research.More publication details and corres
&lt;/p&gt;</description></item></channel></rss>