<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Frechet&#32479;&#35745;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#20013;&#26816;&#27979;&#21464;&#28857;&#12290;&#36890;&#36807;&#23558;&#28857;&#36807;&#31243;&#20998;&#25104;&#31383;&#21475;&#65292;&#24182;&#21033;&#29992;&#26680;&#30697;&#38453;&#26469;&#37325;&#26500;&#26377;&#31526;&#21495;&#30340;&#25289;&#26222;&#25289;&#26031;&#30697;&#38453;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#20934;&#30830;&#22320;&#26816;&#27979;&#21644;&#25551;&#36848;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#22240;&#26524;&#32467;&#26500;&#20013;&#30340;&#21464;&#21270;&#65292;&#20855;&#26377;&#28508;&#22312;&#30340;&#37329;&#34701;&#21644;&#31070;&#32463;&#31185;&#23398;&#31561;&#39046;&#22495;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2308.06769</link><description>&lt;p&gt;
&#22522;&#20110;Frechet&#32479;&#35745;&#30340;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#20013;&#30340;&#21464;&#28857;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Fr\'echet Statistics Based Change Point Detection in Multivariate Hawkes Process. (arXiv:2308.06769v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06769
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Frechet&#32479;&#35745;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#20013;&#26816;&#27979;&#21464;&#28857;&#12290;&#36890;&#36807;&#23558;&#28857;&#36807;&#31243;&#20998;&#25104;&#31383;&#21475;&#65292;&#24182;&#21033;&#29992;&#26680;&#30697;&#38453;&#26469;&#37325;&#26500;&#26377;&#31526;&#21495;&#30340;&#25289;&#26222;&#25289;&#26031;&#30697;&#38453;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#20934;&#30830;&#22320;&#26816;&#27979;&#21644;&#25551;&#36848;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#22240;&#26524;&#32467;&#26500;&#20013;&#30340;&#21464;&#21270;&#65292;&#20855;&#26377;&#28508;&#22312;&#30340;&#37329;&#34701;&#21644;&#31070;&#32463;&#31185;&#23398;&#31561;&#39046;&#22495;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;Frechet&#32479;&#35745;&#26041;&#27861;&#23545;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#20013;&#30340;&#22240;&#26524;&#32593;&#32476;&#36827;&#34892;&#21464;&#28857;&#26816;&#27979;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;&#28857;&#36807;&#31243;&#20998;&#25104;&#37325;&#21472;&#30340;&#31383;&#21475;&#65292;&#22312;&#27599;&#20010;&#31383;&#21475;&#20013;&#20272;&#35745;&#26680;&#30697;&#38453;&#65292;&#24182;&#36890;&#36807;&#23558;&#26680;&#30697;&#38453;&#35270;&#20026;&#22240;&#26524;&#32593;&#32476;&#30340;&#37051;&#25509;&#30697;&#38453;&#26469;&#37325;&#26500;&#26377;&#31526;&#21495;&#30340;&#25289;&#26222;&#25289;&#26031;&#30697;&#38453;&#12290;&#36890;&#36807;&#22312;&#27169;&#25311;&#21644;&#30495;&#23454;&#21152;&#23494;&#36135;&#24065;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#20934;&#30830;&#22320;&#26816;&#27979;&#21644;&#25551;&#36848;&#22810;&#21464;&#37327;Hawkes&#36807;&#31243;&#22240;&#26524;&#32467;&#26500;&#20013;&#30340;&#21464;&#21270;&#65292;&#24182;&#22312;&#37329;&#34701;&#21644;&#31070;&#32463;&#31185;&#23398;&#31561;&#39046;&#22495;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#26159;&#23545;&#28857;&#36807;&#31243;&#35774;&#32622;&#20013;Frechet&#32479;&#35745;&#20043;&#21069;&#24037;&#20316;&#30340;&#25193;&#23637;&#65292;&#24182;&#23545;&#22810;&#21464;&#37327;&#28857;&#36807;&#31243;&#30340;&#21464;&#28857;&#26816;&#27979;&#39046;&#22495;&#20570;&#20986;&#20102;&#37325;&#35201;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a new approach for change point detection in causal networks of multivariate Hawkes processes using Frechet statistics. Our method splits the point process into overlapping windows, estimates kernel matrices in each window, and reconstructs the signed Laplacians by treating the kernel matrices as the adjacency matrices of the causal network. We demonstrate the effectiveness of our method through experiments on both simulated and real-world cryptocurrency datasets. Our results show that our method is capable of accurately detecting and characterizing changes in the causal structure of multivariate Hawkes processes, and may have potential applications in fields such as finance and neuroscience. The proposed method is an extension of previous work on Frechet statistics in point process settings and represents an important contribution to the field of change point detection in multivariate point processes.
&lt;/p&gt;</description></item></channel></rss>