<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20445;&#25252;&#38544;&#31169;&#30340;&#26412;&#22320;&#20998;&#24067;&#22810;&#32593;&#32476;&#31038;&#21306;&#26816;&#27979;&#26041;&#27861;&#65292;&#21033;&#29992;&#38544;&#31169;&#20445;&#25252;&#26469;&#36827;&#34892;&#20849;&#35782;&#31038;&#21306;&#26816;&#27979;&#21644;&#20272;&#35745;&#12290;&#37319;&#29992;&#38543;&#26426;&#21709;&#24212;&#26426;&#21046;&#23545;&#32593;&#32476;&#36793;&#36827;&#34892;&#25200;&#21160;&#65292;&#36890;&#36807;&#38544;&#31169;&#20445;&#25252;&#20998;&#24067;&#24335;&#35889;&#32858;&#31867;&#31639;&#27861;&#22312;&#25200;&#21160;&#37051;&#25509;&#30697;&#38453;&#19978;&#25191;&#34892;&#65292;&#20197;&#38450;&#27490;&#31038;&#21306;&#20043;&#38388;&#30340;&#25269;&#28040;&#12290;&#21516;&#26102;&#65292;&#24320;&#21457;&#20102;&#20004;&#27493;&#20559;&#24046;&#35843;&#25972;&#36807;&#31243;&#26469;&#28040;&#38500;&#25200;&#21160;&#21644;&#32593;&#32476;&#30697;&#38453;&#24102;&#26469;&#30340;&#20559;&#24046;&#12290;</title><link>http://arxiv.org/abs/2306.15709</link><description>&lt;p&gt;
&#20445;&#25252;&#38544;&#31169;&#30340;&#26412;&#22320;&#20998;&#24067;&#22810;&#32593;&#32476;&#31038;&#21306;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Privacy-Preserving Community Detection for Locally Distributed Multiple Networks. (arXiv:2306.15709v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15709
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20445;&#25252;&#38544;&#31169;&#30340;&#26412;&#22320;&#20998;&#24067;&#22810;&#32593;&#32476;&#31038;&#21306;&#26816;&#27979;&#26041;&#27861;&#65292;&#21033;&#29992;&#38544;&#31169;&#20445;&#25252;&#26469;&#36827;&#34892;&#20849;&#35782;&#31038;&#21306;&#26816;&#27979;&#21644;&#20272;&#35745;&#12290;&#37319;&#29992;&#38543;&#26426;&#21709;&#24212;&#26426;&#21046;&#23545;&#32593;&#32476;&#36793;&#36827;&#34892;&#25200;&#21160;&#65292;&#36890;&#36807;&#38544;&#31169;&#20445;&#25252;&#20998;&#24067;&#24335;&#35889;&#32858;&#31867;&#31639;&#27861;&#22312;&#25200;&#21160;&#37051;&#25509;&#30697;&#38453;&#19978;&#25191;&#34892;&#65292;&#20197;&#38450;&#27490;&#31038;&#21306;&#20043;&#38388;&#30340;&#25269;&#28040;&#12290;&#21516;&#26102;&#65292;&#24320;&#21457;&#20102;&#20004;&#27493;&#20559;&#24046;&#35843;&#25972;&#36807;&#31243;&#26469;&#28040;&#38500;&#25200;&#21160;&#21644;&#32593;&#32476;&#30697;&#38453;&#24102;&#26469;&#30340;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#22810;&#23618;&#32593;&#32476;&#30001;&#20110;&#38544;&#31169;&#12289;&#25152;&#26377;&#26435;&#21644;&#36890;&#20449;&#25104;&#26412;&#30340;&#21407;&#22240;&#65292;&#24120;&#24120;&#20197;&#26412;&#22320;&#21644;&#20998;&#24067;&#24335;&#30340;&#26041;&#24335;&#23384;&#20648;&#21644;&#20998;&#26512;&#12290;&#20851;&#20110;&#22522;&#20110;&#36825;&#20123;&#25968;&#25454;&#30340;&#27169;&#22411;&#21270;&#32479;&#35745;&#26041;&#27861;&#29992;&#20110;&#31038;&#21306;&#26816;&#27979;&#30340;&#25991;&#29486;&#20173;&#28982;&#26377;&#38480;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22522;&#20110;&#26412;&#22320;&#23384;&#20648;&#21644;&#35745;&#31639;&#30340;&#32593;&#32476;&#25968;&#25454;&#30340;&#22810;&#23618;&#38543;&#26426;&#22359;&#27169;&#22411;&#20013;&#30340;&#20849;&#35782;&#31038;&#21306;&#26816;&#27979;&#21644;&#20272;&#35745;&#65292;&#24182;&#37319;&#29992;&#38544;&#31169;&#20445;&#25252;&#12290;&#24320;&#21457;&#20102;&#19968;&#31181;&#21517;&#20026;&#38544;&#31169;&#20445;&#25252;&#20998;&#24067;&#24335;&#35889;&#32858;&#31867;&#65288;ppDSC&#65289;&#30340;&#26032;&#31639;&#27861;&#12290;&#20026;&#20102;&#20445;&#25252;&#36793;&#30340;&#38544;&#31169;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#38543;&#26426;&#21709;&#24212;&#65288;RR&#65289;&#26426;&#21046;&#26469;&#25200;&#21160;&#32593;&#32476;&#36793;&#65292;&#35813;&#26426;&#21046;&#28385;&#36275;&#24046;&#20998;&#38544;&#31169;&#30340;&#24378;&#27010;&#24565;&#12290;ppDSC&#31639;&#27861;&#22312;&#24179;&#26041;&#30340;RR&#25200;&#21160;&#37051;&#25509;&#30697;&#38453;&#19978;&#25191;&#34892;&#65292;&#20197;&#38450;&#27490;&#19981;&#21516;&#23618;&#20043;&#38388;&#30340;&#31038;&#21306;&#30456;&#20114;&#25269;&#28040;&#12290;&#20026;&#20102;&#28040;&#38500;RR&#21644;&#24179;&#26041;&#32593;&#32476;&#30697;&#38453;&#25152;&#24102;&#26469;&#30340;&#20559;&#24046;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20004;&#27493;&#20559;&#24046;&#35843;&#25972;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
Modern multi-layer networks are commonly stored and analyzed in a local and distributed fashion because of the privacy, ownership, and communication costs. The literature on the model-based statistical methods for community detection based on these data is still limited. This paper proposes a new method for consensus community detection and estimation in a multi-layer stochastic block model using locally stored and computed network data with privacy protection. A novel algorithm named privacy-preserving Distributed Spectral Clustering (ppDSC) is developed. To preserve the edges' privacy, we adopt the randomized response (RR) mechanism to perturb the network edges, which satisfies the strong notion of differential privacy. The ppDSC algorithm is performed on the squared RR-perturbed adjacency matrices to prevent possible cancellation of communities among different layers. To remove the bias incurred by RR and the squared network matrices, we develop a two-step bias-adjustment procedure.
&lt;/p&gt;</description></item></channel></rss>