<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;</title><link>https://arxiv.org/abs/2403.18166</link><description>&lt;p&gt;
&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#20013;&#30340;Vertiport&#39044;&#35746;&#65306;&#22522;&#20110;&#25293;&#21334;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35745;&#26410;&#26469;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#65288;AAM&#65289;&#30340;&#23835;&#36215;&#23558;&#25104;&#20026;&#19968;&#20010;&#25968;&#21313;&#20159;&#32654;&#20803;&#30340;&#20135;&#19994;&#12290;&#24066;&#22330;&#26426;&#21046;&#34987;&#35748;&#20026;&#26159;AAM&#36816;&#33829;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20854;&#20013;&#21253;&#25324;&#20855;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#24322;&#26500;&#36816;&#33829;&#21830;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#35774;&#35745;&#19968;&#31181;&#26426;&#21046;&#26469;&#21327;&#35843;&#30001;&#22810;&#20010;&#20855;&#26377;&#19982;&#20854;&#26426;&#32676;&#20851;&#32852;&#30340;&#24322;&#26500;&#20272;&#20540;&#30340;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#24378;&#21046;&#25191;&#34892;vertiports&#30340;&#21040;&#36798;&#12289;&#31163;&#24320;&#21644;&#20572;&#36710;&#32422;&#26463;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26368;&#22823;&#21270;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#24230;&#37327;&#26631;&#20934;&#65292;&#20174;&#32780;&#21253;&#25324;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#39640;&#20102;&#35774;&#35745;&#36825;&#19968;&#26426;&#21046;&#30340;&#35745;&#31639;&#21487;&#22788;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18166v1 Announce Type: cross  Abstract: The rise of advanced air mobility (AAM) is expected to become a multibillion-dollar industry in the near future. Market-based mechanisms are touted to be an integral part of AAM operations, which comprise heterogeneous operators with private valuations. In this work, we study the problem of designing a mechanism to coordinate the movement of electric vertical take-off and landing (eVTOL) aircraft, operated by multiple operators each having heterogeneous valuations associated with their fleet, between vertiports, while enforcing the arrival, departure, and parking constraints at vertiports. Particularly, we propose an incentive-compatible and individually rational vertiport reservation mechanism that maximizes a social welfare metric, which encapsulates the objective of maximizing the overall valuations of all operators while minimizing the congestion at vertiports. Additionally, we improve the computational tractability of designing th
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#25511;&#21046;&#38382;&#39064;&#20013;&#30340;&#35266;&#27979;&#31354;&#38388;&#21040;&#31616;&#21270;&#25511;&#21046;&#30456;&#20851;&#21464;&#37327;&#31354;&#38388;&#30340;&#32534;&#30721;&#22120;&#23398;&#20064;&#65292;AC-State&#26041;&#27861;&#26159;&#19968;&#20010;&#22810;&#27493;&#21453;&#21521;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.11940</link><description>&lt;p&gt;
&#22810;&#27493;&#21453;&#21521;&#19981;&#26159;&#20320;&#25152;&#38656;&#35201;&#30340;
&lt;/p&gt;
&lt;p&gt;
Multistep Inverse Is Not All You Need
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11940
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#25511;&#21046;&#38382;&#39064;&#20013;&#30340;&#35266;&#27979;&#31354;&#38388;&#21040;&#31616;&#21270;&#25511;&#21046;&#30456;&#20851;&#21464;&#37327;&#31354;&#38388;&#30340;&#32534;&#30721;&#22120;&#23398;&#20064;&#65292;AC-State&#26041;&#27861;&#26159;&#19968;&#20010;&#22810;&#27493;&#21453;&#21521;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#30495;&#23454;&#19990;&#30028;&#30340;&#25511;&#21046;&#35774;&#32622;&#20013;&#65292;&#35266;&#27979;&#31354;&#38388;&#36890;&#24120;&#26159;&#19981;&#24517;&#35201;&#30340;&#39640;&#32500;&#19988;&#21463;&#21040;&#26102;&#38388;&#30456;&#20851;&#22122;&#22768;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#31995;&#32479;&#30340;&#21487;&#25511;&#21160;&#24577;&#36890;&#24120;&#36828;&#27604;&#21407;&#22987;&#35266;&#27979;&#25968;&#25454;&#30340;&#21160;&#24577;&#31616;&#21333;&#12290;&#22240;&#27492;&#65292;&#23398;&#20064;&#19968;&#20010;&#32534;&#30721;&#22120;&#23558;&#35266;&#27979;&#31354;&#38388;&#26144;&#23556;&#21040;&#19968;&#20010;&#21253;&#21547;&#25511;&#21046;&#30456;&#20851;&#21464;&#37327;&#30340;&#31616;&#21270;&#31354;&#38388;&#26159;&#21487;&#21462;&#30340;&#12290;&#26412;&#25991;&#32771;&#34385;&#20102;&#30001;Efroni&#31561;&#20154;&#65288;2022&#24180;&#65289;&#39318;&#27425;&#25552;&#20986;&#30340;Ex-BMDP&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#23558;&#35266;&#27979;&#21487;&#20197;&#20998;&#35299;&#20026;&#20381;&#36182;&#20110;&#21160;&#20316;&#30340;&#28508;&#22312;&#29366;&#24577;&#21644;&#29420;&#31435;&#20110;&#21160;&#20316;&#30340;&#26102;&#38388;&#30456;&#20851;&#22122;&#22768;&#65292;&#24182;&#24418;&#24335;&#21270;&#20102;&#33021;&#22815;&#35299;&#20915;&#25511;&#21046;&#38382;&#39064;&#30340;&#22330;&#26223;&#12290;Lamb&#31561;&#20154;&#65288;2022&#24180;&#65289;&#25552;&#20986;&#20102;&#8220;AC-State&#8221;&#26041;&#27861;&#65292;&#29992;&#20110;&#23398;&#20064;&#19968;&#20010;&#32534;&#30721;&#22120;&#65292;&#20174;&#36825;&#20123;&#38382;&#39064;&#20013;&#30340;&#35266;&#27979;&#20013;&#25552;&#21462;&#21253;&#21547;&#23436;&#25972;&#20381;&#36182;&#20110;&#21160;&#20316;&#30340;&#28508;&#22312;&#29366;&#24577;&#34920;&#31034;&#12290;AC-State&#26159;&#19968;&#20010;&#22810;&#27493;&#21453;&#21521;&#26041;&#27861;&#65292;&#23427;&#20351;&#29992;&#36335;&#24452;&#20013;&#31532;&#19968;&#20010;&#21644;&#26368;&#21518;&#19968;&#20010;&#29366;&#24577;&#30340;&#32534;&#30721;&#26469;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11940v1 Announce Type: new  Abstract: In real-world control settings, the observation space is often unnecessarily high-dimensional and subject to time-correlated noise. However, the controllable dynamics of the system are often far simpler than the dynamics of the raw observations. It is therefore desirable to learn an encoder to map the observation space to a simpler space of control-relevant variables. In this work, we consider the Ex-BMDP model, first proposed by Efroni et al. (2022), which formalizes control problems where observations can be factorized into an action-dependent latent state which evolves deterministically, and action-independent time-correlated noise. Lamb et al. (2022) proposes the "AC-State" method for learning an encoder to extract a complete action-dependent latent state representation from the observations in such problems. AC-State is a multistep-inverse method, in that it uses the encoding of the the first and last state in a path to predict the 
&lt;/p&gt;</description></item><item><title>DEEP-IoT&#36890;&#36807;&#8220;&#26356;&#22810;&#30417;&#21548;&#65292;&#26356;&#23569;&#20256;&#36755;&#8221;&#30340;&#31574;&#30053;&#65292;&#25361;&#25112;&#21644;&#36716;&#21464;&#20102;&#20256;&#32479;&#30340;&#29289;&#32852;&#32593;&#36890;&#20449;&#27169;&#22411;&#65292;&#22823;&#24133;&#38477;&#20302;&#33021;&#32791;&#24182;&#25552;&#39640;&#35774;&#22791;&#23551;&#21629;&#12290;</title><link>https://arxiv.org/abs/2403.00321</link><description>&lt;p&gt;
DEEP-IoT: &#19979;&#34892;&#22686;&#24378;&#22411;&#39640;&#25928;&#33021;&#29289;&#32852;&#32593;
&lt;/p&gt;
&lt;p&gt;
DEEP-IoT: Downlink-Enhanced Efficient-Power Internet of Things
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00321
&lt;/p&gt;
&lt;p&gt;
DEEP-IoT&#36890;&#36807;&#8220;&#26356;&#22810;&#30417;&#21548;&#65292;&#26356;&#23569;&#20256;&#36755;&#8221;&#30340;&#31574;&#30053;&#65292;&#25361;&#25112;&#21644;&#36716;&#21464;&#20102;&#20256;&#32479;&#30340;&#29289;&#32852;&#32593;&#36890;&#20449;&#27169;&#22411;&#65292;&#22823;&#24133;&#38477;&#20302;&#33021;&#32791;&#24182;&#25552;&#39640;&#35774;&#22791;&#23551;&#21629;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;DEEP-IoT&#65292;&#36825;&#26159;&#19968;&#31181;&#20855;&#26377;&#38761;&#21629;&#24847;&#20041;&#30340;&#36890;&#20449;&#33539;&#20363;&#65292;&#26088;&#22312;&#37325;&#26032;&#23450;&#20041;&#29289;&#32852;&#32593;&#35774;&#22791;&#20043;&#38388;&#30340;&#36890;&#20449;&#26041;&#24335;&#12290;&#36890;&#36807;&#24320;&#21019;&#24615;&#30340;&#8220;&#26356;&#22810;&#30417;&#21548;&#65292;&#26356;&#23569;&#20256;&#36755;&#8221;&#30340;&#31574;&#30053;&#65292;DEEP-IoT&#25361;&#25112;&#21644;&#36716;&#21464;&#20102;&#20256;&#32479;&#30340;&#21457;&#36865;&#26041;&#65288;&#29289;&#32852;&#32593;&#35774;&#22791;&#65289;&#20026;&#20013;&#24515;&#30340;&#36890;&#20449;&#27169;&#22411;&#65292;&#23558;&#25509;&#25910;&#26041;&#65288;&#25509;&#20837;&#28857;&#65289;&#20316;&#20026;&#20851;&#38190;&#35282;&#33394;&#65292;&#20174;&#32780;&#38477;&#20302;&#33021;&#32791;&#24182;&#24310;&#38271;&#35774;&#22791;&#23551;&#21629;&#12290;&#25105;&#20204;&#19981;&#20165;&#27010;&#24565;&#21270;&#20102;DEEP-IoT&#65292;&#36824;&#36890;&#36807;&#22312;&#31364;&#24102;&#31995;&#32479;&#20013;&#38598;&#25104;&#28145;&#24230;&#23398;&#20064;&#22686;&#24378;&#30340;&#21453;&#39304;&#20449;&#36947;&#32534;&#30721;&#26469;&#23454;&#29616;&#23427;&#12290;&#27169;&#25311;&#32467;&#26524;&#26174;&#31034;&#65292;IoT&#21333;&#20803;&#30340;&#36816;&#34892;&#23551;&#21629;&#26174;&#33879;&#25552;&#39640;&#65292;&#27604;&#20351;&#29992;Turbo&#21644;Polar&#32534;&#30721;&#30340;&#20256;&#32479;&#31995;&#32479;&#25552;&#39640;&#20102;&#26368;&#22810;52.71%&#12290;&#36825;&#19968;&#36827;&#23637;&#26631;&#24535;&#30528;&#19968;&#31181;&#21464;&#38761;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00321v1 Announce Type: cross  Abstract: At the heart of the Internet of Things (IoT) -- a domain witnessing explosive growth -- the imperative for energy efficiency and the extension of device lifespans has never been more pressing. This paper presents DEEP-IoT, a revolutionary communication paradigm poised to redefine how IoT devices communicate. Through a pioneering "listen more, transmit less" strategy, DEEP-IoT challenges and transforms the traditional transmitter (IoT devices)-centric communication model to one where the receiver (the access point) play a pivotal role, thereby cutting down energy use and boosting device longevity. We not only conceptualize DEEP-IoT but also actualize it by integrating deep learning-enhanced feedback channel codes within a narrow-band system. Simulation results show a significant enhancement in the operational lifespan of IoT cells -- surpassing traditional systems using Turbo and Polar codes by up to 52.71%. This leap signifies a paradi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26694;&#26550;&#26469;&#35299;&#20915;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#35745;&#31639;&#25104;&#26412;&#39640;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#35299;&#20915;&#38543;&#26426;&#21160;&#24577;&#35268;&#21010;&#26041;&#31243;&#65292;&#29983;&#25104;&#30340;&#25511;&#21046;&#22120;&#33021;&#22815;&#20027;&#21160;&#23398;&#20064;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#30830;&#20445;&#23433;&#20840;&#24615;&#21644;&#23454;&#26102;&#23398;&#20064;&#12290;</title><link>http://arxiv.org/abs/2309.10831</link><description>&lt;p&gt;
&#27963;&#21160;&#23398;&#20064;&#24378;&#21270;&#23398;&#20064;&#65306;&#19968;&#31181;&#38543;&#26426;&#26368;&#20248;&#25511;&#21046;&#26041;&#27861;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Actively Learning Reinforcement Learning: A Stochastic Optimal Control Approach. (arXiv:2309.10831v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10831
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26694;&#26550;&#26469;&#35299;&#20915;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#35745;&#31639;&#25104;&#26412;&#39640;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#35299;&#20915;&#38543;&#26426;&#21160;&#24577;&#35268;&#21010;&#26041;&#31243;&#65292;&#29983;&#25104;&#30340;&#25511;&#21046;&#22120;&#33021;&#22815;&#20027;&#21160;&#23398;&#20064;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#30830;&#20445;&#23433;&#20840;&#24615;&#21644;&#23454;&#26102;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26694;&#26550;&#26469;&#24212;&#23545;&#20004;&#20010;&#38382;&#39064;&#65306;&#65288;i&#65289;&#24378;&#21270;&#23398;&#20064;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#26041;&#38754;&#30340;&#33030;&#24369;&#24615;&#65292;&#22240;&#20026;&#21463;&#25511;&#23454;&#39564;&#23460;/&#20223;&#30495;&#21644;&#23454;&#38469;&#26465;&#20214;&#20043;&#38388;&#30340;&#19981;&#21305;&#37197;&#65292;&#20197;&#21450;&#65288;ii&#65289;&#38543;&#26426;&#26368;&#20248;&#25511;&#21046;&#30340;&#35745;&#31639;&#25104;&#26412;&#36807;&#39640;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#24378;&#21270;&#23398;&#20064;&#26469;&#35299;&#20915;&#38543;&#26426;&#21160;&#24577;&#35268;&#21010;&#26041;&#31243;&#26469;&#35299;&#20915;&#36825;&#20004;&#20010;&#38382;&#39064;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#24378;&#21270;&#23398;&#20064;&#25511;&#21046;&#22120;&#23545;&#20110;&#20960;&#31181;&#31867;&#22411;&#30340;&#32422;&#26463;&#26465;&#20214;&#26159;&#23433;&#20840;&#30340;&#65292;&#24182;&#19988;&#23427;&#21487;&#20197;&#20027;&#21160;&#23398;&#20064;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#12290;&#19982;&#25506;&#32034;&#21644;&#21033;&#29992;&#19981;&#21516;&#65292;&#25506;&#27979;&#21644;&#23433;&#20840;&#24615;&#30001;&#25511;&#21046;&#22120;&#33258;&#36523;&#33258;&#21160;&#23454;&#29616;&#65292;&#23454;&#29616;&#20102;&#23454;&#26102;&#23398;&#20064;&#12290;&#19968;&#20010;&#20223;&#30495;&#31034;&#20363;&#35777;&#26126;&#20102;&#25152;&#25552;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we provide framework to cope with two problems: (i) the fragility of reinforcement learning due to modeling uncertainties because of the mismatch between controlled laboratory/simulation and real-world conditions and (ii) the prohibitive computational cost of stochastic optimal control. We approach both problems by using reinforcement learning to solve the stochastic dynamic programming equation. The resulting reinforcement learning controller is safe with respect to several types of constraints constraints and it can actively learn about the modeling uncertainties. Unlike exploration and exploitation, probing and safety are employed automatically by the controller itself, resulting real-time learning. A simulation example demonstrates the efficacy of the proposed approach.
&lt;/p&gt;</description></item></channel></rss>