<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#32479;&#19968;&#30340;&#22270;&#19978;&#20449;&#24687;&#20256;&#25773;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#25324;&#19977;&#31181;&#19981;&#21516;&#30340;&#31867;&#21035;&#65292;&#21033;&#29992;&#27874;&#12289;&#36335;&#24452;&#34892;&#31243;&#26102;&#38388;&#21644;eikonal&#26041;&#31243;&#26469;&#25551;&#36848;&#20449;&#24687;&#30340;&#20256;&#25773;&#65292;&#24182;&#32473;&#20986;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#29992;&#20110;&#25551;&#36848;&#27874;&#21644;eikonal&#27169;&#22411;&#30340;&#32467;&#21512;&#12290;&#20316;&#32773;&#22312;&#38543;&#26426;&#22270;&#24418;&#12289;&#23567;&#19990;&#30028;&#22270;&#21644;&#23454;&#38469;&#32593;&#32476;&#19978;&#36827;&#34892;&#20102;&#25968;&#20540;&#27169;&#25311;&#12290;</title><link>http://arxiv.org/abs/2201.07577</link><description>&lt;p&gt;
&#22270;&#19978;&#20449;&#24687;&#20256;&#25773;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Models for information propagation on graphs. (arXiv:2201.07577v3 [math.NA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.07577
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#32479;&#19968;&#30340;&#22270;&#19978;&#20449;&#24687;&#20256;&#25773;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#25324;&#19977;&#31181;&#19981;&#21516;&#30340;&#31867;&#21035;&#65292;&#21033;&#29992;&#27874;&#12289;&#36335;&#24452;&#34892;&#31243;&#26102;&#38388;&#21644;eikonal&#26041;&#31243;&#26469;&#25551;&#36848;&#20449;&#24687;&#30340;&#20256;&#25773;&#65292;&#24182;&#32473;&#20986;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#29992;&#20110;&#25551;&#36848;&#27874;&#21644;eikonal&#27169;&#22411;&#30340;&#32467;&#21512;&#12290;&#20316;&#32773;&#22312;&#38543;&#26426;&#22270;&#24418;&#12289;&#23567;&#19990;&#30028;&#22270;&#21644;&#23454;&#38469;&#32593;&#32476;&#19978;&#36827;&#34892;&#20102;&#25968;&#20540;&#27169;&#25311;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#21644;&#32479;&#19968;&#20102;&#19981;&#21516;&#30340;&#22270;&#19978;&#20449;&#24687;&#20256;&#25773;&#27169;&#22411;&#12290;&#31532;&#19968;&#31867;&#27169;&#22411;&#23558;&#20256;&#25773;&#24314;&#27169;&#20026;&#19968;&#31181;&#27874;&#65292;&#23427;&#20174;&#19968;&#32452;&#24050;&#30693;&#33410;&#28857;&#22312;&#21021;&#22987;&#26102;&#38388;&#24320;&#22987;&#21521;&#25152;&#26377;&#20854;&#20182;&#26410;&#30693;&#33410;&#28857;&#20256;&#25773;&#65292;&#20256;&#25773;&#30340;&#39034;&#24207;&#30001;&#20449;&#24687;&#27874;&#21069;&#30340;&#21040;&#36798;&#26102;&#38388;&#30830;&#23450;&#12290;&#31532;&#20108;&#31867;&#27169;&#22411;&#22522;&#20110;&#36335;&#24452;&#19978;&#30340;&#34892;&#31243;&#26102;&#38388;&#30340;&#27010;&#24565;&#12290;&#20174;&#19968;&#32452;&#21021;&#22987;&#24050;&#30693;&#33410;&#28857;&#21040;&#19968;&#20010;&#33410;&#28857;&#30340;&#20449;&#24687;&#20256;&#25773;&#26102;&#38388;&#34987;&#23450;&#20041;&#20026;&#25152;&#26377;&#21487;&#20197;&#21040;&#36798;&#35813;&#33410;&#28857;&#30340;&#36335;&#24452;&#30340;&#23376;&#38598;&#19978;&#30340;&#24191;&#20041;&#26053;&#34892;&#26102;&#38388;&#30340;&#26368;&#23567;&#20540;&#12290;&#26368;&#21518;&#19968;&#20010;&#27169;&#22411;&#31867;&#26159;&#36890;&#36807;&#22312;&#27599;&#20010;&#26410;&#30693;&#33410;&#28857;&#19978;&#26045;&#21152;&#19968;&#20010;eikonal&#24418;&#24335;&#30340;&#23616;&#37096;&#26041;&#31243;&#65292;&#24182;&#22312;&#24050;&#30693;&#33410;&#28857;&#22788;&#26045;&#21152;&#36793;&#30028;&#26465;&#20214;&#26469;&#32473;&#20986;&#30340;&#12290;&#22312;&#19968;&#20010;&#33410;&#28857;&#30340;&#35299;&#30340;&#20540;&#19982;&#20855;&#26377;&#36739;&#20302;&#20540;&#30340;&#30456;&#37051;&#33410;&#28857;&#30340;&#35299;&#30340;&#20540;&#32806;&#21512;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#27169;&#22411;&#31867;&#30340;&#31934;&#30830;&#20844;&#24335;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#12290;&#21463;&#21040;&#31532;&#19968;&#21040;&#36798;&#26102;&#38388;&#27169;&#22411;&#21644;eikonal&#26041;&#31243;&#20043;&#38388;&#30340;&#32852;&#31995;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28151;&#21512;&#24418;&#24335;&#65292;&#32467;&#21512;&#20102;&#27874;&#21644;eikonal&#27169;&#22411;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#21508;&#31181;&#22270;&#24418;&#19978;&#23637;&#31034;&#20102;&#27169;&#22411;&#30340;&#25968;&#20540;&#27169;&#25311;&#65292;&#21253;&#25324;&#38543;&#26426;&#22270;&#24418;&#12289;&#23567;&#19990;&#30028;&#22270;&#21644;&#23454;&#38469;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose and unify classes of different models for information propagation over graphs. In a first class, propagation is modelled as a wave which emanates from a set of known nodes at an initial time, to all other unknown nodes at later times with an ordering determined by the arrival time of the information wave front. A second class of models is based on the notion of a travel time along paths between nodes. The time of information propagation from an initial known set of nodes to a node is defined as the minimum of a generalised travel time over subsets of all admissible paths. A final class is given by imposing a local equation of an eikonal form at each unknown node, with boundary conditions at the known nodes. The solution value of the local equation at a node is coupled to those of neighbouring nodes with lower values. We provide precise formulations of the model classes and prove equivalences between them. Motivated by the connection between first arrival time model and the e
&lt;/p&gt;</description></item></channel></rss>