<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>VoiceFlow&#20351;&#29992;&#30699;&#27491;&#27969;&#21305;&#37197;&#31639;&#27861;&#23454;&#29616;&#20102;&#39640;&#25928;&#25991;&#26412;&#36716;&#35821;&#38899;&#65292;&#24182;&#22312;&#21512;&#25104;&#36136;&#37327;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#25193;&#25955;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2309.05027</link><description>&lt;p&gt;
VoiceFlow: &#20351;&#29992;&#30699;&#27491;&#27969;&#21305;&#37197;&#30340;&#39640;&#25928;&#25991;&#26412;&#36716;&#35821;&#38899;
&lt;/p&gt;
&lt;p&gt;
VoiceFlow: Efficient Text-to-Speech with Rectified Flow Matching. (arXiv:2309.05027v1 [eess.AS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05027
&lt;/p&gt;
&lt;p&gt;
VoiceFlow&#20351;&#29992;&#30699;&#27491;&#27969;&#21305;&#37197;&#31639;&#27861;&#23454;&#29616;&#20102;&#39640;&#25928;&#25991;&#26412;&#36716;&#35821;&#38899;&#65292;&#24182;&#22312;&#21512;&#25104;&#36136;&#37327;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#25193;&#25955;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#25193;&#25955;&#27169;&#22411;&#22312;&#25991;&#26412;&#36716;&#35821;&#38899;&#20013;&#22240;&#20854;&#24378;&#22823;&#30340;&#29983;&#25104;&#33021;&#21147;&#32780;&#25104;&#20026;&#19968;&#31181;&#27969;&#34892;&#36873;&#25321;&#65292;&#20294;&#20174;&#25193;&#25955;&#27169;&#22411;&#20013;&#36827;&#34892;&#37319;&#26679;&#30340;&#20869;&#22312;&#22797;&#26434;&#24615;&#25439;&#23475;&#20102;&#20854;&#25928;&#29575;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;VoiceFlow&#65292;&#19968;&#31181;&#21033;&#29992;&#30699;&#27491;&#27969;&#21305;&#37197;&#31639;&#27861;&#26469;&#23454;&#29616;&#39640;&#21512;&#25104;&#36136;&#37327;&#30340;&#22768;&#23398;&#27169;&#22411;&#65292;&#21482;&#38656;&#26377;&#38480;&#27425;&#37319;&#26679;&#27493;&#39588;&#21363;&#21487;&#23454;&#29616;&#12290;VoiceFlow&#23558;&#29983;&#25104;mel-spectrograms&#30340;&#36807;&#31243;&#36716;&#21270;&#20026;&#19968;&#20010;&#26222;&#36890;&#24494;&#20998;&#26041;&#31243;&#65292;&#22312;&#25991;&#26412;&#36755;&#20837;&#30340;&#26465;&#20214;&#19979;&#36827;&#34892;&#27714;&#35299;&#65292;&#24182;&#20272;&#35745;&#20986;&#20854;&#21521;&#37327;&#22330;&#12290;&#28982;&#21518;&#65292;&#30699;&#27491;&#27969;&#25216;&#26415;&#26377;&#25928;&#22320;&#20351;&#20854;&#37319;&#26679;&#36712;&#36857;&#30452;&#32447;&#21270;&#65292;&#23454;&#29616;&#39640;&#25928;&#21512;&#25104;&#12290;&#22312;&#21333;&#20010;&#21644;&#22810;&#20010;&#35828;&#35805;&#32773;&#35821;&#26009;&#24211;&#19978;&#36827;&#34892;&#30340;&#20027;&#35266;&#21644;&#23458;&#35266;&#35780;&#20272;&#26174;&#31034;&#65292;VoiceFlow&#30456;&#23545;&#20110;&#25193;&#25955;&#27169;&#22411;&#20855;&#26377;&#26356;&#20248;&#24322;&#30340;&#21512;&#25104;&#36136;&#37327;&#12290;&#28040;&#34701;&#30740;&#31350;&#36827;&#19968;&#27493;&#39564;&#35777;&#20102;VoiceFlow&#20013;&#30699;&#27491;&#27969;&#25216;&#26415;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Although diffusion models in text-to-speech have become a popular choice due to their strong generative ability, the intrinsic complexity of sampling from diffusion models harms their efficiency. Alternatively, we propose VoiceFlow, an acoustic model that utilizes a rectified flow matching algorithm to achieve high synthesis quality with a limited number of sampling steps. VoiceFlow formulates the process of generating mel-spectrograms into an ordinary differential equation conditional on text inputs, whose vector field is then estimated. The rectified flow technique then effectively straightens its sampling trajectory for efficient synthesis. Subjective and objective evaluations on both single and multi-speaker corpora showed the superior synthesis quality of VoiceFlow compared to the diffusion counterpart. Ablation studies further verified the validity of the rectified flow technique in VoiceFlow.
&lt;/p&gt;</description></item></channel></rss>