<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;&#21033;&#29992;&#31038;&#20132;&#23186;&#20307;&#36164;&#26009;&#39044;&#27979;&#20010;&#20154;&#20449;&#24687;&#30340;&#20010;&#24615;&#21270;&#20998;&#26512;&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;&#21644;&#22810;&#29992;&#36884;&#24615;&#65292;&#24182;&#21457;&#29616;&#25903;&#25345;&#21521;&#37327;&#26426;&#27169;&#22411;&#22312;&#39044;&#27979;&#20010;&#24615;&#31867;&#22411;&#26041;&#38754;&#20855;&#26377;&#26368;&#20339;&#20934;&#30830;&#29575;&#65292;&#32780;&#36923;&#36753;&#22238;&#24402;&#27169;&#22411;&#22312;&#36895;&#24230;&#21644;&#20934;&#30830;&#24615;&#19978;&#34920;&#29616;&#36739;&#22909;&#12290;</title><link>http://arxiv.org/abs/2309.13065</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#20998;&#26512;&#65306;&#31038;&#20132;&#23186;&#20307;&#36164;&#26009;&#22312;&#39044;&#27979;&#20010;&#20154;&#20449;&#24687;&#26041;&#38754;&#26377;&#22810;&#26377;&#29992;&#65311;
&lt;/p&gt;
&lt;p&gt;
Personality Profiling: How informative are social media profiles in predicting personal information?. (arXiv:2309.13065v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.13065
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#32034;&#20102;&#21033;&#29992;&#31038;&#20132;&#23186;&#20307;&#36164;&#26009;&#39044;&#27979;&#20010;&#20154;&#20449;&#24687;&#30340;&#20010;&#24615;&#21270;&#20998;&#26512;&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;&#21644;&#22810;&#29992;&#36884;&#24615;&#65292;&#24182;&#21457;&#29616;&#25903;&#25345;&#21521;&#37327;&#26426;&#27169;&#22411;&#22312;&#39044;&#27979;&#20010;&#24615;&#31867;&#22411;&#26041;&#38754;&#20855;&#26377;&#26368;&#20339;&#20934;&#30830;&#29575;&#65292;&#32780;&#36923;&#36753;&#22238;&#24402;&#27169;&#22411;&#22312;&#36895;&#24230;&#21644;&#20934;&#30830;&#24615;&#19978;&#34920;&#29616;&#36739;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#21496;&#21033;&#29992;&#20010;&#24615;&#21270;&#20998;&#26512;&#36827;&#34892;&#23450;&#21521;&#24191;&#21578;&#12289;&#25919;&#27835;&#23459;&#20256;&#21644;&#30123;&#33495;&#23459;&#20256;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#27169;&#22411;&#30340;&#20934;&#30830;&#24615;&#21644;&#22810;&#29992;&#36884;&#24615;&#20173;&#28982;&#30456;&#23545;&#26410;&#30693;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#26088;&#22312;&#25506;&#32034;&#20154;&#20204;&#30340;&#22312;&#32447;&#25968;&#23383;&#36275;&#36857;&#33021;&#22815;&#34987;&#29992;&#26469;&#20998;&#26512;&#20854;&#36808;&#23572;&#26031;-&#24067;&#37324;&#26684;&#26031;&#20154;&#26684;&#31867;&#22411;&#30340;&#31243;&#24230;&#12290;&#25105;&#20204;&#20998;&#26512;&#21644;&#27604;&#36739;&#20102;&#22235;&#20010;&#27169;&#22411;&#30340;&#32467;&#26524;&#65306;&#36923;&#36753;&#22238;&#24402;&#12289;&#26420;&#32032;&#36125;&#21494;&#26031;&#12289;&#25903;&#25345;&#21521;&#37327;&#26426;&#65288;SVM&#65289;&#21644;&#38543;&#26426;&#26862;&#26519;&#12290;&#25105;&#20204;&#21457;&#29616;SVM&#27169;&#22411;&#22312;&#39044;&#27979;&#26576;&#20154;&#30340;&#23436;&#25972;&#20010;&#24615;&#31867;&#22411;&#26041;&#38754;&#36798;&#21040;&#20102;&#26368;&#20339;&#20934;&#30830;&#29575;20.95%&#12290;&#28982;&#32780;&#65292;&#36923;&#36753;&#22238;&#24402;&#27169;&#22411;&#30340;&#34920;&#29616;&#21482;&#31245;&#24494;&#24046;&#19968;&#20123;&#65292;&#24182;&#19988;&#22312;&#35757;&#32451;&#21644;&#36827;&#34892;&#39044;&#27979;&#26102;&#36895;&#24230;&#26356;&#24555;&#12290;&#25105;&#20204;&#21457;&#29616;&#35768;&#22810;&#26631;&#35760;&#25968;&#25454;&#38598;&#22312;&#31038;&#20132;&#23186;&#20307;&#19978;&#21576;&#29616;&#20986;&#20010;&#20154;&#29305;&#24449;&#30340;&#20005;&#37325;&#31867;&#21035;&#19981;&#24179;&#34913;&#65292;&#21253;&#25324;&#25105;&#20204;&#33258;&#24049;&#30340;&#25968;&#25454;&#38598;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24378;&#35843;&#38656;&#35201;&#22312;&#25253;&#21578;&#36825;&#20123;&#25968;&#25454;&#38598;&#19978;&#27169;&#22411;&#24615;&#33021;&#26102;&#36827;&#34892;&#20180;&#32454;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;
Personality profiling has been utilised by companies for targeted advertising, political campaigns and vaccine campaigns. However, the accuracy and versatility of such models still remains relatively unknown. Consequently, we aim to explore the extent to which peoples' online digital footprints can be used to profile their Myers-Briggs personality type. We analyse and compare the results of four models: logistic regression, naive Bayes, support vector machines (SVMs) and random forests. We discover that a SVM model achieves the best accuracy of 20.95% for predicting someones complete personality type. However, logistic regression models perform only marginally worse and are significantly faster to train and perform predictions. We discover that many labelled datasets present substantial class imbalances of personal characteristics on social media, including our own. As a result, we highlight the need for attentive consideration when reporting model performance on these datasets and com
&lt;/p&gt;</description></item></channel></rss>