<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#12289;&#20197;&#36755;&#20986;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#32479;&#35745;&#39564;&#35777;&#25216;&#26415;&#26469;&#35748;&#35777;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNN)&#20998;&#31867;&#22120;&#30340;&#36755;&#20986;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#26631;&#35760;&#21487;&#33021;&#19981;&#21487;&#38752;&#30340;&#29305;&#23450;&#36755;&#20837;&#65292;&#20197;&#20415;&#21518;&#32493;&#30001;&#20154;&#24037;&#19987;&#23478;&#26816;&#26597;&#12290;&#19982;&#29616;&#26377;&#25216;&#26415;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20027;&#35201;&#20851;&#27880;&#21333;&#20010;&#36755;&#20986;&#32780;&#19981;&#26159;&#25972;&#20010;DNN&#30340;&#35748;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.02283</link><description>&lt;p&gt;
DEM: &#33322;&#31354;&#33322;&#22825;&#20013;&#29992;&#20110;&#35748;&#35777;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20998;&#31867;&#22120;&#36755;&#20986;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DEM: A Method for Certifying Deep Neural Network Classifier Outputs in Aerospace. (arXiv:2401.02283v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.02283
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#12289;&#20197;&#36755;&#20986;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#32479;&#35745;&#39564;&#35777;&#25216;&#26415;&#26469;&#35748;&#35777;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNN)&#20998;&#31867;&#22120;&#30340;&#36755;&#20986;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#26631;&#35760;&#21487;&#33021;&#19981;&#21487;&#38752;&#30340;&#29305;&#23450;&#36755;&#20837;&#65292;&#20197;&#20415;&#21518;&#32493;&#30001;&#20154;&#24037;&#19987;&#23478;&#26816;&#26597;&#12290;&#19982;&#29616;&#26377;&#25216;&#26415;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20027;&#35201;&#20851;&#27880;&#21333;&#20010;&#36755;&#20986;&#32780;&#19981;&#26159;&#25972;&#20010;DNN&#30340;&#35748;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33322;&#31354;&#33322;&#22825;&#39046;&#22495;&#30340;&#36719;&#20214;&#24320;&#21457;&#35201;&#27714;&#36981;&#24490;&#20005;&#26684;&#12289;&#39640;&#36136;&#37327;&#30340;&#26631;&#20934;&#12290;&#23613;&#31649;&#22312;&#36825;&#20010;&#39046;&#22495;&#20013;&#23384;&#22312;&#30528;&#21830;&#29992;&#36719;&#20214;&#30340;&#30417;&#31649;&#25351;&#21335;&#65288;&#20363;&#22914;ARP-4754&#21644;DO-178&#65289;&#65292;&#20294;&#36825;&#20123;&#25351;&#21335;&#24182;&#19981;&#36866;&#29992;&#20110;&#20855;&#26377;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#32452;&#20214;&#30340;&#36719;&#20214;&#12290;&#22240;&#27492;&#65292;&#22914;&#20309;&#20351;&#33322;&#31354;&#33322;&#22825;&#31995;&#32479;&#21463;&#30410;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#38761;&#21629;&#23578;&#19981;&#28165;&#26970;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#12289;&#20197;&#36755;&#20986;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65292;&#29992;&#20110;DNN&#30340;&#35748;&#35777;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#37319;&#29992;&#32479;&#35745;&#39564;&#35777;&#25216;&#26415;&#65292;&#24182;&#20855;&#26377;&#33021;&#22815;&#26631;&#35760;DNN&#36755;&#20986;&#21487;&#33021;&#19981;&#21487;&#38752;&#30340;&#29305;&#23450;&#36755;&#20837;&#30340;&#20851;&#38190;&#20248;&#21183;&#65292;&#20197;&#20415;&#21518;&#32493;&#30001;&#19987;&#23478;&#26816;&#26597;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#23545;DNN&#23545;&#20854;&#20182;&#38468;&#36817;&#36755;&#20837;&#30340;&#39044;&#27979;&#36827;&#34892;&#32479;&#35745;&#20998;&#26512;&#65292;&#20197;&#26816;&#27979;&#19981;&#19968;&#33268;&#24615;&#12290;&#36825;&#19982;&#29616;&#26377;&#25216;&#26415;&#30456;&#21453;&#65292;&#21518;&#32773;&#36890;&#24120;&#35797;&#22270;&#23545;&#25972;&#20010;DNN&#36827;&#34892;&#35748;&#35777;&#65292;&#32780;&#38750;&#21333;&#20010;&#36755;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;
Software development in the aerospace domain requires adhering to strict, high-quality standards. While there exist regulatory guidelines for commercial software in this domain (e.g., ARP-4754 and DO-178), these do not apply to software with deep neural network (DNN) components. Consequently, it is unclear how to allow aerospace systems to benefit from the deep learning revolution. Our work here seeks to address this challenge with a novel, output-centric approach for DNN certification. Our method employs statistical verification techniques, and has the key advantage of being able to flag specific inputs for which the DNN's output may be unreliable - so that they may be later inspected by a human expert. To achieve this, our method conducts a statistical analysis of the DNN's predictions for other, nearby inputs, in order to detect inconsistencies. This is in contrast to existing techniques, which typically attempt to certify the entire DNN, as opposed to individual outputs. Our method
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#37319;&#35775;&#23454;&#36341;&#32773;&#21644;&#36827;&#34892;&#35843;&#26597;&#30340;&#26041;&#24335;&#65292;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#36719;&#20214;&#31995;&#32479;&#20013;&#30340;&#36136;&#37327;&#38382;&#39064;&#65292;&#24182;&#30830;&#23450;&#20102;&#19968;&#20010;&#36136;&#37327;&#38382;&#39064;&#30446;&#24405;&#12290;</title><link>http://arxiv.org/abs/2306.15007</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#36719;&#20214;&#31995;&#32479;&#20013;&#30340;&#36136;&#37327;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Quality Issues in Machine Learning Software Systems. (arXiv:2306.15007v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15007
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#37319;&#35775;&#23454;&#36341;&#32773;&#21644;&#36827;&#34892;&#35843;&#26597;&#30340;&#26041;&#24335;&#65292;&#30740;&#31350;&#20102;&#26426;&#22120;&#23398;&#20064;&#36719;&#20214;&#31995;&#32479;&#20013;&#30340;&#36136;&#37327;&#38382;&#39064;&#65292;&#24182;&#30830;&#23450;&#20102;&#19968;&#20010;&#36136;&#37327;&#38382;&#39064;&#30446;&#24405;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19978;&#19979;&#25991;&#65306;&#22312;&#21508;&#20010;&#39046;&#22495;&#20013;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#38656;&#27714;&#26159;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#26469;&#35299;&#20915;&#22797;&#26434;&#30340;&#38382;&#39064;&#12290;ML&#27169;&#22411;&#34987;&#23454;&#29616;&#20026;&#36719;&#20214;&#32452;&#20214;&#24182;&#37096;&#32626;&#22312;&#26426;&#22120;&#23398;&#20064;&#36719;&#20214;&#31995;&#32479;&#65288;MLSSs&#65289;&#20013;&#12290;&#38382;&#39064;&#65306;&#26377;&#24517;&#35201;&#30830;&#20445;MLSSs&#30340;&#26381;&#21153;&#36136;&#37327;&#12290;&#36825;&#20123;&#31995;&#32479;&#30340;&#38169;&#35823;&#25110;&#19981;&#33391;&#20915;&#31574;&#21487;&#33021;&#23548;&#33268;&#20854;&#20182;&#31995;&#32479;&#30340;&#25925;&#38556;&#65292;&#36896;&#25104;&#24040;&#22823;&#30340;&#36130;&#21153;&#25439;&#22833;&#65292;&#29978;&#33267;&#23545;&#20154;&#31867;&#29983;&#21629;&#26500;&#25104;&#23041;&#32961;&#12290; MLSSs&#30340;&#36136;&#37327;&#20445;&#35777;&#34987;&#35748;&#20026;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#65292;&#30446;&#21069;&#26159;&#19968;&#20010;&#28909;&#38376;&#30340;&#30740;&#31350;&#35838;&#39064;&#12290;&#30446;&#26631;&#65306;&#26412;&#25991;&#26088;&#22312;&#20174;&#23454;&#36341;&#32773;&#30340;&#35282;&#24230;&#30740;&#31350;MLSSs&#20013;&#30495;&#23454;&#36136;&#37327;&#38382;&#39064;&#30340;&#29305;&#24449;&#12290;&#36825;&#39033;&#23454;&#35777;&#30740;&#31350;&#26088;&#22312;&#30830;&#23450;MLSSs&#20013;&#30340;&#36136;&#37327;&#38382;&#39064;&#30446;&#24405;&#12290;&#26041;&#27861;&#65306;&#25105;&#20204;&#19982;&#23454;&#36341;&#32773;/&#19987;&#23478;&#36827;&#34892;&#20102;&#19968;&#31995;&#21015;&#37319;&#35775;&#65292;&#20197;&#33719;&#21462;&#20182;&#20204;&#22788;&#29702;&#36136;&#37327;&#38382;&#39064;&#26102;&#30340;&#32463;&#39564;&#21644;&#20570;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;ML&#20174;&#19994;&#32773;&#30340;&#35843;&#26597;&#39564;&#35777;&#20102;&#25152;&#30830;&#23450;&#30340;&#36136;&#37327;&#38382;&#39064;&#12290;&#32467;&#26524;
&lt;/p&gt;
&lt;p&gt;
Context: An increasing demand is observed in various domains to employ Machine Learning (ML) for solving complex problems. ML models are implemented as software components and deployed in Machine Learning Software Systems (MLSSs). Problem: There is a strong need for ensuring the serving quality of MLSSs. False or poor decisions of such systems can lead to malfunction of other systems, significant financial losses, or even threats to human life. The quality assurance of MLSSs is considered a challenging task and currently is a hot research topic. Objective: This paper aims to investigate the characteristics of real quality issues in MLSSs from the viewpoint of practitioners. This empirical study aims to identify a catalog of quality issues in MLSSs. Method: We conduct a set of interviews with practitioners/experts, to gather insights about their experience and practices when dealing with quality issues. We validate the identified quality issues via a survey with ML practitioners. Result
&lt;/p&gt;</description></item></channel></rss>