<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>LyricWhiz&#26159;&#19968;&#31181;&#40065;&#26834;&#12289;&#22810;&#35821;&#35328;&#12289;&#38646;&#23556;&#20987;&#30340;&#33258;&#21160;&#27468;&#35789;&#36716;&#24405;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;Whisper&#20316;&#20026;"&#32819;&#26421;"&#21644;GPT-4&#20316;&#20026;"&#22823;&#33041;"&#65292;&#23427;&#22312;&#21508;&#31181;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#65292;&#21516;&#26102;&#36824;&#23454;&#29616;&#20102;&#22312;&#22810;&#31181;&#35821;&#35328;&#20013;&#36827;&#34892;&#27468;&#35789;&#36716;&#24405;&#30340;&#33021;&#21147;&#65292;&#24182;&#21019;&#24314;&#20102;&#31532;&#19968;&#20010;&#22823;&#35268;&#27169;&#22810;&#35821;&#35328;&#27468;&#35789;&#36716;&#24405;&#25968;&#25454;&#38598;&#12290;</title><link>http://arxiv.org/abs/2306.17103</link><description>&lt;p&gt;
LyricWhiz: &#36890;&#36807;&#21521;ChatGPT&#32819;&#35821;&#36827;&#34892;&#40065;&#26834;&#30340;&#22810;&#35821;&#35328;&#38646;&#23556;&#20987;&#27468;&#35789;&#36716;&#24405;
&lt;/p&gt;
&lt;p&gt;
LyricWhiz: Robust Multilingual Zero-shot Lyrics Transcription by Whispering to ChatGPT. (arXiv:2306.17103v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17103
&lt;/p&gt;
&lt;p&gt;
LyricWhiz&#26159;&#19968;&#31181;&#40065;&#26834;&#12289;&#22810;&#35821;&#35328;&#12289;&#38646;&#23556;&#20987;&#30340;&#33258;&#21160;&#27468;&#35789;&#36716;&#24405;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;Whisper&#20316;&#20026;"&#32819;&#26421;"&#21644;GPT-4&#20316;&#20026;"&#22823;&#33041;"&#65292;&#23427;&#22312;&#21508;&#31181;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#65292;&#21516;&#26102;&#36824;&#23454;&#29616;&#20102;&#22312;&#22810;&#31181;&#35821;&#35328;&#20013;&#36827;&#34892;&#27468;&#35789;&#36716;&#24405;&#30340;&#33021;&#21147;&#65292;&#24182;&#21019;&#24314;&#20102;&#31532;&#19968;&#20010;&#22823;&#35268;&#27169;&#22810;&#35821;&#35328;&#27468;&#35789;&#36716;&#24405;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;LyricWhiz&#30340;&#40065;&#26834;&#12289;&#22810;&#35821;&#35328;&#12289;&#38646;&#23556;&#20987;&#30340;&#33258;&#21160;&#27468;&#35789;&#36716;&#24405;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#21508;&#31181;&#27468;&#35789;&#36716;&#24405;&#25968;&#25454;&#38598;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#65292;&#21363;&#20351;&#22312;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#27969;&#27966;&#22914;&#25671;&#28378;&#21644;&#37329;&#23646;&#20013;&#20063;&#26159;&#22914;&#27492;&#12290;&#25105;&#20204;&#30340;&#20840;&#26032;&#12289;&#26080;&#38656;&#35757;&#32451;&#30340;&#26041;&#27861;&#21033;&#29992;&#20102;Whisper&#65292;&#19968;&#31181;&#24369;&#30417;&#30563;&#30340;&#40065;&#26834;&#35821;&#38899;&#35782;&#21035;&#27169;&#22411;&#65292;&#20197;&#21450;GPT-4&#65292;&#24403;&#20170;&#26368;&#24615;&#33021;&#21331;&#36234;&#30340;&#22522;&#20110;&#32842;&#22825;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12290;&#22312;&#35813;&#26041;&#27861;&#20013;&#65292;Whisper&#20805;&#24403;&#8220;&#32819;&#26421;&#8221;&#65292;&#36127;&#36131;&#36716;&#24405;&#35821;&#38899;&#65292;&#32780;GPT-4&#21017;&#20316;&#20026;&#8220;&#22823;&#33041;&#8221;&#65292;&#20316;&#20026;&#19968;&#31181;&#20855;&#26377;&#24378;&#22823;&#24615;&#33021;&#30340;&#19978;&#19979;&#25991;&#36755;&#20986;&#36873;&#25321;&#21644;&#26657;&#27491;&#30340;&#27880;&#37322;&#22120;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#65292;LyricWhiz&#22312;&#33521;&#35821;&#20013;&#26174;&#33879;&#38477;&#20302;&#20102;&#35789;&#38169;&#35823;&#29575;&#65292;&#24182;&#19988;&#21487;&#20197;&#26377;&#25928;&#22320;&#36716;&#24405;&#22810;&#31181;&#35821;&#35328;&#30340;&#27468;&#35789;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;LyricWhiz&#21019;&#24314;&#20102;&#31532;&#19968;&#20010;&#20855;&#26377;CC-BY-NC-SA&#29256;&#26435;&#35768;&#21487;&#30340;&#20844;&#24320;&#21487;&#29992;&#30340;&#22823;&#35268;&#27169;&#22810;&#35821;&#35328;&#27468;&#35789;&#36716;&#24405;&#25968;&#25454;&#38598;&#65292;&#22522;&#20110;MTG-Jamendo&#65292;&#24182;&#25552;&#20379;&#20102;h
&lt;/p&gt;
&lt;p&gt;
We introduce LyricWhiz, a robust, multilingual, and zero-shot automatic lyrics transcription method achieving state-of-the-art performance on various lyrics transcription datasets, even in challenging genres such as rock and metal. Our novel, training-free approach utilizes Whisper, a weakly supervised robust speech recognition model, and GPT-4, today's most performant chat-based large language model. In the proposed method, Whisper functions as the "ear" by transcribing the audio, while GPT-4 serves as the "brain," acting as an annotator with a strong performance for contextualized output selection and correction. Our experiments show that LyricWhiz significantly reduces Word Error Rate compared to existing methods in English and can effectively transcribe lyrics across multiple languages. Furthermore, we use LyricWhiz to create the first publicly available, large-scale, multilingual lyrics transcription dataset with a CC-BY-NC-SA copyright license, based on MTG-Jamendo, and offer a h
&lt;/p&gt;</description></item></channel></rss>