<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#21512;&#25104;EHR&#25968;&#25454;&#24320;&#21457;CDSS&#24037;&#20855;&#30340;&#20307;&#31995;&#26550;&#26500;&#65292;&#36890;&#36807;&#20351;&#29992;SyntHIR&#31995;&#32479;&#21644;FHIR&#26631;&#20934;&#23454;&#29616;&#25968;&#25454;&#20114;&#25805;&#20316;&#24615;&#21644;&#24037;&#20855;&#21487;&#36801;&#31227;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.02613</link><description>&lt;p&gt;
&#29992;SyntHIR&#23454;&#29616;&#20114;&#25805;&#20316;&#24615;&#21512;&#25104;&#20581;&#24247;&#25968;&#25454;&#65292;&#20197;&#20415;&#24320;&#21457;CDSS&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;
Interoperable synthetic health data with SyntHIR to enable the development of CDSS tools. (arXiv:2308.02613v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02613
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#21512;&#25104;EHR&#25968;&#25454;&#24320;&#21457;CDSS&#24037;&#20855;&#30340;&#20307;&#31995;&#26550;&#26500;&#65292;&#36890;&#36807;&#20351;&#29992;SyntHIR&#31995;&#32479;&#21644;FHIR&#26631;&#20934;&#23454;&#29616;&#25968;&#25454;&#20114;&#25805;&#20316;&#24615;&#21644;&#24037;&#20855;&#21487;&#36801;&#31227;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#39640;&#36136;&#37327;&#30340;&#24739;&#32773;&#26085;&#24535;&#21644;&#20581;&#24247;&#30331;&#35760;&#26469;&#24320;&#21457;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#20020;&#24202;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65288;CDSS&#65289;&#26377;&#24456;&#22823;&#30340;&#26426;&#20250;&#12290;&#20026;&#20102;&#22312;&#20020;&#24202;&#24037;&#20316;&#27969;&#31243;&#20013;&#23454;&#26045;CDSS&#24037;&#20855;&#65292;&#38656;&#35201;&#23558;&#35813;&#24037;&#20855;&#38598;&#25104;&#12289;&#39564;&#35777;&#21644;&#27979;&#35797;&#22312;&#29992;&#20110;&#23384;&#20648;&#21644;&#31649;&#29702;&#24739;&#32773;&#25968;&#25454;&#30340;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#65288;EHR&#65289;&#31995;&#32479;&#19978;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#21512;&#35268;&#27861;&#35268;&#65292;&#36890;&#24120;&#19981;&#21487;&#33021;&#33719;&#24471;&#23545;EHR&#31995;&#32479;&#30340;&#24517;&#35201;&#35775;&#38382;&#26435;&#38480;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#21644;&#20351;&#29992;CDSS&#24037;&#20855;&#24320;&#21457;&#30340;&#21512;&#25104;EHR&#25968;&#25454;&#30340;&#20307;&#31995;&#26550;&#26500;&#12290;&#35813;&#20307;&#31995;&#32467;&#26500;&#22312;&#19968;&#20010;&#31216;&#20026;SyntHIR&#30340;&#31995;&#32479;&#20013;&#23454;&#29616;&#12290;SyntHIR&#31995;&#32479;&#20351;&#29992;Fast Healthcare Interoperability Resources (FHIR)&#26631;&#20934;&#36827;&#34892;&#25968;&#25454;&#20114;&#25805;&#20316;&#24615;&#65292;&#20351;&#29992;Gretel&#26694;&#26550;&#29983;&#25104;&#21512;&#25104;&#25968;&#25454;&#65292;&#20351;&#29992;Microsoft Azure FHIR&#26381;&#21153;&#22120;&#20316;&#20026;&#22522;&#20110;FHIR&#30340;EHR&#31995;&#32479;&#65292;&#20197;&#21450;&#20351;&#29992;SMART on FHIR&#26694;&#26550;&#36827;&#34892;&#24037;&#20855;&#21487;&#36801;&#31227;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#25968;&#25454;&#24320;&#21457;&#26426;&#22120;&#23398;&#20064;&#22522;&#20110;CDSS&#24037;&#20855;&#26469;&#23637;&#31034;SyntHIR&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
There is a great opportunity to use high-quality patient journals and health registers to develop machine learning-based Clinical Decision Support Systems (CDSS). To implement a CDSS tool in a clinical workflow, there is a need to integrate, validate and test this tool on the Electronic Health Record (EHR) systems used to store and manage patient data. However, it is often not possible to get the necessary access to an EHR system due to legal compliance. We propose an architecture for generating and using synthetic EHR data for CDSS tool development. The architecture is implemented in a system called SyntHIR. The SyntHIR system uses the Fast Healthcare Interoperability Resources (FHIR) standards for data interoperability, the Gretel framework for generating synthetic data, the Microsoft Azure FHIR server as the FHIR-based EHR system and SMART on FHIR framework for tool transportability. We demonstrate the usefulness of SyntHIR by developing a machine learning-based CDSS tool using data
&lt;/p&gt;</description></item></channel></rss>