<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#30740;&#31350;&#20102;&#22522;&#20110;Fisher&#20449;&#24687;&#30697;&#38453;&#30340;&#33258;&#28982;&#26799;&#24230;&#26041;&#27861;&#22312;&#32447;&#24615;&#35268;&#21010;&#20013;&#30340;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#32447;&#24615;&#25910;&#25947;&#24615;&#65292;&#25552;&#20986;&#20102;&#25913;&#36827;&#29616;&#26377;&#32467;&#26524;&#30340;&#29109;&#27491;&#21017;&#21270;&#35823;&#24046;&#20272;&#35745;&#65292;&#24182;&#23545;&#25200;&#21160;&#30340;Fisher-Rao&#26799;&#24230;&#27969;&#21644;&#33258;&#28982;&#26799;&#24230;&#27969;&#30340;&#27425;&#32447;&#24615;&#25910;&#25947;&#24615;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;</title><link>https://arxiv.org/abs/2403.19448</link><description>&lt;p&gt;
Fisher-Rao&#32447;&#24615;&#35268;&#21010;&#21644;&#29366;&#24577;-&#21160;&#20316;&#33258;&#28982;&#31574;&#30053;&#26799;&#24230;&#30340;&#26799;&#24230;&#27969;
&lt;/p&gt;
&lt;p&gt;
Fisher-Rao Gradient Flows of Linear Programs and State-Action Natural Policy Gradients
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19448
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22522;&#20110;Fisher&#20449;&#24687;&#30697;&#38453;&#30340;&#33258;&#28982;&#26799;&#24230;&#26041;&#27861;&#22312;&#32447;&#24615;&#35268;&#21010;&#20013;&#30340;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#32447;&#24615;&#25910;&#25947;&#24615;&#65292;&#25552;&#20986;&#20102;&#25913;&#36827;&#29616;&#26377;&#32467;&#26524;&#30340;&#29109;&#27491;&#21017;&#21270;&#35823;&#24046;&#20272;&#35745;&#65292;&#24182;&#23545;&#25200;&#21160;&#30340;Fisher-Rao&#26799;&#24230;&#27969;&#21644;&#33258;&#28982;&#26799;&#24230;&#27969;&#30340;&#27425;&#32447;&#24615;&#25910;&#25947;&#24615;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Kakade&#30340;&#33258;&#28982;&#31574;&#30053;&#26799;&#24230;&#26041;&#27861;&#36817;&#24180;&#26469;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#65292;&#34920;&#26126;&#22312;&#26377;&#25110;&#26080;&#27491;&#21017;&#21270;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377;&#32447;&#24615;&#25910;&#25947;&#24615;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21478;&#19968;&#31181;&#22522;&#20110;&#29366;&#24577;-&#21160;&#20316;&#20998;&#24067;&#30340;Fisher&#20449;&#24687;&#30697;&#38453;&#30340;&#33258;&#28982;&#26799;&#24230;&#26041;&#27861;&#65292;&#20294;&#22312;&#29702;&#35770;&#26041;&#38754;&#25509;&#21463;&#24230;&#36739;&#20302;&#12290;&#22312;&#36825;&#37324;&#65292;&#29366;&#24577;-&#21160;&#20316;&#20998;&#24067;&#22312;&#29366;&#24577;-&#21160;&#20316;&#22810;&#38754;&#20307;&#20869;&#36981;&#24490;Fisher-Rao&#26799;&#24230;&#27969;&#65292;&#30456;&#23545;&#20110;&#32447;&#24615;&#21183;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#26356;&#20840;&#38754;&#22320;&#30740;&#31350;&#32447;&#24615;&#35268;&#21010;&#30340;Fisher-Rao&#26799;&#24230;&#27969;&#65292;&#24182;&#26174;&#31034;&#20102;&#32447;&#24615;&#25910;&#25947;&#24615;&#65292;&#20854;&#36895;&#29575;&#21462;&#20915;&#20110;&#32447;&#24615;&#35268;&#21010;&#30340;&#20960;&#20309;&#29305;&#24615;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#36825;&#25552;&#20379;&#20102;&#32447;&#24615;&#35268;&#21010;&#30340;&#29109;&#27491;&#21017;&#21270;&#24341;&#36215;&#30340;&#35823;&#24046;&#20272;&#35745;&#65292;&#36825;&#25913;&#36827;&#20102;&#29616;&#26377;&#32467;&#26524;&#12290;&#25105;&#20204;&#25299;&#23637;&#20102;&#36825;&#20123;&#32467;&#26524;&#65292;&#24182;&#23637;&#31034;&#20102;&#23545;&#25200;&#21160;&#30340;Fisher-Rao&#26799;&#24230;&#27969;&#21644;&#33258;&#28982;&#26799;&#24230;&#27969;&#30340;&#27425;&#32447;&#24615;&#25910;&#25947;&#24615;&#65292;&#30452;&#21040;&#36924;&#36817;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19448v1 Announce Type: cross  Abstract: Kakade's natural policy gradient method has been studied extensively in the last years showing linear convergence with and without regularization. We study another natural gradient method which is based on the Fisher information matrix of the state-action distributions and has received little attention from the theoretical side. Here, the state-action distributions follow the Fisher-Rao gradient flow inside the state-action polytope with respect to a linear potential. Therefore, we study Fisher-Rao gradient flows of linear programs more generally and show linear convergence with a rate that depends on the geometry of the linear program. Equivalently, this yields an estimate on the error induced by entropic regularization of the linear program which improves existing results. We extend these results and show sublinear convergence for perturbed Fisher-Rao gradient flows and natural gradient flows up to an approximation error. In particul
&lt;/p&gt;</description></item></channel></rss>