<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#25512;&#29305;&#25968;&#25454;&#36827;&#34892;&#20132;&#36890;&#29992;&#25143;&#21453;&#39304;&#30340;&#24773;&#24863;&#20998;&#26512;&#12290;&#36890;&#36807;&#23569;&#26679;&#26412;&#23398;&#20064;&#35782;&#21035;&#25512;&#29305;&#20013;&#30340;&#38382;&#39064;&#65292;&#24182;&#37319;&#29992;&#35789;&#20856;&#24773;&#24863;&#20998;&#26512;&#27169;&#22411;&#35780;&#20272;&#25512;&#29305;&#24773;&#24863;&#30340;&#24378;&#24230;&#21644;&#26497;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.07086</link><description>&lt;p&gt;
&#21033;&#29992;&#25512;&#29305;&#25968;&#25454;&#36827;&#34892;&#20132;&#36890;&#29992;&#25143;&#21453;&#39304;&#30340;&#24773;&#24863;&#20998;&#26512;&#65306;&#19968;&#20010;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Leveraging Twitter Data for Sentiment Analysis of Transit User Feedback: An NLP Framework. (arXiv:2310.07086v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07086
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#25512;&#29305;&#25968;&#25454;&#36827;&#34892;&#20132;&#36890;&#29992;&#25143;&#21453;&#39304;&#30340;&#24773;&#24863;&#20998;&#26512;&#12290;&#36890;&#36807;&#23569;&#26679;&#26412;&#23398;&#20064;&#35782;&#21035;&#25512;&#29305;&#20013;&#30340;&#38382;&#39064;&#65292;&#24182;&#37319;&#29992;&#35789;&#20856;&#24773;&#24863;&#20998;&#26512;&#27169;&#22411;&#35780;&#20272;&#25512;&#29305;&#24773;&#24863;&#30340;&#24378;&#24230;&#21644;&#26497;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#30340;&#36890;&#36807;&#20132;&#36890;&#35843;&#26597;&#25910;&#38598;&#29992;&#25143;&#21453;&#39304;&#30340;&#26041;&#27861;&#24448;&#24448;&#32791;&#26102;&#12289;&#36164;&#28304;&#23494;&#38598;&#19988;&#26114;&#36149;&#12290;&#22312;&#26412;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#25512;&#29305;&#31561;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19978;&#24191;&#27867;&#12289;&#20016;&#23500;&#19988;&#24265;&#20215;&#30340;&#25968;&#25454;&#65292;&#26469;&#20102;&#35299;&#29992;&#25143;&#23545;&#21508;&#31181;&#26381;&#21153;&#38382;&#39064;&#30340;&#24863;&#30693;&#12290;&#25512;&#29305;&#20316;&#20026;&#19968;&#20010;&#24494;&#21338;&#24179;&#21488;&#65292;&#25176;&#31649;&#20102;&#22823;&#37327;&#23454;&#26102;&#30340;&#29992;&#25143;&#29983;&#25104;&#20869;&#23481;&#65292;&#20854;&#20013;&#32463;&#24120;&#21253;&#21547;&#26377;&#20851;&#21508;&#31181;&#20135;&#21697;&#12289;&#26381;&#21153;&#21644;&#20307;&#39564;&#30340;&#26377;&#20215;&#20540;&#30340;&#21453;&#39304;&#21644;&#24847;&#35265;&#12290;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#36890;&#36807;&#20004;&#31181;&#25216;&#26415;&#31616;&#21270;&#20102;&#25910;&#38598;&#21644;&#20998;&#26512;&#29992;&#25143;&#21453;&#39304;&#30340;&#36807;&#31243;&#65292;&#26080;&#38656;&#26114;&#36149;&#19988;&#32791;&#26102;&#30340;&#29992;&#25143;&#21453;&#39304;&#35843;&#26597;&#12290;&#39318;&#20808;&#65292;&#23427;&#21033;&#29992;&#23569;&#26679;&#26412;&#23398;&#20064;&#36827;&#34892;&#25512;&#29305;&#20998;&#31867;&#65292;&#26377;&#25928;&#22320;&#35782;&#21035;&#25512;&#29305;&#20013;&#25551;&#36848;&#30340;&#38382;&#39064;&#12290;&#28982;&#21518;&#65292;&#23427;&#37319;&#29992;&#22522;&#20110;&#35789;&#20856;&#30340;&#24773;&#24863;&#20998;&#26512;&#27169;&#22411;&#26469;&#35780;&#20272;&#25512;&#29305;&#24773;&#24863;&#30340;&#24378;&#24230;&#21644;&#26497;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Traditional methods of collecting user feedback through transit surveys are often time-consuming, resource intensive, and costly. In this paper, we propose a novel NLP-based framework that harnesses the vast, abundant, and inexpensive data available on social media platforms like Twitter to understand users' perceptions of various service issues. Twitter, being a microblogging platform, hosts a wealth of real-time user-generated content that often includes valuable feedback and opinions on various products, services, and experiences. The proposed framework streamlines the process of gathering and analyzing user feedback without the need for costly and time-consuming user feedback surveys using two techniques. First, it utilizes few-shot learning for tweet classification within predefined categories, allowing effective identification of the issues described in tweets. It then employs a lexicon-based sentiment analysis model to assess the intensity and polarity of the tweet sentiments, d
&lt;/p&gt;</description></item></channel></rss>