<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>Whisper-MCE&#26159;&#20351;&#29992;&#33258;&#24049;&#25910;&#38598;&#30340;&#28151;&#21512;&#31908;&#35821;&#21644;&#33521;&#35821;&#38899;&#39057;&#25968;&#25454;&#38598;&#65288;MCE&#65289;&#36827;&#34892;&#35757;&#32451;&#30340;Whisper&#27169;&#22411;&#24494;&#35843;&#65292;&#30456;&#36739;&#20110;&#22522;&#20934;&#27169;&#22411;&#65292;&#20854;&#22312;&#20934;&#30830;&#25429;&#25417;&#21407;&#22987;&#38899;&#39057;&#20869;&#23481;&#12289;&#25552;&#39640;&#35782;&#21035;&#20934;&#30830;&#24615;&#21644;&#21152;&#24555;&#35782;&#21035;&#36895;&#24230;&#26041;&#38754;&#20855;&#26377;&#26356;&#20248;&#36234;&#30340;&#33021;&#21147;&#65292;&#23588;&#20854;&#22312;&#28151;&#21512;&#35821;&#35328;&#35782;&#21035;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#33394;&#12290;</title><link>http://arxiv.org/abs/2310.17953</link><description>&lt;p&gt;
Whisper-MCE: &#38024;&#23545;&#28151;&#21512;&#35821;&#35328;&#23454;&#29616;&#26356;&#22909;&#24615;&#33021;&#30340;Whisper&#27169;&#22411;&#24494;&#35843;
&lt;/p&gt;
&lt;p&gt;
Whisper-MCE: Whisper Model Finetuned for Better Performance with Mixed Languages. (arXiv:2310.17953v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17953
&lt;/p&gt;
&lt;p&gt;
Whisper-MCE&#26159;&#20351;&#29992;&#33258;&#24049;&#25910;&#38598;&#30340;&#28151;&#21512;&#31908;&#35821;&#21644;&#33521;&#35821;&#38899;&#39057;&#25968;&#25454;&#38598;&#65288;MCE&#65289;&#36827;&#34892;&#35757;&#32451;&#30340;Whisper&#27169;&#22411;&#24494;&#35843;&#65292;&#30456;&#36739;&#20110;&#22522;&#20934;&#27169;&#22411;&#65292;&#20854;&#22312;&#20934;&#30830;&#25429;&#25417;&#21407;&#22987;&#38899;&#39057;&#20869;&#23481;&#12289;&#25552;&#39640;&#35782;&#21035;&#20934;&#30830;&#24615;&#21644;&#21152;&#24555;&#35782;&#21035;&#36895;&#24230;&#26041;&#38754;&#20855;&#26377;&#26356;&#20248;&#36234;&#30340;&#33021;&#21147;&#65292;&#23588;&#20854;&#22312;&#28151;&#21512;&#35821;&#35328;&#35782;&#21035;&#20219;&#21153;&#20013;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#65292;Whisper&#22312;&#33521;&#35821;&#33258;&#21160;&#35821;&#38899;&#35782;&#21035;&#65288;ASR&#65289;&#39046;&#22495;&#24050;&#32463;&#25509;&#36817;&#20110;&#20154;&#31867;&#32423;&#21035;&#30340;&#40065;&#26834;&#24615;&#21644;&#20934;&#30830;&#24615;&#65292;&#20294;&#22312;&#36739;&#23567;&#35821;&#31181;&#21644;&#28151;&#21512;&#35821;&#35328;&#30340;&#35821;&#38899;&#35782;&#21035;&#20013;&#65292;&#20173;&#28982;&#38656;&#35201;&#36827;&#19968;&#27493;&#25913;&#36827;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#25105;&#20204;&#32454;&#35843;&#30340;Whisper&#27169;&#22411;Whisper-MCE&#30340;&#20196;&#20154;&#30633;&#30446;&#30340;&#32467;&#26524;&#65292;&#35813;&#27169;&#22411;&#20351;&#29992;&#20102;&#25105;&#20204;&#33258;&#24049;&#25910;&#38598;&#30340;&#28151;&#21512;&#31908;&#35821;&#21644;&#33521;&#35821;&#38899;&#39057;&#25968;&#25454;&#38598;&#65288;MCE&#65289;&#36827;&#34892;&#35757;&#32451;&#12290;&#21516;&#26102;&#65292;&#32771;&#34385;&#21040;&#35789;&#38169;&#35823;&#29575;&#65288;WER&#65289;&#22312;&#36739;&#23567;&#35821;&#31181;&#21644;&#28151;&#21512;&#35821;&#35328;&#29615;&#22659;&#20013;&#35780;&#20272;&#20854;&#26377;&#25928;&#24615;&#26102;&#23384;&#22312;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35780;&#20272;&#26426;&#21046;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#27169;&#22411;&#19982;&#22522;&#20934;&#30340;whisper-large-v2&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#23427;&#20934;&#30830;&#25429;&#25417;&#21407;&#22987;&#38899;&#39057;&#20869;&#23481;&#30340;&#33021;&#21147;&#26356;&#24378;&#12289;&#35782;&#21035;&#20934;&#30830;&#24615;&#26356;&#39640;&#12289;&#35782;&#21035;&#36895;&#24230;&#26356;&#24555;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#35782;&#21035;&#28151;&#21512;&#35821;&#35328;&#30340;&#29305;&#23450;&#20219;&#21153;&#20013;&#32988;&#36807;&#20854;&#20182;&#29616;&#26377;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recently Whisper has approached human-level robustness and accuracy in English automatic speech recognition (ASR), while in minor language and mixed language speech recognition, there remains a compelling need for further improvement. In this work, we present the impressive results of Whisper-MCE, our finetuned Whisper model, which was trained using our self-collected dataset, Mixed Cantonese and English audio dataset (MCE). Meanwhile, considering word error rate (WER) poses challenges when it comes to evaluating its effectiveness in minor language and mixed-language contexts, we present a novel rating mechanism. By comparing our model to the baseline whisper-large-v2 model, we demonstrate its superior ability to accurately capture the content of the original audio, achieve higher recognition accuracy, and exhibit faster recognition speed. Notably, our model outperforms other existing models in the specific task of recognizing mixed language.
&lt;/p&gt;</description></item></channel></rss>