<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>QuanTest&#26159;&#19968;&#20010;&#22522;&#20110;&#32416;&#32544;&#30340;&#23545;&#25239;&#27979;&#35797;&#26694;&#26550;&#65292;&#26088;&#22312;&#25581;&#31034;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#31995;&#32479;&#20013;&#30340;&#28508;&#22312;&#38169;&#35823;&#34892;&#20026;&#12290;</title><link>https://arxiv.org/abs/2402.12950</link><description>&lt;p&gt;
QuanTest&#65306;&#22522;&#20110;&#32416;&#32544;&#30340;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#31995;&#32479;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
QuanTest: Entanglement-Guided Testing of Quantum Neural Network Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12950
&lt;/p&gt;
&lt;p&gt;
QuanTest&#26159;&#19968;&#20010;&#22522;&#20110;&#32416;&#32544;&#30340;&#23545;&#25239;&#27979;&#35797;&#26694;&#26550;&#65292;&#26088;&#22312;&#25581;&#31034;&#37327;&#23376;&#31070;&#32463;&#32593;&#32476;&#31995;&#32479;&#20013;&#30340;&#28508;&#22312;&#38169;&#35823;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Quantum Neural Network&#65288;QNN&#65289;&#23558;&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#21407;&#29702;&#19982;&#37327;&#23376;&#21147;&#23398;&#22522;&#26412;&#29702;&#35770;&#30456;&#32467;&#21512;&#65292;&#23454;&#29616;&#20855;&#26377;&#37327;&#23376;&#21152;&#36895;&#30340;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#12290; &#26368;&#36817;&#21457;&#29616;&#65292;QNN&#31995;&#32479;&#26377;&#31867;&#20284;&#20110;&#32463;&#20856;DL&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#38382;&#39064;&#12290; &#24613;&#38656;&#19968;&#31181;&#26041;&#27861;&#26469;&#27979;&#35797;&#23427;&#20204;&#30340;&#27491;&#30830;&#24615;&#21644;&#23433;&#20840;&#24615;&#12290; &#20294;&#26159;&#65292;QNN&#31995;&#32479;&#19982;&#20256;&#32479;&#37327;&#23376;&#36719;&#20214;&#21644;&#32463;&#20856;DL&#31995;&#32479;&#26377;&#24456;&#22823;&#19981;&#21516;&#65292;&#23545;QNN&#27979;&#35797;&#25552;&#20986;&#20102;&#37325;&#22823;&#25361;&#25112;&#12290; &#36825;&#20123;&#25361;&#25112;&#21253;&#25324;&#20256;&#32479;&#37327;&#23376;&#36719;&#20214;&#27979;&#35797;&#26041;&#27861;&#30340;&#19981;&#36866;&#29992;&#24615;&#65292;&#37327;&#23376;&#27979;&#35797;&#26679;&#26412;&#29983;&#25104;&#23545;&#25200;&#21160;&#31639;&#23376;&#30340;&#20381;&#36182;&#65292;&#20197;&#21450;&#37327;&#23376;&#31070;&#32463;&#20803;&#20013;&#32570;&#20047;&#26377;&#25928;&#20449;&#24687;&#12290; &#26412;&#25991;&#25552;&#20986;&#20102;QuanTest&#65292;&#36825;&#26159;&#19968;&#20010;&#22522;&#20110;&#37327;&#23376;&#32416;&#32544;&#30340;&#23545;&#25239;&#27979;&#35797;&#26694;&#26550;&#65292;&#29992;&#20110;&#21457;&#29616;QNN&#31995;&#32479;&#20013;&#28508;&#22312;&#30340;&#38169;&#35823;&#34892;&#20026;&#12290; &#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#37327;&#23376;&#32416;&#32544;&#20805;&#20998;&#24615;&#20934;&#21017;&#26469;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12950v1 Announce Type: cross  Abstract: Quantum Neural Network (QNN) combines the Deep Learning (DL) principle with the fundamental theory of quantum mechanics to achieve machine learning tasks with quantum acceleration. Recently, QNN systems have been found to manifest robustness issues similar to classical DL systems. There is an urgent need for ways to test their correctness and security. However, QNN systems differ significantly from traditional quantum software and classical DL systems, posing critical challenges for QNN testing. These challenges include the inapplicability of traditional quantum software testing methods, the dependence of quantum test sample generation on perturbation operators, and the absence of effective information in quantum neurons. In this paper, we propose QuanTest, a quantum entanglement-guided adversarial testing framework to uncover potential erroneous behaviors in QNN systems. We design a quantum entanglement adequacy criterion to quantify 
&lt;/p&gt;</description></item></channel></rss>