<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#26377;&#25928;&#30340;&#24322;&#36136;&#22270;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;SIMGA&#65292;&#23427;&#36890;&#36807;SimRank&#20840;&#23616;&#32858;&#21512;&#26469;&#35299;&#20915;&#24322;&#36136;&#24615;&#33410;&#28857;&#32858;&#21512;&#30340;&#38382;&#39064;&#65292;&#20855;&#26377;&#25509;&#36817;&#20110;&#32447;&#24615;&#30340;&#20256;&#25773;&#25928;&#29575;&#65292;&#21516;&#26102;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#25928;&#24615;&#21644;&#21487;&#25193;&#23637;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.09958</link><description>&lt;p&gt;
SIMGA&#65306;&#19968;&#31181;&#31616;&#21333;&#26377;&#25928;&#30340;&#24322;&#36136;&#22270;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#19982;&#39640;&#25928;&#30340;&#20840;&#23616;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
SIMGA: A Simple and Effective Heterophilous Graph Neural Network with Efficient Global Aggregation. (arXiv:2305.09958v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.09958
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#26377;&#25928;&#30340;&#24322;&#36136;&#22270;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;SIMGA&#65292;&#23427;&#36890;&#36807;SimRank&#20840;&#23616;&#32858;&#21512;&#26469;&#35299;&#20915;&#24322;&#36136;&#24615;&#33410;&#28857;&#32858;&#21512;&#30340;&#38382;&#39064;&#65292;&#20855;&#26377;&#25509;&#36817;&#20110;&#32447;&#24615;&#30340;&#20256;&#25773;&#25928;&#29575;&#65292;&#21516;&#26102;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#25928;&#24615;&#21644;&#21487;&#25193;&#23637;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#22270;&#23398;&#20064;&#39046;&#22495;&#21462;&#24471;&#20102;&#24040;&#22823;&#25104;&#21151;&#65292;&#20294;&#36935;&#21040;&#24322;&#36136;&#24615;&#26102;&#20250;&#20986;&#29616;&#24615;&#33021;&#19979;&#38477;&#65292;&#21363;&#22240;&#20026;&#23616;&#37096;&#21644;&#32479;&#19968;&#32858;&#21512;&#32780;&#23548;&#33268;&#30340;&#30456;&#37051;&#33410;&#28857;&#19981;&#30456;&#20284;&#12290;&#29616;&#26377;&#30340;&#24322;&#36136;&#24615;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#65292;&#35797;&#22270;&#25972;&#21512;&#20840;&#23616;&#32858;&#21512;&#30340;&#23581;&#35797;&#36890;&#24120;&#38656;&#35201;&#36845;&#20195;&#22320;&#32500;&#25252;&#21644;&#26356;&#26032;&#20840;&#22270;&#20449;&#24687;&#65292;&#23545;&#20110;&#19968;&#20010;&#20855;&#26377; $n$ &#20010;&#33410;&#28857;&#30340;&#22270;&#65292;&#36825;&#38656;&#35201; $\mathcal{O}(n^2)$ &#30340;&#35745;&#31639;&#25928;&#29575;&#65292;&#20174;&#32780;&#23548;&#33268;&#23545;&#22823;&#22411;&#22270;&#30340;&#25193;&#23637;&#24615;&#36739;&#24046;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102; SIMGA&#65292;&#19968;&#31181;&#23558; SimRank &#32467;&#26500;&#30456;&#20284;&#24230;&#27979;&#37327;&#20316;&#20026;&#20840;&#23616;&#32858;&#21512;&#30340; GNN &#32467;&#26500;&#12290; SIMGA &#30340;&#35774;&#35745;&#31616;&#21333;&#65292;&#19988;&#22312;&#25928;&#29575;&#21644;&#26377;&#25928;&#24615;&#26041;&#38754;&#37117;&#26377;&#30528;&#26377; promising &#30340;&#32467;&#26524;&#12290;SIMGA &#30340;&#31616;&#21333;&#24615;&#20351;&#20854;&#25104;&#20026;&#31532;&#19968;&#20010;&#21487;&#20197;&#23454;&#29616;&#25509;&#36817;&#20110;&#32447;&#24615;&#30340; $n$ &#20256;&#25773;&#25928;&#29575;&#30340;&#24322;&#36136;&#24615; GNN &#27169;&#22411;&#12290;&#25105;&#20204;&#20174;&#29702;&#35770;&#19978;&#35777;&#26126;&#20102;&#23427;&#30340;&#26377;&#25928;&#24615;&#65292;&#23558; SimRank &#35270;&#20026; GNN &#30340;&#19968;&#31181;&#26032;&#35299;&#37322;&#65292;&#24182;&#35777;&#26126;&#20102;&#27719;&#32858;&#33410;&#28857;&#34920;&#31034;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph neural networks (GNNs) realize great success in graph learning but suffer from performance loss when meeting heterophily, i.e. neighboring nodes are dissimilar, due to their local and uniform aggregation. Existing attempts in incoorporating global aggregation for heterophilous GNNs usually require iteratively maintaining and updating full-graph information, which entails $\mathcal{O}(n^2)$ computation efficiency for a graph with $n$ nodes, leading to weak scalability to large graphs. In this paper, we propose SIMGA, a GNN structure integrating SimRank structural similarity measurement as global aggregation. The design of SIMGA is simple, yet it leads to promising results in both efficiency and effectiveness. The simplicity of SIMGA makes it the first heterophilous GNN model that can achieve a propagation efficiency near-linear to $n$. We theoretically demonstrate its effectiveness by treating SimRank as a new interpretation of GNN and prove that the aggregated node representation
&lt;/p&gt;</description></item></channel></rss>