<rss version="2.0"><channel><title>Chat Arxiv cs.SC</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SC</description><item><title>&#26412;&#35770;&#25991;&#25253;&#21578;&#20102;&#20851;&#20110;&#27491;&#24335;&#21270;&#26465;&#20214;&#25512;&#29702;&#30340;&#30740;&#31350;&#32467;&#26524;&#65292;&#21253;&#25324;Aqvist&#30340;&#26465;&#20214;&#20041;&#21153;&#31995;&#32479;E&#30340;&#26426;&#26800;&#21270;&#21644;&#20262;&#29702;&#35770;&#25454;&#35780;&#20272;&#30340;&#24037;&#20855;&#30340;&#24320;&#21457;&#12290;</title><link>http://arxiv.org/abs/2308.10686</link><description>&lt;p&gt;
&#24635;&#25324;&#33655;&#23572;&#33945;&#20307;&#31995;&#20316;&#20026;HOL&#30340;&#19968;&#20010;&#29255;&#27573;
&lt;/p&gt;
&lt;p&gt;
Normative Conditional Reasoning as a Fragment of HOL. (arXiv:2308.10686v2 [cs.LO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10686
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25253;&#21578;&#20102;&#20851;&#20110;&#27491;&#24335;&#21270;&#26465;&#20214;&#25512;&#29702;&#30340;&#30740;&#31350;&#32467;&#26524;&#65292;&#21253;&#25324;Aqvist&#30340;&#26465;&#20214;&#20041;&#21153;&#31995;&#32479;E&#30340;&#26426;&#26800;&#21270;&#21644;&#20262;&#29702;&#35770;&#25454;&#35780;&#20272;&#30340;&#24037;&#20855;&#30340;&#24320;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25253;&#21578;&#20102;&#20851;&#20110;&#27491;&#24335;&#21270;&#65288;&#22522;&#20110;&#20559;&#22909;&#30340;&#65289;&#26465;&#20214;&#25512;&#29702;&#30340;&#19968;&#20123;&#32467;&#26524;&#12290;&#25105;&#20204;&#20851;&#27880;&#30340;&#26159;Aqvist&#30340;&#26465;&#20214;&#20041;&#21153;&#31995;&#32479;E&#65288;&#21450;&#20854;&#25193;&#23637;&#65289;&#12290;&#25105;&#20204;&#36890;&#36807;Isabelle/HOL&#20013;&#30340;&#27973;&#34920;&#35821;&#20041;&#23884;&#20837;&#26469;&#23454;&#29616;&#25105;&#20204;&#30340;&#27491;&#24335;&#21270;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#35813;&#26694;&#26550;&#30340;&#20004;&#31181;&#21487;&#33021;&#29992;&#36884;&#12290;&#31532;&#19968;&#31181;&#26159;&#20316;&#20026;&#23545;&#25152;&#32771;&#34385;&#36923;&#36753;&#36827;&#34892;&#20803;&#25512;&#29702;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#23558;&#20854;&#29992;&#20110;&#33258;&#21160;&#39564;&#35777;&#26435;&#21033;&#20041;&#21153;&#23545;&#24212;&#20851;&#31995;&#65288;&#24191;&#20041;&#19978;&#29702;&#35299;&#65289;&#21450;&#30456;&#20851;&#20107;&#39033;&#65292;&#31867;&#20284;&#20110;&#20043;&#21069;&#23545;&#27169;&#24577;&#36923;&#36753;&#31435;&#26041;&#20307;&#25152;&#21462;&#24471;&#30340;&#25104;&#26524;&#12290;&#31532;&#20108;&#31181;&#29992;&#36884;&#26159;&#20316;&#20026;&#20262;&#29702;&#35770;&#25454;&#35780;&#20272;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20154;&#21475;&#20262;&#29702;&#23398;&#20013;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#24726;&#35770;Parfit&#30340;&#20196;&#20154;&#21388;&#24694;&#30340;&#32467;&#35770;&#30340;&#35745;&#31639;&#26426;&#32534;&#30721;&#12290;&#22914;&#20309;&#36890;&#36807;&#36825;&#20010;&#32534;&#30721;&#22686;&#21152;&#25110;&#20943;&#23569;&#20196;&#20154;&#21388;&#24694;&#30340;&#32467;&#35770;&#30340;&#21560;&#24341;&#21147;&#21644;&#35828;&#26381;&#21147;&#26159;&#19968;&#20010;&#25105;&#20204;&#24076;&#26395;&#21521;&#21746;&#23398;&#21644;&#20262;&#29702;&#23398;&#25552;&#20986;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We report some results regarding the mechanization of normative (preference-based) conditional reasoning. Our focus is on Aqvist's system E for conditional obligation (and its extensions). Our mechanization is achieved via a shallow semantical embedding in Isabelle/HOL. We consider two possible uses of the framework. The first one is as a tool for meta-reasoning about the considered logic. We employ it for the automated verification of deontic correspondences (broadly conceived) and related matters, analogous to what has been previously achieved for the modal logic cube. The second use is as a tool for assessing ethical arguments. We provide a computer encoding of a well-known paradox in population ethics, Parfit's repugnant conclusion. Whether the presented encoding increases or decreases the attractiveness and persuasiveness of the repugnant conclusion is a question we would like to pass on to philosophy and ethics.
&lt;/p&gt;</description></item></channel></rss>