<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#24037;&#19994;&#30028;&#30340;&#30740;&#31350;&#22242;&#38431;&#22312;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#20013;&#26377;&#26356;&#39640;&#30340;&#20851;&#27880;&#24230;&#21644;&#24341;&#29992;&#29575;&#65292;&#19988;&#26356;&#26377;&#21487;&#33021;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#27169;&#22411;&#12290;&#32780;&#23398;&#26415;&#30028;&#30340;&#22242;&#38431;&#21017;&#26356;&#20542;&#21521;&#20110;&#20135;&#29983;&#20855;&#26377;&#26356;&#39640;&#31243;&#24230;&#21019;&#26032;&#30340;&#24037;&#20316;&#65292;&#20986;&#29616;&#38750;&#24120;&#19981;&#23547;&#24120;&#21644;&#20856;&#22411;&#30340;&#35770;&#25991;&#12290;&#36825;&#31181;&#24433;&#21709;&#21147;-&#21019;&#26032;&#24230;&#20248;&#21183;&#22312;&#19981;&#21516;&#39046;&#22495;&#12289;&#22242;&#38431;&#35268;&#27169;&#12289;&#36164;&#21382;&#21644;&#22768;&#26395;&#19979;&#22343;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2401.10268</link><description>&lt;p&gt;
&#23398;&#26415;&#30028;&#21644;&#24037;&#19994;&#30028;&#23545;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#30340;&#20114;&#34917;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
The complementary contributions of academia and industry to AI research. (arXiv:2401.10268v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10268
&lt;/p&gt;
&lt;p&gt;
&#24037;&#19994;&#30028;&#30340;&#30740;&#31350;&#22242;&#38431;&#22312;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#20013;&#26377;&#26356;&#39640;&#30340;&#20851;&#27880;&#24230;&#21644;&#24341;&#29992;&#29575;&#65292;&#19988;&#26356;&#26377;&#21487;&#33021;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#27169;&#22411;&#12290;&#32780;&#23398;&#26415;&#30028;&#30340;&#22242;&#38431;&#21017;&#26356;&#20542;&#21521;&#20110;&#20135;&#29983;&#20855;&#26377;&#26356;&#39640;&#31243;&#24230;&#21019;&#26032;&#30340;&#24037;&#20316;&#65292;&#20986;&#29616;&#38750;&#24120;&#19981;&#23547;&#24120;&#21644;&#20856;&#22411;&#30340;&#35770;&#25991;&#12290;&#36825;&#31181;&#24433;&#21709;&#21147;-&#21019;&#26032;&#24230;&#20248;&#21183;&#22312;&#19981;&#21516;&#39046;&#22495;&#12289;&#22242;&#38431;&#35268;&#27169;&#12289;&#36164;&#21382;&#21644;&#22768;&#26395;&#19979;&#22343;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22312;&#24037;&#19994;&#30028;&#21644;&#23398;&#26415;&#30028;&#20013;&#37117;&#21462;&#24471;&#20102;&#24040;&#22823;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#24037;&#19994;&#30028;&#36817;&#26399;&#30340;&#31361;&#30772;&#24615;&#36827;&#23637;&#24341;&#36215;&#20102;&#20154;&#20204;&#23545;&#23398;&#26415;&#30740;&#31350;&#22312;&#35813;&#39046;&#22495;&#20013;&#30340;&#20316;&#29992;&#30340;&#26032;&#35270;&#35282;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23545;&#36807;&#21435;25&#24180;&#20013;&#20004;&#20010;&#29615;&#22659;&#20013;&#20135;&#29983;&#30340;&#20154;&#24037;&#26234;&#33021;&#30340;&#24433;&#21709;&#21644;&#31867;&#22411;&#36827;&#34892;&#20102;&#25551;&#36848;&#65292;&#24182;&#24314;&#31435;&#20102;&#20960;&#31181;&#27169;&#24335;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30001;&#24037;&#19994;&#30028;&#30740;&#31350;&#20154;&#21592;&#32452;&#25104;&#30340;&#22242;&#38431;&#21457;&#34920;&#30340;&#25991;&#31456;&#24448;&#24448;&#26356;&#21463;&#20851;&#27880;&#65292;&#20855;&#26377;&#26356;&#39640;&#30340;&#34987;&#24341;&#29992;&#21644;&#24341;&#21457;&#24341;&#29992;&#39072;&#35206;&#30340;&#21487;&#33021;&#24615;&#65292;&#19988;&#26356;&#26377;&#21487;&#33021;&#20135;&#29983;&#26368;&#20808;&#36827;&#30340;&#27169;&#22411;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;&#32431;&#23398;&#26415;&#22242;&#38431;&#21457;&#34920;&#20102;&#22823;&#37096;&#20998;&#30340;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#65292;&#24182;&#20542;&#21521;&#20110;&#20135;&#29983;&#26356;&#39640;&#31243;&#24230;&#30340;&#21019;&#26032;&#24037;&#20316;&#65292;&#21333;&#31687;&#35770;&#25991;&#26377;&#25968;&#20493;&#30340;&#21487;&#33021;&#24615;&#26159;&#38750;&#24120;&#19981;&#23547;&#24120;&#21644;&#20856;&#22411;&#30340;&#12290;&#24037;&#19994;&#30028;&#21644;&#23398;&#26415;&#30028;&#22312;&#24433;&#21709;&#21147;-&#21019;&#26032;&#24230;&#26041;&#38754;&#30340;&#20248;&#21183;&#19981;&#21463;&#23376;&#39046;&#22495;&#12289;&#22242;&#38431;&#35268;&#27169;&#12289;&#36164;&#21382;&#21644;&#22768;&#26395;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#23398;&#26415;&#30028;&#20135;&#29983;&#20102;&#26356;&#22810;&#32508;&#36848;&#21644;&#20998;&#26512;&#22411;&#35770;&#25991;&#65292;&#32780;&#24037;&#19994;&#30028;&#21017;&#26356;&#22810;&#22320;&#27880;&#37325;&#24212;&#29992;&#21644;&#25216;&#26415;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) has seen tremendous development in industry and academia. However, striking recent advances by industry have stunned the world, inviting a fresh perspective on the role of academic research in this field. Here, we characterize the impact and type of AI produced by both environments over the last 25 years and establish several patterns. We find that articles published by teams consisting exclusively of industry researchers tend to get greater attention, with a higher chance of being highly cited and citation-disruptive, and several times more likely to produce state-of-the-art models. In contrast, we find that exclusively academic teams publish the bulk of AI research and tend to produce higher novelty work, with single papers having several times higher likelihood of being unconventional and atypical. The respective impact-novelty advantages of industry and academia are robust to controls for subfield, team size, seniority, and prestige. We find that academ
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#37319;&#29992;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#65292;&#36866;&#29992;&#20110;&#24322;&#36136;&#24615;&#22270;&#21644;&#21516;&#36136;&#24615;&#22270;&#65292;&#24182;&#22312;&#35768;&#22810;&#26631;&#20934;&#25968;&#25454;&#38598;&#19978;&#23637;&#31034;&#20986;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2305.18385</link><description>&lt;p&gt;
&#33258;&#27880;&#24847;&#21147;&#21452;&#37325;&#23884;&#20837;&#65306;&#36866;&#29992;&#20110;&#24322;&#36136;&#24615;&#22270;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Self-attention Dual Embedding for Graphs with Heterophily. (arXiv:2305.18385v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18385
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#37319;&#29992;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#65292;&#36866;&#29992;&#20110;&#24322;&#36136;&#24615;&#22270;&#21644;&#21516;&#36136;&#24615;&#22270;&#65292;&#24182;&#22312;&#35768;&#22810;&#26631;&#20934;&#25968;&#25454;&#38598;&#19978;&#23637;&#31034;&#20986;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#22312;&#33410;&#28857;&#20998;&#31867;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#37325;&#22823;&#25104;&#21151;&#12290;GNNs&#36890;&#24120;&#20551;&#35774;&#22270;&#26159;&#21516;&#36136;&#30340;&#65292;&#21363;&#30456;&#37051;&#33410;&#28857;&#24456;&#21487;&#33021;&#23646;&#20110;&#30456;&#21516;&#30340;&#31867;&#21035;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#30495;&#23454;&#19990;&#30028;&#30340;&#22270;&#37117;&#26159;&#24322;&#36136;&#30340;&#65292;&#36825;&#23548;&#33268;&#20351;&#29992;&#26631;&#20934;&#30340;GNNs&#26102;&#20998;&#31867;&#31934;&#24230;&#35201;&#20302;&#24471;&#22810;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;GNN&#65292;&#23427;&#23545;&#24322;&#36136;&#24615;&#21644;&#21516;&#36136;&#24615;&#22270;&#37117;&#26377;&#25928;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#22522;&#20110;&#19977;&#20010;&#20027;&#35201;&#35266;&#23519;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#19981;&#21516;&#30340;&#22270;&#20013;&#65292;&#33410;&#28857;&#29305;&#24449;&#21644;&#22270;&#25299;&#25169;&#25552;&#20379;&#19981;&#21516;&#25968;&#37327;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#24212;&#35813;&#29420;&#31435;&#32534;&#30721;&#24182;&#20197;&#33258;&#36866;&#24212;&#26041;&#24335;&#20248;&#20808;&#32423;&#21270;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#24403;&#20256;&#25773;&#22270;&#25299;&#25169;&#20449;&#24687;&#26102;&#20801;&#35768;&#36127;&#30340;&#27880;&#24847;&#26435;&#37325;&#21487;&#20197;&#25552;&#39640;&#31934;&#24230;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#33410;&#28857;&#20043;&#38388;&#19981;&#23545;&#31216;&#30340;&#27880;&#24847;&#26435;&#37325;&#26159;&#26377;&#24110;&#21161;&#30340;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;GNN&#65292;&#21033;&#29992;&#36825;&#20123;&#35266;&#23519;&#32467;&#26524;&#36890;&#36807;&#26032;&#39062;&#30340;&#33258;&#27880;&#24847;&#21147;&#26426;&#21046;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#31639;&#27861;&#22312;&#19968;&#20123;&#26631;&#20934;&#30340;&#33410;&#28857;&#20998;&#31867;&#25968;&#25454;&#38598;&#19978;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#21516;&#36136;&#24615;&#21644;&#24322;&#36136;&#24615;&#22270;&#19978;&#30340;&#26368;&#26032;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Networks (GNNs) have been highly successful for the node classification task. GNNs typically assume graphs are homophilic, i.e. neighboring nodes are likely to belong to the same class. However, a number of real-world graphs are heterophilic, and this leads to much lower classification accuracy using standard GNNs. In this work, we design a novel GNN which is effective for both heterophilic and homophilic graphs. Our work is based on three main observations. First, we show that node features and graph topology provide different amounts of informativeness in different graphs, and therefore they should be encoded independently and prioritized in an adaptive manner. Second, we show that allowing negative attention weights when propagating graph topology information improves accuracy. Finally, we show that asymmetric attention weights between nodes are helpful. We design a GNN which makes use of these observations through a novel self-attention mechanism. We evaluate our algor
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;Grad-Align+&#26041;&#27861;&#65292;&#36890;&#36807;&#22686;&#24378;&#33410;&#28857;&#29305;&#24449;&#26469;&#25191;&#34892;NA&#20219;&#21153;&#65292;&#24182;&#26368;&#22823;&#38480;&#24230;&#22320;&#21033;&#29992;&#22686;&#24378;&#30340;&#33410;&#28857;&#29305;&#24449;&#26469;&#35774;&#35745;NA&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;NA&#26041;&#27861;&#32570;&#20047;&#39069;&#22806;&#20449;&#24687;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.12751</link><description>&lt;p&gt;
&#33410;&#28857;&#29305;&#24449;&#22686;&#24378;&#25913;&#36827;&#32593;&#32476;&#23545;&#40784;
&lt;/p&gt;
&lt;p&gt;
Node Feature Augmentation Vitaminizes Network Alignment. (arXiv:2304.12751v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.12751
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;Grad-Align+&#26041;&#27861;&#65292;&#36890;&#36807;&#22686;&#24378;&#33410;&#28857;&#29305;&#24449;&#26469;&#25191;&#34892;NA&#20219;&#21153;&#65292;&#24182;&#26368;&#22823;&#38480;&#24230;&#22320;&#21033;&#29992;&#22686;&#24378;&#30340;&#33410;&#28857;&#29305;&#24449;&#26469;&#35774;&#35745;NA&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;NA&#26041;&#27861;&#32570;&#20047;&#39069;&#22806;&#20449;&#24687;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#23545;&#40784;&#65288;NA&#65289;&#26159;&#36890;&#36807;&#32473;&#23450;&#32593;&#32476;&#30340;&#25299;&#25169;&#21644;/&#25110;&#29305;&#24449;&#20449;&#24687;&#26469;&#21457;&#29616;&#22810;&#20010;&#32593;&#32476;&#20043;&#38388;&#30340;&#33410;&#28857;&#23545;&#24212;&#20851;&#31995;&#30340;&#20219;&#21153;&#12290;&#34429;&#28982;NA&#26041;&#27861;&#22312;&#21508;&#31181;&#22330;&#26223;&#19979;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25104;&#21151;&#65292;&#20294;&#20854;&#26377;&#25928;&#24615;&#24182;&#19981;&#24635;&#26159;&#26377;&#39069;&#22806;&#20449;&#24687;&#65292;&#22914;&#20808;&#21069;&#30340;&#38170;&#28857;&#38142;&#25509;&#21644;/&#25110;&#33410;&#28857;&#29305;&#24449;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#23454;&#38469;&#30340;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Grad-Align+&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;NA&#26041;&#27861;&#65292;&#24314;&#31435;&#22312;&#26368;&#36817;&#19968;&#31181;&#26368;&#20808;&#36827;&#30340;NA&#26041;&#27861;Grad-Align&#20043;&#19978;&#65292;Grad-Align+&#20165;&#36880;&#27493;&#21457;&#29616;&#37096;&#20998;&#33410;&#28857;&#23545;&#65292;&#30452;&#21040;&#25214;&#21040;&#25152;&#26377;&#33410;&#28857;&#23545;&#12290;&#22312;&#35774;&#35745;Grad-Align+&#26102;&#65292;&#25105;&#20204;&#32771;&#34385;&#22914;&#20309;&#36890;&#36807;&#22686;&#24378;&#33410;&#28857;&#29305;&#24449;&#26469;&#25191;&#34892;NA&#20219;&#21153;&#65292;&#24182;&#26368;&#22823;&#38480;&#24230;&#22320;&#21033;&#29992;&#22686;&#24378;&#30340;&#33410;&#28857;&#29305;&#24449;&#26469;&#35774;&#35745;NA&#26041;&#27861;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#20010;&#30446;&#26631;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#30001;&#19977;&#20010;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#32452;&#25104;&#30340;Grad-Align+&#65306;&#22522;&#20110;&#20013;&#24515;&#24615;&#30340;&#33410;&#28857;&#29305;&#24449;&#22686;&#24378;&#65288;CNFA&#65289;&#12289;&#22270;&#20999;&#29255;&#29983;&#25104;&#21644;&#20248;&#21270;&#33410;&#28857;&#23884;&#20837;&#29305;&#24449;&#65288;ONIFE&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Network alignment (NA) is the task of discovering node correspondences across multiple networks using topological and/or feature information of given networks. Although NA methods have achieved remarkable success in a myriad of scenarios, their effectiveness is not without additional information such as prior anchor links and/or node features, which may not always be available due to privacy concerns or access restrictions. To tackle this practical challenge, we propose Grad-Align+, a novel NA method built upon a recent state-of-the-art NA method, the so-called Grad-Align, that gradually discovers only a part of node pairs until all node pairs are found. In designing Grad-Align+, we account for how to augment node features in the sense of performing the NA task and how to design our NA method by maximally exploiting the augmented node features. To achieve this goal, we develop Grad-Align+ consisting of three key components: 1) centrality-based node feature augmentation (CNFA), 2) graph
&lt;/p&gt;</description></item></channel></rss>