<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#29992;&#25143;&#20026;&#20309;&#20998;&#20139;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#20167;&#24680;&#35328;&#35770;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#20998;&#26512;&#26694;&#26550;&#65292;&#36890;&#36807;&#28040;&#38500;&#25968;&#25454;&#20559;&#24046;&#21644;&#27169;&#25311;&#29992;&#25143;&#33030;&#24369;&#24615;&#26469;&#25581;&#31034;&#24433;&#21709;&#29992;&#25143;&#20998;&#20139;&#34892;&#20026;&#30340;&#22240;&#32032;&#12290;</title><link>http://arxiv.org/abs/2310.15772</link><description>&lt;p&gt;
&#29992;&#25143;&#22312;&#31038;&#20132;&#23186;&#20307;&#19978;&#20998;&#20139;&#20167;&#24680;&#35328;&#35770;&#30340;&#22240;&#26524;&#29702;&#35299;
&lt;/p&gt;
&lt;p&gt;
Causal Understanding of Why Users Share Hate Speech on Social Media. (arXiv:2310.15772v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15772
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#29992;&#25143;&#20026;&#20309;&#20998;&#20139;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#20167;&#24680;&#35328;&#35770;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#20998;&#26512;&#26694;&#26550;&#65292;&#36890;&#36807;&#28040;&#38500;&#25968;&#25454;&#20559;&#24046;&#21644;&#27169;&#25311;&#29992;&#25143;&#33030;&#24369;&#24615;&#26469;&#25581;&#31034;&#24433;&#21709;&#29992;&#25143;&#20998;&#20139;&#34892;&#20026;&#30340;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#20167;&#24680;&#35328;&#35770;&#23041;&#32961;&#21040;&#20010;&#20154;&#30340;&#24515;&#29702;&#21644;&#36523;&#20307;&#20581;&#24247;&#65292;&#24182;&#19988;&#36827;&#19968;&#27493;&#23548;&#33268;&#29616;&#23454;&#20013;&#30340;&#26292;&#21147;&#20107;&#20214;&#12290;&#20167;&#24680;&#35328;&#35770;&#20256;&#25773;&#32972;&#21518;&#30340;&#37325;&#35201;&#39537;&#21160;&#22240;&#32032;&#26159;&#36716;&#21457;&#65292;&#20294;&#26159;&#20154;&#20204;&#24456;&#23569;&#20102;&#35299;&#20026;&#20160;&#20040;&#29992;&#25143;&#20250;&#36716;&#21457;&#20167;&#24680;&#35328;&#35770;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20840;&#38754;&#12289;&#22240;&#26524;&#20998;&#26512;&#30340;&#29992;&#25143;&#23646;&#24615;&#26694;&#26550;&#65292;&#30740;&#31350;&#29992;&#25143;&#20026;&#20309;&#20998;&#20139;&#20167;&#24680;&#35328;&#35770;&#12290;&#28982;&#32780;&#65292;&#22312;&#20174;&#31038;&#20132;&#23186;&#20307;&#25968;&#25454;&#20013;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#26102;&#23384;&#22312;&#19968;&#20123;&#25361;&#25112;&#65292;&#22240;&#20026;&#36825;&#31867;&#25968;&#25454;&#24456;&#21487;&#33021;&#23384;&#22312;&#36873;&#25321;&#20559;&#24046;&#65292;&#24182;&#19988;&#29992;&#25143;&#23545;&#20167;&#24680;&#35328;&#35770;&#30340;&#33030;&#24369;&#24615;&#23384;&#22312;&#28151;&#28102;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#19977;&#27493;&#22240;&#26524;&#26694;&#26550;&#65306;&#65288;1&#65289;&#25105;&#20204;&#36890;&#36807;&#36870;&#21521;&#20542;&#21521;&#35780;&#20998;&#26469;&#28040;&#38500;&#35266;&#23519;&#24615;&#31038;&#20132;&#23186;&#20307;&#25968;&#25454;&#30340;&#20559;&#24046;&#12290;&#65288;2&#65289;&#25105;&#20204;&#20351;&#29992;&#28040;&#38500;&#20559;&#24046;&#30340;&#20542;&#21521;&#35780;&#20998;&#26469;&#27169;&#25311;&#29992;&#25143;&#23545;&#20167;&#24680;&#35328;&#35770;&#30340;&#28508;&#22312;&#33030;&#24369;&#24615;&#20316;&#20026;&#28508;&#22312;&#23884;&#20837;&#12290;&#65288;3&#65289;&#25105;&#20204;&#24314;&#31435;&#20102;&#29992;&#25143;&#23646;&#24615;&#23545;&#29992;&#25143;&#20998;&#20139;&#20167;&#24680;&#35328;&#35770;&#27010;&#29575;&#30340;&#22240;&#26524;&#25928;&#24212;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hate speech on social media threatens the mental and physical well-being of individuals and is further responsible for real-world violence. An important driver behind the spread of hate speech and thus why hateful posts can go viral are reshares, yet little is known about why users reshare hate speech. In this paper, we present a comprehensive, causal analysis of the user attributes that make users reshare hate speech. However, causal inference from observational social media data is challenging, because such data likely suffer from selection bias, and there is further confounding due to differences in the vulnerability of users to hate speech. We develop a novel, three-step causal framework: (1) We debias the observational social media data by applying inverse propensity scoring. (2) We use the debiased propensity scores to model the latent vulnerability of users to hate speech as a latent embedding. (3) We model the causal effects of user attributes on users' probability of sharing h
&lt;/p&gt;</description></item><item><title>&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#21024;&#38500;&#25237;&#31080;&#22270;&#20013;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#24471;&#20986;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#30340;&#21807;&#19968;&#25490;&#24207;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.15702</link><description>&lt;p&gt;
&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#65306;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Strong Maximum Circulation Algorithm: A New Method for Aggregating Preference Rankings. (arXiv:2307.15702v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15702
&lt;/p&gt;
&lt;p&gt;
&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#21024;&#38500;&#25237;&#31080;&#22270;&#20013;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#24471;&#20986;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#30340;&#21807;&#19968;&#25490;&#24207;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#27599;&#20010;&#20915;&#31574;&#32773;&#25110;&#36873;&#27665;&#23545;&#19968;&#23545;&#36873;&#25321;&#36827;&#34892;&#20559;&#22909;&#34920;&#36798;&#30340;&#24773;&#20917;&#19979;&#38598;&#25104;&#20559;&#22909;&#12290;&#25361;&#25112;&#22312;&#20110;&#22312;&#19968;&#20123;&#20914;&#31361;&#30340;&#25237;&#31080;&#24773;&#20917;&#19979;&#65292;&#23613;&#21487;&#33021;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#22320;&#24471;&#20986;&#19968;&#20010;&#25490;&#24207;&#12290;&#21482;&#26377;&#19981;&#21253;&#21547;&#29615;&#36335;&#30340;&#25237;&#31080;&#38598;&#21512;&#25165;&#26159;&#38750;&#20914;&#31361;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#22312;&#36873;&#25321;&#20043;&#38388;&#24341;&#21457;&#19968;&#20010;&#37096;&#20998;&#39034;&#24207;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#22522;&#20110;&#36825;&#26679;&#19968;&#20010;&#35266;&#23519;&#65306;&#26500;&#25104;&#19968;&#20010;&#29615;&#36335;&#30340;&#25237;&#31080;&#38598;&#21512;&#21487;&#20197;&#34987;&#35270;&#20026;&#24179;&#23616;&#12290;&#28982;&#21518;&#65292;&#26041;&#27861;&#26159;&#20174;&#25237;&#31080;&#22270;&#20013;&#21024;&#38500;&#29615;&#36335;&#30340;&#24182;&#38598;&#65292;&#24182;&#26681;&#25454;&#21097;&#20313;&#37096;&#20998;&#30830;&#23450;&#38598;&#25104;&#20559;&#22909;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#23427;&#30001;&#19968;&#32452;&#29615;&#36335;&#30340;&#24182;&#38598;&#24418;&#25104;&#65292;&#21024;&#38500;&#23427;&#21487;&#20197;&#20445;&#35777;&#22312;&#24341;&#21457;&#30340;&#37096;&#20998;&#39034;&#24207;&#20013;&#33719;&#24471;&#21807;&#19968;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#21253;&#21547;&#22312;&#28040;&#38500;&#20219;&#20309;&#26368;&#22823;&#29615;&#36335;&#21518;&#21097;&#19979;&#30340;&#25152;&#26377;&#38598;&#25104;&#20559;&#22909;&#12290;&#19982;&#20043;&#30456;&#21453;&#30340;&#26159;&#65292;wel
&lt;/p&gt;
&lt;p&gt;
We present a new optimization-based method for aggregating preferences in settings where each decision maker, or voter, expresses preferences over pairs of alternatives. The challenge is to come up with a ranking that agrees as much as possible with the votes cast in cases when some of the votes conflict. Only a collection of votes that contains no cycles is non-conflicting and can induce a partial order over alternatives. Our approach is motivated by the observation that a collection of votes that form a cycle can be treated as ties. The method is then to remove unions of cycles of votes, or circulations, from the vote graph and determine aggregate preferences from the remainder.  We introduce the strong maximum circulation which is formed by a union of cycles, the removal of which guarantees a unique outcome in terms of the induced partial order. Furthermore, it contains all the aggregate preferences remaining following the elimination of any maximum circulation. In contrast, the wel
&lt;/p&gt;</description></item></channel></rss>