<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>SPIRIT-LM&#26159;&#19968;&#20010;&#22522;&#20110;&#39044;&#35757;&#32451;&#25991;&#26412;&#35821;&#35328;&#27169;&#22411;&#30340;&#22810;&#27169;&#24577;&#35821;&#35328;&#27169;&#22411;&#65292;&#36890;&#36807;&#23558;&#25991;&#26412;&#21644;&#35821;&#38899;&#36830;&#32493;&#35757;&#32451;&#65292;&#23454;&#29616;&#20102;&#21475;&#35821;&#21644;&#20070;&#38754;&#35821;&#35328;&#30340;&#28151;&#21512;&#27169;&#22411;&#12290;&#23427;&#23637;&#31034;&#20102;&#25991;&#26412;&#27169;&#22411;&#30340;&#35821;&#20041;&#33021;&#21147;&#21644;&#35821;&#38899;&#27169;&#22411;&#30340;&#34920;&#29616;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;SPIRIT-LM&#36824;&#33021;&#20197;&#23569;&#37327;&#26679;&#26412;&#30340;&#26041;&#24335;&#23398;&#20064;&#26032;&#20219;&#21153;&#12290;</title><link>https://arxiv.org/abs/2402.05755</link><description>&lt;p&gt;
SpiRit-LM: &#20132;&#32455;&#30340;&#21475;&#35821;&#21644;&#20070;&#38754;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
SpiRit-LM: Interleaved Spoken and Written Language Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05755
&lt;/p&gt;
&lt;p&gt;
SPIRIT-LM&#26159;&#19968;&#20010;&#22522;&#20110;&#39044;&#35757;&#32451;&#25991;&#26412;&#35821;&#35328;&#27169;&#22411;&#30340;&#22810;&#27169;&#24577;&#35821;&#35328;&#27169;&#22411;&#65292;&#36890;&#36807;&#23558;&#25991;&#26412;&#21644;&#35821;&#38899;&#36830;&#32493;&#35757;&#32451;&#65292;&#23454;&#29616;&#20102;&#21475;&#35821;&#21644;&#20070;&#38754;&#35821;&#35328;&#30340;&#28151;&#21512;&#27169;&#22411;&#12290;&#23427;&#23637;&#31034;&#20102;&#25991;&#26412;&#27169;&#22411;&#30340;&#35821;&#20041;&#33021;&#21147;&#21644;&#35821;&#38899;&#27169;&#22411;&#30340;&#34920;&#29616;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;SPIRIT-LM&#36824;&#33021;&#20197;&#23569;&#37327;&#26679;&#26412;&#30340;&#26041;&#24335;&#23398;&#20064;&#26032;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;SPIRIT-LM&#65292;&#36825;&#26159;&#19968;&#20010;&#22522;&#20110;&#25991;&#26412;&#21644;&#35821;&#38899;&#33258;&#30001;&#28151;&#21512;&#30340;&#22810;&#27169;&#24577;&#35821;&#35328;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#22522;&#20110;&#39044;&#35757;&#32451;&#30340;&#25991;&#26412;&#35821;&#35328;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#36830;&#32493;&#22312;&#25991;&#26412;&#21644;&#35821;&#38899;&#21333;&#20803;&#19978;&#36827;&#34892;&#35757;&#32451;&#23558;&#20854;&#25193;&#23637;&#21040;&#35821;&#38899;&#27169;&#24577;&#12290;&#35821;&#38899;&#21644;&#25991;&#26412;&#24207;&#21015;&#34987;&#36830;&#25509;&#20026;&#19968;&#32452;&#21333;&#35789;&#65292;&#24182;&#20351;&#29992;&#19968;&#20010;&#23567;&#22411;&#33258;&#21160;&#31579;&#36873;&#30340;&#35821;&#38899;-&#25991;&#26412;&#24179;&#34892;&#35821;&#26009;&#24211;&#26469;&#36827;&#34892;&#35789;&#32423;&#20132;&#32455;&#30340;&#35757;&#32451;&#26041;&#27861;&#12290;SPIRIT-LM&#26377;&#20004;&#20010;&#29256;&#26412;&#65306;&#19968;&#20010;&#26159;&#20351;&#29992;&#35821;&#38899;&#35821;&#20041;&#21333;&#20803;&#30340;BASE&#29256;&#26412;&#65292;&#21478;&#19968;&#20010;&#26159;&#22312;&#35821;&#20041;&#21333;&#20803;&#20043;&#22806;&#36824;&#20351;&#29992;&#20102;&#38899;&#39640;&#21644;&#39118;&#26684;&#21333;&#20803;&#26469;&#27169;&#25311;&#34920;&#29616;&#21147;&#30340;EXPRESSIVE&#29256;&#26412;&#12290;&#23545;&#20110;&#36825;&#20004;&#20010;&#29256;&#26412;&#65292;&#25991;&#26412;&#26159;&#29992;&#23376;&#35789;BPE&#26631;&#35760;&#32534;&#30721;&#30340;&#12290;&#32467;&#26524;&#27169;&#22411;&#23637;&#31034;&#20102;&#25991;&#26412;&#27169;&#22411;&#30340;&#35821;&#20041;&#33021;&#21147;&#21644;&#35821;&#38899;&#27169;&#22411;&#30340;&#34920;&#29616;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;SPIRIT-LM&#33021;&#22815;&#22312;&#36328;&#27169;&#24577;&#65288;&#21363;ASR&#12289;TTS&#12289;&#35821;&#38899;&#20998;&#31867;&#65289;&#20013;&#20197;&#23569;&#37327;&#26679;&#26412;&#30340;&#26041;&#24335;&#23398;&#20064;&#26032;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce SPIRIT-LM, a foundation multimodal language model that freely mixes text and speech. Our model is based on a pretrained text language model that we extend to the speech modality by continuously training it on text and speech units. Speech and text sequences are concatenated as a single set of tokens, and trained with a word-level interleaving method using a small automatically-curated speech-text parallel corpus. SPIRIT-LM comes in two versions: a BASE version that uses speech semantic units and an EXPRESSIVE version that models expressivity using pitch and style units in addition to the semantic units. For both versions, the text is encoded with subword BPE tokens. The resulting model displays both the semantic abilities of text models and the expressive abilities of speech models. Additionally, we demonstrate that SPIRIT-LM is able to learn new tasks in a few-shot fashion across modalities (i.e. ASR, TTS, Speech Classification).
&lt;/p&gt;</description></item></channel></rss>