<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#26412;&#25991;&#36890;&#36807;&#28040;&#24687;&#20256;&#36882;&#26426;&#21046;&#30340;&#35270;&#35282;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#23545;&#39640;&#38454;&#32593;&#32476;&#21516;&#36074;&#24615;&#30340;&#27010;&#24565;&#21270;&#65292;&#24182;&#25506;&#32034;&#20102;&#19968;&#20123;&#22788;&#29702;&#39640;&#38454;&#32467;&#26500;&#30340;&#31574;&#30053;&#65292;&#20026;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#26550;&#26500;&#35774;&#35745;&#21644;&#24615;&#33021;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#37326;&#21644;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2310.07684</link><description>&lt;p&gt;
&#36879;&#36807;&#28040;&#24687;&#20256;&#36882;&#30340;&#35270;&#35282;&#30475;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#65306;&#21516;&#36074;&#24615;&#19982;&#26550;&#26500;&#35774;&#35745;&#30340;&#20849;&#21516;&#35270;&#37326;
&lt;/p&gt;
&lt;p&gt;
Hypergraph Neural Networks through the Lens of Message Passing: A Common Perspective to Homophily and Architecture Design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2310.07684
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#28040;&#24687;&#20256;&#36882;&#26426;&#21046;&#30340;&#35270;&#35282;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#23545;&#39640;&#38454;&#32593;&#32476;&#21516;&#36074;&#24615;&#30340;&#27010;&#24565;&#21270;&#65292;&#24182;&#25506;&#32034;&#20102;&#19968;&#20123;&#22788;&#29702;&#39640;&#38454;&#32467;&#26500;&#30340;&#31574;&#30053;&#65292;&#20026;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#26550;&#26500;&#35774;&#35745;&#21644;&#24615;&#33021;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#37326;&#21644;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#22823;&#37096;&#20998;&#30340;&#36229;&#22270;&#23398;&#20064;&#26041;&#27861;&#21644;&#22522;&#20934;&#25968;&#25454;&#38598;&#37117;&#26159;&#36890;&#36807;&#20174;&#22270;&#30340;&#31867;&#27604;&#20013;&#25552;&#21319;&#36807;&#26469;&#30340;&#65292;&#24573;&#30053;&#20102;&#36229;&#22270;&#30340;&#29305;&#27530;&#24615;&#12290;&#26412;&#25991;&#23581;&#35797;&#35299;&#20915;&#19968;&#20123;&#30456;&#20851;&#30340;&#38382;&#39064;&#65306;Q1 &#21516;&#36074;&#24615;&#22312;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#26159;&#21542;&#36215;&#21040;&#20102;&#20851;&#38190;&#20316;&#29992;&#65311;Q2 &#26159;&#21542;&#21487;&#20197;&#36890;&#36807;&#32454;&#33268;&#22788;&#29702;&#39640;&#38454;&#32593;&#32476;&#30340;&#29305;&#24449;&#26469;&#25913;&#21892;&#24403;&#21069;&#30340;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#65311;Q3 &#29616;&#26377;&#25968;&#25454;&#38598;&#26159;&#21542;&#23545;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#25552;&#20379;&#20102;&#26377;&#24847;&#20041;&#30340;&#22522;&#20934;&#65311;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#39318;&#20808;&#24341;&#20837;&#20102;&#22522;&#20110;&#28040;&#24687;&#20256;&#36882;&#26426;&#21046;&#30340;&#39640;&#38454;&#32593;&#32476;&#21516;&#36074;&#24615;&#30340;&#26032;&#27010;&#24565;&#21270;&#65292;&#32479;&#19968;&#20102;&#39640;&#38454;&#32593;&#32476;&#30340;&#20998;&#26512;&#21644;&#24314;&#27169;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#22312;&#36229;&#22270;&#31070;&#32463;&#32593;&#32476;&#20013;&#22788;&#29702;&#39640;&#38454;&#32467;&#26500;&#30340;&#19968;&#20123;&#33258;&#28982;&#20294;&#22823;&#37096;&#20998;&#26410;&#34987;&#25506;&#32034;&#30340;&#31574;&#30053;&#65292;&#27604;&#22914;&#20445;&#30041;&#36229;&#36793;&#20381;&#36182;&#30340;&#33410;&#28857;&#34920;&#31034;&#65292;&#25110;&#26159;&#20197;&#33410;&#28857;&#21644;&#36229;&#36793;&#20849;&#21516;&#32534;&#30721;&#30340;&#26041;&#24335;&#36827;&#34892;&#22788;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
Most of the current hypergraph learning methodologies and benchmarking datasets in the hypergraph realm are obtained by lifting procedures from their graph analogs, leading to overshadowing specific characteristics of hypergraphs. This paper attempts to confront some pending questions in that regard: Q1 Can the concept of homophily play a crucial role in Hypergraph Neural Networks (HNNs)? Q2 Is there room for improving current HNN architectures by carefully addressing specific characteristics of higher-order networks? Q3 Do existing datasets provide a meaningful benchmark for HNNs? To address them, we first introduce a novel conceptualization of homophily in higher-order networks based on a Message Passing (MP) scheme, unifying both the analytical examination and the modeling of higher-order networks. Further, we investigate some natural, yet mostly unexplored, strategies for processing higher-order structures within HNNs such as keeping hyperedge-dependent node representations, or per
&lt;/p&gt;</description></item></channel></rss>