<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#27169;&#20223;&#27491;&#21017;&#21270;&#30340;&#26368;&#20248;&#36755;&#36816;&#65288;I-OT&#65289;&#65292;&#36890;&#36807;&#27169;&#20223;&#20808;&#39564;&#20998;&#24067;&#26469;&#25552;&#39640;&#32593;&#32476;&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.17967</link><description>&lt;p&gt;
&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#27169;&#20223;&#27491;&#21017;&#21270;&#30340;&#26368;&#20248;&#36755;&#36816;&#65306;&#21487;&#35777;&#26126;&#30340;&#40065;&#26834;&#24615;&#21450;&#20854;&#22312;&#29289;&#27969;&#35268;&#21010;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Imitation-regularized Optimal Transport on Networks: Provable Robustness and Application to Logistics Planning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17967
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#27169;&#20223;&#27491;&#21017;&#21270;&#30340;&#26368;&#20248;&#36755;&#36816;&#65288;I-OT&#65289;&#65292;&#36890;&#36807;&#27169;&#20223;&#20808;&#39564;&#20998;&#24067;&#26469;&#25552;&#39640;&#32593;&#32476;&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#31995;&#32479;&#26500;&#25104;&#20102;&#29616;&#20195;&#31038;&#20250;&#30340;&#22522;&#30784;&#65292;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#31995;&#32479;&#38754;&#20020;&#30528;&#30001;&#28798;&#38590;&#31561;&#19981;&#21487;&#39044;&#35265;&#24773;&#20917;&#24102;&#26469;&#30340;&#37325;&#22823;&#39118;&#38505;&#12290;&#37492;&#20110;&#27492;&#65292;&#36843;&#20999;&#38656;&#35201;&#30740;&#31350;&#21152;&#24378;&#32593;&#32476;&#31995;&#32479;&#30340;&#40065;&#26834;&#24615;&#12290;&#26368;&#36817;&#22312;&#24378;&#21270;&#23398;&#20064;&#20013;&#65292;&#24050;&#32463;&#30830;&#23450;&#20102;&#33719;&#21462;&#40065;&#26834;&#24615;&#21644;&#27491;&#21017;&#21270;&#29109;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#27492;&#22806;&#65292;&#22312;&#36825;&#19968;&#26694;&#26550;&#20869;&#20351;&#29992;&#20102;&#27169;&#20223;&#23398;&#20064;&#26469;&#21453;&#26144;&#19987;&#23478;&#30340;&#34892;&#20026;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#22312;&#32593;&#32476;&#19978;&#30340;&#26368;&#20248;&#36755;&#36816;&#20013;&#20351;&#29992;&#31867;&#20284;&#27169;&#20223;&#26694;&#26550;&#30340;&#20840;&#38754;&#30740;&#31350;&#36824;&#27809;&#26377;&#12290;&#22240;&#27492;&#65292;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#30740;&#31350;&#20102;&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#30340;&#27169;&#20223;&#27491;&#21017;&#21270;&#30340;&#26368;&#20248;&#36755;&#36816;&#65288;I-OT&#65289;&#12290;&#23427;&#36890;&#36807;&#27169;&#20223;&#32473;&#23450;&#30340;&#20808;&#39564;&#20998;&#24067;&#23545;&#32593;&#32476;&#30340;&#20808;&#39564;&#30693;&#35782;&#36827;&#34892;&#32534;&#30721;&#12290;I-OT&#35299;&#20915;&#26041;&#26696;&#22312;&#32593;&#32476;&#19978;&#23450;&#20041;&#30340;&#25104;&#26412;&#26041;&#38754;&#34920;&#29616;&#20986;&#20102;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17967v1 Announce Type: new  Abstract: Network systems form the foundation of modern society, playing a critical role in various applications. However, these systems are at significant risk of being adversely affected by unforeseen circumstances, such as disasters. Considering this, there is a pressing need for research to enhance the robustness of network systems. Recently, in reinforcement learning, the relationship between acquiring robustness and regularizing entropy has been identified. Additionally, imitation learning is used within this framework to reflect experts' behavior. However, there are no comprehensive studies on the use of a similar imitation framework for optimal transport on networks. Therefore, in this study, imitation-regularized optimal transport (I-OT) on networks was investigated. It encodes prior knowledge on the network by imitating a given prior distribution. The I-OT solution demonstrated robustness in terms of the cost defined on the network. More
&lt;/p&gt;</description></item></channel></rss>