<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>XLAVS-R&#26159;&#19968;&#20010;&#36328;&#35821;&#35328;&#35270;&#21548;&#35821;&#38899;&#34920;&#31034;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#21033;&#29992;&#26377;&#38480;&#30340;&#22810;&#35821;&#35328;AV&#39044;&#35757;&#32451;&#25968;&#25454;&#65292;&#31616;&#21270;&#39044;&#35757;&#32451;&#26041;&#26696;&#65292;&#20197;&#25552;&#39640;&#23545;&#22122;&#22768;&#30340;&#40065;&#26834;&#24615;&#65292;&#22312;&#19979;&#28216;&#38899;&#39057;-&#35270;&#35273;&#35821;&#38899;&#35782;&#21035;&#21644;&#32763;&#35793;&#20219;&#21153;&#20013;&#27604;&#20808;&#21069;&#26368;&#20808;&#36827;&#25216;&#26415;&#25552;&#21319;&#20102;&#39640;&#36798;18.5% WER&#21644;4.7 BLEU&#12290;</title><link>https://arxiv.org/abs/2403.14402</link><description>&lt;p&gt;
XLAVS-R: &#36328;&#35821;&#35328;&#35270;&#21548;&#35821;&#38899;&#34920;&#31034;&#23398;&#20064;&#29992;&#20110;&#22122;&#22768;&#40065;&#26834;&#35821;&#38899;&#30693;&#35273;
&lt;/p&gt;
&lt;p&gt;
XLAVS-R: Cross-Lingual Audio-Visual Speech Representation Learning for Noise-Robust Speech Perception
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14402
&lt;/p&gt;
&lt;p&gt;
XLAVS-R&#26159;&#19968;&#20010;&#36328;&#35821;&#35328;&#35270;&#21548;&#35821;&#38899;&#34920;&#31034;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#21033;&#29992;&#26377;&#38480;&#30340;&#22810;&#35821;&#35328;AV&#39044;&#35757;&#32451;&#25968;&#25454;&#65292;&#31616;&#21270;&#39044;&#35757;&#32451;&#26041;&#26696;&#65292;&#20197;&#25552;&#39640;&#23545;&#22122;&#22768;&#30340;&#40065;&#26834;&#24615;&#65292;&#22312;&#19979;&#28216;&#38899;&#39057;-&#35270;&#35273;&#35821;&#38899;&#35782;&#21035;&#21644;&#32763;&#35793;&#20219;&#21153;&#20013;&#27604;&#20808;&#21069;&#26368;&#20808;&#36827;&#25216;&#26415;&#25552;&#21319;&#20102;&#39640;&#36798;18.5% WER&#21644;4.7 BLEU&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#38899;&#35782;&#21035;&#21644;&#32763;&#35793;&#31995;&#32479;&#23545;&#22024;&#26434;&#30340;&#36755;&#20837;&#34920;&#29616;&#19981;&#20339;&#65292;&#22312;&#29616;&#23454;&#29615;&#22659;&#20013;&#32463;&#24120;&#20986;&#29616;&#12290;&#36890;&#36807;&#35270;&#35273;&#20449;&#21495;&#22686;&#24378;&#36825;&#20123;&#31995;&#32479;&#26377;&#28508;&#21147;&#25552;&#39640;&#23545;&#22122;&#22768;&#30340;&#40065;&#26834;&#24615;&#12290;&#28982;&#32780;&#65292;&#35270;&#21548;&#65288;AV&#65289;&#25968;&#25454;&#20165;&#26377;&#38480;&#21487;&#29992;&#65292;&#24182;&#19988;&#27604;&#20165;&#26377;&#38899;&#39057;&#36164;&#28304;&#30340;&#35821;&#35328;&#26356;&#23569;&#12290;&#20026;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#25552;&#20986;XLAVS-R&#65292;&#19968;&#20010;&#36328;&#35821;&#35328;&#35270;&#21548;&#35821;&#38899;&#34920;&#31034;&#27169;&#22411;&#65292;&#29992;&#20110;&#36229;&#36807;100&#31181;&#35821;&#35328;&#30340;&#22122;&#22768;&#40065;&#26834;&#35821;&#38899;&#35782;&#21035;&#21644;&#32763;&#35793;&#12290;&#23427;&#26088;&#22312;&#26368;&#22823;&#31243;&#24230;&#21033;&#29992;&#26377;&#38480;&#30340;&#22810;&#35821;&#35328;AV&#39044;&#35757;&#32451;&#25968;&#25454;&#30340;&#30410;&#22788;&#65292;&#36890;&#36807;&#22312;&#38899;&#39057;-&#20165;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;&#30340;&#22522;&#30784;&#19978;&#26500;&#24314;&#65292;&#24182;&#31616;&#21270;&#29616;&#26377;&#30340;&#39044;&#35757;&#32451;&#26041;&#26696;&#12290;&#22312;MuAViC&#22522;&#20934;&#35780;&#20272;&#19978;&#23545;XLAVS-R&#36827;&#34892;&#20102;&#24191;&#27867;&#35780;&#20272;&#65292;&#26174;&#31034;&#20102;&#20854;&#22312;&#19979;&#28216;&#38899;&#39057;-&#35270;&#35273;&#35821;&#38899;&#35782;&#21035;&#21644;&#32763;&#35793;&#20219;&#21153;&#19978;&#30340;&#20248;&#21183;&#65292;&#22312;&#32473;&#20986;&#22024;&#26434;&#30340;AV&#36755;&#20837;&#26102;&#65292;&#20854;&#20248;&#20110;&#20808;&#21069;&#26368;&#20808;&#36827;&#25216;&#26415;&#26368;&#39640;&#36798;&#21040;18.5% WER&#21644;4.7 BLEU&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14402v1 Announce Type: cross  Abstract: Speech recognition and translation systems perform poorly on noisy inputs, which are frequent in realistic environments. Augmenting these systems with visual signals has the potential to improve robustness to noise. However, audio-visual (AV) data is only available in limited amounts and for fewer languages than audio-only resources. To address this gap, we present XLAVS-R, a cross-lingual audio-visual speech representation model for noise-robust speech recognition and translation in over 100 languages. It is designed to maximize the benefits of limited multilingual AV pre-training data, by building on top of audio-only multilingual pre-training and simplifying existing pre-training schemes. Extensive evaluation on the MuAViC benchmark shows the strength of XLAVS-R on downstream audio-visual speech recognition and translation tasks, where it outperforms the previous state of the art by up to 18.5% WER and 4.7 BLEU given noisy AV inputs
&lt;/p&gt;</description></item></channel></rss>