<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#20197;&#25552;&#20379;&#32508;&#21512;&#24615;&#24615;&#21035;&#27602;&#24615;&#25351;&#26631;&#30340;&#27169;&#22411;&#65292;&#26377;&#21161;&#20110;&#25919;&#31574;&#21046;&#23450;&#32773;&#12289;&#22312;&#32447;&#31038;&#21306;&#31649;&#29702;&#21592;&#21644;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#23478;&#26356;&#22909;&#22320;&#29702;&#35299;&#21644;&#31649;&#29702;&#22312;&#32447;&#24615;&#21035;&#27495;&#35270;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2404.02205</link><description>&lt;p&gt;
&#19968;&#20010;&#25972;&#20307;&#24615;&#26497;&#21270;&#25351;&#26631;&#20197;&#34913;&#37327;&#22312;&#32447;&#24615;&#21035;&#27495;&#35270;
&lt;/p&gt;
&lt;p&gt;
A Holistic Indicator of Polarization to Measure Online Sexism
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02205
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#20197;&#25552;&#20379;&#32508;&#21512;&#24615;&#24615;&#21035;&#27602;&#24615;&#25351;&#26631;&#30340;&#27169;&#22411;&#65292;&#26377;&#21161;&#20110;&#25919;&#31574;&#21046;&#23450;&#32773;&#12289;&#22312;&#32447;&#31038;&#21306;&#31649;&#29702;&#21592;&#21644;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#23478;&#26356;&#22909;&#22320;&#29702;&#35299;&#21644;&#31649;&#29702;&#22312;&#32447;&#24615;&#21035;&#27495;&#35270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02205v1 &#20844;&#21578;&#31867;&#22411;: &#36328;&#39046;&#22495; &#25688;&#35201;: &#30007;&#26435;&#20027;&#20041;&#32773;&#21644;&#22899;&#26435;&#20027;&#20041;&#32773;&#22312;&#31038;&#20132;&#32593;&#32476;&#19978;&#30340;&#22312;&#32447;&#36235;&#21183;&#38656;&#35201;&#19968;&#20010;&#25972;&#20307;&#24615;&#30340;&#34913;&#37327;&#24615;&#21035;&#27495;&#35270;&#27700;&#24179;&#30340;&#25351;&#26631;&#12290;&#36825;&#20010;&#25351;&#26631;&#23545;&#20110;&#25919;&#31574;&#21046;&#23450;&#32773;&#21644;&#22312;&#32447;&#31038;&#21306;&#30340;&#31649;&#29702;&#21592;&#65288;&#22914;subreddits&#65289;&#20197;&#21450;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#23478;&#33267;&#20851;&#37325;&#35201;&#65292;&#20182;&#20204;&#21487;&#20197;&#26681;&#25454;&#24615;&#21035;&#27495;&#35270;&#31243;&#24230;&#20462;&#25913;&#31649;&#29702;&#31574;&#30053;&#65292;&#25110;&#32773;&#21305;&#37197;&#21644;&#27604;&#36739;&#19981;&#21516;&#24179;&#21488;&#21644;&#31038;&#21306;&#19978;&#30340;&#26102;&#24577;&#24615;&#21035;&#27495;&#35270;&#65292;&#20197;&#21450;&#25512;&#26029;&#31038;&#20250;&#31185;&#23398;&#35265;&#35299;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#21487;&#20197;&#25552;&#20379;&#19968;&#20010;&#21487;&#27604;&#36739;&#30340;&#38024;&#23545;&#30007;&#24615;&#12289;&#22899;&#24615;&#36523;&#20221;&#20197;&#21450;&#30007;&#24615;&#12289;&#22899;&#24615;&#20010;&#20154;&#30340;&#27602;&#24615;&#25972;&#20307;&#25351;&#26631;&#12290;&#23613;&#31649;&#20808;&#21069;&#30340;&#30417;&#30563;NLP&#26041;&#27861;&#38656;&#35201;&#22312;&#30446;&#26631;&#32423;&#21035;&#23545;&#26377;&#27602;&#35780;&#35770;&#36827;&#34892;&#27880;&#37322;&#65288;&#20363;&#22914;&#27880;&#37322;&#29305;&#21035;&#38024;&#23545;&#22899;&#24615;&#26377;&#27602;&#30340;&#35780;&#35770;&#65289;&#26469;&#26816;&#27979;&#38024;&#23545;&#24615;&#26377;&#27602;&#35780;&#35770;&#65292;&#25105;&#20204;&#30340;&#25351;&#26631;&#21033;&#29992;&#30417;&#30563;&#24335;NLP&#26469;&#26816;&#27979;&#27602;&#24615;&#30340;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02205v1 Announce Type: cross  Abstract: The online trend of the manosphere and feminist discourse on social networks requires a holistic measure of the level of sexism in an online community. This indicator is important for policymakers and moderators of online communities (e.g., subreddits) and computational social scientists, either to revise moderation strategies based on the degree of sexism or to match and compare the temporal sexism across different platforms and communities with real-time events and infer social scientific insights.   In this paper, we build a model that can provide a comparable holistic indicator of toxicity targeted toward male and female identity and male and female individuals. Despite previous supervised NLP methods that require annotation of toxic comments at the target level (e.g. annotating comments that are specifically toxic toward women) to detect targeted toxic comments, our indicator uses supervised NLP to detect the presence of toxicity 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861; RECO-SLIP&#65292;&#29992;&#20110;&#22312;&#23646;&#24615;&#22270;&#20013;&#26816;&#27979;&#23646;&#20110;&#26032;&#31867;&#21035;&#30340;&#33410;&#28857;&#65292;&#33021;&#22815;&#26377;&#25928;&#35299;&#20915;&#23376;&#32676;&#20307;&#36716;&#31227;&#19979;&#30340;&#33410;&#28857;&#26816;&#27979;&#38382;&#39064;&#65292;&#23454;&#39564;&#35777;&#26126;&#20854;&#24615;&#33021;&#20248;&#36234;&#12290;</title><link>https://arxiv.org/abs/2404.01216</link><description>&lt;p&gt;
&#22312;&#23376;&#32676;&#20307;&#36716;&#31227;&#19979;&#30340;&#26032;&#39062;&#33410;&#28857;&#31867;&#21035;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Novel Node Category Detection Under Subpopulation Shift
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01216
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861; RECO-SLIP&#65292;&#29992;&#20110;&#22312;&#23646;&#24615;&#22270;&#20013;&#26816;&#27979;&#23646;&#20110;&#26032;&#31867;&#21035;&#30340;&#33410;&#28857;&#65292;&#33021;&#22815;&#26377;&#25928;&#35299;&#20915;&#23376;&#32676;&#20307;&#36716;&#31227;&#19979;&#30340;&#33410;&#28857;&#26816;&#27979;&#38382;&#39064;&#65292;&#23454;&#39564;&#35777;&#26126;&#20854;&#24615;&#33021;&#20248;&#36234;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#22270;&#25968;&#25454;&#20013;&#65292;&#20998;&#24067;&#36716;&#31227;&#21487;&#20197;&#36890;&#36807;&#21508;&#31181;&#26041;&#24335;&#34920;&#29616;&#65292;&#20363;&#22914;&#26032;&#31867;&#21035;&#30340;&#20986;&#29616;&#21644;&#29616;&#26377;&#31867;&#21035;&#30456;&#23545;&#27604;&#20363;&#30340;&#21464;&#21270;&#12290;&#22312;&#36825;&#31181;&#20998;&#24067;&#36716;&#31227;&#19979;&#65292;&#26816;&#27979;&#23646;&#20110;&#26032;&#31867;&#21035;&#30340;&#33410;&#28857;&#23545;&#20110;&#23433;&#20840;&#25110;&#27934;&#23519;&#21457;&#29616;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#31216;&#20026;&#20855;&#26377;&#36873;&#25321;&#24615;&#38142;&#36335;&#39044;&#27979;&#30340;&#21484;&#22238;&#32422;&#26463;&#20248;&#21270;&#65288;RECO-SLIP&#65289;&#65292;&#29992;&#20110;&#22312;&#23376;&#32676;&#20307;&#36716;&#31227;&#19979;&#26816;&#27979;&#23646;&#24615;&#22270;&#20013;&#23646;&#20110;&#26032;&#31867;&#21035;&#30340;&#33410;&#28857;&#12290;&#36890;&#36807;&#23558;&#21484;&#22238;&#32422;&#26463;&#23398;&#20064;&#26694;&#26550;&#19982;&#39640;&#25928;&#26679;&#26412;&#39044;&#27979;&#26426;&#21046;&#30456;&#32467;&#21512;&#65292;RECO-SLIP&#35299;&#20915;&#20102;&#25269;&#25239;&#23376;&#32676;&#20307;&#36716;&#31227;&#21644;&#26377;&#25928;&#21033;&#29992;&#22270;&#32467;&#26500;&#30340;&#21452;&#37325;&#25361;&#25112;&#12290;&#25105;&#20204;&#22312;&#22810;&#20010;&#22270;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#22823;&#37327;&#23454;&#35777;&#35780;&#20272;&#65292;&#32467;&#26524;&#34920;&#26126;RECO-SLIP&#30456;&#23545;&#20110;&#29616;&#26377;&#26041;&#27861;&#20855;&#26377;&#26356;&#20248;&#24322;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01216v1 Announce Type: new  Abstract: In real-world graph data, distribution shifts can manifest in various ways, such as the emergence of new categories and changes in the relative proportions of existing categories. It is often important to detect nodes of novel categories under such distribution shifts for safety or insight discovery purposes. We introduce a new approach, Recall-Constrained Optimization with Selective Link Prediction (RECO-SLIP), to detect nodes belonging to novel categories in attributed graphs under subpopulation shifts. By integrating a recall-constrained learning framework with a sample-efficient link prediction mechanism, RECO-SLIP addresses the dual challenges of resilience against subpopulation shifts and the effective exploitation of graph structure. Our extensive empirical evaluation across multiple graph datasets demonstrates the superior performance of RECO-SLIP over existing methods.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#32508;&#36848;&#35843;&#30740;&#20102;&#22270;&#32553;&#20943;&#26041;&#27861;&#65292;&#21253;&#25324;&#31232;&#30095;&#21270;&#12289;&#31895;&#21270;&#21644;&#27987;&#32553;&#65292;&#22312;&#35299;&#20915;&#22823;&#22411;&#22270;&#24418;&#25968;&#25454;&#20998;&#26512;&#21644;&#35745;&#31639;&#22797;&#26434;&#24615;&#26041;&#38754;&#36215;&#21040;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;&#35843;&#30740;&#23545;&#36825;&#20123;&#26041;&#27861;&#30340;&#25216;&#26415;&#32454;&#33410;&#36827;&#34892;&#20102;&#31995;&#32479;&#30340;&#22238;&#39038;&#65292;&#24182;&#24378;&#35843;&#20102;&#23427;&#20204;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#20851;&#38190;&#24615;&#12290;&#21516;&#26102;&#65292;&#35843;&#30740;&#36824;&#25552;&#20986;&#20102;&#20445;&#35777;&#22270;&#32553;&#20943;&#25216;&#26415;&#25345;&#32493;&#26377;&#25928;&#24615;&#30340;&#20851;&#38190;&#30740;&#31350;&#26041;&#21521;&#12290;</title><link>https://arxiv.org/abs/2402.03358</link><description>&lt;p&gt;
&#22270;&#32553;&#20943;&#30340;&#32508;&#21512;&#35843;&#30740;&#65306;&#31232;&#30095;&#21270;&#12289;&#31895;&#21270;&#21644;&#27987;&#32553;
&lt;/p&gt;
&lt;p&gt;
A Comprehensive Survey on Graph Reduction: Sparsification, Coarsening, and Condensation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03358
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#32508;&#36848;&#35843;&#30740;&#20102;&#22270;&#32553;&#20943;&#26041;&#27861;&#65292;&#21253;&#25324;&#31232;&#30095;&#21270;&#12289;&#31895;&#21270;&#21644;&#27987;&#32553;&#65292;&#22312;&#35299;&#20915;&#22823;&#22411;&#22270;&#24418;&#25968;&#25454;&#20998;&#26512;&#21644;&#35745;&#31639;&#22797;&#26434;&#24615;&#26041;&#38754;&#36215;&#21040;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;&#35843;&#30740;&#23545;&#36825;&#20123;&#26041;&#27861;&#30340;&#25216;&#26415;&#32454;&#33410;&#36827;&#34892;&#20102;&#31995;&#32479;&#30340;&#22238;&#39038;&#65292;&#24182;&#24378;&#35843;&#20102;&#23427;&#20204;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#20851;&#38190;&#24615;&#12290;&#21516;&#26102;&#65292;&#35843;&#30740;&#36824;&#25552;&#20986;&#20102;&#20445;&#35777;&#22270;&#32553;&#20943;&#25216;&#26415;&#25345;&#32493;&#26377;&#25928;&#24615;&#30340;&#20851;&#38190;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#30495;&#23454;&#19990;&#30028;&#30340;&#25968;&#25454;&#38598;&#21487;&#20197;&#33258;&#28982;&#22320;&#34920;&#31034;&#20026;&#22270;&#65292;&#28085;&#30422;&#20102;&#24191;&#27867;&#30340;&#39046;&#22495;&#12290;&#28982;&#32780;&#65292;&#22270;&#25968;&#25454;&#38598;&#30340;&#22797;&#26434;&#24615;&#21644;&#35268;&#27169;&#30340;&#22686;&#21152;&#20026;&#20998;&#26512;&#21644;&#35745;&#31639;&#24102;&#26469;&#20102;&#26174;&#33879;&#30340;&#25361;&#25112;&#12290;&#20026;&#27492;&#65292;&#22270;&#32553;&#20943;&#25216;&#26415;&#22312;&#20445;&#30041;&#20851;&#38190;&#23646;&#24615;&#30340;&#21516;&#26102;&#31616;&#21270;&#22823;&#22411;&#22270;&#24418;&#25968;&#25454;&#21464;&#24471;&#36234;&#26469;&#36234;&#21463;&#20851;&#27880;&#12290;&#22312;&#26412;&#35843;&#30740;&#20013;&#65292;&#25105;&#20204;&#26088;&#22312;&#25552;&#20379;&#23545;&#22270;&#32553;&#20943;&#26041;&#27861;&#30340;&#20840;&#38754;&#29702;&#35299;&#65292;&#21253;&#25324;&#22270;&#31232;&#30095;&#21270;&#12289;&#22270;&#31895;&#21270;&#21644;&#22270;&#27987;&#32553;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#36825;&#20123;&#26041;&#27861;&#30340;&#32479;&#19968;&#23450;&#20041;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#20998;&#23618;&#20998;&#31867;&#27861;&#26469;&#20998;&#31867;&#36825;&#20123;&#26041;&#27861;&#25152;&#35299;&#20915;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#35843;&#30740;&#31995;&#32479;&#22320;&#22238;&#39038;&#20102;&#36825;&#20123;&#26041;&#27861;&#30340;&#25216;&#26415;&#32454;&#33410;&#65292;&#24182;&#24378;&#35843;&#20102;&#23427;&#20204;&#22312;&#21508;&#31181;&#22330;&#26223;&#20013;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#27010;&#36848;&#20102;&#20445;&#35777;&#22270;&#32553;&#20943;&#25216;&#26415;&#25345;&#32493;&#26377;&#25928;&#24615;&#30340;&#20851;&#38190;&#30740;&#31350;&#26041;&#21521;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#35814;&#32454;&#30340;&#35770;&#25991;&#21015;&#34920;&#38142;&#25509;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many real-world datasets can be naturally represented as graphs, spanning a wide range of domains. However, the increasing complexity and size of graph datasets present significant challenges for analysis and computation. In response, graph reduction techniques have gained prominence for simplifying large graphs while preserving essential properties. In this survey, we aim to provide a comprehensive understanding of graph reduction methods, including graph sparsification, graph coarsening, and graph condensation. Specifically, we establish a unified definition for these methods and introduce a hierarchical taxonomy to categorize the challenges they address. Our survey then systematically reviews the technical details of these methods and emphasizes their practical applications across diverse scenarios. Furthermore, we outline critical research directions to ensure the continued effectiveness of graph reduction techniques, as well as provide a comprehensive paper list at https://github.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#28216;&#36208;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#24555;&#36895;&#35745;&#31639;&#36229;&#22270;&#33410;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#24182;&#36827;&#34892;&#26631;&#31614;&#20256;&#25773;&#12290;&#35813;&#26041;&#27861;&#35299;&#20915;&#20102;&#36229;&#22270;&#20013;&#33410;&#28857;&#36317;&#31163;&#35745;&#31639;&#30340;&#38382;&#39064;&#65292;&#36827;&#19968;&#27493;&#25299;&#23637;&#20102;&#36229;&#22270;&#30340;&#24212;&#29992;&#39046;&#22495;&#12290;</title><link>http://arxiv.org/abs/2401.13054</link><description>&lt;p&gt;
&#26080;&#35745;&#31639;&#22256;&#38590;&#30340;&#24555;&#36895;&#35745;&#31639;&#36229;&#22270;&#33410;&#28857;&#36317;&#31163;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Frustrated Random Walks: A Fast Method to Compute Node Distances on Hypergraphs. (arXiv:2401.13054v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13054
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#28216;&#36208;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#24555;&#36895;&#35745;&#31639;&#36229;&#22270;&#33410;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#24182;&#36827;&#34892;&#26631;&#31614;&#20256;&#25773;&#12290;&#35813;&#26041;&#27861;&#35299;&#20915;&#20102;&#36229;&#22270;&#20013;&#33410;&#28857;&#36317;&#31163;&#35745;&#31639;&#30340;&#38382;&#39064;&#65292;&#36827;&#19968;&#27493;&#25299;&#23637;&#20102;&#36229;&#22270;&#30340;&#24212;&#29992;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36229;&#22270;&#26159;&#22270;&#30340;&#25512;&#24191;&#65292;&#24403;&#32771;&#34385;&#23454;&#20307;&#38388;&#30340;&#23646;&#24615;&#20849;&#20139;&#26102;&#20250;&#33258;&#28982;&#20135;&#29983;&#12290;&#23613;&#31649;&#21487;&#20197;&#36890;&#36807;&#23558;&#36229;&#36793;&#25193;&#23637;&#20026;&#23436;&#20840;&#36830;&#25509;&#30340;&#23376;&#22270;&#26469;&#23558;&#36229;&#22270;&#36716;&#25442;&#20026;&#22270;&#65292;&#20294;&#36870;&#21521;&#25805;&#20316;&#22312;&#35745;&#31639;&#19978;&#38750;&#24120;&#22797;&#26434;&#19988;&#23646;&#20110;NP-complete&#38382;&#39064;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20551;&#35774;&#36229;&#22270;&#21253;&#21547;&#27604;&#22270;&#26356;&#22810;&#30340;&#20449;&#24687;&#12290;&#27492;&#22806;&#65292;&#30452;&#25509;&#25805;&#20316;&#36229;&#22270;&#27604;&#23558;&#20854;&#25193;&#23637;&#20026;&#22270;&#26356;&#20026;&#26041;&#20415;&#12290;&#36229;&#22270;&#20013;&#30340;&#19968;&#20010;&#24320;&#25918;&#38382;&#39064;&#26159;&#22914;&#20309;&#31934;&#30830;&#39640;&#25928;&#22320;&#35745;&#31639;&#33410;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#12290;&#36890;&#36807;&#20272;&#35745;&#33410;&#28857;&#36317;&#31163;&#65292;&#25105;&#20204;&#33021;&#22815;&#25214;&#21040;&#33410;&#28857;&#30340;&#26368;&#36817;&#37051;&#23621;&#65292;&#24182;&#20351;&#29992;K&#26368;&#36817;&#37051;&#65288;KNN&#65289;&#26041;&#27861;&#22312;&#36229;&#22270;&#19978;&#25191;&#34892;&#26631;&#31614;&#20256;&#25773;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#28216;&#36208;&#30340;&#26032;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#36229;&#22270;&#19978;&#36827;&#34892;&#26631;&#31614;&#20256;&#25773;&#12290;&#25105;&#20204;&#23558;&#33410;&#28857;&#36317;&#31163;&#20272;&#35745;&#20026;&#38543;&#26426;&#28216;&#36208;&#30340;&#39044;&#26399;&#21040;&#36798;&#26102;&#38388;&#12290;&#25105;&#20204;&#27880;&#24847;&#21040;&#31616;&#21333;&#38543;&#26426;&#28216;&#36208;&#65288;SRW&#65289;&#26080;&#27861;&#20934;&#30830;&#25551;&#36848;&#33410;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#65292;&#22240;&#27492;&#25105;&#20204;&#24341;&#20837;&#20102;"frustrated"&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
A hypergraph is a generalization of a graph that arises naturally when attribute-sharing among entities is considered. Although a hypergraph can be converted into a graph by expanding its hyperedges into fully connected subgraphs, going the reverse way is computationally complex and NP-complete. We therefore hypothesize that a hypergraph contains more information than a graph. In addition, it is more convenient to manipulate a hypergraph directly, rather than expand it into a graph. An open problem in hypergraphs is how to accurately and efficiently calculate their node distances. Estimating node distances enables us to find a node's nearest neighbors, and perform label propagation on hypergraphs using a K-nearest neighbors (KNN) approach. In this paper, we propose a novel approach based on random walks to achieve label propagation on hypergraphs. We estimate node distances as the expected hitting times of random walks. We note that simple random walks (SRW) cannot accurately describe 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20004;&#37096;&#20998;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;A/B&#27979;&#35797;&#20013;&#30340;&#32593;&#32476;&#24178;&#25200;&#12290;&#36890;&#36807;&#32771;&#34385;&#28508;&#22312;&#30340;&#22797;&#26434;&#32593;&#32476;&#32467;&#26500;&#21644;&#24314;&#31435;&#36866;&#21512;&#30340;&#26333;&#20809;&#26144;&#23556;&#65292;&#35813;&#26041;&#27861;&#22312;&#21512;&#25104;&#23454;&#39564;&#21644;&#30495;&#23454;&#22823;&#35268;&#27169;&#27979;&#35797;&#20013;&#30340;&#27169;&#25311;&#20013;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2308.09790</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#25551;&#36848;A/B&#27979;&#35797;&#20013;&#32593;&#32476;&#24178;&#25200;&#30340;&#20004;&#37096;&#20998;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Two-Part Machine Learning Approach to Characterizing Network Interference in A/B Testing. (arXiv:2308.09790v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09790
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20004;&#37096;&#20998;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;A/B&#27979;&#35797;&#20013;&#30340;&#32593;&#32476;&#24178;&#25200;&#12290;&#36890;&#36807;&#32771;&#34385;&#28508;&#22312;&#30340;&#22797;&#26434;&#32593;&#32476;&#32467;&#26500;&#21644;&#24314;&#31435;&#36866;&#21512;&#30340;&#26333;&#20809;&#26144;&#23556;&#65292;&#35813;&#26041;&#27861;&#22312;&#21512;&#25104;&#23454;&#39564;&#21644;&#30495;&#23454;&#22823;&#35268;&#27169;&#27979;&#35797;&#20013;&#30340;&#27169;&#25311;&#20013;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#32593;&#32476;&#24178;&#25200;&#29616;&#35937;&#30340;&#24433;&#21709;&#65292;&#25511;&#21046;&#23454;&#39564;&#25110;"A/B&#27979;&#35797;"&#30340;&#21487;&#38752;&#24615;&#36890;&#24120;&#20250;&#21463;&#21040;&#25439;&#23475;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#26041;&#27861;&#26469;&#35782;&#21035;&#21644;&#25551;&#36848;&#24322;&#36136;&#32593;&#32476;&#24178;&#25200;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32771;&#34385;&#20102;&#28508;&#22312;&#30340;&#22797;&#26434;&#32593;&#32476;&#32467;&#26500;&#65292;&#24182;&#33258;&#21160;&#21270;&#20102;"&#26333;&#20809;&#26144;&#23556;"&#30830;&#23450;&#30340;&#20219;&#21153;&#65292;&#20174;&#32780;&#35299;&#20915;&#20102;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#20004;&#20010;&#20027;&#35201;&#38480;&#21046;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;"&#22240;&#26524;&#32593;&#32476;&#27169;&#24335;"&#65292;&#24182;&#37319;&#29992;&#36879;&#26126;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26469;&#24314;&#31435;&#26368;&#36866;&#21512;&#21453;&#26144;&#28508;&#22312;&#32593;&#32476;&#24178;&#25200;&#27169;&#24335;&#30340;&#26333;&#20809;&#26144;&#23556;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#22312;&#20004;&#20010;&#21512;&#25104;&#23454;&#39564;&#21644;&#19968;&#20010;&#28041;&#21450;100-200&#19975;Instagram&#29992;&#25143;&#30340;&#30495;&#23454;&#22823;&#35268;&#27169;&#27979;&#35797;&#20013;&#30340;&#27169;&#25311;&#24471;&#21040;&#20102;&#39564;&#35777;&#65292;&#34920;&#29616;&#20248;&#20110;&#20256;&#32479;&#26041;&#27861;&#65292;&#22914;&#22522;&#20110;&#35774;&#35745;&#30340;&#38598;&#32676;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#20998;&#26512;&#30340;&#37051;&#22495;&#26333;&#20809;&#26144;&#23556;&#12290;
&lt;/p&gt;
&lt;p&gt;
The reliability of controlled experiments, or "A/B tests," can often be compromised due to the phenomenon of network interference, wherein the outcome for one unit is influenced by other units. To tackle this challenge, we propose a machine learning-based method to identify and characterize heterogeneous network interference. Our approach accounts for latent complex network structures and automates the task of "exposure mapping'' determination, which addresses the two major limitations in the existing literature. We introduce "causal network motifs'' and employ transparent machine learning models to establish the most suitable exposure mapping that reflects underlying network interference patterns. Our method's efficacy has been validated through simulations on two synthetic experiments and a real-world, large-scale test involving 1-2 million Instagram users, outperforming conventional methods such as design-based cluster randomization and analysis-based neighborhood exposure mapping. 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36229;&#22270;&#19978;&#20855;&#26377;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31163;&#25955;&#26102;&#38388;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65292;&#22312;&#21021;&#24577;&#21644;&#36229;&#22270;&#25299;&#25169;&#20197;&#21450;&#26356;&#26032;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#19979;&#65292;&#20135;&#29983;&#20102;&#39640;&#38454;&#21160;&#21147;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2304.07203</link><description>&lt;p&gt;
&#20851;&#20110;&#36229;&#22270;&#19978;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#25910;&#25947;&#24615;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the convergence of nonlinear averaging dynamics with three-body interactions on hypergraphs. (arXiv:2304.07203v1 [math.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07203
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36229;&#22270;&#19978;&#20855;&#26377;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31163;&#25955;&#26102;&#38388;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65292;&#22312;&#21021;&#24577;&#21644;&#36229;&#22270;&#25299;&#25169;&#20197;&#21450;&#26356;&#26032;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#19979;&#65292;&#20135;&#29983;&#20102;&#39640;&#38454;&#21160;&#21147;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#29702;&#23398;&#12289;&#29983;&#29289;&#23398;&#21644;&#31038;&#20250;&#31185;&#23398;&#31561;&#39046;&#22495;&#30340;&#22797;&#26434;&#32593;&#32476;&#31995;&#32479;&#36890;&#24120;&#28041;&#21450;&#36229;&#20986;&#31616;&#21333;&#30340;&#25104;&#23545;&#30456;&#20114;&#20316;&#29992;&#30340;&#20132;&#20114;&#12290;&#36229;&#22270;&#20316;&#20026;&#25551;&#36848;&#21644;&#20998;&#26512;&#20855;&#26377;&#22810;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31995;&#32479;&#22797;&#26434;&#34892;&#20026;&#30340;&#24378;&#22823;&#24314;&#27169;&#24037;&#20855;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31163;&#25955;&#26102;&#38388;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65306;&#24213;&#23618;&#36229;&#22270;&#30001;&#19977;&#20803;&#32452;&#20316;&#20026;&#36229;&#36793;&#30028;&#23450;&#30456;&#20114;&#20316;&#29992;&#30340;&#32467;&#26500;&#65292;&#32780;&#39030;&#28857;&#36890;&#36807;&#21152;&#26435;&#30340;&#29366;&#24577;&#20381;&#36182;&#30340;&#37051;&#22495;&#23545;&#30340;&#29366;&#24577;&#24179;&#22343;&#26356;&#26032;&#20854;&#29366;&#24577;&#12290;&#30456;&#36739;&#20110;&#24102;&#26377;&#20108;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#22270;&#19978;&#30340;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65292;&#36825;&#20010;&#21160;&#21147;&#23398;&#19981;&#20250;&#25910;&#25947;&#21040;&#21021;&#22987;&#29366;&#24577;&#30340;&#24179;&#22343;&#20540;&#65292;&#32780;&#26159;&#20943;&#23569;&#20102;&#21021;&#24577;&#21644;&#36229;&#22270;&#25299;&#25169;&#30340;&#22797;&#26434;&#30456;&#20114;&#20316;&#29992;&#21644;&#26356;&#26032;&#30340;&#38750;&#32447;&#24615;&#20135;&#29983;&#39640;&#38454;&#21160;&#21147;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Complex networked systems in fields such as physics, biology, and social sciences often involve interactions that extend beyond simple pairwise ones. Hypergraphs serve as powerful modeling tools for describing and analyzing the intricate behaviors of systems with multi-body interactions. Herein, we investigate a discrete-time nonlinear averaging dynamics with three-body interactions: an underlying hypergraph, comprising triples as hyperedges, delineates the structure of these interactions, while the vertices update their states through a weighted, state-dependent average of neighboring pairs' states. This dynamics captures reinforcing group effects, such as peer pressure, and exhibits higher-order dynamical effects resulting from a complex interplay between initial states, hypergraph topology, and nonlinearity of the update. Differently from linear averaging dynamics on graphs with two-body interactions, this model does not converge to the average of the initial states but rather induc
&lt;/p&gt;</description></item></channel></rss>