<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#29289;&#32852;&#32593;&#21644;&#26426;&#22120;&#23398;&#20064;&#30340;&#26234;&#33021;&#20892;&#19994;&#28201;&#23460;&#25511;&#21046;&#31995;&#32479;&#65292;&#36890;&#36807;&#30417;&#27979;&#21644;&#35843;&#25511;&#28201;&#23460;&#20869;&#29615;&#22659;&#26465;&#20214;&#65292;&#25552;&#39640;&#20316;&#29289;&#29983;&#38271;&#25928;&#29575;&#21644;&#20135;&#37327;&#65292;&#20943;&#23569;&#36164;&#28304;&#28010;&#36153;&#12290;</title><link>https://arxiv.org/abs/2402.09488</link><description>&lt;p&gt;
&#22522;&#20110;&#29289;&#32852;&#32593;&#21644;&#26426;&#22120;&#23398;&#20064;&#30340;&#26234;&#33021;&#20892;&#19994;&#28201;&#23460;&#25511;&#21046;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Intelligent Agricultural Greenhouse Control System Based on Internet of Things and Machine Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09488
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#29289;&#32852;&#32593;&#21644;&#26426;&#22120;&#23398;&#20064;&#30340;&#26234;&#33021;&#20892;&#19994;&#28201;&#23460;&#25511;&#21046;&#31995;&#32479;&#65292;&#36890;&#36807;&#30417;&#27979;&#21644;&#35843;&#25511;&#28201;&#23460;&#20869;&#29615;&#22659;&#26465;&#20214;&#65292;&#25552;&#39640;&#20316;&#29289;&#29983;&#38271;&#25928;&#29575;&#21644;&#20135;&#37327;&#65292;&#20943;&#23569;&#36164;&#28304;&#28010;&#36153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35797;&#22270;&#23558;&#29289;&#32852;&#32593;&#21644;&#26426;&#22120;&#23398;&#20064;&#30456;&#32467;&#21512;&#65292;&#26500;&#24314;&#19968;&#20010;&#20808;&#36827;&#30340;&#20892;&#19994;&#28201;&#23460;&#25511;&#21046;&#31995;&#32479;&#12290;&#36890;&#36807;&#23545;&#28201;&#23460;&#20869;&#22266;&#26377;&#29615;&#22659;&#21442;&#25968;&#30340;&#32454;&#33268;&#30417;&#27979;&#21644;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#25972;&#21512;&#65292;&#33021;&#22815;&#36866;&#24403;&#35843;&#25511;&#28201;&#23460;&#20869;&#30340;&#26465;&#20214;&#12290;&#39044;&#26399;&#30340;&#32467;&#26524;&#26159;&#22686;&#21152;&#20316;&#29289;&#29983;&#38271;&#25928;&#29575;&#21644;&#20135;&#37327;&#65292;&#21516;&#26102;&#20943;&#23569;&#36164;&#28304;&#28010;&#36153;&#12290;&#22312;&#20840;&#29699;&#20154;&#21475;&#25345;&#32493;&#22686;&#38271;&#21644;&#27668;&#20505;&#21464;&#21270;&#19981;&#26029;&#21152;&#21095;&#30340;&#32972;&#26223;&#19979;&#65292;&#20892;&#19994;&#38754;&#20020;&#21069;&#25152;&#26410;&#26377;&#30340;&#25361;&#25112;&#12290;&#20256;&#32479;&#20892;&#19994;&#33539;&#24335;&#24050;&#32463;&#34987;&#35777;&#26126;&#26080;&#27861;&#28385;&#36275;&#39135;&#21697;&#23433;&#20840;&#21644;&#29983;&#20135;&#25928;&#29575;&#30340;&#35201;&#27714;&#12290;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#65292;&#28201;&#23460;&#20892;&#19994;&#25104;&#20026;&#19968;&#31181;&#21487;&#34892;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20026;&#20316;&#29289;&#31181;&#26893;&#25552;&#20379;&#20102;&#19968;&#20010;&#21463;&#25511;&#30340;&#29615;&#22659;&#26469;&#22686;&#21152;&#20135;&#37327;&#65292;&#25913;&#21892;&#21697;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09488v1 Announce Type: cross  Abstract: This study endeavors to conceptualize and execute a sophisticated agricultural greenhouse control system grounded in the amalgamation of the Internet of Things (IoT) and machine learning. Through meticulous monitoring of intrinsic environmental parameters within the greenhouse and the integration of machine learning algorithms, the conditions within the greenhouse are aptly modulated. The envisaged outcome is an enhancement in crop growth efficiency and yield, accompanied by a reduction in resource wastage. In the backdrop of escalating global population figures and the escalating exigencies of climate change, agriculture confronts unprecedented challenges. Conventional agricultural paradigms have proven inadequate in addressing the imperatives of food safety and production efficiency. Against this backdrop, greenhouse agriculture emerges as a viable solution, proffering a controlled milieu for crop cultivation to augment yields, refin
&lt;/p&gt;</description></item></channel></rss>