<rss version="2.0"><channel><title>Chat Arxiv cs.SY</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SY</description><item><title>&#22312;&#26080;&#30417;&#30563;&#23398;&#20064;&#35774;&#32622;&#20013;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;DANSE&#30340;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#38750;&#32447;&#24615;&#29366;&#24577;&#20272;&#35745;&#26041;&#27861;&#65292;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#25429;&#25417;&#27169;&#22411;&#26080;&#20851;&#36807;&#31243;&#20013;&#30340;&#28508;&#22312;&#38750;&#32447;&#24615;&#21160;&#24577;&#12290;</title><link>https://arxiv.org/abs/2306.03897</link><description>&lt;p&gt;
DANSE: &#26080;&#30417;&#30563;&#23398;&#20064;&#35774;&#32622;&#20013;&#27169;&#22411;&#26080;&#20851;&#36807;&#31243;&#30340;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#38750;&#32447;&#24615;&#29366;&#24577;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
DANSE: Data-driven Non-linear State Estimation of Model-free Process in Unsupervised Learning Setup
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2306.03897
&lt;/p&gt;
&lt;p&gt;
&#22312;&#26080;&#30417;&#30563;&#23398;&#20064;&#35774;&#32622;&#20013;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;DANSE&#30340;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#38750;&#32447;&#24615;&#29366;&#24577;&#20272;&#35745;&#26041;&#27861;&#65292;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#25429;&#25417;&#27169;&#22411;&#26080;&#20851;&#36807;&#31243;&#20013;&#30340;&#28508;&#22312;&#38750;&#32447;&#24615;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35299;&#20915;&#20102;&#22312;&#26080;&#30417;&#30563;&#23398;&#20064;&#35774;&#32622;&#20013;&#38024;&#23545;&#27169;&#22411;&#26080;&#20851;&#36807;&#31243;&#30340;&#36125;&#21494;&#26031;&#29366;&#24577;&#20272;&#35745;&#21644;&#39044;&#27979;&#20219;&#21153;&#12290;&#23545;&#20110;&#27169;&#22411;&#26080;&#20851;&#36807;&#31243;&#65292;&#25105;&#20204;&#27809;&#26377;&#20219;&#20309;&#20851;&#20110;&#36807;&#31243;&#21160;&#24577;&#30340;&#20808;&#39564;&#30693;&#35782;&#12290;&#22312;&#25991;&#31456;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;DANSE&#8212;&#8212;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#38750;&#32447;&#24615;&#29366;&#24577;&#20272;&#35745;&#26041;&#27861;&#12290;DANSE&#25552;&#20379;&#20102;&#32473;&#23450;&#29366;&#24577;&#30340;&#32447;&#24615;&#27979;&#37327;&#30340;&#23553;&#38381;&#24418;&#24335;&#21518;&#39564;&#27010;&#29575;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#25552;&#20379;&#20102;&#39044;&#27979;&#30340;&#23553;&#38381;&#24418;&#24335;&#21518;&#39564;&#27010;&#29575;&#12290;DANSE&#20013;&#20351;&#29992;&#25968;&#25454;&#39537;&#21160;&#30340;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65288;RNN&#65289;&#26469;&#25552;&#20379;&#29366;&#24577;&#20808;&#39564;&#30340;&#21442;&#25968;&#12290;&#20808;&#39564;&#20381;&#36182;&#20110;&#36807;&#21435;&#30340;&#27979;&#37327;&#20316;&#20026;&#36755;&#20837;&#65292;&#28982;&#21518;&#20351;&#29992;&#24403;&#21069;&#27979;&#37327;&#20316;&#20026;&#36755;&#20837;&#25214;&#21040;&#29366;&#24577;&#30340;&#23553;&#38381;&#24418;&#24335;&#21518;&#39564;&#27010;&#29575;&#12290;&#25968;&#25454;&#39537;&#21160;&#30340;RNN&#25429;&#25417;&#27169;&#22411;&#26080;&#20851;&#36807;&#31243;&#30340;&#28508;&#22312;&#38750;&#32447;&#24615;&#21160;&#24577;&#12290;DANSE&#30340;&#35757;&#32451;&#65292;&#20027;&#35201;&#26159;&#23398;&#20064;RNN&#30340;&#21442;&#25968;&#65292;&#26159;&#20351;&#29992;&#26080;&#30417;&#30563;&#30340;&#26041;&#27861;&#36827;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2306.03897v2 Announce Type: replace-cross  Abstract: We address the tasks of Bayesian state estimation and forecasting for a model-free process in an unsupervised learning setup. For a model-free process, we do not have any a-priori knowledge of the process dynamics. In the article, we propose DANSE -- a Data-driven Nonlinear State Estimation method. DANSE provides a closed-form posterior of the state of the model-free process, given linear measurements of the state. In addition, it provides a closed-form posterior for forecasting. A data-driven recurrent neural network (RNN) is used in DANSE to provide the parameters of a prior of the state. The prior depends on the past measurements as input, and then we find the closed-form posterior of the state using the current measurement as input. The data-driven RNN captures the underlying non-linear dynamics of the model-free process. The training of DANSE, mainly learning the parameters of the RNN, is executed using an unsupervised lea
&lt;/p&gt;</description></item></channel></rss>