<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36328;&#21457;&#35328;&#26465;&#20214;&#21270;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#26694;&#26550;&#65292;&#21033;&#29992;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#21644;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#26469;&#22686;&#24378;&#35821;&#38899;&#21512;&#25104;&#30340;&#38901;&#24459;&#65292;&#24182;&#30830;&#20445;&#33258;&#28982;&#35821;&#38899;&#29983;&#25104;&#12290;&#35813;&#26694;&#26550;&#30340;&#26680;&#24515;&#32452;&#20214;&#26159;&#36328;&#21457;&#35328;CVAE&#65292;&#36890;&#36807;&#25552;&#21462;&#21608;&#22260;&#21477;&#23376;&#30340;&#22768;&#23398;&#12289;&#35828;&#35805;&#20154;&#21644;&#25991;&#26412;&#29305;&#24449;&#26469;&#29983;&#25104;&#19978;&#19979;&#25991;&#25935;&#24863;&#30340;&#38901;&#24459;&#29305;&#24449;&#65292;&#26377;&#25928;&#27169;&#25311;&#20154;&#31867;&#38901;&#24459;&#29983;&#25104;&#12290;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#36824;&#25552;&#20986;&#20102;&#20004;&#20010;&#23454;&#29992;&#31639;&#27861;&#65306;CUC-VAE TTS&#29992;&#20110;&#25991;&#26412;&#21040;&#35821;&#38899;&#21512;&#25104;&#21644;CUC-VAE SE&#29992;&#20110;&#35821;&#38899;&#32534;&#36753;&#12290;</title><link>http://arxiv.org/abs/2309.04156</link><description>&lt;p&gt;
&#36328;&#21457;&#35328;&#26465;&#20214;&#21270;VAE&#35821;&#38899;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Cross-Utterance Conditioned VAE for Speech Generation. (arXiv:2309.04156v1 [cs.SD])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04156
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36328;&#21457;&#35328;&#26465;&#20214;&#21270;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#26694;&#26550;&#65292;&#21033;&#29992;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#21644;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#26469;&#22686;&#24378;&#35821;&#38899;&#21512;&#25104;&#30340;&#38901;&#24459;&#65292;&#24182;&#30830;&#20445;&#33258;&#28982;&#35821;&#38899;&#29983;&#25104;&#12290;&#35813;&#26694;&#26550;&#30340;&#26680;&#24515;&#32452;&#20214;&#26159;&#36328;&#21457;&#35328;CVAE&#65292;&#36890;&#36807;&#25552;&#21462;&#21608;&#22260;&#21477;&#23376;&#30340;&#22768;&#23398;&#12289;&#35828;&#35805;&#20154;&#21644;&#25991;&#26412;&#29305;&#24449;&#26469;&#29983;&#25104;&#19978;&#19979;&#25991;&#25935;&#24863;&#30340;&#38901;&#24459;&#29305;&#24449;&#65292;&#26377;&#25928;&#27169;&#25311;&#20154;&#31867;&#38901;&#24459;&#29983;&#25104;&#12290;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#36824;&#25552;&#20986;&#20102;&#20004;&#20010;&#23454;&#29992;&#31639;&#27861;&#65306;CUC-VAE TTS&#29992;&#20110;&#25991;&#26412;&#21040;&#35821;&#38899;&#21512;&#25104;&#21644;CUC-VAE SE&#29992;&#20110;&#35821;&#38899;&#32534;&#36753;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#31070;&#32463;&#32593;&#32476;&#39537;&#21160;&#30340;&#35821;&#38899;&#21512;&#25104;&#31995;&#32479;&#22312;&#22810;&#23186;&#20307;&#21046;&#20316;&#20013;&#26377;&#30528;&#28508;&#21147;&#65292;&#20294;&#24120;&#24120;&#38754;&#20020;&#20135;&#29983;&#26377;&#34920;&#29616;&#21147;&#30340;&#35821;&#38899;&#21644;&#26080;&#32541;&#32534;&#36753;&#30340;&#38382;&#39064;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#36328;&#21457;&#35328;&#26465;&#20214;&#21270;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#35821;&#38899;&#21512;&#25104;(CUC-VAE S2)&#26694;&#26550;&#65292;&#20197;&#22686;&#24378;&#38901;&#24459;&#24182;&#30830;&#20445;&#33258;&#28982;&#35821;&#38899;&#29983;&#25104;&#12290;&#35813;&#26694;&#26550;&#21033;&#29992;&#39044;&#35757;&#32451;&#35821;&#35328;&#27169;&#22411;&#30340;&#24378;&#22823;&#34920;&#29616;&#33021;&#21147;&#21644;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;(VAEs)&#30340;&#20877;&#34920;&#36798;&#33021;&#21147;&#12290;CUC-VAE S2&#26694;&#26550;&#30340;&#26680;&#24515;&#32452;&#20214;&#26159;&#36328;&#21457;&#35328;CVAE&#65292;&#23427;&#20174;&#21608;&#22260;&#30340;&#21477;&#23376;&#20013;&#25552;&#21462;&#22768;&#23398;&#12289;&#35828;&#35805;&#20154;&#21644;&#25991;&#26412;&#29305;&#24449;&#65292;&#20197;&#29983;&#25104;&#19978;&#19979;&#25991;&#25935;&#24863;&#30340;&#38901;&#24459;&#29305;&#24449;&#65292;&#26356;&#20934;&#30830;&#22320;&#27169;&#25311;&#20154;&#31867;&#38901;&#24459;&#29983;&#25104;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20986;&#20102;&#20004;&#20010;&#38024;&#23545;&#19981;&#21516;&#35821;&#38899;&#21512;&#25104;&#24212;&#29992;&#30340;&#23454;&#29992;&#31639;&#27861;&#65306;CUC-VAE TTS&#20197;&#36827;&#34892;&#25991;&#26412;&#21040;&#35821;&#38899;&#21512;&#25104;&#21644;CUC-VAE SE&#20197;&#36827;&#34892;&#35821;&#38899;&#32534;&#36753;&#12290;CUC-VAE TTS&#26159;&#35813;&#26694;&#26550;&#30340;&#30452;&#25509;&#24212;&#29992;&#65292;&#20351;&#24471;&#33021;&#22815;&#23558;&#20219;&#24847;&#25991;&#26412;&#36716;&#25104;&#35821;&#38899;&#12290;
&lt;/p&gt;
&lt;p&gt;
Speech synthesis systems powered by neural networks hold promise for multimedia production, but frequently face issues with producing expressive speech and seamless editing. In response, we present the Cross-Utterance Conditioned Variational Autoencoder speech synthesis (CUC-VAE S2) framework to enhance prosody and ensure natural speech generation. This framework leverages the powerful representational capabilities of pre-trained language models and the re-expression abilities of variational autoencoders (VAEs). The core component of the CUC-VAE S2 framework is the cross-utterance CVAE, which extracts acoustic, speaker, and textual features from surrounding sentences to generate context-sensitive prosodic features, more accurately emulating human prosody generation. We further propose two practical algorithms tailored for distinct speech synthesis applications: CUC-VAE TTS for text-to-speech and CUC-VAE SE for speech editing. The CUC-VAE TTS is a direct application of the framework, de
&lt;/p&gt;</description></item></channel></rss>