<rss version="2.0"><channel><title>Chat Arxiv cs.SI</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SI</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#24378;&#36229;&#36793;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#33410;&#28857;&#32858;&#21512;&#21644;&#33258;&#30417;&#30563;&#23545;&#27604;&#23398;&#20064;&#26469;&#35299;&#20915;&#36229;&#36793;&#39044;&#27979;&#20013;&#30340;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#20934;&#30830;&#25429;&#25417;&#33410;&#28857;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#32531;&#35299;&#25968;&#25454;&#31232;&#30095;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.05798</link><description>&lt;p&gt;
&#22686;&#24378;&#19978;&#19979;&#25991;&#24863;&#30693;&#33258;&#30417;&#30563;&#23398;&#20064;&#30340;&#36229;&#36793;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Enhancing Hyperedge Prediction with Context-Aware Self-Supervised Learning. (arXiv:2309.05798v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05798
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#24378;&#36229;&#36793;&#39044;&#27979;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#33410;&#28857;&#32858;&#21512;&#21644;&#33258;&#30417;&#30563;&#23545;&#27604;&#23398;&#20064;&#26469;&#35299;&#20915;&#36229;&#36793;&#39044;&#27979;&#20013;&#30340;&#38382;&#39064;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#20934;&#30830;&#25429;&#25417;&#33410;&#28857;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#32531;&#35299;&#25968;&#25454;&#31232;&#30095;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36229;&#22270;&#21487;&#20197;&#33258;&#28982;&#22320;&#24314;&#27169;&#32676;&#32452;&#20851;&#31995;&#65288;&#20363;&#22914;&#65292;&#19968;&#32452;&#20849;&#21516;&#36141;&#20080;&#29289;&#21697;&#30340;&#29992;&#25143;&#65289;&#65292;hyperedge&#39044;&#27979;&#26159;&#39044;&#27979;&#26410;&#26469;&#25110;&#26410;&#35266;&#23519;&#21040;&#30340;&#36229;&#36793;&#30340;&#20219;&#21153;&#65292;&#22312;&#35768;&#22810;&#23454;&#38469;&#24212;&#29992;&#20013;&#37117;&#38750;&#24120;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#30340;&#30740;&#31350;&#20013;&#24456;&#23569;&#25506;&#35752;&#20197;&#19979;&#25361;&#25112;&#65306;&#65288;C1&#65289;&#22914;&#20309;&#32858;&#21512;&#27599;&#20010;&#36229;&#36793;&#20505;&#36873;&#20013;&#30340;&#33410;&#28857;&#20197;&#20934;&#30830;&#39044;&#27979;&#36229;&#36793;&#65311;&#65288;C2&#65289;&#22914;&#20309;&#32531;&#35299;&#36229;&#36793;&#39044;&#27979;&#20013;&#22266;&#26377;&#30340;&#25968;&#25454;&#31232;&#30095;&#38382;&#39064;&#65311;&#20026;&#20102;&#21516;&#26102;&#35299;&#20915;&#36825;&#20004;&#20010;&#25361;&#25112;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#36229;&#36793;&#39044;&#27979;&#26694;&#26550;CASH&#65292;&#23427;&#37319;&#29992;&#20102;&#65288;1&#65289;&#19978;&#19979;&#25991;&#24863;&#30693;&#33410;&#28857;&#32858;&#21512;&#65292;&#31934;&#30830;&#25429;&#25417;&#27599;&#20010;&#36229;&#36793;&#20013;&#33410;&#28857;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#29992;&#20110;&#35299;&#20915;&#25361;&#25112;&#65288;C1&#65289;&#65292;&#20197;&#21450;&#65288;2&#65289;&#33258;&#30417;&#30563;&#23545;&#27604;&#23398;&#20064;&#22312;&#36229;&#36793;&#39044;&#27979;&#19978;&#19979;&#25991;&#20013;&#22686;&#24378;&#36229;&#22270;&#34920;&#31034;&#65292;&#20197;&#24212;&#23545;&#25361;&#25112;&#65288;C2&#65289;&#12290;&#27492;&#22806;&#65292;&#38024;&#23545;&#25361;&#25112;&#65288;C2&#65289;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#36229;&#36793;&#24863;&#30693;&#30340;&#25968;&#25454;&#22686;&#24378;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hypergraphs can naturally model group-wise relations (e.g., a group of users who co-purchase an item) as hyperedges. Hyperedge prediction is to predict future or unobserved hyperedges, which is a fundamental task in many real-world applications (e.g., group recommendation). Despite the recent breakthrough of hyperedge prediction methods, the following challenges have been rarely studied: (C1) How to aggregate the nodes in each hyperedge candidate for accurate hyperedge prediction? and (C2) How to mitigate the inherent data sparsity problem in hyperedge prediction? To tackle both challenges together, in this paper, we propose a novel hyperedge prediction framework (CASH) that employs (1) context-aware node aggregation to precisely capture complex relations among nodes in each hyperedge for (C1) and (2) self-supervised contrastive learning in the context of hyperedge prediction to enhance hypergraph representations for (C2). Furthermore, as for (C2), we propose a hyperedge-aware augmenta
&lt;/p&gt;</description></item></channel></rss>