<rss version="2.0"><channel><title>Chat Arxiv cs.SE</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SE</description><item><title>&#36825;&#39033;&#35843;&#26597;&#30740;&#31350;&#20102;&#29616;&#23454;&#19990;&#30028;&#20013;&#37096;&#32626;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#25968;&#25454;&#23548;&#21521;&#26550;&#26500;&#65288;DOA&#65289;&#30340;&#37319;&#29992;&#24773;&#20917;&#65292;&#21457;&#29616;&#23613;&#31649;&#27809;&#26377;&#26126;&#30830;&#25552;&#21450;DOA&#65292;&#20294;&#35768;&#22810;&#35770;&#25991;&#20013;&#30340;&#35774;&#35745;&#20915;&#31574;&#40664;&#40664;&#22320;&#36981;&#24490;&#20102;DOA&#30340;&#21407;&#21017;&#12290;</title><link>http://arxiv.org/abs/2302.04810</link><description>&lt;p&gt;
&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#65306;&#22522;&#20110;&#25968;&#25454;&#23548;&#21521;&#26550;&#26500;&#30340;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Real-world Machine Learning Systems: A survey from a Data-Oriented Architecture Perspective. (arXiv:2302.04810v2 [cs.SE] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04810
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#35843;&#26597;&#30740;&#31350;&#20102;&#29616;&#23454;&#19990;&#30028;&#20013;&#37096;&#32626;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#25968;&#25454;&#23548;&#21521;&#26550;&#26500;&#65288;DOA&#65289;&#30340;&#37319;&#29992;&#24773;&#20917;&#65292;&#21457;&#29616;&#23613;&#31649;&#27809;&#26377;&#26126;&#30830;&#25552;&#21450;DOA&#65292;&#20294;&#35768;&#22810;&#35770;&#25991;&#20013;&#30340;&#35774;&#35745;&#20915;&#31574;&#40664;&#40664;&#22320;&#36981;&#24490;&#20102;DOA&#30340;&#21407;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#23545;&#20154;&#24037;&#26234;&#33021;&#30340;&#20852;&#36259;&#19981;&#26029;&#22686;&#38271;&#65292;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#27491;&#22312;&#20316;&#20026;&#29616;&#23454;&#19990;&#30028;&#31995;&#32479;&#30340;&#19968;&#37096;&#20998;&#37096;&#32626;&#12290;&#36825;&#20123;&#31995;&#32479;&#30340;&#35774;&#35745;&#12289;&#23454;&#29616;&#21644;&#32500;&#25252;&#21463;&#21040;&#29616;&#23454;&#19990;&#30028;&#29615;&#22659;&#30340;&#25361;&#25112;&#65292;&#36825;&#20123;&#29615;&#22659;&#20135;&#29983;&#20102;&#26356;&#22810;&#30340;&#24322;&#26500;&#25968;&#25454;&#65292;&#29992;&#25143;&#38656;&#35201;&#26356;&#24555;&#30340;&#21709;&#24212;&#36895;&#24230;&#21644;&#39640;&#25928;&#30340;&#36164;&#28304;&#28040;&#32791;&#12290;&#36825;&#20123;&#35201;&#27714;&#23558;&#26222;&#36941;&#23384;&#22312;&#30340;&#36719;&#20214;&#26550;&#26500;&#25512;&#21521;&#20102;&#26497;&#38480;&#65292;&#24403;&#37096;&#32626;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#31995;&#32479;&#26102;&#12290;&#25968;&#25454;&#23548;&#21521;&#26550;&#26500;&#65288;DOA&#65289;&#26159;&#19968;&#20010;&#26032;&#20852;&#30340;&#27010;&#24565;&#65292;&#23427;&#33021;&#26356;&#22909;&#22320;&#20026;&#38598;&#25104;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#31995;&#32479;&#25552;&#20379;&#25903;&#25345;&#12290;DOA&#25193;&#23637;&#20102;&#24403;&#21069;&#30340;&#26550;&#26500;&#65292;&#21019;&#24314;&#20102;&#25968;&#25454;&#39537;&#21160;&#12289;&#26494;&#32806;&#21512;&#12289;&#21435;&#20013;&#24515;&#21270;&#21644;&#24320;&#25918;&#30340;&#31995;&#32479;&#12290;&#23613;&#31649;&#37096;&#32626;&#30340;&#26426;&#22120;&#23398;&#20064;&#31995;&#32479;&#30340;&#35770;&#25991;&#20013;&#27809;&#26377;&#25552;&#21040;DOA&#65292;&#20294;&#23427;&#20204;&#30340;&#20316;&#32773;&#22312;&#35774;&#35745;&#19978;&#38544;&#21547;&#22320;&#36981;&#24490;&#20102;DOA&#12290;&#20026;&#20160;&#20040;&#12289;&#22914;&#20309;&#20197;&#21450;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#37319;&#29992;DOA&#22312;&#36825;&#20123;&#31995;&#32479;&#20013;&#23578;&#19981;&#28165;&#26970;&#12290;&#38544;&#21547;&#30340;&#35774;&#35745;&#20915;&#31574;&#38480;&#21046;&#20102;&#20174;&#19994;&#32773;&#23545;&#20110;&#35774;&#35745;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#31995;&#32479;&#26102;DOA&#30340;&#35748;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine Learning models are being deployed as parts of real-world systems with the upsurge of interest in artificial intelligence. The design, implementation, and maintenance of such systems are challenged by real-world environments that produce larger amounts of heterogeneous data and users requiring increasingly faster responses with efficient resource consumption. These requirements push prevalent software architectures to the limit when deploying ML-based systems. Data-oriented Architecture (DOA) is an emerging concept that equips systems better for integrating ML models. DOA extends current architectures to create data-driven, loosely coupled, decentralised, open systems. Even though papers on deployed ML-based systems do not mention DOA, their authors made design decisions that implicitly follow DOA. The reasons why, how, and the extent to which DOA is adopted in these systems are unclear. Implicit design decisions limit the practitioners' knowledge of DOA to design ML-based syst
&lt;/p&gt;</description></item></channel></rss>