<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#27169;&#24577;&#22768;&#38899;&#28151;&#21512;&#32534;&#36753;&#22120;&#65292;&#36890;&#36807;&#29992;&#25143;&#25552;&#20379;&#30340;&#25991;&#26412;&#25351;&#20196;&#23454;&#29616;&#23545;&#22768;&#38899;&#28304;&#30340;&#20462;&#25913;&#65292;&#23454;&#29616;&#20102;&#21516;&#26102;&#32534;&#36753;&#22810;&#20010;&#22768;&#38899;&#28304;&#30340;&#33021;&#21147;&#65292;&#26080;&#38656;&#23558;&#23427;&#20204;&#20998;&#31163;&#12290;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#32534;&#36753;&#22120;&#30340;&#23454;&#29992;&#24615;&#21644;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.03710</link><description>&lt;p&gt;
&#21548;&#12289;&#32842;&#12289;&#32534;&#36753;&#65306;&#22522;&#20110;&#25991;&#26412;&#25351;&#23548;&#30340;&#22768;&#26223;&#20462;&#25913;&#20197;&#22686;&#24378;&#21548;&#35273;&#20307;&#39564;
&lt;/p&gt;
&lt;p&gt;
Listen, Chat, and Edit: Text-Guided Soundscape Modification for Enhanced Auditory Experience
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.03710
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#27169;&#24577;&#22768;&#38899;&#28151;&#21512;&#32534;&#36753;&#22120;&#65292;&#36890;&#36807;&#29992;&#25143;&#25552;&#20379;&#30340;&#25991;&#26412;&#25351;&#20196;&#23454;&#29616;&#23545;&#22768;&#38899;&#28304;&#30340;&#20462;&#25913;&#65292;&#23454;&#29616;&#20102;&#21516;&#26102;&#32534;&#36753;&#22810;&#20010;&#22768;&#38899;&#28304;&#30340;&#33021;&#21147;&#65292;&#26080;&#38656;&#23558;&#23427;&#20204;&#20998;&#31163;&#12290;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#32534;&#36753;&#22120;&#30340;&#23454;&#29992;&#24615;&#21644;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26085;&#24120;&#29983;&#27963;&#20013;&#65292;&#25105;&#20204;&#36935;&#21040;&#21508;&#31181;&#21508;&#26679;&#30340;&#22768;&#38899;&#65292;&#26377;&#20123;&#26159;&#25105;&#20204;&#26399;&#26395;&#30340;&#65292;&#26377;&#20123;&#26159;&#25105;&#20204;&#19981;&#24076;&#26395;&#30340;&#65292;&#23545;&#23427;&#20204;&#30340;&#23384;&#22312;&#21644;&#38899;&#37327;&#30340;&#25511;&#21046;&#26377;&#38480;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#27169;&#24577;&#22768;&#38899;&#28151;&#21512;&#32534;&#36753;&#22120;"&#21548;&#12289;&#32842;&#12289;&#32534;&#36753;"(LCE)&#65292;&#35813;&#32534;&#36753;&#22120;&#26681;&#25454;&#29992;&#25143;&#25552;&#20379;&#30340;&#25991;&#26412;&#25351;&#20196;&#20462;&#25913;&#28151;&#21512;&#20013;&#30340;&#27599;&#20010;&#22768;&#38899;&#28304;&#12290;LCE&#36890;&#36807;&#29992;&#25143;&#21451;&#22909;&#30340;&#32842;&#22825;&#30028;&#38754;&#20197;&#21450;&#20854;&#22312;&#19981;&#38656;&#35201;&#23558;&#22768;&#38899;&#28304;&#20998;&#31163;&#30340;&#24773;&#20917;&#19979;&#21516;&#26102;&#23545;&#22810;&#20010;&#22768;&#38899;&#28304;&#36827;&#34892;&#32534;&#36753;&#30340;&#33021;&#21147;&#32780;&#19982;&#20247;&#19981;&#21516;&#12290;&#29992;&#25143;&#36755;&#20837;&#24320;&#25918;&#24615;&#30340;&#25991;&#26412;&#25552;&#31034;&#65292;&#36825;&#20123;&#25552;&#31034;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#35299;&#37322;&#65292;&#29992;&#20110;&#21019;&#24314;&#32534;&#36753;&#22768;&#38899;&#28151;&#21512;&#30340;&#35821;&#20041;&#28388;&#27874;&#22120;&#12290;&#31995;&#32479;&#28982;&#21518;&#23558;&#28151;&#21512;&#35299;&#26512;&#25104;&#20854;&#32452;&#25104;&#37096;&#20998;&#65292;&#24212;&#29992;&#35821;&#20041;&#28388;&#27874;&#22120;&#65292;&#24182;&#23558;&#20854;&#37325;&#26032;&#32452;&#35013;&#25104;&#26399;&#26395;&#30340;&#36755;&#20986;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#21253;&#25324;&#35821;&#38899;&#21644;&#21508;&#31181;&#38899;&#39057;&#28304;&#20197;&#21450;&#29992;&#20110;&#19981;&#21516;&#32534;&#36753;&#20219;&#21153;&#30340;&#25991;&#26412;&#25552;&#31034;&#30340;160&#23567;&#26102;&#25968;&#25454;&#38598;&#65292;&#21253;&#25324;&#25552;&#21462;&#12289;&#21024;&#38500;&#21644;&#38899;&#37327;&#25511;&#21046;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
In daily life, we encounter a variety of sounds, both desirable and undesirable, with limited control over their presence and volume. Our work introduces "Listen, Chat, and Edit" (LCE), a novel multimodal sound mixture editor that modifies each sound source in a mixture based on user-provided text instructions. LCE distinguishes itself with a user-friendly chat interface and its unique ability to edit multiple sound sources simultaneously within a mixture, without needing to separate them. Users input open-vocabulary text prompts, which are interpreted by a large language model to create a semantic filter for editing the sound mixture. The system then decomposes the mixture into its components, applies the semantic filter, and reassembles it into the desired output. We developed a 160-hour dataset with over 100k mixtures, including speech and various audio sources, along with text prompts for diverse editing tasks like extraction, removal, and volume control. Our experiments demonstrat
&lt;/p&gt;</description></item></channel></rss>