<rss version="2.0"><channel><title>Chat Arxiv cs.SD</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.SD</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#25193;&#25955;&#27169;&#22411;&#30340;&#38899;&#39057;&#24674;&#22797;&#31639;&#27861;&#65292;&#37325;&#28857;&#20851;&#27880;&#35821;&#38899;&#22686;&#24378;&#21644;&#38899;&#20048;&#24674;&#22797;&#20219;&#21153;&#12290;</title><link>https://arxiv.org/abs/2402.09821</link><description>&lt;p&gt;
&#38899;&#39057;&#24674;&#22797;&#30340;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Diffusion Models for Audio Restoration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09821
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#25193;&#25955;&#27169;&#22411;&#30340;&#38899;&#39057;&#24674;&#22797;&#31639;&#27861;&#65292;&#37325;&#28857;&#20851;&#27880;&#35821;&#38899;&#22686;&#24378;&#21644;&#38899;&#20048;&#24674;&#22797;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#38899;&#39057;&#25773;&#25918;&#35774;&#22791;&#21644;&#24555;&#36895;&#25968;&#25454;&#20256;&#36755;&#30340;&#21457;&#23637;&#65292;&#23545;&#39640;&#38899;&#36136;&#30340;&#38656;&#27714;&#22312;&#23089;&#20048;&#21644;&#36890;&#20449;&#39046;&#22495;&#19981;&#26029;&#22686;&#38271;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#24405;&#21046;&#36807;&#31243;&#20013;&#30340;&#22833;&#30495;&#21644;&#24178;&#25200;&#65292;&#25110;&#32773;&#30001;&#20110;&#19981;&#23436;&#21892;&#30340;&#20256;&#36755;&#31649;&#36947;&#65292;&#38899;&#39057;&#36136;&#37327;&#38754;&#20020;&#35768;&#22810;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#38899;&#39057;&#24674;&#22797;&#26041;&#27861;&#26088;&#22312;&#20174;&#25439;&#22351;&#30340;&#36755;&#20837;&#25968;&#25454;&#20013;&#24674;&#22797;&#20986;&#28165;&#26224;&#30340;&#38899;&#39057;&#20449;&#21495;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#25193;&#25955;&#27169;&#22411;&#30340;&#38899;&#39057;&#24674;&#22797;&#31639;&#27861;&#65292;&#37325;&#28857;&#20851;&#27880;&#35821;&#38899;&#22686;&#24378;&#21644;&#38899;&#20048;&#24674;&#22797;&#20219;&#21153;&#12290;&#20256;&#32479;&#26041;&#27861;&#36890;&#24120;&#22522;&#20110;&#25163;&#24037;&#35268;&#21017;&#21644;&#32479;&#35745;&#21551;&#21457;&#27861;&#65292;&#20174;&#32780;&#24314;&#31435;&#20102;&#25105;&#20204;&#23545;&#38899;&#39057;&#20449;&#21495;&#30340;&#35748;&#35782;&#12290;&#36817;&#20960;&#21313;&#24180;&#26469;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#36716;&#21521;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNNs&#65289;&#30340;&#24314;&#27169;&#33021;&#21147;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#12290;&#28145;&#24230;&#29983;&#25104;&#27169;&#22411;&#20013;&#30340;&#25193;&#25955;&#27169;&#22411;&#25104;&#20026;&#19968;&#31181;&#26032;&#20852;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09821v1 Announce Type: cross  Abstract: With the development of audio playback devices and fast data transmission, the demand for high sound quality is rising, for both entertainment and communications. In this quest for better sound quality, challenges emerge from distortions and interferences originating at the recording side or caused by an imperfect transmission pipeline. To address this problem, audio restoration methods aim to recover clean sound signals from the corrupted input data. We present here audio restoration algorithms based on diffusion models, with a focus on speech enhancement and music restoration tasks. Traditional approaches, often grounded in handcrafted rules and statistical heuristics, have shaped our understanding of audio signals. In the past decades, there has been a notable shift towards data-driven methods that exploit the modeling capabilities of deep neural networks (DNNs). Deep generative models, and among them diffusion models, have emerged 
&lt;/p&gt;</description></item></channel></rss>