<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35774;&#35745;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#21644;&#26816;&#27979;&#35268;&#21017;&#65292;&#36890;&#36807;&#20851;&#38190;&#32479;&#35745;&#37327;&#21644;&#31192;&#23494;&#23494;&#38053;&#25511;&#21046;&#35823;&#25253;&#29575;&#65292;&#21516;&#26102;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2404.01245</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#26694;&#26550;: &#26530;&#36724;&#12289;&#26816;&#27979;&#25928;&#29575;&#21644;&#26368;&#20248;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
A Statistical Framework of Watermarks for Large Language Models: Pivot, Detection Efficiency and Optimal Rules
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01245
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#29992;&#20110;&#35774;&#35745;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#21644;&#26816;&#27979;&#35268;&#21017;&#65292;&#36890;&#36807;&#20851;&#38190;&#32479;&#35745;&#37327;&#21644;&#31192;&#23494;&#23494;&#38053;&#25511;&#21046;&#35823;&#25253;&#29575;&#65292;&#21516;&#26102;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;ChatGPT&#20110;2022&#24180;11&#26376;&#25512;&#20986;&#20197;&#26469;&#65292;&#23558;&#20960;&#20046;&#19981;&#21487;&#23519;&#35273;&#30340;&#32479;&#35745;&#20449;&#21495;&#23884;&#20837;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#29983;&#25104;&#30340;&#25991;&#26412;&#20013;&#65292;&#20063;&#34987;&#31216;&#20026;&#27700;&#21360;&#65292;&#24050;&#34987;&#29992;&#20316;&#20174;&#20854;&#20154;&#31867;&#25776;&#20889;&#23545;&#24212;&#29289;&#19978;&#21487;&#35777;&#26816;&#27979;LLM&#29983;&#25104;&#25991;&#26412;&#30340;&#21407;&#21017;&#24615;&#26041;&#27861;&#12290; &#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#36890;&#29992;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#25512;&#29702;&#27700;&#21360;&#30340;&#32479;&#35745;&#25928;&#29575;&#24182;&#35774;&#35745;&#24378;&#22823;&#30340;&#26816;&#27979;&#35268;&#21017;&#12290;&#21463;&#27700;&#21360;&#26816;&#27979;&#30340;&#20551;&#35774;&#26816;&#39564;&#20844;&#24335;&#21551;&#21457;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#39318;&#20808;&#36873;&#25321;&#25991;&#26412;&#30340;&#26530;&#36724;&#32479;&#35745;&#37327;&#21644;&#30001;LLM&#25552;&#20379;&#32473;&#39564;&#35777;&#22120;&#30340;&#31192;&#23494;&#23494;&#38053;&#65292;&#20197;&#23454;&#29616;&#25511;&#21046;&#35823;&#25253;&#29575;&#65288;&#23558;&#20154;&#31867;&#25776;&#20889;&#30340;&#25991;&#26412;&#38169;&#35823;&#22320;&#26816;&#27979;&#20026;LLM&#29983;&#25104;&#30340;&#38169;&#35823;&#65289;&#12290; &#25509;&#19979;&#26469;&#65292;&#35813;&#26694;&#26550;&#20801;&#35768;&#36890;&#36807;&#33719;&#21462;&#28176;&#36817;&#38169;&#35823;&#36127;&#29575;&#65288;&#23558;LLM&#29983;&#25104;&#25991;&#26412;&#38169;&#35823;&#22320;&#26816;&#27979;&#20026;&#20154;&#31867;&#25776;&#20889;&#30340;&#38169;&#35823;&#65289;&#30340;&#23553;&#38381;&#24418;&#24335;&#34920;&#36798;&#24335;&#26469;&#35780;&#20272;&#27700;&#21360;&#26816;&#27979;&#35268;&#21017;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01245v1 Announce Type: cross  Abstract: Since ChatGPT was introduced in November 2022, embedding (nearly) unnoticeable statistical signals into text generated by large language models (LLMs), also known as watermarking, has been used as a principled approach to provable detection of LLM-generated text from its human-written counterpart. In this paper, we introduce a general and flexible framework for reasoning about the statistical efficiency of watermarks and designing powerful detection rules. Inspired by the hypothesis testing formulation of watermark detection, our framework starts by selecting a pivotal statistic of the text and a secret key -- provided by the LLM to the verifier -- to enable controlling the false positive rate (the error of mistakenly detecting human-written text as LLM-generated). Next, this framework allows one to evaluate the power of watermark detection rules by obtaining a closed-form expression of the asymptotic false negative rate (the error of 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#20108;&#36873;&#19968;&#27169;&#22411;&#30340;&#35782;&#21035;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#24182;&#35777;&#26126;&#20854;&#36275;&#20197;&#23454;&#29616;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#27979;&#35797;&#26469;&#26816;&#39564;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#65292;&#24182;&#21487;&#20351;&#29992;&#29616;&#26377;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#23454;&#26045;&#12290;</title><link>http://arxiv.org/abs/2206.10475</link><description>&lt;p&gt;
&#20108;&#36873;&#19968;&#27169;&#22411;&#20013;&#22266;&#23450;&#25928;&#24212;&#35782;&#21035;&#30340;&#26032;&#21487;&#33021;&#24615;
&lt;/p&gt;
&lt;p&gt;
New possibilities in identification of binary choice models with fixed effects. (arXiv:2206.10475v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.10475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#20108;&#36873;&#19968;&#27169;&#22411;&#30340;&#35782;&#21035;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#24182;&#35777;&#26126;&#20854;&#36275;&#20197;&#23454;&#29616;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#27979;&#35797;&#26469;&#26816;&#39564;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#65292;&#24182;&#21487;&#20351;&#29992;&#29616;&#26377;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#23454;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#20108;&#36873;&#19968;&#27169;&#22411;&#30340;&#35782;&#21035;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#31216;&#20026;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#30340;&#26465;&#20214;&#65292;&#24182;&#35777;&#26126;&#35813;&#26465;&#20214;&#36275;&#20197;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#35782;&#21035;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#21487;&#20197;&#20445;&#35777;&#21363;&#20351;&#22312;&#26377;&#30028;&#30340;&#22238;&#24402;&#21464;&#37327;&#24773;&#20917;&#19979;&#20063;&#33021;&#23454;&#29616;&#35782;&#21035;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#38500;&#38750;&#35823;&#24046;&#20998;&#24067;&#23646;&#20110;&#19968;&#20010;&#23567;&#31867;&#21035;&#65292;&#21542;&#21017;&#26080;&#27861;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#35782;&#21035;&#12290;&#30456;&#21516;&#30340;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#20063;&#23545;&#20110;&#35782;&#21035;&#27835;&#30103;&#25928;&#24212;&#30340;&#31526;&#21495;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#27979;&#35797;&#26469;&#26816;&#26597;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#65292;&#24182;&#21487;&#20197;&#20351;&#29992;&#29616;&#26377;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#23454;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the identification of binary choice models with fixed effects. We provide a condition called sign saturation and show that this condition is sufficient for the identification of the model. In particular, we can guarantee identification even with bounded regressors. We also show that without this condition, the model is not identified unless the error distribution belongs to a small class. The same sign saturation condition is also essential for identifying the sign of treatment effects. A test is provided to check the sign saturation condition and can be implemented using existing algorithms for the maximum score estimator.
&lt;/p&gt;</description></item></channel></rss>