<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2404.00221</link><description>&lt;p&gt;
&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#24378;&#20581;&#23398;&#20064;&#20197;&#33719;&#24471;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Robust Learning for Optimal Dynamic Treatment Regimes with Observational Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00221
&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20844;&#20849;&#25919;&#31574;&#21644;&#21307;&#30103;&#24178;&#39044;&#28041;&#21450;&#20854;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#21160;&#24577;&#24615;&#65292;&#27835;&#30103;&#36890;&#24120;&#20381;&#25454;&#20808;&#21069;&#27835;&#30103;&#30340;&#21382;&#21490;&#21644;&#30456;&#20851;&#29305;&#24449;&#23545;&#27599;&#20010;&#38454;&#27573;&#30340;&#25928;&#26524;&#20855;&#26377;&#24322;&#36136;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#32479;&#35745;&#23398;&#20064;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;(DTR)&#65292;&#26681;&#25454;&#20010;&#20307;&#30340;&#21382;&#21490;&#25351;&#23548;&#27599;&#20010;&#38454;&#27573;&#30340;&#26368;&#20339;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#35266;&#27979;&#25968;&#25454;&#30340;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#22312;&#39034;&#24207;&#21487;&#24573;&#30053;&#24615;&#20551;&#35774;&#19979;&#23398;&#20064;&#26368;&#20339;DTR&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#39034;&#24207;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#65292;&#22312;&#27599;&#19968;&#27493;&#20013;&#65292;&#25105;&#20204;&#32467;&#21512;&#20542;&#21521;&#35780;&#20998;&#21644;&#34892;&#21160;&#20540;&#20989;&#25968;(Q&#20989;&#25968;)&#30340;&#20272;&#35745;&#37327;&#65292;&#26500;&#24314;&#20102;&#25919;&#31574;&#20215;&#20540;&#30340;&#22686;&#24378;&#21453;&#21521;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00221v1 Announce Type: cross  Abstract: Many public policies and medical interventions involve dynamics in their treatment assignments, where treatments are sequentially assigned to the same individuals across multiple stages, and the effect of treatment at each stage is usually heterogeneous with respect to the history of prior treatments and associated characteristics. We study statistical learning of optimal dynamic treatment regimes (DTRs) that guide the optimal treatment assignment for each individual at each stage based on the individual's history. We propose a step-wise doubly-robust approach to learn the optimal DTR using observational data under the assumption of sequential ignorability. The approach solves the sequential treatment assignment problem through backward induction, where, at each step, we combine estimators of propensity scores and action-value functions (Q-functions) to construct augmented inverse probability weighting estimators of values of policies 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2209.00991</link><description>&lt;p&gt;
E-backtesting&#8212;&#8212;&#19968;&#31181;ES&#39044;&#27979;&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;
&lt;/p&gt;
&lt;p&gt;
E-backtesting. (arXiv:2209.00991v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.00991
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#30340;&#24052;&#22622;&#23572;&#21327;&#35758;&#20013;&#65292;&#39044;&#26399;&#25439;&#22833;&#65288;ES&#65289;&#21462;&#20195;&#20102;&#20215;&#20540;&#25439;&#22833;&#65288;VaR&#65289;&#25104;&#20026;&#38134;&#34892;&#19994;&#24066;&#22330;&#39118;&#38505;&#30340;&#26631;&#20934;&#39118;&#38505;&#24230;&#37327;&#65292;&#20351;&#23427;&#25104;&#20026;&#37329;&#34701;&#30417;&#31649;&#20013;&#26368;&#37325;&#35201;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#39118;&#38505;&#24314;&#27169;&#23454;&#36341;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#20043;&#19968;&#26159;&#22238;&#27979;&#37329;&#34701;&#26426;&#26500;&#25552;&#20379;&#30340;ES&#39044;&#27979;&#12290;&#20026;&#20102;&#35774;&#35745;&#19968;&#31181;ES&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#26368;&#36817;&#21457;&#23637;&#30340;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#12290;&#24341;&#20837;&#20102;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#26469;&#21046;&#23450;&#39118;&#38505;&#24230;&#37327;&#39044;&#27979;&#30340;E-&#36807;&#31243;&#65292;&#24182;&#21033;&#29992;&#37492;&#21035;&#20989;&#25968;&#30340;&#26368;&#26032;&#32467;&#26524;&#20026;VaR&#21644;ES&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#30830;&#23450;&#20102;&#29420;&#29305;&#30340;&#24418;&#24335;&#12290;&#23545;&#20110;&#32473;&#23450;&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#65292;&#30740;&#31350;&#20102;&#26500;&#24314;E-&#36807;&#31243;&#30340;&#26368;&#20248;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#22823;&#37327;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#25968;&#25454;&#20998;&#26512;&#65292;&#20197;&#35828;&#26126;&#26080;&#27169;&#22411;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the recent Basel Accords, the Expected Shortfall (ES) replaces the Value-at-Risk (VaR) as the standard risk measure for market risk in the banking sector, making it the most important risk measure in financial regulation. One of the most challenging tasks in risk modeling practice is to backtest ES forecasts provided by financial institutions. To design a model-free backtesting procedure for ES, we make use of the recently developed techniques of e-values and e-processes. Model-free e-statistics are introduced to formulate e-processes for risk measure forecasts, and unique forms of model-free e-statistics for VaR and ES are characterized using recent results on identification functions. For a given model-free e-statistic, optimal ways of constructing the e-processes are studied. The proposed method can be naturally applied to many other risk measures and statistical quantities. We conduct extensive simulation studies and data analysis to illustrate the advantages of the model-free b
&lt;/p&gt;</description></item></channel></rss>