<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#22312;&#39640;&#32500;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32447;&#24615;&#35889;&#32479;&#35745;&#30340;&#27979;&#35797;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#35745;&#31639;&#19978;&#38750;&#24120;&#39640;&#25928;&#65292;&#24182;&#19988;&#22312;&#25152;&#26377;&#35745;&#31639;&#19978;&#39640;&#25928;&#30340;&#27979;&#35797;&#20013;&#65292;&#23454;&#29616;&#20102;&#31867;&#22411; I &#21644;&#31867;&#22411; II &#38169;&#35823;&#29575;&#20043;&#38388;&#30340;&#26368;&#20339;&#26435;&#34913;&#26354;&#32447;&#12290;</title><link>http://arxiv.org/abs/2311.00289</link><description>&lt;p&gt;
&#39640;&#25928;&#27979;&#35797;&#30340;&#31934;&#30830;&#38169;&#35823;&#29575;
&lt;/p&gt;
&lt;p&gt;
Precise Error Rates for Computationally Efficient Testing. (arXiv:2311.00289v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00289
&lt;/p&gt;
&lt;p&gt;
&#22312;&#39640;&#32500;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32447;&#24615;&#35889;&#32479;&#35745;&#30340;&#27979;&#35797;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#35745;&#31639;&#19978;&#38750;&#24120;&#39640;&#25928;&#65292;&#24182;&#19988;&#22312;&#25152;&#26377;&#35745;&#31639;&#19978;&#39640;&#25928;&#30340;&#27979;&#35797;&#20013;&#65292;&#23454;&#29616;&#20102;&#31867;&#22411; I &#21644;&#31867;&#22411; II &#38169;&#35823;&#29575;&#20043;&#38388;&#30340;&#26368;&#20339;&#26435;&#34913;&#26354;&#32447;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#31616;&#21333;&#19982;&#31616;&#21333;&#20551;&#35774;&#26816;&#39564;&#30340;&#22522;&#26412;&#38382;&#39064;&#65292;&#29305;&#21035;&#20851;&#27880;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#22240;&#20026;&#22312;&#39640;&#32500;&#35774;&#32622;&#20013;&#65292;&#32479;&#35745;&#19978;&#26368;&#20248;&#30340;&#20284;&#28982;&#27604;&#26816;&#39564;&#36890;&#24120;&#26159;&#35745;&#31639;&#19978;&#38590;&#20197;&#22788;&#29702;&#30340;&#12290;&#22312;&#32463;&#20856;&#30340;&#23574;&#23792;&#32500;&#26684;&#32435;&#27169;&#22411;&#65288;&#20855;&#26377;&#19968;&#33324;&#24615; i.i.d. &#23574;&#23792;&#20808;&#39564;&#65289;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#22522;&#20110;&#32447;&#24615;&#35889;&#32479;&#35745;&#30340;&#29616;&#26377;&#27979;&#35797;&#23454;&#29616;&#20102;&#22312;&#35745;&#31639;&#19978;&#39640;&#25928;&#27979;&#35797;&#20043;&#38388;&#30340;&#26368;&#20339;&#26435;&#34913;&#26354;&#32447;&#65292;&#21363;&#20351;&#23384;&#22312;&#26356;&#22909;&#30340;&#25351;&#25968;&#26102;&#38388;&#27979;&#35797;&#12290;&#36825;&#20010;&#32467;&#26524;&#26159;&#22312;&#19968;&#20010;&#36866;&#24403;&#22797;&#26434;&#24615;&#29702;&#35770;&#30340;&#29468;&#24819;&#26465;&#20214;&#19979;&#24471;&#21040;&#30340;&#65292;&#21363;&#19968;&#20010;&#33258;&#28982;&#21152;&#24378;&#24050;&#32463;&#24314;&#31435;&#30340;&#20302;&#27425;&#25968;&#29468;&#24819;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#35889;&#26159;&#35745;&#31639;&#21463;&#38480;&#30340;&#27979;&#35797;&#30340;&#20805;&#20998;&#32479;&#35745;&#37327;&#65288;&#20294;&#19981;&#26159;&#25152;&#26377;&#27979;&#35797;&#30340;&#20805;&#20998;&#32479;&#35745;&#37327;&#65289;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#39318;&#20010;&#29992;&#20110;&#25512;&#29702;&#20851;&#20110;&#26377;&#25928;&#35745;&#31639;&#25152;&#33021;&#23454;&#29616;&#30340;&#31934;&#30830;&#28176;&#36817;&#27979;&#35797;&#35823;&#24046;&#30340;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
We revisit the fundamental question of simple-versus-simple hypothesis testing with an eye towards computational complexity, as the statistically optimal likelihood ratio test is often computationally intractable in high-dimensional settings. In the classical spiked Wigner model (with a general i.i.d. spike prior) we show that an existing test based on linear spectral statistics achieves the best possible tradeoff curve between type I and type II error rates among all computationally efficient tests, even though there are exponential-time tests that do better. This result is conditional on an appropriate complexity-theoretic conjecture, namely a natural strengthening of the well-established low-degree conjecture. Our result shows that the spectrum is a sufficient statistic for computationally bounded tests (but not for all tests).  To our knowledge, our approach gives the first tool for reasoning about the precise asymptotic testing error achievable with efficient computation. The main
&lt;/p&gt;</description></item></channel></rss>