<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21453;&#36716;&#20272;&#35745;&#26041;&#31243;&#30340;&#36890;&#29992;&#26041;&#27861;&#65292;&#23558;&#20174;&#20272;&#35745;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#30340;&#22240;&#26524;&#25512;&#26029;&#35299;&#20915;&#26041;&#26696;&#25512;&#24191;&#21040;&#20854;&#20998;&#20301;&#25968;&#65292;&#21516;&#26102;&#32473;&#20986;&#20102;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#21644;&#20998;&#20301;&#25968;&#30340;&#26377;&#25928;&#24433;&#21709;&#20989;&#25968;&#30340;&#19968;&#33324;&#26500;&#36896;&#21644;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2401.00987</link><description>&lt;p&gt;
&#21453;&#36716;&#20272;&#35745;&#26041;&#31243;&#23545;&#28508;&#22312;&#32467;&#26524;&#20998;&#20301;&#25968;&#30340;&#22240;&#26524;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inverting estimating equations for causal inference on quantiles. (arXiv:2401.00987v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.00987
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21453;&#36716;&#20272;&#35745;&#26041;&#31243;&#30340;&#36890;&#29992;&#26041;&#27861;&#65292;&#23558;&#20174;&#20272;&#35745;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#30340;&#22240;&#26524;&#25512;&#26029;&#35299;&#20915;&#26041;&#26696;&#25512;&#24191;&#21040;&#20854;&#20998;&#20301;&#25968;&#65292;&#21516;&#26102;&#32473;&#20986;&#20102;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#21644;&#20998;&#20301;&#25968;&#30340;&#26377;&#25928;&#24433;&#21709;&#20989;&#25968;&#30340;&#19968;&#33324;&#26500;&#36896;&#21644;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22240;&#26524;&#25512;&#26029;&#25991;&#29486;&#32463;&#24120;&#20851;&#27880;&#28508;&#22312;&#32467;&#26524;&#30340;&#22343;&#20540;&#20272;&#35745;&#65292;&#32780;&#28508;&#22312;&#32467;&#26524;&#30340;&#20998;&#20301;&#25968;&#21487;&#33021;&#21253;&#21547;&#37325;&#35201;&#30340;&#39069;&#22806;&#20449;&#24687;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21453;&#36716;&#20272;&#35745;&#26041;&#31243;&#30340;&#36890;&#29992;&#26041;&#27861;&#65292;&#23558;&#20174;&#20272;&#35745;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#30340;&#24191;&#27867;&#31867;&#21035;&#30340;&#22240;&#26524;&#25512;&#26029;&#35299;&#20915;&#26041;&#26696;&#25512;&#24191;&#21040;&#20854;&#20998;&#20301;&#25968;&#12290;&#25105;&#20204;&#20551;&#35774;&#23384;&#22312;&#19968;&#20010;&#21487;&#29992;&#26469;&#30830;&#23450;&#22522;&#20110;&#38408;&#20540;&#21464;&#25442;&#30340;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#30340;&#30830;&#23450;&#30697;&#20989;&#25968;&#65292;&#24182;&#22312;&#27492;&#22522;&#30784;&#19978;&#25552;&#20986;&#20102;&#28508;&#22312;&#32467;&#26524;&#20998;&#20301;&#25968;&#30340;&#20272;&#35745;&#26041;&#31243;&#30340;&#20415;&#21033;&#26500;&#36896;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#32473;&#20986;&#20102;&#28508;&#22312;&#32467;&#26524;&#22343;&#20540;&#21644;&#20998;&#20301;&#25968;&#30340;&#26377;&#25928;&#24433;&#21709;&#20989;&#25968;&#30340;&#19968;&#33324;&#26500;&#36896;&#65292;&#24182;&#30830;&#23450;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#36890;&#36807;&#26377;&#25928;&#24433;&#21709;&#20989;&#25968;&#25512;&#23548;&#20986;&#20998;&#20301;&#25968;&#30446;&#26631;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#22312;&#20351;&#29992;&#21442;&#25968;&#27169;&#22411;&#25110;&#25968;&#25454;&#33258;&#36866;&#24212;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#26102;&#24320;&#21457;&#20854;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
The causal inference literature frequently focuses on estimating the mean of the potential outcome, whereas the quantiles of the potential outcome may carry important additional information. We propose a universal approach, based on the inverse estimating equations, to generalize a wide class of causal inference solutions from estimating the mean of the potential outcome to its quantiles. We assume that an identifying moment function is available to identify the mean of the threshold-transformed potential outcome, based on which a convenient construction of the estimating equation of quantiles of potential outcome is proposed. In addition, we also give a general construction of the efficient influence functions of the mean and quantiles of potential outcomes, and identify their connection. We motivate estimators for the quantile estimands with the efficient influence function, and develop their asymptotic properties when either parametric models or data-adaptive machine learners are us
&lt;/p&gt;</description></item></channel></rss>