<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#20272;&#35745;&#22120;&#65292;&#33021;&#22815;&#40065;&#26834;&#22320;&#22788;&#29702;&#20998;&#31867;&#25968;&#25454;&#27169;&#22411;&#30340;&#35823;&#35774;&#65292;&#19981;&#20570;&#20219;&#20309;&#20551;&#35774;&#65292;&#24182;&#19988;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#20998;&#31867;&#21709;&#24212;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2403.11954</link><description>&lt;p&gt;
&#22312;&#20998;&#31867;&#25968;&#25454;&#20013;&#30340;&#40065;&#26834;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Robust Estimation and Inference in Categorical Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11954
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#20272;&#35745;&#22120;&#65292;&#33021;&#22815;&#40065;&#26834;&#22320;&#22788;&#29702;&#20998;&#31867;&#25968;&#25454;&#27169;&#22411;&#30340;&#35823;&#35774;&#65292;&#19981;&#20570;&#20219;&#20309;&#20551;&#35774;&#65292;&#24182;&#19988;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#20998;&#31867;&#21709;&#24212;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23454;&#35777;&#31185;&#23398;&#20013;&#65292;&#35768;&#22810;&#24863;&#20852;&#36259;&#30340;&#21464;&#37327;&#26159;&#20998;&#31867;&#30340;&#12290;&#19982;&#20219;&#20309;&#27169;&#22411;&#19968;&#26679;&#65292;&#23545;&#20110;&#20998;&#31867;&#21709;&#24212;&#30340;&#27169;&#22411;&#21487;&#20197;&#34987;&#35823;&#35774;&#65292;&#23548;&#33268;&#20272;&#35745;&#21487;&#33021;&#23384;&#22312;&#36739;&#22823;&#20559;&#24046;&#12290;&#19968;&#20010;&#29305;&#21035;&#40635;&#28902;&#30340;&#35823;&#35774;&#26469;&#28304;&#26159;&#22312;&#38382;&#21367;&#35843;&#26597;&#20013;&#30340;&#30095;&#24573;&#21709;&#24212;&#65292;&#20247;&#25152;&#21608;&#30693;&#36825;&#20250;&#21361;&#21450;&#32467;&#26500;&#26041;&#31243;&#27169;&#22411;&#65288;SEM&#65289;&#21644;&#20854;&#20182;&#22522;&#20110;&#35843;&#26597;&#30340;&#20998;&#26512;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#25552;&#20986;&#20102;&#19968;&#20010;&#26088;&#22312;&#23545;&#20998;&#31867;&#21709;&#24212;&#27169;&#22411;&#30340;&#35823;&#35774;&#40065;&#26834;&#30340;&#36890;&#29992;&#20272;&#35745;&#22120;&#12290;&#19982;&#36804;&#20170;&#20026;&#27490;&#30340;&#26041;&#27861;&#19981;&#21516;&#65292;&#35813;&#20272;&#35745;&#22120;&#23545;&#20998;&#31867;&#21709;&#24212;&#27169;&#22411;&#30340;&#35823;&#35774;&#31243;&#24230;&#12289;&#22823;&#23567;&#25110;&#31867;&#22411;&#19981;&#20570;&#20219;&#20309;&#20551;&#35774;&#12290;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#25512;&#24191;&#20102;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#65292;&#26159;&#24378;&#19968;&#33268;&#30340;&#65292;&#28176;&#36817;&#39640;&#26031;&#30340;&#65292;&#20855;&#26377;&#19982;&#26497;&#22823;&#20284;&#28982;&#30456;&#21516;&#30340;&#26102;&#38388;&#22797;&#26434;&#24230;&#65292;&#24182;&#19988;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#20998;&#31867;&#21709;&#24212;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#25105;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26816;&#39564;&#65292;&#29992;&#20110;&#27979;&#35797;&#19968;&#20010;&#32473;&#23450;&#21709;&#24212;&#26159;&#21542; ...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11954v1 Announce Type: cross  Abstract: In empirical science, many variables of interest are categorical. Like any model, models for categorical responses can be misspecified, leading to possibly large biases in estimation. One particularly troublesome source of misspecification is inattentive responding in questionnaires, which is well-known to jeopardize the validity of structural equation models (SEMs) and other survey-based analyses. I propose a general estimator that is designed to be robust to misspecification of models for categorical responses. Unlike hitherto approaches, the estimator makes no assumption whatsoever on the degree, magnitude, or type of misspecification. The proposed estimator generalizes maximum likelihood estimation, is strongly consistent, asymptotically Gaussian, has the same time complexity as maximum likelihood, and can be applied to any model for categorical responses. In addition, I develop a novel test that tests whether a given response can 
&lt;/p&gt;</description></item><item><title>TorchCP&#26159;&#19968;&#20010;&#22522;&#20110;PyTorch&#30340;Python&#24037;&#20855;&#21253;&#65292;&#20026;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#19978;&#30340;&#21512;&#25311;&#24120;&#35268;&#39044;&#27979;&#30740;&#31350;&#25552;&#20379;&#20102;&#23454;&#29616;&#21518;&#39564;&#21644;&#35757;&#32451;&#26041;&#27861;&#30340;&#22810;&#31181;&#24037;&#20855;&#65292;&#21253;&#25324;&#20998;&#31867;&#21644;&#22238;&#24402;&#20219;&#21153;&#12290;En_Tdlr: TorchCP is a Python toolbox built on PyTorch for conformal prediction research on deep learning models, providing various implementations for posthoc and training methods for classification and regression tasks, including multi-dimension output.</title><link>https://arxiv.org/abs/2402.12683</link><description>&lt;p&gt;
TorchCP&#65306;&#22522;&#20110;PyTorch&#30340;&#19968;&#31181;&#36866;&#29992;&#20110;&#21512;&#25311;&#24120;&#35268;&#39044;&#27979;&#30340;&#24211;
&lt;/p&gt;
&lt;p&gt;
TorchCP: A Library for Conformal Prediction based on PyTorch
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12683
&lt;/p&gt;
&lt;p&gt;
TorchCP&#26159;&#19968;&#20010;&#22522;&#20110;PyTorch&#30340;Python&#24037;&#20855;&#21253;&#65292;&#20026;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#19978;&#30340;&#21512;&#25311;&#24120;&#35268;&#39044;&#27979;&#30740;&#31350;&#25552;&#20379;&#20102;&#23454;&#29616;&#21518;&#39564;&#21644;&#35757;&#32451;&#26041;&#27861;&#30340;&#22810;&#31181;&#24037;&#20855;&#65292;&#21253;&#25324;&#20998;&#31867;&#21644;&#22238;&#24402;&#20219;&#21153;&#12290;En_Tdlr: TorchCP is a Python toolbox built on PyTorch for conformal prediction research on deep learning models, providing various implementations for posthoc and training methods for classification and regression tasks, including multi-dimension output.
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
TorchCP&#26159;&#19968;&#20010;&#29992;&#20110;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#19978;&#30340;&#21512;&#25311;&#24120;&#35268;&#39044;&#27979;&#30740;&#31350;&#30340;Python&#24037;&#20855;&#21253;&#12290;&#23427;&#21253;&#21547;&#20102;&#29992;&#20110;&#21518;&#39564;&#21644;&#35757;&#32451;&#26041;&#27861;&#30340;&#21508;&#31181;&#23454;&#29616;&#65292;&#29992;&#20110;&#20998;&#31867;&#21644;&#22238;&#24402;&#20219;&#21153;&#65288;&#21253;&#25324;&#22810;&#32500;&#36755;&#20986;&#65289;&#12290;TorchCP&#24314;&#31435;&#22312;PyTorch&#20043;&#19978;&#65292;&#24182;&#21033;&#29992;&#30697;&#38453;&#35745;&#31639;&#30340;&#20248;&#21183;&#65292;&#25552;&#20379;&#31616;&#27905;&#39640;&#25928;&#30340;&#25512;&#29702;&#23454;&#29616;&#12290;&#35813;&#20195;&#30721;&#37319;&#29992;LGPL&#35768;&#21487;&#35777;&#65292;&#24182;&#22312;$\href{https://github.com/ml-stat-Sustech/TorchCP}{\text{this https URL}}$&#24320;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12683v1 Announce Type: new  Abstract: TorchCP is a Python toolbox for conformal prediction research on deep learning models. It contains various implementations for posthoc and training methods for classification and regression tasks (including multi-dimension output). TorchCP is built on PyTorch (Paszke et al., 2019) and leverages the advantages of matrix computation to provide concise and efficient inference implementations. The code is licensed under the LGPL license and is open-sourced at $\href{https://github.com/ml-stat-Sustech/TorchCP}{\text{this https URL}}$.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#19988;&#21452;&#37325;&#40065;&#26834;&#30340;&#20272;&#35745;&#22120;TNDDR&#65292;&#29992;&#20110;&#22312;&#38452;&#24615;&#27979;&#35797;&#35774;&#35745;&#19979;&#20272;&#35745;COVID-19&#30123;&#33495;&#30340;&#26377;&#25928;&#24615;&#65292;&#21487;&#26377;&#25928;&#35299;&#20915;&#36873;&#25321;&#20559;&#24046;&#38382;&#39064;&#65292;&#24182;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#36827;&#34892;&#36741;&#21161;&#20989;&#25968;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2310.04578</link><description>&lt;p&gt;
TNDDR: &#39640;&#25928;&#19988;&#21452;&#37325;&#40065;&#26834;&#30340;COVID-19&#30123;&#33495;&#26377;&#25928;&#24615;&#20272;&#35745;&#22312;&#38452;&#24615;&#27979;&#35797;&#35774;&#35745;&#19979;
&lt;/p&gt;
&lt;p&gt;
TNDDR: Efficient and doubly robust estimation of COVID-19 vaccine effectiveness under the test-negative design. (arXiv:2310.04578v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04578
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#19988;&#21452;&#37325;&#40065;&#26834;&#30340;&#20272;&#35745;&#22120;TNDDR&#65292;&#29992;&#20110;&#22312;&#38452;&#24615;&#27979;&#35797;&#35774;&#35745;&#19979;&#20272;&#35745;COVID-19&#30123;&#33495;&#30340;&#26377;&#25928;&#24615;&#65292;&#21487;&#26377;&#25928;&#35299;&#20915;&#36873;&#25321;&#20559;&#24046;&#38382;&#39064;&#65292;&#24182;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#36827;&#34892;&#36741;&#21161;&#20989;&#25968;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#38452;&#24615;&#27979;&#35797;&#35774;&#35745;&#65288;TND&#65289;&#24120;&#29992;&#20110;&#30417;&#27979;&#23395;&#33410;&#24615;&#27969;&#24863;&#30123;&#33495;&#26377;&#25928;&#24615;&#65288;VE&#65289;&#65292;&#20294;&#26368;&#36817;&#24050;&#25104;&#20026;COVID-19&#30123;&#33495;&#30417;&#27979;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20294;&#30001;&#20110;&#32467;&#26524;&#30456;&#20851;&#25277;&#26679;&#65292;&#23427;&#23481;&#26131;&#21463;&#21040;&#36873;&#25321;&#20559;&#24046;&#30340;&#24433;&#21709;&#12290;&#19968;&#20123;&#30740;&#31350;&#24050;&#32463;&#35299;&#20915;&#20102;TND&#19979;&#22240;&#26524;&#21442;&#25968;&#30340;&#21487;&#37492;&#21035;&#24615;&#21644;&#20272;&#35745;&#38382;&#39064;&#65292;&#20294;&#23578;&#26410;&#30740;&#31350;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#22312;&#26080;&#28151;&#26434;&#24615;&#20551;&#35774;&#19979;&#30340;&#25928;&#29575;&#36793;&#30028;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;TNDDR&#65288;TND&#21452;&#37325;&#40065;&#26834;&#65289;&#30340;&#19968;&#27493;&#21452;&#37325;&#40065;&#26834;&#21644;&#23616;&#37096;&#39640;&#25928;&#20272;&#35745;&#22120;,&#23427;&#21033;&#29992;&#26679;&#26412;&#20998;&#21106;&#65292;&#24182;&#21487;&#20197;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#26469;&#20272;&#35745;&#36741;&#21161;&#20989;&#25968;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#32467;&#26524;&#36793;&#38469;&#26399;&#26395;&#30340;&#39640;&#25928;&#24433;&#21709;&#20989;&#25968;&#65288;EIF&#65289;&#65292;&#25506;&#32034;&#20102;von Mises&#23637;&#24320;&#65292;&#24182;&#24314;&#31435;&#20102;TNDDR&#30340;n&#30340;&#24179;&#26041;&#26681;&#19968;&#33268;&#24615;&#12289;&#28176;&#36817;&#27491;&#24577;&#24615;&#21644;&#21452;&#37325;&#40065;&#26834;&#24615;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
While the test-negative design (TND), which is routinely used for monitoring seasonal flu vaccine effectiveness (VE), has recently become integral to COVID-19 vaccine surveillance, it is susceptible to selection bias due to outcome-dependent sampling. Some studies have addressed the identifiability and estimation of causal parameters under the TND, but efficiency bounds for nonparametric estimators of the target parameter under the unconfoundedness assumption have not yet been investigated. We propose a one-step doubly robust and locally efficient estimator called TNDDR (TND doubly robust), which utilizes sample splitting and can incorporate machine learning techniques to estimate the nuisance functions. We derive the efficient influence function (EIF) for the marginal expectation of the outcome under a vaccination intervention, explore the von Mises expansion, and establish the conditions for $\sqrt{n}-$consistency, asymptotic normality and double robustness of TNDDR. The proposed TND
&lt;/p&gt;</description></item></channel></rss>