<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2310.15512</link><description>&lt;p&gt;
&#25512;&#35770;&#29992;&#20110;&#31561;&#32423;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Inference for Rank-Rank Regressions. (arXiv:2310.15512v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#65292;&#26012;&#29575;&#31995;&#25968;&#26159;&#34913;&#37327;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#24120;&#29992;&#25351;&#26631;&#65292;&#20363;&#22914;&#22312;&#23376;&#22899;&#25910;&#20837;&#31561;&#32423;&#19982;&#29238;&#27597;&#25910;&#20837;&#31561;&#32423;&#22238;&#24402;&#20013;&#12290;&#26412;&#25991;&#39318;&#20808;&#25351;&#20986;&#65292;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22914;&#21516;&#26041;&#24046;&#20272;&#35745;&#22120;&#25110;&#40065;&#26834;&#26041;&#24046;&#20272;&#35745;&#22120;&#26410;&#33021;&#19968;&#33268;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#30340;&#28176;&#36827;&#26041;&#24046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#20123;&#20272;&#35745;&#22120;&#30340;&#27010;&#29575;&#26497;&#38480;&#21487;&#33021;&#36807;&#22823;&#25110;&#36807;&#23567;&#65292;&#21462;&#20915;&#20110;&#23376;&#22899;&#25910;&#20837;&#21644;&#29238;&#27597;&#25910;&#20837;&#30340;&#32852;&#21512;&#20998;&#24067;&#20989;&#25968;&#30340;&#24418;&#29366;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#31561;&#32423;&#22238;&#24402;&#30340;&#19968;&#33324;&#28176;&#36827;&#29702;&#35770;&#65292;&#24182;&#25552;&#20379;&#20102;OLS&#20272;&#35745;&#22120;&#28176;&#36827;&#26041;&#24046;&#30340;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#28176;&#36827;&#29702;&#35770;&#25193;&#23637;&#21040;&#20854;&#20182;&#32463;&#39564;&#24037;&#20316;&#20013;&#28041;&#21450;&#31561;&#32423;&#30340;&#22238;&#24402;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#24212;&#29992;&#20110;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#26377;&#26102;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
Slope coefficients in rank-rank regressions are popular measures of intergenerational mobility, for instance in regressions of a child's income rank on their parent's income rank. In this paper, we first point out that commonly used variance estimators such as the homoskedastic or robust variance estimators do not consistently estimate the asymptotic variance of the OLS estimator in a rank-rank regression. We show that the probability limits of these estimators may be too large or too small depending on the shape of the copula of child and parent incomes. Second, we derive a general asymptotic theory for rank-rank regressions and provide a consistent estimator of the OLS estimator's asymptotic variance. We then extend the asymptotic theory to other regressions involving ranks that have been used in empirical work. Finally, we apply our new inference methods to three empirical studies. We find that the confidence intervals based on estimators of the correct variance may sometimes be sub
&lt;/p&gt;</description></item></channel></rss>