<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26080;&#26089;&#20572;&#30340;&#20998;&#25968;&#25193;&#25955;&#27169;&#22411;&#19981;&#38656;&#35201;&#24471;&#20998;&#20989;&#25968;&#30340;Lipschitz&#22343;&#21248;&#26465;&#20214;&#65292;&#21482;&#38656;&#35201;&#26377;&#38480;&#30340;&#36153;&#33293;&#23572;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2308.12240</link><description>&lt;p&gt;
&#26080;&#26089;&#20572;&#30340;&#20998;&#25968;&#25193;&#25955;&#27169;&#22411;&#65306;&#26377;&#38480;&#36153;&#33293;&#23572;&#20449;&#24687;&#23601;&#36275;&#22815;&#20102;
&lt;/p&gt;
&lt;p&gt;
Score diffusion models without early stopping: finite Fisher information is all you need. (arXiv:2308.12240v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12240
&lt;/p&gt;
&lt;p&gt;
&#26080;&#26089;&#20572;&#30340;&#20998;&#25968;&#25193;&#25955;&#27169;&#22411;&#19981;&#38656;&#35201;&#24471;&#20998;&#20989;&#25968;&#30340;Lipschitz&#22343;&#21248;&#26465;&#20214;&#65292;&#21482;&#38656;&#35201;&#26377;&#38480;&#30340;&#36153;&#33293;&#23572;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25968;&#25193;&#25955;&#27169;&#22411;&#26159;&#19968;&#31181;&#22260;&#32469;&#30528;&#19982;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#30456;&#20851;&#30340;&#24471;&#20998;&#20989;&#25968;&#20272;&#35745;&#30340;&#29983;&#25104;&#27169;&#22411;&#12290;&#22312;&#33719;&#24471;&#36817;&#20284;&#30340;&#24471;&#20998;&#20989;&#25968;&#20043;&#21518;&#65292;&#21033;&#29992;&#23427;&#26469;&#27169;&#25311;&#30456;&#24212;&#30340;&#26102;&#38388;&#36870;&#36807;&#31243;&#65292;&#26368;&#32456;&#23454;&#29616;&#36817;&#20284;&#25968;&#25454;&#26679;&#26412;&#30340;&#29983;&#25104;&#12290;&#23613;&#31649;&#36825;&#20123;&#27169;&#22411;&#20855;&#26377;&#26174;&#33879;&#30340;&#23454;&#38469;&#24847;&#20041;&#65292;&#20294;&#22312;&#28041;&#21450;&#38750;&#24120;&#35268;&#24471;&#20998;&#21644;&#20272;&#35745;&#22120;&#30340;&#24773;&#20917;&#19979;&#65292;&#20173;&#23384;&#22312;&#19968;&#20010;&#26174;&#33879;&#30340;&#25361;&#25112;&#65292;&#21363;&#32570;&#20047;&#20840;&#38754;&#30340;&#23450;&#37327;&#32467;&#26524;&#12290;&#22312;&#20960;&#20046;&#25152;&#26377;&#30340;Kullback Leibler&#25955;&#24230;&#30340;&#30456;&#20851;&#32467;&#26524;&#20013;&#65292;&#37117;&#20551;&#35774;&#24471;&#20998;&#20989;&#25968;&#25110;&#20854;&#36817;&#20284;&#22312;&#26102;&#38388;&#19978;&#26159;Lipschitz&#22343;&#21248;&#30340;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#36825;&#20010;&#26465;&#20214;&#38750;&#24120;&#20005;&#26684;&#65292;&#25110;&#32773;&#24456;&#38590;&#24314;&#31435;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#20808;&#21069;&#30340;&#30740;&#31350;&#20027;&#35201;&#26159;&#20851;&#27880;&#20998;&#25968;&#25193;&#25955;&#27169;&#22411;&#30340;&#26089;&#20572;&#29256;&#26412;&#22312;KL&#25955;&#24230;&#19978;&#30340;&#25910;&#25947;&#30028;&#38480;&#65292;&#24182;&#19988;...
&lt;/p&gt;
&lt;p&gt;
Diffusion models are a new class of generative models that revolve around the estimation of the score function associated with a stochastic differential equation. Subsequent to its acquisition, the approximated score function is then harnessed to simulate the corresponding time-reversal process, ultimately enabling the generation of approximate data samples. Despite their evident practical significance these models carry, a notable challenge persists in the form of a lack of comprehensive quantitative results, especially in scenarios involving non-regular scores and estimators. In almost all reported bounds in Kullback Leibler (KL) divergence, it is assumed that either the score function or its approximation is Lipschitz uniformly in time. However, this condition is very restrictive in practice or appears to be difficult to establish.  To circumvent this issue, previous works mainly focused on establishing convergence bounds in KL for an early stopped version of the diffusion model and
&lt;/p&gt;</description></item></channel></rss>