<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#39640;&#32500;&#32447;&#24615;&#36807;&#31243;&#30340;&#20855;&#26377;&#30456;&#20851;&#21019;&#26032;&#30340;&#38598;&#20013;&#24230;&#19981;&#31561;&#24335;&#65292;&#24182;&#21033;&#29992;&#35813;&#19981;&#31561;&#24335;&#33719;&#24471;&#20102;&#32447;&#24615;&#36807;&#31243;&#28382;&#21518;&#33258;&#21327;&#26041;&#24046;&#30697;&#38453;&#26368;&#22823;&#20998;&#37327;&#33539;&#25968;&#30340;&#38598;&#20013;&#24230;&#30028;&#38480;&#12290;&#36825;&#20123;&#32467;&#26524;&#22312;&#20272;&#35745;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#36807;&#31243;&#12289;&#26102;&#38388;&#24207;&#21015;&#24341;&#23548;&#21644;&#38271;&#26399;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#20013;&#20855;&#26377;&#37325;&#35201;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2307.12395</link><description>&lt;p&gt;
&#39640;&#32500;&#32447;&#24615;&#36807;&#31243;&#20013;&#20855;&#26377;&#30456;&#20851;&#21019;&#26032;&#30340;&#38598;&#20013;&#24230;
&lt;/p&gt;
&lt;p&gt;
Concentration for high-dimensional linear processes with dependent innovations. (arXiv:2307.12395v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12395
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#39640;&#32500;&#32447;&#24615;&#36807;&#31243;&#30340;&#20855;&#26377;&#30456;&#20851;&#21019;&#26032;&#30340;&#38598;&#20013;&#24230;&#19981;&#31561;&#24335;&#65292;&#24182;&#21033;&#29992;&#35813;&#19981;&#31561;&#24335;&#33719;&#24471;&#20102;&#32447;&#24615;&#36807;&#31243;&#28382;&#21518;&#33258;&#21327;&#26041;&#24046;&#30697;&#38453;&#26368;&#22823;&#20998;&#37327;&#33539;&#25968;&#30340;&#38598;&#20013;&#24230;&#30028;&#38480;&#12290;&#36825;&#20123;&#32467;&#26524;&#22312;&#20272;&#35745;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#36807;&#31243;&#12289;&#26102;&#38388;&#24207;&#21015;&#24341;&#23548;&#21644;&#38271;&#26399;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#20013;&#20855;&#26377;&#37325;&#35201;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#38024;&#23545;&#20855;&#26377;&#23376;&#38886;&#24067;&#23572;&#23614;&#30340;&#28151;&#21512;&#24207;&#21015;&#19978;&#30340;&#32447;&#24615;&#36807;&#31243;&#30340;$l_\infty$&#33539;&#25968;&#24320;&#21457;&#20102;&#38598;&#20013;&#19981;&#31561;&#24335;&#12290;&#36825;&#20123;&#19981;&#31561;&#24335;&#21033;&#29992;&#20102;Beveridge-Nelson&#20998;&#35299;&#65292;&#23558;&#38382;&#39064;&#31616;&#21270;&#20026;&#21521;&#37327;&#28151;&#21512;&#24207;&#21015;&#25110;&#20854;&#21152;&#26435;&#21644;&#30340;&#19978;&#30830;&#30028;&#33539;&#25968;&#30340;&#38598;&#20013;&#24230;&#12290;&#36825;&#20010;&#19981;&#31561;&#24335;&#29992;&#20110;&#24471;&#21040;&#32447;&#24615;&#36807;&#31243;&#30340;&#28382;&#21518;$h$&#33258;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#26368;&#22823;&#20998;&#37327;&#33539;&#25968;&#30340;&#38598;&#20013;&#24230;&#30028;&#38480;&#12290;&#36825;&#20123;&#32467;&#26524;&#23545;&#20110;&#20351;&#29992;$l_1$&#27491;&#21017;&#21270;&#20272;&#35745;&#30340;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#36807;&#31243;&#30340;&#20272;&#35745;&#30028;&#38480;&#12289;&#26102;&#38388;&#24207;&#21015;&#30340;&#39640;&#32500;&#39640;&#26031;&#24341;&#23548;&#12289;&#20197;&#21450;&#38271;&#26399;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#38750;&#24120;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop concentration inequalities for the $l_\infty$ norm of a vector linear processes on mixingale sequences with sub-Weibull tails. These inequalities make use of the Beveridge-Nelson decomposition, which reduces the problem to concentration for sup-norm of a vector-mixingale or its weighted sum. This inequality is used to obtain a concentration bound for the maximum entrywise norm of the lag-$h$ autocovariance matrices of linear processes. These results are useful for estimation bounds for high-dimensional vector-autoregressive processes estimated using $l_1$ regularisation, high-dimensional Gaussian bootstrap for time series, and long-run covariance matrix estimation.
&lt;/p&gt;</description></item></channel></rss>