<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22312;&#22810;&#29615;&#22659;&#39044;&#27979;&#38382;&#39064;&#20013;&#26500;&#24314;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#21644;&#32622;&#20449;&#38598;&#30340;&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#31181;&#26032;&#30340;&#35843;&#25972;&#26041;&#27861;&#20197;&#36866;&#24212;&#38382;&#39064;&#38590;&#24230;&#65292;&#20174;&#32780;&#20943;&#23569;&#39044;&#27979;&#38598;&#22823;&#23567;&#65292;&#36825;&#22312;&#31070;&#32463;&#24863;&#24212;&#21644;&#29289;&#31181;&#20998;&#31867;&#25968;&#25454;&#38598;&#20013;&#30340;&#23454;&#38469;&#34920;&#29616;&#20013;&#24471;&#21040;&#39564;&#35777;&#12290;</title><link>https://arxiv.org/abs/2403.16336</link><description>&lt;p&gt;
&#22810;&#29615;&#22659;&#22330;&#26223;&#20013;&#30340;&#39044;&#27979;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Predictive Inference in Multi-environment Scenarios
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16336
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22312;&#22810;&#29615;&#22659;&#39044;&#27979;&#38382;&#39064;&#20013;&#26500;&#24314;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#21644;&#32622;&#20449;&#38598;&#30340;&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#31181;&#26032;&#30340;&#35843;&#25972;&#26041;&#27861;&#20197;&#36866;&#24212;&#38382;&#39064;&#38590;&#24230;&#65292;&#20174;&#32780;&#20943;&#23569;&#39044;&#27979;&#38598;&#22823;&#23567;&#65292;&#36825;&#22312;&#31070;&#32463;&#24863;&#24212;&#21644;&#29289;&#31181;&#20998;&#31867;&#25968;&#25454;&#38598;&#20013;&#30340;&#23454;&#38469;&#34920;&#29616;&#20013;&#24471;&#21040;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35299;&#20915;&#20102;&#22312;&#36328;&#22810;&#20010;&#29615;&#22659;&#30340;&#39044;&#27979;&#38382;&#39064;&#20013;&#26500;&#24314;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#21644;&#32622;&#20449;&#38598;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36866;&#29992;&#20110;&#36825;&#20123;&#38382;&#39064;&#30340;&#20004;&#31181;&#35206;&#30422;&#31867;&#22411;&#65292;&#25193;&#23637;&#20102;Jackknife&#21644;&#20998;&#35010;&#19968;&#33268;&#26041;&#27861;&#65292;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#36825;&#31181;&#38750;&#20256;&#32479;&#30340;&#23618;&#27425;&#25968;&#25454;&#29983;&#25104;&#22330;&#26223;&#20013;&#33719;&#24471;&#26080;&#20998;&#24067;&#35206;&#30422;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#36824;&#21253;&#25324;&#23545;&#38750;&#23454;&#20540;&#21709;&#24212;&#35774;&#32622;&#30340;&#25193;&#23637;&#65292;&#20197;&#21450;&#36825;&#20123;&#19968;&#33324;&#38382;&#39064;&#20013;&#39044;&#27979;&#25512;&#26029;&#30340;&#19968;&#33268;&#24615;&#29702;&#35770;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#31181;&#26032;&#30340;&#35843;&#25972;&#26041;&#27861;&#65292;&#20197;&#36866;&#24212;&#38382;&#39064;&#38590;&#24230;&#65292;&#36825;&#36866;&#29992;&#20110;&#20855;&#26377;&#23618;&#27425;&#25968;&#25454;&#30340;&#39044;&#27979;&#25512;&#26029;&#30340;&#29616;&#26377;&#26041;&#27861;&#20197;&#21450;&#25105;&#20204;&#24320;&#21457;&#30340;&#26041;&#27861;&#65307;&#36825;&#36890;&#36807;&#31070;&#32463;&#21270;&#23398;&#24863;&#24212;&#21644;&#29289;&#31181;&#20998;&#31867;&#25968;&#25454;&#38598;&#35780;&#20272;&#20102;&#36825;&#20123;&#26041;&#27861;&#30340;&#23454;&#38469;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16336v1 Announce Type: cross  Abstract: We address the challenge of constructing valid confidence intervals and sets in problems of prediction across multiple environments. We investigate two types of coverage suitable for these problems, extending the jackknife and split-conformal methods to show how to obtain distribution-free coverage in such non-traditional, hierarchical data-generating scenarios. Our contributions also include extensions for settings with non-real-valued responses and a theory of consistency for predictive inference in these general problems. We demonstrate a novel resizing method to adapt to problem difficulty, which applies both to existing approaches for predictive inference with hierarchical data and the methods we develop; this reduces prediction set sizes using limited information from the test environment, a key to the methods' practical performance, which we evaluate through neurochemical sensing and species classification datasets.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#20132;&#21449;&#39564;&#35777;&#21518;&#30340;&#33258;&#21161;&#27861;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#36873;&#25321;&#39640;&#32500;M-&#20272;&#35745;&#22120;&#30340;&#24809;&#32602;&#21442;&#25968;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#22312;&#20272;&#35745;&#35823;&#24046;&#26041;&#38754;&#20248;&#20110;&#20132;&#21449;&#39564;&#35777;&#65292;&#24182;&#22312;&#25512;&#26029;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;&#22312;&#26696;&#20363;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23545;Fryer Jr (2019)&#30340;&#30740;&#31350;&#36827;&#34892;&#20102;&#20877;&#39564;&#35777;&#65292;&#24182;&#30830;&#35748;&#20102;&#20182;&#30340;&#21457;&#29616;&#12290;</title><link>http://arxiv.org/abs/2104.04716</link><description>&lt;p&gt;
&#20351;&#29992;&#20132;&#21449;&#39564;&#35777;&#21518;&#30340;&#33258;&#21161;&#27861;&#36873;&#25321;&#39640;&#32500;M-&#20272;&#35745;&#22120;&#30340;&#24809;&#32602;&#21442;&#25968;
&lt;/p&gt;
&lt;p&gt;
Selecting Penalty Parameters of High-Dimensional M-Estimators using Bootstrapping after Cross-Validation. (arXiv:2104.04716v4 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.04716
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#20132;&#21449;&#39564;&#35777;&#21518;&#30340;&#33258;&#21161;&#27861;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#36873;&#25321;&#39640;&#32500;M-&#20272;&#35745;&#22120;&#30340;&#24809;&#32602;&#21442;&#25968;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#22312;&#20272;&#35745;&#35823;&#24046;&#26041;&#38754;&#20248;&#20110;&#20132;&#21449;&#39564;&#35777;&#65292;&#24182;&#22312;&#25512;&#26029;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;&#22312;&#26696;&#20363;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23545;Fryer Jr (2019)&#30340;&#30740;&#31350;&#36827;&#34892;&#20102;&#20877;&#39564;&#35777;&#65292;&#24182;&#30830;&#35748;&#20102;&#20182;&#30340;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#36873;&#25321;$\ell_1$-&#24809;&#32602;M-&#20272;&#35745;&#22120;&#30340;&#24809;&#32602;&#21442;&#25968;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#20132;&#21449;&#39564;&#35777;&#21518;&#30340;&#33258;&#21161;&#27861;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#30456;&#24212;&#30340;$\ell_1$-&#24809;&#32602;M-&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#20197;&#21450;&#22312;&#20934;&#21017;&#20989;&#25968;&#20013;&#19981;&#20351;&#29992;&#24809;&#32602;&#37325;&#26032;&#25311;&#21512;&#21069;&#19968;&#20272;&#35745;&#22120;&#30340;&#38750;&#38646;&#21442;&#25968;&#30340;&#21518;-$\ell_1$-&#24809;&#32602;M-&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#20272;&#35745;&#35823;&#24046;&#26041;&#38754;&#19981;&#34987;&#20132;&#21449;&#39564;&#35777;&#25152;&#20027;&#23548;&#65292;&#24182;&#19988;&#22312;&#25512;&#26029;&#26041;&#38754;&#32988;&#36807;&#20132;&#21449;&#39564;&#35777;&#12290;&#20316;&#20026;&#31034;&#20363;&#65292;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;Fryer Jr (2019)&#20851;&#20110;&#35686;&#23519;&#20351;&#29992;&#27494;&#21147;&#30340;&#31181;&#26063;&#24046;&#24322;&#30340;&#30740;&#31350;&#65292;&#24182;&#30830;&#35748;&#20102;&#20182;&#30340;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a new method for selecting the penalty parameter for $\ell_1$-penalized M-estimators in high dimensions, which we refer to as bootstrapping after cross-validation. We derive rates of convergence for the corresponding $\ell_1$-penalized M-estimator and also for the post-$\ell_1$-penalized M-estimator, which refits the non-zero parameters of the former estimator without penalty in the criterion function. We demonstrate via simulations that our method is not dominated by cross-validation in terms of estimation errors and outperforms cross-validation in terms of inference. As an illustration, we revisit Fryer Jr (2019), who investigated racial differences in police use of force, and confirm his findings.
&lt;/p&gt;</description></item></channel></rss>