<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20934;&#24471;&#20998;&#21305;&#37197;&#30340;SAR&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#23454;&#24212;&#29992;&#20013;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#38543;&#26426;&#24102;&#26469;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#35745;&#31639;&#22797;&#26434;&#24230;&#30456;&#23545;&#36739;&#20302;&#12290;</title><link>http://arxiv.org/abs/2305.19721</link><description>&lt;p&gt;
&#38543;&#26426;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#20934;&#24471;&#20998;&#21305;&#37197;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Quasi-Score Matching Estimation for Spatial Autoregressive Model with Random Weights Matrix and Regressors. (arXiv:2305.19721v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19721
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20934;&#24471;&#20998;&#21305;&#37197;&#30340;SAR&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#23454;&#24212;&#29992;&#20013;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#38543;&#26426;&#24102;&#26469;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#35745;&#31639;&#22797;&#26434;&#24230;&#30456;&#23545;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#25968;&#25454;&#25910;&#38598;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#31354;&#38388;&#33258;&#22238;&#24402;&#65288;SAR&#65289;&#27169;&#22411;&#22312;&#23454;&#38469;&#20998;&#26512;&#20013;&#36234;&#26469;&#36234;&#26222;&#36941;&#65292;&#29305;&#21035;&#26159;&#22312;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#26102;&#12290;&#28982;&#32780;&#65292;&#24120;&#29992;&#30340;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65288;QMLE&#65289;&#23545;&#20110;&#22788;&#29702;&#22823;&#22411;&#25968;&#25454;&#19981;&#20855;&#22791;&#21487;&#25193;&#23637;&#24615;&#12290;&#27492;&#22806;&#65292;&#22312;&#32463;&#20856;&#30340;&#31354;&#38388;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#65292;&#24314;&#31435;SAR&#27169;&#22411;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#29305;&#24615;&#26102;&#65292;&#20551;&#35774;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#22343;&#20026;&#38750;&#38543;&#26426;&#30340;&#65292;&#36825;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#21487;&#33021;&#19981;&#22826;&#29616;&#23454;&#12290;&#26412;&#25991;&#21463;&#21040;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#30340;&#21551;&#21457;&#65292;&#25552;&#20986;&#20102;SAR&#27169;&#22411;&#30340;&#20934;&#24471;&#20998;&#21305;&#37197;&#20272;&#35745;&#26041;&#27861;&#12290;&#36825;&#31181;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#20173;&#28982;&#22522;&#20110;&#20284;&#28982;&#65292;&#20294;&#26174;&#33879;&#38477;&#20302;&#20102;QMLE&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#12290;&#24314;&#31435;&#20102;&#38543;&#26426;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#19979;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the rapid advancements in technology for data collection, the application of the spatial autoregressive (SAR) model has become increasingly prevalent in real-world analysis, particularly when dealing with large datasets. However, the commonly used quasi-maximum likelihood estimation (QMLE) for the SAR model is not computationally scalable to handle the data with a large size. In addition, when establishing the asymptotic properties of the parameter estimators of the SAR model, both weights matrix and regressors are assumed to be nonstochastic in classical spatial econometrics, which is perhaps not realistic in real applications. Motivated by the machine learning literature, this paper proposes quasi-score matching estimation for the SAR model. This new estimation approach is still likelihood-based, but significantly reduces the computational complexity of the QMLE. The asymptotic properties of parameter estimators under the random weights matrix and regressors are established, whi
&lt;/p&gt;</description></item></channel></rss>