<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.02303</link><description>&lt;p&gt;
&#33258;&#20030;&#36153;&#33293;&#23572;&#24066;&#22330;&#22343;&#34913;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Bootstrapping Fisher Market Equilibrium and First-Price Pacing Equilibrium
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02303
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#26159;&#32463;&#27982;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#22343;&#34913;&#27169;&#22411;&#65292;&#20063;&#22312;&#20844;&#24179;&#21644;&#39640;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#26041;&#38754;&#26377;&#24212;&#29992;&#12290;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#26159;&#19968;&#31181;&#25429;&#25417;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#20013;&#39044;&#31639;&#31649;&#29702;&#26426;&#21046;&#30340;&#27169;&#22411;&#12290;&#22312;&#26576;&#20123;&#23454;&#38469;&#24773;&#20917;&#19979;&#65292;&#22914;&#24191;&#21578;&#25293;&#21334;&#65292;&#22312;&#36825;&#20123;&#27169;&#22411;&#19978;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#20855;&#26377;&#19968;&#23450;&#30340;&#20852;&#36259;&#12290;&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#20110;&#19968;&#33324;&#32479;&#35745;&#25512;&#26029;&#30340;&#24120;&#29992;&#26041;&#27861;&#26159;&#33258;&#20030;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;LFM&#21644;FPPE&#65292;&#30446;&#21069;&#19981;&#23384;&#22312;&#26377;&#25928;&#24212;&#29992;&#33258;&#20030;&#31243;&#24207;&#30340;&#29702;&#35770;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;LFM&#21644;FPPE&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#12290;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#37096;&#20998;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#65292;&#36825;&#24402;&#32467;&#20026;&#33258;&#20030;&#32422;&#26463;M-&#20272;&#35745;&#37327;&#65292;&#36825;&#26159;&#19968;&#20010;&#24456;&#22823;&#31243;&#24230;&#19978;&#26410;&#24320;&#21457;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#20026;FPPE&#35774;&#35745;&#20102;&#19968;&#20010;&#33258;&#20030;&#36807;&#31243;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#23454;&#38469;&#25968;&#25454;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The linear Fisher market (LFM) is a basic equilibrium model from economics, which also has applications in fair and efficient resource allocation. First-price pacing equilibrium (FPPE) is a model capturing budget-management mechanisms in first-price auctions. In certain practical settings such as advertising auctions, there is an interest in performing statistical inference over these models. A popular methodology for general statistical inference is the bootstrap procedure. Yet, for LFM and FPPE there is no existing theory for the valid application of bootstrap procedures. In this paper, we introduce and devise several statistically valid bootstrap inference procedures for LFM and FPPE. The most challenging part is to bootstrap general FPPE, which reduces to bootstrapping constrained M-estimators, a largely unexplored problem. We devise a bootstrap procedure for FPPE under mild degeneracy conditions by using the powerful tool of epi-convergence theory. Experiments with synthetic and s
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#22312;&#32447;&#23398;&#20064;&#21644;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#30340;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.00786</link><description>&lt;p&gt;
&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;
&lt;/p&gt;
&lt;p&gt;
Semidiscrete optimal transport with unknown costs. (arXiv:2310.00786v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00786
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#22312;&#32447;&#23398;&#20064;&#21644;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#30340;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#26159;&#32447;&#24615;&#35268;&#21010;&#20013;&#32463;&#20856;&#36755;&#36816;&#38382;&#39064;&#30340;&#19968;&#31181;&#26377;&#25361;&#25112;&#24615;&#30340;&#25512;&#24191;&#12290;&#20854;&#30446;&#26631;&#26159;&#20197;&#22266;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26041;&#24335;&#35774;&#35745;&#20004;&#20010;&#38543;&#26426;&#21464;&#37327;&#65288;&#19968;&#20010;&#36830;&#32493;&#65292;&#19968;&#20010;&#31163;&#25955;&#65289;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#20197;&#26368;&#23567;&#21270;&#26399;&#26395;&#25104;&#26412;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#36825;&#20010;&#38382;&#39064;&#30340;&#19968;&#20010;&#26032;&#22411;&#21464;&#20307;&#65292;&#20854;&#20013;&#25104;&#26412;&#20989;&#25968;&#26159;&#26410;&#30693;&#30340;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#22122;&#22768;&#35266;&#27979;&#23398;&#20064;&#65307;&#28982;&#32780;&#65292;&#27599;&#27425;&#21482;&#33021;&#37319;&#26679;&#19968;&#20010;&#20989;&#25968;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#23558;&#22312;&#32447;&#23398;&#20064;&#19982;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#65292;&#24182;&#35777;&#26126;&#20854;&#23454;&#29616;&#20102;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#23613;&#31649;&#38543;&#26426;&#26799;&#24230;&#30340;&#38750;&#20809;&#28369;&#24615;&#21644;&#30446;&#26631;&#20989;&#25968;&#30340;&#32570;&#20047;&#24378;&#20985;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Semidiscrete optimal transport is a challenging generalization of the classical transportation problem in linear programming. The goal is to design a joint distribution for two random variables (one continuous, one discrete) with fixed marginals, in a way that minimizes expected cost. We formulate a novel variant of this problem in which the cost functions are unknown, but can be learned through noisy observations; however, only one function can be sampled at a time. We develop a semi-myopic algorithm that couples online learning with stochastic approximation, and prove that it achieves optimal convergence rates, despite the non-smoothness of the stochastic gradient and the lack of strong concavity in the objective function.
&lt;/p&gt;</description></item></channel></rss>