<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#28151;&#21512;&#27169;&#22411;&#20013;&#28151;&#21512;&#27979;&#24230;&#30340;Wasserstein&#36317;&#31163;&#30340;&#26032;&#30340;&#35268;&#33539;&#35299;&#37322;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;&#20027;&#39064;&#27169;&#22411;&#20013;&#36827;&#34892;&#27492;&#36317;&#31163;&#25512;&#26029;&#30340;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2206.12768</link><description>&lt;p&gt;
&#20027;&#39064;&#27169;&#22411;&#20013;&#28151;&#21512;&#27979;&#24230;&#30340;Wasserstein&#36317;&#31163;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Estimation and inference for the Wasserstein distance between mixing measures in topic models. (arXiv:2206.12768v2 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.12768
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#28151;&#21512;&#27169;&#22411;&#20013;&#28151;&#21512;&#27979;&#24230;&#30340;Wasserstein&#36317;&#31163;&#30340;&#26032;&#30340;&#35268;&#33539;&#35299;&#37322;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;&#20027;&#39064;&#27169;&#22411;&#20013;&#36827;&#34892;&#27492;&#36317;&#31163;&#25512;&#26029;&#30340;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#28151;&#21512;&#27169;&#22411;&#30340;&#32479;&#35745;&#20998;&#26512;&#20013;&#65292;&#28151;&#21512;&#27979;&#24230;&#30340;Wasserstein&#36317;&#31163;&#24050;&#32463;&#25104;&#20026;&#20102;&#19968;&#20010;&#26680;&#24515;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#36825;&#31181;&#36317;&#31163;&#30340;&#26032;&#30340;&#35268;&#33539;&#35299;&#37322;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;&#20027;&#39064;&#27169;&#22411;&#20013;&#36827;&#34892;&#28151;&#21512;&#27979;&#24230;&#30340;Wasserstein&#36317;&#31163;&#25512;&#26029;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#33324;&#21487;&#35782;&#21035;&#28151;&#21512;&#27169;&#22411;&#30340;&#24773;&#20917;&#65292;&#20854;&#20013;&#21253;&#25324;&#20102;&#22810;&#20010;&#26469;&#33258;&#38598;&#21512;$\mathcal{A}$&#20869;&#24102;&#26377;&#20219;&#24847;&#24230;&#37327;$d$&#30340;&#20998;&#24067;&#30340;&#28151;&#21512;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28151;&#21512;&#27979;&#24230;&#30340;Wasserstein&#36317;&#31163;&#26159;&#21807;&#19968;&#22320;&#34920;&#24449;&#20986;&#28151;&#21512;&#20803;&#32032;&#38598;&#21512;$\mathcal{A}$&#19978;&#24230;&#37327;$d$&#30340;&#26368;&#26377;&#21306;&#20998;&#24615;&#30340;&#20984;&#25193;&#23637;&#12290;&#34429;&#28982;Wasserstein&#36317;&#31163;&#22312;&#28151;&#21512;&#27169;&#22411;&#30340;&#30740;&#31350;&#20013;&#24050;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#32570;&#20047;&#20844;&#29702;&#35777;&#26126;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#30830;&#31435;&#20102;&#36825;&#20010;&#24230;&#37327;&#20316;&#20026;&#19968;&#20010;&#35268;&#33539;&#36873;&#25321;&#12290;&#29305;&#20934;&#21270;&#36825;&#20010;&#24230;&#37327;&#21040;&#20027;&#39064;&#27169;&#22411;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#36825;&#20010;&#36317;&#31163;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;&#34429;&#28982;$i$
&lt;/p&gt;
&lt;p&gt;
The Wasserstein distance between mixing measures has come to occupy a central place in the statistical analysis of mixture models. This work proposes a new canonical interpretation of this distance and provides tools to perform inference on the Wasserstein distance between mixing measures in topic models.  We consider the general setting of an identifiable mixture model consisting of mixtures of distributions from a set $\mathcal{A}$ equipped with an arbitrary metric $d$, and show that the Wasserstein distance between mixing measures is uniquely characterized as the most discriminative convex extension of the metric $d$ to the set of mixtures of elements of $\mathcal{A}$. The Wasserstein distance between mixing measures has been widely used in the study of such models, but without axiomatic justification. Our results establish this metric to be a canonical choice.  Specializing our results to topic models, we consider estimation and inference of this distance. Though upper bounds for i
&lt;/p&gt;</description></item></channel></rss>