<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2206.14275</link><description>&lt;p&gt;
&#21160;&#24577;CoVaR&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Dynamic CoVaR Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.14275
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
CoVaR&#65288;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#65289;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#31995;&#32479;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#22312;&#32463;&#27982;&#23398;&#21644;&#37329;&#34701;&#39046;&#22495;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;VaR&#21644;CoVaR&#23545;&#30340;&#21452;&#21464;&#37327;&#35780;&#20998;&#20989;&#25968;&#30340;&#27169;&#22411;&#21442;&#25968;&#30340;&#20004;&#27493;M&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#22312;&#27169;&#25311;&#20013;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#30340;&#19968;&#20010;&#29305;&#23450;&#23376;&#31867;&#24212;&#29992;&#20110;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;CoCAViaR&#27169;&#22411;&#20135;&#29983;&#30340;CoVaR&#39044;&#27979;&#20248;&#20110;&#24403;&#21069;&#22522;&#20934;&#27169;&#22411;&#21457;&#24067;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2206.14275v3 Announce Type: replace  Abstract: The popular systemic risk measure CoVaR (conditional Value-at-Risk) is widely used in economics and finance. Formally, it is defined as a large quantile of one variable (e.g., losses in the financial system) conditional on some other variable (e.g., losses in a bank's shares) being in distress. In this article, we propose joint dynamic forecasting models for the Value-at-Risk (VaR) and CoVaR. We also introduce a two-step M-estimator for the model parameters drawing on recently proposed bivariate scoring functions for the pair (VaR, CoVaR). We prove consistency and asymptotic normality of our parameter estimator and analyze its finite-sample properties in simulations. Finally, we apply a specific subclass of our dynamic forecasting models, which we call CoCAViaR models, to log-returns of large US banks. It is shown that our CoCAViaR models generate CoVaR predictions that are superior to forecasts issued from current benchmark models.
&lt;/p&gt;</description></item></channel></rss>