<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#20999;&#29255;&#21644;&#37197;&#20934;&#36807;&#31243;&#23450;&#20041;&#30340;&#27979;&#37327;&#36716;&#31227;&#21644;&#36924;&#36817;&#38382;&#39064;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#24182;&#23545;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#26041;&#26696;&#25552;&#20379;&#20102;&#20960;&#20046;&#24517;&#28982;&#25910;&#25947;&#30340;&#35777;&#26126;&#12290;</title><link>http://arxiv.org/abs/2307.05705</link><description>&lt;p&gt;
&#36890;&#36807;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#36827;&#34892;&#27979;&#37327;&#36716;&#31227;
&lt;/p&gt;
&lt;p&gt;
Measure transfer via stochastic slicing and matching. (arXiv:2307.05705v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05705
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#20999;&#29255;&#21644;&#37197;&#20934;&#36807;&#31243;&#23450;&#20041;&#30340;&#27979;&#37327;&#36716;&#31227;&#21644;&#36924;&#36817;&#38382;&#39064;&#30340;&#36845;&#20195;&#26041;&#26696;&#65292;&#24182;&#23545;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#26041;&#26696;&#25552;&#20379;&#20102;&#20960;&#20046;&#24517;&#28982;&#25910;&#25947;&#30340;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#20999;&#29255;&#21644;&#37197;&#20934;&#36807;&#31243;&#23450;&#20041;&#30340;&#27979;&#37327;&#36716;&#31227;&#21644;&#36924;&#36817;&#38382;&#39064;&#30340;&#36845;&#20195;&#26041;&#26696;&#12290;&#31867;&#20284;&#20110;&#20999;&#29255;Wasserstein&#36317;&#31163;&#65292;&#36825;&#20123;&#26041;&#26696;&#21463;&#30410;&#20110;&#19968;&#32500;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#30340;&#38381;&#24335;&#35299;&#30340;&#21487;&#29992;&#24615;&#21644;&#30456;&#20851;&#35745;&#31639;&#20248;&#21183;&#12290;&#23613;&#31649;&#36825;&#20123;&#26041;&#26696;&#24050;&#32463;&#22312;&#25968;&#25454;&#31185;&#23398;&#24212;&#29992;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#20851;&#20110;&#23427;&#20204;&#30340;&#25910;&#25947;&#24615;&#30340;&#32467;&#26524;&#19981;&#22826;&#22810;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#23545;&#38543;&#26426;&#20999;&#29255;&#21644;&#37197;&#20934;&#26041;&#26696;&#25552;&#20379;&#20102;&#20960;&#20046;&#24517;&#28982;&#25910;&#25947;&#30340;&#35777;&#26126;&#12290;&#35813;&#35777;&#26126;&#24314;&#31435;&#22312;&#23558;&#20854;&#35299;&#37322;&#20026;Wasserstein&#31354;&#38388;&#19978;&#30340;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;&#26041;&#26696;&#30340;&#22522;&#30784;&#20043;&#19978;&#12290;&#21516;&#26102;&#36824;&#23637;&#31034;&#20102;&#20851;&#20110;&#36880;&#27493;&#22270;&#20687;&#21464;&#24418;&#30340;&#25968;&#20540;&#31034;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies iterative schemes for measure transfer and approximation problems, which are defined through a slicing-and-matching procedure. Similar to the sliced Wasserstein distance, these schemes benefit from the availability of closed-form solutions for the one-dimensional optimal transport problem and the associated computational advantages. While such schemes have already been successfully utilized in data science applications, not too many results on their convergence are available. The main contribution of this paper is an almost sure convergence proof for stochastic slicing-and-matching schemes. The proof builds on an interpretation as a stochastic gradient descent scheme on the Wasserstein space. Numerical examples on step-wise image morphing are demonstrated as well.
&lt;/p&gt;</description></item></channel></rss>