<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26500;&#24314;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#31934;&#30830;&#35206;&#30422;&#30340;&#39044;&#27979;&#38598;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#21487;&#20197;&#35299;&#20915;&#22312;&#25968;&#25454;&#39537;&#21160;&#24773;&#22659;&#20013;&#30001;&#20110;&#36873;&#25321;&#20559;&#24046;&#23548;&#33268;&#30340;&#36793;&#32536;&#26377;&#25928;&#39044;&#27979;&#21306;&#38388;&#35823;&#23548;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.03868</link><description>&lt;p&gt;
&#28966;&#28857;&#32622;&#20449;: &#24102;&#26377;&#36873;&#25321;&#26465;&#20214;&#35206;&#30422;&#30340;&#25972;&#20307;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Confidence on the Focal: Conformal Prediction with Selection-Conditional Coverage
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03868
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26500;&#24314;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#31934;&#30830;&#35206;&#30422;&#30340;&#39044;&#27979;&#38598;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#21487;&#20197;&#35299;&#20915;&#22312;&#25968;&#25454;&#39537;&#21160;&#24773;&#22659;&#20013;&#30001;&#20110;&#36873;&#25321;&#20559;&#24046;&#23548;&#33268;&#30340;&#36793;&#32536;&#26377;&#25928;&#39044;&#27979;&#21306;&#38388;&#35823;&#23548;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25972;&#20307;&#39044;&#27979;&#24314;&#31435;&#22312;&#36793;&#32536;&#26377;&#25928;&#30340;&#39044;&#27979;&#21306;&#38388;&#19978;&#65292;&#35813;&#21306;&#38388;&#20197;&#26576;&#31181;&#35268;&#23450;&#30340;&#27010;&#29575;&#35206;&#30422;&#20102;&#38543;&#26426;&#25277;&#21462;&#30340;&#26032;&#27979;&#35797;&#28857;&#30340;&#26410;&#30693;&#32467;&#26524;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#24120;&#35265;&#24773;&#20917;&#26159;&#65292;&#22312;&#30475;&#21040;&#27979;&#35797;&#21333;&#20803;&#21518;&#65292;&#20174;&#19994;&#32773;&#20197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#20915;&#23450;&#20851;&#27880;&#21738;&#20123;&#27979;&#35797;&#21333;&#20803;&#65292;&#24182;&#24076;&#26395;&#37327;&#21270;&#28966;&#28857;&#21333;&#20803;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#36825;&#20123;&#28966;&#28857;&#21333;&#20803;&#30340;&#36793;&#32536;&#26377;&#25928;&#39044;&#27979;&#21306;&#38388;&#21487;&#33021;&#20250;&#22240;&#36873;&#25321;&#20559;&#24046;&#32780;&#20855;&#26377;&#35823;&#23548;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26500;&#24314;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#31934;&#30830;&#35206;&#30422;&#30340;&#39044;&#27979;&#38598;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#35813;&#35206;&#30422;&#26159;&#26377;&#26465;&#20214;&#20110;&#25152;&#36873;&#21333;&#20803;&#30340;&#12290;&#20854;&#19968;&#33324;&#24418;&#24335;&#36866;&#29992;&#20110;&#20219;&#24847;&#36873;&#25321;&#35268;&#21017;&#65292;&#24182;&#23558;Mondrian&#25972;&#20307;&#39044;&#27979;&#25512;&#24191;&#21040;&#22810;&#20010;&#27979;&#35797;&#21333;&#20803;&#21644;&#38750;&#31561;&#21464;&#20998;&#31867;&#22120;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20026;&#22810;&#20010;&#29616;&#23454;&#30340;&#36873;&#25321;&#35268;&#21017;&#35745;&#31639;&#20102;&#36866;&#29992;&#20110;&#25105;&#20204;&#26694;&#26550;&#30340;&#35745;&#31639;&#25928;&#29575;&#23454;&#29616;&#65292;&#21253;&#25324;top-K&#36873;&#25321;&#12289;&#20248;&#21270;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03868v1 Announce Type: cross  Abstract: Conformal prediction builds marginally valid prediction intervals which cover the unknown outcome of a randomly drawn new test point with a prescribed probability. In practice, a common scenario is that, after seeing the test unit(s), practitioners decide which test unit(s) to focus on in a data-driven manner, and wish to quantify the uncertainty for the focal unit(s). In such cases, marginally valid prediction intervals for these focal units can be misleading due to selection bias. This paper presents a general framework for constructing a prediction set with finite-sample exact coverage conditional on the unit being selected. Its general form works for arbitrary selection rules, and generalizes Mondrian Conformal Prediction to multiple test units and non-equivariant classifiers. We then work out computationally efficient implementation of our framework for a number of realistic selection rules, including top-K selection, optimization
&lt;/p&gt;</description></item></channel></rss>