<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#21152;&#26435;Lasso&#20272;&#35745;&#22120;&#65292;&#35299;&#20915;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#35843;&#21442;&#36873;&#25321;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.06657</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#35843;&#21442;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Data-Driven Tuning Parameter Selection for High-Dimensional Vector Autoregressions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06657
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#21152;&#26435;Lasso&#20272;&#35745;&#22120;&#65292;&#35299;&#20915;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#35843;&#21442;&#36873;&#25321;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Lasso&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#36890;&#24120;&#29992;&#20110;&#20272;&#35745;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#12290;Lasso&#30340;&#29702;&#35770;&#20445;&#35777;&#36890;&#24120;&#35201;&#27714;&#36873;&#25321;&#21512;&#36866;&#30340;&#24809;&#32602;&#27700;&#24179;&#65292;&#36825;&#36890;&#24120;&#21462;&#20915;&#20110;&#26410;&#30693;&#30340;&#24635;&#20307;&#25968;&#37327;&#12290;&#28982;&#32780;&#65292;&#24471;&#21040;&#30340;&#20272;&#35745;&#20540;&#21644;&#27169;&#22411;&#20013;&#20445;&#30041;&#30340;&#21464;&#37327;&#25968;&#37327;&#20851;&#38190;&#21462;&#20915;&#20110;&#25152;&#36873;&#25321;&#30340;&#24809;&#32602;&#27700;&#24179;&#12290;&#30446;&#21069;&#65292;&#22312;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#30340;&#24773;&#20917;&#19979;&#27809;&#26377;&#29702;&#35770;&#19978;&#30340;&#25351;&#23548;&#26469;&#20570;&#36825;&#20010;&#36873;&#25321;&#12290;&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#20063;&#35768;&#26159;&#26368;&#24120;&#29992;&#30340;&#22810;&#20803;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#20043;&#19968;&#65292;&#32447;&#24615;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;VAR&#65289;&#27169;&#22411;&#30340;&#20272;&#35745;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#23436;&#20840;&#25968;&#25454;&#39537;&#21160;&#26041;&#24335;&#36873;&#25321;&#24809;&#32602;&#30340;&#21152;&#26435;Lasso&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#20026;&#36825;&#19968;&#26041;&#27861;&#24314;&#31435;&#30340;&#29702;&#35770;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06657v1 Announce Type: new  Abstract: Lasso-type estimators are routinely used to estimate high-dimensional time series models. The theoretical guarantees established for Lasso typically require the penalty level to be chosen in a suitable fashion often depending on unknown population quantities. Furthermore, the resulting estimates and the number of variables retained in the model depend crucially on the chosen penalty level. However, there is currently no theoretically founded guidance for this choice in the context of high-dimensional time series. Instead one resorts to selecting the penalty level in an ad hoc manner using, e.g., information criteria or cross-validation. We resolve this problem by considering estimation of the perhaps most commonly employed multivariate time series model, the linear vector autoregressive (VAR) model, and propose a weighted Lasso estimator with penalization chosen in a fully data-driven way. The theoretical guarantees that we establish for
&lt;/p&gt;</description></item></channel></rss>