<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24555;&#36895;&#30340;Switchback&#23454;&#39564;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#25972;&#20010;&#26102;&#38388;&#22359;&#65292;&#20197; $\sqrt{\log T/T}$ &#30340;&#36895;&#29575;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2312.15574</link><description>&lt;p&gt;
&#26356;&#24555;&#36895;&#30340;Switchback&#23454;&#39564;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Faster Rates for Switchback Experiments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.15574
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24555;&#36895;&#30340;Switchback&#23454;&#39564;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#25972;&#20010;&#26102;&#38388;&#22359;&#65292;&#20197; $\sqrt{\log T/T}$ &#30340;&#36895;&#29575;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Switchback&#23454;&#39564;&#35774;&#35745;&#20013;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#21333;&#20803;&#65288;&#20363;&#22914;&#25972;&#20010;&#31995;&#32479;&#65289;&#22312;&#20132;&#26367;&#30340;&#26102;&#38388;&#22359;&#20013;&#26292;&#38706;&#20110;&#19968;&#20010;&#38543;&#26426;&#22788;&#29702;&#65292;&#22788;&#29702;&#24182;&#34892;&#22788;&#29702;&#20102;&#36328;&#21333;&#20803;&#21644;&#26102;&#38388;&#24178;&#25200;&#38382;&#39064;&#12290;Hu&#21644;Wager&#65288;2022&#65289;&#26368;&#36817;&#25552;&#20986;&#20102;&#19968;&#31181;&#25130;&#26029;&#22359;&#36215;&#22987;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#65292;&#24182;&#22312;Markov&#26465;&#20214;&#19979;&#35777;&#26126;&#20102;&#29992;&#20110;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;GATE&#65289;&#30340;$T^{-1/3}$&#36895;&#29575;&#65292;&#20182;&#20204;&#22768;&#31216;&#36825;&#20010;&#36895;&#29575;&#26159;&#26368;&#20248;&#30340;&#65292;&#24182;&#24314;&#35758;&#23558;&#27880;&#24847;&#21147;&#36716;&#21521;&#19981;&#21516;&#65288;&#19988;&#20381;&#36182;&#35774;&#35745;&#65289;&#30340;&#20272;&#35745;&#37327;&#65292;&#20197;&#33719;&#24471;&#26356;&#24555;&#30340;&#36895;&#29575;&#12290;&#23545;&#20110;&#30456;&#21516;&#30340;&#35774;&#35745;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#20272;&#35745;&#22120;&#65292;&#20351;&#29992;&#25972;&#20010;&#22359;&#65292;&#24182;&#24778;&#20154;&#22320;&#35777;&#26126;&#65292;&#22312;&#30456;&#21516;&#30340;&#20551;&#35774;&#19979;&#65292;&#23427;&#23454;&#38469;&#19978;&#36798;&#21040;&#20102;&#21407;&#22987;&#30340;&#35774;&#35745;&#29420;&#31435;GATE&#20272;&#35745;&#37327;&#30340;$\sqrt{\log T/T}$&#30340;&#20272;&#35745;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Switchback experimental design, wherein a single unit (e.g., a whole system) is exposed to a single random treatment for interspersed blocks of time, tackles both cross-unit and temporal interference. Hu and Wager (2022) recently proposed a treatment-effect estimator that truncates the beginnings of blocks and established a $T^{-1/3}$ rate for estimating the global average treatment effect (GATE) in a Markov setting with rapid mixing. They claim this rate is optimal and suggest focusing instead on a different (and design-dependent) estimand so as to enjoy a faster rate. For the same design we propose an alternative estimator that uses the whole block and surprisingly show that it in fact achieves an estimation rate of $\sqrt{\log T/T}$ for the original design-independent GATE estimand under the same assumptions.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#20998;&#24067;&#24335;&#31639;&#27861;&#65292;&#29992;&#20110;&#22312;&#39640;&#32500;&#31232;&#30095;Cox&#27604;&#20363;&#39118;&#38505;&#27169;&#22411;&#20013;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#21435;&#20559;&#24046;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#20135;&#29983;&#28176;&#36817;&#26377;&#25928;&#30340;&#20998;&#24067;&#24335;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#20998;&#24067;&#24335;&#20551;&#35774;&#26816;&#39564;&#12290;</title><link>http://arxiv.org/abs/2302.12111</link><description>&lt;p&gt;
&#38754;&#21521;Cox&#27169;&#22411;&#30340;&#39640;&#25928;&#36890;&#20449;&#24335;&#20998;&#24067;&#24335;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Communication-Efficient Distributed Estimation and Inference for Cox's Model. (arXiv:2302.12111v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.12111
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#20998;&#24067;&#24335;&#31639;&#27861;&#65292;&#29992;&#20110;&#22312;&#39640;&#32500;&#31232;&#30095;Cox&#27604;&#20363;&#39118;&#38505;&#27169;&#22411;&#20013;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#36890;&#36807;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#21435;&#20559;&#24046;&#26041;&#27861;&#65292;&#25105;&#20204;&#21487;&#20197;&#20135;&#29983;&#28176;&#36817;&#26377;&#25928;&#30340;&#20998;&#24067;&#24335;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#20998;&#24067;&#24335;&#20551;&#35774;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#22240;&#38544;&#31169;&#21644;&#25152;&#26377;&#26435;&#38382;&#39064;&#26080;&#27861;&#20849;&#20139;&#20010;&#20307;&#25968;&#25454;&#30340;&#22810;&#20013;&#24515;&#29983;&#29289;&#21307;&#23398;&#30740;&#31350;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#39640;&#32500;&#31232;&#30095;Cox&#27604;&#20363;&#39118;&#38505;&#27169;&#22411;&#30340;&#36890;&#20449;&#39640;&#25928;&#36845;&#20195;&#20998;&#24067;&#24335;&#31639;&#27861;&#29992;&#20110;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21363;&#20351;&#36827;&#34892;&#20102;&#30456;&#23545;&#36739;&#23569;&#30340;&#36845;&#20195;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#20540;&#22312;&#38750;&#24120;&#28201;&#21644;&#30340;&#26465;&#20214;&#19979;&#21487;&#20197;&#36798;&#21040;&#19982;&#29702;&#24819;&#20840;&#26679;&#26412;&#20272;&#35745;&#20540;&#30456;&#21516;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#20026;&#20102;&#26500;&#24314;&#39640;&#32500;&#21361;&#38505;&#22238;&#24402;&#31995;&#25968;&#30340;&#32447;&#24615;&#32452;&#21512;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21435;&#20559;&#24046;&#26041;&#27861;&#65292;&#24314;&#31435;&#20102;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#33268;&#30340;&#26041;&#24046;&#20272;&#35745;&#65292;&#21487;&#20197;&#20135;&#29983;&#28176;&#36817;&#26377;&#25928;&#30340;&#20998;&#24067;&#24335;&#32622;&#20449;&#21306;&#38388;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;&#35013;&#39280;&#20998;&#25968;&#26816;&#39564;&#30340;&#20219;&#24847;&#22352;&#26631;&#20803;&#32032;&#30340;&#26377;&#25928;&#21644;&#24378;&#22823;&#30340;&#20998;&#24067;&#24335;&#20551;&#35774;&#26816;&#39564;&#12290;&#25105;&#20204;&#36824;&#20801;&#35768;&#26102;&#38388;&#20381;&#36182;&#21327;&#21464;&#37327;&#20197;&#21450;&#34987;&#23457;&#26597;&#30340;&#29983;&#23384;&#26102;&#38388;&#12290;&#22312;&#22810;&#31181;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#25968;&#23383;&#23454;&#39564;&#65292;&#35777;&#26126;&#20102;&#31639;&#27861;&#30340;&#26377;&#25928;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by multi-center biomedical studies that cannot share individual data due to privacy and ownership concerns, we develop communication-efficient iterative distributed algorithms for estimation and inference in the high-dimensional sparse Cox proportional hazards model. We demonstrate that our estimator, even with a relatively small number of iterations, achieves the same convergence rate as the ideal full-sample estimator under very mild conditions. To construct confidence intervals for linear combinations of high-dimensional hazard regression coefficients, we introduce a novel debiased method, establish central limit theorems, and provide consistent variance estimators that yield asymptotically valid distributed confidence intervals. In addition, we provide valid and powerful distributed hypothesis tests for any coordinate element based on a decorrelated score test. We allow time-dependent covariates as well as censored survival times. Extensive numerical experiments on both s
&lt;/p&gt;</description></item></channel></rss>