<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#35770;&#25991;&#36890;&#36807;&#24314;&#31435;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#32467;&#26524;&#65292;&#22635;&#34917;&#20102;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#20013;&#32479;&#35745;&#25512;&#26029;&#30340;&#31354;&#30333;&#65292;&#20026;&#21508;&#31181;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#26041;&#27861;&#65292;&#36229;&#36234;&#20102;Bradley-Terry&#27169;&#22411;&#65292;&#20026;&#23454;&#36341;&#32773;&#25552;&#20379;&#20102;&#22362;&#23454;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.08463</link><description>&lt;p&gt;
&#23545;&#20110;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Statistical inference for pairwise comparison models. (arXiv:2401.08463v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08463
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#36890;&#36807;&#24314;&#31435;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#32467;&#26524;&#65292;&#22635;&#34917;&#20102;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#20013;&#32479;&#35745;&#25512;&#26029;&#30340;&#31354;&#30333;&#65292;&#20026;&#21508;&#31181;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#26041;&#27861;&#65292;&#36229;&#36234;&#20102;Bradley-Terry&#27169;&#22411;&#65292;&#20026;&#23454;&#36341;&#32773;&#25552;&#20379;&#20102;&#22362;&#23454;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#34987;&#29992;&#20110;&#21508;&#20010;&#39046;&#22495;&#30340;&#23454;&#29992;&#24615;&#21644;&#25490;&#21517;&#35780;&#20272;&#12290;&#29616;&#20195;&#38382;&#39064;&#35268;&#27169;&#30340;&#22686;&#21152;&#24378;&#35843;&#20102;&#23545;&#20110;&#24403;&#34987;&#27604;&#36739;&#23545;&#35937;&#25968;&#37327;&#26080;&#38480;&#22686;&#21152;&#26102;&#65292;&#23545;&#20110;&#36825;&#20123;&#27169;&#22411;&#20013;&#30340;&#32479;&#35745;&#25512;&#26029;&#30340;&#29702;&#35299;&#30340;&#38656;&#27714;&#12290;&#30446;&#21069;&#65292;&#25991;&#29486;&#20013;&#23545;&#20110;&#36825;&#20123;&#27169;&#22411;&#20013;&#30340;&#32479;&#35745;&#25512;&#26029;&#30340;&#29702;&#35299;&#36824;&#30456;&#24403;&#26377;&#38480;&#65292;&#38500;&#38750;&#21482;&#26159;&#22312;&#23569;&#25968;&#29305;&#27530;&#23454;&#20363;&#20013;&#12290;&#26412;&#25991;&#36890;&#36807;&#22312;&#24191;&#27867;&#30340;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#20013;&#24314;&#31435;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#32467;&#26524;&#26469;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#20851;&#38190;&#24605;&#24819;&#22312;&#20110;&#23558;&#36153;&#33293;&#23572;&#20449;&#24687;&#30697;&#38453;&#35782;&#21035;&#20026;&#21152;&#26435;&#22270;&#25289;&#26222;&#25289;&#26031;&#30697;&#38453;&#65292;&#36890;&#36807;&#19968;&#31181;&#32454;&#33268;&#20837;&#24494;&#30340;&#35889;&#20998;&#26512;&#26041;&#27861;&#26469;&#36827;&#34892;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20026;&#22312;&#21508;&#31181;&#37197;&#23545;&#27604;&#36739;&#27169;&#22411;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#25552;&#20379;&#20102;&#31532;&#19968;&#20010;&#32479;&#19968;&#30340;&#26041;&#27861;&#65292;&#36229;&#36234;&#20102;Bradley-Terry&#27169;&#22411;&#65292;&#20026;&#23454;&#36341;&#32773;&#25552;&#20379;&#20102;&#22362;&#23454;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;&#36890;&#36807;&#21033;&#29992;&#21512;&#25104;&#25968;&#25454;&#36827;&#34892;&#30340;&#27169;&#25311;&#39564;&#35777;&#36825;&#19968;&#28176;&#36817;&#27491;&#24577;&#24615;&#32467;&#26524;&#65292;&#28982;&#21518;&#36827;&#34892;&#20102;
&lt;/p&gt;
&lt;p&gt;
Pairwise comparison models are used for quantitatively evaluating utility and ranking in various fields. The increasing scale of modern problems underscores the need to understand statistical inference in these models when the number of subjects diverges, which is currently lacking in the literature except in a few special instances. This paper addresses this gap by establishing an asymptotic normality result for the maximum likelihood estimator in a broad class of pairwise comparison models. The key idea lies in identifying the Fisher information matrix as a weighted graph Laplacian matrix which can be studied via a meticulous spectral analysis. Our findings provide the first unified theory for performing statistical inference in a wide range of pairwise comparison models beyond the Bradley--Terry model, benefiting practitioners with a solid theoretical guarantee for their use. Simulations utilizing synthetic data are conducted to validate the asymptotic normality result, followed by 
&lt;/p&gt;</description></item></channel></rss>