<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#23376;&#31354;&#38388;&#32422;&#26463;&#30340;Tyler&#20272;&#35745;&#22120;&#29992;&#20110;&#22312;&#39640;&#24230;&#21463;&#21040;&#31163;&#32676;&#20540;&#27745;&#26579;&#30340;&#25968;&#25454;&#38598;&#20013;&#24674;&#22797;&#20302;&#32500;&#23376;&#31354;&#38388;&#30340;&#24773;&#20917;&#65292;&#24182;&#23637;&#31034;&#20102;&#24403;&#21021;&#22987;&#21270;&#26465;&#20214;&#24471;&#21040;&#28385;&#36275;&#26102;&#65292;&#35813;&#20272;&#35745;&#22120;&#21487;&#20197;&#26377;&#25928;&#22320;&#24674;&#22797;&#28508;&#22312;&#30340;&#23376;&#31354;&#38388;&#12290;</title><link>https://arxiv.org/abs/2403.18658</link><description>&lt;p&gt;
&#23545;&#23376;&#31354;&#38388;&#32422;&#26463;&#30340;Tyler&#20272;&#35745;&#22120;&#30340;&#29702;&#35770;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
Theoretical Guarantees for the Subspace-Constrained Tyler's Estimator
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18658
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#23376;&#31354;&#38388;&#32422;&#26463;&#30340;Tyler&#20272;&#35745;&#22120;&#29992;&#20110;&#22312;&#39640;&#24230;&#21463;&#21040;&#31163;&#32676;&#20540;&#27745;&#26579;&#30340;&#25968;&#25454;&#38598;&#20013;&#24674;&#22797;&#20302;&#32500;&#23376;&#31354;&#38388;&#30340;&#24773;&#20917;&#65292;&#24182;&#23637;&#31034;&#20102;&#24403;&#21021;&#22987;&#21270;&#26465;&#20214;&#24471;&#21040;&#28385;&#36275;&#26102;&#65292;&#35813;&#20272;&#35745;&#22120;&#21487;&#20197;&#26377;&#25928;&#22320;&#24674;&#22797;&#28508;&#22312;&#30340;&#23376;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#29992;&#20110;&#24674;&#22797;&#21487;&#33021;&#21463;&#21040;&#20005;&#37325;&#27745;&#26579;&#30340;&#25968;&#25454;&#38598;&#20013;&#30340;&#20302;&#32500;&#23376;&#31354;&#38388;&#30340;&#23376;&#31354;&#38388;&#32422;&#26463;&#30340;Tyler&#20272;&#35745;&#22120;&#65288;STE&#65289;&#12290;&#23427;&#20551;&#35774;&#19968;&#20010;&#24369;&#30340;&#20869;&#28857;-&#22806;&#28857;&#27169;&#22411;&#65292;&#24182;&#20801;&#35768;&#20869;&#28857;&#30340;&#27604;&#20363;&#23567;&#20110;&#23548;&#33268;&#40065;&#26834;&#23376;&#31354;&#38388;&#24674;&#22797;&#38382;&#39064;&#35745;&#31639;&#22256;&#38590;&#30340;&#27604;&#20363;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23427;&#26174;&#31034;&#22914;&#26524;STE&#30340;&#21021;&#22987;&#21270;&#28385;&#36275;&#26576;&#20123;&#26465;&#20214;&#65292;&#37027;&#20040;STE&#21487;&#20197;&#26377;&#25928;&#22320;&#24674;&#22797;&#28508;&#22312;&#30340;&#23376;&#31354;&#38388;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#34920;&#26126;&#22312;&#24191;&#20041;&#30340;&#24178;&#33609;&#22534;&#27169;&#22411;&#19979;&#65292;&#30001;Tyler&#30340;M-&#20272;&#35745;&#22120;&#65288;TME&#65289;&#21021;&#22987;&#21270;&#30340;STE&#21487;&#20197;&#22312;&#20869;&#28857;&#30340;&#27604;&#20363;&#22826;&#23567;&#20197;&#33267;&#20110;TME&#26080;&#27861;&#22788;&#29702;&#26102;&#24674;&#22797;&#23376;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18658v1 Announce Type: cross  Abstract: This work analyzes the subspace-constrained Tyler's estimator (STE) designed for recovering a low-dimensional subspace within a dataset that may be highly corrupted with outliers. It assumes a weak inlier-outlier model and allows the fraction of inliers to be smaller than a fraction that leads to computational hardness of the robust subspace recovery problem. It shows that in this setting, if the initialization of STE, which is an iterative algorithm, satisfies a certain condition, then STE can effectively recover the underlying subspace. It further shows that under the generalized haystack model, STE initialized by the Tyler's M-estimator (TME), can recover the subspace when the fraction of iniliers is too small for TME to handle.
&lt;/p&gt;</description></item></channel></rss>