<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#20013;&#20984;&#27491;&#21017;&#21270;&#30340;&#33021;&#21147;&#21644;&#23616;&#38480;&#24615;&#38382;&#39064;&#65292;&#36890;&#36807;&#30740;&#31350;&#32473;&#23450;&#20998;&#24067;&#24773;&#20917;&#19979;&#65292;&#23545;&#25968;&#25454;&#37319;&#29992;&#20309;&#31181;&#27491;&#21017;&#21270;&#26041;&#27861;&#26159;&#26368;&#20248;&#30340;&#12290;</title><link>https://arxiv.org/abs/2212.13597</link><description>&lt;p&gt;
&#36866;&#29992;&#20110;&#25968;&#25454;&#28304;&#30340;&#26368;&#20248;&#27491;&#21017;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Optimal Regularization for a Data Source
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2212.13597
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#20013;&#20984;&#27491;&#21017;&#21270;&#30340;&#33021;&#21147;&#21644;&#23616;&#38480;&#24615;&#38382;&#39064;&#65292;&#36890;&#36807;&#30740;&#31350;&#32473;&#23450;&#20998;&#24067;&#24773;&#20917;&#19979;&#65292;&#23545;&#25968;&#25454;&#37319;&#29992;&#20309;&#31181;&#27491;&#21017;&#21270;&#26041;&#27861;&#26159;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22522;&#20110;&#20248;&#21270;&#30340;&#36870;&#38382;&#39064;&#21644;&#32479;&#35745;&#20272;&#35745;&#20013;&#65292;&#24120;&#24120;&#36890;&#36807;&#21152;&#20837;&#20419;&#20351;&#25968;&#25454;&#20445;&#30495;&#24615;&#30340;&#20934;&#21017;&#21644;&#20419;&#36827;&#35299;&#30340;&#25152;&#38656;&#32467;&#26500;&#24615;&#36136;&#30340;&#27491;&#21017;&#21270;&#39033;&#26469;&#35299;&#20915;&#38382;&#39064;&#12290;&#36873;&#25321;&#36866;&#24403;&#30340;&#27491;&#21017;&#21270;&#32422;&#26463;&#36890;&#24120;&#30001;&#21069;&#39046;&#22495;&#30693;&#35782;&#21644;&#35745;&#31639;&#32771;&#34385;&#20849;&#21516;&#39537;&#21160;&#12290;&#20984;&#27491;&#21017;&#21270;&#39033;&#22312;&#35745;&#31639;&#19978;&#20855;&#26377;&#21560;&#24341;&#21147;&#65292;&#20294;&#22312;&#25552;&#21319;&#32467;&#26500;&#31867;&#22411;&#26041;&#38754;&#23384;&#22312;&#23616;&#38480;&#24615;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#38750;&#20984;&#27491;&#21017;&#21270;&#39033;&#22312;&#20419;&#36827;&#32467;&#26500;&#31867;&#22411;&#26041;&#38754;&#26356;&#20855;&#28789;&#27963;&#24615;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#24212;&#29992;&#20013;&#23637;&#31034;&#20986;&#20102;&#24378;&#22823;&#30340;&#23454;&#35777;&#24615;&#33021;&#65292;&#20294;&#21516;&#26102;&#20063;&#24102;&#26469;&#20102;&#35299;&#20915;&#30456;&#20851;&#20248;&#21270;&#38382;&#39064;&#30340;&#35745;&#31639;&#25361;&#25112;&#12290;&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#20197;&#19979;&#38382;&#39064;&#65292;&#23547;&#27714;&#23545;&#20984;&#27491;&#21017;&#21270;&#22312;&#25928;&#33021;&#21644;&#23616;&#38480;&#24615;&#26041;&#38754;&#30340;&#31995;&#32479;&#29702;&#35299;&#65306;&#32473;&#23450;&#19968;&#20010;&#20998;&#24067;&#65292;&#23545;&#20110;&#20174;&#35813;&#20998;&#24067;&#20013;&#25277;&#21462;&#30340;&#25968;&#25454;&#65292;&#20160;&#20040;&#26159;&#26368;&#20248;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#65311;
&lt;/p&gt;
&lt;p&gt;
In optimization-based approaches to inverse problems and to statistical estimation, it is common to augment criteria that enforce data fidelity with a regularizer that promotes desired structural properties in the solution. The choice of a suitable regularizer is typically driven by a combination of prior domain information and computational considerations. Convex regularizers are attractive computationally but they are limited in the types of structure they can promote. On the other hand, nonconvex regularizers are more flexible in the forms of structure they can promote and they have showcased strong empirical performance in some applications, but they come with the computational challenge of solving the associated optimization problems. In this paper, we seek a systematic understanding of the power and the limitations of convex regularization by investigating the following questions: Given a distribution, what is the optimal regularizer for data drawn from the distribution? What pro
&lt;/p&gt;</description></item></channel></rss>