<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#36890;&#36807;&#20998;&#25968;&#25289;&#26222;&#25289;&#26031;&#29305;&#24449;&#26144;&#23556;&#65292;&#24320;&#21457;&#20102;&#38024;&#23545;&#30495;&#23454;&#22238;&#24402;&#20989;&#25968;&#38750;&#20809;&#28369;&#24773;&#20917;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#25104;&#21151;&#22788;&#29702;&#20102;&#35813;&#20989;&#25968;&#31867;&#22312;$L_2$-&#20998;&#25968; Sobolev &#31354;&#38388;&#20013;&#30340;&#29305;&#24615;&#65292;&#24182;&#35777;&#26126;&#20102;&#35823;&#24046;&#19978;&#30028;&#20026;$n^{-\frac{2s}{2s+d}}$&#12290;</title><link>https://arxiv.org/abs/2402.14985</link><description>&lt;p&gt;
&#36890;&#36807;&#20998;&#25968;&#25289;&#26222;&#25289;&#26031;&#29305;&#24449;&#26144;&#23556;&#36827;&#34892;&#38750;&#20809;&#28369;&#38750;&#21442;&#25968;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Nonsmooth Nonparametric Regression via Fractional Laplacian Eigenmaps
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14985
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#25968;&#25289;&#26222;&#25289;&#26031;&#29305;&#24449;&#26144;&#23556;&#65292;&#24320;&#21457;&#20102;&#38024;&#23545;&#30495;&#23454;&#22238;&#24402;&#20989;&#25968;&#38750;&#20809;&#28369;&#24773;&#20917;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#25104;&#21151;&#22788;&#29702;&#20102;&#35813;&#20989;&#25968;&#31867;&#22312;$L_2$-&#20998;&#25968; Sobolev &#31354;&#38388;&#20013;&#30340;&#29305;&#24615;&#65292;&#24182;&#35777;&#26126;&#20102;&#35823;&#24046;&#19978;&#30028;&#20026;$n^{-\frac{2s}{2s+d}}$&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20026;&#30495;&#23454;&#22238;&#24402;&#20989;&#25968;&#19981;&#19968;&#23450;&#24179;&#28369;&#30340;&#24773;&#20917;&#24320;&#21457;&#20102;&#38750;&#21442;&#25968;&#22238;&#24402;&#26041;&#27861;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;&#20102;&#20998;&#25968;&#25289;&#26222;&#25289;&#26031;&#65292;&#24182;&#26088;&#22312;&#22788;&#29702;&#30495;&#23454;&#22238;&#24402;&#20989;&#25968;&#20301;&#20110;$L_2$-&#20998;&#25968; Sobolev &#31354;&#38388;&#65288;&#38454;&#25968;&#20026;$s\in (0,1)$&#65289;&#30340;&#24773;&#20917;&#12290;&#35813;&#20989;&#25968;&#31867;&#26159;&#19968;&#20010; Hilbert &#31354;&#38388;&#65292;&#20301;&#20110;&#24179;&#26041;&#21487;&#31215;&#20989;&#25968;&#31354;&#38388;&#21644;&#19968;&#38454; Sobolev &#31354;&#38388;&#20043;&#38388;&#65292;&#21253;&#25324;&#20998;&#25968;&#24130;&#20989;&#25968;&#12289;&#20998;&#27573;&#24120;&#25968;&#25110;&#22810;&#39033;&#24335;&#20989;&#25968;&#20197;&#21450;&#23574;&#23792;&#20989;&#25968;&#20316;&#20026;&#20856;&#22411;&#31034;&#20363;&#12290;&#23545;&#20110;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20851;&#20110;&#26679;&#26412;&#20869;&#22343;&#26041;&#20272;&#35745;&#35823;&#24046;&#30340;&#19978;&#30028;&#65292;&#20855;&#26377;$n^{-\frac{2s}{2s+d}}$&#30340;&#38454;&#65292;&#20854;&#20013;$d$&#26159;&#32500;&#25968;&#65292;$s$&#26159;&#21069;&#36848;&#39034;&#24207;&#21442;&#25968;&#65292;$n$&#26159;&#35266;&#27979;&#25968;&#37327;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#21021;&#27493;&#30340;&#23454;&#35777;&#32467;&#26524;&#65292;&#39564;&#35777;&#20102;&#25152;&#24320;&#21457;&#26041;&#27861;&#30340;&#23454;&#38469;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14985v1 Announce Type: cross  Abstract: We develop nonparametric regression methods for the case when the true regression function is not necessarily smooth. More specifically, our approach is using the fractional Laplacian and is designed to handle the case when the true regression function lies in an $L_2$-fractional Sobolev space with order $s\in (0,1)$. This function class is a Hilbert space lying between the space of square-integrable functions and the first-order Sobolev space consisting of differentiable functions. It contains fractional power functions, piecewise constant or polynomial functions and bump function as canonical examples. For the proposed approach, we prove upper bounds on the in-sample mean-squared estimation error of order $n^{-\frac{2s}{2s+d}}$, where $d$ is the dimension, $s$ is the aforementioned order parameter and $n$ is the number of observations. We also provide preliminary empirical results validating the practical performance of the developed
&lt;/p&gt;</description></item></channel></rss>