<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#24341;&#20837;&#31532;&#19977;&#32500;&#24230;&#65292;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#20026;ROC&#26354;&#38754;&#65292;&#25552;&#20986;VOROS&#20316;&#20026;2D ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;3D&#27867;&#21270;&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25104;&#26412;&#12290;</title><link>https://arxiv.org/abs/2402.18689</link><description>&lt;p&gt;
VOROS&#65306;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#21040;3D
&lt;/p&gt;
&lt;p&gt;
The VOROS: Lifting ROC curves to 3D
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18689
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#31532;&#19977;&#32500;&#24230;&#65292;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#20026;ROC&#26354;&#38754;&#65292;&#25552;&#20986;VOROS&#20316;&#20026;2D ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;3D&#27867;&#21270;&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#26159;&#19968;&#20010;&#24120;&#29992;&#30340;&#24230;&#37327;&#65292;&#36890;&#24120;&#29992;&#20110;&#25490;&#21015;&#19981;&#21516;&#20108;&#20803;&#20998;&#31867;&#22120;&#30340;&#30456;&#23545;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#27491;&#22914;&#20197;&#21069;&#25152;&#25351;&#20986;&#30340;&#65292;&#24403;&#30495;&#23454;&#31867;&#20540;&#25110;&#35823;&#20998;&#31867;&#25104;&#26412;&#22312;&#20004;&#20010;&#31867;&#21035;&#20043;&#38388;&#39640;&#24230;&#19981;&#24179;&#34913;&#26102;&#65292;&#23427;&#21487;&#33021;&#26080;&#27861;&#20934;&#30830;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25928;&#30410;&#12290;&#25105;&#20204;&#24341;&#20837;&#31532;&#19977;&#32500;&#26469;&#25429;&#33719;&#36825;&#20123;&#25104;&#26412;&#65292;&#24182;&#20197;&#19968;&#31181;&#33258;&#28982;&#30340;&#26041;&#24335;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#20026;ROC&#26354;&#38754;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20010;&#26354;&#38754;&#65292;&#24182;&#24341;&#20837;&#20102;VOROS&#65292;&#21363;ROC&#26354;&#38754;&#19978;&#26041;&#30340;&#20307;&#31215;&#65292;&#20316;&#20026;2D ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;3D&#27867;&#21270;&#12290;&#23545;&#20110;&#23384;&#22312;&#39044;&#26399;&#25104;&#26412;&#25110;&#31867;&#21035;&#19981;&#24179;&#34913;&#36793;&#30028;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#38480;&#21046;&#32771;&#34385;&#36866;&#24403;&#23376;&#21306;&#22495;&#30340;ROC&#26354;&#38754;&#30340;&#20307;&#31215;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;VOROS&#22914;&#20309;&#22312;&#32463;&#20856;&#21644;&#29616;&#20195;&#31034;&#20363;&#25968;&#25454;&#38598;&#19978;&#26356;&#22909;&#22320;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18689v1 Announce Type: new  Abstract: The area under the ROC curve is a common measure that is often used to rank the relative performance of different binary classifiers. However, as has been also previously noted, it can be a measure that ill-captures the benefits of different classifiers when either the true class values or misclassification costs are highly unbalanced between the two classes. We introduce a third dimension to capture these costs, and lift the ROC curve to a ROC surface in a natural way. We study both this surface and introduce the VOROS, the volume over this ROC surface, as a 3D generalization of the 2D area under the ROC curve. For problems where there are only bounds on the expected costs or class imbalances, we restrict consideration to the volume of the appropriate subregion of the ROC surface. We show how the VOROS can better capture the costs of different classifiers on both a classical and a modern example dataset.
&lt;/p&gt;</description></item></channel></rss>