<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#32467;&#21512;&#20102;&#26080;&#20559;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#65292;&#36890;&#36807;&#24320;&#21457;&#21322;&#31934;&#30830;&#30340;&#23545;&#25968;&#27431;&#25289;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#29575;&#20026;O(h)&#65292;&#36866;&#29992;&#20110;&#22810;&#31181;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2301.12072</link><description>&lt;p&gt;
&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#30340;&#26080;&#20559;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Unbiased estimators for the Heston model with stochastic interest rates. (arXiv:2301.12072v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.12072
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32467;&#21512;&#20102;&#26080;&#20559;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#65292;&#36890;&#36807;&#24320;&#21457;&#21322;&#31934;&#30830;&#30340;&#23545;&#25968;&#27431;&#25289;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#20854;&#25910;&#25947;&#29575;&#20026;O(h)&#65292;&#36866;&#29992;&#20110;&#22810;&#31181;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32467;&#21512;&#20102;Rhee&#21644;Glynn&#65288;Operations Research: 63(5), 1026-1043&#65292;2015&#65289;&#20013;&#30340;&#26080;&#20559;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#39318;&#20808;&#20026;&#20855;&#26377;&#38543;&#26426;&#21033;&#29575;&#30340;Heston&#27169;&#22411;&#24320;&#21457;&#20102;&#19968;&#20010;&#21322;&#31934;&#30830;&#30340;&#23545;&#25968;&#27431;&#25289;&#26041;&#26696;&#12290;&#28982;&#21518;&#65292;&#22312;&#19968;&#20123;&#28201;&#21644;&#30340;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#25910;&#25947;&#29575;&#22312;L^2&#33539;&#25968;&#20013;&#26159;O(h)&#65292;&#20854;&#20013;h&#26159;&#27493;&#38271;&#12290;&#35813;&#32467;&#26524;&#36866;&#29992;&#20110;&#35768;&#22810;&#27169;&#22411;&#65292;&#22914;Heston-Hull-While&#27169;&#22411;&#65292;Heston-CIR&#27169;&#22411;&#21644;Heston-Black-Karasinski&#27169;&#22411;&#12290;&#25968;&#20540;&#23454;&#39564;&#25903;&#25345;&#25105;&#20204;&#30340;&#29702;&#35770;&#25910;&#25947;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We combine the unbiased estimators in Rhee and Glynn (Operations Research: 63(5), 1026-1043, 2015) and the Heston model with stochastic interest rates. Specifically, we first develop a semi-exact log-Euler scheme for the Heston model with stochastic interest rates. Then, under mild assumptions, we show that the convergence rate in the $L^2$ norm is $O(h)$, where $h$ is the step size. The result applies to a large class of models, such as the Heston-Hull-While model, the Heston-CIR model and the Heston-Black-Karasinski model. Numerical experiments support our theoretical convergence rate.
&lt;/p&gt;</description></item></channel></rss>