<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#36890;&#36807;&#19968;&#27425;&#24615;&#20998;&#27835;&#20272;&#35745;&#21644;&#22810;&#36718;&#20272;&#35745;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#20998;&#24067;&#24335;&#29615;&#22659;&#19979;&#23545;&#21322;&#21442;&#25968;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#26032;&#20272;&#35745;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#20248;&#21270;&#35823;&#24046;&#30340;&#36229;&#32447;&#24615;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2210.08393</link><description>&lt;p&gt;
&#20998;&#24067;&#24335;&#20272;&#35745;&#21644;&#25512;&#26029;&#29992;&#20110;&#21322;&#21442;&#25968;&#20108;&#20803;&#21709;&#24212;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Distributed Estimation and Inference for Semi-parametric Binary Response Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2210.08393
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#19968;&#27425;&#24615;&#20998;&#27835;&#20272;&#35745;&#21644;&#22810;&#36718;&#20272;&#35745;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#20998;&#24067;&#24335;&#29615;&#22659;&#19979;&#23545;&#21322;&#21442;&#25968;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#26032;&#20272;&#35745;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#20248;&#21270;&#35823;&#24046;&#30340;&#36229;&#32447;&#24615;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#25216;&#26415;&#30340;&#21457;&#23637;&#20351;&#24471;&#25968;&#25454;&#25910;&#38598;&#30340;&#35268;&#27169;&#21069;&#25152;&#26410;&#26377;&#65292;&#36825;&#32473;&#35768;&#22810;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#24102;&#26469;&#20102;&#26032;&#25361;&#25112;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#24067;&#24335;&#35745;&#31639;&#29615;&#22659;&#19979;&#23545;&#21322;&#21442;&#25968;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#22120;&#65292;&#32780;&#26080;&#38656;&#39044;&#20808;&#25351;&#23450;&#22122;&#22768;&#20998;&#24067;&#12290;&#20256;&#32479;&#30340;&#20998;&#27835;&#20272;&#35745;&#22120;&#22312;&#35745;&#31639;&#19978;&#26114;&#36149;&#65292;&#24182;&#21463;&#21040;&#26426;&#22120;&#25968;&#37327;&#30340;&#38750;&#27491;&#21017;&#32422;&#26463;&#30340;&#38480;&#21046;&#65292;&#36825;&#26159;&#30001;&#20110;&#30446;&#26631;&#20989;&#25968;&#30340;&#39640;&#24230;&#38750;&#20809;&#28369;&#24615;&#36136;&#23548;&#33268;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;(1)&#22312;&#24179;&#28369;&#30446;&#26631;&#20043;&#21518;&#36827;&#34892;&#19968;&#27425;&#24615;&#20998;&#27835;&#20272;&#35745;&#20197;&#25918;&#23485;&#32422;&#26463;&#65292;&#20197;&#21450;(2)&#36890;&#36807;&#36845;&#20195;&#24179;&#28369;&#23436;&#20840;&#21435;&#38500;&#32422;&#26463;&#30340;&#22810;&#36718;&#20272;&#35745;&#12290;&#25105;&#20204;&#25351;&#23450;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;&#26680;&#24179;&#28369;&#22120;&#36873;&#25321;&#65292;&#36890;&#36807;&#39034;&#24207;&#32553;&#23567;&#24102;&#23485;&#22312;&#22810;&#27425;&#36845;&#20195;&#20013;&#23454;&#29616;&#20102;&#23545;&#20248;&#21270;&#35823;&#24046;&#30340;&#36229;&#32447;&#24615;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2210.08393v3 Announce Type: replace-cross  Abstract: The development of modern technology has enabled data collection of unprecedented size, which poses new challenges to many statistical estimation and inference problems. This paper studies the maximum score estimator of a semi-parametric binary choice model under a distributed computing environment without pre-specifying the noise distribution. An intuitive divide-and-conquer estimator is computationally expensive and restricted by a non-regular constraint on the number of machines, due to the highly non-smooth nature of the objective function. We propose (1) a one-shot divide-and-conquer estimator after smoothing the objective to relax the constraint, and (2) a multi-round estimator to completely remove the constraint via iterative smoothing. We specify an adaptive choice of kernel smoother with a sequentially shrinking bandwidth to achieve the superlinear improvement of the optimization error over the multiple iterations. The
&lt;/p&gt;</description></item></channel></rss>