<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#22312;&#37325;&#23614;&#25200;&#21160;&#19979;&#65292;&#22122;&#22768;SGD&#23454;&#29616;&#20102;&#24046;&#20998;&#38544;&#31169;&#20445;&#35777;&#65292;&#36866;&#29992;&#20110;&#24191;&#27867;&#30340;&#25439;&#22833;&#20989;&#25968;&#31867;&#65292;&#29305;&#21035;&#26159;&#38750;&#20984;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2403.02051</link><description>&lt;p&gt;
&#22312;&#37325;&#23614;&#25200;&#21160;&#19979;&#22122;&#22768;(S)GD&#30340;&#24046;&#20998;&#38544;&#31169;
&lt;/p&gt;
&lt;p&gt;
Differential Privacy of Noisy (S)GD under Heavy-Tailed Perturbations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02051
&lt;/p&gt;
&lt;p&gt;
&#22312;&#37325;&#23614;&#25200;&#21160;&#19979;&#65292;&#22122;&#22768;SGD&#23454;&#29616;&#20102;&#24046;&#20998;&#38544;&#31169;&#20445;&#35777;&#65292;&#36866;&#29992;&#20110;&#24191;&#27867;&#30340;&#25439;&#22833;&#20989;&#25968;&#31867;&#65292;&#29305;&#21035;&#26159;&#38750;&#20984;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23558;&#37325;&#23614;&#22122;&#22768;&#27880;&#20837;&#38543;&#26426;&#26799;&#24230;&#19979;&#38477;(SGD)&#30340;&#36845;&#20195;&#20013;&#24050;&#32463;&#24341;&#36215;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#12290;&#23613;&#31649;&#23545;&#23548;&#33268;&#30340;&#31639;&#27861;&#30340;&#21508;&#31181;&#29702;&#35770;&#24615;&#36136;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#20027;&#35201;&#26469;&#33258;&#23398;&#20064;&#29702;&#35770;&#21644;&#20248;&#21270;&#35270;&#35282;&#65292;&#20294;&#23427;&#20204;&#30340;&#38544;&#31169;&#20445;&#25252;&#24615;&#36136;&#23578;&#26410;&#24314;&#31435;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#32570;&#21475;&#65292;&#25105;&#20204;&#20026;&#22122;&#22768;SGD&#25552;&#20379;&#24046;&#20998;&#38544;&#31169;(DP)&#20445;&#35777;&#65292;&#24403;&#27880;&#20837;&#30340;&#22122;&#22768;&#36981;&#24490;$\alpha$-&#31283;&#23450;&#20998;&#24067;&#26102;&#65292;&#35813;&#20998;&#24067;&#21253;&#25324;&#19968;&#31995;&#21015;&#37325;&#23614;&#20998;&#24067;(&#20855;&#26377;&#26080;&#38480;&#26041;&#24046;)&#20197;&#21450;&#39640;&#26031;&#20998;&#24067;&#12290;&#32771;&#34385;$(\epsilon,\delta)$-DP&#26694;&#26550;&#65292;&#25105;&#20204;&#34920;&#26126;&#24102;&#26377;&#37325;&#23614;&#25200;&#21160;&#30340;SGD&#23454;&#29616;&#20102;$(0,\tilde{\mathcal{O}}(1/n))$-DP&#30340;&#24191;&#27867;&#25439;&#22833;&#20989;&#25968;&#31867;&#65292;&#36825;&#20123;&#20989;&#25968;&#21487;&#20197;&#26159;&#38750;&#20984;&#30340;&#65292;&#36825;&#37324;$n$&#26159;&#25968;&#25454;&#28857;&#30340;&#25968;&#37327;&#12290;&#20316;&#20026;&#19968;&#39033;&#26174;&#30528;&#30340;&#21103;&#20135;&#21697;&#65292;&#19982;&#20197;&#24448;&#30340;&#24037;&#20316;&#30456;&#21453;&#65292;&#35813;&#24037;&#20316;&#35201;&#27714;&#26377;&#30028;se
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02051v1 Announce Type: cross  Abstract: Injecting heavy-tailed noise to the iterates of stochastic gradient descent (SGD) has received increasing attention over the past few years. While various theoretical properties of the resulting algorithm have been analyzed mainly from learning theory and optimization perspectives, their privacy preservation properties have not yet been established. Aiming to bridge this gap, we provide differential privacy (DP) guarantees for noisy SGD, when the injected noise follows an $\alpha$-stable distribution, which includes a spectrum of heavy-tailed distributions (with infinite variance) as well as the Gaussian distribution. Considering the $(\epsilon, \delta)$-DP framework, we show that SGD with heavy-tailed perturbations achieves $(0, \tilde{\mathcal{O}}(1/n))$-DP for a broad class of loss functions which can be non-convex, where $n$ is the number of data points. As a remarkable byproduct, contrary to prior work that necessitates bounded se
&lt;/p&gt;</description></item></channel></rss>