<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#38656;&#35201;&#35843;&#21442;&#12289;&#19981;&#38656;&#35201;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#33258;&#21161;&#27861;&#27979;&#35797;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#22312;&#39640;&#32500;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#36866;&#29992;&#24615;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#33391;&#22909;&#24615;&#33021;&#65292;&#24182;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#38598;&#26102;&#25298;&#32477;&#20102;&#32463;&#20856;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#30340;&#25311;&#21512;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.13364</link><description>&lt;p&gt;
&#19981;&#38656;&#35201;&#35843;&#21442;&#30340;&#22240;&#23376;&#22238;&#24402;&#27979;&#35797;&#19982;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#30340;&#23545;&#31435;. (arXiv:2307.13364v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
Tuning-free testing of factor regression against factor-augmented sparse alternatives. (arXiv:2307.13364v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13364
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#38656;&#35201;&#35843;&#21442;&#12289;&#19981;&#38656;&#35201;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#33258;&#21161;&#27861;&#27979;&#35797;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#22312;&#39640;&#32500;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#36866;&#29992;&#24615;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#33391;&#22909;&#24615;&#33021;&#65292;&#24182;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#38598;&#26102;&#25298;&#32477;&#20102;&#32463;&#20856;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#30340;&#25311;&#21512;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#21161;&#27861;&#30340;&#22240;&#23376;&#22238;&#24402;&#26377;&#25928;&#24615;&#27979;&#35797;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#38598;&#25104;&#20102;&#22240;&#23376;&#22238;&#24402;&#21644;&#31232;&#30095;&#22238;&#24402;&#25216;&#26415;&#30340;&#39640;&#32500;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#20013;&#20351;&#29992;&#12290;&#35813;&#27979;&#35797;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#35780;&#20272;&#32463;&#20856;&#65288;&#23494;&#38598;&#65289;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#19982;&#26367;&#20195;&#65288;&#31232;&#30095;&#21152;&#23494;&#38598;&#65289;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#30340;&#36866;&#29992;&#24615;&#30340;&#26041;&#24335;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#27979;&#35797;&#19981;&#38656;&#35201;&#35843;&#21442;&#65292;&#28040;&#38500;&#20102;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#38656;&#27714;&#65292;&#24182;&#19988;&#22312;&#23454;&#29616;&#19978;&#31616;&#21333;&#12290;&#35813;&#27979;&#35797;&#30340;&#26377;&#25928;&#24615;&#22312;&#26102;&#38388;&#24207;&#21015;&#30456;&#20851;&#24615;&#19979;&#22312;&#29702;&#35770;&#19978;&#24471;&#21040;&#20102;&#35777;&#26126;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#19979;&#30340;&#33391;&#22909;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;FRED-MD&#25968;&#25454;&#38598;&#24212;&#29992;&#20102;&#35813;&#27979;&#35797;&#65292;&#24182;&#22312;&#22240;&#21464;&#37327;&#20026;&#36890;&#32960;&#26102;&#25298;&#32477;&#20102;&#32463;&#20856;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#30340;&#25311;&#21512;&#24615;&#65292;&#20294;&#22312;&#22240;&#21464;&#37327;&#20026;&#24037;&#19994;&#29983;&#20135;&#26102;&#26410;&#25298;&#32477;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#36873;&#25321;&#36866;&#24403;&#27169;&#22411;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study introduces a bootstrap test of the validity of factor regression within a high-dimensional factor-augmented sparse regression model that integrates factor and sparse regression techniques. The test provides a means to assess the suitability of the classical (dense) factor regression model compared to alternative (sparse plus dense) factor-augmented sparse regression models. Our proposed test does not require tuning parameters, eliminates the need to estimate covariance matrices, and offers simplicity in implementation. The validity of the test is theoretically established under time-series dependence. Through simulation experiments, we demonstrate the favorable finite sample performance of our procedure. Moreover, using the FRED-MD dataset, we apply the test and reject the adequacy of the classical factor regression model when the dependent variable is inflation but not when it is industrial production. These findings offer insights into selecting appropriate models for high
&lt;/p&gt;</description></item></channel></rss>