<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#38750;&#21442;&#25968;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#36827;&#34892;&#22522;&#20110;&#27169;&#22411;&#30340;&#32858;&#31867;&#26102;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#65292;&#24182;&#25552;&#20986;&#20102;&#30456;&#24212;&#30340;&#32858;&#31867;&#26041;&#27861;&#12290;&#36890;&#36807;&#30740;&#31350;&#20998;&#31867;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#21644;&#32858;&#31867;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#30830;&#23450;&#20102;&#32858;&#31867;&#20219;&#21153;&#30340;&#38590;&#24230;&#12290;&#21516;&#26102;&#65292;&#22312;&#25554;&#20540;&#20998;&#31867;&#22120;&#21644;&#22312;&#32447;&#35774;&#32622;&#20013;&#30340;&#32467;&#26524;&#20063;&#24471;&#21040;&#20102;&#35777;&#26126;&#12290;&#27169;&#25311;&#23454;&#39564;&#39564;&#35777;&#20102;&#36825;&#20123;&#21457;&#29616;&#12290;</title><link>http://arxiv.org/abs/2309.12238</link><description>&lt;p&gt;
&#20351;&#29992;&#38750;&#21442;&#25968;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#30340;&#22522;&#20110;&#27169;&#22411;&#30340;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
Model-based Clustering using Non-parametric Hidden Markov Models. (arXiv:2309.12238v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12238
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#38750;&#21442;&#25968;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#36827;&#34892;&#22522;&#20110;&#27169;&#22411;&#30340;&#32858;&#31867;&#26102;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#65292;&#24182;&#25552;&#20986;&#20102;&#30456;&#24212;&#30340;&#32858;&#31867;&#26041;&#27861;&#12290;&#36890;&#36807;&#30740;&#31350;&#20998;&#31867;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#21644;&#32858;&#31867;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#30830;&#23450;&#20102;&#32858;&#31867;&#20219;&#21153;&#30340;&#38590;&#24230;&#12290;&#21516;&#26102;&#65292;&#22312;&#25554;&#20540;&#20998;&#31867;&#22120;&#21644;&#22312;&#32447;&#35774;&#32622;&#20013;&#30340;&#32467;&#26524;&#20063;&#24471;&#21040;&#20102;&#35777;&#26126;&#12290;&#27169;&#25311;&#23454;&#39564;&#39564;&#35777;&#20102;&#36825;&#20123;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21442;&#25968;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#65288;HMM&#65289;&#30001;&#20110;&#20854;&#20381;&#36182;&#32467;&#26500;&#65292;&#21487;&#20197;&#22312;&#19981;&#25351;&#23450;&#32676;&#32452;&#20998;&#24067;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#22522;&#20110;&#27169;&#22411;&#30340;&#32858;&#31867;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20351;&#29992;HMM&#36827;&#34892;&#32858;&#31867;&#26102;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#65292;&#24182;&#25552;&#20986;&#20102;&#30456;&#24212;&#30340;&#32858;&#31867;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#23558;&#20998;&#31867;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#19982;&#32858;&#31867;&#30340;&#36125;&#21494;&#26031;&#39118;&#38505;&#32852;&#31995;&#36215;&#26469;&#30340;&#32467;&#26524;&#65292;&#29992;&#20197;&#30830;&#23450;&#32858;&#31867;&#20219;&#21153;&#30340;&#38590;&#24230;&#30340;&#20851;&#38190;&#25968;&#37327;&#12290;&#25105;&#20204;&#36824;&#22312;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#26694;&#26550;&#19979;&#35777;&#26126;&#20102;&#36825;&#19968;&#32467;&#26524;&#65292;&#36825;&#21487;&#33021;&#20855;&#26377;&#29420;&#31435;&#30340;&#20852;&#36259;&#12290;&#28982;&#21518;&#25105;&#20204;&#30740;&#31350;&#20102;&#25554;&#20540;&#20998;&#31867;&#22120;&#30340;&#36807;&#24230;&#39118;&#38505;&#12290;&#25152;&#26377;&#36825;&#20123;&#32467;&#26524;&#37117;&#34987;&#35777;&#26126;&#22312;&#22312;&#32447;&#35774;&#32622;&#20013;&#20173;&#28982;&#26377;&#25928;&#65292;&#22312;&#35813;&#35774;&#32622;&#19979;&#65292;&#35266;&#27979;&#32467;&#26524;&#34987;&#39034;&#24207;&#32858;&#31867;&#12290;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Thanks to their dependency structure, non-parametric Hidden Markov Models (HMMs) are able to handle model-based clustering without specifying group distributions. The aim of this work is to study the Bayes risk of clustering when using HMMs and to propose associated clustering procedures. We first give a result linking the Bayes risk of classification and the Bayes risk of clustering, which we use to identify the key quantity determining the difficulty of the clustering task. We also give a proof of this result in the i.i.d. framework, which might be of independent interest. Then we study the excess risk of the plugin classifier. All these results are shown to remain valid in the online setting where observations are clustered sequentially. Simulations illustrate our findings.
&lt;/p&gt;</description></item></channel></rss>