<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#30740;&#31350;&#20102;Metropolis-within-Gibbs&#26041;&#26696;&#22312;&#39640;&#32500;&#36125;&#21494;&#26031;&#27169;&#22411;&#20013;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#24314;&#31435;&#20102;&#19982;&#25968;&#20540;&#35777;&#25454;&#23494;&#20999;&#19968;&#33268;&#30340;&#19982;&#32500;&#24230;&#26080;&#20851;&#30340;&#25910;&#25947;&#32467;&#26524;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#22312;&#20108;&#20803;&#22238;&#24402;&#21644;&#31163;&#25955;&#35266;&#23519;&#25193;&#25955;&#36125;&#21494;&#26031;&#27169;&#22411;&#20013;&#30340;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.09416</link><description>&lt;p&gt;
Metropolis-within-Gibbs&#26041;&#26696;&#22312;&#39640;&#32500;&#36125;&#21494;&#26031;&#27169;&#22411;&#20013;&#30340;&#21487;&#25193;&#23637;&#24615;
&lt;/p&gt;
&lt;p&gt;
Scalability of Metropolis-within-Gibbs schemes for high-dimensional Bayesian models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09416
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;Metropolis-within-Gibbs&#26041;&#26696;&#22312;&#39640;&#32500;&#36125;&#21494;&#26031;&#27169;&#22411;&#20013;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#24314;&#31435;&#20102;&#19982;&#25968;&#20540;&#35777;&#25454;&#23494;&#20999;&#19968;&#33268;&#30340;&#19982;&#32500;&#24230;&#26080;&#20851;&#30340;&#25910;&#25947;&#32467;&#26524;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#22312;&#20108;&#20803;&#22238;&#24402;&#21644;&#31163;&#25955;&#35266;&#23519;&#25193;&#25955;&#36125;&#21494;&#26031;&#27169;&#22411;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#33324;&#30340;&#22352;&#26631;&#36880;&#27493;MCMC&#26041;&#26696;&#65288;&#22914;Metropolis-within-Gibbs&#25277;&#26679;&#22120;&#65289;&#65292;&#36825;&#20123;&#26041;&#26696;&#36890;&#24120;&#29992;&#20110;&#25311;&#21512;&#36125;&#21494;&#26031;&#38750;&#20849;&#36717;&#20998;&#23618;&#27169;&#22411;&#12290;&#25105;&#20204;&#23558;&#23427;&#20204;&#30340;&#25910;&#25947;&#24615;&#36136;&#19982;&#30456;&#24212;&#30340;&#65288;&#21487;&#33021;&#26080;&#27861;&#23454;&#29616;&#30340;&#65289;Gibbs&#25277;&#26679;&#22120;&#30340;&#27010;&#24565;&#32852;&#31995;&#36215;&#26469;&#65292;&#36890;&#36807;&#26465;&#20214;&#23548;&#32435;&#30340;&#27010;&#24565;&#12290;&#36825;&#20351;&#25105;&#20204;&#33021;&#22815;&#30740;&#31350;&#27969;&#34892;&#30340;Metropolis-within-Gibbs&#26041;&#26696;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65288;&#25968;&#25454;&#28857;&#21644;&#21442;&#25968;&#21516;&#26102;&#22686;&#21152;&#65289;&#30340;&#38750;&#20849;&#36717;&#20998;&#23618;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;&#22312;&#32473;&#23450;&#38543;&#26426;&#25968;&#25454;&#29983;&#25104;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19982;&#25968;&#20540;&#35777;&#25454;&#23494;&#20999;&#19968;&#33268;&#30340;&#19982;&#32500;&#24230;&#26080;&#20851;&#30340;&#25910;&#25947;&#32467;&#26524;&#12290;&#36824;&#35752;&#35770;&#20102;&#22312;&#20855;&#26377;&#26410;&#30693;&#36229;&#21442;&#25968;&#30340;&#20108;&#20803;&#22238;&#24402;&#36125;&#21494;&#26031;&#27169;&#22411;&#21644;&#31163;&#25955;&#35266;&#23519;&#25193;&#25955;&#26041;&#38754;&#30340;&#24212;&#29992;&#12290;&#21463;&#36825;&#31867;&#32479;&#35745;&#24212;&#29992;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#20851;&#20110;&#36817;&#20284;&#23548;&#32435;&#21644;&#25200;&#21160;&#30340;&#29420;&#31435;&#20852;&#36259;&#30340;&#36741;&#21161;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09416v1 Announce Type: cross  Abstract: We study general coordinate-wise MCMC schemes (such as Metropolis-within-Gibbs samplers), which are commonly used to fit Bayesian non-conjugate hierarchical models. We relate their convergence properties to the ones of the corresponding (potentially not implementable) Gibbs sampler through the notion of conditional conductance. This allows us to study the performances of popular Metropolis-within-Gibbs schemes for non-conjugate hierarchical models, in high-dimensional regimes where both number of datapoints and parameters increase. Given random data-generating assumptions, we establish dimension-free convergence results, which are in close accordance with numerical evidences. Applications to Bayesian models for binary regression with unknown hyperparameters and discretely observed diffusions are also discussed. Motivated by such statistical applications, auxiliary results of independent interest on approximate conductances and perturba
&lt;/p&gt;</description></item></channel></rss>