<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#19979;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#65292;&#21457;&#29616;&#22312;&#23614;&#37096;&#65292;&#26080;&#26465;&#20214;&#30340;&#20013;&#38388;&#32423;&#21035;&#20998;&#20301;&#25968;&#30340;&#26497;&#38480;&#20998;&#24067;&#25910;&#25947;&#20110;&#39640;&#26031;&#20998;&#24067;&#65292;&#24182;&#23558;&#20854;&#25193;&#23637;&#21040;&#20013;&#38388;&#32423;&#21035;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#22238;&#24402;&#12290;</title><link>https://arxiv.org/abs/2402.19268</link><description>&lt;p&gt;
&#20004;&#21521;&#32858;&#31867;&#19979;&#20013;&#38388;&#32423;&#21035;&#39034;&#24207;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;
&lt;/p&gt;
&lt;p&gt;
Extremal quantiles of intermediate orders under two-way clustering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19268
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#19979;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#65292;&#21457;&#29616;&#22312;&#23614;&#37096;&#65292;&#26080;&#26465;&#20214;&#30340;&#20013;&#38388;&#32423;&#21035;&#20998;&#20301;&#25968;&#30340;&#26497;&#38480;&#20998;&#24067;&#25910;&#25947;&#20110;&#39640;&#26031;&#20998;&#24067;&#65292;&#24182;&#23558;&#20854;&#25193;&#23637;&#21040;&#20013;&#38388;&#32423;&#21035;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#22238;&#24402;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#19979;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#23614;&#37096;&#26080;&#26465;&#20214;&#20013;&#38388;&#32423;&#21035;&#20998;&#20301;&#25968;&#30340;&#26497;&#38480;&#20998;&#24067;&#25910;&#25947;&#20110;&#39640;&#26031;&#20998;&#24067;&#12290;&#36825;&#19968;&#28857;&#38750;&#24120;&#37325;&#35201;&#65292;&#22240;&#20026;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#28041;&#21450;&#28508;&#22312;&#30340;&#38750;&#39640;&#26031;&#24615;&#65292;&#20294;&#26497;&#20540;&#20998;&#20301;&#25968;&#19981;&#20250;&#21463;&#21040;&#27492;&#38382;&#39064;&#30340;&#24433;&#21709;&#12290;&#22522;&#20110;&#36825;&#19968;&#32467;&#26524;&#65292;&#25105;&#20204;&#23558;&#20998;&#26512;&#25193;&#23637;&#21040;&#20013;&#38388;&#32423;&#21035;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#22238;&#24402;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19268v1 Announce Type: cross  Abstract: This paper investigates extremal quantiles under two-way cluster dependence. We demonstrate that the limiting distribution of the unconditional intermediate order quantiles in the tails converges to a Gaussian distribution. This is remarkable as two-way cluster dependence entails potential non-Gaussianity in general, but extremal quantiles do not suffer from this issue. Building upon this result, we extend our analysis to extremal quantile regressions of intermediate order.
&lt;/p&gt;</description></item></channel></rss>