<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#19968;&#33324;&#28151;&#21512;&#38543;&#26426;&#36807;&#31243;&#30340;&#26679;&#26412;&#22343;&#20540;&#19978;&#30830;&#30028;&#30340;&#30028;&#38480;&#65292;&#19981;&#21463;&#28151;&#21512;&#36895;&#24230;&#30340;&#24433;&#21709;&#65292;&#24378;&#35843;&#20102;&#38598;&#20013;&#36895;&#29575;&#21644;&#22797;&#26434;&#24230;&#24230;&#37327;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#28151;&#21512;&#36895;&#24230;&#23545;&#38598;&#20013;&#36895;&#29575;&#30340;&#24433;&#21709;&#65292;&#24341;&#20837;&#20102;&#30456;&#21464;&#30340;&#27010;&#24565;&#12290;</title><link>https://arxiv.org/abs/2402.11394</link><description>&lt;p&gt;
&#22522;&#20110;&#19968;&#33324;&#28151;&#21512;&#26465;&#20214;&#30340;&#32463;&#39564;&#36807;&#31243;&#30340;&#26497;&#20540;&#19981;&#31561;&#24335;&#21450;&#20854;&#22312;&#24378;&#36924;&#36817;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Maximal Inequalities for Empirical Processes under General Mixing Conditions with an Application to Strong Approximations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11394
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#19968;&#33324;&#28151;&#21512;&#38543;&#26426;&#36807;&#31243;&#30340;&#26679;&#26412;&#22343;&#20540;&#19978;&#30830;&#30028;&#30340;&#30028;&#38480;&#65292;&#19981;&#21463;&#28151;&#21512;&#36895;&#24230;&#30340;&#24433;&#21709;&#65292;&#24378;&#35843;&#20102;&#38598;&#20013;&#36895;&#29575;&#21644;&#22797;&#26434;&#24230;&#24230;&#37327;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#28151;&#21512;&#36895;&#24230;&#23545;&#38598;&#20013;&#36895;&#29575;&#30340;&#24433;&#21709;&#65292;&#24341;&#20837;&#20102;&#30456;&#21464;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#20855;&#26377;&#20219;&#24847;&#28151;&#21512;&#29575;&#30340;&#19968;&#33324;&#28151;&#21512;&#38543;&#26426;&#36807;&#31243;&#25552;&#20379;&#20102;&#19968;&#20010;&#26679;&#26412;&#22343;&#20540;&#30340;&#19978;&#30830;&#30028;&#30340;&#30028;&#38480;&#12290;&#26080;&#35770;&#28151;&#21512;&#30340;&#36895;&#24230;&#22914;&#20309;&#65292;&#35813;&#30028;&#38480;&#30001;&#19968;&#20010;&#38598;&#20013;&#36895;&#29575;&#21644;&#19968;&#31181;&#26032;&#39062;&#30340;&#22797;&#26434;&#24230;&#24230;&#37327;&#32452;&#25104;&#12290;&#28982;&#32780;&#65292;&#28151;&#21512;&#30340;&#36895;&#24230;&#24433;&#21709;&#21069;&#32773;&#30340;&#25968;&#37327;&#65292;&#24847;&#21619;&#30528;&#20986;&#29616;&#20102;&#30456;&#21464;&#12290;&#24555;&#36895;&#28151;&#21512;&#23548;&#33268;&#26631;&#20934;&#30340;&#26681;&#21495;n&#38598;&#20013;&#36895;&#29575;&#65292;&#32780;&#24930;&#36895;&#28151;&#21512;&#23548;&#33268;&#36739;&#24930;&#30340;&#38598;&#20013;&#36895;&#29575;&#65292;&#20854;&#36895;&#24230;&#21462;&#20915;&#20110;&#28151;&#21512;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#24212;&#29992;&#20110;&#25512;&#23548;&#20855;&#26377;&#20219;&#24847;&#28151;&#21512;&#29575;&#30340;&#19968;&#33324;&#28151;&#21512;&#36807;&#31243;&#30340;&#24378;&#36924;&#36817;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11394v1 Announce Type: cross  Abstract: This paper provides a bound for the supremum of sample averages over a class of functions for a general class of mixing stochastic processes with arbitrary mixing rates. Regardless of the speed of mixing, the bound is comprised of a concentration rate and a novel measure of complexity. The speed of mixing, however, affects the former quantity implying a phase transition. Fast mixing leads to the standard root-n concentration rate, while slow mixing leads to a slower concentration rate, its speed depends on the mixing structure. Our findings are applied to derive strong approximation results for a general class of mixing processes with arbitrary mixing rates.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#38543;&#26426;&#22810;&#33218;&#36172;&#21338;&#38382;&#39064;&#20013;&#65292;&#22914;&#20309;&#22312;&#26399;&#26395;&#21644;&#23614;&#37096;&#39118;&#38505;&#20043;&#38388;&#20570;&#20986;&#26368;&#20248;&#26435;&#34913;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31574;&#30053;&#65292;&#33021;&#22815;&#23454;&#29616;&#26368;&#22351;&#21644;&#23454;&#20363;&#30456;&#20851;&#30340;&#20248;&#24322;&#34920;&#29616;&#65292;&#24182;&#19988;&#33021;&#22815;&#26368;&#23567;&#21270;&#36951;&#25022;&#23614;&#37096;&#27010;&#29575;&#12290;</title><link>http://arxiv.org/abs/2304.04341</link><description>&lt;p&gt;
&#38543;&#26426;&#36172;&#21338;&#26426;&#20013;&#30340;&#36951;&#25022;&#20998;&#24067;&#65306;&#26399;&#26395;&#21644;&#23614;&#37096;&#39118;&#38505;&#20043;&#38388;&#30340;&#26368;&#20248;&#26435;&#34913;
&lt;/p&gt;
&lt;p&gt;
Regret Distribution in Stochastic Bandits: Optimal Trade-off between Expectation and Tail Risk. (arXiv:2304.04341v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04341
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#38543;&#26426;&#22810;&#33218;&#36172;&#21338;&#38382;&#39064;&#20013;&#65292;&#22914;&#20309;&#22312;&#26399;&#26395;&#21644;&#23614;&#37096;&#39118;&#38505;&#20043;&#38388;&#20570;&#20986;&#26368;&#20248;&#26435;&#34913;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31574;&#30053;&#65292;&#33021;&#22815;&#23454;&#29616;&#26368;&#22351;&#21644;&#23454;&#20363;&#30456;&#20851;&#30340;&#20248;&#24322;&#34920;&#29616;&#65292;&#24182;&#19988;&#33021;&#22815;&#26368;&#23567;&#21270;&#36951;&#25022;&#23614;&#37096;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#22810;&#33218;&#36172;&#21338;&#38382;&#39064;&#20013;&#65292;&#36951;&#25022;&#20998;&#24067;&#30340;&#26399;&#26395;&#21644;&#23614;&#37096;&#39118;&#38505;&#20043;&#38388;&#30340;&#26435;&#34913;&#38382;&#39064;&#12290;&#25105;&#20204;&#23436;&#20840;&#21051;&#30011;&#20102;&#31574;&#30053;&#35774;&#35745;&#20013;&#19977;&#20010;&#26399;&#26395;&#24615;&#36136;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#65306;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#24615;&#65292;&#23454;&#20363;&#30456;&#20851;&#30340;&#19968;&#33268;&#24615;&#21644;&#36731;&#23614;&#39118;&#38505;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#26399;&#26395;&#36951;&#25022;&#30340;&#39034;&#24207;&#22914;&#20309;&#24433;&#21709;&#36951;&#25022;&#23614;&#37096;&#27010;&#29575;&#30340;&#34928;&#20943;&#29575;&#65292;&#21516;&#26102;&#21253;&#25324;&#20102;&#26368;&#22351;&#24773;&#20917;&#21644;&#23454;&#20363;&#30456;&#20851;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31574;&#30053;&#65292;&#20197;&#34920;&#24449;&#23545;&#20110;&#20219;&#20309;&#36951;&#25022;&#38408;&#20540;&#30340;&#26368;&#20248;&#36951;&#25022;&#23614;&#37096;&#27010;&#29575;&#12290;&#20855;&#20307;&#22320;&#65292;&#23545;&#20110;&#20219;&#20309;&#32473;&#23450;&#30340;$\alpha \in [1/2, 1)$&#21644;$\beta \in [0, \alpha]$&#65292;&#25105;&#20204;&#30340;&#31574;&#30053;&#21487;&#20197;&#23454;&#29616;&#24179;&#22343;&#26399;&#26395;&#36951;&#25022;$\tilde O(T^\alpha)$&#30340;&#26368;&#22351;&#24773;&#20917;&#19979;$\alpha$-&#26368;&#20248;&#21644;&#26399;&#26395;&#36951;&#25022;$\tilde O(T^\beta)$&#30340;&#23454;&#20363;&#30456;&#20851;&#30340;$\beta$-&#19968;&#33268;&#24615;&#65292;&#24182;&#19988;&#20139;&#26377;&#19968;&#23450;&#30340;&#27010;&#29575;&#21487;&#20197;&#36991;&#20813;$\tilde O(T^\delta)$&#30340;&#36951;&#25022;($\delta \geq \alpha$&#22312;&#26368;&#22351;&#24773;&#20917;&#19979;&#21644;$\delta \geq \beta$&#22312;&#23454;&#20363;&#30456;&#20851;&#30340;&#24773;&#20917;&#19979;)&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the trade-off between expectation and tail risk for regret distribution in the stochastic multi-armed bandit problem. We fully characterize the interplay among three desired properties for policy design: worst-case optimality, instance-dependent consistency, and light-tailed risk. We show how the order of expected regret exactly affects the decaying rate of the regret tail probability for both the worst-case and instance-dependent scenario. A novel policy is proposed to characterize the optimal regret tail probability for any regret threshold. Concretely, for any given $\alpha\in[1/2, 1)$ and $\beta\in[0, \alpha]$, our policy achieves a worst-case expected regret of $\tilde O(T^\alpha)$ (we call it $\alpha$-optimal) and an instance-dependent expected regret of $\tilde O(T^\beta)$ (we call it $\beta$-consistent), while enjoys a probability of incurring an $\tilde O(T^\delta)$ regret ($\delta\geq\alpha$ in the worst-case scenario and $\delta\geq\beta$ in the instance-dependent s
&lt;/p&gt;</description></item></channel></rss>