<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25216;&#26415;&#65292;&#31216;&#20026;UTOPIA&#65292;&#29992;&#20110;&#32858;&#21512;&#22810;&#20010;&#39044;&#27979;&#21306;&#38388;&#20197;&#20943;&#23567;&#20854;&#23485;&#24230;&#24182;&#20445;&#35777;&#35206;&#30422;&#29575;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#32447;&#24615;&#25110;&#20984;&#35268;&#21010;&#65292;&#26131;&#20110;&#23454;&#29616;&#65292;&#36866;&#29992;&#33539;&#22260;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2306.16549</link><description>&lt;p&gt;
UTOPIA&#65306;&#36890;&#29992;&#21487;&#35757;&#32451;&#30340;&#26368;&#20248;&#39044;&#27979;&#21306;&#38388;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
UTOPIA: Universally Trainable Optimal Prediction Intervals Aggregation. (arXiv:2306.16549v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16549
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25216;&#26415;&#65292;&#31216;&#20026;UTOPIA&#65292;&#29992;&#20110;&#32858;&#21512;&#22810;&#20010;&#39044;&#27979;&#21306;&#38388;&#20197;&#20943;&#23567;&#20854;&#23485;&#24230;&#24182;&#20445;&#35777;&#35206;&#30422;&#29575;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#32447;&#24615;&#25110;&#20984;&#35268;&#21010;&#65292;&#26131;&#20110;&#23454;&#29616;&#65292;&#36866;&#29992;&#33539;&#22260;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26159;&#19968;&#20010;&#26377;&#36259;&#30340;&#38382;&#39064;&#65292;&#22312;&#29983;&#29289;&#21307;&#23398;&#31185;&#23398;&#12289;&#32463;&#27982;&#30740;&#31350;&#21644;&#22825;&#27668;&#39044;&#25253;&#31561;&#21508;&#20010;&#39046;&#22495;&#26377;&#37325;&#35201;&#30340;&#24212;&#29992;&#12290;&#26500;&#24314;&#39044;&#27979;&#21306;&#38388;&#30340;&#26041;&#27861;&#26377;&#24456;&#22810;&#65292;&#22914;&#20998;&#20301;&#25968;&#22238;&#24402;&#21644;&#19968;&#33268;&#24615;&#39044;&#27979;&#31561;&#12290;&#28982;&#32780;&#65292;&#27169;&#22411;&#38169;&#35823;&#35268;&#23450;&#65288;&#23588;&#20854;&#26159;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65289;&#25110;&#27425;&#20248;&#30340;&#26500;&#36896;&#36890;&#24120;&#20250;&#23548;&#33268;&#26377;&#20559;&#25110;&#36807;&#23485;&#30340;&#39044;&#27979;&#21306;&#38388;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#19988;&#24191;&#27867;&#36866;&#29992;&#30340;&#25216;&#26415;&#65292;&#29992;&#20110;&#32858;&#21512;&#22810;&#20010;&#39044;&#27979;&#21306;&#38388;&#20197;&#26368;&#23567;&#21270;&#39044;&#27979;&#24102;&#30340;&#24179;&#22343;&#23485;&#24230;&#21644;&#35206;&#30422;&#20445;&#35777;&#65292;&#31216;&#20026;&#36890;&#29992;&#21487;&#35757;&#32451;&#30340;&#26368;&#20248;&#39044;&#27979;&#21306;&#38388;&#32858;&#21512;&#65288;UTOPIA&#65289;&#12290;&#35813;&#26041;&#27861;&#36824;&#20801;&#35768;&#25105;&#20204;&#26681;&#25454;&#22522;&#26412;&#30340;&#22522;&#20989;&#25968;&#30452;&#25509;&#26500;&#24314;&#39044;&#27979;&#24102;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;&#32447;&#24615;&#25110;&#20984;&#35268;&#21010;&#65292;&#26131;&#20110;&#23454;&#29616;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#25152;&#26377;&#26041;&#27861;&#37117;&#24471;&#21040;&#20102;&#23454;&#39564;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Uncertainty quantification for prediction is an intriguing problem with significant applications in various fields, such as biomedical science, economic studies, and weather forecasts. Numerous methods are available for constructing prediction intervals, such as quantile regression and conformal predictions, among others. Nevertheless, model misspecification (especially in high-dimension) or sub-optimal constructions can frequently result in biased or unnecessarily-wide prediction intervals. In this paper, we propose a novel and widely applicable technique for aggregating multiple prediction intervals to minimize the average width of the prediction band along with coverage guarantee, called Universally Trainable Optimal Predictive Intervals Aggregation (UTOPIA). The method also allows us to directly construct predictive bands based on elementary basis functions. Our approach is based on linear or convex programming which is easy to implement. All of our proposed methodologies are suppo
&lt;/p&gt;</description></item></channel></rss>