<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#20559;&#24046;&#30028;&#38480;&#65292;&#29992;&#20110;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#32447;&#24615;&#32479;&#35745;&#65292;&#25105;&#20204;&#20851;&#27880;&#30028;&#38480;&#19982;&#28151;&#21512;&#26102;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#24182;&#37319;&#29992;&#27850;&#26494;&#20998;&#35299;&#30340;&#35777;&#26126;&#25216;&#26415;&#12290;</title><link>http://arxiv.org/abs/2303.05838</link><description>&lt;p&gt;
&#32447;&#24615;&#32479;&#35745;&#30340;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#32599;&#26862;&#22612;&#23572;&#19981;&#31561;&#24335;
&lt;/p&gt;
&lt;p&gt;
Rosenthal-type inequalities for linear statistics of Markov chains. (arXiv:2303.05838v2 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.05838
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#20559;&#24046;&#30028;&#38480;&#65292;&#29992;&#20110;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#32447;&#24615;&#32479;&#35745;&#65292;&#25105;&#20204;&#20851;&#27880;&#30028;&#38480;&#19982;&#28151;&#21512;&#26102;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#24182;&#37319;&#29992;&#27850;&#26494;&#20998;&#35299;&#30340;&#35777;&#26126;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#20559;&#24046;&#30028;&#38480;&#65292;&#29992;&#20110;&#20960;&#20309;&#36941;&#21382;&#30340;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#21487;&#21152;&#20989;&#25968;&#65292;&#31867;&#20284;&#20110;&#29420;&#31435;&#38543;&#26426;&#21464;&#37327;&#30340;&#32599;&#26862;&#22612;&#23572;&#21644;&#20271;&#24681;&#26031;&#22374;&#19981;&#31561;&#24335;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#30028;&#38480;&#19982;&#30456;&#24212;&#38142;&#30340;&#28151;&#21512;&#26102;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#26356;&#20934;&#30830;&#22320;&#35828;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19982;&#32599;&#26862;&#22612;&#23572;&#19981;&#31561;&#24335;&#30340;&#38797;&#28857;&#29256;&#26412;&#20013;&#30340;&#24120;&#37327;&#20197;&#21450;&#34920;&#24449;&#24213;&#23618;&#39532;&#23572;&#21487;&#22827;&#26680;&#28151;&#21512;&#29305;&#24615;&#30340;&#24120;&#37327;&#30456;&#20851;&#30340;&#26126;&#30830;&#30028;&#38480;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30340;&#35777;&#26126;&#25216;&#26415;&#26159;&#26032;&#39062;&#30340;&#65292;&#24182;&#19988;&#22522;&#20110;&#27850;&#26494;&#20998;&#35299;&#30340;&#21453;&#22797;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we establish novel deviation bounds for additive functionals of geometrically ergodic Markov chains similar to Rosenthal and Bernstein inequalities for sums of independent random variables. We pay special attention to the dependence of our bounds on the mixing time of the corresponding chain. More precisely, we establish explicit bounds that are linked to the constants from the martingale version of the Rosenthal inequality, as well as the constants that characterize the mixing properties of the underlying Markov kernel. Finally, our proof technique is, up to our knowledge, new and based on a recurrent application of the Poisson decomposition.
&lt;/p&gt;</description></item></channel></rss>