<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#30740;&#31350;&#23637;&#31034;&#20102;&#22522;&#20110;&#20998;&#25968;&#30340;&#25193;&#25955;&#27169;&#22411;&#30340;&#37319;&#26679;&#20855;&#26377;&#26497;&#23567;&#22343;&#26041;&#35823;&#24046;&#65292;&#21487;&#20197;&#33719;&#24471;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#26679;&#26412;&#30340;&#24635;&#21464;&#24046;&#35823;&#24046;&#30340;&#19978;&#30028;&#65292;&#36825;&#31361;&#30772;&#20102;&#20165;&#20570;&#27425;&#39640;&#26031;&#20551;&#35774;&#30340;&#38480;&#21046;&#12290;</title><link>https://arxiv.org/abs/2402.15602</link><description>&lt;p&gt;
&#22522;&#20110;&#20998;&#25968;&#30340;&#25193;&#25955;&#27169;&#22411;&#30340;&#26497;&#23567;&#21270;&#26368;&#20248;&#24615;&#65306;&#36229;&#36234;&#23494;&#24230;&#19979;&#30028;&#20551;&#35774;
&lt;/p&gt;
&lt;p&gt;
Minimax Optimality of Score-based Diffusion Models: Beyond the Density Lower Bound Assumptions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15602
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23637;&#31034;&#20102;&#22522;&#20110;&#20998;&#25968;&#30340;&#25193;&#25955;&#27169;&#22411;&#30340;&#37319;&#26679;&#20855;&#26377;&#26497;&#23567;&#22343;&#26041;&#35823;&#24046;&#65292;&#21487;&#20197;&#33719;&#24471;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#26679;&#26412;&#30340;&#24635;&#21464;&#24046;&#35823;&#24046;&#30340;&#19978;&#30028;&#65292;&#36825;&#31361;&#30772;&#20102;&#20165;&#20570;&#27425;&#39640;&#26031;&#20551;&#35774;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20174;&#38750;&#21442;&#25968;&#32479;&#35745;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#22312;&#22823;&#26679;&#26412;&#22330;&#26223;&#19979;&#24471;&#20998;&#25193;&#25955;&#27169;&#22411;&#25277;&#26679;&#30340;&#28176;&#36817;&#35823;&#24046;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22522;&#20110;&#26680;&#30340;&#24471;&#20998;&#20272;&#35745;&#22120;&#21487;&#20197;&#23454;&#29616;&#23545; $p_0*\mathcal{N}(0,t\boldsymbol{I}_d)$ &#30340;&#24471;&#20998;&#20989;&#25968;&#30340;&#26368;&#20248;&#22343;&#26041;&#35823;&#24046;&#20026; $\widetilde{O}\left(n^{-1} t^{-\frac{d+2}{2}}(t^{\frac{d}{2}} \vee 1)\right)$&#65292;&#20854;&#20013; $n$ &#21644; $d$ &#20998;&#21035;&#20195;&#34920;&#26679;&#26412;&#22823;&#23567;&#21644;&#32500;&#24230;&#65292;$t$ &#22312;&#19978;&#19979;&#21463;&#21040; $n$ &#30340;&#22810;&#39033;&#24335;&#30340;&#38480;&#21046;&#65292;&#24182;&#19988; $p_0$ &#26159;&#20219;&#24847;&#27425;&#20122;&#39640;&#26031;&#20998;&#24067;&#12290;&#22240;&#27492;&#65292;&#36825;&#23548;&#33268;&#22312;&#20165;&#36827;&#34892;&#27425;&#39640;&#26031;&#20551;&#35774;&#26102;&#65292;&#25193;&#25955;&#27169;&#22411;&#29983;&#25104;&#30340;&#26679;&#26412;&#20998;&#24067;&#30340;&#24635;&#21464;&#24046;&#35823;&#24046;&#30340;&#19978;&#30028;&#20026; $\widetilde{O}\left(n^{-1/2} t^{-\frac{d}{4}}\right)$&#12290;&#22914;&#26524;&#27492;&#22806;&#65292;$p_0$ &#23646;&#20110; $\beta\le 2$ &#30340; $\beta$-Sobolev&#31354;&#38388;&#30340;&#38750;&#21442;&#25968;&#26063;&#65292;&#36890;&#36807;&#37319;&#29992;&#26089;&#20572;&#31574;&#30053;&#65292;&#25105;&#20204;&#24471;&#21040;&#35813;&#25193;&#25955;&#27169;&#22411;&#30340;&#26679;&#26412;&#30340;&#20998;&#24067;&#30340;&#24635;&#21464;&#24046;&#35823;&#24046;&#30340;&#19978;&#30028;&#20026; $\widetilde{O}\left(n^{-1/2} t^{-\frac{d}{4}}\right)$&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15602v1 Announce Type: cross  Abstract: We study the asymptotic error of score-based diffusion model sampling in large-sample scenarios from a non-parametric statistics perspective. We show that a kernel-based score estimator achieves an optimal mean square error of $\widetilde{O}\left(n^{-1} t^{-\frac{d+2}{2}}(t^{\frac{d}{2}} \vee 1)\right)$ for the score function of $p_0*\mathcal{N}(0,t\boldsymbol{I}_d)$, where $n$ and $d$ represent the sample size and the dimension, $t$ is bounded above and below by polynomials of $n$, and $p_0$ is an arbitrary sub-Gaussian distribution. As a consequence, this yields an $\widetilde{O}\left(n^{-1/2} t^{-\frac{d}{4}}\right)$ upper bound for the total variation error of the distribution of the sample generated by the diffusion model under a mere sub-Gaussian assumption. If in addition, $p_0$ belongs to the nonparametric family of the $\beta$-Sobolev space with $\beta\le 2$, by adopting an early stopping strategy, we obtain that the diffusion
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27979;&#35797;&#20102;&#32463;&#27982;&#35843;&#26597;&#20013;&#29992;&#20110;&#39044;&#27979;&#30340;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30340;&#21512;&#29702;&#24615;&#65292;&#21457;&#29616;&#23545;&#31216;&#20998;&#24067;&#24773;&#20917;&#19979;&#30340;&#35782;&#21035;&#38382;&#39064;&#24182;&#25552;&#20986;&#20102;&#26032;&#22411;&#21512;&#29702;&#24615;&#26816;&#39564;&#12290;&#22312;&#24212;&#29992;&#21040;&#32445;&#32422;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#30340;&#35843;&#26597;&#20013;&#65292;&#21457;&#29616;&#25910;&#20837;&#39044;&#27979;&#21487;&#20197;&#20316;&#20026;&#20247;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#20294;&#19981;&#21487;&#20316;&#20026;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#19988;&#22312;&#19981;&#21516;&#26679;&#26412;&#20998;&#23618;&#19979;&#23384;&#22312;&#24322;&#36136;&#24615;&#12290;</title><link>http://arxiv.org/abs/1910.12545</link><description>&lt;p&gt;
&#23545;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30340;&#39044;&#27979;&#21512;&#29702;&#24615;&#36827;&#34892;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Testing Forecast Rationality for Measures of Central Tendency. (arXiv:1910.12545v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1910.12545
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27979;&#35797;&#20102;&#32463;&#27982;&#35843;&#26597;&#20013;&#29992;&#20110;&#39044;&#27979;&#30340;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30340;&#21512;&#29702;&#24615;&#65292;&#21457;&#29616;&#23545;&#31216;&#20998;&#24067;&#24773;&#20917;&#19979;&#30340;&#35782;&#21035;&#38382;&#39064;&#24182;&#25552;&#20986;&#20102;&#26032;&#22411;&#21512;&#29702;&#24615;&#26816;&#39564;&#12290;&#22312;&#24212;&#29992;&#21040;&#32445;&#32422;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#30340;&#35843;&#26597;&#20013;&#65292;&#21457;&#29616;&#25910;&#20837;&#39044;&#27979;&#21487;&#20197;&#20316;&#20026;&#20247;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#20294;&#19981;&#21487;&#20316;&#20026;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#19988;&#22312;&#19981;&#21516;&#26679;&#26412;&#20998;&#23618;&#19979;&#23384;&#22312;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#35843;&#26597;&#30340;&#21512;&#29702;&#21463;&#35775;&#32773;&#21487;&#33021;&#20250;&#25253;&#21578;&#20219;&#20309;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#65288;&#20363;&#22914;&#22343;&#20540;&#12289;&#20013;&#20301;&#25968;&#12289;&#20247;&#25968;&#25110;&#20219;&#20309;&#20984;&#32452;&#21512;&#65289;&#20316;&#20026;&#28857;&#39044;&#27979;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#21463;&#35775;&#32773;&#20351;&#29992;&#30340;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#26410;&#30693;&#26102;&#30340;&#39044;&#27979;&#21512;&#29702;&#24615;&#27979;&#35797;&#26041;&#27861;&#12290;&#25105;&#20204;&#20811;&#26381;&#20102;&#24403;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30456;&#31561;&#25110;&#20301;&#20110;&#24444;&#27492;&#30340;&#23616;&#37096;&#37051;&#22495;&#20869;&#26102;&#65288;&#23545;&#20110;&#65288;&#20960;&#20046;&#65289;&#23545;&#31216;&#30340;&#20998;&#24067;&#24773;&#20917;&#65289;&#65292;&#20986;&#29616;&#30340;&#35782;&#21035;&#38382;&#39064;&#12290;&#20316;&#20026;&#26500;&#24314;&#22359;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#23545;&#20247;&#25968;&#39044;&#27979;&#30340;&#26032;&#22411;&#21512;&#29702;&#24615;&#26816;&#39564;&#12290;&#25105;&#20204;&#23558;&#27979;&#35797;&#24212;&#29992;&#20110;&#32445;&#32422;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#30340;&#28040;&#36153;&#32773;&#39044;&#26399;&#35843;&#26597;&#20013;&#30340;&#25910;&#20837;&#39044;&#27979;&#12290;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;&#39044;&#27979;&#21487;&#20197;&#20316;&#20026;&#20247;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#20294;&#19981;&#21487;&#20197;&#20316;&#20026;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#22312;&#26679;&#26412;&#20998;&#23618;&#20013;&#65292;&#21463;&#35775;&#32773;&#20351;&#29992;&#30340;&#20013;&#24515;&#24230;&#37327;&#23384;&#22312;&#25910;&#20837;&#12289;&#24180;&#40836;&#12289;&#24037;&#20316;&#31283;&#23450;&#24615;&#21644;&#36807;&#21435;&#23601;&#19994;&#29366;&#24577;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Rational respondents to economic surveys may report as a point forecast any measure of the central tendency of their (possibly latent) predictive distribution, for example the mean, median, mode, or any convex combination thereof. We propose tests of forecast rationality when the measure of central tendency used by the respondent is unknown. We overcome an identification problem that arises when the measures of central tendency are equal or in a local neighborhood of each other, as is the case for (exactly or nearly) symmetric distributions. As a building block, we also present novel tests for the rationality of mode forecasts. We apply our tests to income forecasts from the Federal Reserve Bank of New York's Survey of Consumer Expectations. We find these forecasts are rationalizable as mode forecasts, but not as mean or median forecasts. We also find heterogeneity in the measure of centrality used by respondents when stratifying the sample by past income, age, job stability, and past 
&lt;/p&gt;</description></item></channel></rss>