<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#25552;&#20986;&#39640;&#21442;&#25968;PAC&#23398;&#20064;&#29702;&#35770;&#65292;&#21033;&#29992;&#32467;&#26500;&#21270;&#30456;&#20851;&#24615;&#21644;&#20132;&#25442;&#20998;&#24067;&#21462;&#20195;i.i.d.&#25277;&#26679;&#65292;&#35777;&#26126;&#20102;&#32479;&#35745;&#23398;&#20064;&#22522;&#26412;&#23450;&#29702;&#30340;&#39640;&#32500;&#29256;&#26412;&#12290;</title><link>https://arxiv.org/abs/2402.14294</link><description>&lt;p&gt;
&#36890;&#36807;&#21487;&#20114;&#25442;&#24615;&#23454;&#29616;&#39640;&#21442;&#25968;PAC&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
High-arity PAC learning via exchangeability
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14294
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#39640;&#21442;&#25968;PAC&#23398;&#20064;&#29702;&#35770;&#65292;&#21033;&#29992;&#32467;&#26500;&#21270;&#30456;&#20851;&#24615;&#21644;&#20132;&#25442;&#20998;&#24067;&#21462;&#20195;i.i.d.&#25277;&#26679;&#65292;&#35777;&#26126;&#20102;&#32479;&#35745;&#23398;&#20064;&#22522;&#26412;&#23450;&#29702;&#30340;&#39640;&#32500;&#29256;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#39640;&#32500;PAC&#23398;&#20064;&#29702;&#35770;&#65292;&#21363;&#22312;&#8220;&#32467;&#26500;&#21270;&#30456;&#20851;&#24615;&#8221;&#23384;&#22312;&#30340;&#32479;&#35745;&#23398;&#20064;&#20013;&#12290; &#22312;&#36825;&#20010;&#29702;&#35770;&#20013;&#65292;&#20551;&#35774;&#21487;&#20197;&#26159;&#22270;&#24418;&#12289;&#36229;&#22270;&#65292;&#25110;&#32773;&#26356;&#19968;&#33324;&#22320;&#35828;&#65292;&#26159;&#26377;&#38480;&#20851;&#31995;&#35821;&#35328;&#20013;&#30340;&#32467;&#26500;&#65292;&#24182;&#19988;i.i.d.&#25277;&#26679;&#34987;&#25277;&#26679;&#20135;&#29983;&#21487;&#20114;&#25442;&#20998;&#24067;&#30340;&#35825;&#23548;&#23376;&#32467;&#26500;&#21462;&#20195;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#32479;&#35745;&#23398;&#20064;&#22522;&#26412;&#23450;&#29702;&#30340;&#39640;&#32500;&#29256;&#26412;&#65292;&#36890;&#36807;&#34920;&#24449;&#39640;&#32500;&#65288;agnostic&#65289;PAC&#21487;&#23398;&#24615;&#65292;&#20197;&#32431;&#32452;&#21512;&#32500;&#24230;&#30340;&#26377;&#38480;&#24615;&#21450;&#36866;&#24403;&#29256;&#26412;&#30340;&#22343;&#21248;&#25910;&#25947;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14294v1 Announce Type: new  Abstract: We develop a theory of high-arity PAC learning, which is statistical learning in the presence of "structured correlation". In this theory, hypotheses are either graphs, hypergraphs or, more generally, structures in finite relational languages, and i.i.d. sampling is replaced by sampling an induced substructure, producing an exchangeable distribution. We prove a high-arity version of the fundamental theorem of statistical learning by characterizing high-arity (agnostic) PAC learnability in terms of finiteness of a purely combinatorial dimension and in terms of an appropriate version of uniform convergence.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20005;&#26684;&#20998;&#26512;&#20102;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;PDEs&#30340;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;PICNN&#65289;&#65292;&#36890;&#36807;&#20351;&#29992;&#26368;&#26032;&#30340;&#36924;&#36817;&#32467;&#26524;&#21644;&#29699;&#35856;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#36924;&#36817;&#35823;&#24046;&#19982;Sobolev&#33539;&#25968;&#30340;&#19978;&#30028;&#65292;&#24182;&#24314;&#31435;&#20102;&#24555;&#36895;&#25910;&#25947;&#36895;&#29575;&#12290;&#23454;&#39564;&#32467;&#26524;&#20063;&#39564;&#35777;&#20102;&#29702;&#35770;&#20998;&#26512;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.09605</link><description>&lt;p&gt;
&#20351;&#29992;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;&#20559;&#24494;&#20998;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Solving PDEs on Spheres with Physics-Informed Convolutional Neural Networks. (arXiv:2308.09605v1 [math.NA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09605
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20005;&#26684;&#20998;&#26512;&#20102;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;PDEs&#30340;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;PICNN&#65289;&#65292;&#36890;&#36807;&#20351;&#29992;&#26368;&#26032;&#30340;&#36924;&#36817;&#32467;&#26524;&#21644;&#29699;&#35856;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#36924;&#36817;&#35823;&#24046;&#19982;Sobolev&#33539;&#25968;&#30340;&#19978;&#30028;&#65292;&#24182;&#24314;&#31435;&#20102;&#24555;&#36895;&#25910;&#25947;&#36895;&#29575;&#12290;&#23454;&#39564;&#32467;&#26524;&#20063;&#39564;&#35777;&#20102;&#29702;&#35770;&#20998;&#26512;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#24050;&#34987;&#35777;&#26126;&#22312;&#35299;&#20915;&#21508;&#31181;&#23454;&#39564;&#35282;&#24230;&#20013;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#65288;PDEs&#65289;&#26041;&#38754;&#38750;&#24120;&#39640;&#25928;&#12290;&#19968;&#20123;&#26368;&#36817;&#30340;&#30740;&#31350;&#36824;&#25552;&#20986;&#20102;&#38024;&#23545;&#34920;&#38754;&#65292;&#21253;&#25324;&#29699;&#38754;&#19978;&#30340;PDEs&#30340;PINN&#31639;&#27861;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;PINNs&#30340;&#25968;&#20540;&#24615;&#33021;&#65292;&#23588;&#20854;&#26159;&#22312;&#34920;&#38754;&#25110;&#27969;&#24418;&#19978;&#30340;PINNs&#65292;&#20173;&#28982;&#32570;&#20047;&#29702;&#35770;&#29702;&#35299;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23545;&#29992;&#20110;&#22312;&#29699;&#38754;&#19978;&#35299;&#20915;PDEs&#30340;&#29289;&#29702;&#20449;&#24687;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;PICNN&#65289;&#36827;&#34892;&#20102;&#20005;&#26684;&#20998;&#26512;&#12290;&#36890;&#36807;&#20351;&#29992;&#21644;&#25913;&#36827;&#28145;&#24230;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#21644;&#29699;&#35856;&#20998;&#26512;&#30340;&#26368;&#26032;&#36924;&#36817;&#32467;&#26524;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#36924;&#36817;&#35823;&#24046;&#19982;Sobolev&#33539;&#25968;&#30340;&#19978;&#30028;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#23558;&#36825;&#19968;&#32467;&#26524;&#19982;&#21019;&#26032;&#30340;&#23616;&#37096;&#22797;&#26434;&#24230;&#20998;&#26512;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#20102;PICNN&#30340;&#24555;&#36895;&#25910;&#25947;&#36895;&#29575;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#20063;&#24471;&#21040;&#20102;&#23454;&#39564;&#30340;&#39564;&#35777;&#21644;&#34917;&#20805;&#12290;&#37492;&#20110;&#36825;&#20123;&#21457;&#29616;&#65292;
&lt;/p&gt;
&lt;p&gt;
Physics-informed neural networks (PINNs) have been demonstrated to be efficient in solving partial differential equations (PDEs) from a variety of experimental perspectives. Some recent studies have also proposed PINN algorithms for PDEs on surfaces, including spheres. However, theoretical understanding of the numerical performance of PINNs, especially PINNs on surfaces or manifolds, is still lacking. In this paper, we establish rigorous analysis of the physics-informed convolutional neural network (PICNN) for solving PDEs on the sphere. By using and improving the latest approximation results of deep convolutional neural networks and spherical harmonic analysis, we prove an upper bound for the approximation error with respect to the Sobolev norm. Subsequently, we integrate this with innovative localization complexity analysis to establish fast convergence rates for PICNN. Our theoretical results are also confirmed and supplemented by our experiments. In light of these findings, we expl
&lt;/p&gt;</description></item></channel></rss>