<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#28385;&#36275;&#20984;&#24207;&#26368;&#23567;&#35201;&#27714;&#30340;&#38543;&#26426;&#21521;&#37327;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#21457;&#29616;&#20102;&#23427;&#20204;&#30340;&#24378;&#36127;&#30456;&#20851;&#24615;&#65307;&#24182;&#22312;&#30740;&#31350;&#20013;&#21457;&#29616;&#20102;&#19968;&#31867;&#26368;&#23567;&#30456;&#20851;&#24615;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#12290;</title><link>http://arxiv.org/abs/2309.17346</link><description>&lt;p&gt;
&#23545;&#31216;&#20271;&#21162;&#21033;&#20998;&#24067;&#21644;&#26368;&#23567;&#30456;&#20851;&#24615;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Symmetric Bernoulli distributions and minimal dependence copulas. (arXiv:2309.17346v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.17346
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#28385;&#36275;&#20984;&#24207;&#26368;&#23567;&#35201;&#27714;&#30340;&#38543;&#26426;&#21521;&#37327;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#21457;&#29616;&#20102;&#23427;&#20204;&#30340;&#24378;&#36127;&#30456;&#20851;&#24615;&#65307;&#24182;&#22312;&#30740;&#31350;&#20013;&#21457;&#29616;&#20102;&#19968;&#31867;&#26368;&#23567;&#30456;&#20851;&#24615;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#25214;&#21040;&#28385;&#36275;&#20984;&#24207;&#26368;&#23567;&#35201;&#27714;&#30340;&#38543;&#26426;&#21521;&#37327;&#30340;&#25152;&#26377;&#32852;&#21512;&#20998;&#24067;&#12290;&#36825;&#20123;&#26368;&#23567;&#20984;&#24207;&#21644;&#20998;&#24067;&#24050;&#30693;&#20855;&#26377;&#24378;&#36127;&#30456;&#20851;&#24615;&#12290;&#38500;&#20102;&#20854;&#26412;&#36523;&#30340;&#20852;&#36259;&#65292;&#36825;&#20123;&#32467;&#26524;&#36824;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#30340;&#31867;&#21035;&#20013;&#30740;&#31350;&#36127;&#30456;&#20851;&#24615;&#12290;&#23454;&#38469;&#19978;&#65292;&#21487;&#20197;&#20174;&#22810;&#20803;&#23545;&#31216;&#20271;&#21162;&#21033;&#20998;&#24067;&#26500;&#24314;&#20004;&#31867;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#65306;&#26497;&#20540;&#28151;&#21512;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#21644;FGM&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19982;&#26368;&#23567;&#20984;&#21644;&#20271;&#21162;&#21033;&#21521;&#37327;&#23545;&#24212;&#30340;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#30340;&#26497;&#20540;&#36127;&#30456;&#20851;&#24615;&#32467;&#26500;&#65292;&#24182;&#26126;&#30830;&#25214;&#21040;&#20102;&#19968;&#31867;&#26368;&#23567;&#30456;&#20851;&#24615;&#32852;&#21512;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#12290;&#36825;&#20123;&#20027;&#35201;&#32467;&#26524;&#26469;&#33258;&#20110;&#22810;&#20803;&#23545;&#31216;&#20271;&#21162;&#21033;&#20998;&#24067;&#30340;&#20960;&#20309;&#21644;&#20195;&#25968;&#34920;&#31034;&#65292;&#23427;&#20204;&#26377;&#25928;&#22320;&#32534;&#30721;&#20102;&#23427;&#20204;&#30340;&#22810;&#20010;&#32479;&#35745;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The key result of this paper is to find all the joint distributions of random vectors whose sums $S=X_1+\ldots+X_d$ are minimal in convex order in the class of symmetric Bernoulli distributions. The minimal convex sums distributions are known to be strongly negatively dependent. Beyond their interest per se, these results enable us to explore negative dependence within the class of copulas. In fact, there are two classes of copulas that can be built from multivariate symmetric Bernoulli distributions: the extremal mixture copulas, and the FGM copulas. We study the extremal negative dependence structure of the copulas corresponding to symmetric Bernoulli vectors with minimal convex sums and we explicitly find a class of minimal dependence copulas. Our main results stem from the geometric and algebraic representations of multivariate symmetric Bernoulli distributions, which effectively encode several of their statistical properties.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#25193;&#23637;&#30340;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#65292;&#24182;&#21457;&#29616;&#20316;&#32773;&#30340;&#21516;&#34892;&#35780;&#20998;&#21487;&#20197;&#36739;&#20934;&#30830;&#22320;&#22312;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#20998;&#24067;&#24773;&#20917;&#19979;&#36827;&#34892;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2304.11160</link><description>&lt;p&gt;
&#21033;&#29992;&#20445;&#24207;&#26426;&#21046;&#25552;&#39640;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#20250;&#35758;&#30340;&#21516;&#34892;&#35780;&#23457;
&lt;/p&gt;
&lt;p&gt;
The Isotonic Mechanism for Exponential Family Estimation. (arXiv:2304.11160v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11160
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#25193;&#23637;&#30340;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#65292;&#24182;&#21457;&#29616;&#20316;&#32773;&#30340;&#21516;&#34892;&#35780;&#20998;&#21487;&#20197;&#36739;&#20934;&#30830;&#22320;&#22312;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#20998;&#24067;&#24773;&#20917;&#19979;&#36827;&#34892;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#33268;&#21147;&#20110;&#25193;&#23637;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#12290;&#35813;&#26426;&#21046;&#21487;&#29983;&#25104;&#19982;&#21407;&#22987;&#35780;&#20998;&#25509;&#36817;&#30340;&#35843;&#25972;&#20998;&#25968;&#65292;&#24182;&#31526;&#21512;&#20316;&#32773;&#25351;&#23450;&#30340;&#25490;&#21517;&#35201;&#27714;&#65292;&#24471;&#21040;&#24191;&#27867;&#30340;&#25351;&#25968;&#26063;&#20998;&#24067;&#24212;&#29992;&#65292;&#32780;&#19988;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#30340;&#20998;&#24067;&#24418;&#24335;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#19968;&#23450;&#30340;&#25351;&#25968;&#26063;&#20998;&#24067;&#19979;&#65292;&#22914;&#26524;&#20316;&#32773;&#30340;&#25928;&#29992;&#20989;&#25968;&#37319;&#29992;&#31616;&#21333;&#30340;&#20984;&#21487;&#21152;&#20989;&#25968;&#65292;&#21017;&#28608;&#21169;&#20316;&#32773;&#25552;&#20379;&#20934;&#30830;&#30340;&#25490;&#21517;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
In 2023, the International Conference on Machine Learning (ICML) required authors with multiple submissions to rank their submissions based on perceived quality. In this paper, we aim to employ these author-specified rankings to enhance peer review in machine learning and artificial intelligence conferences by extending the Isotonic Mechanism (Su, 2021, 2022) to exponential family distributions. This mechanism generates adjusted scores closely align with the original scores while adhering to author-specified rankings. Despite its applicability to a broad spectrum of exponential family distributions, this mechanism's implementation does not necessitate knowledge of the specific distribution form. We demonstrate that an author is incentivized to provide accurate rankings when her utility takes the form of a convex additive function of the adjusted review scores. For a certain subclass of exponential family distributions, we prove that the author reports truthfully only if the question in
&lt;/p&gt;</description></item></channel></rss>