<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#31163;&#25955;&#38750;&#21442;&#25968;&#38544;&#24615;&#31867;&#21035;&#28151;&#28102;&#19979;&#30340;&#22240;&#26524;&#21457;&#29616;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#26377;&#38480;&#30340;&#28508;&#22312;&#31867;&#21035;&#19979;&#65292;&#22240;&#26524;&#21457;&#29616;&#20173;&#28982;&#26159;&#21487;&#35782;&#21035;&#30340;&#12290;</title><link>https://arxiv.org/abs/2311.07454</link><description>&lt;p&gt;
&#31163;&#25955;&#38750;&#21442;&#25968;&#38544;&#24615;&#31867;&#21035;&#28151;&#28102;&#19979;&#30340;&#22240;&#26524;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Discrete Nonparametric Causal Discovery Under Latent Class Confounding
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.07454
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#31163;&#25955;&#38750;&#21442;&#25968;&#38544;&#24615;&#31867;&#21035;&#28151;&#28102;&#19979;&#30340;&#22240;&#26524;&#21457;&#29616;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#26377;&#38480;&#30340;&#28508;&#22312;&#31867;&#21035;&#19979;&#65292;&#22240;&#26524;&#21457;&#29616;&#20173;&#28982;&#26159;&#21487;&#35782;&#21035;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#21521;&#26080;&#29615;&#22270;&#29992;&#20110;&#24314;&#27169;&#31995;&#32479;&#30340;&#22240;&#26524;&#32467;&#26500;&#12290;"&#22240;&#26524;&#21457;&#29616;"&#25551;&#36848;&#20102;&#20174;&#25968;&#25454;&#20013;&#23398;&#20064;&#36825;&#31181;&#32467;&#26500;&#30340;&#38382;&#39064;&#12290;&#24403;&#25968;&#25454;&#26159;&#26469;&#33258;&#22810;&#20010;&#28304;&#65288;&#32676;&#20307;&#25110;&#29615;&#22659;&#65289;&#30340;&#32858;&#21512;&#29289;&#26102;&#65292;&#20840;&#23616;&#28151;&#28102;&#20351;&#39537;&#21160;&#35768;&#22810;&#22240;&#26524;&#21457;&#29616;&#31639;&#27861;&#30340;&#26465;&#20214;&#29420;&#31435;&#24615;&#29305;&#24615;&#21464;&#24471;&#27169;&#31946;&#12290;&#36825;&#31181;&#24773;&#20917;&#26377;&#26102;&#34987;&#31216;&#20026;&#28151;&#21512;&#27169;&#22411;&#25110;&#28508;&#22312;&#31867;&#21035;&#12290;&#34429;&#28982;&#19968;&#20123;&#29616;&#20195;&#22240;&#26524;&#21457;&#29616;&#26041;&#27861;&#33021;&#22815;&#22312;&#29305;&#23450;&#24773;&#20917;&#19979;&#22788;&#29702;&#26410;&#35266;&#23519;&#21040;&#30340;&#28151;&#28102;&#65292;&#20294;&#26159;&#30446;&#21069;&#25152;&#30693;&#30340;&#22788;&#29702;&#20840;&#23616;&#28151;&#28102;&#30340;&#26041;&#27861;&#37117;&#28041;&#21450;&#19981;&#36866;&#29992;&#20110;&#31163;&#25955;&#20998;&#24067;&#30340;&#21442;&#25968;&#20551;&#35774;&#12290;&#20197;&#31163;&#25955;&#21644;&#38750;&#21442;&#25968;&#35266;&#23519;&#21464;&#37327;&#20026;&#37325;&#28857;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#26377;&#38480;&#30340;&#28508;&#22312;&#31867;&#21035;&#19979;&#65292;&#22240;&#26524;&#21457;&#29616;&#20173;&#28982;&#26159;&#21487;&#35782;&#21035;&#30340;&#12290;&#36825;&#20010;&#38382;&#39064;&#30340;&#21487;&#34892;&#24615;&#30001;&#20840;&#23616;&#28151;&#28102;&#30340;&#22522;&#25968;&#12289;&#35266;&#23519;&#21464;&#37327;&#30340;&#22522;&#25968;&#31561;&#20915;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.07454v2 Announce Type: replace Abstract: Directed acyclic graphs are used to model the causal structure of a system. ``Causal discovery'' describes the problem of learning this structure from data. When data is an aggregate from multiple sources (populations or environments), global confounding obscures conditional independence properties that drive many causal discovery algorithms. This setting is sometimes known as a mixture model or a latent class. While some modern methods for causal discovery are able to work around unobserved confounding in specific cases, the only known ways to deal with a global confounder involve parametric assumptions. that are unsuitable for discrete distributions.Focusing on discrete and non-parametric observed variables, we demonstrate that causal discovery can still be identifiable under bounded latent classes. The feasibility of this problem is governed by a trade-off between the cardinality of the global confounder, the cardinalities of the o
&lt;/p&gt;</description></item></channel></rss>