<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#21487;&#33021;&#26159;&#38750;&#27491;&#35268;&#30340;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#65292;&#23637;&#31034;&#20102;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#22312;&#23616;&#37096;&#27491;&#21017;&#24773;&#20917;&#19979;&#30340;&#24615;&#36136;&#65292;&#24182;&#25512;&#24191;&#20102;&#32463;&#20856;&#21151;&#29575;&#36793;&#30028;&#21040;&#36825;&#31181;&#24773;&#20917;&#19979;&#12290;</title><link>https://arxiv.org/abs/2403.05999</link><description>&lt;p&gt;
&#38750;&#27491;&#21017;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#23616;&#37096;&#27491;&#21017;&#21644;&#39640;&#25928;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Locally Regular and Efficient Tests in Non-Regular Semiparametric Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05999
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#21487;&#33021;&#26159;&#38750;&#27491;&#35268;&#30340;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#65292;&#23637;&#31034;&#20102;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#22312;&#23616;&#37096;&#27491;&#21017;&#24773;&#20917;&#19979;&#30340;&#24615;&#36136;&#65292;&#24182;&#25512;&#24191;&#20102;&#32463;&#20856;&#21151;&#29575;&#36793;&#30028;&#21040;&#36825;&#31181;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#65292;&#35813;&#27169;&#22411;&#21487;&#33021;&#26159;&#38750;&#27491;&#21017;&#30340;&#12290;&#22312;&#28201;&#21644;&#30340;&#26465;&#20214;&#19979;&#65292;&#25105;&#34920;&#26126;&#20102;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#22312;&#23616;&#37096;&#27491;&#21017;&#24773;&#20917;&#19979;&#65292;&#21253;&#25324;&#37027;&#20123;&#23616;&#37096;&#27491;&#21017;&#20272;&#35745;&#22120;&#19981;&#23384;&#22312;&#30340;&#24773;&#20917;&#65292;&#22914;&#65288;&#21322;&#21442;&#25968;&#65289;&#24369;&#35782;&#21035;&#30340;&#27169;&#22411;&#12290;&#25105;&#25551;&#36848;&#20102;&#36866;&#24403;&#30340;&#26497;&#38480;&#23454;&#39564;&#65292;&#29992;&#20110;&#30740;&#31350;&#38750;&#27491;&#35268;&#24773;&#20917;&#19979;&#26816;&#39564;&#30340;&#26412;&#22320;&#65288;&#28176;&#36817;&#65289;&#26368;&#20248;&#24615;&#65292;&#20174;&#32780;&#23558;&#32463;&#20856;&#21151;&#29575;&#36793;&#30028;&#25512;&#24191;&#21040;&#36825;&#31181;&#24773;&#20917;&#12290;&#25105;&#32473;&#20986;&#20102;&#36825;&#20123;&#21151;&#29575;&#36793;&#30028;&#34987;&#25552;&#20986;&#30340;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#36798;&#21040;&#30340;&#26465;&#20214;&#12290;&#23558;&#29702;&#35770;&#24212;&#29992;&#20110;&#21333;&#25351;&#25968;&#27169;&#22411;&#21644;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#65292;&#24182;&#36827;&#34892;&#20102;&#35814;&#32454;&#30340;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05999v1 Announce Type: new  Abstract: This paper considers hypothesis testing in semiparametric models which may be non-regular. I show that C($\alpha$) style tests are locally regular under mild conditions, including in cases where locally regular estimators do not exist, such as models which are (semi-parametrically) weakly identified. I characterise the appropriate limit experiment in which to study local (asymptotic) optimality of tests in the non-regular case, permitting the generalisation of classical power bounds to this case. I give conditions under which these power bounds are attained by the proposed C($\alpha$) style tests. The application of the theory to a single index model and an instrumental variables model is worked out in detail.
&lt;/p&gt;</description></item></channel></rss>