<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;$\ell_\infty$-&#25200;&#21160;&#19979;&#30340;&#23545;&#25239;&#24615;&#35757;&#32451;&#65292;&#35777;&#26126;&#24403;&#30495;&#23454;&#21442;&#25968;&#20026;0&#26102;&#65292;&#23545;&#25239;&#24615;&#35757;&#32451;&#20272;&#35745;&#22120;&#22312;&#35813;&#25200;&#21160;&#19979;&#30340;&#26497;&#38480;&#20998;&#24067;&#21487;&#33021;&#22312;0&#22788;&#26377;&#19968;&#20010;&#27491;&#27010;&#29575;&#36136;&#37327;&#65292;&#25552;&#20379;&#20102;&#31232;&#30095;&#24615;&#24674;&#22797;&#33021;&#21147;&#30340;&#29702;&#35770;&#20445;&#35777;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20004;&#27493;&#36807;&#31243;&#8212;&#8212;&#33258;&#36866;&#24212;&#23545;&#25239;&#24615;&#35757;&#32451;&#65292;&#21487;&#20197;&#36827;&#19968;&#27493;&#25552;&#39640;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.15262</link><description>&lt;p&gt;
&#22312;$\ell_\infty$-&#25200;&#21160;&#19979;&#23545;&#25239;&#24615;&#35757;&#32451;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Asymptotic Behavior of Adversarial Training Estimator under $\ell_\infty$-Perturbation. (arXiv:2401.15262v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15262
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;$\ell_\infty$-&#25200;&#21160;&#19979;&#30340;&#23545;&#25239;&#24615;&#35757;&#32451;&#65292;&#35777;&#26126;&#24403;&#30495;&#23454;&#21442;&#25968;&#20026;0&#26102;&#65292;&#23545;&#25239;&#24615;&#35757;&#32451;&#20272;&#35745;&#22120;&#22312;&#35813;&#25200;&#21160;&#19979;&#30340;&#26497;&#38480;&#20998;&#24067;&#21487;&#33021;&#22312;0&#22788;&#26377;&#19968;&#20010;&#27491;&#27010;&#29575;&#36136;&#37327;&#65292;&#25552;&#20379;&#20102;&#31232;&#30095;&#24615;&#24674;&#22797;&#33021;&#21147;&#30340;&#29702;&#35770;&#20445;&#35777;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20004;&#27493;&#36807;&#31243;&#8212;&#8212;&#33258;&#36866;&#24212;&#23545;&#25239;&#24615;&#35757;&#32451;&#65292;&#21487;&#20197;&#36827;&#19968;&#27493;&#25552;&#39640;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#25239;&#24615;&#35757;&#32451;&#34987;&#25552;&#20986;&#26469;&#25269;&#24481;&#26426;&#22120;&#23398;&#20064;&#21644;&#32479;&#35745;&#27169;&#22411;&#20013;&#30340;&#23545;&#25239;&#24615;&#25915;&#20987;&#12290;&#26412;&#25991;&#37325;&#28857;&#30740;&#31350;&#20102;&#22312;$\ell_\infty$-&#25200;&#21160;&#19979;&#30340;&#23545;&#25239;&#24615;&#35757;&#32451;&#65292;&#36825;&#20010;&#38382;&#39064;&#26368;&#36817;&#24341;&#36215;&#20102;&#24456;&#22810;&#30740;&#31350;&#30340;&#20851;&#27880;&#12290;&#22312;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#20013;&#30740;&#31350;&#20102;&#23545;&#25239;&#24615;&#35757;&#32451;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#34892;&#20026;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#30495;&#23454;&#21442;&#25968;&#20026;0&#26102;&#65292;&#23545;&#25239;&#24615;&#35757;&#32451;&#20272;&#35745;&#22120;&#22312;$\ell_\infty$-&#25200;&#21160;&#19979;&#30340;&#26497;&#38480;&#20998;&#24067;&#21487;&#33021;&#22312;0&#22788;&#26377;&#19968;&#20010;&#27491;&#27010;&#29575;&#36136;&#37327;&#65292;&#20026;&#30456;&#20851;&#30340;&#31232;&#30095;&#24615;&#24674;&#22797;&#33021;&#21147;&#25552;&#20379;&#20102;&#29702;&#35770;&#20445;&#35777;&#12290;&#27492;&#22806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#20004;&#27493;&#36807;&#31243;&#8212;&#8212;&#33258;&#36866;&#24212;&#23545;&#25239;&#24615;&#35757;&#32451;&#65292;&#21487;&#20197;&#36827;&#19968;&#27493;&#25552;&#39640;&#22312;$\ell_\infty$-&#25200;&#21160;&#19979;&#30340;&#23545;&#25239;&#24615;&#35757;&#32451;&#30340;&#24615;&#33021;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25152;&#25552;&#20986;&#30340;&#36807;&#31243;&#21487;&#20197;&#23454;&#29616;&#28176;&#36817;&#26080;&#20559;&#24615;&#21644;&#21464;&#37327;&#36873;&#25321;&#19968;&#33268;&#24615;&#12290;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#23637;&#31034;&#20102;&#31232;&#30095;&#24615;&#24674;&#22797;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adversarial training has been proposed to hedge against adversarial attacks in machine learning and statistical models. This paper focuses on adversarial training under $\ell_\infty$-perturbation, which has recently attracted much research attention. The asymptotic behavior of the adversarial training estimator is investigated in the generalized linear model. The results imply that the limiting distribution of the adversarial training estimator under $\ell_\infty$-perturbation could put a positive probability mass at $0$ when the true parameter is $0$, providing a theoretical guarantee of the associated sparsity-recovery ability. Alternatively, a two-step procedure is proposed -adaptive adversarial training, which could further improve the performance of adversarial training under $\ell_\infty$-perturbation. Specifically, the proposed procedure could achieve asymptotic unbiasedness and variable-selection consistency. Numerical experiments are conducted to show the sparsity-recovery a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#37096;&#20998;&#35782;&#21035;&#19979;&#30340;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22312;&#24050;&#30693;&#26041;&#24046;&#30340;&#27491;&#24577;&#35823;&#24046;&#24773;&#20917;&#19979;&#30340;&#26377;&#38480;&#26679;&#26412;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#20915;&#31574;&#35268;&#21017;&#21644;&#28176;&#36817;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#30340;&#21487;&#34892;&#20915;&#31574;&#35268;&#21017;&#65292;&#24182;&#24212;&#29992;&#20110;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#32622;&#20013;&#25919;&#31574;&#36164;&#26684;&#25130;&#26029;&#28857;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2111.04926</link><description>&lt;p&gt;
&#22312;&#37096;&#20998;&#35782;&#21035;&#19979;&#30340;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Optimal Decision Rules Under Partial Identification. (arXiv:2111.04926v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.04926
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#37096;&#20998;&#35782;&#21035;&#19979;&#30340;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22312;&#24050;&#30693;&#26041;&#24046;&#30340;&#27491;&#24577;&#35823;&#24046;&#24773;&#20917;&#19979;&#30340;&#26377;&#38480;&#26679;&#26412;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#20915;&#31574;&#35268;&#21017;&#21644;&#28176;&#36817;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#30340;&#21487;&#34892;&#20915;&#31574;&#35268;&#21017;&#65292;&#24182;&#24212;&#29992;&#20110;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#32622;&#20013;&#25919;&#31574;&#36164;&#26684;&#25130;&#26029;&#28857;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#31867;&#32479;&#35745;&#20915;&#31574;&#38382;&#39064;&#65292;&#20915;&#31574;&#32773;&#24517;&#39035;&#22312;&#26377;&#38480;&#26679;&#26412;&#30340;&#22522;&#30784;&#19978;&#65292;&#22312;&#20004;&#31181;&#22791;&#36873;&#31574;&#30053;&#20043;&#38388;&#20570;&#20986;&#20915;&#31574;&#65292;&#20197;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#12290;&#26680;&#24515;&#20551;&#35774;&#26159;&#28508;&#22312;&#30340;&#12289;&#21487;&#33021;&#26159;&#26080;&#38480;&#32500;&#21442;&#25968;&#20301;&#20110;&#24050;&#30693;&#30340;&#20984;&#38598;&#20013;&#65292;&#21487;&#33021;&#23548;&#33268;&#31119;&#21033;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#12290;&#36825;&#20123;&#38480;&#21046;&#30340;&#19968;&#20010;&#20363;&#23376;&#26159;&#21453;&#20107;&#23454;&#32467;&#26524;&#20989;&#25968;&#30340;&#24179;&#28369;&#24615;&#12290;&#20316;&#20026;&#20027;&#35201;&#29702;&#35770;&#32467;&#26524;&#65292;&#25105;&#22312;&#27491;&#24577;&#20998;&#24067;&#35823;&#24046;&#19988;&#26041;&#24046;&#24050;&#30693;&#30340;&#25152;&#26377;&#20915;&#31574;&#35268;&#21017;&#31867;&#20013;&#65292;&#25512;&#23548;&#20986;&#20102;&#19968;&#31181;&#26377;&#38480;&#26679;&#26412;&#30340;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#20915;&#31574;&#35268;&#21017;&#12290;&#24403;&#35823;&#24046;&#20998;&#24067;&#26410;&#30693;&#26102;&#65292;&#25105;&#24471;&#21040;&#20102;&#19968;&#31181;&#28176;&#36817;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#30340;&#21487;&#34892;&#20915;&#31574;&#35268;&#21017;&#12290;&#25105;&#23558;&#25105;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#32622;&#20013;&#26159;&#21542;&#25913;&#21464;&#25919;&#31574;&#36164;&#26684;&#25130;&#26029;&#28857;&#30340;&#38382;&#39064;&#65292;&#24182;&#22312;&#24067;&#22522;&#32435;&#27861;&#32034;&#30340;&#23398;&#26657;&#24314;&#35774;&#39033;&#30446;&#30340;&#23454;&#35777;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#38416;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
I consider a class of statistical decision problems in which the policy maker must decide between two alternative policies to maximize social welfare based on a finite sample. The central assumption is that the underlying, possibly infinite-dimensional parameter, lies in a known convex set, potentially leading to partial identification of the welfare effect. An example of such restrictions is the smoothness of counterfactual outcome functions. As the main theoretical result, I derive a finite-sample, exact minimax regret decision rule within the class of all decision rules under normal errors with known variance. When the error distribution is unknown, I obtain a feasible decision rule that is asymptotically minimax regret. I apply my results to the problem of whether to change a policy eligibility cutoff in a regression discontinuity setup, and illustrate them in an empirical application to a school construction program in Burkina Faso.
&lt;/p&gt;</description></item></channel></rss>