<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39640;&#32500;&#27969;&#24418;&#30340;SOFAR&#25512;&#26029;&#65288;SOFARI&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;Neyman&#36817;&#27491;&#20132;&#25512;&#26029;&#21644;SVD&#32422;&#26463;&#30340;Stiefel&#27969;&#24418;&#32467;&#26500;&#65292;&#23454;&#29616;&#20102;&#23545;&#22810;&#20219;&#21153;&#23398;&#20064;&#20013;&#28508;&#22312;&#22240;&#23376;&#30697;&#38453;&#30340;&#20934;&#30830;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2309.15032</link><description>&lt;p&gt;
SOFARI:&#22522;&#20110;&#39640;&#32500;&#27969;&#24418;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
SOFARI: High-Dimensional Manifold-Based Inference. (arXiv:2309.15032v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15032
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39640;&#32500;&#27969;&#24418;&#30340;SOFAR&#25512;&#26029;&#65288;SOFARI&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;Neyman&#36817;&#27491;&#20132;&#25512;&#26029;&#21644;SVD&#32422;&#26463;&#30340;Stiefel&#27969;&#24418;&#32467;&#26500;&#65292;&#23454;&#29616;&#20102;&#23545;&#22810;&#20219;&#21153;&#23398;&#20064;&#20013;&#28508;&#22312;&#22240;&#23376;&#30697;&#38453;&#30340;&#20934;&#30830;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#20219;&#21153;&#23398;&#20064;&#26159;&#19968;&#31181;&#24191;&#27867;&#20351;&#29992;&#30340;&#25216;&#26415;&#65292;&#29992;&#20110;&#20174;&#21508;&#31181;&#20219;&#21153;&#20013;&#25552;&#21462;&#20449;&#24687;&#12290;&#26368;&#36817;&#65292;&#22522;&#20110;&#31995;&#25968;&#30697;&#38453;&#20013;&#30340;&#31232;&#30095;&#22855;&#24322;&#20540;&#20998;&#35299;&#65288;SVD&#65289;&#30340;&#31232;&#30095;&#27491;&#20132;&#22240;&#23376;&#22238;&#24402;&#65288;SOFAR&#65289;&#26694;&#26550;&#34987;&#24341;&#20837;&#21040;&#21487;&#35299;&#37322;&#30340;&#22810;&#20219;&#21153;&#23398;&#20064;&#20013;&#65292;&#21487;&#20197;&#21457;&#29616;&#19981;&#21516;&#23618;&#27425;&#20043;&#38388;&#26377;&#24847;&#20041;&#30340;&#28508;&#22312;&#29305;&#24449;-&#21709;&#24212;&#20851;&#32852;&#32593;&#32476;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#31232;&#30095;SVD&#32422;&#26463;&#30340;&#27491;&#20132;&#24615;&#32422;&#26463;&#65292;&#23545;&#28508;&#22312;&#22240;&#23376;&#30697;&#38453;&#36827;&#34892;&#31934;&#30830;&#25512;&#26029;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;&#22522;&#20110;&#39640;&#32500;&#27969;&#24418;&#30340;SOFAR&#25512;&#26029;&#65288;SOFARI&#65289;&#65292;&#20511;&#37492;&#20102;Neyman&#36817;&#27491;&#20132;&#25512;&#26029;&#65292;&#24182;&#32467;&#21512;&#20102;SVD&#32422;&#26463;&#25152;&#26045;&#21152;&#30340;Stiefel&#27969;&#24418;&#32467;&#26500;&#12290;&#36890;&#36807;&#21033;&#29992;&#28508;&#22312;&#30340;Stiefel&#27969;&#24418;&#32467;&#26500;&#65292;SOFARI&#20026;&#28508;&#22312;&#24038;&#22240;&#23376;&#21521;&#37327;&#21644;&#22855;&#24322;&#20540;&#25552;&#20379;&#20102;&#20559;&#24046;&#26657;&#27491;&#30340;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-task learning is a widely used technique for harnessing information from various tasks. Recently, the sparse orthogonal factor regression (SOFAR) framework, based on the sparse singular value decomposition (SVD) within the coefficient matrix, was introduced for interpretable multi-task learning, enabling the discovery of meaningful latent feature-response association networks across different layers. However, conducting precise inference on the latent factor matrices has remained challenging due to orthogonality constraints inherited from the sparse SVD constraint. In this paper, we suggest a novel approach called high-dimensional manifold-based SOFAR inference (SOFARI), drawing on the Neyman near-orthogonality inference while incorporating the Stiefel manifold structure imposed by the SVD constraints. By leveraging the underlying Stiefel manifold structure, SOFARI provides bias-corrected estimators for both latent left factor vectors and singular values, for which we show to enj
&lt;/p&gt;</description></item></channel></rss>