<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>P-tensors &#25552;&#20379;&#20102;&#26500;&#24314;&#39640;&#38454;&#28040;&#24687;&#20256;&#36882;&#32593;&#32476;&#30340;&#36890;&#29992;&#24418;&#24335;&#65292;&#20854;&#22312;&#20998;&#23376;&#31561;&#39640;&#24230;&#32467;&#26500;&#21270;&#30340;&#22270;&#24418;&#20013;&#20855;&#26377;&#20248;&#24322;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2306.10767</link><description>&lt;p&gt;
P&#24352;&#37327;&#65306;&#26500;&#24314;&#39640;&#38454;&#28040;&#24687;&#20256;&#36882;&#32593;&#32476;&#30340;&#36890;&#29992;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
P-tensors: a General Formalism for Constructing Higher Order Message Passing Networks. (arXiv:2306.10767v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10767
&lt;/p&gt;
&lt;p&gt;
P-tensors &#25552;&#20379;&#20102;&#26500;&#24314;&#39640;&#38454;&#28040;&#24687;&#20256;&#36882;&#32593;&#32476;&#30340;&#36890;&#29992;&#24418;&#24335;&#65292;&#20854;&#22312;&#20998;&#23376;&#31561;&#39640;&#24230;&#32467;&#26500;&#21270;&#30340;&#22270;&#24418;&#20013;&#20855;&#26377;&#20248;&#24322;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#20960;&#31687;&#35770;&#25991;&#34920;&#26126;&#65292;&#39640;&#38454;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#39640;&#24230;&#32467;&#26500;&#21270;&#30340;&#22270;&#24418;&#22914;&#20998;&#23376;&#20013;&#33021;&#22815;&#27604;&#20854;&#26631;&#20934;&#30340;&#28040;&#24687;&#20256;&#36882;&#23545;&#24212;&#29289;&#33719;&#24471;&#26356;&#22909;&#30340;&#20934;&#30830;&#24615;&#12290;&#36825;&#20123;&#27169;&#22411;&#36890;&#24120;&#36890;&#36807;&#32771;&#34385;&#21253;&#21547;&#22312;&#32473;&#23450;&#22270;&#24418;&#20013;&#30340;&#23376;&#22270;&#30340;&#39640;&#38454;&#34920;&#31034;&#65292;&#28982;&#21518;&#22312;&#23427;&#20204;&#20043;&#38388;&#25191;&#34892;&#26576;&#20123;&#32447;&#24615;&#26144;&#23556;&#26469;&#24037;&#20316;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26500;&#27491;&#24335;&#21270;&#20026;&#25490;&#21015;&#31561;&#21464;&#24352;&#37327;&#25110;P&#24352;&#37327;&#65292;&#24182;&#25512;&#23548;&#20986;&#25152;&#26377;&#32447;&#24615;&#26144;&#23556;&#20043;&#38388;&#30340;&#20219;&#24847;&#39034;&#24207;&#31561;&#21464;P&#24352;&#37327;&#30340;&#22522;&#30784;&#12290;&#22312;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#33539;&#24335;&#22312;&#20960;&#20010;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#36798;&#21040;&#20102;&#29616;&#26377;&#26368;&#20808;&#36827;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Several recent papers have recently shown that higher order graph neural networks can achieve better accuracy than their standard message passing counterparts, especially on highly structured graphs such as molecules. These models typically work by considering higher order representations of subgraphs contained within a given graph and then perform some linear maps between them. We formalize these structures as permutation equivariant tensors, or P-tensors, and derive a basis for all linear maps between arbitrary order equivariant P-tensors. Experimentally, we demonstrate this paradigm achieves state of the art performance on several benchmark datasets.
&lt;/p&gt;</description></item></channel></rss>