<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#20351;&#29992;&#26377;&#38480;&#25968;&#25454;&#37327;&#22238;&#31572;&#31639;&#27861;&#24615;&#33021;&#38382;&#39064;&#30340;&#22522;&#26412;&#38480;&#21046;&#65292;&#35777;&#26126;&#20102;&#40657;&#30418;&#27979;&#35797;&#26041;&#27861;&#26080;&#27861;&#20934;&#30830;&#22238;&#31572;&#31639;&#27861;&#22312;&#19981;&#21516;&#35757;&#32451;&#38598;&#19978;&#30340;&#25972;&#20307;&#24615;&#33021;&#21644;&#29305;&#23450;&#27169;&#22411;&#30340;&#24615;&#33021;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.07388</link><description>&lt;p&gt;
&#26080;&#20551;&#35774;&#27979;&#35797;&#31639;&#27861;&#24615;&#33021;&#30340;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
The Limits of Assumption-free Tests for Algorithm Performance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07388
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#20351;&#29992;&#26377;&#38480;&#25968;&#25454;&#37327;&#22238;&#31572;&#31639;&#27861;&#24615;&#33021;&#38382;&#39064;&#30340;&#22522;&#26412;&#38480;&#21046;&#65292;&#35777;&#26126;&#20102;&#40657;&#30418;&#27979;&#35797;&#26041;&#27861;&#26080;&#27861;&#20934;&#30830;&#22238;&#31572;&#31639;&#27861;&#22312;&#19981;&#21516;&#35757;&#32451;&#38598;&#19978;&#30340;&#25972;&#20307;&#24615;&#33021;&#21644;&#29305;&#23450;&#27169;&#22411;&#30340;&#24615;&#33021;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31639;&#27861;&#35780;&#20215;&#21644;&#27604;&#36739;&#26159;&#26426;&#22120;&#23398;&#20064;&#21644;&#32479;&#35745;&#23398;&#20013;&#22522;&#26412;&#30340;&#38382;&#39064;&#65292;&#19968;&#20010;&#31639;&#27861;&#22312;&#32473;&#23450;&#30340;&#24314;&#27169;&#20219;&#21153;&#20013;&#34920;&#29616;&#22914;&#20309;&#65292;&#21738;&#20010;&#31639;&#27861;&#34920;&#29616;&#26368;&#20339;&#65311;&#35768;&#22810;&#26041;&#27861;&#24050;&#32463;&#24320;&#21457;&#20986;&#26469;&#35780;&#20272;&#31639;&#27861;&#24615;&#33021;&#65292;&#36890;&#24120;&#22522;&#20110;&#20132;&#21449;&#39564;&#35777;&#31574;&#30053;&#65292;&#23558;&#24863;&#20852;&#36259;&#30340;&#31639;&#27861;&#22312;&#19981;&#21516;&#30340;&#25968;&#25454;&#23376;&#38598;&#19978;&#37325;&#26032;&#35757;&#32451;&#65292;&#24182;&#35780;&#20272;&#20854;&#22312;&#30041;&#20986;&#25968;&#25454;&#28857;&#19978;&#30340;&#24615;&#33021;&#12290;&#23613;&#31649;&#24191;&#27867;&#20351;&#29992;&#36825;&#20123;&#31243;&#24207;&#65292;&#20294;&#23545;&#20110;&#36825;&#20123;&#26041;&#27861;&#30340;&#29702;&#35770;&#24615;&#36136;&#23578;&#26410;&#23436;&#20840;&#29702;&#35299;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#26377;&#38480;&#30340;&#25968;&#25454;&#37327;&#19979;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#30340;&#19968;&#20123;&#22522;&#26412;&#38480;&#21046;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#21306;&#20998;&#20102;&#20004;&#20010;&#38382;&#39064;: &#31639;&#27861;$A$&#22312;&#22823;&#23567;&#20026;$n$&#30340;&#35757;&#32451;&#38598;&#19978;&#23398;&#20064;&#38382;&#39064;&#26377;&#22810;&#22909;&#65292;&#20197;&#21450;&#22312;&#29305;&#23450;&#22823;&#23567;&#20026;$n$&#30340;&#35757;&#32451;&#25968;&#25454;&#38598;&#19978;&#36816;&#34892;$A$&#25152;&#20135;&#29983;&#30340;&#29305;&#23450;&#25311;&#21512;&#27169;&#22411;&#26377;&#22810;&#22909;&#65311;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#35777;&#26126;&#65292;&#23545;&#20110;&#20219;&#20309;&#23558;&#31639;&#27861;&#35270;&#20026;&#40657;&#30418;&#30340;&#27979;&#35797;&#26041;&#27861;&#65292;&#26080;&#27861;&#20934;&#30830;&#22320;&#22238;&#31572;&#36825;&#20004;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Algorithm evaluation and comparison are fundamental questions in machine learning and statistics -- how well does an algorithm perform at a given modeling task, and which algorithm performs best? Many methods have been developed to assess algorithm performance, often based around cross-validation type strategies, retraining the algorithm of interest on different subsets of the data and assessing its performance on the held-out data points. Despite the broad use of such procedures, the theoretical properties of these methods are not yet fully understood. In this work, we explore some fundamental limits for answering these questions with limited amounts of data. In particular, we make a distinction between two questions: how good is an algorithm $A$ at the problem of learning from a training set of size $n$, versus, how good is a particular fitted model produced by running $A$ on a particular training data set of size $n$?   Our main results prove that, for any test that treats the algor
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#24314;&#27169;&#26694;&#26550;&#65292;&#29992;&#20110;&#32593;&#32476;&#24178;&#25200;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#36890;&#36807;&#23545;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#36830;&#25509;&#26041;&#24335;&#36827;&#34892;&#24314;&#27169;&#21644;&#23398;&#20064;&#25919;&#31574;&#25110;&#27835;&#30103;&#20998;&#37197;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#27979;&#35797;&#26041;&#27861;&#26469;&#26816;&#39564;&#25919;&#31574;&#26080;&#20851;&#24615;/&#27835;&#30103;&#25928;&#24212;&#65292;&#24182;&#23545;&#24179;&#22343;&#25110;&#20998;&#24067;&#24335;&#25919;&#31574;&#25928;&#24212;/&#27835;&#30103;&#21453;&#24212;&#30340;&#20272;&#35745;&#22120;&#32473;&#20986;&#20102;&#19978;&#30028;&#12290;</title><link>http://arxiv.org/abs/2105.03810</link><description>&lt;p&gt;
&#32593;&#32476;&#24178;&#25200;&#26465;&#20214;&#19979;&#22240;&#26524;&#25512;&#26029;&#30340;&#23616;&#37096;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Local Approach to Causal Inference under Network Interference. (arXiv:2105.03810v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.03810
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#24314;&#27169;&#26694;&#26550;&#65292;&#29992;&#20110;&#32593;&#32476;&#24178;&#25200;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#36890;&#36807;&#23545;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#36830;&#25509;&#26041;&#24335;&#36827;&#34892;&#24314;&#27169;&#21644;&#23398;&#20064;&#25919;&#31574;&#25110;&#27835;&#30103;&#20998;&#37197;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#27979;&#35797;&#26041;&#27861;&#26469;&#26816;&#39564;&#25919;&#31574;&#26080;&#20851;&#24615;/&#27835;&#30103;&#25928;&#24212;&#65292;&#24182;&#23545;&#24179;&#22343;&#25110;&#20998;&#24067;&#24335;&#25919;&#31574;&#25928;&#24212;/&#27835;&#30103;&#21453;&#24212;&#30340;&#20272;&#35745;&#22120;&#32473;&#20986;&#20102;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#24314;&#27169;&#26694;&#26550;&#65292;&#29992;&#20110;&#22788;&#29702;&#31038;&#20132;&#25110;&#32463;&#27982;&#32593;&#32476;&#20013;&#20195;&#29702;&#20154;&#20043;&#38388;&#36830;&#25509;&#26041;&#24335;&#23545;&#32467;&#26524;&#20135;&#29983;&#24433;&#21709;&#30340;&#22240;&#26524;&#25512;&#26029;&#38382;&#39064;&#12290;&#36825;&#31181;&#32593;&#32476;&#24178;&#25200;&#25551;&#36848;&#20102;&#20851;&#20110;&#27835;&#30103;&#28322;&#20986;&#12289;&#31038;&#20132;&#20114;&#21160;&#12289;&#31038;&#20250;&#23398;&#20064;&#12289;&#20449;&#24687;&#25193;&#25955;&#12289;&#30142;&#30149;&#21644;&#37329;&#34701;&#20256;&#26579;&#12289;&#31038;&#20250;&#36164;&#26412;&#24418;&#25104;&#31561;&#39046;&#22495;&#30340;&#22823;&#37327;&#25991;&#29486;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#39318;&#20808;&#36890;&#36807;&#27979;&#37327;&#36335;&#24452;&#36317;&#31163;&#26469;&#25551;&#36848;&#20195;&#29702;&#20154;&#22312;&#32593;&#32476;&#20013;&#30340;&#36830;&#25509;&#26041;&#24335;&#65292;&#28982;&#21518;&#36890;&#36807;&#27719;&#38598;&#20855;&#26377;&#31867;&#20284;&#37197;&#32622;&#30340;&#20195;&#29702;&#20154;&#30340;&#32467;&#26524;&#25968;&#25454;&#26469;&#23398;&#20064;&#25919;&#31574;&#25110;&#27835;&#30103;&#20998;&#37197;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#28176;&#36817;&#26377;&#25928;&#30340;&#27979;&#35797;&#26469;&#28436;&#31034;&#35813;&#26041;&#27861;&#65292;&#35813;&#27979;&#35797;&#29992;&#20110;&#26816;&#39564;&#25919;&#31574;&#26080;&#20851;&#24615;/&#27835;&#30103;&#25928;&#24212;&#30340;&#20551;&#35774;&#65292;&#24182;&#32473;&#20986;&#20102;&#38024;&#23545;&#24179;&#22343;&#25110;&#20998;&#24067;&#24335;&#25919;&#31574;&#25928;&#24212;/&#27835;&#30103;&#21453;&#24212;&#30340;k&#26368;&#36817;&#37051;&#20272;&#35745;&#22120;&#30340;&#22343;&#26041;&#35823;&#24046;&#30340;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new nonparametric modeling framework for causal inference when outcomes depend on how agents are linked in a social or economic network. Such network interference describes a large literature on treatment spillovers, social interactions, social learning, information diffusion, disease and financial contagion, social capital formation, and more. Our approach works by first characterizing how an agent is linked in the network using the configuration of other agents and connections nearby as measured by path distance. The impact of a policy or treatment assignment is then learned by pooling outcome data across similarly configured agents. We demonstrate the approach by proposing an asymptotically valid test for the hypothesis of policy irrelevance/no treatment effects and bounding the mean-squared error of a k-nearest-neighbor estimator for the average or distributional policy effect/treatment response.
&lt;/p&gt;</description></item></channel></rss>