<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#25552;&#20986;&#20102;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#38656;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#38656;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;</title><link>http://arxiv.org/abs/2401.11422</link><description>&lt;p&gt;
&#20202;&#22120;&#21464;&#37327;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#23616;&#37096;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Local Identification in the Instrumental Variable Multivariate Quantile Regression Model. (arXiv:2401.11422v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11422
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#38656;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#38656;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Chernozhukov&#21644;Hansen&#65288;2005&#65289;&#24341;&#20837;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#26159;&#20998;&#26512;&#20869;&#29983;&#24615;&#24773;&#20917;&#19979;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#30340;&#26377;&#29992;&#24037;&#20855;&#65292;&#20294;&#24403;&#32467;&#26524;&#21464;&#37327;&#26159;&#22810;&#32500;&#30340;&#26102;&#65292;&#23427;&#23545;&#27599;&#20010;&#21464;&#37327;&#19981;&#21516;&#32500;&#24230;&#30340;&#32852;&#21512;&#20998;&#24067;&#20445;&#25345;&#27785;&#40664;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30456;&#20851;&#24615;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20026;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#25152;&#38656;&#30340;&#29992;&#20110;&#35782;&#21035;&#30340;IV&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#35201;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26469;&#33258;&#25105;&#20204;&#24314;&#31435;&#30340;&#19968;&#20010;&#20855;&#26377;&#29420;&#31435;&#29702;&#35770;&#24847;&#20041;&#30340;&#19968;&#33324;&#35782;&#21035;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
The instrumental variable (IV) quantile regression model introduced by Chernozhukov and Hansen (2005) is a useful tool for analyzing quantile treatment effects in the presence of endogeneity, but when outcome variables are multidimensional, it is silent on the joint distribution of different dimensions of each variable. To overcome this limitation, we propose an IV model built on the optimal-transport-based multivariate quantile that takes into account the correlation between the entries of the outcome variable. We then provide a local identification result for the model. Surprisingly, we find that the support size of the IV required for the identification is independent of the dimension of the outcome vector, as long as the IV is sufficiently informative. Our result follows from a general identification theorem that we establish, which has independent theoretical significance.
&lt;/p&gt;</description></item></channel></rss>