<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21028;&#26029;&#20004;&#20010;&#26631;&#20934;&#27491;&#24577;&#38543;&#26426;&#21521;&#37327;&#26159;&#21542;&#30456;&#20851;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#20284;&#28982;&#27604;&#30340;&#20108;&#38454;&#30697;&#65292;&#24182;&#21457;&#29616;&#20102;&#19982;&#25972;&#25968;&#20998;&#21106;&#20989;&#25968;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2401.13429</link><description>&lt;p&gt;
&#30456;&#20851;&#38543;&#26426;&#21521;&#37327;&#30340;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Detection of Correlated Random Vectors. (arXiv:2401.13429v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13429
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21028;&#26029;&#20004;&#20010;&#26631;&#20934;&#27491;&#24577;&#38543;&#26426;&#21521;&#37327;&#26159;&#21542;&#30456;&#20851;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#20284;&#28982;&#27604;&#30340;&#20108;&#38454;&#30697;&#65292;&#24182;&#21457;&#29616;&#20102;&#19982;&#25972;&#25968;&#20998;&#21106;&#20989;&#25968;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21028;&#26029;&#20004;&#20010;&#26631;&#20934;&#27491;&#24577;&#38543;&#26426;&#21521;&#37327;$\mathsf{X}\in\mathbb{R}^{n}$&#21644;$\mathsf{Y}\in\mathbb{R}^{n}$&#26159;&#21542;&#30456;&#20851;&#30340;&#38382;&#39064;&#12290;&#36825;&#34987;&#34920;&#36848;&#20026;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#65292;&#22312;&#38646;&#20551;&#35774;&#19979;&#65292;&#36825;&#20123;&#21521;&#37327;&#26159;&#32479;&#35745;&#29420;&#31435;&#30340;&#65292;&#32780;&#22312;&#22791;&#25321;&#20551;&#35774;&#19979;&#65292;$\mathsf{X}$&#21644;&#38543;&#26426;&#22343;&#21248;&#32622;&#25442;&#30340;$\mathsf{Y}$&#26159;&#20855;&#26377;&#30456;&#20851;&#31995;&#25968;$\rho$&#30340;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#20449;&#24687;&#35770;&#19978;&#19981;&#21487;&#33021;&#21644;&#21487;&#33021;&#30340;&#26368;&#20248;&#27979;&#35797;&#38408;&#20540;&#65292;&#20316;&#20026;$n$&#21644;$\rho$&#30340;&#20989;&#25968;&#12290;&#20026;&#20102;&#24471;&#20986;&#25105;&#20204;&#30340;&#20449;&#24687;&#35770;&#19979;&#30028;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21033;&#29992;&#27491;&#20132;&#22810;&#39033;&#24335;&#23637;&#24320;&#26469;&#35780;&#20272;&#20284;&#28982;&#27604;&#30340;&#20108;&#38454;&#30697;&#30340;&#26032;&#25216;&#26415;&#65292;&#35813;&#25216;&#26415;&#25581;&#31034;&#20102;&#19982;&#25972;&#25968;&#20998;&#21106;&#20989;&#25968;&#20043;&#38388;&#30340;&#19968;&#20010;&#20196;&#20154;&#24778;&#35766;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#19978;&#36848;&#35774;&#32622;&#30340;&#22810;&#32500;&#27867;&#21270;&#65292;&#20854;&#20013;&#25105;&#20204;&#35266;&#23519;&#21040;&#20004;&#20010;&#25968;&#25454;&#24211;/&#30697;&#38453;&#65292;&#32780;&#19981;&#26159;&#20004;&#20010;&#21521;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we investigate the problem of deciding whether two standard normal random vectors $\mathsf{X}\in\mathbb{R}^{n}$ and $\mathsf{Y}\in\mathbb{R}^{n}$ are correlated or not. This is formulated as a hypothesis testing problem, where under the null hypothesis, these vectors are statistically independent, while under the alternative, $\mathsf{X}$ and a randomly and uniformly permuted version of $\mathsf{Y}$, are correlated with correlation $\rho$. We analyze the thresholds at which optimal testing is information-theoretically impossible and possible, as a function of $n$ and $\rho$. To derive our information-theoretic lower bounds, we develop a novel technique for evaluating the second moment of the likelihood ratio using an orthogonal polynomials expansion, which among other things, reveals a surprising connection to integer partition functions. We also study a multi-dimensional generalization of the above setting, where rather than two vectors we observe two databases/matrices
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38543;&#26426;&#21709;&#24212;&#26426;&#21046;&#30340;&#25193;&#23637;&#65292;&#21487;&#22312;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#32422;&#26463;&#19979;&#35745;&#31639;&#38750;&#21442;&#25968;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#65292;&#30001;&#27492;&#24471;&#21040;&#30340;&#32467;&#26524;&#21487;&#29992;&#20110;&#29983;&#25104;&#25928;&#29575;&#39640;&#30340;&#32622;&#20449;&#21306;&#38388;&#21644;&#26102;&#38388;&#22343;&#21248;&#32622;&#20449;&#24207;&#21015;&#12290;&#21033;&#29992;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#24182;&#20135;&#29983;&#31169;&#26377;&#27169;&#25311;&#12290;</title><link>http://arxiv.org/abs/2202.08728</link><description>&lt;p&gt;
&#38543;&#26426;&#21709;&#24212;&#31169;&#26377;&#32622;&#20449;&#38598;&#30340;&#38750;&#21442;&#25968;&#25193;&#23637;
&lt;/p&gt;
&lt;p&gt;
Nonparametric extensions of randomized response for private confidence sets. (arXiv:2202.08728v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.08728
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38543;&#26426;&#21709;&#24212;&#26426;&#21046;&#30340;&#25193;&#23637;&#65292;&#21487;&#22312;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#32422;&#26463;&#19979;&#35745;&#31639;&#38750;&#21442;&#25968;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#65292;&#30001;&#27492;&#24471;&#21040;&#30340;&#32467;&#26524;&#21487;&#29992;&#20110;&#29983;&#25104;&#25928;&#29575;&#39640;&#30340;&#32622;&#20449;&#21306;&#38388;&#21644;&#26102;&#38388;&#22343;&#21248;&#32622;&#20449;&#24207;&#21015;&#12290;&#21033;&#29992;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#24182;&#20135;&#29983;&#31169;&#26377;&#27169;&#25311;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#65288;LDP&#65289;&#32422;&#26463;&#19979;&#25191;&#34892;&#38750;&#21442;&#25968;&#12289;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;&#20855;&#26377;&#22343;&#20540;$\mu^\star$&#30340;&#26377;&#30028;&#35266;&#27979;$(X_1,\dots,X_n)$&#30340;&#32622;&#20449;&#21306;&#38388;&#65288;CI&#65289;&#21644;&#26102;&#38388;&#22343;&#21248;&#32622;&#20449;&#24207;&#21015;&#65288;CS&#65289;&#65292;&#24403;&#21482;&#26377;&#35775;&#38382;&#31169;&#26377;&#25968;&#25454;$(Z_1,\dots,Z_n)$&#26102;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#38750;&#21442;&#25968;&#30340;&#12289;&#39034;&#24207;&#20132;&#20114;&#30340; Warner &#30340;&#33879;&#21517;&#8220;&#38543;&#26426;&#21709;&#24212;&#8221;&#26426;&#21046;&#30340;&#25512;&#24191;&#65292;&#20026;&#20219;&#24847;&#26377;&#30028;&#38543;&#26426;&#21464;&#37327;&#28385;&#36275; LDP&#65292;&#24182;&#25552;&#20379; CIs &#21644; CSs&#65292;&#29992;&#20110;&#35775;&#38382;&#25152;&#24471;&#31169;&#26377;&#21270;&#30340;&#35266;&#27979;&#20540;&#30340;&#22343;&#20540;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#22312;&#22266;&#23450;&#26102;&#38388;&#21644;&#26102;&#38388;&#22343;&#21248;&#21306;&#22495;&#37117;&#20135;&#29983;&#20102; Hoeffding &#19981;&#31561;&#24335;&#30340;&#31169;&#26377;&#27169;&#25311;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123; Hoeffding  &#31867;&#22411;&#30340; CSs &#25193;&#23637;&#21040;&#25429;&#33719;&#26102;&#38388;&#21464;&#21270;&#65288;&#38750;&#24179;&#31283;&#65289;&#30340;&#22343;&#20540;&#65292;&#26368;&#21518;&#35828;&#26126;&#20102;&#22914;&#20309;&#21033;&#29992;&#36825;&#20123;&#26041;&#27861;&#36827;&#34892;&#23454;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work derives methods for performing nonparametric, nonasymptotic statistical inference for population means under the constraint of local differential privacy (LDP). Given bounded observations $(X_1, \dots, X_n)$ with mean $\mu^\star$ that are privatized into $(Z_1, \dots, Z_n)$, we present confidence intervals (CI) and time-uniform confidence sequences (CS) for $\mu^\star$ when only given access to the privatized data. To achieve this, we introduce a nonparametric and sequentially interactive generalization of Warner's famous ``randomized response'' mechanism, satisfying LDP for arbitrary bounded random variables, and then provide CIs and CSs for their means given access to the resulting privatized observations. For example, our results yield private analogues of Hoeffding's inequality in both fixed-time and time-uniform regimes. We extend these Hoeffding-type CSs to capture time-varying (non-stationary) means, and conclude by illustrating how these methods can be used to conduct
&lt;/p&gt;</description></item></channel></rss>