<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#65292;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;</title><link>http://arxiv.org/abs/2307.15181</link><description>&lt;p&gt;
&#20851;&#20110;&#32454;&#20998;&#23454;&#39564;&#25928;&#29575;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Efficiency of Finely Stratified Experiments. (arXiv:2307.15181v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#65292;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#12290;&#22312;&#36825;&#37324;&#65292;&#25928;&#29575;&#26159;&#25351;&#23545;&#20110;&#19968;&#31867;&#24191;&#27867;&#30340;&#22788;&#29702;&#20998;&#37197;&#26041;&#26696;&#32780;&#35328;&#30340;&#65292;&#20854;&#20013;&#20219;&#20309;&#21333;&#20301;&#34987;&#20998;&#37197;&#21040;&#22788;&#29702;&#30340;&#36793;&#38469;&#27010;&#29575;&#31561;&#20110;&#39044;&#20808;&#25351;&#23450;&#30340;&#20540;&#65292;&#20363;&#22914;&#19968;&#21322;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#19981;&#35201;&#27714;&#22788;&#29702;&#29366;&#24577;&#26159;&#20197;i.i.d.&#30340;&#26041;&#24335;&#20998;&#37197;&#30340;&#65292;&#22240;&#27492;&#21487;&#20197;&#36866;&#24212;&#23454;&#36341;&#20013;&#20351;&#29992;&#30340;&#22797;&#26434;&#22788;&#29702;&#20998;&#37197;&#26041;&#26696;&#65292;&#22914;&#20998;&#23618;&#38543;&#26426;&#21270;&#21644;&#21305;&#37197;&#23545;&#12290;&#25152;&#32771;&#34385;&#30340;&#21442;&#25968;&#31867;&#21035;&#26159;&#21487;&#20197;&#34920;&#31034;&#20026;&#24050;&#30693;&#35266;&#27979;&#25968;&#25454;&#30340;&#19968;&#20010;&#24050;&#30693;&#20989;&#25968;&#30340;&#26399;&#26395;&#30340;&#32422;&#26463;&#30340;&#35299;&#30340;&#37027;&#20123;&#21442;&#25968;&#65292;&#20854;&#20013;&#21487;&#33021;&#21253;&#25324;&#22788;&#29702;&#20998;&#37197;&#36793;&#38469;&#27010;&#29575;&#30340;&#39044;&#20808;&#25351;&#23450;&#20540;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31867;&#21442;&#25968;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the efficient estimation of a large class of treatment effect parameters that arise in the analysis of experiments. Here, efficiency is understood to be with respect to a broad class of treatment assignment schemes for which the marginal probability that any unit is assigned to treatment equals a pre-specified value, e.g., one half. Importantly, we do not require that treatment status is assigned in an i.i.d. fashion, thereby accommodating complicated treatment assignment schemes that are used in practice, such as stratified block randomization and matched pairs. The class of parameters considered are those that can be expressed as the solution to a restriction on the expectation of a known function of the observed data, including possibly the pre-specified value for the marginal probability of treatment assignment. We show that this class of parameters includes, among other things, average treatment effects, quantile treatment effects, local average treatment effect
&lt;/p&gt;</description></item></channel></rss>