<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.08982</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Least squares estimation in nonlinear cohort panels with learning from experience. (arXiv:2309.08982v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08982
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#20854;&#20013;&#28041;&#21450;&#21040;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#37492;&#23450;&#20102;&#20551;&#35774;&#26816;&#39564;&#21487;&#33021;&#23384;&#22312;&#30340;&#28508;&#22312;&#38519;&#38449;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#39564;&#35777;&#20102;&#26377;&#38480;&#26679;&#26412;&#20013;&#20272;&#35745;&#22120;&#21644;&#30456;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#29305;&#24615;&#65292;&#32780;&#23545;&#19968;&#32452;&#35843;&#26597;&#39044;&#26399;&#30340;&#24212;&#29992;&#21017;&#35777;&#26126;&#20102;&#25152;&#24320;&#21457;&#29702;&#35770;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We discuss techniques of estimation and inference for nonlinear cohort panels with learning from experience, showing, inter alia, the consistency and asymptotic normality of the nonlinear least squares estimator employed in the seminal paper by Malmendier and Nagel (2016). Potential pitfalls for hypothesis testing are identified and solutions proposed. Monte Carlo simulations verify the properties of the estimator and corresponding test statistics in finite samples, while an application to a panel of survey expectations demonstrates the usefulness of the theory developed.
&lt;/p&gt;</description></item></channel></rss>