<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#21487;&#25509;&#21463;&#30340;&#23545;&#31216;&#32422;&#26463;&#26465;&#20214;&#19979;&#30340;&#20840;&#23616;&#26368;&#20248;&#24615;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#28385;&#36275;&#23545;&#31216;&#24615;&#36136;&#30340;&#20989;&#25968;&#25110;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#36712;&#36947;&#20984;&#20307;&#21644;coycle&#31561;&#24037;&#20855;&#35299;&#20915;&#20102;&#36825;&#19968;&#38382;&#39064;&#12290;&#20855;&#20307;&#24212;&#29992;&#21253;&#25324;&#19981;&#21464;&#26680;&#22343;&#20540;&#23884;&#20837;&#21644;&#22522;&#20110;&#23545;&#31216;&#32422;&#26463;&#30340;&#36816;&#36755;&#26041;&#26696;&#26368;&#20248;&#24615;&#12290;&#36825;&#20123;&#32467;&#26524;&#19982;&#19981;&#21464;&#24615;&#26816;&#39564;&#30340;Hunt-Stein&#23450;&#29702;&#30456;&#20851;&#12290;</title><link>https://arxiv.org/abs/2402.07613</link><description>&lt;p&gt;
&#22312;&#21487;&#25509;&#21463;&#30340;&#23545;&#31216;&#32422;&#26463;&#26465;&#20214;&#19979;&#30340;&#20840;&#23616;&#26368;&#20248;&#24615;
&lt;/p&gt;
&lt;p&gt;
Global optimality under amenable symmetry constraints
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07613
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#21487;&#25509;&#21463;&#30340;&#23545;&#31216;&#32422;&#26463;&#26465;&#20214;&#19979;&#30340;&#20840;&#23616;&#26368;&#20248;&#24615;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#28385;&#36275;&#23545;&#31216;&#24615;&#36136;&#30340;&#20989;&#25968;&#25110;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#36712;&#36947;&#20984;&#20307;&#21644;coycle&#31561;&#24037;&#20855;&#35299;&#20915;&#20102;&#36825;&#19968;&#38382;&#39064;&#12290;&#20855;&#20307;&#24212;&#29992;&#21253;&#25324;&#19981;&#21464;&#26680;&#22343;&#20540;&#23884;&#20837;&#21644;&#22522;&#20110;&#23545;&#31216;&#32422;&#26463;&#30340;&#36816;&#36755;&#26041;&#26696;&#26368;&#20248;&#24615;&#12290;&#36825;&#20123;&#32467;&#26524;&#19982;&#19981;&#21464;&#24615;&#26816;&#39564;&#30340;Hunt-Stein&#23450;&#29702;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#26159;&#21542;&#23384;&#22312;&#19968;&#31181;&#28385;&#36275;&#21487;&#25509;&#21463;&#21464;&#25442;&#32676;&#25351;&#23450;&#30340;&#23545;&#31216;&#24615;&#36136;&#30340;&#20989;&#25968;&#25110;&#24230;&#37327;&#65292;&#21363;&#21516;&#26102;&#28385;&#36275;&#20197;&#19979;&#20004;&#20010;&#26465;&#20214;&#65306;&#65288;1&#65289;&#26368;&#23567;&#21270;&#32473;&#23450;&#30340;&#20984;&#24615;&#27867;&#20989;&#25110;&#39118;&#38505;&#65292;&#65288;2&#65289;&#28385;&#36275;&#21487;&#23481;&#24525;&#23545;&#31216;&#32422;&#26463;&#12290;&#36825;&#31181;&#23545;&#31216;&#24615;&#36136;&#30340;&#20363;&#23376;&#21253;&#25324;&#19981;&#21464;&#24615;&#12289;&#21487;&#21464;&#24615;&#25110;&#20934;&#19981;&#21464;&#24615;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#20381;&#36182;&#20110;Stein&#21644;Le Cam&#30340;&#32769;&#24605;&#24819;&#65292;&#20197;&#21450;&#22312;&#21487;&#25509;&#21463;&#32676;&#30340;&#36941;&#21382;&#23450;&#29702;&#20013;&#20986;&#29616;&#30340;&#36817;&#20284;&#32676;&#24179;&#22343;&#20540;&#12290;&#22312;&#20984;&#20998;&#26512;&#20013;&#65292;&#19968;&#31867;&#31216;&#20026;&#36712;&#36947;&#20984;&#20307;&#30340;&#20984;&#38598;&#26174;&#24471;&#33267;&#20851;&#37325;&#35201;&#65292;&#25105;&#20204;&#22312;&#38750;&#21442;&#25968;&#35774;&#32622;&#20013;&#30830;&#23450;&#20102;&#36825;&#31867;&#36712;&#36947;&#20984;&#20307;&#30340;&#24615;&#36136;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#19968;&#20010;&#31216;&#20026;coycle&#30340;&#31616;&#21333;&#35013;&#32622;&#22914;&#20309;&#23558;&#19981;&#21516;&#24418;&#24335;&#30340;&#23545;&#31216;&#24615;&#36716;&#21270;&#20026;&#19968;&#20010;&#38382;&#39064;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#20851;&#20110;&#19981;&#21464;&#26680;&#22343;&#20540;&#23884;&#20837;&#21644;&#22312;&#23545;&#31216;&#32422;&#26463;&#19979;&#36816;&#36755;&#26041;&#26696;&#26368;&#20248;&#24615;&#30340;Monge-Kantorovich&#23450;&#29702;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#36824;&#35299;&#37322;&#20102;&#19982;&#19981;&#21464;&#24615;&#26816;&#39564;&#30340;Hunt-Stein&#23450;&#29702;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
We ask whether there exists a function or measure that (1) minimizes a given convex functional or risk and (2) satisfies a symmetry property specified by an amenable group of transformations. Examples of such symmetry properties are invariance, equivariance, or quasi-invariance. Our results draw on old ideas of Stein and Le Cam and on approximate group averages that appear in ergodic theorems for amenable groups. A class of convex sets known as orbitopes in convex analysis emerges as crucial, and we establish properties of such orbitopes in nonparametric settings. We also show how a simple device called a cocycle can be used to reduce different forms of symmetry to a single problem. As applications, we obtain results on invariant kernel mean embeddings and a Monge-Kantorovich theorem on optimality of transport plans under symmetry constraints. We also explain connections to the Hunt-Stein theorem on invariant tests.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;&#23545;&#21333;&#20010;&#35266;&#27979;&#32467;&#26524;&#26377;&#20581;&#22766;&#24615;</title><link>http://arxiv.org/abs/2303.15845</link><description>&lt;p&gt;
&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;&#21487;&#35777;&#26126;&#20855;&#26377;&#20581;&#22766;&#24615;:&#38134;&#28246;&#21453;&#38382;&#39064;&#30340;&#36880;&#28857;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
Conditional Generative Models are Provably Robust: Pointwise Guarantees for Bayesian Inverse Problems. (arXiv:2303.15845v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15845
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;&#23545;&#21333;&#20010;&#35266;&#27979;&#32467;&#26524;&#26377;&#20581;&#22766;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;&#25104;&#20026;&#37319;&#26679;&#38134;&#28246;&#21453;&#38382;&#39064;&#21518;&#39564;&#27010;&#29575;&#30340;&#24378;&#22823;&#24037;&#20855;. &#32463;&#20856;&#30340;&#36125;&#21494;&#26031;&#25991;&#29486;&#24050;&#32463;&#30693;&#36947;&#21518;&#39564;&#27979;&#24230;&#23545;&#20808;&#21069;&#27979;&#24230;&#21644;&#36127;&#23545;&#25968;&#20284;&#28982;&#20989;&#25968;(&#21253;&#25324;&#35266;&#23519;&#30340;&#25200;&#21160;)&#38750;&#24120; robust. &#20294;&#26159;, &#23601;&#25105;&#20204;&#25152;&#30693;, &#26465;&#20214;&#29983;&#25104;&#27169;&#22411;&#30340;&#20581;&#22766;&#24615;&#36824;&#27809;&#34987;&#30740;&#31350;&#36807;. &#22312;&#26412;&#25991;&#20013;, &#25105;&#20204;&#39318;&#27425;&#35777;&#26126;&#20102;&#36866;&#24403;&#23398;&#20064;&#30340;&#26465;&#20214;&#29983;&#25104;&#27169;&#22411;&#22312;&#21333;&#20010;&#35266;&#27979;&#20540;&#26041;&#38754;&#25552;&#20379;&#20102;&#20581;&#22766;&#30340;&#32467;&#26524;.
&lt;/p&gt;
&lt;p&gt;
Conditional generative models became a very powerful tool to sample from Bayesian inverse problem posteriors. It is well-known in classical Bayesian literature that posterior measures are quite robust with respect to perturbations of both the prior measure and the negative log-likelihood, which includes perturbations of the observations. However, to the best of our knowledge, the robustness of conditional generative models with respect to perturbations of the observations has not been investigated yet. In this paper, we prove for the first time that appropriately learned conditional generative models provide robust results for single observations.
&lt;/p&gt;</description></item></channel></rss>