<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36830;&#32493;&#27835;&#30103;&#29615;&#22659;&#30340;&#22810;&#37325;&#31283;&#20581;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#20272;&#35745;&#22120;&#65292;&#37319;&#29992;&#20102;&#26680;&#24179;&#28369;&#26041;&#27861;&#65292;&#24182;&#20855;&#26377;&#22810;&#37325;&#31283;&#20581;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;</title><link>https://arxiv.org/abs/2105.09254</link><description>&lt;p&gt;
&#22312;&#36830;&#32493;&#27835;&#30103;&#19979;&#30340;&#22810;&#37325;&#31283;&#20581;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Multiply Robust Causal Mediation Analysis with Continuous Treatments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2105.09254
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36830;&#32493;&#27835;&#30103;&#29615;&#22659;&#30340;&#22810;&#37325;&#31283;&#20581;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#20272;&#35745;&#22120;&#65292;&#37319;&#29992;&#20102;&#26680;&#24179;&#28369;&#26041;&#27861;&#65292;&#24182;&#20855;&#26377;&#22810;&#37325;&#31283;&#20581;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#24212;&#29992;&#20013;&#65292;&#30740;&#31350;&#20154;&#21592;&#23545;&#27835;&#30103;&#25110;&#26292;&#38706;&#23545;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#20013;&#20171;&#20998;&#26512;&#20026;&#37492;&#23450;&#21644;&#20272;&#35745;&#36825;&#20123;&#22240;&#26524;&#25928;&#24212;&#25552;&#20379;&#20102;&#19968;&#20010;&#20005;&#35880;&#30340;&#26694;&#26550;&#12290;&#23545;&#20110;&#20108;&#20803;&#27835;&#30103;&#65292;Tchetgen Tchetgen&#21644;Shpitser (2012)&#25552;&#20986;&#20102;&#30452;&#25509;&#21644;&#38388;&#25509;&#25928;&#24212;&#30340;&#39640;&#25928;&#20272;&#35745;&#22120;&#65292;&#22522;&#20110;&#21442;&#25968;&#30340;&#24433;&#21709;&#20989;&#25968;&#12290;&#36825;&#20123;&#20272;&#35745;&#22120;&#20855;&#26377;&#33391;&#22909;&#30340;&#24615;&#36136;&#65292;&#22914;&#22810;&#37325;&#31283;&#20581;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#21516;&#26102;&#20801;&#35768;&#23545;&#24178;&#25200;&#21442;&#25968;&#36827;&#34892;&#20302;&#20110;&#26681;&#21495;n&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#28982;&#32780;&#65292;&#22312;&#28041;&#21450;&#36830;&#32493;&#27835;&#30103;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#22522;&#20110;&#24433;&#21709;&#20989;&#25968;&#30340;&#20272;&#35745;&#22120;&#27809;&#26377;&#20934;&#22791;&#22909;&#24212;&#29992;&#65292;&#38500;&#38750;&#36827;&#34892;&#24378;&#21442;&#25968;&#20551;&#35774;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#26680;&#24179;&#28369;&#26041;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36830;&#32493;&#27835;&#30103;&#29615;&#22659;&#30340;&#20272;&#35745;&#22120;&#65292;&#21463;&#21040;Tchetgen Tchetgen&#30340;&#24433;&#21709;&#20989;&#25968;&#20272;&#35745;&#22120;&#30340;&#21551;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many applications, researchers are interested in the direct and indirect causal effects of a treatment or exposure on an outcome of interest. Mediation analysis offers a rigorous framework for identifying and estimating these causal effects. For binary treatments, efficient estimators for the direct and indirect effects are presented in Tchetgen Tchetgen and Shpitser (2012) based on the influence function of the parameter of interest. These estimators possess desirable properties, such as multiple-robustness and asymptotic normality, while allowing for slower than root-n rates of convergence for the nuisance parameters. However, in settings involving continuous treatments, these influence function-based estimators are not readily applicable without making strong parametric assumptions. In this work, utilizing a kernel-smoothing approach, we propose an estimator suitable for settings with continuous treatments inspired by the influence function-based estimator of Tchetgen Tchetgen an
&lt;/p&gt;</description></item></channel></rss>