<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.02303</link><description>&lt;p&gt;
&#33258;&#20030;&#36153;&#33293;&#23572;&#24066;&#22330;&#22343;&#34913;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Bootstrapping Fisher Market Equilibrium and First-Price Pacing Equilibrium
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02303
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#26159;&#32463;&#27982;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#22343;&#34913;&#27169;&#22411;&#65292;&#20063;&#22312;&#20844;&#24179;&#21644;&#39640;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#26041;&#38754;&#26377;&#24212;&#29992;&#12290;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#26159;&#19968;&#31181;&#25429;&#25417;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#20013;&#39044;&#31639;&#31649;&#29702;&#26426;&#21046;&#30340;&#27169;&#22411;&#12290;&#22312;&#26576;&#20123;&#23454;&#38469;&#24773;&#20917;&#19979;&#65292;&#22914;&#24191;&#21578;&#25293;&#21334;&#65292;&#22312;&#36825;&#20123;&#27169;&#22411;&#19978;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#20855;&#26377;&#19968;&#23450;&#30340;&#20852;&#36259;&#12290;&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#20110;&#19968;&#33324;&#32479;&#35745;&#25512;&#26029;&#30340;&#24120;&#29992;&#26041;&#27861;&#26159;&#33258;&#20030;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;LFM&#21644;FPPE&#65292;&#30446;&#21069;&#19981;&#23384;&#22312;&#26377;&#25928;&#24212;&#29992;&#33258;&#20030;&#31243;&#24207;&#30340;&#29702;&#35770;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;LFM&#21644;FPPE&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#12290;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#37096;&#20998;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#65292;&#36825;&#24402;&#32467;&#20026;&#33258;&#20030;&#32422;&#26463;M-&#20272;&#35745;&#37327;&#65292;&#36825;&#26159;&#19968;&#20010;&#24456;&#22823;&#31243;&#24230;&#19978;&#26410;&#24320;&#21457;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#20026;FPPE&#35774;&#35745;&#20102;&#19968;&#20010;&#33258;&#20030;&#36807;&#31243;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#23454;&#38469;&#25968;&#25454;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The linear Fisher market (LFM) is a basic equilibrium model from economics, which also has applications in fair and efficient resource allocation. First-price pacing equilibrium (FPPE) is a model capturing budget-management mechanisms in first-price auctions. In certain practical settings such as advertising auctions, there is an interest in performing statistical inference over these models. A popular methodology for general statistical inference is the bootstrap procedure. Yet, for LFM and FPPE there is no existing theory for the valid application of bootstrap procedures. In this paper, we introduce and devise several statistically valid bootstrap inference procedures for LFM and FPPE. The most challenging part is to bootstrap general FPPE, which reduces to bootstrapping constrained M-estimators, a largely unexplored problem. We devise a bootstrap procedure for FPPE under mild degeneracy conditions by using the powerful tool of epi-convergence theory. Experiments with synthetic and s
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#33021;&#22815;&#36866;&#24212;&#21463;&#20020;&#26102;&#38480;&#21046;&#30340;&#31995;&#21015;&#30340;&#22810;&#20803;&#38408;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#31283;&#23450;&#12289;&#36941;&#21382;&#12289;&#24369;&#20381;&#36182;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#23545;&#21333;&#20301;&#26681;&#21644;&#21327;&#25972;&#24615;&#25552;&#20379;&#20102;&#22788;&#29702;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.06190</link><description>&lt;p&gt;
&#20020;&#26102;&#38480;&#21046;&#19982;&#26102;&#19981;&#26102;&#32422;&#26463;&#19979;&#30340;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Stationarity with Occasionally Binding Constraints. (arXiv:2307.06190v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06190
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#33021;&#22815;&#36866;&#24212;&#21463;&#20020;&#26102;&#38480;&#21046;&#30340;&#31995;&#21015;&#30340;&#22810;&#20803;&#38408;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#31283;&#23450;&#12289;&#36941;&#21382;&#12289;&#24369;&#20381;&#36182;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#23545;&#21333;&#20301;&#26681;&#21644;&#21327;&#25972;&#24615;&#25552;&#20379;&#20102;&#22788;&#29702;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#22810;&#20803;&#38408;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#21363;&#34987;&#25130;&#23614;&#21644;&#24367;&#26354;&#30340;&#32467;&#26500;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;CKSVAR&#65289;&#65292;&#36825;&#31181;&#27169;&#22411;&#33021;&#22815;&#36866;&#24212;&#21463;&#20020;&#26102;&#38480;&#21046;&#30340;&#31995;&#21015;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#32452;&#28385;&#36275;CKSVAR&#29983;&#25104;&#30340;&#36807;&#31243;&#26159;&#31283;&#23450;&#12289;&#36941;&#21382;&#12289;&#24369;&#20381;&#36182;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#30340;&#26465;&#20214;&#30452;&#25509;&#19982;&#27169;&#22411;&#30340;&#30830;&#23450;&#24615;&#37096;&#20998;&#30340;&#31283;&#23450;&#24615;&#30456;&#20851;&#65292;&#22240;&#27492;&#27604;&#19968;&#33324;&#21521;&#37327;&#38408;&#20540;&#33258;&#22238;&#24402;&#65288;VTAR&#65289;&#27169;&#22411;&#36890;&#24120;&#21487;&#29992;&#30340;&#26465;&#20214;&#26356;&#20026;&#20445;&#23432;&#12290;&#34429;&#28982;&#25105;&#20204;&#30340;&#26631;&#20934;&#28041;&#21450;&#35745;&#31639;&#19981;&#21487;&#34892;&#30340;&#25968;&#37327;&#65292;&#22914;&#32852;&#21512;&#35889;&#21322;&#24452;&#30340;&#25913;&#36827;&#65292;&#20294;&#23427;&#20204;&#21487;&#20197;&#36890;&#36807;&#25968;&#20540;&#36924;&#36817;&#20197;&#39640;&#24230;&#31934;&#30830;&#24230;&#35745;&#31639;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#36824;&#20801;&#35768;&#25105;&#20204;&#23545;CKSVAR&#20013;&#30340;&#21333;&#20301;&#26681;&#21644;&#21327;&#25972;&#24615;&#36827;&#34892;&#22788;&#29702;&#65292;&#29305;&#21035;&#26159;&#22312;&#27169;&#22411;&#34987;&#37197;&#32622;&#20026;&#29983;&#25104;&#32447;&#24615;&#21327;&#25972;&#20851;&#31995;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a class of multivariate threshold autoregressive models, known as censored and kinked structural vector autoregressions (CKSVAR), which are notably able to accommodate series that are subject to occasionally binding constraints. We develop a set of sufficient conditions for the processes generated by a CKSVAR to be stationary, ergodic, and weakly dependent. Our conditions relate directly to the stability of the deterministic part of the model, and are therefore less conservative than those typically available for general vector threshold autoregressive (VTAR) models. Though our criteria refer to quantities, such as refinements of the joint spectral radius, that cannot feasibly be computed exactly, they can be approximated numerically to a high degree of precision. Our results also permit us to provide a treatment of unit roots and cointegration in the CKSVAR, for the case where the model is configured so as to generate linear cointegration.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#38750;&#32447;&#24615;&#21327;&#25972;&#24615;&#30340;&#32972;&#26223;&#19979;&#65292;&#25506;&#35752;&#20102;&#22312;&#26102;&#21464;&#32422;&#26463;&#19979;&#22914;&#20309;&#29983;&#25104;&#20849;&#21516;&#30340;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#38543;&#26426;&#36235;&#21183;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#20351;&#29992;&#34987;&#23457;&#26597;&#21644;&#24367;&#26354;&#30340;&#32467;&#26500;&#21270;VAR&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#23545;&#20110;&#26102;&#38388;&#24207;&#21015;&#21463;&#21040;&#38408;&#20540;&#22411;&#38750;&#32447;&#24615;&#24615;&#36136;&#24433;&#21709;&#30340;&#20840;&#38754;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2211.09604</link><description>&lt;p&gt;
&#26102;&#21464;&#32422;&#26463;&#19979;&#30340;&#21327;&#25972;&#24615;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Cointegration with Occasionally Binding Constraints. (arXiv:2211.09604v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.09604
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#38750;&#32447;&#24615;&#21327;&#25972;&#24615;&#30340;&#32972;&#26223;&#19979;&#65292;&#25506;&#35752;&#20102;&#22312;&#26102;&#21464;&#32422;&#26463;&#19979;&#22914;&#20309;&#29983;&#25104;&#20849;&#21516;&#30340;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#38543;&#26426;&#36235;&#21183;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#20351;&#29992;&#34987;&#23457;&#26597;&#21644;&#24367;&#26354;&#30340;&#32467;&#26500;&#21270;VAR&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#23545;&#20110;&#26102;&#38388;&#24207;&#21015;&#21463;&#21040;&#38408;&#20540;&#22411;&#38750;&#32447;&#24615;&#24615;&#36136;&#24433;&#21709;&#30340;&#20840;&#38754;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38750;&#32447;&#24615;&#21327;&#25972;&#24615;&#30340;&#25991;&#29486;&#20013;&#65292;&#19968;&#20010;&#38271;&#26399;&#30340;&#24748;&#32780;&#26410;&#20915;&#38382;&#39064;&#26159;&#20851;&#20110;&#65288;&#38750;&#32447;&#24615;&#65289;&#21521;&#37327;&#33258;&#22238;&#24402;&#22914;&#20309;&#22312;&#26102;&#38388;&#24207;&#21015;&#30340;&#30701;&#26399;&#21644;&#38271;&#26399;&#21160;&#21147;&#23398;&#30340;&#32479;&#19968;&#25551;&#36848;&#20013;&#29983;&#25104;&#8220;&#38750;&#32447;&#24615;&#21327;&#25972;&#24615;&#8221;&#65292;&#21363;&#36825;&#20123;&#24207;&#21015;&#20849;&#20139;&#20849;&#21516;&#30340;&#38750;&#32447;&#24615;&#38543;&#26426;&#36235;&#21183;&#12290;&#25105;&#20204;&#22312;&#34987;&#23457;&#26597;&#21644;&#24367;&#26354;&#30340;&#32467;&#26500;&#21270;VAR&#27169;&#22411;&#65288;CKSVAR&#65289;&#30340;&#32972;&#26223;&#19979;&#32771;&#34385;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#28789;&#27963;&#20294;&#26131;&#20110;&#22788;&#29702;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#24314;&#27169;&#21463;&#38408;&#20540;&#22411;&#38750;&#32447;&#24615;&#24615;&#36136;&#24433;&#21709;&#30340;&#26102;&#38388;&#24207;&#21015;&#65292;&#20363;&#22914;&#30001;&#20110;&#20598;&#23572;&#20986;&#29616;&#30340;&#32422;&#26463;&#25152;&#23548;&#33268;&#30340;&#38646;&#19979;&#38480;&#65288;ZLB&#65289;&#12290;&#25105;&#20204;&#36890;&#36807;&#21333;&#20301;&#26681;&#21644;&#23545;&#36890;&#24120;&#31209;&#26465;&#20214;&#30340;&#36866;&#24403;&#25512;&#24191;&#65292;&#25552;&#20379;&#20102;&#36825;&#19968;&#27169;&#22411;&#20013;&#22914;&#20309;&#20135;&#29983;&#20849;&#21516;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#38543;&#26426;&#36235;&#21183;&#30340;&#23436;&#25972;&#29305;&#24449;&#25551;&#36848;&#65292;&#36825;&#26159;&#36804;&#20170;&#20026;&#27490;&#23545;Granger-J&#30340;&#31532;&#19968;&#27425;&#25193;&#23637;
&lt;/p&gt;
&lt;p&gt;
In the literature on nonlinear cointegration, a long-standing open problem relates to how a (nonlinear) vector autoregression, which provides a unified description of the short- and long-run dynamics of a collection of time series, can generate 'nonlinear cointegration' in the profound sense of those series sharing common nonlinear stochastic trends. We consider this problem in the setting of the censored and kinked structural VAR (CKSVAR), which provides a flexible yet tractable framework within which to model time series that are subject to threshold-type nonlinearities, such as those arising due to occasionally binding constraints, of which the zero lower bound (ZLB) on short-term nominal interest rates provides a leading example. We provide a complete characterisation of how common linear and {nonlinear stochastic trends may be generated in this model, via unit roots and appropriate generalisations of the usual rank conditions, providing the first extension to date of the Granger-J
&lt;/p&gt;</description></item></channel></rss>