<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#36890;&#36807;&#35782;&#21035;&#19968;&#20010;&#29983;&#25104;&#32593;&#32476;&#27169;&#22411;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#35774;&#32622;&#65292;IPF&#21487;&#20197;&#24674;&#22797;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65292;&#25581;&#31034;&#20102;&#20851;&#20110;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#20351;&#29992;IPF&#30340;&#38544;&#21547;&#20551;&#35774;&#65292;&#24182;&#21487;&#20197;&#20026;IPF&#30340;&#21442;&#25968;&#20272;&#35745;&#25552;&#20379;&#32467;&#26500;&#30456;&#20851;&#30340;&#35823;&#24046;&#30028;&#12290;</title><link>https://arxiv.org/abs/2402.18697</link><description>&lt;p&gt;
&#20174;&#36793;&#38469;&#25512;&#26029;&#21160;&#24577;&#32593;&#32476;&#30340;&#26041;&#27861;&#65306;&#36845;&#20195;&#27604;&#20363;&#25311;&#21512;
&lt;/p&gt;
&lt;p&gt;
Inferring Dynamic Networks from Marginals with Iterative Proportional Fitting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18697
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35782;&#21035;&#19968;&#20010;&#29983;&#25104;&#32593;&#32476;&#27169;&#22411;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#35774;&#32622;&#65292;IPF&#21487;&#20197;&#24674;&#22797;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65292;&#25581;&#31034;&#20102;&#20851;&#20110;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#20351;&#29992;IPF&#30340;&#38544;&#21547;&#20551;&#35774;&#65292;&#24182;&#21487;&#20197;&#20026;IPF&#30340;&#21442;&#25968;&#20272;&#35745;&#25552;&#20379;&#32467;&#26500;&#30456;&#20851;&#30340;&#35823;&#24046;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26469;&#33258;&#29616;&#23454;&#25968;&#25454;&#32422;&#26463;&#30340;&#24120;&#35265;&#32593;&#32476;&#25512;&#26029;&#38382;&#39064;&#26159;&#22914;&#20309;&#20174;&#26102;&#38388;&#32858;&#21512;&#30340;&#37051;&#25509;&#30697;&#38453;&#21644;&#26102;&#38388;&#21464;&#21270;&#36793;&#38469;&#65288;&#21363;&#34892;&#21521;&#37327;&#21644;&#21015;&#21521;&#37327;&#20043;&#21644;&#65289;&#25512;&#26029;&#21160;&#24577;&#32593;&#32476;&#12290;&#20808;&#21069;&#30340;&#26041;&#27861;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#37325;&#26032;&#21033;&#29992;&#20102;&#32463;&#20856;&#30340;&#36845;&#20195;&#27604;&#20363;&#25311;&#21512;&#65288;IPF&#65289;&#36807;&#31243;&#65292;&#20063;&#31216;&#20026;Sinkhorn&#31639;&#27861;&#65292;&#24182;&#21462;&#24471;&#20102;&#20196;&#20154;&#28385;&#24847;&#30340;&#32463;&#39564;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#20351;&#29992;IPF&#30340;&#32479;&#35745;&#22522;&#30784;&#23578;&#26410;&#24471;&#21040;&#24456;&#22909;&#30340;&#29702;&#35299;&#65306;&#22312;&#20160;&#20040;&#24773;&#20917;&#19979;&#65292;IPF&#25552;&#20379;&#20102;&#20174;&#36793;&#38469;&#20934;&#30830;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#30340;&#21407;&#21017;&#24615;&#65292;&#20197;&#21450;&#23427;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#20272;&#35745;&#20102;&#32593;&#32476;&#65311;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#36825;&#26679;&#19968;&#20010;&#35774;&#32622;&#65292;&#36890;&#36807;&#35782;&#21035;&#19968;&#20010;&#29983;&#25104;&#32593;&#32476;&#27169;&#22411;&#65292;IPF&#21487;&#20197;&#24674;&#22797;&#20854;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#25581;&#31034;&#20102;&#20851;&#20110;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#20351;&#29992;IPF&#30340;&#38544;&#21547;&#20551;&#35774;&#65292;&#24182;&#20351;&#24471;&#21487;&#20197;&#36827;&#34892;&#26032;&#30340;&#20998;&#26512;&#65292;&#22914;&#26377;&#20851;IPF&#21442;&#25968;&#20272;&#35745;&#30340;&#32467;&#26500;&#30456;&#20851;&#35823;&#24046;&#30028;&#12290;&#24403;IPF&#22833;&#36133;&#26102;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18697v1 Announce Type: cross  Abstract: A common network inference problem, arising from real-world data constraints, is how to infer a dynamic network from its time-aggregated adjacency matrix and time-varying marginals (i.e., row and column sums). Prior approaches to this problem have repurposed the classic iterative proportional fitting (IPF) procedure, also known as Sinkhorn's algorithm, with promising empirical results. However, the statistical foundation for using IPF has not been well understood: under what settings does IPF provide principled estimation of a dynamic network from its marginals, and how well does it estimate the network? In this work, we establish such a setting, by identifying a generative network model whose maximum likelihood estimates are recovered by IPF. Our model both reveals implicit assumptions on the use of IPF in such settings and enables new analyses, such as structure-dependent error bounds on IPF's parameter estimates. When IPF fails to c
&lt;/p&gt;</description></item></channel></rss>