<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#38750;&#21442;&#25968;&#20998;&#25968;&#26469;&#33258;&#36866;&#24212;&#36873;&#25321;&#36866;&#29992;&#20110;&#20219;&#24847;&#39640;&#26031;&#22122;&#22768;&#30340;ICA&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#29305;&#24449;&#20989;&#25968;&#35780;&#20272;&#20272;&#35745;&#30340;&#28151;&#21512;&#30697;&#38453;&#36136;&#37327;&#65292;&#26080;&#38656;&#20102;&#35299;&#22122;&#22768;&#20998;&#24067;&#21442;&#25968;&#12290;</title><link>https://arxiv.org/abs/2401.08468</link><description>&lt;p&gt;
&#20445;&#30041;&#36824;&#26159;&#20002;&#24323;&#65311;&#19968;&#31181;&#35780;&#20272;&#26377;&#22122;&#22768;ICA&#35299;&#20915;&#26041;&#26696;&#30340;&#38750;&#21442;&#25968;&#20998;&#25968;
&lt;/p&gt;
&lt;p&gt;
Keep or toss? A nonparametric score to evaluate solutions for noisy ICA
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.08468
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#38750;&#21442;&#25968;&#20998;&#25968;&#26469;&#33258;&#36866;&#24212;&#36873;&#25321;&#36866;&#29992;&#20110;&#20219;&#24847;&#39640;&#26031;&#22122;&#22768;&#30340;ICA&#31639;&#27861;&#65292;&#24182;&#36890;&#36807;&#29305;&#24449;&#20989;&#25968;&#35780;&#20272;&#20272;&#35745;&#30340;&#28151;&#21512;&#30697;&#38453;&#36136;&#37327;&#65292;&#26080;&#38656;&#20102;&#35299;&#22122;&#22768;&#20998;&#24067;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29420;&#31435;&#20998;&#37327;&#20998;&#26512;&#65288;ICA&#65289;&#20110;20&#19990;&#32426;80&#24180;&#20195;&#24341;&#20837;&#65292;&#20316;&#20026;&#30450;&#28304;&#20998;&#31163;&#65288;BSS&#65289;&#30340;&#27169;&#22411;&#65292;&#25351;&#30340;&#26159;&#22312;&#23545;&#28151;&#21512;&#20449;&#21495;&#36827;&#34892;&#24674;&#22797;&#26102;&#65292;&#23545;&#28304;&#20449;&#21495;&#25110;&#28151;&#21512;&#36807;&#31243;&#20102;&#35299;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#30340;&#36807;&#31243;&#12290;&#23613;&#31649;&#26377;&#35768;&#22810;&#31934;&#23494;&#31639;&#27861;&#36827;&#34892;&#20272;&#35745;&#65292;&#20294;&#19981;&#21516;&#26041;&#27861;&#23384;&#22312;&#19981;&#21516;&#30340;&#32570;&#28857;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#20998;&#25968;&#65292;&#29992;&#20110;&#33258;&#36866;&#24212;&#22320;&#36873;&#25321;ICA&#31639;&#27861;&#21644;&#20219;&#24847;&#39640;&#26031;&#22122;&#22768;&#12290;&#35813;&#20998;&#25968;&#30340;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#65292;&#23427;&#21482;&#20551;&#35774;&#25968;&#25454;&#20855;&#26377;&#26377;&#38480;&#30340;&#20108;&#38454;&#30697;&#65292;&#24182;&#20351;&#29992;&#29305;&#24449;&#20989;&#25968;&#26469;&#35780;&#20272;&#20272;&#35745;&#30340;&#28151;&#21512;&#30697;&#38453;&#30340;&#36136;&#37327;&#65292;&#32780;&#26080;&#38656;&#20102;&#35299;&#22122;&#22768;&#20998;&#24067;&#30340;&#21442;&#25968;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20123;&#26032;&#30340;&#23545;&#27604;&#20989;&#25968;&#21644;&#31639;&#27861;&#65292;&#23427;&#20204;&#20855;&#26377;&#19982;&#29616;&#26377;&#31639;&#27861;&#65288;&#22914;FASTICA&#21644;JADE&#65289;&#30456;&#21516;&#30340;&#24555;&#36895;&#35745;&#31639;&#24615;&#33021;&#65292;&#20294;&#22312;&#21069;&#32773;&#21487;&#33021;&#22833;&#36133;&#30340;&#39046;&#22495;&#20013;&#24037;&#20316;&#12290;&#23613;&#31649;&#36825;&#20123;&#26041;&#27861;&#20063;&#21487;&#33021;&#23384;&#22312;&#32570;&#28857;&#65292;
&lt;/p&gt;
&lt;p&gt;
Independent Component Analysis (ICA) was introduced in the 1980's as a model for Blind Source Separation (BSS), which refers to the process of recovering the sources underlying a mixture of signals, with little knowledge about the source signals or the mixing process. While there are many sophisticated algorithms for estimation, different methods have different shortcomings. In this paper, we develop a nonparametric score to adaptively pick the right algorithm for ICA with arbitrary Gaussian noise. The novelty of this score stems from the fact that it just assumes a finite second moment of the data and uses the characteristic function to evaluate the quality of the estimated mixing matrix without any knowledge of the parameters of the noise distribution. In addition, we propose some new contrast functions and algorithms that enjoy the same fast computability as existing algorithms like FASTICA and JADE but work in domains where the former may fail. While these also may have weaknesses,
&lt;/p&gt;</description></item></channel></rss>