<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#25506;&#32034;&#22312;&#33021;&#22815;&#36827;&#34892;&#26799;&#24230;&#24179;&#34892;&#35780;&#20272;&#30340;&#26694;&#26550;&#20013;&#30340;&#25277;&#26679;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#24182;&#34892;&#21270;&#30340;&#38543;&#26426;&#20013;&#28857;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#26032;&#25216;&#26415;&#23548;&#20986;&#20102;&#23545;&#25277;&#26679;&#21644;&#30446;&#26631;&#23494;&#24230;&#20043;&#38388;Wasserstein&#36317;&#31163;&#30340;&#19978;&#30028;&#65292;&#37327;&#21270;&#20102;&#24182;&#34892;&#22788;&#29702;&#21333;&#20803;&#24102;&#26469;&#30340;&#36816;&#34892;&#26102;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2402.14434</link><description>&lt;p&gt;
&#24182;&#34892;&#20013;&#28857;&#38543;&#26426;&#21270;&#30340; Langevin Monte Carlo
&lt;/p&gt;
&lt;p&gt;
Parallelized Midpoint Randomization for Langevin Monte Carlo
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14434
&lt;/p&gt;
&lt;p&gt;
&#25506;&#32034;&#22312;&#33021;&#22815;&#36827;&#34892;&#26799;&#24230;&#24179;&#34892;&#35780;&#20272;&#30340;&#26694;&#26550;&#20013;&#30340;&#25277;&#26679;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#24182;&#34892;&#21270;&#30340;&#38543;&#26426;&#20013;&#28857;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#26032;&#25216;&#26415;&#23548;&#20986;&#20102;&#23545;&#25277;&#26679;&#21644;&#30446;&#26631;&#23494;&#24230;&#20043;&#38388;Wasserstein&#36317;&#31163;&#30340;&#19978;&#30028;&#65292;&#37327;&#21270;&#20102;&#24182;&#34892;&#22788;&#29702;&#21333;&#20803;&#24102;&#26469;&#30340;&#36816;&#34892;&#26102;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#21487;&#20197;&#36827;&#34892;&#26799;&#24230;&#30340;&#24179;&#34892;&#35780;&#20272;&#30340;&#26694;&#26550;&#20013;&#30340;&#25277;&#26679;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#37325;&#28857;&#25918;&#22312;&#30001;&#24179;&#28369;&#21644;&#24378;log-&#20985;&#23494;&#24230;&#34920;&#24449;&#30340;&#30446;&#26631;&#20998;&#24067;&#19978;&#12290;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#24182;&#34892;&#21270;&#30340;&#38543;&#26426;&#20013;&#28857;&#26041;&#27861;&#65292;&#24182;&#36816;&#29992;&#26368;&#36817;&#24320;&#21457;&#29992;&#20110;&#20998;&#26512;&#20854;&#32431;&#39034;&#24207;&#29256;&#26412;&#30340;&#35777;&#26126;&#25216;&#26415;&#12290;&#21033;&#29992;&#36825;&#20123;&#25216;&#26415;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#25277;&#26679;&#21644;&#30446;&#26631;&#23494;&#24230;&#20043;&#38388;&#30340;Wasserstein&#36317;&#31163;&#30340;&#19978;&#30028;&#12290;&#36825;&#20123;&#30028;&#38480;&#37327;&#21270;&#20102;&#36890;&#36807;&#21033;&#29992;&#24182;&#34892;&#22788;&#29702;&#21333;&#20803;&#25152;&#23454;&#29616;&#30340;&#36816;&#34892;&#26102;&#25913;&#36827;&#65292;&#36825;&#21487;&#33021;&#26159;&#30456;&#24403;&#21487;&#35266;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14434v1 Announce Type: cross  Abstract: We explore the sampling problem within the framework where parallel evaluations of the gradient of the log-density are feasible. Our investigation focuses on target distributions characterized by smooth and strongly log-concave densities. We revisit the parallelized randomized midpoint method and employ proof techniques recently developed for analyzing its purely sequential version. Leveraging these techniques, we derive upper bounds on the Wasserstein distance between the sampling and target densities. These bounds quantify the runtime improvement achieved by utilizing parallel processing units, which can be considerable.
&lt;/p&gt;</description></item></channel></rss>