<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#22522;&#20110;&#27169;&#22411;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#21709;&#24212;&#31867;&#22411;&#30340;&#22240;&#26524;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21033;&#29992;&#19981;&#21464;&#24615;&#20551;&#35774;&#20174;&#24322;&#36136;&#29615;&#22659;&#30340;&#25968;&#25454;&#20013;&#36755;&#20986;&#19968;&#37096;&#20998;&#22240;&#26524;&#29305;&#24449;&#30340;&#23376;&#38598;&#65292;&#36866;&#29992;&#20110;&#19968;&#33324;&#30340;&#21152;&#24615;&#22122;&#22768;&#27169;&#22411;&#21644;&#38750;&#21442;&#25968;&#35774;&#32622;&#65292;&#35299;&#20915;&#20102;&#38750;&#21442;&#25968;&#26465;&#20214;&#29420;&#31435;&#24615;&#27979;&#35797;&#20302;&#21151;&#29575;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.12833</link><description>&lt;p&gt;
&#22522;&#20110;&#27169;&#22411;&#30340;&#36890;&#29992;&#21709;&#24212;&#31867;&#22411;&#22240;&#26524;&#29305;&#24449;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Model-based causal feature selection for general response types. (arXiv:2309.12833v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12833
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22522;&#20110;&#27169;&#22411;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#21709;&#24212;&#31867;&#22411;&#30340;&#22240;&#26524;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21033;&#29992;&#19981;&#21464;&#24615;&#20551;&#35774;&#20174;&#24322;&#36136;&#29615;&#22659;&#30340;&#25968;&#25454;&#20013;&#36755;&#20986;&#19968;&#37096;&#20998;&#22240;&#26524;&#29305;&#24449;&#30340;&#23376;&#38598;&#65292;&#36866;&#29992;&#20110;&#19968;&#33324;&#30340;&#21152;&#24615;&#22122;&#22768;&#27169;&#22411;&#21644;&#38750;&#21442;&#25968;&#35774;&#32622;&#65292;&#35299;&#20915;&#20102;&#38750;&#21442;&#25968;&#26465;&#20214;&#29420;&#31435;&#24615;&#27979;&#35797;&#20302;&#21151;&#29575;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#21457;&#29616;&#22240;&#26524;&#20851;&#31995;&#26159;&#19968;&#39033;&#22522;&#26412;&#32780;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#22312;&#26576;&#20123;&#24212;&#29992;&#20013;&#65292;&#20165;&#23398;&#20064;&#32473;&#23450;&#21709;&#24212;&#21464;&#37327;&#30340;&#22240;&#26524;&#29305;&#24449;&#21487;&#33021;&#24050;&#32463;&#36275;&#22815;&#65292;&#32780;&#19981;&#26159;&#23398;&#20064;&#25972;&#20010;&#28508;&#22312;&#30340;&#22240;&#26524;&#32467;&#26500;&#12290;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#65288;ICP&#65289;&#26159;&#19968;&#31181;&#29992;&#20110;&#22240;&#26524;&#29305;&#24449;&#36873;&#25321;&#30340;&#26041;&#27861;&#65292;&#38656;&#35201;&#26469;&#33258;&#24322;&#36136;&#29615;&#22659;&#30340;&#25968;&#25454;&#12290;ICP&#20551;&#35774;&#20174;&#30452;&#25509;&#21407;&#22240;&#29983;&#25104;&#21709;&#24212;&#30340;&#26426;&#21046;&#22312;&#25152;&#26377;&#29615;&#22659;&#20013;&#37117;&#30456;&#21516;&#65292;&#24182;&#21033;&#29992;&#36825;&#31181;&#19981;&#21464;&#24615;&#36755;&#20986;&#19968;&#37096;&#20998;&#22240;&#26524;&#29305;&#24449;&#30340;&#23376;&#38598;&#12290;ICP&#30340;&#26694;&#26550;&#24050;&#32463;&#25193;&#23637;&#21040;&#19968;&#33324;&#30340;&#21152;&#24615;&#22122;&#22768;&#27169;&#22411;&#21644;&#38750;&#21442;&#25968;&#35774;&#32622;&#65292;&#20351;&#29992;&#26465;&#20214;&#29420;&#31435;&#24615;&#27979;&#35797;&#12290;&#28982;&#32780;&#65292;&#38750;&#21442;&#25968;&#26465;&#20214;&#29420;&#31435;&#24615;&#27979;&#35797;&#32463;&#24120;&#21463;&#21040;&#20302;&#21151;&#29575;&#65288;&#25110;&#36739;&#24046;&#30340;&#31867;&#22411;I&#38169;&#35823;&#25511;&#21046;&#65289;&#30340;&#22256;&#25200;&#65292;&#24182;&#19988;&#19978;&#36848;&#21442;&#25968;&#27169;&#22411;&#19981;&#36866;&#29992;&#20110;&#21709;&#24212;&#19981;&#26159;&#22312;&#36830;&#32493;&#21051;&#24230;&#19978;&#27979;&#37327;&#30340;&#24212;&#29992;&#24773;&#20917;&#65292;&#32780;&#26159;&#21453;&#26144;&#20102;&#20998;&#31867;&#20449;&#24687;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
Discovering causal relationships from observational data is a fundamental yet challenging task. In some applications, it may suffice to learn the causal features of a given response variable, instead of learning the entire underlying causal structure. Invariant causal prediction (ICP, Peters et al., 2016) is a method for causal feature selection which requires data from heterogeneous settings. ICP assumes that the mechanism for generating the response from its direct causes is the same in all settings and exploits this invariance to output a subset of the causal features. The framework of ICP has been extended to general additive noise models and to nonparametric settings using conditional independence testing. However, nonparametric conditional independence testing often suffers from low power (or poor type I error control) and the aforementioned parametric models are not suitable for applications in which the response is not measured on a continuous scale, but rather reflects categor
&lt;/p&gt;</description></item></channel></rss>