<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#22312;&#22238;&#24402;&#35774;&#32622;&#19979;&#32473;&#20986;&#20102;Mondrian&#38543;&#26426;&#26862;&#26519;&#30340;&#20272;&#35745;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#21644;&#21435;&#20559;&#36807;&#31243;&#65292;&#20351;&#20854;&#33021;&#22815;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#21644;&#23454;&#29616;&#26368;&#23567;&#26497;&#22823;&#20272;&#35745;&#36895;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.09702</link><description>&lt;p&gt;
&#24102;&#26377;Mondrian&#38543;&#26426;&#26862;&#26519;&#30340;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Inference with Mondrian Random Forests. (arXiv:2310.09702v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09702
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#22238;&#24402;&#35774;&#32622;&#19979;&#32473;&#20986;&#20102;Mondrian&#38543;&#26426;&#26862;&#26519;&#30340;&#20272;&#35745;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#21644;&#21435;&#20559;&#36807;&#31243;&#65292;&#20351;&#20854;&#33021;&#22815;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#21644;&#23454;&#29616;&#26368;&#23567;&#26497;&#22823;&#20272;&#35745;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#26862;&#26519;&#26159;&#19968;&#31181;&#24120;&#29992;&#30340;&#20998;&#31867;&#21644;&#22238;&#24402;&#26041;&#27861;&#65292;&#22312;&#26368;&#36817;&#20960;&#24180;&#20013;&#25552;&#20986;&#20102;&#35768;&#22810;&#19981;&#21516;&#30340;&#21464;&#20307;&#12290;&#19968;&#20010;&#26377;&#36259;&#30340;&#20363;&#23376;&#26159;Mondrian&#38543;&#26426;&#26862;&#26519;&#65292;&#20854;&#20013;&#24213;&#23618;&#26641;&#26159;&#26681;&#25454;Mondrian&#36807;&#31243;&#26500;&#24314;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;Mondrian&#38543;&#26426;&#26862;&#26519;&#22312;&#22238;&#24402;&#35774;&#32622;&#19979;&#30340;&#20272;&#35745;&#30340;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#12290;&#24403;&#19982;&#20559;&#24046;&#34920;&#24449;&#21644;&#19968;&#33268;&#26041;&#24046;&#20272;&#35745;&#22120;&#30456;&#32467;&#21512;&#26102;&#65292;&#36825;&#20801;&#35768;&#36827;&#34892;&#28176;&#36817;&#26377;&#25928;&#30340;&#32479;&#35745;&#25512;&#26029;&#65292;&#22914;&#26500;&#24314;&#32622;&#20449;&#21306;&#38388;&#65292;&#23545;&#26410;&#30693;&#30340;&#22238;&#24402;&#20989;&#25968;&#36827;&#34892;&#25512;&#26029;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#21435;&#20559;&#36807;&#31243;&#65292;&#29992;&#20110;Mondrian&#38543;&#26426;&#26862;&#26519;&#65292;&#20351;&#20854;&#33021;&#22815;&#22312;&#36866;&#24403;&#30340;&#21442;&#25968;&#35843;&#25972;&#19979;&#23454;&#29616;$\beta$-H\"older&#22238;&#24402;&#20989;&#25968;&#30340;&#26368;&#23567;&#26497;&#22823;&#20272;&#35745;&#36895;&#29575;&#65292;&#23545;&#20110;&#25152;&#26377;&#30340;$\beta$&#21644;&#20219;&#24847;&#32500;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Random forests are popular methods for classification and regression, and many different variants have been proposed in recent years. One interesting example is the Mondrian random forest, in which the underlying trees are constructed according to a Mondrian process. In this paper we give a central limit theorem for the estimates made by a Mondrian random forest in the regression setting. When combined with a bias characterization and a consistent variance estimator, this allows one to perform asymptotically valid statistical inference, such as constructing confidence intervals, on the unknown regression function. We also provide a debiasing procedure for Mondrian random forests which allows them to achieve minimax-optimal estimation rates with $\beta$-H\"older regression functions, for all $\beta$ and in arbitrary dimension, assuming appropriate parameter tuning.
&lt;/p&gt;</description></item></channel></rss>