<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#22312;&#35813;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#26391;&#20043;&#20961;&#25193;&#25955;&#21644;&#26410;&#35843;&#25972;&#26391;&#20043;&#20961;&#31639;&#27861;&#20013;&#38543;&#26426;&#21464;&#37327;&#29420;&#31435;&#21270;&#36895;&#29575;&#30340;&#25910;&#25947;&#24615;&#65292;&#35777;&#26126;&#20102;&#22312;&#30446;&#26631;&#20989;&#25968;&#24378;&#23545;&#25968;&#20985;&#21644;&#24179;&#28369;&#30340;&#24773;&#20917;&#19979;&#65292;&#20114;&#20449;&#24687;&#20250;&#20197;&#25351;&#25968;&#36895;&#29575;&#25910;&#25947;&#20110;$0$&#12290;</title><link>https://arxiv.org/abs/2402.17067</link><description>&lt;p&gt;
&#20851;&#20110;&#26391;&#20043;&#20961;&#25193;&#25955;&#21644;&#26410;&#35843;&#25972;&#26391;&#20043;&#20961;&#31639;&#27861;&#20013;&#29420;&#31435;&#26679;&#26412;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Independent Samples Along the Langevin Diffusion and the Unadjusted Langevin Algorithm
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17067
&lt;/p&gt;
&lt;p&gt;
&#22312;&#35813;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#26391;&#20043;&#20961;&#25193;&#25955;&#21644;&#26410;&#35843;&#25972;&#26391;&#20043;&#20961;&#31639;&#27861;&#20013;&#38543;&#26426;&#21464;&#37327;&#29420;&#31435;&#21270;&#36895;&#29575;&#30340;&#25910;&#25947;&#24615;&#65292;&#35777;&#26126;&#20102;&#22312;&#30446;&#26631;&#20989;&#25968;&#24378;&#23545;&#25968;&#20985;&#21644;&#24179;&#28369;&#30340;&#24773;&#20917;&#19979;&#65292;&#20114;&#20449;&#24687;&#20250;&#20197;&#25351;&#25968;&#36895;&#29575;&#25910;&#25947;&#20110;$0$&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#39532;&#23572;&#21487;&#22827;&#38142;&#20013;&#21021;&#22987;&#21644;&#24403;&#21069;&#38543;&#26426;&#21464;&#37327;&#29420;&#31435;&#21270;&#30340;&#36895;&#29575;&#65292;&#37325;&#28857;&#20851;&#27880;&#36830;&#32493;&#26102;&#38388;&#20013;&#30340;&#26391;&#20043;&#20961;&#25193;&#25955;&#21644;&#31163;&#25955;&#26102;&#38388;&#20013;&#30340;&#26410;&#35843;&#25972;&#26391;&#20043;&#20961;&#31639;&#27861;&#65288;ULA&#65289;&#12290;&#25105;&#20204;&#36890;&#36807;&#23427;&#20204;&#30340;&#20114;&#20449;&#24687;&#24230;&#37327;&#38543;&#26426;&#21464;&#37327;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#23545;&#20110;&#26391;&#20043;&#20961;&#25193;&#25955;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#24403;&#30446;&#26631;&#20989;&#25968;&#24378;&#23545;&#25968;&#20985;&#26102;&#65292;&#20114;&#20449;&#24687;&#20197;&#25351;&#25968;&#36895;&#29575;&#25910;&#25947;&#20110;$0$&#65292;&#24403;&#30446;&#26631;&#20989;&#25968;&#24369;&#23545;&#25968;&#20985;&#26102;&#65292;&#20197;&#22810;&#39033;&#24335;&#36895;&#29575;&#25910;&#25947;&#12290;&#36825;&#20123;&#36895;&#29575;&#31867;&#20284;&#20110;&#22312;&#31867;&#20284;&#26465;&#20214;&#19979;&#26391;&#20043;&#20961;&#25193;&#25955;&#30340;&#28151;&#21512;&#26102;&#38388;&#12290;&#23545;&#20110;ULA&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#24403;&#30446;&#26631;&#20989;&#25968;&#24378;&#23545;&#25968;&#20985;&#19988;&#20809;&#28369;&#26102;&#65292;&#20114;&#20449;&#24687;&#20197;&#25351;&#25968;&#36895;&#29575;&#25910;&#25947;&#20110;$0$&#12290;&#25105;&#20204;&#36890;&#36807;&#21457;&#23637;&#36825;&#20123;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#20114;&#20449;&#24687;&#29256;&#26412;&#30340;&#28151;&#21512;&#26102;&#38388;&#20998;&#26512;&#26469;&#35777;&#26126;&#25105;&#20204;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#22522;&#20110;&#26391;&#20043;&#20961;&#25193;&#25955;&#30340;&#24378;&#25968;&#25454;&#22788;&#29702;&#19981;&#31561;&#24335;&#30340;&#26367;&#20195;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17067v1 Announce Type: cross  Abstract: We study the rate at which the initial and current random variables become independent along a Markov chain, focusing on the Langevin diffusion in continuous time and the Unadjusted Langevin Algorithm (ULA) in discrete time. We measure the dependence between random variables via their mutual information. For the Langevin diffusion, we show the mutual information converges to $0$ exponentially fast when the target is strongly log-concave, and at a polynomial rate when the target is weakly log-concave. These rates are analogous to the mixing time of the Langevin diffusion under similar assumptions. For the ULA, we show the mutual information converges to $0$ exponentially fast when the target is strongly log-concave and smooth. We prove our results by developing the mutual version of the mixing time analyses of these Markov chains. We also provide alternative proofs based on strong data processing inequalities for the Langevin diffusion 
&lt;/p&gt;</description></item></channel></rss>