<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#30340;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#35774;&#35745;&#65292;&#36890;&#36807;&#24066;&#22330;&#32454;&#20998;&#30340;&#26041;&#24335;&#22312;&#26356;&#22823;&#30340;&#24066;&#22330;&#20013;&#35782;&#21035;&#23376;&#24066;&#22330;&#65292;&#24182;&#22312;&#27599;&#20010;&#23376;&#24066;&#22330;&#19978;&#36827;&#34892;&#24182;&#34892;&#23454;&#39564;&#12290;</title><link>https://arxiv.org/abs/2402.07322</link><description>&lt;p&gt;
&#31532;&#19968;&#20215;&#25293;&#21334;&#22343;&#34913;&#20013;&#30340;&#24178;&#25200;&#65306;&#20559;&#24046;&#21644;&#26041;&#24046;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Interference Among First-Price Pacing Equilibria: A Bias and Variance Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07322
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#30340;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#35774;&#35745;&#65292;&#36890;&#36807;&#24066;&#22330;&#32454;&#20998;&#30340;&#26041;&#24335;&#22312;&#26356;&#22823;&#30340;&#24066;&#22330;&#20013;&#35782;&#21035;&#23376;&#24066;&#22330;&#65292;&#24182;&#22312;&#27599;&#20010;&#23376;&#24066;&#22330;&#19978;&#36827;&#34892;&#24182;&#34892;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20114;&#32852;&#32593;&#34892;&#19994;&#20013;&#65292;&#22312;&#32447;A/B&#27979;&#35797;&#34987;&#24191;&#27867;&#29992;&#20110;&#20915;&#31574;&#26032;&#21151;&#33021;&#30340;&#25512;&#20986;&#12290;&#28982;&#32780;&#23545;&#20110;&#22312;&#32447;&#24066;&#22330;&#65288;&#22914;&#24191;&#21578;&#24066;&#22330;&#65289;&#65292;&#26631;&#20934;&#30340;A/B&#27979;&#35797;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#32467;&#26524;&#20986;&#29616;&#20559;&#24046;&#65292;&#22240;&#20026;&#20080;&#23478;&#22312;&#39044;&#31639;&#32422;&#26463;&#19979;&#36816;&#20316;&#65292;&#35797;&#39564;&#32452;&#30340;&#39044;&#31639;&#28040;&#32791;&#20250;&#24433;&#21709;&#23545;&#29031;&#32452;&#30340;&#34920;&#29616;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#31181;&#24178;&#25200;&#65292;&#21487;&#20197;&#37319;&#29992;&#8220;&#39044;&#31639;&#20998;&#21106;&#35774;&#35745;&#8221;&#65292;&#21363;&#27599;&#20010;&#23454;&#39564;&#32452;&#37117;&#26377;&#19968;&#20010;&#29420;&#31435;&#30340;&#39044;&#31639;&#32422;&#26463;&#65292;&#24182;&#19988;&#27599;&#20010;&#23454;&#39564;&#32452;&#25509;&#25910;&#30456;&#31561;&#30340;&#39044;&#31639;&#20221;&#39069;&#65292;&#20174;&#32780;&#23454;&#29616;&#8220;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#8221;&#12290;&#23613;&#31649;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#26377;&#26126;&#26174;&#30340;&#20248;&#21183;&#65292;&#20294;&#24403;&#39044;&#31639;&#20998;&#21106;&#24471;&#22826;&#23567;&#26102;&#65292;&#24615;&#33021;&#20250;&#19979;&#38477;&#65292;&#38480;&#21046;&#20102;&#36825;&#31181;&#31995;&#32479;&#30340;&#24635;&#21534;&#21520;&#37327;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#30340;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#35774;&#35745;&#65292;&#36890;&#36807;&#24066;&#22330;&#32454;&#20998;&#30340;&#26041;&#24335;&#22312;&#26356;&#22823;&#30340;&#24066;&#22330;&#20013;&#35782;&#21035;&#23376;&#24066;&#22330;&#65292;&#24182;&#22312;&#27599;&#20010;&#23376;&#24066;&#22330;&#19978;&#36827;&#34892;&#24182;&#34892;&#23454;&#39564;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#22914;&#19979;&#65306;&#39318;&#20808;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#20998;&#26512;&#31532;&#19968;&#20215;&#25293;&#21334;&#30340;&#22343;&#34913;&#29366;&#20917;&#65292;&#25581;&#31034;&#20102;&#20854;&#20013;&#30340;&#20559;&#24046;&#21644;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Online A/B testing is widely used in the internet industry to inform decisions on new feature roll-outs. For online marketplaces (such as advertising markets), standard approaches to A/B testing may lead to biased results when buyers operate under a budget constraint, as budget consumption in one arm of the experiment impacts performance of the other arm. To counteract this interference, one can use a budget-split design where the budget constraint operates on a per-arm basis and each arm receives an equal fraction of the budget, leading to ``budget-controlled A/B testing.'' Despite clear advantages of budget-controlled A/B testing, performance degrades when budget are split too small, limiting the overall throughput of such systems. In this paper, we propose a parallel budget-controlled A/B testing design where we use market segmentation to identify submarkets in the larger market, and we run parallel experiments on each submarket.   Our contributions are as follows: First, we introdu
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#38789;&#30456;&#20851;&#25110;&#21487;&#20132;&#25442;&#38543;&#26426;&#23545;&#31216;&#30697;&#38453;&#30340;&#26032;&#38598;&#20013;&#19981;&#31561;&#24335;&#65292;&#36825;&#20123;&#19981;&#31561;&#24335;&#22312;&#22810;&#31181;&#23614;&#26465;&#20214;&#19979;&#25104;&#31435;&#65292;&#22312;&#27931;&#20234;&#32435;&#39034;&#24207;&#34920;&#31034;&#65292;&#24182;&#19988;&#26377;&#26102;&#22312;&#20219;&#24847;&#25968;&#25454;&#30456;&#20851;&#20572;&#27490;&#26102;&#38388;&#37117;&#36866;&#29992;&#12290;</title><link>http://arxiv.org/abs/2401.15567</link><description>&lt;p&gt;
&#30697;&#38453;&#36229;&#38789;&#21644;&#38543;&#26426;&#30697;&#38453;&#38598;&#20013;&#19981;&#31561;&#24335;
&lt;/p&gt;
&lt;p&gt;
Matrix Supermartingales and Randomized Matrix Concentration Inequalities. (arXiv:2401.15567v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15567
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#38789;&#30456;&#20851;&#25110;&#21487;&#20132;&#25442;&#38543;&#26426;&#23545;&#31216;&#30697;&#38453;&#30340;&#26032;&#38598;&#20013;&#19981;&#31561;&#24335;&#65292;&#36825;&#20123;&#19981;&#31561;&#24335;&#22312;&#22810;&#31181;&#23614;&#26465;&#20214;&#19979;&#25104;&#31435;&#65292;&#22312;&#27931;&#20234;&#32435;&#39034;&#24207;&#34920;&#31034;&#65292;&#24182;&#19988;&#26377;&#26102;&#22312;&#20219;&#24847;&#25968;&#25454;&#30456;&#20851;&#20572;&#27490;&#26102;&#38388;&#37117;&#36866;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#22810;&#31181;&#23614;&#26465;&#20214;&#19979;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#38789;&#30456;&#20851;&#25110;&#21487;&#20132;&#25442;&#38543;&#26426;&#23545;&#31216;&#30697;&#38453;&#30340;&#26032;&#38598;&#20013;&#19981;&#31561;&#24335;&#65292;&#21253;&#25324;&#26631;&#20934;&#30340;&#20999;&#23572;&#35834;&#22827;&#19978;&#30028;&#21644;&#33258;&#24402;&#19968;&#21270;&#37325;&#23614;&#35774;&#32622;&#12290;&#36825;&#20123;&#19981;&#31561;&#24335;&#36890;&#24120;&#20197;&#27931;&#20234;&#32435;&#39034;&#24207;&#34920;&#31034;&#65292;&#24182;&#19988;&#26377;&#26102;&#22312;&#20219;&#24847;&#25968;&#25454;&#30456;&#20851;&#20572;&#27490;&#26102;&#38388;&#37117;&#25104;&#31435;&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#30697;&#38453;&#36229;&#38789;&#21644;&#26497;&#20540;&#19981;&#31561;&#24335;&#30340;&#29702;&#35770;&#65292;&#21487;&#33021;&#20855;&#26377;&#29420;&#31435;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present new concentration inequalities for either martingale dependent or exchangeable random symmetric matrices under a variety of tail conditions, encompassing standard Chernoff bounds to self-normalized heavy-tailed settings. These inequalities are often randomized in a way that renders them strictly tighter than existing deterministic results in the literature, are typically expressed in the Loewner order, and are sometimes valid at arbitrary data-dependent stopping times.  Along the way, we explore the theory of matrix supermartingales and maximal inequalities, potentially of independent interest.
&lt;/p&gt;</description></item></channel></rss>