<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#20351;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GANs&#65289;&#20026;&#20219;&#20309;Copula&#29983;&#25104;&#20934;&#38543;&#26426;&#26679;&#26412;&#30340;&#39640;&#25928;&#26041;&#27861;</title><link>https://arxiv.org/abs/2403.05281</link><description>&lt;p&gt;
&#19968;&#31181;&#39640;&#25928;&#30340;&#29992;&#20110;Copulas&#30340;&#20934;&#38543;&#26426;&#25277;&#26679;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
An Efficient Quasi-Random Sampling for Copulas
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05281
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GANs&#65289;&#20026;&#20219;&#20309;Copula&#29983;&#25104;&#20934;&#38543;&#26426;&#26679;&#26412;&#30340;&#39640;&#25928;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#22312;&#33945;&#29305;&#21345;&#32599;&#35745;&#31639;&#20013;&#29992;&#20110;Copulas&#30340;&#39640;&#25928;&#20934;&#38543;&#26426;&#25277;&#26679;&#26041;&#27861;&#12290;&#20256;&#32479;&#26041;&#27861;&#22914;&#26465;&#20214;&#20998;&#24067;&#27861;&#65288;CDM&#65289;&#22312;&#22788;&#29702;&#39640;&#32500;&#25110;&#38544;&#24335;Copulas&#26102;&#23384;&#22312;&#23616;&#38480;&#24615;&#65292;&#25351;&#30340;&#26159;&#37027;&#20123;&#26080;&#27861;&#36890;&#36807;&#29616;&#26377;&#21442;&#25968;Copulas&#20934;&#30830;&#34920;&#31034;&#30340;Copulas&#12290;&#30456;&#21453;&#65292;&#26412;&#25991;&#25552;&#20986;&#20351;&#29992;&#29983;&#25104;&#27169;&#22411;&#65292;&#20363;&#22914;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GANs&#65289;&#65292;&#20026;&#20219;&#20309;Copula&#29983;&#25104;&#20934;&#38543;&#26426;&#26679;&#26412;&#12290;GANs&#26159;&#19968;&#31181;&#29992;&#20110;&#23398;&#20064;&#22797;&#26434;&#25968;&#25454;&#20998;&#24067;&#30340;&#38544;&#24335;&#29983;&#25104;&#27169;&#22411;&#65292;&#26377;&#21161;&#20110;&#31616;&#21270;&#25277;&#26679;&#36807;&#31243;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#65292;GANs&#34987;&#29992;&#26469;&#23398;&#20064;&#20174;&#22343;&#21248;&#20998;&#24067;&#21040;Copulas&#30340;&#26144;&#23556;&#12290;&#19968;&#26086;&#23398;&#20064;&#20102;&#36825;&#31181;&#26144;&#23556;&#65292;&#20174;Copula&#33719;&#21462;&#20934;&#38543;&#26426;&#26679;&#26412;&#21482;&#38656;&#36755;&#20837;&#26469;&#33258;&#22343;&#21248;&#20998;&#24067;&#30340;&#20934;&#38543;&#26426;&#26679;&#26412;&#12290;&#36825;&#31181;&#26041;&#27861;&#20026;&#20219;&#20309;Copula&#25552;&#20379;&#20102;&#26356;&#28789;&#27963;&#30340;&#26041;&#24335;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;t
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05281v1 Announce Type: new  Abstract: This paper examines an efficient method for quasi-random sampling of copulas in Monte Carlo computations. Traditional methods, like conditional distribution methods (CDM), have limitations when dealing with high-dimensional or implicit copulas, which refer to those that cannot be accurately represented by existing parametric copulas. Instead, this paper proposes the use of generative models, such as Generative Adversarial Networks (GANs), to generate quasi-random samples for any copula. GANs are a type of implicit generative models used to learn the distribution of complex data, thus facilitating easy sampling. In our study, GANs are employed to learn the mapping from a uniform distribution to copulas. Once this mapping is learned, obtaining quasi-random samples from the copula only requires inputting quasi-random samples from the uniform distribution. This approach offers a more flexible method for any copula. Additionally, we provide t
&lt;/p&gt;</description></item></channel></rss>