<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#20915;&#31574;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#36125;&#21494;&#26031;&#22238;&#24402;&#27169;&#22411;&#65292;&#21487;&#20197;&#24471;&#21040;&#27599;&#20010;&#26465;&#20214;&#20998;&#20301;&#25968;&#30340;&#26368;&#20339;&#21644;&#21487;&#35299;&#37322;&#30340;&#32447;&#24615;&#20272;&#35745;&#20540;&#21644;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#35813;&#26041;&#27861;&#26159;&#19968;&#31181;&#36866;&#29992;&#20110;&#29305;&#23450;&#20998;&#20301;&#25968;&#23376;&#38598;&#36873;&#25321;&#30340;&#26377;&#25928;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2311.02043</link><description>&lt;p&gt;
&#22522;&#20110;&#23376;&#38598;&#36873;&#25321;&#30340;&#36125;&#21494;&#26031;&#20998;&#20301;&#22238;&#24402;&#65306;&#21518;&#39564;&#24635;&#32467;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Bayesian Quantile Regression with Subset Selection: A Posterior Summarization Perspective. (arXiv:2311.02043v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.02043
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#20915;&#31574;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#36125;&#21494;&#26031;&#22238;&#24402;&#27169;&#22411;&#65292;&#21487;&#20197;&#24471;&#21040;&#27599;&#20010;&#26465;&#20214;&#20998;&#20301;&#25968;&#30340;&#26368;&#20339;&#21644;&#21487;&#35299;&#37322;&#30340;&#32447;&#24615;&#20272;&#35745;&#20540;&#21644;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#35813;&#26041;&#27861;&#26159;&#19968;&#31181;&#36866;&#29992;&#20110;&#29305;&#23450;&#20998;&#20301;&#25968;&#23376;&#38598;&#36873;&#25321;&#30340;&#26377;&#25928;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#20301;&#22238;&#24402;&#26159;&#19968;&#31181;&#24378;&#22823;&#30340;&#24037;&#20855;&#65292;&#29992;&#20110;&#25512;&#26029;&#21327;&#21464;&#37327;&#22914;&#20309;&#24433;&#21709;&#21709;&#24212;&#20998;&#24067;&#30340;&#29305;&#23450;&#20998;&#20301;&#25968;&#12290;&#29616;&#26377;&#26041;&#27861;&#35201;&#20040;&#20998;&#21035;&#20272;&#35745;&#27599;&#20010;&#24863;&#20852;&#36259;&#20998;&#20301;&#25968;&#30340;&#26465;&#20214;&#20998;&#20301;&#25968;&#65292;&#35201;&#20040;&#20351;&#29992;&#21322;&#21442;&#25968;&#25110;&#38750;&#21442;&#25968;&#27169;&#22411;&#20272;&#35745;&#25972;&#20010;&#26465;&#20214;&#20998;&#24067;&#12290;&#21069;&#32773;&#32463;&#24120;&#20135;&#29983;&#19981;&#36866;&#21512;&#23454;&#38469;&#25968;&#25454;&#30340;&#27169;&#22411;&#65292;&#24182;&#19988;&#19981;&#22312;&#20998;&#20301;&#25968;&#20043;&#38388;&#20849;&#20139;&#20449;&#24687;&#65292;&#32780;&#21518;&#32773;&#21017;&#20197;&#22797;&#26434;&#19988;&#21463;&#38480;&#21046;&#30340;&#27169;&#22411;&#20026;&#29305;&#28857;&#65292;&#38590;&#20197;&#35299;&#37322;&#21644;&#35745;&#31639;&#25928;&#29575;&#20302;&#19979;&#12290;&#27492;&#22806;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#19981;&#36866;&#21512;&#20110;&#29305;&#23450;&#20998;&#20301;&#25968;&#30340;&#23376;&#38598;&#36873;&#25321;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#20174;&#36125;&#21494;&#26031;&#20915;&#31574;&#20998;&#26512;&#30340;&#35282;&#24230;&#20986;&#21457;&#65292;&#25552;&#20986;&#20102;&#32447;&#24615;&#20998;&#20301;&#20272;&#35745;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#23376;&#38598;&#36873;&#25321;&#30340;&#22522;&#26412;&#38382;&#39064;&#12290;&#23545;&#20110;&#20219;&#20309;&#36125;&#21494;&#26031;&#22238;&#24402;&#27169;&#22411;&#65292;&#25105;&#20204;&#20026;&#27599;&#20010;&#22522;&#20110;&#27169;&#22411;&#30340;&#26465;&#20214;&#20998;&#20301;&#25968;&#25512;&#23548;&#20986;&#26368;&#20339;&#21644;&#21487;&#35299;&#37322;&#30340;&#32447;&#24615;&#20272;&#35745;&#20540;&#21644;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#24341;&#20837;&#20102;&#19968;&#31181;&#20998;&#20301;&#25968;&#32858;&#28966;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantile regression is a powerful tool for inferring how covariates affect specific percentiles of the response distribution. Existing methods either estimate conditional quantiles separately for each quantile of interest or estimate the entire conditional distribution using semi- or non-parametric models. The former often produce inadequate models for real data and do not share information across quantiles, while the latter are characterized by complex and constrained models that can be difficult to interpret and computationally inefficient. Further, neither approach is well-suited for quantile-specific subset selection. Instead, we pose the fundamental problems of linear quantile estimation, uncertainty quantification, and subset selection from a Bayesian decision analysis perspective. For any Bayesian regression model, we derive optimal and interpretable linear estimates and uncertainty quantification for each model-based conditional quantile. Our approach introduces a quantile-focu
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#25105;&#20204;&#21487;&#20197;&#35299;&#37322;&#26377;&#20851;&#20381;&#36182;&#36755;&#20837;&#30340;&#40657;&#31665;&#27169;&#22411;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#21512;&#29702;&#30340;&#20551;&#35774;&#19979;&#65292;&#38750;&#32447;&#24615;&#20989;&#25968;&#21487;&#20197;&#21807;&#19968;&#20998;&#35299;&#20026;&#27599;&#20010;&#21487;&#33021;&#23376;&#38598;&#30340;&#20989;&#25968;&#20043;&#21644;&#12290;&#36825;&#20010;&#26694;&#26550;&#26377;&#25928;&#22320;&#25512;&#24191;&#20102;Hoeffding&#20998;&#35299;&#65292;&#24182;&#25552;&#20379;&#20102;&#26032;&#39062;&#30340;&#21487;&#35299;&#37322;&#24615;&#25351;&#26631;&#12290;</title><link>http://arxiv.org/abs/2310.06567</link><description>&lt;p&gt;
&#36890;&#36807;Hoeffding&#20998;&#35299;&#30340;&#25512;&#24191;&#65292;&#29702;&#35299;&#26377;&#20851;&#20381;&#36182;&#36755;&#20837;&#30340;&#40657;&#31665;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Understanding black-box models with dependent inputs through a generalization of Hoeffding's decomposition. (arXiv:2310.06567v1 [math.FA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06567
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#25105;&#20204;&#21487;&#20197;&#35299;&#37322;&#26377;&#20851;&#20381;&#36182;&#36755;&#20837;&#30340;&#40657;&#31665;&#27169;&#22411;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#21512;&#29702;&#30340;&#20551;&#35774;&#19979;&#65292;&#38750;&#32447;&#24615;&#20989;&#25968;&#21487;&#20197;&#21807;&#19968;&#20998;&#35299;&#20026;&#27599;&#20010;&#21487;&#33021;&#23376;&#38598;&#30340;&#20989;&#25968;&#20043;&#21644;&#12290;&#36825;&#20010;&#26694;&#26550;&#26377;&#25928;&#22320;&#25512;&#24191;&#20102;Hoeffding&#20998;&#35299;&#65292;&#24182;&#25552;&#20379;&#20102;&#26032;&#39062;&#30340;&#21487;&#35299;&#37322;&#24615;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35299;&#37322;&#40657;&#31665;&#27169;&#22411;&#30340;&#20027;&#35201;&#25361;&#25112;&#20043;&#19968;&#26159;&#33021;&#22815;&#23558;&#38750;&#20114;&#19981;&#30456;&#20851;&#38543;&#26426;&#36755;&#20837;&#30340;&#24179;&#26041;&#21487;&#31215;&#20989;&#25968;&#21807;&#19968;&#20998;&#35299;&#20026;&#27599;&#20010;&#21487;&#33021;&#23376;&#38598;&#30340;&#20989;&#25968;&#20043;&#21644;&#12290;&#28982;&#32780;&#65292;&#22788;&#29702;&#36755;&#20837;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#21487;&#33021;&#24456;&#22797;&#26434;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#26469;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#65292;&#23558;&#19977;&#20010;&#25968;&#23398;&#39046;&#22495;&#32852;&#31995;&#36215;&#26469;&#65306;&#27010;&#29575;&#35770;&#12289;&#20989;&#25968;&#20998;&#26512;&#21644;&#32452;&#21512;&#25968;&#23398;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#36755;&#20837;&#19978;&#30340;&#20004;&#20010;&#21512;&#29702;&#20551;&#35774;&#19979;&#65288;&#38750;&#23436;&#32654;&#30340;&#20989;&#25968;&#20381;&#36182;&#24615;&#21644;&#38750;&#36864;&#21270;&#30340;&#38543;&#26426;&#20381;&#36182;&#24615;&#65289;&#65292;&#24635;&#26159;&#21487;&#20197;&#21807;&#19968;&#20998;&#35299;&#36825;&#26679;&#19968;&#20010;&#20989;&#25968;&#12290;&#36825;&#31181;&#8220;&#35268;&#33539;&#20998;&#35299;&#8221;&#30456;&#23545;&#30452;&#35266;&#65292;&#25581;&#31034;&#20102;&#38750;&#32447;&#24615;&#30456;&#20851;&#36755;&#20837;&#30340;&#38750;&#32447;&#24615;&#20989;&#25968;&#30340;&#32447;&#24615;&#29305;&#24615;&#12290;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#25105;&#20204;&#26377;&#25928;&#22320;&#25512;&#24191;&#20102;&#20247;&#25152;&#21608;&#30693;&#30340;Hoeffding&#20998;&#35299;&#65292;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#20010;&#29305;&#27530;&#24773;&#20917;&#12290;&#40657;&#31665;&#27169;&#22411;&#30340;&#26012;&#25237;&#24433;&#20026;&#26032;&#39062;&#30340;&#21487;&#35299;&#37322;&#24615;&#25351;&#26631;&#25552;&#20379;&#20102;&#21487;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
One of the main challenges for interpreting black-box models is the ability to uniquely decompose square-integrable functions of non-mutually independent random inputs into a sum of functions of every possible subset of variables. However, dealing with dependencies among inputs can be complicated. We propose a novel framework to study this problem, linking three domains of mathematics: probability theory, functional analysis, and combinatorics. We show that, under two reasonable assumptions on the inputs (non-perfect functional dependence and non-degenerate stochastic dependence), it is always possible to decompose uniquely such a function. This ``canonical decomposition'' is relatively intuitive and unveils the linear nature of non-linear functions of non-linearly dependent inputs. In this framework, we effectively generalize the well-known Hoeffding decomposition, which can be seen as a particular case. Oblique projections of the black-box model allow for novel interpretability indic
&lt;/p&gt;</description></item></channel></rss>