<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>Yurinskii&#30340;&#32806;&#21512;&#26041;&#27861;&#22312;$\ell^p$-&#33539;&#25968;&#19979;&#25552;&#20379;&#20102;&#26356;&#24369;&#26465;&#20214;&#19979;&#30340;&#36924;&#36817;&#39532;&#19969;&#26684;&#23572;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#26356;&#19968;&#33324;&#30340;&#39640;&#26031;&#28151;&#21512;&#20998;&#24067;&#65292;&#24182;&#25552;&#20379;&#20102;&#31532;&#19977;&#38454;&#32806;&#21512;&#26041;&#27861;&#20197;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#33719;&#24471;&#26356;&#32039;&#23494;&#30340;&#36924;&#36817;&#12290;</title><link>https://arxiv.org/abs/2210.00362</link><description>&lt;p&gt;
Yurinskii&#30340;&#39532;&#19969;&#26684;&#23572;&#32806;&#21512;
&lt;/p&gt;
&lt;p&gt;
Yurinskii's Coupling for Martingales
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2210.00362
&lt;/p&gt;
&lt;p&gt;
Yurinskii&#30340;&#32806;&#21512;&#26041;&#27861;&#22312;$\ell^p$-&#33539;&#25968;&#19979;&#25552;&#20379;&#20102;&#26356;&#24369;&#26465;&#20214;&#19979;&#30340;&#36924;&#36817;&#39532;&#19969;&#26684;&#23572;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#26356;&#19968;&#33324;&#30340;&#39640;&#26031;&#28151;&#21512;&#20998;&#24067;&#65292;&#24182;&#25552;&#20379;&#20102;&#31532;&#19977;&#38454;&#32806;&#21512;&#26041;&#27861;&#20197;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#33719;&#24471;&#26356;&#32039;&#23494;&#30340;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Yurinskii&#30340;&#32806;&#21512;&#26159;&#25968;&#23398;&#32479;&#35745;&#21644;&#24212;&#29992;&#27010;&#29575;&#20013;&#19968;&#31181;&#24120;&#29992;&#30340;&#38750;&#28176;&#36817;&#20998;&#24067;&#20998;&#26512;&#29702;&#35770;&#24037;&#20855;&#65292;&#25552;&#20379;&#20102;&#22312;&#26131;&#20110;&#39564;&#35777;&#26465;&#20214;&#19979;&#20855;&#26377;&#26174;&#24335;&#35823;&#24046;&#30028;&#38480;&#30340;&#39640;&#26031;&#24378;&#36924;&#36817;&#12290;&#26368;&#21021;&#22312;&#29420;&#31435;&#38543;&#26426;&#21521;&#37327;&#21644;&#20026;&#30340;$\ell^2$-&#33539;&#25968;&#20013;&#38472;&#36848;&#65292;&#26368;&#36817;&#24050;&#23558;&#20854;&#25193;&#23637;&#21040;$1 \leq p \leq \infty$&#26102;&#30340;$\ell^p$-&#33539;&#25968;&#65292;&#20197;&#21450;&#22312;&#26576;&#20123;&#24378;&#26465;&#20214;&#19979;&#30340;$\ell^2$-&#33539;&#25968;&#30340;&#21521;&#37327;&#20540;&#38789;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#22312;&#36828;&#27604;&#20043;&#21069;&#26045;&#21152;&#30340;&#26465;&#20214;&#26356;&#24369;&#30340;&#24773;&#20917;&#19979;&#65292;&#22312;$\ell^p$-&#33539;&#25968;&#19979;&#25552;&#20379;&#20102;&#36924;&#36817;&#39532;&#19969;&#26684;&#23572;&#30340;Yurinskii&#32806;&#21512;&#12290;&#25105;&#20204;&#30340;&#20844;&#24335;&#36827;&#19968;&#27493;&#20801;&#35768;&#32806;&#21512;&#21464;&#37327;&#36981;&#24490;&#26356;&#19968;&#33324;&#30340;&#39640;&#26031;&#28151;&#21512;&#20998;&#24067;&#65292;&#24182;&#19988;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31532;&#19977;&#38454;&#32806;&#21512;&#26041;&#27861;&#65292;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#25552;&#20379;&#26356;&#32039;&#23494;&#30340;&#36924;&#36817;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#19987;&#38376;&#24212;&#29992;&#20110;&#28151;&#21512;&#39532;&#19969;&#26684;&#23572;&#65292;&#39532;&#19969;&#26684;&#23572;&#21644;&#20854;&#20182;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2210.00362v2 Announce Type: replace-cross  Abstract: Yurinskii's coupling is a popular theoretical tool for non-asymptotic distributional analysis in mathematical statistics and applied probability, offering a Gaussian strong approximation with an explicit error bound under easily verified conditions. Originally stated in $\ell^2$-norm for sums of independent random vectors, it has recently been extended both to the $\ell^p$-norm, for $1 \leq p \leq \infty$, and to vector-valued martingales in $\ell^2$-norm, under some strong conditions. We present as our main result a Yurinskii coupling for approximate martingales in $\ell^p$-norm, under substantially weaker conditions than those previously imposed. Our formulation further allows for the coupling variable to follow a more general Gaussian mixture distribution, and we provide a novel third-order coupling method which gives tighter approximations in certain settings. We specialize our main result to mixingales, martingales, and in
&lt;/p&gt;</description></item></channel></rss>