<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>sGMC&#27169;&#22411;&#20316;&#20026;LASSO&#30340;&#38750;&#20984;&#27491;&#21017;&#21270;&#26367;&#20195;&#21697;&#65292;&#22312;&#20445;&#30041;LASSO&#27169;&#22411;&#20248;&#21183;&#30340;&#21516;&#26102;&#65292;&#20854;&#35299;&#38598;&#20960;&#20309;&#12289;&#35299;&#21807;&#19968;&#24615;&#21644;&#31232;&#30095;&#24615;&#19982;LASSO&#27169;&#22411;&#20855;&#26377;&#30456;&#20284;&#19988;&#20248;&#38597;&#30340;&#29305;&#24615;&#12290;</title><link>https://arxiv.org/abs/2311.18438</link><description>&lt;p&gt;
&#19968;&#20010;&#38750;&#20984;&#27491;&#21017;&#21270;&#20984;&#31232;&#30095;&#27169;&#22411;&#30340;&#35299;&#38598;&#20960;&#20309;&#19982;&#27491;&#21017;&#21270;&#36335;&#24452;
&lt;/p&gt;
&lt;p&gt;
Solution-Set Geometry and Regularization Path of a Nonconvexly Regularized Convex Sparse Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.18438
&lt;/p&gt;
&lt;p&gt;
sGMC&#27169;&#22411;&#20316;&#20026;LASSO&#30340;&#38750;&#20984;&#27491;&#21017;&#21270;&#26367;&#20195;&#21697;&#65292;&#22312;&#20445;&#30041;LASSO&#27169;&#22411;&#20248;&#21183;&#30340;&#21516;&#26102;&#65292;&#20854;&#35299;&#38598;&#20960;&#20309;&#12289;&#35299;&#21807;&#19968;&#24615;&#21644;&#31232;&#30095;&#24615;&#19982;LASSO&#27169;&#22411;&#20855;&#26377;&#30456;&#20284;&#19988;&#20248;&#38597;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#26497;&#23567;&#26497;&#22823;&#20985;&#65288;GMC&#65289;&#24809;&#32602;&#26159;&#19968;&#31181;&#38750;&#20984;&#31232;&#30095;&#27491;&#21017;&#21270;&#22120;&#65292;&#21487;&#20197;&#20445;&#25345;&#27491;&#21017;&#21270;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#30340;&#25972;&#20307;&#20984;&#24615;&#12290;&#26412;&#25991;&#20851;&#27880;GMC&#27169;&#22411;&#30340;&#19968;&#20010;&#37325;&#35201;&#23454;&#20363;&#65292;&#31216;&#20026;&#32553;&#25918;GMC&#65288;sGMC&#65289;&#65292;&#24182;&#23601;&#20854;&#35299;&#38598;&#20960;&#20309;&#21644;&#27491;&#21017;&#21270;&#36335;&#24452;&#25552;&#20986;&#21508;&#31181;&#26174;&#33879;&#21457;&#29616;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#34429;&#28982;sGMC&#24809;&#32602;&#26159;LASSO&#24809;&#32602;&#30340;&#38750;&#20984;&#25193;&#23637;&#65288;&#21363;$\ell_1$&#33539;&#25968;&#65289;&#65292;&#20294;sGMC&#27169;&#22411;&#20445;&#30041;&#20102;LASSO&#27169;&#22411;&#30340;&#35768;&#22810;&#33879;&#21517;&#29305;&#24615;&#65292;&#22240;&#27492;&#21487;&#20197;&#20316;&#20026;LASSO&#30340;&#19968;&#20010;&#20559;&#24046;&#36739;&#23567;&#30340;&#26367;&#20195;&#21697;&#32780;&#19981;&#20250;&#22833;&#21435;&#20854;&#20248;&#21183;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23545;&#20110;&#22266;&#23450;&#30340;&#27491;&#21017;&#21270;&#21442;&#25968;$\lambda$&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;sGMC&#27169;&#22411;&#30340;&#35299;&#38598;&#20960;&#20309;&#12289;&#35299;&#21807;&#19968;&#24615;&#21644;&#31232;&#30095;&#24615;&#21487;&#20197;&#20197;&#19968;&#31181;&#31867;&#20284;&#20248;&#38597;&#30340;&#26041;&#24335;&#21051;&#30011;&#20026;LASSO&#27169;&#22411;&#65288;&#21442;&#35265;&#65292;&#20363;&#22914;&#65292;Osborne&#31561;&#20154;2000&#24180;&#65292;R. J. Tibshirani 2013&#24180;&#65289;&#12290;&#23545;&#20110;&#21464;&#21270;&#30340;$\lambda$&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.18438v2 Announce Type: cross  Abstract: The generalized minimax concave (GMC) penalty is a nonconvex sparse regularizer which can preserve the overall-convexity of the regularized least-squares problem. In this paper, we focus on a significant instance of the GMC model termed scaled GMC (sGMC), and present various notable findings on its solution-set geometry and regularization path. Our investigation indicates that while the sGMC penalty is a nonconvex extension of the LASSO penalty (i.e., the $\ell_1$-norm), the sGMC model preserves many celebrated properties of the LASSO model, hence can serve as a less biased surrogate of LASSO without losing its advantages. Specifically, for a fixed regularization parameter $\lambda$, we show that the solution-set geometry, solution uniqueness and sparseness of the sGMC model can be characterized in a similar elegant way to the LASSO model (see, e.g., Osborne et al. 2000, R. J. Tibshirani 2013). For a varying $\lambda$, we prove that th
&lt;/p&gt;</description></item></channel></rss>