<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24555;&#36895;&#30340;Switchback&#23454;&#39564;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#25972;&#20010;&#26102;&#38388;&#22359;&#65292;&#20197; $\sqrt{\log T/T}$ &#30340;&#36895;&#29575;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2312.15574</link><description>&lt;p&gt;
&#26356;&#24555;&#36895;&#30340;Switchback&#23454;&#39564;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Faster Rates for Switchback Experiments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.15574
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#24555;&#36895;&#30340;Switchback&#23454;&#39564;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#25972;&#20010;&#26102;&#38388;&#22359;&#65292;&#20197; $\sqrt{\log T/T}$ &#30340;&#36895;&#29575;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Switchback&#23454;&#39564;&#35774;&#35745;&#20013;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#21333;&#20803;&#65288;&#20363;&#22914;&#25972;&#20010;&#31995;&#32479;&#65289;&#22312;&#20132;&#26367;&#30340;&#26102;&#38388;&#22359;&#20013;&#26292;&#38706;&#20110;&#19968;&#20010;&#38543;&#26426;&#22788;&#29702;&#65292;&#22788;&#29702;&#24182;&#34892;&#22788;&#29702;&#20102;&#36328;&#21333;&#20803;&#21644;&#26102;&#38388;&#24178;&#25200;&#38382;&#39064;&#12290;Hu&#21644;Wager&#65288;2022&#65289;&#26368;&#36817;&#25552;&#20986;&#20102;&#19968;&#31181;&#25130;&#26029;&#22359;&#36215;&#22987;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#65292;&#24182;&#22312;Markov&#26465;&#20214;&#19979;&#35777;&#26126;&#20102;&#29992;&#20110;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;GATE&#65289;&#30340;$T^{-1/3}$&#36895;&#29575;&#65292;&#20182;&#20204;&#22768;&#31216;&#36825;&#20010;&#36895;&#29575;&#26159;&#26368;&#20248;&#30340;&#65292;&#24182;&#24314;&#35758;&#23558;&#27880;&#24847;&#21147;&#36716;&#21521;&#19981;&#21516;&#65288;&#19988;&#20381;&#36182;&#35774;&#35745;&#65289;&#30340;&#20272;&#35745;&#37327;&#65292;&#20197;&#33719;&#24471;&#26356;&#24555;&#30340;&#36895;&#29575;&#12290;&#23545;&#20110;&#30456;&#21516;&#30340;&#35774;&#35745;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#20272;&#35745;&#22120;&#65292;&#20351;&#29992;&#25972;&#20010;&#22359;&#65292;&#24182;&#24778;&#20154;&#22320;&#35777;&#26126;&#65292;&#22312;&#30456;&#21516;&#30340;&#20551;&#35774;&#19979;&#65292;&#23427;&#23454;&#38469;&#19978;&#36798;&#21040;&#20102;&#21407;&#22987;&#30340;&#35774;&#35745;&#29420;&#31435;GATE&#20272;&#35745;&#37327;&#30340;$\sqrt{\log T/T}$&#30340;&#20272;&#35745;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Switchback experimental design, wherein a single unit (e.g., a whole system) is exposed to a single random treatment for interspersed blocks of time, tackles both cross-unit and temporal interference. Hu and Wager (2022) recently proposed a treatment-effect estimator that truncates the beginnings of blocks and established a $T^{-1/3}$ rate for estimating the global average treatment effect (GATE) in a Markov setting with rapid mixing. They claim this rate is optimal and suggest focusing instead on a different (and design-dependent) estimand so as to enjoy a faster rate. For the same design we propose an alternative estimator that uses the whole block and surprisingly show that it in fact achieves an estimation rate of $\sqrt{\log T/T}$ for the original design-independent GATE estimand under the same assumptions.
&lt;/p&gt;</description></item></channel></rss>