<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2310.15512</link><description>&lt;p&gt;
&#25512;&#35770;&#29992;&#20110;&#31561;&#32423;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Inference for Rank-Rank Regressions. (arXiv:2310.15512v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#65292;&#26012;&#29575;&#31995;&#25968;&#26159;&#34913;&#37327;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#24120;&#29992;&#25351;&#26631;&#65292;&#20363;&#22914;&#22312;&#23376;&#22899;&#25910;&#20837;&#31561;&#32423;&#19982;&#29238;&#27597;&#25910;&#20837;&#31561;&#32423;&#22238;&#24402;&#20013;&#12290;&#26412;&#25991;&#39318;&#20808;&#25351;&#20986;&#65292;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22914;&#21516;&#26041;&#24046;&#20272;&#35745;&#22120;&#25110;&#40065;&#26834;&#26041;&#24046;&#20272;&#35745;&#22120;&#26410;&#33021;&#19968;&#33268;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#30340;&#28176;&#36827;&#26041;&#24046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#20123;&#20272;&#35745;&#22120;&#30340;&#27010;&#29575;&#26497;&#38480;&#21487;&#33021;&#36807;&#22823;&#25110;&#36807;&#23567;&#65292;&#21462;&#20915;&#20110;&#23376;&#22899;&#25910;&#20837;&#21644;&#29238;&#27597;&#25910;&#20837;&#30340;&#32852;&#21512;&#20998;&#24067;&#20989;&#25968;&#30340;&#24418;&#29366;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#31561;&#32423;&#22238;&#24402;&#30340;&#19968;&#33324;&#28176;&#36827;&#29702;&#35770;&#65292;&#24182;&#25552;&#20379;&#20102;OLS&#20272;&#35745;&#22120;&#28176;&#36827;&#26041;&#24046;&#30340;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#28176;&#36827;&#29702;&#35770;&#25193;&#23637;&#21040;&#20854;&#20182;&#32463;&#39564;&#24037;&#20316;&#20013;&#28041;&#21450;&#31561;&#32423;&#30340;&#22238;&#24402;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#24212;&#29992;&#20110;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#26377;&#26102;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
Slope coefficients in rank-rank regressions are popular measures of intergenerational mobility, for instance in regressions of a child's income rank on their parent's income rank. In this paper, we first point out that commonly used variance estimators such as the homoskedastic or robust variance estimators do not consistently estimate the asymptotic variance of the OLS estimator in a rank-rank regression. We show that the probability limits of these estimators may be too large or too small depending on the shape of the copula of child and parent incomes. Second, we derive a general asymptotic theory for rank-rank regressions and provide a consistent estimator of the OLS estimator's asymptotic variance. We then extend the asymptotic theory to other regressions involving ranks that have been used in empirical work. Finally, we apply our new inference methods to three empirical studies. We find that the confidence intervals based on estimators of the correct variance may sometimes be sub
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#21442;&#25968;&#20272;&#35745;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#35889;&#20272;&#35745;&#22120;&#36827;&#34892;&#39044;&#22788;&#29702;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#23545;&#27979;&#37327;&#36827;&#34892;&#29305;&#24449;&#21327;&#26041;&#24046;&#30697;&#38453;&#931;&#34920;&#31034;&#65292;&#20998;&#26512;&#20102;&#35889;&#20272;&#35745;&#22120;&#22312;&#32467;&#26500;&#21270;&#35774;&#35745;&#20013;&#30340;&#24615;&#33021;&#65292;&#24182;&#30830;&#23450;&#20102;&#26368;&#20248;&#39044;&#22788;&#29702;&#20197;&#26368;&#23567;&#21270;&#26679;&#26412;&#25968;&#37327;&#12290;</title><link>http://arxiv.org/abs/2308.14507</link><description>&lt;p&gt;
&#36890;&#36807;&#36817;&#20284;&#20256;&#36882;&#28040;&#24687;&#23454;&#29616;&#32467;&#26500;&#21270;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#35889;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Spectral Estimators for Structured Generalized Linear Models via Approximate Message Passing. (arXiv:2308.14507v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.14507
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#21442;&#25968;&#20272;&#35745;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#35889;&#20272;&#35745;&#22120;&#36827;&#34892;&#39044;&#22788;&#29702;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#23545;&#27979;&#37327;&#36827;&#34892;&#29305;&#24449;&#21327;&#26041;&#24046;&#30697;&#38453;&#931;&#34920;&#31034;&#65292;&#20998;&#26512;&#20102;&#35889;&#20272;&#35745;&#22120;&#22312;&#32467;&#26500;&#21270;&#35774;&#35745;&#20013;&#30340;&#24615;&#33021;&#65292;&#24182;&#30830;&#23450;&#20102;&#26368;&#20248;&#39044;&#22788;&#29702;&#20197;&#26368;&#23567;&#21270;&#26679;&#26412;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20174;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#20013;&#30340;&#35266;&#27979;&#20013;&#36827;&#34892;&#21442;&#25968;&#20272;&#35745;&#30340;&#38382;&#39064;&#12290;&#35889;&#26041;&#27861;&#26159;&#19968;&#31181;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#20272;&#35745;&#26041;&#27861;&#65306;&#23427;&#36890;&#36807;&#23545;&#35266;&#27979;&#36827;&#34892;&#36866;&#24403;&#39044;&#22788;&#29702;&#24471;&#21040;&#30340;&#30697;&#38453;&#30340;&#20027;&#29305;&#24449;&#21521;&#37327;&#26469;&#20272;&#35745;&#21442;&#25968;&#12290;&#23613;&#31649;&#35889;&#20272;&#35745;&#22120;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#23545;&#20110;&#32467;&#26500;&#21270;&#65288;&#21363;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#39640;&#26031;&#21644;&#21704;&#23572;&#65289;&#35774;&#35745;&#65292;&#30446;&#21069;&#20165;&#26377;&#23545;&#35889;&#20272;&#35745;&#22120;&#30340;&#20005;&#26684;&#24615;&#33021;&#34920;&#24449;&#20197;&#21450;&#23545;&#25968;&#25454;&#36827;&#34892;&#39044;&#22788;&#29702;&#30340;&#22522;&#26412;&#26041;&#27861;&#21487;&#29992;&#12290;&#30456;&#21453;&#65292;&#23454;&#38469;&#30340;&#35774;&#35745;&#30697;&#38453;&#20855;&#26377;&#39640;&#24230;&#32467;&#26500;&#21270;&#24182;&#19988;&#34920;&#29616;&#20986;&#38750;&#24179;&#20961;&#30340;&#30456;&#20851;&#24615;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25429;&#25417;&#27979;&#37327;&#30340;&#38750;&#21508;&#21521;&#21516;&#24615;&#29305;&#24615;&#30340;&#30456;&#20851;&#39640;&#26031;&#35774;&#35745;&#65292;&#36890;&#36807;&#29305;&#24449;&#21327;&#26041;&#24046;&#30697;&#38453;&#931;&#36827;&#34892;&#34920;&#31034;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#23545;&#20110;&#36825;&#31181;&#24773;&#20917;&#19979;&#35889;&#20272;&#35745;&#22120;&#24615;&#33021;&#30340;&#31934;&#30830;&#28176;&#36817;&#20998;&#26512;&#12290;&#28982;&#21518;&#65292;&#21487;&#20197;&#36890;&#36807;&#36825;&#19968;&#32467;&#26524;&#26469;&#30830;&#23450;&#26368;&#20248;&#39044;&#22788;&#29702;&#65292;&#20174;&#32780;&#26368;&#23567;&#21270;&#25152;&#38656;&#26679;&#26412;&#30340;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of parameter estimation from observations given by a generalized linear model. Spectral methods are a simple yet effective approach for estimation: they estimate the parameter via the principal eigenvector of a matrix obtained by suitably preprocessing the observations. Despite their wide use, a rigorous performance characterization of spectral estimators, as well as a principled way to preprocess the data, is available only for unstructured (i.e., i.i.d. Gaussian and Haar) designs. In contrast, real-world design matrices are highly structured and exhibit non-trivial correlations. To address this problem, we consider correlated Gaussian designs which capture the anisotropic nature of the measurements via a feature covariance matrix $\Sigma$. Our main result is a precise asymptotic characterization of the performance of spectral estimators in this setting. This then allows to identify the optimal preprocessing that minimizes the number of samples needed to meanin
&lt;/p&gt;</description></item></channel></rss>