<rss version="2.0"><channel><title>Chat Arxiv math.ST</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for math.ST</description><item><title>&#35813;&#35770;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#25552;&#20986;&#20102;&#19968;&#31181;&#20840;&#23616;&#36339;&#36291;&#26816;&#27979;&#26041;&#27861;&#65292;&#21033;&#29992;&#26412;&#22320;&#27425;&#24207;&#32479;&#35745;&#37327;&#26816;&#27979;&#12289;&#23450;&#20301;&#21644;&#20272;&#35745;&#39640;&#39057;&#27425;&#24207;&#20215;&#26684;&#20013;&#30340;&#20215;&#26684;&#36339;&#36291;&#12290;</title><link>https://arxiv.org/abs/2403.00819</link><description>&lt;p&gt;
&#39640;&#39057;&#27425;&#24207;&#20215;&#26684;&#20013;&#30340;&#36339;&#36291;&#26816;&#27979;
&lt;/p&gt;
&lt;p&gt;
Jump detection in high-frequency order prices
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00819
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#25552;&#20986;&#20102;&#19968;&#31181;&#20840;&#23616;&#36339;&#36291;&#26816;&#27979;&#26041;&#27861;&#65292;&#21033;&#29992;&#26412;&#22320;&#27425;&#24207;&#32479;&#35745;&#37327;&#26816;&#27979;&#12289;&#23450;&#20301;&#21644;&#20272;&#35745;&#39640;&#39057;&#27425;&#24207;&#20215;&#26684;&#20013;&#30340;&#20215;&#26684;&#36339;&#36291;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25512;&#26029;&#21322;-martingale&#36339;&#36291;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#31163;&#25955;&#12289;&#22024;&#26434;&#12289;&#39640;&#39057;&#27425;&#24207;&#30340;&#35266;&#23519;&#25551;&#36848;&#20102;&#38271;&#26399;&#20215;&#26684;&#21160;&#24577;&#12290;&#19982;&#32463;&#20856;&#30340;&#21152;&#24615;&#12289;&#20013;&#24515;&#30340;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#27169;&#22411;&#19981;&#21516;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#38480;&#20215;&#21333;&#22996;&#25176;&#20215;&#26684;&#30340;&#21333;&#20391;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#20351;&#29992;&#26412;&#22320;&#27425;&#24207;&#32479;&#35745;&#37327;&#20272;&#35745;&#12289;&#23450;&#20301;&#21644;&#26816;&#39564;&#36339;&#36291;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26412;&#22320;&#26816;&#39564;&#65292;&#24182;&#23637;&#31034;&#25105;&#20204;&#21487;&#20197;&#19968;&#33268;&#22320;&#20272;&#35745;&#20215;&#26684;&#36339;&#36291;&#12290;&#20027;&#35201;&#36129;&#29486;&#26159;&#20840;&#23616;&#36339;&#36291;&#26816;&#39564;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#35813;&#26816;&#39564;&#30340;&#28176;&#36817;&#24615;&#36136;&#21644;&#26368;&#20248;&#24615;&#12290;&#22522;&#20110;&#26497;&#20540;&#29702;&#35770;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#26080;&#36339;&#36291;&#30340;&#38646;&#20551;&#35774;&#19979;&#26368;&#22823;&#32479;&#35745;&#37327;&#30340;&#28176;&#36817;&#20998;&#24067;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#22791;&#25321;&#20551;&#35774;&#19979;&#30340;&#19968;&#33268;&#24615;&#12290;&#25105;&#20204;&#30830;&#23450;&#24182;&#23637;&#31034;&#20102;&#26412;&#22320;&#22791;&#25321;&#24773;&#20917;&#19979;&#30340;&#25910;&#25947;&#36895;&#24230;&#36828;&#36828;&#24555;&#20110;&#26631;&#20934;&#24066;&#22330;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#27169;&#22411;&#30340;&#26368;&#20248;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00819v1 Announce Type: new  Abstract: We propose methods to infer jumps of a semi-martingale, which describes long-term price dynamics based on discrete, noisy, high-frequency observations. Different to the classical model of additive, centered market microstructure noise, we consider one-sided microstructure noise for order prices in a limit order book. We develop methods to estimate, locate and test for jumps using local order statistics. We provide a local test and show that we can consistently estimate price jumps. The main contribution is a global test for jumps. We establish the asymptotic properties and optimality of this test. We derive the asymptotic distribution of a maximum statistic under the null hypothesis of no jumps based on extreme value theory. We prove consistency under the alternative hypothesis. The rate of convergence for local alternatives is determined and shown to be much faster than optimal rates for the standard market microstructure noise model. T
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#21512;&#24182;&#20351;&#29992;&#19981;&#21516;&#36807;&#28388;&#22120;&#35745;&#31639;&#30340;e&#36827;&#31243;&#30340;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#20854;&#22312;&#39034;&#24207;&#25512;&#29702;&#20013;&#30340;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.09698</link><description>&lt;p&gt;
&#21512;&#24182;&#19981;&#21516;&#36807;&#28388;&#22120;&#20013;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Combining Evidence Across Filtrations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09698
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#21512;&#24182;&#20351;&#29992;&#19981;&#21516;&#36807;&#28388;&#22120;&#35745;&#31639;&#30340;e&#36827;&#31243;&#30340;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#20854;&#22312;&#39034;&#24207;&#25512;&#29702;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20219;&#20309;&#26102;&#21051;&#26377;&#25928;&#30340;&#39034;&#24207;&#25512;&#29702;&#20013;&#65292;&#24050;&#30693;&#20219;&#20309;&#21487;&#25509;&#21463;&#30340;&#25512;&#29702;&#26041;&#27861;&#24517;&#39035;&#22522;&#20110;&#27979;&#35797;&#38789;&#21644;&#23427;&#20204;&#30340;&#32452;&#21512;&#24191;&#20041;&#21270;&#65292;&#31216;&#20026;e&#36827;&#31243;&#65292;&#23427;&#20204;&#26159;&#38750;&#36127;&#36827;&#31243;&#65292;&#20854;&#22312;&#20219;&#20309;&#20219;&#24847;&#20572;&#26102;&#30340;&#26399;&#26395;&#19978;&#30028;&#19981;&#36229;&#36807;&#19968;&#12290;e&#36827;&#31243;&#37327;&#21270;&#20102;&#38024;&#23545;&#22797;&#21512;&#38646;&#20551;&#35774;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#30340;&#32047;&#31215;&#35777;&#25454;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#19981;&#21516;&#20449;&#24687;&#38598;&#65288;&#21363;&#36807;&#28388;&#22120;&#65289;&#35745;&#31639;&#30340;e&#36827;&#31243;&#30340;&#21512;&#24182;&#26041;&#27861;&#65292;&#38024;&#23545;&#19968;&#20010;&#38646;&#20551;&#35774;&#12290;&#23613;&#31649;&#22312;&#30456;&#21516;&#36807;&#28388;&#22120;&#19978;&#26500;&#24314;&#30340;e&#36827;&#31243;&#21487;&#20197;&#36731;&#26494;&#22320;&#21512;&#24182;&#65288;&#20363;&#22914;&#65292;&#36890;&#36807;&#24179;&#22343;&#65289;&#65292;&#20294;&#22312;&#19981;&#21516;&#36807;&#28388;&#22120;&#19978;&#26500;&#24314;&#30340;e&#36827;&#31243;&#19981;&#33021;&#37027;&#20040;&#23481;&#26131;&#22320;&#21512;&#24182;&#65292;&#22240;&#20026;&#23427;&#20204;&#22312;&#36739;&#31895;&#30340;&#36807;&#28388;&#22120;&#20013;&#30340;&#26377;&#25928;&#24615;&#19981;&#33021;&#36716;&#25442;&#20026;&#22312;&#26356;&#32454;&#30340;&#36807;&#28388;&#22120;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#25991;&#29486;&#20013;&#19977;&#20010;&#20855;&#20307;&#20363;&#23376;&#65306;&#21487;&#20132;&#25442;&#24615;&#27979;&#35797;&#65292;&#29420;&#31435;&#24615;&#27979;&#35797;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09698v1 Announce Type: cross  Abstract: In anytime-valid sequential inference, it is known that any admissible inference procedure must be based on test martingales and their composite generalization, called e-processes, which are nonnegative processes whose expectation at any arbitrary stopping time is upper-bounded by one. An e-process quantifies the accumulated evidence against a composite null hypothesis over a sequence of outcomes. This paper studies methods for combining e-processes that are computed using different information sets, i.e., filtrations, for a null hypothesis. Even though e-processes constructed on the same filtration can be combined effortlessly (e.g., by averaging), e-processes constructed on different filtrations cannot be combined as easily because their validity in a coarser filtration does not translate to validity in a finer filtration. We discuss three concrete examples of such e-processes in the literature: exchangeability tests, independence te
&lt;/p&gt;</description></item></channel></rss>