<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27604;&#29305;&#24065;&#29992;&#25143;&#32593;&#32476;&#30340;&#20013;&#23567;&#23610;&#24230;&#32467;&#26500;&#29305;&#24615;&#65292;&#24182;&#21457;&#29616;&#20854;&#20855;&#26377;&#26680;&#24515;-&#22806;&#22260;&#32467;&#26500;&#21644;&#34676;&#34678;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;BUN&#32467;&#26500;&#32452;&#32455;&#30340;&#28436;&#21270;&#19982;&#27873;&#27819;&#23384;&#22312;&#30456;&#20851;&#30340;&#27874;&#21160;&#26377;&#20851;&#65292;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#32467;&#26500;&#37327;&#19982;&#20215;&#26684;&#21464;&#21160;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2307.14409</link><description>&lt;p&gt;
&#25506;&#32034;&#27604;&#29305;&#24065;&#30340;&#20013;&#23567;&#23610;&#24230;&#32467;&#26500;
&lt;/p&gt;
&lt;p&gt;
Exploring the Bitcoin Mesoscale. (arXiv:2307.14409v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14409
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27604;&#29305;&#24065;&#29992;&#25143;&#32593;&#32476;&#30340;&#20013;&#23567;&#23610;&#24230;&#32467;&#26500;&#29305;&#24615;&#65292;&#24182;&#21457;&#29616;&#20854;&#20855;&#26377;&#26680;&#24515;-&#22806;&#22260;&#32467;&#26500;&#21644;&#34676;&#34678;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;BUN&#32467;&#26500;&#32452;&#32455;&#30340;&#28436;&#21270;&#19982;&#27873;&#27819;&#23384;&#22312;&#30456;&#20851;&#30340;&#27874;&#21160;&#26377;&#20851;&#65292;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#32467;&#26500;&#37327;&#19982;&#20215;&#26684;&#21464;&#21160;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27604;&#29305;&#24065;&#20132;&#26131;&#21382;&#21490;&#30340;&#24320;&#25918;&#21487;&#29992;&#24615;&#20026;&#20197;&#21069;&#25152;&#26410;&#26377;&#30340;&#32454;&#33410;&#27700;&#24179;&#30740;&#31350;&#35813;&#31995;&#32479;&#25552;&#20379;&#20102;&#21487;&#33021;&#24615;&#12290;&#26412;&#25991;&#33268;&#21147;&#20110;&#20998;&#26512;&#27604;&#29305;&#24065;&#29992;&#25143;&#32593;&#32476;&#65288;BUN&#65289;&#22312;&#20854;&#25972;&#20010;&#21382;&#21490;&#65288;&#21363;&#20174;2009&#24180;&#21040;2017&#24180;&#65289;&#20013;&#30340;&#20013;&#23567;&#23610;&#24230;&#32467;&#26500;&#23646;&#24615;&#12290;&#20174;&#25105;&#20204;&#30340;&#20998;&#26512;&#20013;&#21487;&#20197;&#30475;&#20986;&#65292;BUN&#20855;&#26377;&#26680;&#24515;-&#22806;&#22260;&#32467;&#26500;&#65292;&#26356;&#28145;&#20837;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#19968;&#23450;&#31243;&#24230;&#30340;&#34676;&#34678;&#32467;&#26500;&#65288;&#21363;&#20855;&#26377;&#24378;&#36830;&#36890;&#20998;&#37327;&#12289;IN&#20998;&#37327;&#21644;OUT&#20998;&#37327;&#20197;&#21450;&#19968;&#20123;&#38468;&#30528;&#22312;IN&#20998;&#37327;&#19978;&#30340;&#35302;&#39035;&#65289;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;BUN&#32467;&#26500;&#32452;&#32455;&#30340;&#28436;&#21270;&#32463;&#21382;&#20102;&#19982;&#27873;&#27819;&#23384;&#22312;&#30456;&#20851;&#30340;&#27874;&#21160;&#65292;&#21363;&#22312;&#25972;&#20010;&#27604;&#29305;&#24065;&#21382;&#21490;&#19978;&#35266;&#23519;&#21040;&#30340;&#20215;&#26684;&#28608;&#22686;&#21644;&#19979;&#36300;&#38454;&#27573;&#65306;&#22240;&#27492;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#20808;&#21069;&#20998;&#26512;&#20013;&#35266;&#23519;&#21040;&#30340;&#32467;&#26500;&#37327;&#21644;&#20215;&#26684;&#21464;&#21160;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
The open availability of the entire history of the Bitcoin transactions opens up the possibility to study this system at an unprecedented level of detail. This contribution is devoted to the analysis of the mesoscale structural properties of the Bitcoin User Network (BUN), across its entire history (i.e. from 2009 to 2017). What emerges from our analysis is that the BUN is characterized by a core-periphery structure a deeper analysis of which reveals a certain degree of bow-tieness (i.e. the presence of a Strongly-Connected Component, an IN- and an OUT-component together with some tendrils attached to the IN-component). Interestingly, the evolution of the BUN structural organization experiences fluctuations that seem to be correlated with the presence of bubbles, i.e. periods of price surge and decline observed throughout the entire Bitcoin history: our results, thus, further confirm the interplay between structural quantities and price movements observed in previous analyses.
&lt;/p&gt;</description></item></channel></rss>