<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36229;&#22270;&#19978;&#20855;&#26377;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31163;&#25955;&#26102;&#38388;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65292;&#22312;&#21021;&#24577;&#21644;&#36229;&#22270;&#25299;&#25169;&#20197;&#21450;&#26356;&#26032;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#19979;&#65292;&#20135;&#29983;&#20102;&#39640;&#38454;&#21160;&#21147;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2304.07203</link><description>&lt;p&gt;
&#20851;&#20110;&#36229;&#22270;&#19978;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#25910;&#25947;&#24615;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the convergence of nonlinear averaging dynamics with three-body interactions on hypergraphs. (arXiv:2304.07203v1 [math.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07203
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36229;&#22270;&#19978;&#20855;&#26377;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31163;&#25955;&#26102;&#38388;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65292;&#22312;&#21021;&#24577;&#21644;&#36229;&#22270;&#25299;&#25169;&#20197;&#21450;&#26356;&#26032;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#19979;&#65292;&#20135;&#29983;&#20102;&#39640;&#38454;&#21160;&#21147;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#29702;&#23398;&#12289;&#29983;&#29289;&#23398;&#21644;&#31038;&#20250;&#31185;&#23398;&#31561;&#39046;&#22495;&#30340;&#22797;&#26434;&#32593;&#32476;&#31995;&#32479;&#36890;&#24120;&#28041;&#21450;&#36229;&#20986;&#31616;&#21333;&#30340;&#25104;&#23545;&#30456;&#20114;&#20316;&#29992;&#30340;&#20132;&#20114;&#12290;&#36229;&#22270;&#20316;&#20026;&#25551;&#36848;&#21644;&#20998;&#26512;&#20855;&#26377;&#22810;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31995;&#32479;&#22797;&#26434;&#34892;&#20026;&#30340;&#24378;&#22823;&#24314;&#27169;&#24037;&#20855;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#19977;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#31163;&#25955;&#26102;&#38388;&#38750;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65306;&#24213;&#23618;&#36229;&#22270;&#30001;&#19977;&#20803;&#32452;&#20316;&#20026;&#36229;&#36793;&#30028;&#23450;&#30456;&#20114;&#20316;&#29992;&#30340;&#32467;&#26500;&#65292;&#32780;&#39030;&#28857;&#36890;&#36807;&#21152;&#26435;&#30340;&#29366;&#24577;&#20381;&#36182;&#30340;&#37051;&#22495;&#23545;&#30340;&#29366;&#24577;&#24179;&#22343;&#26356;&#26032;&#20854;&#29366;&#24577;&#12290;&#30456;&#36739;&#20110;&#24102;&#26377;&#20108;&#20307;&#30456;&#20114;&#20316;&#29992;&#30340;&#22270;&#19978;&#30340;&#32447;&#24615;&#24179;&#22343;&#21160;&#21147;&#23398;&#65292;&#36825;&#20010;&#21160;&#21147;&#23398;&#19981;&#20250;&#25910;&#25947;&#21040;&#21021;&#22987;&#29366;&#24577;&#30340;&#24179;&#22343;&#20540;&#65292;&#32780;&#26159;&#20943;&#23569;&#20102;&#21021;&#24577;&#21644;&#36229;&#22270;&#25299;&#25169;&#30340;&#22797;&#26434;&#30456;&#20114;&#20316;&#29992;&#21644;&#26356;&#26032;&#30340;&#38750;&#32447;&#24615;&#20135;&#29983;&#39640;&#38454;&#21160;&#21147;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Complex networked systems in fields such as physics, biology, and social sciences often involve interactions that extend beyond simple pairwise ones. Hypergraphs serve as powerful modeling tools for describing and analyzing the intricate behaviors of systems with multi-body interactions. Herein, we investigate a discrete-time nonlinear averaging dynamics with three-body interactions: an underlying hypergraph, comprising triples as hyperedges, delineates the structure of these interactions, while the vertices update their states through a weighted, state-dependent average of neighboring pairs' states. This dynamics captures reinforcing group effects, such as peer pressure, and exhibits higher-order dynamical effects resulting from a complex interplay between initial states, hypergraph topology, and nonlinearity of the update. Differently from linear averaging dynamics on graphs with two-body interactions, this model does not converge to the average of the initial states but rather induc
&lt;/p&gt;</description></item></channel></rss>