<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#35774;&#35745;&#26368;&#20248;&#30340;&#21487;&#35266;&#27979;&#37327;&#65292;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;&#36755;&#20986;&#30340;&#23637;&#24320;&#30340;&#24494;&#20998;&#25130;&#38754;&#21253;&#21547;&#20102;&#20851;&#20110;&#24863;&#20852;&#36259;&#21442;&#25968;&#30340;&#26368;&#22810;&#20449;&#24687;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#26500;&#36896;&#26041;&#27861;&#36827;&#34892;&#24456;&#22909;&#30340;&#27979;&#37327;&#12290;</title><link>http://arxiv.org/abs/2310.08717</link><description>&lt;p&gt;
&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#20026;&#27979;&#37327;&#35774;&#35745;&#21487;&#35266;&#27979;&#37327;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Designing Observables for Measurements with Deep Learning. (arXiv:2310.08717v1 [physics.data-an])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08717
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#35774;&#35745;&#26368;&#20248;&#30340;&#21487;&#35266;&#27979;&#37327;&#65292;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;&#36755;&#20986;&#30340;&#23637;&#24320;&#30340;&#24494;&#20998;&#25130;&#38754;&#21253;&#21547;&#20102;&#20851;&#20110;&#24863;&#20852;&#36259;&#21442;&#25968;&#30340;&#26368;&#22810;&#20449;&#24687;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#26500;&#36896;&#26041;&#27861;&#36827;&#34892;&#24456;&#22909;&#30340;&#27979;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31890;&#23376;&#29289;&#29702;&#21644;&#26680;&#29289;&#29702;&#30340;&#35768;&#22810;&#20998;&#26512;&#20013;&#65292;&#20351;&#29992;&#27169;&#25311;&#26469;&#25512;&#26029;&#24213;&#23618;&#29289;&#29702;&#27169;&#22411;&#30340;&#22522;&#26412;&#12289;&#26377;&#25928;&#25110;&#29616;&#35937;&#23398;&#21442;&#25968;&#12290;&#24403;&#20351;&#29992;&#23637;&#24320;&#30340;&#25130;&#38754;&#36827;&#34892;&#25512;&#26029;&#26102;&#65292;&#21487;&#35266;&#27979;&#37327;&#26159;&#36890;&#36807;&#29289;&#29702;&#30452;&#35273;&#21644;&#32463;&#39564;&#27861;&#21017;&#36827;&#34892;&#35774;&#35745;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#35774;&#35745;&#26368;&#20248;&#30340;&#21487;&#35266;&#27979;&#37327;&#12290;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;&#36755;&#20986;&#30340;&#23637;&#24320;&#30340;&#24494;&#20998;&#25130;&#38754;&#21253;&#21547;&#20102;&#20851;&#20110;&#24863;&#20852;&#36259;&#21442;&#25968;&#30340;&#26368;&#22810;&#20449;&#24687;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#26500;&#36896;&#26041;&#27861;&#36827;&#34892;&#24456;&#22909;&#30340;&#27979;&#37327;&#12290;&#25105;&#20204;&#20351;&#29992;&#20004;&#20010;&#29289;&#29702;&#27169;&#22411;&#26469;&#28436;&#31034;&#36825;&#20010;&#24819;&#27861;&#65292;&#36825;&#20004;&#20010;&#27169;&#22411;&#29992;&#20110;&#28145;&#24230;&#26080;&#24377;&#24615;&#25955;&#23556;&#20013;&#30340;&#21253;&#21547;&#24615;&#27979;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many analyses in particle and nuclear physics use simulations to infer fundamental, effective, or phenomenological parameters of the underlying physics models. When the inference is performed with unfolded cross sections, the observables are designed using physics intuition and heuristics. We propose to design optimal observables with machine learning. Unfolded, differential cross sections in a neural network output contain the most information about parameters of interest and can be well-measured by construction. We demonstrate this idea using two physics models for inclusive measurements in deep inelastic scattering.
&lt;/p&gt;</description></item></channel></rss>