<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#29289;&#29702;&#23398;&#20013;&#30340;&#25955;&#23556;&#35889;&#27169;&#22411;&#65292;&#29992;&#20110;&#25551;&#36848;&#21508;&#31181;&#22330;&#30340;&#32479;&#35745;&#29305;&#24615;&#12290;&#36825;&#20123;&#27169;&#22411;&#22522;&#20110;&#25955;&#23556;&#31995;&#25968;&#30340;&#21327;&#26041;&#24046;&#65292;&#32467;&#21512;&#20102;&#22330;&#30340;&#23567;&#27874;&#20998;&#35299;&#21644;&#28857;&#20301;&#27169;&#65292;&#33021;&#22815;&#20934;&#30830;&#19988;&#31283;&#20581;&#22320;&#37325;&#29616;&#26631;&#20934;&#32479;&#35745;&#37327;&#65292;&#25429;&#25417;&#20102;&#20851;&#38190;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.17210</link><description>&lt;p&gt;
&#29289;&#29702;&#23398;&#30340;&#25955;&#23556;&#35889;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Scattering Spectra Models for Physics. (arXiv:2306.17210v1 [physics.data-an])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17210
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#29289;&#29702;&#23398;&#20013;&#30340;&#25955;&#23556;&#35889;&#27169;&#22411;&#65292;&#29992;&#20110;&#25551;&#36848;&#21508;&#31181;&#22330;&#30340;&#32479;&#35745;&#29305;&#24615;&#12290;&#36825;&#20123;&#27169;&#22411;&#22522;&#20110;&#25955;&#23556;&#31995;&#25968;&#30340;&#21327;&#26041;&#24046;&#65292;&#32467;&#21512;&#20102;&#22330;&#30340;&#23567;&#27874;&#20998;&#35299;&#21644;&#28857;&#20301;&#27169;&#65292;&#33021;&#22815;&#20934;&#30830;&#19988;&#31283;&#20581;&#22320;&#37325;&#29616;&#26631;&#20934;&#32479;&#35745;&#37327;&#65292;&#25429;&#25417;&#20102;&#20851;&#38190;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29289;&#29702;&#23398;&#23478;&#24120;&#24120;&#38656;&#35201;&#27010;&#29575;&#27169;&#22411;&#26469;&#36827;&#34892;&#21442;&#25968;&#25512;&#26029;&#25110;&#29983;&#25104;&#19968;&#20010;&#22330;&#30340;&#26032;&#23454;&#29616;&#12290;&#38024;&#23545;&#39640;&#24230;&#38750;&#39640;&#26031;&#22330;&#30340;&#24314;&#31435;&#36825;&#26679;&#30340;&#27169;&#22411;&#26159;&#19968;&#39033;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#24403;&#26679;&#26412;&#25968;&#37327;&#26377;&#38480;&#26102;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#25955;&#23556;&#35889;&#27169;&#22411;&#29992;&#20110;&#24179;&#31283;&#22330;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#29289;&#29702;&#23398;&#20013;&#36935;&#21040;&#30340;&#21508;&#31181;&#22330;&#30340;&#20934;&#30830;&#19988;&#31283;&#20581;&#30340;&#32479;&#35745;&#25551;&#36848;&#12290;&#36825;&#20123;&#27169;&#22411;&#22522;&#20110;&#25955;&#23556;&#31995;&#25968;&#30340;&#21327;&#26041;&#24046;&#65292;&#21363;&#22330;&#30340;&#23567;&#27874;&#20998;&#35299;&#21644;&#28857;&#20301;&#27169;&#12290;&#22312;&#20171;&#32461;&#21033;&#29992;&#26059;&#36716;&#21644;&#32553;&#25918;&#19979;&#22330;&#30340;&#35268;&#24459;&#24615;&#36827;&#34892;&#26377;&#29992;&#30340;&#32500;&#24230;&#32422;&#31616;&#21518;&#65292;&#25105;&#20204;&#39564;&#35777;&#20102;&#36825;&#20123;&#27169;&#22411;&#22312;&#19981;&#21516;&#22810;&#23610;&#24230;&#29289;&#29702;&#22330;&#19978;&#30340;&#25928;&#26524;&#65292;&#24182;&#35777;&#26126;&#23427;&#20204;&#33021;&#22815;&#37325;&#29616;&#26631;&#20934;&#32479;&#35745;&#37327;&#65292;&#21253;&#25324;&#22235;&#38454;&#31354;&#38388;&#30697;&#12290;&#36825;&#20123;&#25955;&#23556;&#35889;&#20026;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#20302;&#32500;&#32467;&#26500;&#21270;&#34920;&#31034;&#65292;&#25429;&#25417;&#20102;&#20851;&#38190;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Physicists routinely need probabilistic models for a number of tasks such as parameter inference or the generation of new realizations of a field. Establishing such models for highly non-Gaussian fields is a challenge, especially when the number of samples is limited. In this paper, we introduce scattering spectra models for stationary fields and we show that they provide accurate and robust statistical descriptions of a wide range of fields encountered in physics. These models are based on covariances of scattering coefficients, i.e. wavelet decomposition of a field coupled with a point-wise modulus. After introducing useful dimension reductions taking advantage of the regularity of a field under rotation and scaling, we validate these models on various multi-scale physical fields and demonstrate that they reproduce standard statistics, including spatial moments up to 4th order. These scattering spectra provide us with a low-dimensional structured representation that captures key prop
&lt;/p&gt;</description></item></channel></rss>