<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;Koopman&#31639;&#23376;&#30340;&#36127;&#36733;&#21160;&#24577;&#20998;&#35299;&#26041;&#27861;&#65292;&#33021;&#22815;&#32534;&#30721;&#30005;&#32593;&#36127;&#36733;&#21160;&#24577;&#30340;&#20016;&#23500;&#29305;&#24449;&#65292;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#65292;&#21516;&#26102;&#25552;&#20379;&#26377;&#24847;&#20041;&#30340;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2304.07832</link><description>&lt;p&gt;
&#22522;&#20110;Koopman&#27169;&#24577;&#20998;&#35299;&#30340;&#30005;&#32593;&#36127;&#36733;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Characterizing the load profile in power grids by Koopman mode decomposition of interconnected dynamics. (arXiv:2304.07832v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07832
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;Koopman&#31639;&#23376;&#30340;&#36127;&#36733;&#21160;&#24577;&#20998;&#35299;&#26041;&#27861;&#65292;&#33021;&#22815;&#32534;&#30721;&#30005;&#32593;&#36127;&#36733;&#21160;&#24577;&#30340;&#20016;&#23500;&#29305;&#24449;&#65292;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#65292;&#21516;&#26102;&#25552;&#20379;&#26377;&#24847;&#20041;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#36127;&#36733;&#39044;&#27979;&#23545;&#20110;&#26377;&#25928;&#31649;&#29702;&#21644;&#20248;&#21270;&#30005;&#32593;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21487;&#35299;&#37322;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#21033;&#29992;&#31639;&#23376;&#29702;&#35770;&#26694;&#26550;&#20869;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#35782;&#21035;&#36127;&#36733;&#21160;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;Koopman&#31639;&#23376;&#26469;&#34920;&#31034;&#36127;&#36733;&#25968;&#25454;&#65292;&#35813;&#31639;&#23376;&#22266;&#26377;&#20110;&#24213;&#23618;&#21160;&#24577;&#12290;&#36890;&#36807;&#35745;&#31639;&#30456;&#24212;&#30340;&#29305;&#24449;&#20989;&#25968;&#65292;&#25105;&#20204;&#23558;&#36127;&#36733;&#21160;&#24577;&#20998;&#35299;&#20026;&#30456;&#24178;&#30340;&#26102;&#31354;&#27169;&#24335;&#65292;&#36825;&#20123;&#27169;&#24335;&#26159;&#21160;&#24577;&#30340;&#26368;&#24378;&#29305;&#24449;&#12290;&#27599;&#20010;&#27169;&#24335;&#26681;&#25454;&#20854;&#21333;&#19968;&#39057;&#29575;&#29420;&#31435;&#28436;&#21270;&#65292;&#22522;&#20110;&#32447;&#24615;&#21160;&#21147;&#23398;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;&#25105;&#20204;&#24378;&#35843;&#65292;&#36127;&#36733;&#21160;&#24577;&#26159;&#22522;&#20110;&#22266;&#26377;&#20110;&#21160;&#24577;&#30340;&#30456;&#24178;&#30340;&#26102;&#31354;&#27169;&#24335;&#26500;&#24314;&#30340;&#65292;&#33021;&#22815;&#22312;&#22810;&#20010;&#26102;&#38388;&#23610;&#24230;&#19978;&#32534;&#30721;&#20016;&#23500;&#30340;&#21160;&#24577;&#29305;&#24449;&#12290;&#36825;&#20123;&#29305;&#24449;&#19982;&#30005;&#32593;&#30340;&#29289;&#29702;&#29305;&#24449;&#65288;&#22914;&#23395;&#33410;&#24615;&#21644;&#23567;&#26102;&#27169;&#24335;&#65289;&#26377;&#20851;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#23545;&#24213;&#23618;&#21160;&#24577;&#30340;&#26377;&#24847;&#20041;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Electricity load forecasting is crucial for effectively managing and optimizing power grids. Over the past few decades, various statistical and deep learning approaches have been used to develop load forecasting models. This paper presents an interpretable machine learning approach that identifies load dynamics using data-driven methods within an operator-theoretic framework. We represent the load data using the Koopman operator, which is inherent to the underlying dynamics. By computing the corresponding eigenfunctions, we decompose the load dynamics into coherent spatiotemporal patterns that are the most robust features of the dynamics. Each pattern evolves independently according to its single frequency, making its predictability based on linear dynamics. We emphasize that the load dynamics are constructed based on coherent spatiotemporal patterns that are intrinsic to the dynamics and are capable of encoding rich dynamical features at multiple time scales. These features are relate
&lt;/p&gt;</description></item></channel></rss>