<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>NuGraph2 &#26159;&#19968;&#31181;&#29992;&#20110;&#28082;&#27689;&#26102;&#38388;&#25237;&#24433;&#23460;&#25506;&#27979;&#22120;&#20013;&#27169;&#25311;&#20013;&#24494;&#23376;&#30456;&#20114;&#20316;&#29992;&#20302;&#32423;&#37325;&#24314;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#36890;&#36807;&#22810;&#22836;&#27880;&#24847;&#21147;&#20256;&#36882;&#26426;&#21046;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#32972;&#26223;&#36807;&#28388;&#21644;&#35821;&#20041;&#26631;&#35760;&#12290;</title><link>https://arxiv.org/abs/2403.11872</link><description>&lt;p&gt;
NuGraph2&#65306;&#29992;&#20110;&#20013;&#24494;&#23376;&#29289;&#29702;&#20107;&#20214;&#37325;&#24314;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
NuGraph2: A Graph Neural Network for Neutrino Physics Event Reconstruction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11872
&lt;/p&gt;
&lt;p&gt;
NuGraph2 &#26159;&#19968;&#31181;&#29992;&#20110;&#28082;&#27689;&#26102;&#38388;&#25237;&#24433;&#23460;&#25506;&#27979;&#22120;&#20013;&#27169;&#25311;&#20013;&#24494;&#23376;&#30456;&#20114;&#20316;&#29992;&#20302;&#32423;&#37325;&#24314;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65292;&#36890;&#36807;&#22810;&#22836;&#27880;&#24847;&#21147;&#20256;&#36882;&#26426;&#21046;&#23454;&#29616;&#20102;&#39640;&#25928;&#30340;&#32972;&#26223;&#36807;&#28388;&#21644;&#35821;&#20041;&#26631;&#35760;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11872v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#36328;&#39046;&#22495; &#25688;&#35201;&#65306;&#28082;&#27689;&#26102;&#38388;&#25237;&#24433;&#23460;&#65288;LArTPC&#65289;&#25506;&#27979;&#22120;&#25216;&#26415;&#25552;&#20379;&#20102;&#20016;&#23500;&#30340;&#39640;&#20998;&#36776;&#29575;&#31890;&#23376;&#30456;&#20114;&#20316;&#29992;&#20449;&#24687;&#65292;&#20805;&#20998;&#21033;&#29992;&#36825;&#20123;&#20449;&#24687;&#38656;&#35201;&#20808;&#36827;&#30340;&#33258;&#21160;&#37325;&#24314;&#25216;&#26415;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;NuGraph2&#65292;&#19968;&#31181;&#29992;&#20110;LArTPC&#25506;&#27979;&#22120;&#20013;&#27169;&#25311;&#20013;&#24494;&#23376;&#30456;&#20114;&#20316;&#29992;&#20302;&#32423;&#37325;&#24314;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#12290;MicroBooNE&#25506;&#27979;&#22120;&#20960;&#20309;&#24418;&#29366;&#20013;&#30340;&#27169;&#25311;&#20013;&#24494;&#23376;&#30456;&#20114;&#20316;&#29992;&#34987;&#25551;&#36848;&#20026;&#24322;&#36136;&#22270;&#65292;&#27599;&#20010;&#25506;&#27979;&#22120;&#24179;&#38754;&#19978;&#30340;&#33021;&#37327;&#27785;&#31215;&#24418;&#25104;&#24179;&#38754;&#23376;&#22270;&#19978;&#30340;&#33410;&#28857;&#12290;&#35813;&#32593;&#32476;&#21033;&#29992;&#22810;&#22836;&#27880;&#24847;&#21147;&#20256;&#36882;&#26426;&#21046;&#23545;&#36825;&#20123;&#22270;&#33410;&#28857;&#25191;&#34892;&#32972;&#26223;&#36807;&#28388;&#21644;&#35821;&#20041;&#26631;&#35760;&#65292;&#20197;98.0\%&#30340;&#25928;&#29575;&#35782;&#21035;&#19982;&#20027;&#35201;&#29289;&#29702;&#30456;&#20114;&#20316;&#29992;&#30456;&#20851;&#32852;&#30340;&#33410;&#28857;&#65292;&#24182;&#20197;94.9\%&#30340;&#25928;&#29575;&#26681;&#25454;&#31890;&#23376;&#31867;&#22411;&#23558;&#20854;&#26631;&#35760;&#12290;&#35813;&#32593;&#32476;&#30452;&#25509;&#22312;&#25506;&#27979;&#22120;&#21487;&#35266;&#23519;&#37327;&#19978;&#36816;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11872v1 Announce Type: cross  Abstract: Liquid Argon Time Projection Chamber (LArTPC) detector technology offers a wealth of high-resolution information on particle interactions, and leveraging that information to its full potential requires sophisticated automated reconstruction techniques. This article describes NuGraph2, a Graph Neural Network (GNN) for low-level reconstruction of simulated neutrino interactions in a LArTPC detector. Simulated neutrino interactions in the MicroBooNE detector geometry are described as heterogeneous graphs, with energy depositions on each detector plane forming nodes on planar subgraphs. The network utilizes a multi-head attention message-passing mechanism to perform background filtering and semantic labelling on these graph nodes, identifying those associated with the primary physics interaction with 98.0\% efficiency and labelling them according to particle type with 94.9\% efficiency. The network operates directly on detector observables
&lt;/p&gt;</description></item></channel></rss>