<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#23545;&#21453;&#24212;&#27969;&#21160;&#27169;&#22411;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#36827;&#34892;&#37327;&#21270;&#65292;&#29305;&#21035;&#26159;&#22312;&#28237;&#28065;&#39044;&#28151;&#28779;&#28976;&#21160;&#24577;&#20013;&#20851;&#38190;&#21464;&#37327;&#30340;&#24314;&#27169;&#26041;&#38754;&#21462;&#24471;&#37325;&#35201;&#36827;&#23637;</title><link>https://arxiv.org/abs/2402.18729</link><description>&lt;p&gt;
&#21033;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#23545;&#21453;&#24212;&#28237;&#27969;&#23553;&#38381;&#27169;&#22411;&#36827;&#34892;&#20808;&#39564;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
A Priori Uncertainty Quantification of Reacting Turbulence Closure Models using Bayesian Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18729
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#23545;&#21453;&#24212;&#27969;&#21160;&#27169;&#22411;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#36827;&#34892;&#37327;&#21270;&#65292;&#29305;&#21035;&#26159;&#22312;&#28237;&#28065;&#39044;&#28151;&#28779;&#28976;&#21160;&#24577;&#20013;&#20851;&#38190;&#21464;&#37327;&#30340;&#24314;&#27169;&#26041;&#38754;&#21462;&#24471;&#37325;&#35201;&#36827;&#23637;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#20026;&#22823;&#28065;&#27169;&#25311;&#65288;LES&#65289;&#20013;&#30340;&#23376;&#28388;&#27874;&#23610;&#24230;&#65288;SFS&#65289;&#25552;&#20986;&#20102;&#35768;&#22810;&#22522;&#20110;&#29289;&#29702;&#30340;&#23553;&#38381;&#27169;&#22411;&#24418;&#24335;&#65292;&#20294;&#30452;&#25509;&#25968;&#20540;&#27169;&#25311;&#65288;DNS&#65289;&#25552;&#20379;&#30340;&#22823;&#37327;&#25968;&#25454;&#20026;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#24314;&#27169;&#25216;&#26415;&#21019;&#36896;&#20102;&#26426;&#20250;&#12290;&#23613;&#31649;&#28789;&#27963;&#65292;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#20173;&#21462;&#20915;&#20110;&#36873;&#25321;&#30340;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;&#37319;&#29992;&#36825;&#31181;&#27169;&#22411;&#30340;&#22686;&#21152;&#38656;&#35201;&#21487;&#38752;&#22320;&#20272;&#35745;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#20013;&#25968;&#25454;&#30693;&#35782;&#21644;&#36229;&#20986;&#20998;&#24067;&#33539;&#22260;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#26412;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#65288;BNNs&#65289;&#26469;&#25429;&#25417;&#21453;&#24212;&#27969;&#21160;&#27169;&#22411;&#20013;&#30340;&#36923;&#36753;&#19981;&#30830;&#23450;&#24615;&#21644;&#20598;&#28982;&#19981;&#30830;&#23450;&#24615;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#27169;&#25311;&#20102;&#22312;&#28237;&#28065;&#39044;&#28151;&#28779;&#28976;&#21160;&#24577;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#28388;&#27874;&#36827;&#23637;&#21464;&#37327;&#26631;&#37327;&#32791;&#25955;&#29575;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;BNN&#27169;&#22411;&#21487;&#20197;&#25552;&#20379;&#20851;&#20110;&#25968;&#25454;&#39537;&#21160;&#23553;&#38381;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#32467;&#26500;&#30340;&#29420;&#29305;&#35265;&#35299;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#36827;&#34892;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18729v1 Announce Type: cross  Abstract: While many physics-based closure model forms have been posited for the sub-filter scale (SFS) in large eddy simulation (LES), vast amounts of data available from direct numerical simulation (DNS) create opportunities to leverage data-driven modeling techniques. Albeit flexible, data-driven models still depend on the dataset and the functional form of the model chosen. Increased adoption of such models requires reliable uncertainty estimates both in the data-informed and out-of-distribution regimes. In this work, we employ Bayesian neural networks (BNNs) to capture both epistemic and aleatoric uncertainties in a reacting flow model. In particular, we model the filtered progress variable scalar dissipation rate which plays a key role in the dynamics of turbulent premixed flames. We demonstrate that BNN models can provide unique insights about the structure of uncertainty of the data-driven closure models. We also propose a method for the
&lt;/p&gt;</description></item></channel></rss>