<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#22810;&#27169;&#20809;&#32420;&#21033;&#29992;&#27700;&#24211;&#35745;&#31639;&#33539;&#20363;&#36827;&#34892;&#20998;&#31867;&#65292;&#31934;&#24230;&#39640;&#20110;&#30452;&#25509;&#35757;&#32451;&#21407;&#22987;&#22270;&#20687;&#21644;&#20256;&#32479;&#30340;&#20256;&#36755;&#30697;&#38453;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2210.04745</link><description>&lt;p&gt;
&#22810;&#27169;&#20809;&#32420;&#27700;&#24211;&#35745;&#31639;&#20811;&#26381;&#20102;&#27973;&#23618;&#31070;&#32463;&#32593;&#32476;&#20998;&#31867;&#22120;
&lt;/p&gt;
&lt;p&gt;
Multi-mode fiber reservoir computing overcomes shallow neural networks classifiers. (arXiv:2210.04745v2 [physics.optics] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.04745
&lt;/p&gt;
&lt;p&gt;
&#22810;&#27169;&#20809;&#32420;&#21033;&#29992;&#27700;&#24211;&#35745;&#31639;&#33539;&#20363;&#36827;&#34892;&#20998;&#31867;&#65292;&#31934;&#24230;&#39640;&#20110;&#30452;&#25509;&#35757;&#32451;&#21407;&#22987;&#22270;&#20687;&#21644;&#20256;&#32479;&#30340;&#20256;&#36755;&#30697;&#38453;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26080;&#24207;&#20809;&#23376;&#23398;&#39046;&#22495;&#20013;&#65292;&#24120;&#35265;&#30340;&#30446;&#26631;&#26159;&#23545;&#19981;&#36879;&#26126;&#26448;&#26009;&#36827;&#34892;&#34920;&#24449;&#65292;&#20197;&#25511;&#21046;&#20809;&#30340;&#20256;&#36882;&#25110;&#25191;&#34892;&#25104;&#20687;&#12290;&#22312;&#21508;&#31181;&#22797;&#26434;&#30340;&#22120;&#20214;&#20013;&#65292;&#22810;&#27169;&#20809;&#32420;&#20197;&#20854;&#25104;&#26412;&#25928;&#30410;&#39640;&#12289;&#26131;&#20110;&#25805;&#20316;&#30340;&#29305;&#28857;&#33073;&#39062;&#32780;&#20986;&#65292;&#20351;&#20854;&#22312;&#20960;&#20010;&#20219;&#21153;&#20013;&#20855;&#26377;&#21560;&#24341;&#21147;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#21033;&#29992;&#27700;&#24211;&#35745;&#31639;&#33539;&#20363;&#65292;&#23558;&#36825;&#20123;&#20809;&#32420;&#36716;&#21270;&#20026;&#38543;&#26426;&#30828;&#20214;&#25237;&#24433;&#20202;&#65292;&#23558;&#36755;&#20837;&#25968;&#25454;&#38598;&#36716;&#21270;&#20026;&#39640;&#32500;&#26001;&#28857;&#22270;&#20687;&#38598;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#30446;&#26631;&#26159;&#35777;&#26126;&#65292;&#36890;&#36807;&#35757;&#32451;&#21333;&#20010;&#36923;&#36753;&#22238;&#24402;&#23618;&#23545;&#36825;&#20123;&#38543;&#26426;&#25968;&#25454;&#36827;&#34892;&#20998;&#31867;&#65292;&#21487;&#20197;&#25552;&#39640;&#31934;&#24230;&#65292;&#30456;&#27604;&#20043;&#19979;&#30452;&#25509;&#35757;&#32451;&#21407;&#22987;&#22270;&#20687;&#35201;&#26356;&#20026;&#20934;&#30830;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#25105;&#20204;&#21457;&#29616;&#20351;&#29992;&#27700;&#24211;&#25152;&#36798;&#21040;&#30340;&#20998;&#31867;&#20934;&#30830;&#24615;&#20063;&#39640;&#20110;&#37319;&#29992;&#20256;&#32479;&#30340;&#20256;&#36755;&#30697;&#38453;&#27169;&#22411;&#65292;&#21518;&#32773;&#26159;&#25551;&#36848;&#36890;&#36807;&#26080;&#24207;&#22120;&#20214;&#20256;&#36882;&#20809;&#30340;&#24191;&#27867;&#25509;&#21463;&#24037;&#20855;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36825;&#31181;&#25913;&#36827;&#24615;&#33021;&#30340;&#21407;&#22240;&#22312;&#20110;&#27700;&#24211;&#30340;&#21160;&#21147;&#23398;&#20855;&#26377;&#26356;&#39640;&#30340;&#23481;&#37327;&#26469;&#25429;&#25417;&#22797;&#26434;&#30340;&#36755;&#20837;&#36755;&#20986;&#26144;&#23556;&#65292;&#30456;&#23545;&#20110;&#20256;&#36755;&#30697;&#38453;&#30340;&#32447;&#24615;&#26144;&#23556;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the field of disordered photonics, a common objective is to characterize optically opaque materials for controlling light delivery or performing imaging. Among various complex devices, multi-mode optical fibers stand out as cost-effective and easy-to-handle tools, making them attractive for several tasks. In this context, we leverage the reservoir computing paradigm to recast these fibers into random hardware projectors, transforming an input dataset into a higher dimensional speckled image set. The goal of our study is to demonstrate that using such randomized data for classification by training a single logistic regression layer improves accuracy compared to training on direct raw images. Interestingly, we found that the classification accuracy achieved using the reservoir is also higher than that obtained with the standard transmission matrix model, a widely accepted tool for describing light transmission through disordered devices. We find that the reason for such improved perfo
&lt;/p&gt;</description></item></channel></rss>