<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;DESI&#25104;&#20687;&#35843;&#26597;&#30340;&#20142;&#32418;&#26143;&#31995;&#30340;&#35282;&#32858;&#31867;&#20449;&#24687;&#38480;&#21046;&#20102;&#23616;&#37096;&#21407;&#21021;&#38750;&#39640;&#26031;&#24615;&#21442;&#25968;fNL&#65292;&#21457;&#29616;&#22312;&#20551;&#35774;&#23431;&#23449;&#35268;&#24459;&#24615;&#20851;&#31995;&#30340;&#24773;&#20917;&#19979;&#65292;fNL&#20026;47^{+14(+29)}_{-11(-22)}&#65292;&#20351;&#29992;&#26356;&#31215;&#26497;&#30340;&#22788;&#29702;&#26041;&#27861;&#21518;&#65292;&#26368;&#22823;&#20284;&#28982;&#20540;&#30053;&#24494;&#20559;&#31163;fNL&#8776;5&#12290;</title><link>http://arxiv.org/abs/2307.01753</link><description>&lt;p&gt;
&#26469;&#33258;DESI&#20142;&#32418;&#26143;&#31995;&#22823;&#23610;&#24230;&#32858;&#31867;&#30340;&#23616;&#37096;&#21407;&#21021;&#38750;&#39640;&#26031;&#24615;&#32763;&#35793;&#26631;&#39064;
&lt;/p&gt;
&lt;p&gt;
Local primordial non-Gaussianity from the large-scale clustering of photometric DESI luminous red galaxies. (arXiv:2307.01753v1 [astro-ph.CO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01753
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;DESI&#25104;&#20687;&#35843;&#26597;&#30340;&#20142;&#32418;&#26143;&#31995;&#30340;&#35282;&#32858;&#31867;&#20449;&#24687;&#38480;&#21046;&#20102;&#23616;&#37096;&#21407;&#21021;&#38750;&#39640;&#26031;&#24615;&#21442;&#25968;fNL&#65292;&#21457;&#29616;&#22312;&#20551;&#35774;&#23431;&#23449;&#35268;&#24459;&#24615;&#20851;&#31995;&#30340;&#24773;&#20917;&#19979;&#65292;fNL&#20026;47^{+14(+29)}_{-11(-22)}&#65292;&#20351;&#29992;&#26356;&#31215;&#26497;&#30340;&#22788;&#29702;&#26041;&#27861;&#21518;&#65292;&#26368;&#22823;&#20284;&#28982;&#20540;&#30053;&#24494;&#20559;&#31163;fNL&#8776;5&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;Dark Energy Spectroscopic Instrument (DESI)&#25104;&#20687;&#35843;&#26597;&#30340;&#20142;&#32418;&#26143;&#31995;&#30340;&#35282;&#32858;&#31867;&#20449;&#24687;&#26469;&#38480;&#21046;&#23616;&#37096;&#21407;&#21021;&#38750;&#39640;&#26031;&#24615;&#21442;&#25968;fNL&#12290;&#25105;&#20204;&#30340;&#26679;&#26412;&#21253;&#25324;&#36229;&#36807;1200&#19975;&#20010;&#30446;&#26631;&#65292;&#35206;&#30422;&#20102;14000&#24179;&#26041;&#24230;&#30340;&#22825;&#31354;&#21306;&#22495;&#65292;&#32418;&#31227;&#33539;&#22260;&#20026;0.2 &lt; z &lt; 1.35&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#38134;&#27827;&#28040;&#20809;&#12289;&#35843;&#26597;&#28145;&#24230;&#21644;&#35266;&#27979;&#26465;&#20214;&#26159;&#31995;&#32479;&#35823;&#24046;&#30340;&#20027;&#35201;&#26469;&#28304;&#65292;&#24182;&#37319;&#29992;&#32447;&#24615;&#22238;&#24402;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#26469;&#20943;&#36731;&#22823;&#23610;&#24230;&#19978;&#30340;&#38750;&#23431;&#23449;&#23398;&#36807;&#24230;&#32858;&#31867;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32463;&#36807;&#20102;&#21253;&#21547;&#21644;&#19981;&#21253;&#21547;fNL&#21644;&#31995;&#32479;&#35823;&#24046;&#30340;&#23545;&#25968;&#27491;&#24577;&#27169;&#25311;&#30340;&#27979;&#35797;&#65292;&#32467;&#26524;&#26174;&#31034;&#20102;&#31070;&#32463;&#32593;&#32476;&#22788;&#29702;&#22312;&#20943;&#23567;&#21097;&#20313;&#31995;&#32479;&#35823;&#24046;&#26041;&#38754;&#30340;&#21331;&#36234;&#24615;&#33021;&#12290;&#22312;&#20551;&#35774;&#23431;&#23449;&#35268;&#24459;&#24615;&#20851;&#31995;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21457;&#29616;fNL&#30340;68\%&#65288;95\%&#65289;&#32622;&#20449;&#21306;&#38388;&#20026;fNL = 47^{+14(+29)}_{-11(-22)}&#12290;&#36890;&#36807;&#26356;&#31215;&#26497;&#30340;&#22788;&#29702;&#26041;&#27861;&#65292;&#21253;&#25324;&#23545;&#25152;&#26377;&#25104;&#20687;&#22270;&#38598;&#36827;&#34892;&#22238;&#24402;&#65292;&#25105;&#20204;&#30340;&#26368;&#22823;&#20284;&#28982;&#20540;&#30053;&#24494;&#20559;&#31163;fNL&#8776;5&#12290;
&lt;/p&gt;
&lt;p&gt;
We use angular clustering of luminous red galaxies from the Dark Energy Spectroscopic Instrument (DESI) imaging surveys to constrain the local primordial non-Gaussianity parameter fNL. Our sample comprises over 12 million targets, covering 14,000 square degrees of the sky, with redshifts in the range 0.2&lt; z &lt; 1.35. We identify Galactic extinction, survey depth, and astronomical seeing as the primary sources of systematic error, and employ linear regression and artificial neural networks to alleviate non-cosmological excess clustering on large scales. Our methods are tested against log-normal simulations with and without fNL and systematics, showing superior performance of the neural network treatment in reducing remaining systematics. Assuming the universality relation, we find fNL $= 47^{+14(+29)}_{-11(-22)}$ at 68\%(95\%) confidence. With a more aggressive treatment, including regression against the full set of imaging maps, our maximum likelihood value shifts slightly to fNL$ \sim 5
&lt;/p&gt;</description></item></channel></rss>