<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#22320;&#29702;&#26631;&#35760;&#30340;&#25512;&#29305;&#25968;&#25454;&#21644;&#35745;&#31639;&#26041;&#27861;&#65292;&#22312;&#33521;&#26684;&#20848;&#21644;&#23041;&#23572;&#22763;&#30340;&#19971;&#21315;&#20010;&#34892;&#25919;&#21306;&#22495;&#19978;&#36827;&#34892;&#20102;&#22823;&#35268;&#27169;&#26144;&#23556;&#65292;&#21457;&#29616;&#31038;&#20250;&#32463;&#27982;&#20132;&#21449;&#24433;&#21709;&#20102;&#35821;&#35328;&#20351;&#29992;&#65292;&#28151;&#21512;&#19981;&#21516;&#31038;&#20250;&#32463;&#27982;&#38454;&#23618;&#30340;&#20154;&#32676;&#39057;&#29575;&#20559;&#31163;&#26631;&#20934;&#35821;&#27861;&#30340;&#31243;&#24230;&#36234;&#39640;&#65292;&#20854;&#25910;&#20837;&#20851;&#32852;&#36234;&#24369;&#12290;</title><link>http://arxiv.org/abs/2307.10016</link><description>&lt;p&gt;
&#26041;&#35328;&#30340;&#30896;&#25758;&#65306;&#31038;&#20250;&#32463;&#27982;&#20132;&#21449;&#23545;&#35821;&#35328;&#20351;&#29992;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
When Dialects Collide: How Socioeconomic Mixing Affects Language Use. (arXiv:2307.10016v1 [physics.soc-ph] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10016
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#22320;&#29702;&#26631;&#35760;&#30340;&#25512;&#29305;&#25968;&#25454;&#21644;&#35745;&#31639;&#26041;&#27861;&#65292;&#22312;&#33521;&#26684;&#20848;&#21644;&#23041;&#23572;&#22763;&#30340;&#19971;&#21315;&#20010;&#34892;&#25919;&#21306;&#22495;&#19978;&#36827;&#34892;&#20102;&#22823;&#35268;&#27169;&#26144;&#23556;&#65292;&#21457;&#29616;&#31038;&#20250;&#32463;&#27982;&#20132;&#21449;&#24433;&#21709;&#20102;&#35821;&#35328;&#20351;&#29992;&#65292;&#28151;&#21512;&#19981;&#21516;&#31038;&#20250;&#32463;&#27982;&#38454;&#23618;&#30340;&#20154;&#32676;&#39057;&#29575;&#20559;&#31163;&#26631;&#20934;&#35821;&#27861;&#30340;&#31243;&#24230;&#36234;&#39640;&#65292;&#20854;&#25910;&#20837;&#20851;&#32852;&#36234;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#20204;&#30340;&#31038;&#20250;&#32463;&#27982;&#32972;&#26223;&#19982;&#20182;&#20204;&#20351;&#29992;&#26631;&#20934;&#35821;&#35328;&#30340;&#26041;&#24335;&#24182;&#19981;&#29420;&#31435;&#65292;&#36825;&#22312;&#21508;&#31181;&#31038;&#20250;&#35821;&#35328;&#23398;&#30740;&#31350;&#20013;&#24050;&#32463;&#24471;&#21040;&#35777;&#26126;&#12290;&#28982;&#32780;&#65292;&#19981;&#21516;&#31038;&#20250;&#32463;&#27982;&#38454;&#23618;&#30340;&#20154;&#20204;&#20132;&#21449;&#28151;&#21512;&#21487;&#33021;&#23545;&#36825;&#20123;&#30456;&#20851;&#24615;&#36896;&#25104;&#20309;&#31181;&#24433;&#21709;&#65292;&#22312;&#23450;&#37327;&#35282;&#24230;&#19978;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#25506;&#32034;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#24102;&#22320;&#29702;&#26631;&#35760;&#30340;&#25512;&#29305;&#21644;&#21487;&#36716;&#31227;&#30340;&#35745;&#31639;&#26041;&#27861;&#65292;&#22312;&#33521;&#26684;&#20848;&#21644;&#23041;&#23572;&#22763;&#30340;&#19971;&#21315;&#20010;&#34892;&#25919;&#21306;&#22495;&#19978;&#23545;&#19982;&#26631;&#20934;&#33521;&#35821;&#20559;&#31163;&#30340;&#24773;&#20917;&#36827;&#34892;&#22823;&#35268;&#27169;&#26144;&#23556;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#25968;&#25454;&#19982;&#39640;&#20998;&#36776;&#29575;&#30340;&#25910;&#20837;&#22320;&#22270;&#32467;&#21512;&#36215;&#26469;&#65292;&#20026;&#23621;&#20303;&#22320;&#29992;&#25143;&#20998;&#37197;&#19968;&#20010;&#20195;&#29702;&#31038;&#20250;&#32463;&#27982;&#25351;&#26631;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#22312;&#20843;&#20010;&#22823;&#37117;&#24066;&#21306;&#22495;&#65292;&#25105;&#20204;&#21457;&#29616;&#19968;&#31181;&#19968;&#33268;&#30340;&#27169;&#24335;&#65292;&#34920;&#26126;&#19981;&#21516;&#31038;&#20250;&#32463;&#27982;&#38454;&#23618;&#30340;&#20154;&#20204;&#28151;&#21512;&#24471;&#36234;&#22810;&#65292;&#20854;&#20559;&#31163;&#26631;&#20934;&#35821;&#27861;&#21644;&#25910;&#20837;&#30340;&#39057;&#29575;&#23601;&#36234;&#19981;&#30456;&#20114;&#20381;&#23384;&#12290;
&lt;/p&gt;
&lt;p&gt;
The socioeconomic background of people and how they use standard forms of language are not independent, as demonstrated in various sociolinguistic studies. However, the extent to which these correlations may be influenced by the mixing of people from different socioeconomic classes remains relatively unexplored from a quantitative perspective. In this work we leverage geotagged tweets and transferable computational methods to map deviations from standard English on a large scale, in seven thousand administrative areas of England and Wales. We combine these data with high-resolution income maps to assign a proxy socioeconomic indicator to home-located users. Strikingly, across eight metropolitan areas we find a consistent pattern suggesting that the more different socioeconomic classes mix, the less interdependent the frequency of their departures from standard grammar and their income become. Further, we propose an agent-based model of linguistic variety adoption that sheds light on th
&lt;/p&gt;</description></item></channel></rss>