<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#36890;&#36807;&#21477;&#27861;&#36317;&#31163;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#25506;&#32034;&#35821;&#35328;&#20851;&#31995;&#65292;&#20351;&#29992;POS trigrams&#26368;&#22823;&#21270;&#25429;&#25417;&#21477;&#27861;&#21464;&#21270;&#65292;&#24314;&#31435;&#35821;&#35328;&#36830;&#25509;&#24182;&#25581;&#31034;&#35821;&#35328;&#23478;&#26063;&#21644;&#32676;&#20307;&#30340;&#31751;&#12290;</title><link>https://arxiv.org/abs/2403.18430</link><description>&lt;p&gt;
&#36890;&#36807;&#21477;&#27861;&#36317;&#31163;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#25506;&#32034;&#35821;&#35328;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Exploring language relations through syntactic distances and geographic proximity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18430
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21477;&#27861;&#36317;&#31163;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#25506;&#32034;&#35821;&#35328;&#20851;&#31995;&#65292;&#20351;&#29992;POS trigrams&#26368;&#22823;&#21270;&#25429;&#25417;&#21477;&#27861;&#21464;&#21270;&#65292;&#24314;&#31435;&#35821;&#35328;&#36830;&#25509;&#24182;&#25581;&#31034;&#35821;&#35328;&#23478;&#26063;&#21644;&#32676;&#20307;&#30340;&#31751;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#35328;&#34987;&#20998;&#20026;&#20849;&#20139;&#30456;&#21516;&#35821;&#35328;&#29305;&#24449;&#30340;&#35821;&#31995;&#12290;&#34429;&#28982;&#36825;&#31181;&#26041;&#27861;&#22312;&#29702;&#35299;&#19981;&#21516;&#35821;&#35328;&#20043;&#38388;&#30340;&#22522;&#22240;&#20851;&#31995;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#38656;&#35201;&#26356;&#22810;&#30340;&#20998;&#26512;&#26469;&#20934;&#30830;&#37327;&#21270;&#23427;&#20204;&#30340;&#20851;&#32852;&#24615;&#65292;&#29305;&#21035;&#26159;&#22312;&#36739;&#23569;&#30740;&#31350;&#30340;&#35821;&#35328;&#23618;&#38754;&#65292;&#27604;&#22914;&#21477;&#27861;&#12290;&#26412;&#25991;&#20351;&#29992;&#20174;Universal Dependencies&#25968;&#25454;&#38598;&#20013;&#25552;&#21462;&#30340;&#19968;&#31995;&#21015;&#35789;&#24615;&#65288;POS&#65289;&#26469;&#25506;&#32034;&#35821;&#35328;&#36317;&#31163;&#12290;&#22312;&#20449;&#24687;&#35770;&#26694;&#26550;&#20869;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#37319;&#29992;POS&#19977;&#20803;&#32452;&#26368;&#22823;&#21270;&#25429;&#25417;&#21477;&#27861;&#21464;&#21270;&#30340;&#21487;&#33021;&#24615;&#65292;&#21516;&#26102;&#19982;&#21487;&#29992;&#25968;&#25454;&#37327;&#20860;&#23481;&#12290;&#36890;&#36807;&#22522;&#20110;POS&#20998;&#24067;&#30340;&#25104;&#23545;&#36317;&#31163;&#35780;&#20272;&#24314;&#31435;&#35821;&#35328;&#36830;&#25509;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#26126;&#30830;&#23545;&#24212;&#20110;&#20247;&#25152;&#21608;&#30693;&#30340;&#35821;&#35328;&#23478;&#26063;&#21644;&#32676;&#20307;&#30340;&#31751;&#65292;&#24322;&#24120;&#24773;&#20917;&#34987;&#35299;&#37322;&#20026;&#29420;&#29305;&#30340;&#24418;&#24577;&#31867;&#22411;&#23398;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#33719;&#24471;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18430v1 Announce Type: new  Abstract: Languages are grouped into families that share common linguistic traits. While this approach has been successful in understanding genetic relations between diverse languages, more analyses are needed to accurately quantify their relatedness, especially in less studied linguistic levels such as syntax. Here, we explore linguistic distances using series of parts of speech (POS) extracted from the Universal Dependencies dataset. Within an information-theoretic framework, we show that employing POS trigrams maximizes the possibility of capturing syntactic variations while being at the same time compatible with the amount of available data. Linguistic connections are then established by assessing pairwise distances based on the POS distributions. Intriguingly, our analysis reveals definite clusters that correspond to well known language families and groups, with exceptions explained by distinct morphological typologies. Furthermore, we obtain
&lt;/p&gt;</description></item></channel></rss>