<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#38134;&#34892;&#38388;&#32593;&#32476;&#37325;&#26500;&#30740;&#31350;&#20013;&#65292;&#36890;&#36807;&#32422;&#26463;&#23494;&#24230;&#21644;&#20114;&#24800;&#24615;&#65292;&#25104;&#21151;&#35299;&#20915;&#20102;&#26377;&#21521;&#24490;&#29615;&#22797;&#21046;&#38382;&#39064;&#65292;&#25581;&#31034;&#20102;&#39640;&#38454;&#24490;&#29615;&#32479;&#35745;&#37327;&#21463;&#26368;&#30701;&#24490;&#29615;&#25968;&#37327;&#32422;&#26463;&#30340;&#37325;&#35201;&#24615;</title><link>https://arxiv.org/abs/2402.11136</link><description>&lt;p&gt;
&#38134;&#34892;&#38388;&#32593;&#32476;&#37325;&#26500;: &#23494;&#24230;&#21644;&#20114;&#24800;&#24615;&#32422;&#26463;
&lt;/p&gt;
&lt;p&gt;
Interbank network reconstruction enforcing density and reciprocity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11136
&lt;/p&gt;
&lt;p&gt;
&#38134;&#34892;&#38388;&#32593;&#32476;&#37325;&#26500;&#30740;&#31350;&#20013;&#65292;&#36890;&#36807;&#32422;&#26463;&#23494;&#24230;&#21644;&#20114;&#24800;&#24615;&#65292;&#25104;&#21151;&#35299;&#20915;&#20102;&#26377;&#21521;&#24490;&#29615;&#22797;&#21046;&#38382;&#39064;&#65292;&#25581;&#31034;&#20102;&#39640;&#38454;&#24490;&#29615;&#32479;&#35745;&#37327;&#21463;&#26368;&#30701;&#24490;&#29615;&#25968;&#37327;&#32422;&#26463;&#30340;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#39118;&#38505;&#21644;&#21361;&#26426;&#22312;&#38134;&#34892;&#20043;&#38388;&#20256;&#25773;&#30340;&#32593;&#32476;&#26159;&#20851;&#38190;&#65292;&#20294;&#30001;&#20110;&#26426;&#23494;&#24615;&#65292;&#23427;&#20204;&#30340;&#23454;&#35777;&#32467;&#26500;&#24182;&#19981;&#20844;&#24320;&#12290;&#36825;&#19968;&#38480;&#21046;&#20419;&#20351;&#20102;&#20174;&#37096;&#20998;&#12289;&#24635;&#37327;&#20449;&#24687;&#20013;&#37325;&#26500;&#32593;&#32476;&#30340;&#26041;&#27861;&#30340;&#21457;&#23637;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#21363;&#20351;&#26159;&#30446;&#21069;&#26368;&#22909;&#30340;&#26041;&#27861;&#20063;&#26080;&#27861;&#22797;&#21046;&#26377;&#21521;&#24490;&#29615;&#30340;&#25968;&#37327;&#65292;&#32780;&#36825;&#20123;&#24490;&#29615;&#22312;&#20915;&#23450;&#22270;&#35889;&#21450;&#32593;&#32476;&#31283;&#23450;&#24230;&#21644;&#31995;&#32479;&#24615;&#39118;&#38505;&#31243;&#24230;&#26041;&#38754;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#26412;&#25991;&#36890;&#36807;&#21033;&#29992;&#39640;&#38454;&#24490;&#29615;&#32479;&#35745;&#37327;&#21463;&#26368;&#30701;&#24490;&#29615;&#25968;&#37327;&#65288;&#21363;&#20855;&#26377;&#20114;&#24800;&#38142;&#25509;&#30340;&#21452;&#26680;&#25968;&#37327;&#65289;&#32422;&#26463;&#30340;&#20551;&#35774;&#26469;&#24212;&#23545;&#36825;&#19968;&#25361;&#25112;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#22312;&#24847;&#22823;&#21033;&#38134;&#34892;e-MID&#25968;&#25454;&#38598;&#19978;&#23545;&#20114;&#24800;&#38142;&#25509;&#36827;&#34892;&#20102;&#35814;&#32454;&#20998;&#26512;&#65292;&#21457;&#29616;&#20114;&#24800;&#38142;&#25509;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#38543;&#30528;&#26102;&#38388;&#20998;&#36776;&#29575;&#30340;&#22686;&#21152;&#32780;&#31995;&#32479;&#24615;&#22686;&#21152;&#65292;&#36890;&#24120;&#21576;&#29616;&#28151;&#20081;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11136v1 Announce Type: new  Abstract: Networks of financial exposures are the key propagators of risk and distress among banks, but their empirical structure is not publicly available because of confidentiality. This limitation has triggered the development of methods of network reconstruction from partial, aggregate information. Unfortunately, even the best methods available fail in replicating the number of directed cycles, which on the other hand play a crucial role in determining graph spectra and hence the degree of network stability and systemic risk. Here we address this challenge by exploiting the hypothesis that the statistics of higher-order cycles is strongly constrained by that of the shortest ones, i.e. by the amount of dyads with reciprocated links. First, we provide a detailed analysis of link reciprocity on the e-MID dataset of Italian banks, finding that correlations between reciprocal links systematically increase with the temporal resolution, typically cha
&lt;/p&gt;</description></item></channel></rss>