<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#20272;&#35745;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#20013;&#21518;&#39564;&#27010;&#29575;&#21644;&#22122;&#22768;&#21442;&#25968;&#30340;&#26032;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#36890;&#36807;&#26399;&#26395;&#26368;&#22823;&#21270;&#65288;EM&#65289;&#31639;&#27861;&#35299;&#20915;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#26465;&#20214;&#26631;&#20934;&#21270;&#27969;&#26469;&#36817;&#20284;&#21518;&#39564;&#27010;&#29575;&#12290;&#35813;&#27169;&#22411;&#33021;&#22815;&#25972;&#21512;&#26469;&#33258;&#22810;&#20010;&#27979;&#37327;&#30340;&#20449;&#24687;&#12290;</title><link>https://arxiv.org/abs/2402.02964</link><description>&lt;p&gt;
&#28151;&#21512;&#22122;&#22768;&#19982;&#26465;&#20214;&#28145;&#24230;&#29983;&#25104;&#27169;&#22411;&#19979;&#30340;&#21518;&#39564;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Mixed Noise and Posterior Estimation with Conditional DeepGEM
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02964
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#20272;&#35745;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#20013;&#21518;&#39564;&#27010;&#29575;&#21644;&#22122;&#22768;&#21442;&#25968;&#30340;&#26032;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#36890;&#36807;&#26399;&#26395;&#26368;&#22823;&#21270;&#65288;EM&#65289;&#31639;&#27861;&#35299;&#20915;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#26465;&#20214;&#26631;&#20934;&#21270;&#27969;&#26469;&#36817;&#20284;&#21518;&#39564;&#27010;&#29575;&#12290;&#35813;&#27169;&#22411;&#33021;&#22815;&#25972;&#21512;&#26469;&#33258;&#22810;&#20010;&#27979;&#37327;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#28151;&#21512;&#22122;&#22768;&#27169;&#22411;&#30340;&#38388;&#25509;&#27979;&#37327;&#21644;&#32435;&#31859;&#35745;&#37327;&#24212;&#29992;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#32852;&#21512;&#20272;&#35745;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#20013;&#30340;&#21518;&#39564;&#27010;&#29575;&#21644;&#22122;&#22768;&#21442;&#25968;&#12290;&#25105;&#20204;&#25552;&#20986;&#36890;&#36807;&#26399;&#26395;&#26368;&#22823;&#21270;&#65288;EM&#65289;&#31639;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#22522;&#20110;&#24403;&#21069;&#30340;&#22122;&#22768;&#21442;&#25968;&#65292;&#25105;&#20204;&#22312;E&#27493;&#20013;&#23398;&#20064;&#20102;&#19968;&#20010;&#26465;&#20214;&#26631;&#20934;&#21270;&#27969;&#65292;&#20197;&#36817;&#20284;&#21518;&#39564;&#27010;&#29575;&#12290;&#22312;M&#27493;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20877;&#27425;&#36890;&#36807;EM&#31639;&#27861;&#25214;&#21040;&#22122;&#22768;&#21442;&#25968;&#30340;&#26356;&#26032;&#65292;&#20854;&#20855;&#26377;&#35299;&#26512;&#20844;&#24335;&#12290;&#25105;&#20204;&#23558;&#26465;&#20214;&#26631;&#20934;&#21270;&#27969;&#30340;&#35757;&#32451;&#19982;&#21069;&#21521;&#21644;&#21453;&#21521;KL&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#23637;&#31034;&#25105;&#20204;&#30340;&#27169;&#22411;&#33021;&#22815;&#25972;&#21512;&#26469;&#33258;&#35768;&#22810;&#27979;&#37327;&#30340;&#20449;&#24687;&#65292;&#32780;&#19981;&#20687;&#20043;&#21069;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by indirect measurements and applications from nanometrology with a mixed noise model, we develop a novel algorithm for jointly estimating the posterior and the noise parameters in Bayesian inverse problems. We propose to solve the problem by an expectation maximization (EM) algorithm. Based on the current noise parameters, we learn in the E-step a conditional normalizing flow that approximates the posterior. In the M-step, we propose to find the noise parameter updates again by an EM algorithm, which has analytical formulas. We compare the training of the conditional normalizing flow with the forward and reverse KL, and show that our model is able to incorporate information from many measurements, unlike previous approaches.
&lt;/p&gt;</description></item></channel></rss>