<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#35813;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#39044;&#27979;&#22312;&#22024;&#26434;&#30340;&#21160;&#21147;&#31995;&#32479;&#20013;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#20542;&#35206;&#65292;&#21253;&#25324;&#39044;&#27979;&#22823;&#35199;&#27915;&#32463;&#21521;&#32763;&#36716;&#29615;&#27969;&#30340;&#20542;&#35206;&#21644;&#23849;&#28291;&#12290;</title><link>https://arxiv.org/abs/2402.14877</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#22823;&#35199;&#27915;&#32463;&#21521;&#32763;&#36716;&#29615;&#27969;&#30340;&#20542;&#35206;&#21644;&#23849;&#28291;
&lt;/p&gt;
&lt;p&gt;
Machine-learning prediction of tipping and collapse of the Atlantic Meridional Overturning Circulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14877
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#39044;&#27979;&#22312;&#22024;&#26434;&#30340;&#21160;&#21147;&#31995;&#32479;&#20013;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#20542;&#35206;&#65292;&#21253;&#25324;&#39044;&#27979;&#22823;&#35199;&#27915;&#32463;&#21521;&#32763;&#36716;&#29615;&#27969;&#30340;&#20542;&#35206;&#21644;&#23849;&#28291;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35199;&#27915;&#32463;&#21521;&#32763;&#36716;&#29615;&#27969;(AMOC)&#30340;&#26368;&#26032;&#30740;&#31350;&#24341;&#21457;&#20102;&#23545;&#20854;&#28508;&#22312;&#20542;&#35206;&#30340;&#25285;&#24551;&#65292;&#36825;&#26159;&#30001;&#20110;&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#21271;&#22823;&#35199;&#27915;&#28129;&#27700;&#36755;&#20837;&#22686;&#21152;&#30340;&#19968;&#20010;&#20020;&#30028;&#28857;&#12290;&#39044;&#27979;&#30340;&#23849;&#28291;&#26102;&#38388;&#31383;&#21475;&#22823;&#32422;&#22312;&#26412;&#19990;&#32426;&#20013;&#21494;&#65292;&#26368;&#26089;&#21487;&#33021;&#22312;&#22823;&#32422;&#20004;&#24180;&#21518;&#24320;&#22987;&#12290;&#26356;&#19968;&#33324;&#22320;&#65292;&#23545;&#31995;&#32479;&#20174;&#19968;&#20010;&#31283;&#23450;&#24179;&#34913;&#29366;&#24577;&#36716;&#21464;&#21040;&#21478;&#19968;&#20010;&#31283;&#23450;&#29366;&#24577;&#30340;&#20020;&#30028;&#28857;&#30340;&#39044;&#27979;&#23545;&#20110;&#24191;&#27867;&#39046;&#22495;&#37117;&#26159;&#30456;&#20851;&#30340;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#39044;&#27979;&#22024;&#26434;&#30340;&#21160;&#21147;&#31995;&#32479;&#20013;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#20542;&#35206;&#65292;&#24182;&#22312;&#22810;&#20010;&#31995;&#32479;&#19978;&#36827;&#34892;&#27979;&#35797;&#65292;&#21253;&#25324;AMOC&#12289;&#29983;&#24577;&#32593;&#32476;&#12289;&#30005;&#21147;&#31995;&#32479;&#21644;&#27668;&#20505;&#27169;&#22411;&#12290;&#23545;&#20110;AMOC&#65292;&#25105;&#20204;&#22522;&#20110;&#27169;&#25311;&#25351;&#32441;&#25968;&#25454;&#21644;&#28023;&#34920;&#28201;&#24230;&#30340;&#30495;&#23454;&#25968;&#25454;&#36827;&#34892;&#39044;&#27979;&#65292;&#23558;&#28508;&#22312;&#20542;&#35206;&#30340;&#26102;&#38388;&#31383;&#21475;&#32622;&#20110;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14877v1 Announce Type: cross  Abstract: Recent research on the Atlantic Meridional Overturning Circulation (AMOC) raised concern about its potential collapse through a tipping point due to the climate-change caused increase in the freshwater input into the North Atlantic. The predicted time window of collapse is centered about the middle of the century and the earliest possible start is approximately two years from now. More generally, anticipating a tipping point at which the system transitions from one stable steady state to another is relevant to a broad range of fields. We develop a machine-learning approach to predicting tipping in noisy dynamical systems with a time-varying parameter and test it on a number of systems including the AMOC, ecological networks, an electrical power system, and a climate model. For the AMOC, our prediction based on simulated fingerprint data and real data of the sea surface temperature places the time window of a potential collapse between 
&lt;/p&gt;</description></item></channel></rss>