<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27169;&#25311;&#21457;&#29616;&#27169;&#22411;&#21487;&#20197;&#20135;&#29983;&#32858;&#38598;&#34892;&#20026;&#65292;&#24182;&#23637;&#29616;&#20102;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#26356;&#36827;&#19968;&#27493;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#65292;&#21487;&#20197;&#35299;&#37322;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#21171;&#21160;&#21147;&#32858;&#38598;&#29616;&#35937;&#65292;&#36825;&#19968;&#32467;&#35770;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.09720</link><description>&lt;p&gt;
&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#25311;&#20013;&#30340;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;
&lt;/p&gt;
&lt;p&gt;
Econotaxis in modeling urbanization by labor force migration. (arXiv:2303.09720v1 [nlin.AO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09720
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27169;&#25311;&#21457;&#29616;&#27169;&#22411;&#21487;&#20197;&#20135;&#29983;&#32858;&#38598;&#34892;&#20026;&#65292;&#24182;&#23637;&#29616;&#20102;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#26356;&#36827;&#19968;&#27493;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#65292;&#21487;&#20197;&#35299;&#37322;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#21171;&#21160;&#21147;&#32858;&#38598;&#29616;&#35937;&#65292;&#36825;&#19968;&#32467;&#35770;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#20027;&#21160;&#24067;&#26391;&#31890;&#23376;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21171;&#21160;&#21147;&#36801;&#31227;&#24494;&#35266;&#27169;&#22411;&#12290;&#36890;&#36807;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#25105;&#20204;&#30340;&#27169;&#22411;&#20135;&#29983;&#20102;&#20174;&#38543;&#26426;&#21021;&#22987;&#20998;&#24067;&#20013;&#32858;&#38598;&#21040;&#19968;&#36215;&#30340;&#19968;&#32676;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#35266;&#23519;&#21040;&#20102;Zipf&#21644;Okun&#23450;&#24459;&#36825;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#20026;&#20102;&#25581;&#31034;&#20135;&#29983;&#30340;&#32858;&#38598;&#29616;&#35937;&#32972;&#21518;&#30340;&#26426;&#21046;&#65292;&#25105;&#20204;&#20174;&#25105;&#20204;&#30340;&#24494;&#35266;&#27169;&#22411;&#20013;&#23548;&#20986;&#20102;&#19968;&#20010;&#25193;&#23637;&#30340;Keller-Segel&#31995;&#32479;&#12290;&#24471;&#21040;&#30340;&#23439;&#35266;&#31995;&#32479;&#34920;&#26126;&#20154;&#21147;&#36164;&#28304;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#32858;&#38598;&#21487;&#20197;&#36890;&#36807;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#26469;&#35299;&#37322;&#65292;&#36825;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#23558;&#20854;&#31216;&#20026;&#8220;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;
Individual participants in human society collectively exhibit aggregation behavior. In this study, we present a simple microscopic model of labor force migration by employing the active Brownian particles framework. Through agent-based simulations, we find that our model produces clusters of agents from a random initial distribution. Furthermore, two empirical regularities called Zipf's and Okun's laws were observed in our model. To reveal the mechanism underlying the reproduced agglomeration phenomena, we derived an extended Keller-Segel system, a classic model that describes the aggregation behavior of biological organisms called "taxis," from our microscopic model. The obtained macroscopic system indicates that the agglomeration of the workforce in real world can be accounted for through a new type of taxis central to human behavior, which highlights the relevance of urbanization to blow-up phenomena in the derived PDE system. We term it "econotaxis."
&lt;/p&gt;</description></item></channel></rss>