<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#28145;&#24230;&#26680;&#23398;&#20064;&#65288;DKL&#65289;&#30340;&#27963;&#36291;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19982;&#20256;&#32479;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;VAEs&#65289;&#30340;&#23545;&#27604;&#20998;&#26512;&#65292;&#21019;&#36896;&#20102;&#20248;&#20808;&#32771;&#34385;&#20998;&#23376;&#21151;&#33021;&#24615;&#30340;&#28508;&#22312;&#31354;&#38388;&#65292;&#24182;&#19988;&#36890;&#36807;&#36845;&#20195;&#37325;&#26032;&#35745;&#31639;&#23884;&#20837;&#21521;&#37327;&#23454;&#29616;&#20102;&#26356;&#22909;&#32452;&#32455;&#30340;&#28508;&#22312;&#31354;&#38388;&#12290;</title><link>https://arxiv.org/abs/2403.01234</link><description>&lt;p&gt;
&#27963;&#36291;&#28145;&#24230;&#26680;&#23398;&#20064;&#20998;&#23376;&#21151;&#33021;&#24615;&#65306;&#23454;&#29616;&#21160;&#24577;&#32467;&#26500;&#23884;&#20837;
&lt;/p&gt;
&lt;p&gt;
Active Deep Kernel Learning of Molecular Functionalities: Realizing Dynamic Structural Embeddings
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01234
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#28145;&#24230;&#26680;&#23398;&#20064;&#65288;DKL&#65289;&#30340;&#27963;&#36291;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19982;&#20256;&#32479;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;VAEs&#65289;&#30340;&#23545;&#27604;&#20998;&#26512;&#65292;&#21019;&#36896;&#20102;&#20248;&#20808;&#32771;&#34385;&#20998;&#23376;&#21151;&#33021;&#24615;&#30340;&#28508;&#22312;&#31354;&#38388;&#65292;&#24182;&#19988;&#36890;&#36807;&#36845;&#20195;&#37325;&#26032;&#35745;&#31639;&#23884;&#20837;&#21521;&#37327;&#23454;&#29616;&#20102;&#26356;&#22909;&#32452;&#32455;&#30340;&#28508;&#22312;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25506;&#32034;&#20998;&#23376;&#31354;&#38388;&#23545;&#20110;&#25512;&#36827;&#25105;&#20204;&#23545;&#21270;&#23398;&#24615;&#36136;&#21644;&#21453;&#24212;&#30340;&#29702;&#35299;&#33267;&#20851;&#37325;&#35201;&#65292;&#20174;&#32780;&#22312;&#26448;&#26009;&#31185;&#23398;&#12289;&#21307;&#23398;&#21644;&#33021;&#28304;&#39046;&#22495;&#21462;&#24471;&#31361;&#30772;&#24615;&#21019;&#26032;&#12290;&#26412;&#25991;&#25506;&#35752;&#20102;&#19968;&#31181;&#21033;&#29992;&#28145;&#24230;&#26680;&#23398;&#20064;&#65288;DKL&#65289;&#36827;&#34892;&#20998;&#23376;&#21457;&#29616;&#30340;&#20027;&#21160;&#23398;&#20064;&#26041;&#27861;&#65292;&#36825;&#26159;&#19968;&#31181;&#36229;&#36234;&#20256;&#32479;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#65288;VAEs&#65289;&#38480;&#21046;&#30340;&#26032;&#26041;&#27861;&#12290;&#20351;&#29992;QM9&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#23558;DKL&#19982;&#20256;&#32479;VAEs&#36827;&#34892;&#23545;&#27604;&#65292;&#21518;&#32773;&#22522;&#20110;&#30456;&#20284;&#24615;&#20998;&#26512;&#20998;&#23376;&#32467;&#26500;&#65292;&#25581;&#31034;&#20102;&#30001;&#20110;&#28508;&#22312;&#31354;&#38388;&#20013;&#30340;&#31232;&#30095;&#35268;&#24459;&#24615;&#32780;&#23384;&#22312;&#30340;&#23616;&#38480;&#24615;&#12290;&#28982;&#32780;&#65292;DKL&#36890;&#36807;&#23558;&#32467;&#26500;&#19982;&#24615;&#36136;&#30456;&#20851;&#32852;&#65292;&#21019;&#36896;&#20102;&#20248;&#20808;&#32771;&#34385;&#20998;&#23376;&#21151;&#33021;&#24615;&#30340;&#28508;&#22312;&#31354;&#38388;&#65292;&#25552;&#20379;&#20102;&#26356;&#20840;&#38754;&#30340;&#35270;&#35282;&#12290;&#36825;&#26159;&#36890;&#36807;&#36845;&#20195;&#37325;&#26032;&#35745;&#31639;&#23884;&#20837;&#21521;&#37327;&#26469;&#23454;&#29616;&#30340;&#65292;&#19982;&#30446;&#26631;&#24615;&#36136;&#30340;&#23454;&#39564;&#21487;&#29992;&#24615;&#20445;&#25345;&#19968;&#33268;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#28508;&#22312;&#31354;&#38388;&#19981;&#20165;&#32452;&#32455;&#26356;&#22909;&#65292;&#32780;&#19988;&#20855;&#26377;&#29420;&#29305;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01234v1 Announce Type: new  Abstract: Exploring molecular spaces is crucial for advancing our understanding of chemical properties and reactions, leading to groundbreaking innovations in materials science, medicine, and energy. This paper explores an approach for active learning in molecular discovery using Deep Kernel Learning (DKL), a novel approach surpassing the limits of classical Variational Autoencoders (VAEs). Employing the QM9 dataset, we contrast DKL with traditional VAEs, which analyze molecular structures based on similarity, revealing limitations due to sparse regularities in latent spaces. DKL, however, offers a more holistic perspective by correlating structure with properties, creating latent spaces that prioritize molecular functionality. This is achieved by recalculating embedding vectors iteratively, aligning with the experimental availability of target properties. The resulting latent spaces are not only better organized but also exhibit unique characteri
&lt;/p&gt;</description></item></channel></rss>