<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65292;&#29992;&#20110;&#28145;&#20837;&#20998;&#26512;&#35821;&#20041;&#32593;&#32476;&#65292;&#20026;&#21697;&#29260;&#24418;&#35937;&#30340;&#26356;&#22909;&#25506;&#32034;&#21644;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.16228</link><description>&lt;p&gt;
&#21697;&#29260;&#32593;&#32476;&#22686;&#24378;&#22120;&#65306;&#25552;&#21319;&#21697;&#29260;&#36830;&#25509;&#24615;&#30340;&#26032;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Brand Network Booster: A New System for Improving Brand Connectivity. (arXiv:2309.16228v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16228
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65292;&#29992;&#20110;&#28145;&#20837;&#20998;&#26512;&#35821;&#20041;&#32593;&#32476;&#65292;&#20026;&#21697;&#29260;&#24418;&#35937;&#30340;&#26356;&#22909;&#25506;&#32034;&#21644;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20915;&#31574;&#25903;&#25345;&#31995;&#32479;&#65292;&#29992;&#20110;&#28145;&#20837;&#20998;&#26512;&#35821;&#20041;&#32593;&#32476;&#65292;&#20026;&#21697;&#29260;&#24418;&#35937;&#30340;&#26356;&#22909;&#25506;&#32034;&#21644;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;&#22312;&#32593;&#32476;&#20998;&#26512;&#26041;&#38754;&#65292;&#25105;&#20204;&#36890;&#36807;&#35299;&#20915;&#25193;&#23637;&#29256;&#30340;&#26368;&#22823;&#36830;&#25509;&#24230;&#25913;&#36827;&#38382;&#39064;&#26469;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#20854;&#20013;&#21253;&#25324;&#32771;&#34385;&#25932;&#23545;&#33410;&#28857;&#12289;&#32422;&#26463;&#39044;&#31639;&#21644;&#21152;&#26435;&#32593;&#32476;&#30340;&#21487;&#33021;&#24615; - &#36890;&#36807;&#28155;&#21152;&#38142;&#25509;&#25110;&#22686;&#21152;&#29616;&#26377;&#36830;&#25509;&#30340;&#26435;&#37325;&#26469;&#23454;&#29616;&#36830;&#25509;&#24615;&#30340;&#25913;&#36827;&#12290;&#25105;&#20204;&#32467;&#21512;&#20004;&#20010;&#26696;&#20363;&#30740;&#31350;&#26469;&#23637;&#31034;&#36825;&#20010;&#26032;&#31995;&#32479;&#65292;&#24182;&#35752;&#35770;&#20854;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#24037;&#20855;&#21644;&#26041;&#27861;&#23545;&#20110;&#32593;&#32476;&#23398;&#32773;&#21644;&#25903;&#25345;&#24066;&#22330;&#33829;&#38144;&#21644;&#20256;&#25773;&#31649;&#29702;&#32773;&#30340;&#25112;&#30053;&#20915;&#31574;&#36807;&#31243;&#37117;&#24456;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a new decision support system offered for an in-depth analysis of semantic networks, which can provide insights for a better exploration of a brand's image and the improvement of its connectivity. In terms of network analysis, we show that this goal is achieved by solving an extended version of the Maximum Betweenness Improvement problem, which includes the possibility of considering adversarial nodes, constrained budgets, and weighted networks - where connectivity improvement can be obtained by adding links or increasing the weight of existing connections. We present this new system together with two case studies, also discussing its performance. Our tool and approach are useful both for network scholars and for supporting the strategic decision-making processes of marketing and communication managers.
&lt;/p&gt;</description></item></channel></rss>