<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#25506;&#27979;&#22120;&#27169;&#25311;&#26041;&#27861;IEA-GAN&#65292;&#36890;&#36807;&#20135;&#29983;&#19982;&#22270;&#23618;&#30456;&#20851;&#30340;&#19978;&#19979;&#25991;&#21270;&#30340;&#22270;&#20687;&#65292;&#25552;&#39640;&#20102;&#36229;&#39640;&#20998;&#36776;&#29575;&#25506;&#27979;&#22120;&#21709;&#24212;&#30340;&#30456;&#20851;&#24615;&#21644;&#22810;&#26679;&#24615;&#12290;&#21516;&#26102;&#65292;&#24341;&#20837;&#26032;&#30340;&#20107;&#20214;&#24863;&#30693;&#25439;&#22833;&#21644;&#32479;&#19968;&#24615;&#25439;&#22833;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#22270;&#20687;&#30340;&#20445;&#30495;&#24230;&#21644;&#22810;&#26679;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.08046</link><description>&lt;p&gt;
&#22522;&#20110;&#20107;&#20214;&#24863;&#30693;&#30340;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#33258;&#30417;&#30563;&#20851;&#31995;&#25512;&#29702;&#30340;&#36229;&#39640;&#20998;&#36776;&#29575;&#25506;&#27979;&#22120;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
Ultra-High-Resolution Detector Simulation with Intra-Event Aware GAN and Self-Supervised Relational Reasoning. (arXiv:2303.08046v1 [physics.ins-det])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08046
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#25506;&#27979;&#22120;&#27169;&#25311;&#26041;&#27861;IEA-GAN&#65292;&#36890;&#36807;&#20135;&#29983;&#19982;&#22270;&#23618;&#30456;&#20851;&#30340;&#19978;&#19979;&#25991;&#21270;&#30340;&#22270;&#20687;&#65292;&#25552;&#39640;&#20102;&#36229;&#39640;&#20998;&#36776;&#29575;&#25506;&#27979;&#22120;&#21709;&#24212;&#30340;&#30456;&#20851;&#24615;&#21644;&#22810;&#26679;&#24615;&#12290;&#21516;&#26102;&#65292;&#24341;&#20837;&#26032;&#30340;&#20107;&#20214;&#24863;&#30693;&#25439;&#22833;&#21644;&#32479;&#19968;&#24615;&#25439;&#22833;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#22270;&#20687;&#30340;&#20445;&#30495;&#24230;&#21644;&#22810;&#26679;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31890;&#23376;&#29289;&#29702;&#23398;&#20013;&#65292;&#27169;&#25311;&#39640;&#20998;&#36776;&#29575;&#25506;&#27979;&#22120;&#21709;&#24212;&#19968;&#30452;&#26159;&#19968;&#20010;&#23384;&#20648;&#25104;&#26412;&#39640;&#12289;&#35745;&#31639;&#23494;&#38598;&#30340;&#36807;&#31243;&#12290;&#23613;&#31649;&#28145;&#24230;&#29983;&#25104;&#27169;&#22411;&#21487;&#20197;&#20351;&#36825;&#20010;&#36807;&#31243;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#65292;&#20294;&#36229;&#39640;&#20998;&#36776;&#29575;&#25506;&#27979;&#22120;&#27169;&#25311;&#20173;&#28982;&#24456;&#22256;&#38590;&#65292;&#22240;&#20026;&#23427;&#21253;&#21547;&#20102;&#20107;&#20214;&#20869;&#30456;&#20851;&#21644;&#32454;&#31890;&#24230;&#30340;&#30456;&#20114;&#20449;&#24687;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#26041;&#27861;&#65288;IEA-GAN&#65289;&#65292;&#34701;&#21512;&#20102;&#33258;&#30417;&#30563;&#23398;&#20064;&#21644;&#20851;&#31995;&#25512;&#29702;&#27169;&#22411;&#12290;IEA-GAN&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#31995;&#25512;&#29702;&#27169;&#22359;&#65292;&#36817;&#20284;&#20110;&#25506;&#27979;&#22120;&#27169;&#25311;&#20013;&#8220;&#20107;&#20214;&#8221;&#30340;&#27010;&#24565;&#65292;&#21487;&#20197;&#29983;&#25104;&#19982;&#22270;&#23618;&#30456;&#20851;&#30340;&#19978;&#19979;&#25991;&#21270;&#30340;&#22270;&#20687;&#65292;&#25552;&#39640;&#20102;&#36229;&#39640;&#20998;&#36776;&#29575;&#25506;&#27979;&#22120;&#21709;&#24212;&#30340;&#30456;&#20851;&#24615;&#21644;&#22810;&#26679;&#24615;&#12290;IEA-GAN&#36824;&#24341;&#20837;&#20102;&#26032;&#30340;&#20107;&#20214;&#24863;&#30693;&#25439;&#22833;&#21644;&#32479;&#19968;&#24615;&#25439;&#22833;&#65292;&#26174;&#33879;&#25552;&#39640;&#20102;&#22270;&#20687;&#30340;&#20445;&#30495;&#24230;&#21644;&#22810;&#26679;&#24615;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;IEA-GAN&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Simulating high-resolution detector responses is a storage-costly and computationally intensive process that has long been challenging in particle physics. Despite the ability of deep generative models to make this process more cost-efficient, ultra-high-resolution detector simulation still proves to be difficult as it contains correlated and fine-grained mutual information within an event. To overcome these limitations, we propose Intra-Event Aware GAN (IEA-GAN), a novel fusion of Self-Supervised Learning and Generative Adversarial Networks. IEA-GAN presents a Relational Reasoning Module that approximates the concept of an ''event'' in detector simulation, allowing for the generation of correlated layer-dependent contextualized images for high-resolution detector responses with a proper relational inductive bias. IEA-GAN also introduces a new intra-event aware loss and a Uniformity loss, resulting in significant enhancements to image fidelity and diversity. We demonstrate IEA-GAN's ap
&lt;/p&gt;</description></item></channel></rss>