<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#29983;&#25104;&#20855;&#26377;&#32479;&#35745;&#20195;&#34920;&#24615;&#30340;&#21512;&#25104;&#25968;&#25454;&#65292;&#33021;&#22815;&#22312;&#21512;&#25104;&#25968;&#25454;&#38598;&#20013;&#20445;&#25345;&#21407;&#22987;&#25968;&#25454;&#38598;&#20013;&#29305;&#24449;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#21487;&#35843;&#25972;&#30340;&#38544;&#31169;&#32423;&#21035;&#12290;</title><link>https://arxiv.org/abs/2403.01471</link><description>&lt;p&gt;
&#20445;&#25345;&#30456;&#20851;&#24615;&#65306;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#21512;&#25104;&#25968;&#25454;&#30340;&#32479;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Preserving correlations: A statistical method for generating synthetic data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01471
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#29983;&#25104;&#20855;&#26377;&#32479;&#35745;&#20195;&#34920;&#24615;&#30340;&#21512;&#25104;&#25968;&#25454;&#65292;&#33021;&#22815;&#22312;&#21512;&#25104;&#25968;&#25454;&#38598;&#20013;&#20445;&#25345;&#21407;&#22987;&#25968;&#25454;&#38598;&#20013;&#29305;&#24449;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#21487;&#35843;&#25972;&#30340;&#38544;&#31169;&#32423;&#21035;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#29983;&#25104;&#20855;&#26377;&#32479;&#35745;&#20195;&#34920;&#24615;&#30340;&#21512;&#25104;&#25968;&#25454;&#12290;&#20027;&#35201;&#30446;&#26631;&#26159;&#22312;&#21512;&#25104;&#25968;&#25454;&#38598;&#20013;&#20445;&#25345;&#21407;&#22987;&#25968;&#25454;&#38598;&#20013;&#23384;&#22312;&#30340;&#29305;&#24449;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#21516;&#26102;&#25552;&#20379;&#19968;&#20010;&#33298;&#36866;&#30340;&#38544;&#31169;&#32423;&#21035;&#65292;&#21487;&#20197;&#26681;&#25454;&#29305;&#23450;&#23458;&#25143;&#38656;&#27714;&#36827;&#34892;&#35843;&#25972;&#12290;&#25105;&#20204;&#35814;&#32454;&#25551;&#36848;&#20102;&#25105;&#20204;&#29992;&#20110;&#20998;&#26512;&#21407;&#22987;&#25968;&#25454;&#38598;&#21644;&#29983;&#25104;&#21512;&#25104;&#25968;&#25454;&#28857;&#30340;&#31639;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#20010;&#22823;&#22411;&#33021;&#28304;&#30456;&#20851;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#25105;&#20204;&#22312;&#23450;&#24615;&#65288;&#20363;&#22914;&#36890;&#36807;&#21487;&#35270;&#21270;&#30456;&#20851;&#24615;&#22270;&#65289;&#21644;&#23450;&#37327;&#65288;&#20197;&#36866;&#24403;&#30340;$\ell^1$&#31867;&#22411;&#35823;&#24046;&#33539;&#25968;&#20316;&#20026;&#35780;&#20272;&#25351;&#26631;&#65289;&#26041;&#38754;&#33719;&#24471;&#20102;&#33391;&#22909;&#30340;&#32467;&#26524;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#35770;&#26159;&#19968;&#33324;&#30340;&#65292;&#19981;&#20381;&#36182;&#20110;&#20351;&#29992;&#30340;&#27979;&#35797;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#26399;&#26395;&#23427;&#21487;&#36866;&#29992;&#20110;&#27604;&#27492;&#22788;&#25351;&#31034;&#30340;&#26356;&#24191;&#27867;&#30340;&#24773;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01471v1 Announce Type: new  Abstract: We propose a method to generate statistically representative synthetic data. The main goal is to be able to maintain in the synthetic dataset the correlations of the features present in the original one, while offering a comfortable privacy level that can be eventually tailored on specific customer demands.   We describe in detail our algorithm used both for the analysis of the original dataset and for the generation of the synthetic data points. The approach is tested using a large energy-related dataset. We obtain good results both qualitatively (e.g. via vizualizing correlation maps) and quantitatively (in terms of suitable $\ell^1$-type error norms used as evaluation metrics).   The proposed methodology is general in the sense that it does not rely on the used test dataset. We expect it to be applicable in a much broader context than indicated here.
&lt;/p&gt;</description></item></channel></rss>