<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#23545;&#21453;&#24212;&#27969;&#21160;&#27169;&#22411;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#36827;&#34892;&#37327;&#21270;&#65292;&#29305;&#21035;&#26159;&#22312;&#28237;&#28065;&#39044;&#28151;&#28779;&#28976;&#21160;&#24577;&#20013;&#20851;&#38190;&#21464;&#37327;&#30340;&#24314;&#27169;&#26041;&#38754;&#21462;&#24471;&#37325;&#35201;&#36827;&#23637;</title><link>https://arxiv.org/abs/2402.18729</link><description>&lt;p&gt;
&#21033;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#23545;&#21453;&#24212;&#28237;&#27969;&#23553;&#38381;&#27169;&#22411;&#36827;&#34892;&#20808;&#39564;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
A Priori Uncertainty Quantification of Reacting Turbulence Closure Models using Bayesian Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18729
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#23545;&#21453;&#24212;&#27969;&#21160;&#27169;&#22411;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#36827;&#34892;&#37327;&#21270;&#65292;&#29305;&#21035;&#26159;&#22312;&#28237;&#28065;&#39044;&#28151;&#28779;&#28976;&#21160;&#24577;&#20013;&#20851;&#38190;&#21464;&#37327;&#30340;&#24314;&#27169;&#26041;&#38754;&#21462;&#24471;&#37325;&#35201;&#36827;&#23637;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#20026;&#22823;&#28065;&#27169;&#25311;&#65288;LES&#65289;&#20013;&#30340;&#23376;&#28388;&#27874;&#23610;&#24230;&#65288;SFS&#65289;&#25552;&#20986;&#20102;&#35768;&#22810;&#22522;&#20110;&#29289;&#29702;&#30340;&#23553;&#38381;&#27169;&#22411;&#24418;&#24335;&#65292;&#20294;&#30452;&#25509;&#25968;&#20540;&#27169;&#25311;&#65288;DNS&#65289;&#25552;&#20379;&#30340;&#22823;&#37327;&#25968;&#25454;&#20026;&#21033;&#29992;&#25968;&#25454;&#39537;&#21160;&#24314;&#27169;&#25216;&#26415;&#21019;&#36896;&#20102;&#26426;&#20250;&#12290;&#23613;&#31649;&#28789;&#27963;&#65292;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#20173;&#21462;&#20915;&#20110;&#36873;&#25321;&#30340;&#25968;&#25454;&#38598;&#21644;&#27169;&#22411;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;&#37319;&#29992;&#36825;&#31181;&#27169;&#22411;&#30340;&#22686;&#21152;&#38656;&#35201;&#21487;&#38752;&#22320;&#20272;&#35745;&#25968;&#25454;&#39537;&#21160;&#27169;&#22411;&#20013;&#25968;&#25454;&#30693;&#35782;&#21644;&#36229;&#20986;&#20998;&#24067;&#33539;&#22260;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#26412;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#65288;BNNs&#65289;&#26469;&#25429;&#25417;&#21453;&#24212;&#27969;&#21160;&#27169;&#22411;&#20013;&#30340;&#36923;&#36753;&#19981;&#30830;&#23450;&#24615;&#21644;&#20598;&#28982;&#19981;&#30830;&#23450;&#24615;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#27169;&#25311;&#20102;&#22312;&#28237;&#28065;&#39044;&#28151;&#28779;&#28976;&#21160;&#24577;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#28388;&#27874;&#36827;&#23637;&#21464;&#37327;&#26631;&#37327;&#32791;&#25955;&#29575;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;BNN&#27169;&#22411;&#21487;&#20197;&#25552;&#20379;&#20851;&#20110;&#25968;&#25454;&#39537;&#21160;&#23553;&#38381;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#32467;&#26500;&#30340;&#29420;&#29305;&#35265;&#35299;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#36827;&#34892;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18729v1 Announce Type: cross  Abstract: While many physics-based closure model forms have been posited for the sub-filter scale (SFS) in large eddy simulation (LES), vast amounts of data available from direct numerical simulation (DNS) create opportunities to leverage data-driven modeling techniques. Albeit flexible, data-driven models still depend on the dataset and the functional form of the model chosen. Increased adoption of such models requires reliable uncertainty estimates both in the data-informed and out-of-distribution regimes. In this work, we employ Bayesian neural networks (BNNs) to capture both epistemic and aleatoric uncertainties in a reacting flow model. In particular, we model the filtered progress variable scalar dissipation rate which plays a key role in the dynamics of turbulent premixed flames. We demonstrate that BNN models can provide unique insights about the structure of uncertainty of the data-driven closure models. We also propose a method for the
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23454;&#39564;&#25968;&#25454;&#21516;&#21270;&#25913;&#36827;&#20102;Spalart-Allmaras&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#23545;&#20998;&#31163;&#27969;&#20307;&#30340;&#38647;&#35834;&#24179;&#22343;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#35299;&#30340;&#27867;&#21270;&#65292;&#25552;&#39640;&#20102;&#35745;&#31639;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2309.06679</link><description>&lt;p&gt;
&#36890;&#36807;&#23454;&#39564;&#25968;&#25454;&#21516;&#21270;&#23454;&#29616;&#23545;Spalart-Allmaras&#27169;&#22411;&#30340;&#21487;&#26222;&#36866;&#25913;&#36827;
&lt;/p&gt;
&lt;p&gt;
Generalizable improvement of the Spalart-Allmaras model through assimilation of experimental data. (arXiv:2309.06679v1 [physics.flu-dyn])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06679
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23454;&#39564;&#25968;&#25454;&#21516;&#21270;&#25913;&#36827;&#20102;Spalart-Allmaras&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#23545;&#20998;&#31163;&#27969;&#20307;&#30340;&#38647;&#35834;&#24179;&#22343;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#35299;&#30340;&#27867;&#21270;&#65292;&#25552;&#39640;&#20102;&#35745;&#31639;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#21033;&#29992;&#27169;&#22411;&#21644;&#25968;&#25454;&#34701;&#21512;&#25913;&#36827;&#20998;&#31163;&#27969;&#20307;&#30340;&#38647;&#35834;&#24179;&#22343;&#32435;&#32500;-&#26031;&#25176;&#20811;&#26031;&#35299;&#30340;Spalart-Allmaras&#65288;SA&#65289;&#38381;&#21512;&#27169;&#22411;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#24320;&#21457;&#27169;&#22411;&#65292;&#19981;&#20165;&#33021;&#23558;&#31232;&#30095;&#30340;&#23454;&#39564;&#25968;&#25454;&#21516;&#21270;&#20197;&#25913;&#21892;&#35745;&#31639;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#36824;&#33021;&#36890;&#36807;&#24674;&#22797;&#32463;&#20856;&#30340;SA&#34892;&#20026;&#26469;&#25512;&#24191;&#21040;&#26410;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#20351;&#29992;&#25968;&#25454;&#21516;&#21270;&#65292;&#21363;&#38598;&#21512;&#21345;&#23572;&#26364;&#28388;&#27874;&#26041;&#27861;&#65288;EnKF&#65289;&#65292;&#36890;&#36807;&#23558;SA&#27169;&#22411;&#30340;&#31995;&#25968;&#26657;&#20934;&#21040;&#20998;&#31163;&#27969;&#20307;&#20013;&#26469;&#23454;&#29616;&#25105;&#20204;&#30340;&#30446;&#26631;&#12290;&#36890;&#36807;&#21442;&#25968;&#21270;&#20135;&#29983;&#12289;&#25193;&#25955;&#21644;&#30772;&#22351;&#39033;&#65292;&#23454;&#29616;&#20102;&#19968;&#31181;&#20840;&#38754;&#30340;&#26657;&#20934;&#31574;&#30053;&#12290;&#35813;&#26657;&#20934;&#20381;&#36182;&#20110;&#37319;&#38598;&#30340;&#20998;&#31163;&#27969;&#20307;&#36895;&#24230;&#21078;&#38754;&#12289;&#22721;&#25830;&#21147;&#21644;&#21387;&#21147;&#31995;&#25968;&#30340;&#23454;&#39564;&#25968;&#25454;&#30340;&#21516;&#21270;&#12290;&#23613;&#31649;&#20165;&#20351;&#29992;&#20102;&#26469;&#33258;&#21333;&#19968;&#27969;&#21160;&#26465;&#20214;&#65288;&#29615;&#32469;&#19968;&#20010;&#32972;&#38754;&#21488;&#38454;&#65289;&#30340;&#35266;&#27979;&#25968;&#25454;&#65292;&#20294;&#37325;&#26032;&#26657;&#20934;&#30340;SA&#27169;&#22411;&#34920;&#29616;&#20986;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study focuses on the use of model and data fusion for improving the Spalart-Allmaras (SA) closure model for Reynolds-averaged Navier-Stokes solutions of separated flows. In particular, our goal is to develop of models that not-only assimilate sparse experimental data to improve performance in computational models, but also generalize to unseen cases by recovering classical SA behavior. We achieve our goals using data assimilation, namely the Ensemble Kalman Filtering approach (EnKF), to calibrate the coefficients of the SA model for separated flows. A holistic calibration strategy is implemented via a parameterization of the production, diffusion, and destruction terms. This calibration relies on the assimilation of experimental data collected velocity profiles, skin friction, and pressure coefficients for separated flows. Despite using of observational data from a single flow condition around a backward-facing step (BFS), the recalibrated SA model demonstrates generalization to o
&lt;/p&gt;</description></item><item><title>&#23545;&#20110;&#22240;&#26524;&#19981;&#20805;&#20998;&#30340;&#24773;&#20917;&#19979;&#30340;&#20849;&#21516;&#21407;&#22240;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#26469;&#35782;&#21035;&#20849;&#21516;&#21407;&#22240;C&#65292;&#19982;&#26368;&#22823;&#29109;&#21407;&#21017;&#23494;&#20999;&#30456;&#20851;&#12290;&#23545;&#20110;&#20004;&#20010;&#20108;&#20803;&#23545;&#31216;&#21464;&#37327;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#31867;&#20284;&#20110;&#20108;&#38454;&#30456;&#21464;&#30340;&#26465;&#20214;&#27010;&#29575;&#38750;&#35299;&#26512;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2306.17557</link><description>&lt;p&gt;
&#26368;&#21487;&#33021;&#30340;&#20849;&#21516;&#21407;&#22240;
&lt;/p&gt;
&lt;p&gt;
The most likely common cause. (arXiv:2306.17557v1 [physics.data-an])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17557
&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#22240;&#26524;&#19981;&#20805;&#20998;&#30340;&#24773;&#20917;&#19979;&#30340;&#20849;&#21516;&#21407;&#22240;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#26469;&#35782;&#21035;&#20849;&#21516;&#21407;&#22240;C&#65292;&#19982;&#26368;&#22823;&#29109;&#21407;&#21017;&#23494;&#20999;&#30456;&#20851;&#12290;&#23545;&#20110;&#20004;&#20010;&#20108;&#20803;&#23545;&#31216;&#21464;&#37327;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#31867;&#20284;&#20110;&#20108;&#38454;&#30456;&#21464;&#30340;&#26465;&#20214;&#27010;&#29575;&#38750;&#35299;&#26512;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#20004;&#20010;&#38543;&#26426;&#21464;&#37327;A&#21644;B&#30340;&#20849;&#21516;&#21407;&#22240;&#21407;&#21017;&#22312;&#22240;&#26524;&#19981;&#20805;&#20998;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#24403;&#23427;&#20204;&#30340;&#20849;&#21516;&#21407;&#22240;C&#34987;&#35748;&#20026;&#24050;&#32463;&#23384;&#22312;&#65292;&#20294;&#21482;&#35266;&#27979;&#21040;&#20102;A&#21644;B&#30340;&#32852;&#21512;&#27010;&#29575;&#12290;&#22240;&#27492;&#65292;C&#19981;&#33021;&#34987;&#21807;&#19968;&#30830;&#23450;&#65288;&#28508;&#22312;&#28151;&#26434;&#22240;&#23376;&#38382;&#39064;&#65289;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#24191;&#20041;&#26368;&#22823;&#20284;&#28982;&#26041;&#27861;&#21487;&#20197;&#24212;&#29992;&#20110;&#36825;&#31181;&#24773;&#20917;&#65292;&#24182;&#19988;&#20801;&#35768;&#35782;&#21035;&#19982;&#20849;&#21516;&#21407;&#22240;&#21407;&#21017;&#19968;&#33268;&#30340;C&#12290;&#23427;&#19982;&#26368;&#22823;&#29109;&#21407;&#21017;&#23494;&#20999;&#30456;&#20851;&#12290;&#23545;&#20004;&#20010;&#20108;&#20803;&#23545;&#31216;&#21464;&#37327;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#26465;&#20214;&#27010;&#29575;&#30340;&#38750;&#35299;&#26512;&#34892;&#20026;&#65292;&#31867;&#20284;&#20110;&#20108;&#38454;&#30456;&#21464;&#12290;&#36825;&#21457;&#29983;&#22312;&#35266;&#23519;&#21040;&#30340;&#27010;&#29575;&#20998;&#24067;&#20174;&#30456;&#20851;&#21040;&#21453;&#30456;&#20851;&#30340;&#36807;&#28193;&#26399;&#38388;&#12290;&#35752;&#35770;&#20102;&#24191;&#20041;&#20284;&#28982;&#26041;&#27861;&#19982;&#20854;&#20182;&#26041;&#27861;&#65288;&#22914;&#39044;&#27979;&#20284;&#28982;&#21644;&#26368;&#23567;&#20849;&#21516;&#21407;&#22240;&#29109;&#65289;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
The common cause principle for two random variables $A$ and $B$ is examined in the case of causal insufficiency, when their common cause $C$ is known to exist, but only the joint probability of $A$ and $B$ is observed. As a result, $C$ cannot be uniquely identified (the latent confounder problem). We show that the generalized maximum likelihood method can be applied to this situation and allows identification of $C$ that is consistent with the common cause principle. It closely relates to the maximum entropy principle. Investigation of the two binary symmetric variables reveals a non-analytic behavior of conditional probabilities reminiscent of a second-order phase transition. This occurs during the transition from correlation to anti-correlation in the observed probability distribution. The relation between the generalized likelihood approach and alternative methods, such as predictive likelihood and the minimum common cause entropy, is discussed. The consideration of the common cause
&lt;/p&gt;</description></item></channel></rss>