<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#19982;&#20016;&#23500;&#30495;&#23454;&#32593;&#32476;&#25968;&#25454;&#30340;&#23384;&#22312;&#24320;&#21551;&#20102;&#22797;&#26434;&#32593;&#32476;&#31185;&#23398;&#30740;&#31350;&#30340;&#26032;&#26102;&#20195;&#65292;&#26377;&#26395;&#20811;&#26381;&#29616;&#23384;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2402.16887</link><description>&lt;p&gt;
&#22797;&#26434;&#32593;&#32476;&#30340;&#20154;&#24037;&#26234;&#33021;&#65306;&#28508;&#21147;&#12289;&#26041;&#27861;&#35770;&#21644;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence for Complex Network: Potential, Methodology and Application
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16887
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#19982;&#20016;&#23500;&#30495;&#23454;&#32593;&#32476;&#25968;&#25454;&#30340;&#23384;&#22312;&#24320;&#21551;&#20102;&#22797;&#26434;&#32593;&#32476;&#31185;&#23398;&#30740;&#31350;&#30340;&#26032;&#26102;&#20195;&#65292;&#26377;&#26395;&#20811;&#26381;&#29616;&#23384;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22797;&#26434;&#32593;&#32476;&#23384;&#22312;&#20110;&#21508;&#31181;&#30495;&#23454;&#19990;&#30028;&#31995;&#32479;&#20013;&#65292;&#20174;&#33258;&#28982;&#29615;&#22659;&#21040;&#20154;&#31867;&#31038;&#20250;&#12290;&#36825;&#20123;&#32593;&#32476;&#30340;&#26412;&#36136;&#22312;&#20110;&#23427;&#20204;&#33021;&#22815;&#20174;&#24494;&#35266;&#28151;&#20081;-&#20854;&#20013;&#32593;&#32476;&#25299;&#25169;&#21644;&#33410;&#28857;&#21160;&#24577;&#20132;&#32455;-&#36716;&#21464;&#21644;&#28436;&#21270;&#20026;&#20855;&#26377;&#29305;&#23450;&#38598;&#20307;&#34892;&#20026;&#30340;&#23439;&#35266;&#31209;&#24207;&#12290;&#22312;&#36807;&#21435;&#30340;&#20108;&#21313;&#24180;&#37324;&#65292;&#22797;&#26434;&#32593;&#32476;&#31185;&#23398;&#26174;&#33879;&#22686;&#24378;&#20102;&#25105;&#20204;&#23545;&#30495;&#23454;&#19990;&#30028;&#32593;&#32476;&#28508;&#22312;&#26426;&#21046;&#12289;&#32467;&#26500;&#21644;&#21160;&#24577;&#30340;&#29702;&#35299;&#12290;&#23613;&#31649;&#21462;&#24471;&#20102;&#36825;&#20123;&#36827;&#23637;&#65292;&#20294;&#22312;&#25506;&#32034;&#26356;&#21152;&#30495;&#23454;&#31995;&#32479;&#21644;&#25552;&#21319;&#23454;&#38469;&#24212;&#29992;&#26041;&#38754;&#20173;&#28982;&#23384;&#22312;&#30528;&#30456;&#24403;&#22823;&#30340;&#25361;&#25112;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#26415;&#30340;&#20986;&#29616;&#65292;&#20197;&#21450;&#20016;&#23500;&#22810;&#26679;&#30340;&#30495;&#23454;&#19990;&#30028;&#32593;&#32476;&#25968;&#25454;&#30340;&#23384;&#22312;&#65292;&#24320;&#21551;&#20102;&#22797;&#26434;&#32593;&#32476;&#31185;&#23398;&#30740;&#31350;&#30340;&#26032;&#26102;&#20195;&#12290;&#26412;&#35843;&#26597;&#26088;&#22312;&#31995;&#32479;&#22320;&#25506;&#35752;&#20154;&#24037;&#26234;&#33021;&#22312;&#20811;&#26381;&#22797;&#26434;&#32593;&#32476;&#31185;&#23398;&#30740;&#31350;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#26041;&#38754;&#30340;&#28508;&#22312;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16887v1 Announce Type: cross  Abstract: Complex networks pervade various real-world systems, from the natural environment to human societies. The essence of these networks is in their ability to transition and evolve from microscopic disorder-where network topology and node dynamics intertwine-to a macroscopic order characterized by certain collective behaviors. Over the past two decades, complex network science has significantly enhanced our understanding of the statistical mechanics, structures, and dynamics underlying real-world networks. Despite these advancements, there remain considerable challenges in exploring more realistic systems and enhancing practical applications. The emergence of artificial intelligence (AI) technologies, coupled with the abundance of diverse real-world network data, has heralded a new era in complex network science research. This survey aims to systematically address the potential advantages of AI in overcoming the lingering challenges of com
&lt;/p&gt;</description></item></channel></rss>