<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#20351;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#21644;&#24066;&#22330;&#33829;&#38144;&#21160;&#24577;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#20934;&#30830;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.02175</link><description>&lt;p&gt;
&#28040;&#36153;&#32773;&#21453;&#24212;&#30340;&#31038;&#20250;&#21160;&#24577;&#65306;&#34701;&#21512;&#32479;&#35745;&#29289;&#29702;&#23398;&#19982;&#33829;&#38144;&#21160;&#24577;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Social Dynamics of Consumer Response: A Unified Framework Integrating Statistical Physics and Marketing Dynamics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02175
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#32479;&#35745;&#29289;&#29702;&#23398;&#21644;&#24066;&#22330;&#33829;&#38144;&#21160;&#24577;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#20934;&#30830;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#24182;&#39564;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#28040;&#36153;&#32773;&#23545;&#24191;&#21578;&#36755;&#20837;&#30340;&#21453;&#24212;&#23545;&#20110;&#26088;&#22312;&#20248;&#21270;&#24191;&#21578;&#31574;&#30053;&#24182;&#25552;&#39640;&#24191;&#21578;&#27963;&#21160;&#26377;&#25928;&#24615;&#30340;&#33829;&#38144;&#20154;&#21592;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#24212;&#29992;&#28304;&#33258;&#29289;&#29702;&#23398;&#21644;&#31038;&#20250;&#24515;&#29702;&#23398;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#30740;&#31350;&#28040;&#36153;&#32773;&#34892;&#20026;&#30340;&#22797;&#26434;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#26032;&#30340;&#26041;&#31243;&#65292;&#25429;&#25417;&#20102;&#24191;&#21578;&#25903;&#20986;&#19982;&#28040;&#36153;&#32773;&#21453;&#24212;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21033;&#29992;&#20102;&#35832;&#22914;&#23545;&#31216;&#24615;&#12289;&#26631;&#24230;&#24459;&#21644;&#30456;&#21464;&#31561;&#27010;&#24565;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#26041;&#31243;&#39564;&#35777;&#19982;Michaelis-Menten&#21644;Hill&#26041;&#31243;&#31561;&#33879;&#21517;&#27169;&#22411;&#30456;&#27604;&#36739;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20854;&#22312;&#20934;&#30830;&#34920;&#31034;&#28040;&#36153;&#32773;&#21453;&#24212;&#21160;&#24577;&#22797;&#26434;&#24615;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;&#20998;&#26512;&#24378;&#35843;&#20102;&#20851;&#38190;&#27169;&#22411;&#21442;&#25968;&#65288;&#22914;&#33829;&#38144;&#25928;&#26524;&#12289;&#21453;&#24212;&#25935;&#24863;&#24230;&#21644;&#34892;&#20026;&#25935;&#24863;&#24230;&#65289;&#23545;&#24433;&#21709;&#28040;&#36153;&#32773;&#34892;&#20026;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#24191;&#21578;&#21830;&#21644;&#33829;&#38144;&#20154;&#21592;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02175v1 Announce Type: cross  Abstract: Comprehending how consumers react to advertising inputs is essential for marketers aiming to optimize advertising strategies and improve campaign effectiveness. This study examines the complex nature of consumer behaviour by applying theoretical frameworks derived from physics and social psychology. We present an innovative equation that captures the relation between spending on advertising and consumer response, using concepts such as symmetries, scaling laws, and phase transitions. By validating our equation against well-known models such as the Michaelis-Menten and Hill equations, we prove its effectiveness in accurately representing the complexity of consumer response dynamics. The analysis emphasizes the importance of key model parameters, such as marketing effectiveness, response sensitivity, and behavioural sensitivity, in influencing consumer behaviour. The work explores the practical implications for advertisers and marketers,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#26469;&#35299;&#37322;&#21512;&#20316;&#28216;&#25103;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39118;&#38505;&#35268;&#36991;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#21487;&#20197;&#22312;&#20154;&#21475;&#20013;&#23548;&#33268;&#21512;&#20316;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2306.05971</link><description>&lt;p&gt;
&#39118;&#38505;&#35268;&#36991;&#20419;&#36827;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Risk aversion promotes cooperation. (arXiv:2306.05971v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05971
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#26469;&#35299;&#37322;&#21512;&#20316;&#28216;&#25103;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39118;&#38505;&#35268;&#36991;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#21487;&#20197;&#22312;&#20154;&#21475;&#20013;&#23548;&#33268;&#21512;&#20316;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#20316;&#21160;&#21147;&#23398;&#26159;&#25105;&#20204;&#29702;&#35299;&#35768;&#22810;&#29983;&#21629;&#21644;&#22797;&#26434;&#31995;&#32479;&#20013;&#29616;&#35937;&#30340;&#26680;&#24515;&#65292;&#21253;&#25324;&#21521;&#22810;&#32454;&#32990;&#30340;&#36807;&#28193;&#12289;&#26118;&#34411;&#32676;&#20307;&#20013;&#20849;&#21516;&#29983;&#27963;&#26041;&#24335;&#30340;&#20986;&#29616;&#20197;&#21450;&#23436;&#25972;&#20154;&#31867;&#31038;&#20250;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#32570;&#20047;&#19968;&#31181;&#26222;&#36941;&#26426;&#21046;&#26469;&#35299;&#37322;&#21512;&#20316;&#36328;&#38271;&#24230;&#23610;&#24230;&#12289;&#36328;&#29289;&#31181;&#30340;&#20986;&#29616;&#65292;&#24182;&#19988;&#21487;&#25193;&#23637;&#21040;&#22823;&#37327;&#20010;&#20307;&#30340;&#20154;&#21475;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#32467;&#21512;&#21453;&#24212;&#32593;&#32476;&#12289;&#37327;&#23376;&#21147;&#23398;&#12289;&#38543;&#26426;&#22797;&#26434;&#31995;&#32479;&#26041;&#27861;&#12289;&#21338;&#24328;&#35770;&#21644;&#20998;&#23376;&#21453;&#24212;&#30340;&#38543;&#26426;&#27169;&#25311;&#26469;&#24314;&#27169;&#20855;&#26377;&#20219;&#24847;&#25968;&#37327;&#29609;&#23478;&#30340;&#21512;&#20316;&#28216;&#25103;&#12290;&#21033;&#29992;&#36825;&#20010;&#26694;&#26550;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39118;&#38505;&#35268;&#36991;&#30340;&#26032;&#22411;&#12289;&#24378;&#22823;&#30340;&#26426;&#21046;&#65292;&#36825;&#31181;&#26426;&#21046;&#21487;&#20197;&#22312;&#20154;&#21475;&#20013;&#23548;&#33268;&#21512;&#20316;&#34892;&#20026;&#12290;&#20010;&#20307;&#19981;&#26159;&#23547;&#27714;&#22312;&#38271;&#26399;&#20869;&#26368;&#22823;&#21270;&#22238;&#25253;&#65292;&#32780;&#26159;&#23547;&#27714;&#22312;&#26377;&#38480;&#30340;&#26102;&#38388;&#20869;&#65292;&#20197;&#26576;&#20010;&#29305;&#23450;&#30340;&#32622;&#20449;&#27700;&#24179;&#21644;&#19968;&#32452;&#26368;&#20302;&#36164;&#28304;&#26469;&#21387;&#20302;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cooperative dynamics are central to our understanding of many phenomena in living and complex systems, including the transition to multicellularity, the emergence of eusociality in insect colonies, and the development of full-fledged human societies. However, we lack a universal mechanism to explain the emergence of cooperation across length scales, across species, and scalable to large populations of individuals. We present a novel framework for modelling cooperation games with an arbitrary number of players by combining reaction networks, methods from quantum mechanics applied to stochastic complex systems, game theory and stochastic simulations of molecular reactions. Using this framework, we propose a novel and robust mechanism based on risk aversion that leads to cooperative behaviour in population games. Rather than individuals seeking to maximise payouts in the long run, individuals seek to obtain a minimum set of resources with a given level of confidence and in a limited time 
&lt;/p&gt;</description></item></channel></rss>