<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38543;&#26426;Solow&#22686;&#38271;&#27169;&#22411;&#30340;&#20551;&#35774;&#65292;&#35813;&#27169;&#22411;&#23558;&#20648;&#33988;&#27604;&#20363;&#35774;&#23450;&#20026;&#20154;&#22343;&#36164;&#26412;&#30340;S&#24418;&#20989;&#25968;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#31283;&#24577;&#27010;&#29575;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2310.09098</link><description>&lt;p&gt;
&#22686;&#38271;&#65292;&#36139;&#22256;&#38519;&#38449;&#21644;&#36867;&#33073;
&lt;/p&gt;
&lt;p&gt;
Growth, Poverty Trap and Escape. (arXiv:2310.09098v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09098
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38543;&#26426;Solow&#22686;&#38271;&#27169;&#22411;&#30340;&#20551;&#35774;&#65292;&#35813;&#27169;&#22411;&#23558;&#20648;&#33988;&#27604;&#20363;&#35774;&#23450;&#20026;&#20154;&#22343;&#36164;&#26412;&#30340;S&#24418;&#20989;&#25968;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#31283;&#24577;&#27010;&#29575;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33879;&#21517;&#30340;Solow&#22686;&#38271;&#27169;&#22411;&#26159;&#32463;&#27982;&#22686;&#38271;&#29702;&#35770;&#20013;&#30340;&#22522;&#26412;&#27169;&#22411;&#65292;&#30740;&#31350;&#36164;&#26412;&#31215;&#32047;&#19982;&#26102;&#38388;&#30340;&#20851;&#31995;&#65292;&#20854;&#20013;&#36164;&#26412;&#23384;&#37327;&#12289;&#21171;&#21160;&#21147;&#21644;&#25216;&#26415;&#25928;&#29575;&#26159;&#20854;&#22522;&#26412;&#35201;&#32032;&#12290;&#36164;&#26412;&#34987;&#20551;&#35774;&#20026;&#21046;&#36896;&#35774;&#22791;&#21644;&#26448;&#26009;&#30340;&#24418;&#24335;&#12290;&#27169;&#22411;&#30340;&#20004;&#20010;&#37325;&#35201;&#21442;&#25968;&#26159;&#65306;&#29983;&#20135;&#20989;&#25968;&#20135;&#20986;&#30340;&#20648;&#33988;&#27604;&#20363;$s$&#21644;&#20986;&#29616;&#22312;&#29983;&#20135;&#20989;&#25968;&#20013;&#30340;&#25216;&#26415;&#25928;&#29575;&#21442;&#25968;$A$&#12290;&#20648;&#33988;&#27604;&#20363;&#30340;&#20135;&#20986;&#20840;&#37096;&#29992;&#20110;&#29983;&#25104;&#26032;&#30340;&#36164;&#26412;&#65292;&#21097;&#19979;&#30340;&#21017;&#34987;&#28040;&#36153;&#12290;&#36164;&#26412;&#23384;&#37327;&#36824;&#20250;&#38543;&#26102;&#38388;&#36880;&#28176;&#20943;&#23569;&#65292;&#21407;&#22240;&#26159;&#26087;&#36164;&#26412;&#30340;&#30952;&#25439;&#20197;&#21450;&#21171;&#21160;&#21147;&#20154;&#21475;&#30340;&#22686;&#21152;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#20648;&#33988;&#27604;&#20363;&#26159;&#20154;&#22343;&#36164;&#26412;$k_p$&#30340;S&#24418;&#20989;&#25968;&#30340;&#38543;&#26426;Solow&#22686;&#38271;&#27169;&#22411;&#12290;&#25105;&#20204;&#20174;&#35299;&#26512;&#19978;&#25512;&#23548;&#20986;&#31283;&#24577;&#27010;&#29575;&#20998;&#24067;$P(k_p)$&#24182;&#23637;&#31034;&#20102;&#8230;
&lt;/p&gt;
&lt;p&gt;
The well-known Solow growth model is the workhorse model of the theory of economic growth, which studies capital accumulation in a model economy as a function of time with capital stock, labour and technology efiiciency as the basic ingredients. The capital is assumed to be in the form of manufacturing equipments and materials. Two important parameters of the model are: the saving fraction $s$ of the output of a production function and the technology efficiency parameter $A$, appearing in the production function. The saved fraction of the output is fully invested in the generation of new capital and the rest is consumed. The capital stock also depreciates as a function of time due to the wearing out of old capital and the increase in the size of the labour population. We propose a stochastic Solow growth model assuming the saving fraction to be a sigmoidal function of the per capita capital $k_p$. We derive analytically the steady state probability distribution $P(k_p)$ and demonstrate
&lt;/p&gt;</description></item></channel></rss>