<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#21327;&#35758;&#39044;&#27979;&#37327;&#23376;&#22810;&#20307;&#31995;&#32479;&#30340;&#22522;&#24577;&#21450;&#20854;&#24615;&#36136;&#65292;&#20854;&#31934;&#24230;&#20026; $\varepsilon$&#65292;&#24182;&#20855;&#26377;&#21487;&#35777;&#26126;&#30340;&#20445;&#38556;&#65307;&#20294;&#23545;&#20110;&#26222;&#36941;&#30340;&#33021;&#38553;&#21704;&#23494;&#39039;&#37327;&#65292;&#26679;&#26412;&#20010;&#25968; $N = m^{{\cal{O}} \left(\frac{1}{\varepsilon}\right)}$&#65292;&#21482;&#36866;&#29992;&#20110;&#21442;&#25968;&#31354;&#38388;&#32500;&#24230;&#36739;&#22823;&#65292;&#19988;&#31934;&#24230;&#19981;&#26159;&#32039;&#36843;&#22240;&#32032;&#65292;&#26080;&#27861;&#36827;&#20837;&#26356;&#31934;&#30830;&#30340;&#23398;&#20064;&#21644;&#39044;&#27979;&#39046;&#22495;&#12290;</title><link>http://arxiv.org/abs/2304.04353</link><description>&lt;p&gt;
&#22823;&#35268;&#27169;&#37327;&#23376;&#22810;&#20307;&#24577;&#30340;&#26426;&#22120;&#23398;&#20064;&#26174;&#33879;&#25552;&#39640;&#25928;&#29575;&#24182;&#20855;&#26377;&#21487;&#35777;&#26126;&#20445;&#38556;
&lt;/p&gt;
&lt;p&gt;
Exponentially Improved Efficient Machine Learning for Quantum Many-body States with Provable Guarantees. (arXiv:2304.04353v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04353
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#21327;&#35758;&#39044;&#27979;&#37327;&#23376;&#22810;&#20307;&#31995;&#32479;&#30340;&#22522;&#24577;&#21450;&#20854;&#24615;&#36136;&#65292;&#20854;&#31934;&#24230;&#20026; $\varepsilon$&#65292;&#24182;&#20855;&#26377;&#21487;&#35777;&#26126;&#30340;&#20445;&#38556;&#65307;&#20294;&#23545;&#20110;&#26222;&#36941;&#30340;&#33021;&#38553;&#21704;&#23494;&#39039;&#37327;&#65292;&#26679;&#26412;&#20010;&#25968; $N = m^{{\cal{O}} \left(\frac{1}{\varepsilon}\right)}$&#65292;&#21482;&#36866;&#29992;&#20110;&#21442;&#25968;&#31354;&#38388;&#32500;&#24230;&#36739;&#22823;&#65292;&#19988;&#31934;&#24230;&#19981;&#26159;&#32039;&#36843;&#22240;&#32032;&#65292;&#26080;&#27861;&#36827;&#20837;&#26356;&#31934;&#30830;&#30340;&#23398;&#20064;&#21644;&#39044;&#27979;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#32463;&#20856;&#31639;&#27861;&#32780;&#35328;&#65292;&#35299;&#20915;&#37327;&#23376;&#22810;&#20307;&#31995;&#32479;&#30340;&#22522;&#24577;&#21450;&#20854;&#24615;&#36136;&#36890;&#24120;&#26159;&#19968;&#39033;&#33392;&#24040;&#30340;&#20219;&#21153;&#12290;&#23545;&#20110;&#23450;&#20041;&#22312;&#29289;&#29702;&#21442;&#25968; $m$ &#32500;&#31354;&#38388;&#19978;&#30340;&#21704;&#23494;&#39039;&#37327;&#26063;&#65292;&#21482;&#35201;&#21487;&#20197;&#39640;&#25928;&#22320;&#20934;&#22791;&#21644;&#27979;&#37327;&#19968;&#32452; $N$ &#20010;&#24577;&#65292;&#23601;&#21487;&#20197;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#21327;&#35758;&#39044;&#27979;&#20854;&#22522;&#24577;&#21450;&#20854;&#22312;&#20219;&#24847;&#21442;&#25968;&#37197;&#32622;&#19979;&#30340;&#24615;&#36136;&#65292;&#31934;&#24230;&#20026; $\varepsilon$&#12290;&#26368;&#36817;&#30340;&#19968;&#39033;&#30740;&#31350; [Huang &#31561;&#20154;&#65292;Science 377&#65292;eabk3333&#65288;2022&#65289;] &#23545;&#36825;&#31181;&#19968;&#33324;&#21270;&#25552;&#20986;&#20102;&#20005;&#26684;&#30340;&#20445;&#38556;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#23545;&#20110;&#26222;&#36941;&#30340;&#33021;&#38553;&#21704;&#23494;&#39039;&#37327;&#65292;&#26222;&#36866;&#30340;&#25351;&#25968;&#32553;&#25918;&#20026; $N = m^{{\cal{O}} \left(\frac{1}{\varepsilon}\right)}$&#65292;&#36825;&#20010;&#32467;&#26524;&#20165;&#36866;&#29992;&#20110;&#21442;&#25968;&#31354;&#38388;&#30340;&#32500;&#24230;&#36739;&#22823;&#65292;&#32780;&#31934;&#24230;&#30340;&#32553;&#25918;&#21017;&#19981;&#26159;&#19968;&#20010;&#32039;&#36843;&#30340;&#22240;&#32032;&#65292;&#19981;&#33021;&#36827;&#20837;&#26356;&#31934;&#30830;&#30340;&#23398;&#20064;&#21644;&#39044;&#27979;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
Solving the ground state and the ground-state properties of quantum many-body systems is generically a hard task for classical algorithms. For a family of Hamiltonians defined on an $m$-dimensional space of physical parameters, the ground state and its properties at an arbitrary parameter configuration can be predicted via a machine learning protocol up to a prescribed prediction error $\varepsilon$, provided that a sample set (of size $N$) of the states can be efficiently prepared and measured. In a recent work [Huang et al., Science 377, eabk3333 (2022)], a rigorous guarantee for such an generalization was proved. Unfortunately, an exponential scaling, $N = m^{ {\cal{O}} \left(\frac{1}{\varepsilon} \right) }$, was found to be universal for generic gapped Hamiltonians. This result applies to the situation where the dimension of the parameter space is large while the scaling with the accuracy is not an urgent factor, not entering the realm of more precise learning and prediction. In th
&lt;/p&gt;</description></item></channel></rss>