<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#36890;&#36807;&#22240;&#26524;&#24178;&#39044;&#26694;&#26550;&#65292;&#35780;&#20272;&#31227;&#21160;&#22240;&#32032;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#24433;&#21709;&#65292;&#20135;&#29983;&#20855;&#26377;&#19981;&#21516;&#31227;&#21160;&#34892;&#20026;&#30340;&#20301;&#32622;&#24207;&#21015;&#65292;&#26377;&#21161;&#20110;&#29702;&#35299;&#21644;&#35299;&#37322;&#39044;&#27979;&#32593;&#32476;&#12290;</title><link>https://arxiv.org/abs/2311.11749</link><description>&lt;p&gt;
&#36890;&#36807;&#22240;&#26524;&#24178;&#39044;&#25581;&#31034;&#34892;&#20026;&#23545;&#31227;&#21160;&#39044;&#27979;&#32593;&#32476;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Revealing behavioral impact on mobility prediction networks through causal interventions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.11749
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22240;&#26524;&#24178;&#39044;&#26694;&#26550;&#65292;&#35780;&#20272;&#31227;&#21160;&#22240;&#32032;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#24433;&#21709;&#65292;&#20135;&#29983;&#20855;&#26377;&#19981;&#21516;&#31227;&#21160;&#34892;&#20026;&#30340;&#20301;&#32622;&#24207;&#21015;&#65292;&#26377;&#21161;&#20110;&#29702;&#35299;&#21644;&#35299;&#37322;&#39044;&#27979;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#22312;&#31227;&#21160;&#24615;&#39044;&#27979;&#20219;&#21153;&#20013;&#34987;&#36234;&#26469;&#36234;&#24191;&#27867;&#22320;&#20351;&#29992;&#65292;&#28982;&#32780;&#23427;&#20204;&#22797;&#26434;&#30340;&#20869;&#37096;&#36816;&#20316;&#26041;&#24335;&#32473;&#21487;&#35299;&#37322;&#24615;&#24102;&#26469;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#22312;&#29702;&#35299;&#21508;&#31181;&#31227;&#21160;&#34892;&#20026;&#22914;&#20309;&#24433;&#21709;&#39044;&#27979;&#26041;&#38754;&#12290;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#20010;&#22240;&#26524;&#24178;&#39044;&#26694;&#26550;&#65292;&#35780;&#20272;&#19982;&#19979;&#19968;&#20010;&#20301;&#32622;&#39044;&#27979;&#30456;&#20851;&#30340;&#31227;&#21160;&#22240;&#32032;&#23545;&#31070;&#32463;&#32593;&#32476;&#30340;&#24433;&#21709; -- &#36825;&#26159;&#19968;&#39033;&#19987;&#27880;&#20110;&#39044;&#27979;&#20010;&#20307;&#21363;&#23558;&#21040;&#36798;&#20301;&#32622;&#30340;&#20219;&#21153;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#31227;&#21160;&#27169;&#22411;&#29983;&#25104;&#21512;&#25104;&#20301;&#32622;&#35775;&#38382;&#24207;&#21015;&#65292;&#24182;&#36890;&#36807;&#24178;&#39044;&#23427;&#20204;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#26469;&#25511;&#21046;&#34892;&#20026;&#21160;&#24577;&#12290;&#25105;&#20204;&#20351;&#29992;&#31227;&#21160;&#25351;&#26631;&#35780;&#20272;&#24178;&#39044;&#20301;&#32622;&#24207;&#21015;&#65292;&#24182;&#23558;&#20854;&#36755;&#20837;&#21040;&#35757;&#32451;&#33391;&#22909;&#30340;&#32593;&#32476;&#20013;&#20197;&#20998;&#26512;&#24615;&#33021;&#21464;&#21270;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20135;&#29983;&#20855;&#26377;&#19981;&#21516;&#31227;&#21160;&#34892;&#20026;&#30340;&#20301;&#32622;&#24207;&#21015;&#30340;&#26377;&#25928;&#24615;&#65292;&#20174;&#32780;&#20419;&#36827;&#20102;&#39044;&#27979;&#32593;&#32476;&#30340;&#29702;&#35299;&#21644;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.11749v2 Announce Type: replace-cross  Abstract: Deep neural networks are increasingly utilized in mobility prediction tasks, yet their intricate internal workings pose challenges for interpretability, especially in comprehending how various aspects of mobility behavior affect predictions. This study introduces a causal intervention framework to assess the impact of mobility-related factors on neural networks designed for next location prediction -- a task focusing on predicting the immediate next location of an individual. To achieve this, we employ individual mobility models to generate synthetic location visit sequences and control behavior dynamics by intervening in their data generation process. We evaluate the interventional location sequences using mobility metrics and input them into well-trained networks to analyze performance variations. The results demonstrate the effectiveness in producing location sequences with distinct mobility behaviors, thereby facilitating t
&lt;/p&gt;</description></item></channel></rss>