<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#21333;&#19968;&#24402;&#19968;&#21270;&#27969;&#21644;&#24067;&#23572;&#26465;&#20214;&#30340;&#31616;&#21333;&#26550;&#26500;&#65292;&#23558;&#39640;&#33021;&#29289;&#29702;&#27169;&#25311;&#20107;&#20214;&#30340;&#20998;&#24067;&#26377;&#25928;&#22320;&#36716;&#25442;&#20026;&#35266;&#27979;&#25968;&#25454;&#20998;&#24067;&#30340;&#26657;&#27491;&#26041;&#27861;&#65292;&#24182;&#22312;&#29609;&#20855;&#25968;&#25454;&#38598;&#19978;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;</title><link>https://arxiv.org/abs/2403.18582</link><description>&lt;p&gt;
&#29992;&#21333;&#19968;&#24402;&#19968;&#21270;&#27969;&#21644;&#19968;&#20010;&#24320;&#20851;&#25913;&#36827;&#39640;&#33021;&#29289;&#29702;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
One flow to correct them all: improving simulations in high-energy physics with a single normalising flow and a switch
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18582
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#21333;&#19968;&#24402;&#19968;&#21270;&#27969;&#21644;&#24067;&#23572;&#26465;&#20214;&#30340;&#31616;&#21333;&#26550;&#26500;&#65292;&#23558;&#39640;&#33021;&#29289;&#29702;&#27169;&#25311;&#20107;&#20214;&#30340;&#20998;&#24067;&#26377;&#25928;&#22320;&#36716;&#25442;&#20026;&#35266;&#27979;&#25968;&#25454;&#20998;&#24067;&#30340;&#26657;&#27491;&#26041;&#27861;&#65292;&#24182;&#22312;&#29609;&#20855;&#25968;&#25454;&#38598;&#19978;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27169;&#25311;&#20107;&#20214;&#26159;&#20960;&#20046;&#25152;&#26377;&#39640;&#33021;&#29289;&#29702;&#20998;&#26512;&#20013;&#30340;&#20851;&#38190;&#35201;&#32032;&#12290;&#28982;&#32780;&#65292;&#27169;&#25311;&#20013;&#30340;&#19981;&#23436;&#32654;&#21487;&#33021;&#23548;&#33268;&#35266;&#27979;&#25968;&#25454;&#21644;&#27169;&#25311;&#20107;&#20214;&#20043;&#38388;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#24046;&#24322;&#12290;&#36825;&#31181;&#27169;&#25311;&#19981;&#23436;&#20840;&#24615;&#23545;&#30456;&#20851;&#21487;&#35266;&#27979;&#37327;&#30340;&#24433;&#21709;&#24517;&#39035;&#36890;&#36807;&#27604;&#20363;&#22240;&#23376;&#12289;&#26435;&#37325;&#25110;&#20462;&#25913;&#21487;&#35266;&#27979;&#37327;&#21450;&#20854;&#30456;&#20851;&#24615;&#30340;&#20998;&#24067;&#26469;&#26377;&#25928;&#22320;&#36827;&#34892;&#26657;&#27491;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26657;&#27491;&#26041;&#27861;&#65292;&#20351;&#29992;&#22522;&#20110;&#21333;&#19968;&#27491;&#24120;&#21270;&#27969;&#21644;&#24067;&#23572;&#26465;&#20214;&#30340;&#31616;&#21333;&#26550;&#26500;&#23558;&#19968;&#20010;&#22810;&#32500;&#20998;&#24067;&#65288;&#27169;&#25311;&#65289;&#36716;&#25442;&#20026;&#21478;&#19968;&#20010;&#22810;&#32500;&#20998;&#24067;&#65288;&#25968;&#25454;&#65289;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#21463;&#29289;&#29702;&#21551;&#21457;&#30340;&#29609;&#20855;&#25968;&#25454;&#38598;&#19978;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#35813;&#25968;&#25454;&#38598;&#23384;&#22312;&#20960;&#20010;&#21487;&#35266;&#27979;&#37327;&#21450;&#20854;&#30456;&#20851;&#24615;&#30340;&#38750;&#24179;&#20961;&#27169;&#25311;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18582v1 Announce Type: cross  Abstract: Simulated events are key ingredients in almost all high-energy physics analyses. However, imperfections in the simulation can lead to sizeable differences between the observed data and simulated events. The effects of such mismodelling on relevant observables must be corrected either effectively via scale factors, with weights or by modifying the distributions of the observables and their correlations. We introduce a correction method that transforms one multidimensional distribution (simulation) into another one (data) using a simple architecture based on a single normalising flow with a boolean condition. We demonstrate the effectiveness of the method on a physics-inspired toy dataset with non-trivial mismodelling of several observables and their correlations.
&lt;/p&gt;</description></item></channel></rss>