<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#29289;&#29702;&#21551;&#21457;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#23450;&#21521;&#26102;&#24577;&#32593;&#32476;&#20013;&#25512;&#26029;&#33410;&#28857;&#30340;&#21160;&#24577;&#25490;&#24207;&#65292;&#36890;&#36807;&#27714;&#35299;&#32447;&#24615;&#26041;&#31243;&#32452;&#23454;&#29616;&#65292;&#20165;&#38656;&#35843;&#25972;&#19968;&#20010;&#21442;&#25968;&#65292;&#20855;&#26377;&#21487;&#25193;&#23637;&#24615;&#21644;&#39640;&#25928;&#24615;&#12290;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#30340;&#27979;&#35797;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#26041;&#27861;&#27604;&#29616;&#26377;&#26041;&#27861;&#26356;&#22909;&#22320;&#39044;&#27979;&#20102;&#21160;&#24577;&#25490;&#24207;&#12290;</title><link>http://arxiv.org/abs/2307.13544</link><description>&lt;p&gt;
&#22312;&#32593;&#32476;&#20013;&#39640;&#25928;&#21160;&#24577;&#25490;&#24207;&#30340;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A model for efficient dynamical ranking in networks. (arXiv:2307.13544v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13544
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#29289;&#29702;&#21551;&#21457;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#23450;&#21521;&#26102;&#24577;&#32593;&#32476;&#20013;&#25512;&#26029;&#33410;&#28857;&#30340;&#21160;&#24577;&#25490;&#24207;&#65292;&#36890;&#36807;&#27714;&#35299;&#32447;&#24615;&#26041;&#31243;&#32452;&#23454;&#29616;&#65292;&#20165;&#38656;&#35843;&#25972;&#19968;&#20010;&#21442;&#25968;&#65292;&#20855;&#26377;&#21487;&#25193;&#23637;&#24615;&#21644;&#39640;&#25928;&#24615;&#12290;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#30340;&#27979;&#35797;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#26041;&#27861;&#27604;&#29616;&#26377;&#26041;&#27861;&#26356;&#22909;&#22320;&#39044;&#27979;&#20102;&#21160;&#24577;&#25490;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#29289;&#29702;&#21551;&#21457;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#25512;&#26029;&#23450;&#21521;&#26102;&#24577;&#32593;&#32476;&#20013;&#30340;&#21160;&#24577;&#25490;&#24207; - &#27599;&#20010;&#23450;&#21521;&#19988;&#24102;&#26102;&#38388;&#25139;&#30340;&#36793;&#21453;&#26144;&#20102;&#19968;&#23545;&#20132;&#20114;&#30340;&#32467;&#26524;&#21644;&#26102;&#38388;&#12290;&#27599;&#20010;&#33410;&#28857;&#30340;&#25512;&#26029;&#25490;&#24207;&#26159;&#23454;&#20540;&#19988;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#65292;&#27599;&#27425;&#26032;&#30340;&#36793;&#32536;&#37117;&#20250;&#25552;&#39640;&#25110;&#38477;&#20302;&#33410;&#28857;&#30340;&#20272;&#35745;&#24378;&#24230;&#25110;&#22768;&#26395;&#65292;&#36825;&#22312;&#30495;&#23454;&#24773;&#26223;&#20013;&#32463;&#24120;&#35266;&#23519;&#21040;&#65292;&#21253;&#25324;&#28216;&#25103;&#24207;&#21015;&#65292;&#38182;&#26631;&#36187;&#25110;&#21160;&#29289;&#31561;&#32423;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#27714;&#35299;&#19968;&#32452;&#32447;&#24615;&#26041;&#31243;&#26469;&#24037;&#20316;&#65292;&#24182;&#19988;&#21482;&#38656;&#35201;&#35843;&#25972;&#19968;&#20010;&#21442;&#25968;&#12290;&#22240;&#27492;&#65292;&#23545;&#24212;&#30340;&#31639;&#27861;&#26159;&#21487;&#25193;&#23637;&#19988;&#39640;&#25928;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#35780;&#20272;&#26041;&#27861;&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#39044;&#27979;&#20132;&#20114;&#65288;&#36793;&#32536;&#23384;&#22312;&#65289;&#21450;&#20854;&#32467;&#26524;&#65288;&#36793;&#32536;&#26041;&#21521;&#65289;&#30340;&#33021;&#21147;&#26469;&#27979;&#35797;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#21253;&#25324;&#21512;&#25104;&#25968;&#25454;&#21644;&#30495;&#23454;&#25968;&#25454;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26174;&#31034;&#65292;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#27604;&#29616;&#26377;&#30340;&#26041;&#27861;&#26356;&#22909;&#22320;&#39044;&#27979;&#20102;&#21160;&#24577;&#25490;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a physics-inspired method for inferring dynamic rankings in directed temporal networks - networks in which each directed and timestamped edge reflects the outcome and timing of a pairwise interaction. The inferred ranking of each node is real-valued and varies in time as each new edge, encoding an outcome like a win or loss, raises or lowers the node's estimated strength or prestige, as is often observed in real scenarios including sequences of games, tournaments, or interactions in animal hierarchies. Our method works by solving a linear system of equations and requires only one parameter to be tuned. As a result, the corresponding algorithm is scalable and efficient. We test our method by evaluating its ability to predict interactions (edges' existence) and their outcomes (edges' directions) in a variety of applications, including both synthetic and real data. Our analysis shows that in many cases our method's performance is better than existing methods for predicting dyna
&lt;/p&gt;</description></item></channel></rss>