<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19977;&#23618;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#31038;&#21306;&#38887;&#24615;&#35780;&#20272;&#26041;&#27861;&#65292;&#36890;&#36807;&#25429;&#25417;&#31038;&#21306;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#30340;&#24322;&#36136;&#29305;&#24449;&#21644;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#65292;&#23454;&#29616;&#23545;&#31038;&#21306;&#38887;&#24615;&#30340;&#20840;&#38754;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2311.01661</link><description>&lt;p&gt;
&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#31038;&#21306;&#38887;&#24615;&#35780;&#20272;&#65306;&#22522;&#20110;&#30456;&#20114;&#20851;&#32852;&#30340;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#29305;&#24449;
&lt;/p&gt;
&lt;p&gt;
Deep Learning-driven Community Resilience Rating based on Intertwined Socio-Technical Systems Features. (arXiv:2311.01661v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01661
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19977;&#23618;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#31038;&#21306;&#38887;&#24615;&#35780;&#20272;&#26041;&#27861;&#65292;&#36890;&#36807;&#25429;&#25417;&#31038;&#21306;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#30340;&#24322;&#36136;&#29305;&#24449;&#21644;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#65292;&#23454;&#29616;&#23545;&#31038;&#21306;&#38887;&#24615;&#30340;&#20840;&#38754;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#21306;&#38887;&#24615;&#26159;&#19968;&#20010;&#22797;&#26434;&#19988;&#22810;&#32500;&#30340;&#29616;&#35937;&#65292;&#20854;&#28304;&#20110;&#19981;&#21516;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#20043;&#38388;&#30340;&#22797;&#26434;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#21644;&#20854;&#38887;&#24615;&#29305;&#24615;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#20851;&#20110;&#31038;&#21306;&#38887;&#24615;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#33030;&#24369;&#24615;&#35780;&#20272;&#65292;&#24182;&#37319;&#29992;&#22522;&#20110;&#25351;&#26631;&#30340;&#26041;&#27861;&#65292;&#20854;&#23545;&#20110;&#25429;&#25417;&#31038;&#21306;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#20869;&#37096;&#30340;&#24322;&#36136;&#29305;&#24449;&#21450;&#20854;&#38750;&#32447;&#24615;&#30456;&#20114;&#20316;&#29992;&#20197;&#22609;&#36896;&#38887;&#24615;&#30340;&#31283;&#20581;&#24615;&#12289;&#20887;&#20313;&#24615;&#21644;&#36164;&#28304;&#24615;&#31561;&#32452;&#25104;&#37096;&#20998;&#30340;&#33021;&#21147;&#26377;&#38480;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#19977;&#23618;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#31038;&#21306;&#38887;&#24615;&#35780;&#20272;&#26041;&#27861;&#65288;&#31216;&#20026;Resili-Net&#65289;&#12290;&#22312;&#31038;&#21306;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#65288;&#21363;&#35774;&#26045;&#12289;&#22522;&#30784;&#35774;&#26045;&#21644;&#31038;&#20250;&#65289;&#20013;&#65292;&#30830;&#23450;&#21644;&#35745;&#31639;&#20102;&#20855;&#20307;&#30340;12&#20010;&#21487;&#27979;&#37327;&#30340;&#38887;&#24615;&#29305;&#24449;&#65292;&#19982;&#38887;&#24615;&#30340;&#31283;&#20581;&#24615;&#12289;&#20887;&#20313;&#24615;&#21644;&#36164;&#28304;&#24615;&#19977;&#20010;&#32452;&#25104;&#37096;&#20998;&#30456;&#20851;&#12290;&#36890;&#36807;&#20351;&#29992;&#22810;&#20010;&#32654;&#22269;&#22823;&#37117;&#24066;&#32479;&#35745;&#21306;&#30340;&#20844;&#24320;&#21487;&#35775;&#38382;&#25968;&#25454;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Community resilience is a complex and muti-faceted phenomenon that emerges from complex and nonlinear interactions among different socio-technical systems and their resilience properties. However, present studies on community resilience focus primarily on vulnerability assessment and utilize index-based approaches, with limited ability to capture heterogeneous features within community socio-technical systems and their nonlinear interactions in shaping robustness, redundancy, and resourcefulness components of resilience. To address this gap, this paper presents an integrated three-layer deep learning model for community resilience rating (called Resili-Net). Twelve measurable resilience features are specified and computed within community socio-technical systems (i.e., facilities, infrastructures, and society) related to three resilience components of robustness, redundancy, and resourcefulness. Using publicly accessible data from multiple metropolitan statistical areas in the United S
&lt;/p&gt;</description></item></channel></rss>