<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;Sakoda-Schelling&#27169;&#22411;&#20013;&#30340;&#32844;&#19994;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#27169;&#22411;&#20013;&#30340;&#38750;&#24179;&#34913;&#21160;&#21147;&#23398;&#65292;&#24182;&#22312;&#24179;&#22343;&#22330;&#36817;&#20284;&#19979;&#23558;&#20854;&#26144;&#23556;&#20026;&#20027;&#21160;&#29289;&#36136;&#25551;&#36848;&#12290;&#36890;&#36807;&#30740;&#31350;&#38750;&#20114;&#24800;&#24615;&#20114;&#21160;&#65292;&#23637;&#31034;&#20102;&#38750;&#31283;&#24577;&#30340;&#23439;&#35266;&#34892;&#20026;&#12290;&#36825;&#19968;&#30740;&#31350;&#20026;&#22320;&#29702;&#30456;&#20851;&#30340;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#26377;&#21161;&#20110;&#21516;&#26102;&#32771;&#34385;&#20154;&#21475;&#21644;&#20215;&#26684;&#21160;&#24577;&#12290;</title><link>http://arxiv.org/abs/2307.14270</link><description>&lt;p&gt;
&#38750;&#24179;&#34913;&#30340;Sakoda-Schelling&#27169;&#22411;&#20013;&#30340;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#20316;&#20026;&#20027;&#21160;&#29289;&#36136;
&lt;/p&gt;
&lt;p&gt;
Socioeconomic agents as active matter in nonequilibrium Sakoda-Schelling models. (arXiv:2307.14270v1 [cond-mat.stat-mech])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14270
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;Sakoda-Schelling&#27169;&#22411;&#20013;&#30340;&#32844;&#19994;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#27169;&#22411;&#20013;&#30340;&#38750;&#24179;&#34913;&#21160;&#21147;&#23398;&#65292;&#24182;&#22312;&#24179;&#22343;&#22330;&#36817;&#20284;&#19979;&#23558;&#20854;&#26144;&#23556;&#20026;&#20027;&#21160;&#29289;&#36136;&#25551;&#36848;&#12290;&#36890;&#36807;&#30740;&#31350;&#38750;&#20114;&#24800;&#24615;&#20114;&#21160;&#65292;&#23637;&#31034;&#20102;&#38750;&#31283;&#24577;&#30340;&#23439;&#35266;&#34892;&#20026;&#12290;&#36825;&#19968;&#30740;&#31350;&#20026;&#22320;&#29702;&#30456;&#20851;&#30340;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#26377;&#21161;&#20110;&#21516;&#26102;&#32771;&#34385;&#20154;&#21475;&#21644;&#20215;&#26684;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20195;&#29702;&#20154;&#30340;&#20915;&#31574;&#35268;&#21017;&#23545;&#20110;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#27169;&#22411;&#26377;&#22810;&#20040;&#31283;&#20581;&#65311;&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#19968;&#31181;&#31867;&#20284;Sakoda-Schelling&#27169;&#22411;&#30340;&#32844;&#19994;&#27169;&#22411;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#22312;&#21382;&#21490;&#19978;&#34987;&#24341;&#20837;&#20197;&#25581;&#31034;&#20154;&#31867;&#32676;&#20307;&#20043;&#38388;&#30340;&#38548;&#31163;&#21160;&#21147;&#23398;&#12290;&#23545;&#20110;&#22823;&#31867;&#30340;&#25928;&#29992;&#20989;&#25968;&#21644;&#20915;&#31574;&#35268;&#21017;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#20195;&#29702;&#20154;&#21160;&#21147;&#23398;&#30340;&#38750;&#24179;&#34913;&#24615;&#65292;&#21516;&#26102;&#24674;&#22797;&#20102;&#31867;&#20284;&#24179;&#34913;&#30456;&#20998;&#31163;&#30340;&#29616;&#35937;&#23398;&#12290;&#22312;&#24179;&#22343;&#22330;&#36817;&#20284;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#27169;&#22411;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#34987;&#26144;&#23556;&#20026;&#20027;&#21160;&#29289;&#36136;&#22330;&#25551;&#36848;&#65288;Active Model B&#65289;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#20010;&#20154;&#32676;&#20043;&#38388;&#30340;&#38750;&#20114;&#24800;&#24615;&#20114;&#21160;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22914;&#20309;&#23548;&#33268;&#38750;&#31283;&#24577;&#30340;&#23439;&#35266;&#34892;&#20026;&#12290;&#25105;&#20204;&#30456;&#20449;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36827;&#19968;&#27493;&#30740;&#31350;&#22320;&#29702;&#30456;&#20851;&#30340;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#65292;&#23588;&#20854;&#26159;&#22312;&#22330;&#35770;&#26041;&#27861;&#20013;&#21516;&#26102;&#32771;&#34385;&#20154;&#21475;&#21644;&#20215;&#26684;&#21160;&#24577;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
How robust are socioeconomic agent-based models with respect to the details of the agents' decision rule? We tackle this question by considering an occupation model in the spirit of the Sakoda-Schelling model, historically introduced to shed light on segregation dynamics among human groups. For a large class of utility functions and decision rules, we pinpoint the nonequilibrium nature of the agent dynamics, while recovering the equilibrium-like phase separation phenomenology. Within the mean field approximation we show how the model can be mapped, to some extent, onto an active matter field description (Active Model B). Finally, we consider non-reciprocal interactions between two populations, and show how they can lead to non-steady macroscopic behavior. We believe our approach provides a unifying framework to further study geography-dependent agent-based models, notably paving the way for joint consideration of population and price dynamics within a field theoretic approach.
&lt;/p&gt;</description></item></channel></rss>