<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#26412;&#25991;&#36890;&#36807;&#23558;Pearson&#30456;&#20851;&#30697;&#38453;&#31895;&#31890;&#21270;&#65292;&#26681;&#25454;&#24066;&#22330;&#37096;&#38376;&#26469;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#24182;&#27604;&#36739;&#20102;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#22312;&#24066;&#22330;&#29366;&#24577;&#28436;&#21464;&#21644;&#36716;&#25442;&#30697;&#38453;&#19978;&#30340;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#23545;&#24066;&#22330;&#29366;&#24577;&#30340;&#34892;&#20026;&#26159;&#30456;&#20284;&#30340;&#65292;&#24182;&#19988;&#30456;&#20851;&#21464;&#37327;&#25968;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;</title><link>https://arxiv.org/abs/2402.05364</link><description>&lt;p&gt;
&#26681;&#25454;&#23439;&#35266;&#32467;&#26500;&#26469;&#31895;&#31890;&#21270;&#30456;&#20851;&#30697;&#38453;&#65306;&#20197;&#37329;&#34701;&#24066;&#22330;&#20026;&#33539;&#20363;
&lt;/p&gt;
&lt;p&gt;
Coarse graining correlation matrices according to macrostructures: Financial markets as a paradigm
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;Pearson&#30456;&#20851;&#30697;&#38453;&#31895;&#31890;&#21270;&#65292;&#26681;&#25454;&#24066;&#22330;&#37096;&#38376;&#26469;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#24182;&#27604;&#36739;&#20102;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#22312;&#24066;&#22330;&#29366;&#24577;&#28436;&#21464;&#21644;&#36716;&#25442;&#30697;&#38453;&#19978;&#30340;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#23545;&#24066;&#22330;&#29366;&#24577;&#30340;&#34892;&#20026;&#26159;&#30456;&#20284;&#30340;&#65292;&#24182;&#19988;&#30456;&#20851;&#21464;&#37327;&#25968;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#23558;Pearson&#30456;&#20851;&#30697;&#38453;&#26681;&#25454;&#24066;&#22330;&#37096;&#38376;&#36827;&#34892;&#31895;&#31890;&#21270;&#65292;&#20351;&#29992;Guhr&#30340;&#30456;&#20851;&#26041;&#27861;&#24471;&#21040;Guhr&#30697;&#38453;&#65292;&#26469;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;&#30456;&#20851;&#32467;&#26500;&#12290;&#25105;&#20204;&#23558;&#24066;&#22330;&#29366;&#24577;&#30340;&#28436;&#21464;&#21644;&#30456;&#24212;&#30340;&#36716;&#25442;&#30697;&#38453;&#30340;&#32467;&#26524;&#19982;&#20351;&#29992;Pearson&#30456;&#20851;&#30697;&#38453;&#24471;&#21040;&#30340;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#23545;&#20110;&#24066;&#22330;&#29366;&#24577;&#30340;&#34892;&#20026;&#26159;&#30456;&#20284;&#30340;&#12290;&#28982;&#32780;&#65292;&#30456;&#20851;&#21464;&#37327;&#30340;&#25968;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze correlation structures in financial markets by coarse graining the Pearson correlation matrices according to market sectors to obtain Guhr matrices using Guhr's correlation method according to Ref. [P. Rinn {\it et. al.}, Europhysics Letters 110, 68003 (2015)]. We compare the results for the evolution of market states and the corresponding transition matrices with those obtained using Pearson correlation matrices. The behavior of market states is found to be similar for both the coarse grained and Pearson matrices. However, the number of relevant variables is reduced by orders of magnitude.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#32534;&#30721;&#22120;&#30340;&#23454;&#26102;&#24322;&#24120;&#26816;&#27979;&#31995;&#32479;&#65292;&#36890;&#36807;&#21322;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#26816;&#27979;CMS&#30005;&#30913;&#37327;&#33021;&#22120;&#25968;&#25454;&#20013;&#30340;&#24322;&#24120;&#65292;&#21033;&#29992;&#24322;&#24120;&#30340;&#26102;&#22495;&#28436;&#21270;&#21644;&#25506;&#27979;&#22120;&#21709;&#24212;&#30340;&#31354;&#38388;&#21464;&#21270;&#65292;&#26368;&#22823;&#21270;&#24322;&#24120;&#26816;&#27979;&#24615;&#33021;&#65292;&#24182;&#36890;&#36807;&#39564;&#35777;&#23454;&#39564;&#35777;&#26126;&#20102;&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.10157</link><description>&lt;p&gt;
&#22522;&#20110;&#33258;&#32534;&#30721;&#22120;&#30340;CMS&#30005;&#30913;&#37327;&#33021;&#22120;&#22312;&#32447;&#25968;&#25454;&#36136;&#37327;&#30417;&#27979;&#30340;&#24322;&#24120;&#26816;&#27979;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Autoencoder-based Anomaly Detection System for Online Data Quality Monitoring of the CMS Electromagnetic Calorimeter. (arXiv:2309.10157v1 [physics.ins-det])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10157
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#32534;&#30721;&#22120;&#30340;&#23454;&#26102;&#24322;&#24120;&#26816;&#27979;&#31995;&#32479;&#65292;&#36890;&#36807;&#21322;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#26816;&#27979;CMS&#30005;&#30913;&#37327;&#33021;&#22120;&#25968;&#25454;&#20013;&#30340;&#24322;&#24120;&#65292;&#21033;&#29992;&#24322;&#24120;&#30340;&#26102;&#22495;&#28436;&#21270;&#21644;&#25506;&#27979;&#22120;&#21709;&#24212;&#30340;&#31354;&#38388;&#21464;&#21270;&#65292;&#26368;&#22823;&#21270;&#24322;&#24120;&#26816;&#27979;&#24615;&#33021;&#65292;&#24182;&#36890;&#36807;&#39564;&#35777;&#23454;&#39564;&#35777;&#26126;&#20102;&#31995;&#32479;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
CMS&#25506;&#27979;&#22120;&#26159;&#22312;LHC&#19978;&#25506;&#27979;&#39640;&#33021;&#30896;&#25758;&#20135;&#29983;&#30340;&#36890;&#29992;&#35013;&#32622;&#12290;CMS&#30005;&#30913;&#37327;&#33021;&#22120;&#22312;&#32447;&#25968;&#25454;&#36136;&#37327;&#30417;&#27979;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#25805;&#20316;&#24037;&#20855;&#65292;&#33021;&#22815;&#35753;&#25506;&#27979;&#22120;&#19987;&#23478;&#24555;&#36895;&#35782;&#21035;&#12289;&#23450;&#20301;&#21644;&#35786;&#26029;&#21487;&#33021;&#24433;&#21709;&#29289;&#29702;&#25968;&#25454;&#36136;&#37327;&#30340;&#21508;&#31181;&#25506;&#27979;&#22120;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21322;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#30340;&#23454;&#26102;&#33258;&#32534;&#30721;&#22120;&#24322;&#24120;&#26816;&#27979;&#31995;&#32479;&#65292;&#33021;&#22815;&#26816;&#27979;CMS&#30005;&#30913;&#37327;&#33021;&#22120;&#25968;&#25454;&#20013;&#30340;&#24322;&#24120;&#12290;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#24322;&#24120;&#30340;&#26102;&#22495;&#28436;&#21270;&#21644;&#25506;&#27979;&#22120;&#21709;&#24212;&#30340;&#31354;&#38388;&#21464;&#21270;&#65292;&#26368;&#22823;&#21270;&#20102;&#24322;&#24120;&#26816;&#27979;&#24615;&#33021;&#12290;&#36825;&#20010;&#22522;&#20110;&#33258;&#32534;&#30721;&#22120;&#30340;&#31995;&#32479;&#33021;&#22815;&#39640;&#25928;&#22320;&#26816;&#27979;&#24322;&#24120;&#65292;&#21516;&#26102;&#20445;&#25345;&#38750;&#24120;&#20302;&#30340;&#35823;&#25253;&#29575;&#12290;&#35813;&#31995;&#32479;&#30340;&#24615;&#33021;&#36890;&#36807;&#22312;2018&#24180;&#21644;2022&#24180;LHC&#30896;&#25758;&#25968;&#25454;&#20013;&#21457;&#29616;&#30340;&#24322;&#24120;&#36827;&#34892;&#39564;&#35777;&#12290;&#27492;&#22806;&#65292;&#36824;&#39318;&#27425;&#25253;&#36947;&#20102;&#37096;&#32626;&#35813;&#31995;&#32479;&#21518;&#30340;&#21021;&#27493;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The CMS detector is a general-purpose apparatus that detects high-energy collisions produced at the LHC. Online Data Quality Monitoring of the CMS electromagnetic calorimeter is a vital operational tool that allows detector experts to quickly identify, localize, and diagnose a broad range of detector issues that could affect the quality of physics data. A real-time autoencoder-based anomaly detection system using semi-supervised machine learning is presented enabling the detection of anomalies in the CMS electromagnetic calorimeter data. A novel method is introduced which maximizes the anomaly detection performance by exploiting the time-dependent evolution of anomalies as well as spatial variations in the detector response. The autoencoder-based system is able to efficiently detect anomalies, while maintaining a very low false discovery rate. The performance of the system is validated with anomalies found in 2018 and 2022 LHC collision data. Additionally, the first results from deploy
&lt;/p&gt;</description></item></channel></rss>