<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#25968;&#25454;&#39640;&#25928;&#30340;&#22810;&#27169;&#24577;&#34920;&#31034;&#23398;&#20064;&#26041;&#27861;&#65292;&#25506;&#32034;&#20102;&#29420;&#31435;&#38477;&#32500;&#21644;&#21516;&#26102;&#38477;&#32500;&#20004;&#31181;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#29983;&#25104;&#32447;&#24615;&#27169;&#22411;&#35780;&#20272;&#20102;&#20854;&#30456;&#23545;&#20934;&#30830;&#24615;&#21644;&#25968;&#25454;&#38598;&#22823;&#23567;&#35201;&#27714;&#12290;</title><link>http://arxiv.org/abs/2310.04458</link><description>&lt;p&gt;
&#21516;&#26102;&#38477;&#32500;&#65306;&#19968;&#31181;&#25968;&#25454;&#39640;&#25928;&#30340;&#22810;&#27169;&#24577;&#34920;&#31034;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Simultaneous Dimensionality Reduction: A Data Efficient Approach for Multimodal Representations Learning. (arXiv:2310.04458v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04458
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#25968;&#25454;&#39640;&#25928;&#30340;&#22810;&#27169;&#24577;&#34920;&#31034;&#23398;&#20064;&#26041;&#27861;&#65292;&#25506;&#32034;&#20102;&#29420;&#31435;&#38477;&#32500;&#21644;&#21516;&#26102;&#38477;&#32500;&#20004;&#31181;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#29983;&#25104;&#32447;&#24615;&#27169;&#22411;&#35780;&#20272;&#20102;&#20854;&#30456;&#23545;&#20934;&#30830;&#24615;&#21644;&#25968;&#25454;&#38598;&#22823;&#23567;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#32034;&#20102;&#20004;&#31181;&#20027;&#35201;&#30340;&#38477;&#32500;&#26041;&#27861;&#65306;&#29420;&#31435;&#38477;&#32500;(IDR)&#21644;&#21516;&#26102;&#38477;&#32500;(SDR)&#12290;&#22312;IDR&#26041;&#27861;&#20013;&#65292;&#27599;&#20010;&#27169;&#24577;&#37117;&#34987;&#29420;&#31435;&#21387;&#32553;&#65292;&#21147;&#22270;&#20445;&#30041;&#27599;&#20010;&#27169;&#24577;&#20869;&#30340;&#23613;&#21487;&#33021;&#22810;&#30340;&#21464;&#21270;&#12290;&#30456;&#21453;&#65292;&#22312;SDR&#20013;&#65292;&#21516;&#26102;&#21387;&#32553;&#27169;&#24577;&#20197;&#26368;&#22823;&#21270;&#20943;&#23569;&#25551;&#36848;&#20043;&#38388;&#30340;&#21327;&#21464;&#24615;&#65292;&#21516;&#26102;&#23545;&#20445;&#30041;&#21333;&#20010;&#21464;&#21270;&#30340;&#31243;&#24230;&#19981;&#22826;&#20851;&#27880;&#12290;&#20856;&#22411;&#30340;&#20363;&#23376;&#21253;&#25324;&#20559;&#26368;&#23567;&#20108;&#20056;&#27861;&#21644;&#20856;&#22411;&#30456;&#20851;&#20998;&#26512;&#12290;&#34429;&#28982;&#36825;&#20123;&#38477;&#32500;&#26041;&#27861;&#26159;&#32479;&#35745;&#23398;&#30340;&#20027;&#35201;&#26041;&#27861;&#65292;&#20294;&#23427;&#20204;&#30340;&#30456;&#23545;&#31934;&#24230;&#21644;&#25968;&#25454;&#38598;&#22823;&#23567;&#35201;&#27714;&#23578;&#19981;&#28165;&#26970;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#29983;&#25104;&#32447;&#24615;&#27169;&#22411;&#26469;&#21512;&#25104;&#20855;&#26377;&#24050;&#30693;&#26041;&#24046;&#21644;&#21327;&#26041;&#24046;&#32467;&#26500;&#30340;&#22810;&#27169;&#24577;&#25968;&#25454;&#65292;&#20197;&#30740;&#31350;&#36825;&#20123;&#38382;&#39064;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#21327;&#26041;&#24046;&#30340;&#37325;&#26500;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We explore two primary classes of approaches to dimensionality reduction (DR): Independent Dimensionality Reduction (IDR) and Simultaneous Dimensionality Reduction (SDR). In IDR methods, of which Principal Components Analysis is a paradigmatic example, each modality is compressed independently, striving to retain as much variation within each modality as possible. In contrast, in SDR, one simultaneously compresses the modalities to maximize the covariation between the reduced descriptions while paying less attention to how much individual variation is preserved. Paradigmatic examples include Partial Least Squares and Canonical Correlations Analysis. Even though these DR methods are a staple of statistics, their relative accuracy and data set size requirements are poorly understood. We introduce a generative linear model to synthesize multimodal data with known variance and covariance structures to examine these questions. We assess the accuracy of the reconstruction of the covariance s
&lt;/p&gt;</description></item></channel></rss>