<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#38656;&#20449;&#21495;&#24314;&#27169;&#21363;&#21487;&#35782;&#21035;&#20449;&#21495;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#26679;&#26412;&#21644;&#20854;&#37051;&#23621;&#20043;&#38388;&#30456;&#23545;&#36317;&#31163;&#65292;&#21487;&#20197;&#22312;&#23567;&#26679;&#26412;&#21644;&#39640;&#32500;&#25968;&#25454;&#20013;&#35782;&#21035;&#8220;&#31867;&#20284;&#20110;&#20449;&#21495;&#8221;&#30340;&#21464;&#37327;&#12290;</title><link>http://arxiv.org/abs/2304.06522</link><description>&lt;p&gt;
&#26080;&#38656;&#20449;&#21495;&#24314;&#27169;&#30340;&#20449;&#21495;&#35782;&#21035;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Signal identification without signal formulation. (arXiv:2304.06522v1 [physics.data-an])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06522
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26080;&#38656;&#20449;&#21495;&#24314;&#27169;&#21363;&#21487;&#35782;&#21035;&#20449;&#21495;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#26679;&#26412;&#21644;&#20854;&#37051;&#23621;&#20043;&#38388;&#30456;&#23545;&#36317;&#31163;&#65292;&#21487;&#20197;&#22312;&#23567;&#26679;&#26412;&#21644;&#39640;&#32500;&#25968;&#25454;&#20013;&#35782;&#21035;&#8220;&#31867;&#20284;&#20110;&#20449;&#21495;&#8221;&#30340;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20449;&#21495;&#21644;&#22122;&#22768;&#28151;&#21512;&#26102;&#65292;&#29289;&#29702;&#23398;&#23478;&#36890;&#24120;&#36890;&#36807;&#20449;&#21495;&#24314;&#27169;&#26469;&#35782;&#21035;&#20449;&#21495;&#65292;&#32780;&#32479;&#35745;&#23398;&#23478;&#21017;&#30456;&#21453;&#65292;&#20182;&#20204;&#35797;&#22270;&#23545;&#22122;&#22768;&#36827;&#34892;&#24314;&#27169;&#26469;&#35782;&#21035;&#20449;&#21495;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24212;&#29992;&#20102;&#32479;&#35745;&#23398;&#23478;&#30340;&#20449;&#21495;&#26816;&#27979;&#27010;&#24565;&#65292;&#23545;&#20855;&#26377;&#23567;&#26679;&#26412;&#21644;&#39640;&#32500;&#25968;&#25454;&#30340;&#29289;&#29702;&#25968;&#25454;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#32780;&#19981;&#23545;&#20449;&#21495;&#36827;&#34892;&#24314;&#27169;&#12290;&#33258;&#28982;&#30028;&#20013;&#30340;&#22823;&#37096;&#20998;&#25968;&#25454;&#65292;&#26080;&#35770;&#26159;&#22122;&#22768;&#36824;&#26159;&#20449;&#21495;&#65292;&#37117;&#34987;&#20551;&#23450;&#20026;&#26159;&#30001;&#21160;&#24577;&#31995;&#32479;&#29983;&#25104;&#30340;&#65307;&#22240;&#27492;&#65292;&#22312;&#36825;&#20123;&#29983;&#25104;&#36807;&#31243;&#20043;&#38388;&#22522;&#26412;&#19978;&#27809;&#26377;&#21306;&#21035;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#21160;&#24577;&#31995;&#32479;&#30340;&#30456;&#20851;&#38271;&#24230;&#21644;&#26679;&#26412;&#25968;&#23545;&#20110;&#22312;&#36825;&#26679;&#30340;&#31995;&#32479;&#20013;&#29983;&#25104;&#30340;&#20449;&#21495;&#21464;&#37327;&#20013;&#21306;&#20998;&#22122;&#22768;&#21464;&#37327;&#30340;&#23454;&#38469;&#23450;&#20041;&#33267;&#20851;&#37325;&#35201;&#12290;&#30001;&#20110;&#20855;&#26377;&#30701;&#26399;&#30456;&#20851;&#24615;&#30340;&#21464;&#37327;&#38543;&#30528;&#26679;&#26412;&#25968;&#30340;&#20943;&#23569;&#20250;&#26356;&#24555;&#22320;&#36798;&#21040;&#27491;&#24577;&#20998;&#24067;&#65292;&#22240;&#27492;&#23427;&#20204;&#34987;&#35748;&#20026;&#26159;&#8220;&#31867;&#20284;&#20110;&#22122;&#22768;&#8221;&#30340;&#21464;&#37327;&#65292;&#32780;&#20855;&#26377;&#30456;&#21453;&#29305;&#24615;&#30340;&#21464;&#37327;&#21017;&#26159;&#8220;&#31867;&#20284;&#20110;&#20449;&#21495;&#8221;&#30340;&#21464;&#37327;&#12290;&#27491;&#24577;&#24615;&#26816;&#39564;&#19981;&#36866;&#29992;&#20110;&#23567;&#26679;&#26412;&#21644;&#39640;&#32500;&#25968;&#25454;&#65292;&#22240;&#27492;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26679;&#26412;&#21644;&#20854;&#37051;&#23621;&#20043;&#38388;&#30456;&#23545;&#36317;&#31163;&#30340;&#26032;&#26041;&#27861;&#26469;&#35782;&#21035;&#8220;&#31867;&#20284;&#20110;&#22122;&#22768;&#8221;&#30340;&#21464;&#37327;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#19981;&#36827;&#34892;&#20219;&#20309;&#20449;&#21495;&#24314;&#27169;&#30340;&#24773;&#20917;&#19979;&#35782;&#21035;&#8220;&#31867;&#20284;&#20110;&#20449;&#21495;&#8221;&#30340;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
When there are signals and noises, physicists try to identify signals by modeling them, whereas statisticians oppositely try to model noise to identify signals. In this study, we applied the statisticians' concept of signal detection of physics data with small-size samples and high dimensions without modeling the signals. Most of the data in nature, whether noises or signals, are assumed to be generated by dynamical systems; thus, there is essentially no distinction between these generating processes. We propose that the correlation length of a dynamical system and the number of samples are crucial for the practical definition of noise variables among the signal variables generated by such a system. Since variables with short-term correlations reach normal distributions faster as the number of samples decreases, they are regarded to be ``noise-like'' variables, whereas variables with opposite properties are ``signal-like'' variables. Normality tests are not effective for data of small-
&lt;/p&gt;</description></item></channel></rss>