<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#25552;&#20986;&#20102;&#31526;&#21495;&#22270;&#30340;&#21487;&#36890;&#20449;&#24615;&#20960;&#20309;&#27010;&#24565;&#65292;&#35777;&#26126;&#20102;&#20854;&#24230;&#37327;&#26159;&#27431;&#20960;&#37324;&#24503;&#30340;&#21644;&#29699;&#24418;&#30340;&#65292;&#28982;&#21518;&#24212;&#29992;&#20110;&#35299;&#20915;&#31526;&#21495;&#22270;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#22810;&#20010;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.07493</link><description>&lt;p&gt;
&#36890;&#36807;&#21487;&#36890;&#20449;&#24615;&#20960;&#20309;&#23398;&#22312;&#25968;&#25454;&#31185;&#23398;&#20013;&#30340;&#31526;&#21495;&#22270;
&lt;/p&gt;
&lt;p&gt;
Signed graphs in data sciences via communicability geometry
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07493
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#31526;&#21495;&#22270;&#30340;&#21487;&#36890;&#20449;&#24615;&#20960;&#20309;&#27010;&#24565;&#65292;&#35777;&#26126;&#20102;&#20854;&#24230;&#37327;&#26159;&#27431;&#20960;&#37324;&#24503;&#30340;&#21644;&#29699;&#24418;&#30340;&#65292;&#28982;&#21518;&#24212;&#29992;&#20110;&#35299;&#20915;&#31526;&#21495;&#22270;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#22810;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31526;&#21495;&#22270;&#26159;&#34920;&#31034;&#22810;&#31181;&#23384;&#22312;&#20914;&#31361;&#20132;&#20114;&#30340;&#25968;&#25454;&#30340;&#26032;&#20852;&#26041;&#24335;&#65292;&#21253;&#25324;&#26469;&#33258;&#29983;&#29289;&#23398;&#12289;&#29983;&#24577;&#23398;&#21644;&#31038;&#20250;&#31995;&#32479;&#30340;&#25968;&#25454;&#12290;&#25105;&#20204;&#22312;&#36825;&#37324;&#25552;&#20986;&#20102;&#31526;&#21495;&#22270;&#30340;&#21487;&#36890;&#20449;&#24615;&#20960;&#20309;&#27010;&#24565;&#65292;&#35777;&#26126;&#20102;&#22312;&#36825;&#20010;&#31354;&#38388;&#20013;&#30340;&#24230;&#37327;&#65292;&#27604;&#22914;&#21487;&#36890;&#20449;&#24615;&#36317;&#31163;&#21644;&#35282;&#24230;&#65292;&#26159;&#27431;&#20960;&#37324;&#24503;&#30340;&#21644;&#29699;&#24418;&#30340;&#12290;&#28982;&#21518;&#25105;&#20204;&#23558;&#36825;&#20123;&#24230;&#37327;&#24212;&#29992;&#20110;&#20197;&#32479;&#19968;&#26041;&#24335;&#35299;&#20915;&#31526;&#21495;&#22270;&#25968;&#25454;&#20998;&#26512;&#20013;&#30340;&#20960;&#20010;&#38382;&#39064;&#65292;&#21253;&#25324;&#31526;&#21495;&#22270;&#30340;&#20998;&#21306;&#12289;&#32500;&#24230;&#32422;&#31616;&#12289;&#25214;&#21040;&#31526;&#21495;&#32593;&#32476;&#20013;&#30340;&#32852;&#30431;&#31561;&#32423;&#20197;&#21450;&#37327;&#21270;&#31995;&#32479;&#20013;&#29616;&#26377;&#27966;&#31995;&#20043;&#38388;&#26497;&#21270;&#31243;&#24230;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07493v1 Announce Type: cross  Abstract: Signed graphs are an emergent way of representing data in a variety of contexts were conflicting interactions exist. These include data from biological, ecological, and social systems. Here we propose the concept of communicability geometry for signed graphs, proving that metrics in this space, such as the communicability distance and angles, are Euclidean and spherical. We then apply these metrics to solve several problems in data analysis of signed graphs in a unified way. They include the partitioning of signed graphs, dimensionality reduction, finding hierarchies of alliances in signed networks as well as the quantification of the degree of polarization between the existing factions in systems represented by this type of graphs.
&lt;/p&gt;</description></item></channel></rss>