<rss version="2.0"><channel><title>Chat Arxiv physics.data-an</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.data-an</description><item><title>&#22522;&#20110;&#29289;&#29702;&#25968;&#25454;&#21644;&#21464;&#21387;&#22120;&#26550;&#26500;&#65292;OmniJet-$\alpha$&#26159;&#39318;&#20010;&#36328;&#20219;&#21153;&#22522;&#30784;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#20840;&#38754;&#30340;&#35780;&#20272;&#26041;&#27861;&#24182;&#23637;&#31034;&#20102;&#22312;&#26080;&#30417;&#30563;&#38382;&#39064;&#19978;&#30340;&#36801;&#31227;&#23398;&#20064;&#12290;</title><link>https://arxiv.org/abs/2403.05618</link><description>&lt;p&gt;
OmniJet-$\alpha$: &#31890;&#23376;&#29289;&#29702;&#23398;&#30340;&#39318;&#20010;&#36328;&#20219;&#21153;&#22522;&#30784;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
OmniJet-$\alpha$: The first cross-task foundation model for particle physics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05618
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#29289;&#29702;&#25968;&#25454;&#21644;&#21464;&#21387;&#22120;&#26550;&#26500;&#65292;OmniJet-$\alpha$&#26159;&#39318;&#20010;&#36328;&#20219;&#21153;&#22522;&#30784;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#20840;&#38754;&#30340;&#35780;&#20272;&#26041;&#27861;&#24182;&#23637;&#31034;&#20102;&#22312;&#26080;&#30417;&#30563;&#38382;&#39064;&#19978;&#30340;&#36801;&#31227;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#30784;&#27169;&#22411;&#26159;&#22810;&#25968;&#25454;&#38598;&#21644;&#22810;&#20219;&#21153;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#19968;&#32463;&#39044;&#35757;&#32451;&#65292;&#20415;&#21487;&#34987;&#24494;&#35843;&#29992;&#20110;&#21508;&#31181;&#19981;&#21516;&#30340;&#24212;&#29992;&#12290;&#25104;&#21151;&#24320;&#21457;&#20986;&#36825;&#31181;&#36890;&#29992;&#29289;&#29702;&#25968;&#25454;&#27169;&#22411;&#23558;&#26159;&#19968;&#39033;&#37325;&#22823;&#31361;&#30772;&#65292;&#22240;&#20026;&#23427;&#20204;&#21487;&#20197;&#25552;&#39640;&#21487;&#23454;&#29616;&#30340;&#29289;&#29702;&#24615;&#33021;&#65292;&#21516;&#26102;&#22823;&#24133;&#20943;&#23569;&#25152;&#38656;&#30340;&#35757;&#32451;&#26102;&#38388;&#21644;&#25968;&#25454;&#37327;&#12290;&#25105;&#20204;&#22312;&#36825;&#19968;&#25361;&#25112;&#19978;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#12290;&#39318;&#20808;&#65292;&#24341;&#20837;&#20102;&#19968;&#22871;&#20840;&#38754;&#30340;&#35780;&#20272;&#26041;&#27861;&#65292;&#26469;&#35780;&#21028;&#20174;&#29289;&#29702;&#25968;&#25454;&#36716;&#25442;&#20026;&#36866;&#21512;&#21464;&#21387;&#22120;&#26550;&#26500;&#65288;&#22522;&#30784;&#27169;&#22411;&#30340;&#36890;&#29992;&#39592;&#24178;&#65289;&#36827;&#34892;&#33258;&#22238;&#24402;&#29983;&#25104;&#31890;&#23376;&#21943;&#27969;&#30340;&#34920;&#31034;&#36136;&#37327;&#12290;&#36825;&#20123;&#25514;&#26045;&#25903;&#25345;&#20102;&#30456;&#36739;&#20110;&#20808;&#21069;&#24037;&#20316;&#30340;&#26356;&#39640;&#20445;&#30495;&#24230;&#30340;&#26631;&#35760;&#21270;&#30340;&#36873;&#25321;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#26080;&#30417;&#30563;&#38382;&#39064;&#65288;&#21943;&#27969;&#29983;&#25104;&#65289;&#20043;&#38388;&#30340;&#36801;&#31227;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05618v1 Announce Type: cross  Abstract: Foundation models are multi-dataset and multi-task machine learning methods that once pre-trained can be fine-tuned for a large variety of downstream applications. The successful development of such general-purpose models for physics data would be a major breakthrough as they could improve the achievable physics performance while at the same time drastically reduce the required amount of training time and data.   We report significant progress on this challenge on several fronts. First, a comprehensive set of evaluation methods is introduced to judge the quality of an encoding from physics data into a representation suitable for the autoregressive generation of particle jets with transformer architectures (the common backbone of foundation models). These measures motivate the choice of a higher-fidelity tokenization compared to previous works. Finally, we demonstrate transfer learning between an unsupervised problem (jet generation) an
&lt;/p&gt;</description></item></channel></rss>