<rss version="2.0"><channel><title>Chat Arxiv physics.soc-ph</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for physics.soc-ph</description><item><title>&#26412;&#30740;&#31350;&#23545;&#31918;&#27833;&#25351;&#25968;&#21450;&#20854;&#20116;&#20010;&#23376;&#25351;&#25968;&#36827;&#34892;&#20102;&#21487;&#35265;&#24615;&#22270;&#20998;&#26512;&#65292;&#20845;&#20010;&#21487;&#35265;&#24615;&#22270;&#37117;&#34920;&#29616;&#20986;&#24130;&#24459;&#20998;&#24067;&#30340;&#24230;&#20998;&#24067;&#21644;&#23567;&#19990;&#30028;&#29305;&#24449;&#12290;&#29577;&#31859;&#21644;&#22823;&#35910;&#25351;&#25968;&#30340;&#21487;&#35265;&#24615;&#22270;&#34920;&#29616;&#20986;&#36739;&#24369;&#30340;&#21516;&#37197;&#28151;&#21512;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2304.05760</link><description>&lt;p&gt;
&#31918;&#27833;&#25351;&#25968;&#30340;&#21487;&#35265;&#24615;&#22270;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Visibility graph analysis of the grains and oilseeds indices. (arXiv:2304.05760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#31918;&#27833;&#25351;&#25968;&#21450;&#20854;&#20116;&#20010;&#23376;&#25351;&#25968;&#36827;&#34892;&#20102;&#21487;&#35265;&#24615;&#22270;&#20998;&#26512;&#65292;&#20845;&#20010;&#21487;&#35265;&#24615;&#22270;&#37117;&#34920;&#29616;&#20986;&#24130;&#24459;&#20998;&#24067;&#30340;&#24230;&#20998;&#24067;&#21644;&#23567;&#19990;&#30028;&#29305;&#24449;&#12290;&#29577;&#31859;&#21644;&#22823;&#35910;&#25351;&#25968;&#30340;&#21487;&#35265;&#24615;&#22270;&#34920;&#29616;&#20986;&#36739;&#24369;&#30340;&#21516;&#37197;&#28151;&#21512;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31918;&#27833;&#25351;&#25968;&#65288;GOI&#65289;&#21450;&#20854;&#23567;&#40614;&#12289;&#29577;&#31859;&#12289;&#22823;&#35910;&#12289;&#31291;&#31859;&#21644;&#22823;&#40614;&#31561;&#20116;&#20010;&#23376;&#25351;&#25968;&#26159;&#27599;&#26085;&#20215;&#26684;&#25351;&#25968;&#65292;&#21453;&#26144;&#20102;&#20840;&#29699;&#20027;&#35201;&#20892;&#20135;&#21697;&#29616;&#36135;&#24066;&#22330;&#20215;&#26684;&#30340;&#21464;&#21270;&#12290;&#26412;&#25991;&#23545;GOI&#21450;&#20854;&#20116;&#20010;&#23376;&#25351;&#25968;&#36827;&#34892;&#20102;&#21487;&#35265;&#24615;&#22270;&#65288;VG&#65289;&#20998;&#26512;&#12290;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#34920;&#26126;&#65292;VG&#30340;&#24230;&#20998;&#24067;&#37117;&#26174;&#31034;&#20986;&#24130;&#24459;&#23614;&#24052;&#65292;&#38500;&#20102;&#31291;&#31859;&#12290;&#20845;&#20010;VG&#30340;&#24179;&#22343;&#32858;&#31867;&#31995;&#25968;&#37117;&#24456;&#22823;&#65288;&gt;0.5&#65289;&#65292;&#24182;&#19982;VG&#30340;&#24179;&#22343;&#24230;&#25968;&#23637;&#29616;&#20102;&#33391;&#22909;&#30340;&#24130;&#24459;&#20851;&#31995;&#12290;&#23545;&#20110;&#27599;&#20010;VG&#65292;&#33410;&#28857;&#30340;&#32858;&#31867;&#31995;&#25968;&#22312;&#22823;&#24230;&#25968;&#26102;&#19982;&#20854;&#24230;&#25968;&#25104;&#21453;&#27604;&#65292;&#22312;&#23567;&#24230;&#25968;&#26102;&#19982;&#20854;&#24230;&#25968;&#25104;&#24130;&#24459;&#30456;&#20851;&#12290;&#25152;&#26377;&#20845;&#20010;VG&#37117;&#34920;&#29616;&#20986;&#23567;&#19990;&#30028;&#29305;&#24449;&#65292;&#20294;&#31243;&#24230;&#19981;&#21516;&#12290;&#24230;-&#24230;&#30456;&#20851;&#31995;&#25968;&#34920;&#26126;&#65292;&#29577;&#31859;&#21644;&#22823;&#35910;&#25351;&#25968;&#30340;VG&#34920;&#29616;&#20986;&#36739;&#24369;&#30340;&#21516;&#37197;&#28151;&#21512;&#27169;&#24335;&#65292;&#32780;&#20854;&#20182;&#22235;&#20010;VG&#30340;&#21516;&#37197;&#28151;&#21512;&#27169;&#24335;&#36739;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Grains and Oilseeds Index (GOI) and its sub-indices of wheat, maize, soyabeans, rice, and barley are daily price indexes reflect the price changes of the global spot markets of staple agro-food crops. In this paper, we carry out a visibility graph (VG) analysis of the GOI and its five sub-indices. Maximum likelihood estimation shows that the degree distributions of the VGs display power-law tails, except for rice. The average clustering coefficients of the six VGs are quite large (&gt;0.5) and exhibit a nice power-law relation with respect to the average degrees of the VGs. For each VG, the clustering coefficients of nodes are inversely proportional to their degrees for large degrees and are correlated to their degrees as a power law for small degrees. All the six VGs exhibit small-world characteristics to some extent. The degree-degree correlation coefficients shows that the VGs for maize and soyabeans indices exhibit weak assortative mixing patterns, while the other four VGs are wea
&lt;/p&gt;</description></item></channel></rss>