<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#36827;&#34892;&#20102;&#25968;&#23383;&#30149;&#29702;&#22270;&#20687;&#20013;&#24212;&#29992;&#20154;&#24037;&#26234;&#33021;&#30340;&#25152;&#26377;&#30149;&#29702;&#23398;&#39046;&#22495;&#30340;&#35786;&#26029;&#20934;&#30830;&#24230;&#30340;&#31995;&#32479;&#32508;&#36848;&#21644;Meta&#20998;&#26512;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20154;&#24037;&#26234;&#33021;&#22312;&#25968;&#23383;&#30149;&#29702;&#23398;&#20013;&#21462;&#24471;&#20102;&#39640;&#24230;&#30340;&#20934;&#30830;&#24230;&#65292;&#26159;&#21487;&#34892;&#30340;&#36741;&#21161;&#35786;&#26029;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2306.07999</link><description>&lt;p&gt;
&#25968;&#23383;&#30149;&#29702;&#23398;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#35786;&#26029;&#27979;&#35797;&#20934;&#30830;&#24230;&#65306;&#31995;&#32479;&#32508;&#36848;&#12289;Meta&#20998;&#26512;&#21644;&#36136;&#37327;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Diagnostic test accuracy (DTA) of artificial intelligence in digital pathology: a systematic review, meta-analysis and quality assessment. (arXiv:2306.07999v1 [physics.med-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07999
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36827;&#34892;&#20102;&#25968;&#23383;&#30149;&#29702;&#22270;&#20687;&#20013;&#24212;&#29992;&#20154;&#24037;&#26234;&#33021;&#30340;&#25152;&#26377;&#30149;&#29702;&#23398;&#39046;&#22495;&#30340;&#35786;&#26029;&#20934;&#30830;&#24230;&#30340;&#31995;&#32479;&#32508;&#36848;&#21644;Meta&#20998;&#26512;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20154;&#24037;&#26234;&#33021;&#22312;&#25968;&#23383;&#30149;&#29702;&#23398;&#20013;&#21462;&#24471;&#20102;&#39640;&#24230;&#30340;&#20934;&#30830;&#24230;&#65292;&#26159;&#21487;&#34892;&#30340;&#36741;&#21161;&#35786;&#26029;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30830;&#20445;&#20020;&#24202;&#20351;&#29992;&#20043;&#21069;AI&#27169;&#22411;&#30340;&#35786;&#26029;&#34920;&#29616;&#26159;&#20851;&#38190;&#65292;&#20197;&#30830;&#20445;&#36825;&#20123;&#25216;&#26415;&#30340;&#23433;&#20840;&#21644;&#25104;&#21151;&#30340;&#37319;&#29992;&#12290;&#36817;&#24180;&#26469;&#65292;&#25253;&#36947;&#24212;&#29992;&#20110;&#25968;&#23383;&#30149;&#29702;&#23398;&#22270;&#20687;&#36827;&#34892;&#35786;&#26029;&#30446;&#30340;&#30340;AI&#30740;&#31350;&#25968;&#37327;&#36805;&#36895;&#22686;&#21152;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#25552;&#20379;&#25968;&#23383;&#30149;&#29702;&#23398;&#20013;AI&#30340;&#35786;&#26029;&#20934;&#30830;&#24230;&#30340;&#27010;&#36848;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#30149;&#29702;&#23398;&#39046;&#22495;&#12290;&#36825;&#39033;&#31995;&#32479;&#24615;&#32508;&#36848;&#21644;Meta&#20998;&#26512;&#21253;&#25324;&#20351;&#29992;&#20219;&#20309;&#31867;&#22411;&#30340;&#20154;&#24037;&#26234;&#33021;&#24212;&#29992;&#20110;&#20219;&#20309;&#30142;&#30149;&#31867;&#22411;&#30340;WSI&#22270;&#20687;&#30340;&#35786;&#26029;&#20934;&#30830;&#24615;&#30740;&#31350;&#12290;&#21442;&#32771;&#26631;&#20934;&#26159;&#36890;&#36807;&#32452;&#32455;&#30149;&#29702;&#23398;&#35780;&#20272;&#21644;/&#25110;&#20813;&#30123;&#32452;&#21270;&#35786;&#26029;&#12290;&#25628;&#32034;&#22312;2022&#24180;6&#26376;&#22312;PubMed&#12289;EMBASE&#21644;CENTRAL&#20013;&#36827;&#34892;&#12290;&#22312;2976&#39033;&#30740;&#31350;&#20013;&#65292;&#26377;100&#39033;&#32435;&#20837;&#32508;&#36848;&#65292;48&#39033;&#32435;&#20837;&#23436;&#25972;&#30340;Meta&#20998;&#26512;&#12290;&#20351;&#29992;QUADAS-2&#24037;&#20855;&#35780;&#20272;&#20102;&#20559;&#20506;&#39118;&#38505;&#21644;&#36866;&#29992;&#24615;&#30340;&#20851;&#27880;&#28857;&#12290;&#25968;&#25454;&#25552;&#21462;&#30001;&#20004;&#20010;&#35843;&#26597;&#21592;&#36827;&#34892;&#65292;&#24182;&#36827;&#34892;&#20102;Meta&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ensuring diagnostic performance of AI models before clinical use is key to the safe and successful adoption of these technologies. Studies reporting AI applied to digital pathology images for diagnostic purposes have rapidly increased in number in recent years. The aim of this work is to provide an overview of the diagnostic accuracy of AI in digital pathology images from all areas of pathology. This systematic review and meta-analysis included diagnostic accuracy studies using any type of artificial intelligence applied to whole slide images (WSIs) in any disease type. The reference standard was diagnosis through histopathological assessment and / or immunohistochemistry. Searches were conducted in PubMed, EMBASE and CENTRAL in June 2022. We identified 2976 studies, of which 100 were included in the review and 48 in the full meta-analysis. Risk of bias and concerns of applicability were assessed using the QUADAS-2 tool. Data extraction was conducted by two investigators and meta-analy
&lt;/p&gt;</description></item></channel></rss>