<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#35813;&#30740;&#31350;&#20351;&#29992;&#23567;&#27874;&#20998;&#26512;&#25216;&#26415;&#23545;&#38750;&#20405;&#20837;&#24615;&#33041;&#30005;&#22270;&#20449;&#21495;&#36827;&#34892;&#35299;&#30721;&#65292;&#25104;&#21151;&#21306;&#20998;&#22797;&#26434;&#21644;&#33258;&#28982;&#30340;&#25235;&#25569;&#31867;&#22411;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#23567;&#27874;&#29305;&#24449;&#22312;&#22522;&#20110;&#33041;&#30005;&#22270;&#30340;&#25235;&#25569;&#21306;&#20998;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09447</link><description>&lt;p&gt;
&#38750;&#20405;&#20837;&#24615;&#33041;&#30005;&#22270;&#20449;&#21495;&#30340;&#23567;&#27874;&#20998;&#26512;&#21306;&#20998;&#22797;&#26434;&#21644;&#33258;&#28982;&#30340;&#25235;&#25569;&#31867;&#22411;
&lt;/p&gt;
&lt;p&gt;
Wavelet Analysis of Noninvasive EEG Signals Discriminates Complex and Natural Grasp Types
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09447
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20351;&#29992;&#23567;&#27874;&#20998;&#26512;&#25216;&#26415;&#23545;&#38750;&#20405;&#20837;&#24615;&#33041;&#30005;&#22270;&#20449;&#21495;&#36827;&#34892;&#35299;&#30721;&#65292;&#25104;&#21151;&#21306;&#20998;&#22797;&#26434;&#21644;&#33258;&#28982;&#30340;&#25235;&#25569;&#31867;&#22411;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#23567;&#27874;&#29305;&#24449;&#22312;&#22522;&#20110;&#33041;&#30005;&#22270;&#30340;&#25235;&#25569;&#21306;&#20998;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26088;&#22312;&#36890;&#36807;&#23545;&#33041;&#30005;&#22270;&#65288;EEG&#65289;&#20449;&#21495;&#36827;&#34892;&#35299;&#30721;&#65292;&#20026;&#28789;&#24039;&#30340;&#31070;&#32463;&#20551;&#32930;&#24320;&#21457;&#21644;&#33041;&#26426;&#25509;&#21475;&#65288;BCI&#65289;&#24212;&#29992;&#26469;&#21306;&#20998;&#25163;&#37096;&#25235;&#25569;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#36816;&#21160;&#38556;&#30861;&#24739;&#32773;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23427;&#19987;&#27880;&#20110;&#20351;&#29992;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;&#33041;&#30005;&#22270;&#30340;BCI&#24179;&#21488;&#21644;&#23567;&#27874;&#20449;&#21495;&#22788;&#29702;&#65292;&#21306;&#20998;&#20004;&#31181;&#22797;&#26434;&#30340;&#33258;&#28982;&#21147;&#37327;&#21644;&#31934;&#30830;&#25235;&#25569;&#31867;&#22411;&#20197;&#21450;&#19968;&#31181;&#20013;&#31435;&#26465;&#20214;&#20316;&#20026;&#26080;&#36816;&#21160;&#26465;&#20214;&#12290;&#23567;&#27874;&#20998;&#26512;&#28041;&#21450;&#20174;&#23567;&#27874;&#33021;&#37327;&#31995;&#25968;&#29983;&#25104;&#26102;&#38388;&#39057;&#29575;&#21644;&#25299;&#25169;&#22270;&#12290;&#28982;&#21518;&#65292;&#36890;&#36807;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#21644;&#26032;&#22411;&#23567;&#27874;&#29305;&#24449;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#39640;&#24179;&#22343;&#20934;&#30830;&#29575;&#65306;&#22810;&#31867;&#21035;&#20026;85.16%&#65292;&#26080;&#36816;&#21160; vs &#21147;&#37327;&#20026;95.37%&#65292;&#26080;&#36816;&#21160; vs &#31934;&#30830;&#20026;95.40%&#65292;&#21147;&#37327; vs &#31934;&#30830;&#20026;88.07%&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#29305;&#24449;&#22312;&#22522;&#20110;&#33041;&#30005;&#22270;&#30340;&#25235;&#25569;&#21306;&#20998;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#19982;&#20808;&#21069;&#30340;&#30740;&#31350;&#19981;&#21516;&#65292;&#25105;&#20204;&#30740;&#31350;&#30340;&#20851;&#38190;&#37096;&#20998;&#26159;&#25490;&#21015;&#29305;&#24449;&#37325;&#35201;&#24615;&#30340;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09447v1 Announce Type: cross  Abstract: This research aims to decode hand grasps from Electroencephalograms (EEGs) for dexterous neuroprosthetic development and Brain-Computer Interface (BCI) applications, especially for patients with motor disorders. Particularly, it focuses on distinguishing two complex natural power and precision grasps in addition to a neutral condition as a no-movement condition using a new EEG-based BCI platform and wavelet signal processing. Wavelet analysis involved generating time-frequency and topographic maps from wavelet power coefficients. Then, by using machine learning techniques with novel wavelet features, we achieved high average accuracies: 85.16% for multiclass, 95.37% for No-Movement vs Power, 95.40% for No-Movement vs Precision, and 88.07% for Power vs Precision, demonstrating the effectiveness of these features in EEG-based grasp differentiation. In contrast to previous studies, a critical part of our study was permutation feature impo
&lt;/p&gt;</description></item></channel></rss>