<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>RiNALMo&#26159;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#30340;RNA&#35821;&#35328;&#27169;&#22411;&#65292;&#20855;&#26377;650&#20159;&#20010;&#21442;&#25968;&#65292;&#33021;&#22815;&#22312;&#22810;&#20010;&#19979;&#28216;&#20219;&#21153;&#19978;&#21462;&#24471;&#26368;&#20808;&#36827;&#32467;&#26524;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#27867;&#21270;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.00043</link><description>&lt;p&gt;
RiNALMo: &#36890;&#29992;RNA&#35821;&#35328;&#27169;&#22411;&#22312;&#32467;&#26500;&#39044;&#27979;&#20219;&#21153;&#19978;&#20855;&#26377;&#33391;&#22909;&#30340;&#27867;&#21270;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
RiNALMo: General-Purpose RNA Language Models Can Generalize Well on Structure Prediction Tasks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00043
&lt;/p&gt;
&lt;p&gt;
RiNALMo&#26159;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#30340;RNA&#35821;&#35328;&#27169;&#22411;&#65292;&#20855;&#26377;650&#20159;&#20010;&#21442;&#25968;&#65292;&#33021;&#22815;&#22312;&#22810;&#20010;&#19979;&#28216;&#20219;&#21153;&#19978;&#21462;&#24471;&#26368;&#20808;&#36827;&#32467;&#26524;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00043v1 &#36890;&#21578;&#31867;&#22411;: &#36328;&#39046;&#22495; &#25688;&#35201;: &#26680;&#31958;&#26680;&#37240;&#65288;RNA&#65289;&#22312;&#22522;&#30784;&#29983;&#29289;&#36807;&#31243;&#20013;&#25198;&#28436;&#30528;&#21508;&#31181;&#33267;&#20851;&#37325;&#35201;&#30340;&#35282;&#33394;&#12290;&#26368;&#36817;&#65292;RNA&#24050;&#25104;&#20026;&#19968;&#20010;&#26377;&#36259;&#30340;&#33647;&#29289;&#38774;&#28857;&#65292;&#24378;&#35843;&#20102;&#25552;&#39640;&#25105;&#20204;&#23545;&#20854;&#32467;&#26500;&#21644;&#21151;&#33021;&#30340;&#29702;&#35299;&#30340;&#24517;&#35201;&#24615;&#12290;&#22810;&#24180;&#26469;&#65292;&#27979;&#24207;&#25216;&#26415;&#24050;&#20135;&#29983;&#20102;&#22823;&#37327;&#26410;&#26631;&#35760;&#30340;RNA&#25968;&#25454;&#65292;&#20854;&#20013;&#38544;&#34255;&#30528;&#37325;&#35201;&#30340;&#30693;&#35782;&#21644;&#28508;&#21147;&#12290;&#21463;&#34507;&#30333;&#36136;&#35821;&#35328;&#27169;&#22411;&#25104;&#21151;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#26680;&#31958;&#26680;&#37240;&#35821;&#35328;&#27169;&#22411;&#65288;RiNALMo&#65289;&#20197;&#24110;&#21161;&#25581;&#31034;RNA&#30340;&#38544;&#34255;&#23494;&#30721;&#12290;RiNALMo&#26159;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#30340;RNA&#35821;&#35328;&#27169;&#22411;&#65292;&#20855;&#26377;650&#20159;&#20010;&#21442;&#25968;&#65292;&#39044;&#20808;&#35757;&#32451;&#20102;&#26469;&#33258;&#20960;&#20010;&#21487;&#29992;&#25968;&#25454;&#24211;&#30340;3600&#19975;&#20010;&#38750;&#32534;&#30721;RNA&#24207;&#21015;&#12290;RiNALMo&#33021;&#22815;&#25552;&#21462;&#38544;&#34255;&#30693;&#35782;&#24182;&#38544;&#21547;&#22320;&#25429;&#25417;RNA&#24207;&#21015;&#20013;&#20869;&#23884;&#30340;&#22522;&#26412;&#32467;&#26500;&#20449;&#24687;&#12290;RiNALMo&#22312;&#22810;&#20010;&#19979;&#28216;&#20219;&#21153;&#19978;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#32467;&#26524;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20854;&#27867;&#21270;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00043v1 Announce Type: cross  Abstract: Ribonucleic acid (RNA) plays a variety of crucial roles in fundamental biological processes. Recently, RNA has become an interesting drug target, emphasizing the need to improve our understanding of its structures and functions. Over the years, sequencing technologies have produced an enormous amount of unlabeled RNA data, which hides important knowledge and potential. Motivated by the successes of protein language models, we introduce RiboNucleic Acid Language Model (RiNALMo) to help unveil the hidden code of RNA. RiNALMo is the largest RNA language model to date with $650$ million parameters pre-trained on $36$ million non-coding RNA sequences from several available databases. RiNALMo is able to extract hidden knowledge and capture the underlying structure information implicitly embedded within the RNA sequences. RiNALMo achieves state-of-the-art results on several downstream tasks. Notably, we show that its generalization capabiliti
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38750;&#24179;&#34913;&#29289;&#29702;&#23398;&#30340;&#35757;&#32451;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20351;&#29992;&#33021;&#37327;&#27169;&#22411;&#29983;&#25104;&#39640;&#36136;&#37327;&#32467;&#26500;&#21270;&#25968;&#25454;&#30340;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#25913;&#21892;&#27169;&#22411;&#30340;&#20998;&#31867;&#33021;&#21147;&#21644;&#29983;&#25104;&#36895;&#24230;&#65292;&#22312;&#22810;&#20010;&#39046;&#22495;&#21462;&#24471;&#20102;&#25104;&#21151;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2307.06797</link><description>&lt;p&gt;
&#22522;&#20110;&#38750;&#24179;&#34913;&#29289;&#29702;&#23398;&#30340;&#24555;&#36895;&#19988;&#21151;&#33021;&#24615;&#32467;&#26500;&#21270;&#25968;&#25454;&#29983;&#25104;&#22120;
&lt;/p&gt;
&lt;p&gt;
Fast and Functional Structured Data Generators Rooted in Out-of-Equilibrium Physics. (arXiv:2307.06797v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06797
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38750;&#24179;&#34913;&#29289;&#29702;&#23398;&#30340;&#35757;&#32451;&#31639;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20351;&#29992;&#33021;&#37327;&#27169;&#22411;&#29983;&#25104;&#39640;&#36136;&#37327;&#32467;&#26500;&#21270;&#25968;&#25454;&#30340;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#25913;&#21892;&#27169;&#22411;&#30340;&#20998;&#31867;&#33021;&#21147;&#21644;&#29983;&#25104;&#36895;&#24230;&#65292;&#22312;&#22810;&#20010;&#39046;&#22495;&#21462;&#24471;&#20102;&#25104;&#21151;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#20351;&#29992;&#22522;&#20110;&#33021;&#37327;&#30340;&#27169;&#22411;&#22312;&#22797;&#26434;&#32467;&#26500;&#21270;&#25968;&#25454;&#38598;&#65288;&#22914;&#20154;&#21475;&#22522;&#22240;&#32452;&#23398;&#12289;RNA&#25110;&#34507;&#30333;&#36136;&#24207;&#21015;&#25968;&#25454;&#65289;&#20013;&#29983;&#25104;&#39640;&#36136;&#37327;&#12289;&#26631;&#31614;&#29305;&#23450;&#25968;&#25454;&#30340;&#25361;&#25112;&#12290;&#20256;&#32479;&#30340;&#35757;&#32451;&#26041;&#27861;&#30001;&#20110;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#27931;&#28151;&#21512;&#25928;&#29575;&#20302;&#19979;&#32780;&#36935;&#21040;&#22256;&#38590;&#65292;&#36825;&#24433;&#21709;&#20102;&#21512;&#25104;&#25968;&#25454;&#30340;&#22810;&#26679;&#24615;&#24182;&#22686;&#21152;&#20102;&#29983;&#25104;&#26102;&#38388;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#31181;&#21033;&#29992;&#38750;&#24179;&#34913;&#25928;&#24212;&#30340;&#26032;&#22411;&#35757;&#32451;&#31639;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#24212;&#29992;&#20110;&#21463;&#38480;&#29627;&#23572;&#20857;&#26364;&#26426;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#23545;&#26679;&#26412;&#30340;&#27491;&#30830;&#20998;&#31867;&#33021;&#21147;&#65292;&#24182;&#21482;&#38656;&#23569;&#25968;&#20960;&#20010;&#37319;&#26679;&#27493;&#39588;&#21363;&#21487;&#29983;&#25104;&#39640;&#36136;&#37327;&#30340;&#21512;&#25104;&#25968;&#25454;&#12290;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#36890;&#36807;&#20854;&#25104;&#21151;&#24212;&#29992;&#20110;&#22235;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#24471;&#21040;&#35777;&#26126;&#65306;&#25163;&#20889;&#25968;&#23383;&#65292;&#25353;&#22823;&#38470;&#36215;&#28304;&#20998;&#31867;&#30340;&#20154;&#31867;&#22522;&#22240;&#32452;&#31361;&#21464;&#65292;&#37238;&#34507;&#30333;&#23478;&#26063;&#30340;&#21151;&#33021;&#24207;&#21015;&#65292;&#20197;&#21450;&#29305;&#23450;&#20998;&#31867;&#27861;&#30340;&#21516;&#28304;RNA&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this study, we address the challenge of using energy-based models to produce high-quality, label-specific data in complex structured datasets, such as population genetics, RNA or protein sequences data. Traditional training methods encounter difficulties due to inefficient Markov chain Monte Carlo mixing, which affects the diversity of synthetic data and increases generation times. To address these issues, we use a novel training algorithm that exploits non-equilibrium effects. This approach, applied on the Restricted Boltzmann Machine, improves the model's ability to correctly classify samples and generate high-quality synthetic data in only a few sampling steps. The effectiveness of this method is demonstrated by its successful application to four different types of data: handwritten digits, mutations of human genomes classified by continental origin, functionally characterized sequences of an enzyme protein family, and homologous RNA sequences from specific taxonomies.
&lt;/p&gt;</description></item></channel></rss>