<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#22240;&#32452;&#23398;&#25110;&#36716;&#24405;&#32452;&#25968;&#25454;&#19978;&#30340;&#32852;&#37030;&#23398;&#20064;&#65292;&#20351;&#29992; TensorFlow Federated &#21644; Flower &#26694;&#26550;&#36827;&#34892;&#23454;&#39564;&#65292;&#20197;&#22521;&#35757;&#30142;&#30149;&#39044;&#21518;&#21644;&#32454;&#32990;&#31867;&#22411;&#20998;&#31867;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2402.14527</link><description>&lt;p&gt;
&#22522;&#22240;&#32452;&#23398;&#25110;&#36716;&#24405;&#32452;&#25968;&#25454;&#19978;&#30340;&#32852;&#37030;&#23398;&#20064;&#65306;&#27169;&#22411;&#36136;&#37327;&#21644;&#24615;&#33021;&#26435;&#34913;
&lt;/p&gt;
&lt;p&gt;
Federated Learning on Transcriptomic Data: Model Quality and Performance Trade-Offs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14527
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#22240;&#32452;&#23398;&#25110;&#36716;&#24405;&#32452;&#25968;&#25454;&#19978;&#30340;&#32852;&#37030;&#23398;&#20064;&#65292;&#20351;&#29992; TensorFlow Federated &#21644; Flower &#26694;&#26550;&#36827;&#34892;&#23454;&#39564;&#65292;&#20197;&#22521;&#35757;&#30142;&#30149;&#39044;&#21518;&#21644;&#32454;&#32990;&#31867;&#22411;&#20998;&#31867;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#22522;&#22240;&#32452;&#23398;&#25110;&#36716;&#24405;&#32452;&#25968;&#25454;&#19978;&#36827;&#34892;&#26426;&#22120;&#23398;&#20064;&#23545;&#35768;&#22810;&#26032;&#39062;&#30340;&#20581;&#24247;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#12290;&#20363;&#22914;&#65292;&#31934;&#20934;&#21307;&#23398;&#21487;&#20197;&#26681;&#25454;&#20010;&#20307;&#29983;&#29289;&#26631;&#24535;&#29289;&#12289;&#32454;&#32990;&#21644;&#20998;&#23376;&#29366;&#24577;&#31561;&#20010;&#20307;&#20449;&#24687;&#26469;&#37327;&#36523;&#23450;&#21046;&#21307;&#23398;&#27835;&#30103;&#12290;&#28982;&#32780;&#65292;&#25152;&#38656;&#25968;&#25454;&#25935;&#24863;&#12289;&#24222;&#22823;&#12289;&#24322;&#36136;&#65292;&#24182;&#19988;&#36890;&#24120;&#20998;&#24067;&#22312;&#26080;&#27861;&#20351;&#29992;&#19987;&#38376;&#30340;&#26426;&#22120;&#23398;&#20064;&#30828;&#20214;&#30340;&#22320;&#28857;&#12290;&#30001;&#20110;&#38544;&#31169;&#21644;&#30417;&#31649;&#21407;&#22240;&#65292;&#22312;&#21487;&#20449;&#20219;&#30340;&#31532;&#19977;&#26041;&#22788;&#32858;&#21512;&#25152;&#26377;&#25968;&#25454;&#20063;&#23384;&#22312;&#38382;&#39064;&#12290;&#32852;&#37030;&#23398;&#20064;&#26159;&#36825;&#19968;&#22256;&#22659;&#30340;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#22240;&#20026;&#23427;&#23454;&#29616;&#20102;&#22312;&#19981;&#20132;&#25442;&#21407;&#22987;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#20998;&#25955;&#12289;&#21327;&#20316;&#30340;&#26426;&#22120;&#23398;&#20064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#32852;&#37030;&#23398;&#20064;&#26694;&#26550; TensorFlow Federated &#21644; Flower &#36827;&#34892;&#27604;&#36739;&#23454;&#39564;&#12290;&#25105;&#20204;&#30340;&#27979;&#35797;&#26696;&#20363;&#26159;&#22521;&#35757;&#30142;&#30149;&#39044;&#21518;&#21644;&#32454;&#32990;&#31867;&#22411;&#20998;&#31867;&#27169;&#22411;&#12290;&#25105;&#20204;&#20351;&#29992;&#20998;&#24067;&#24335;&#36716;&#24405;&#32452;&#23545;&#27169;&#22411;&#36827;&#34892;&#35757;&#32451;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14527v1 Announce Type: new  Abstract: Machine learning on large-scale genomic or transcriptomic data is important for many novel health applications. For example, precision medicine tailors medical treatments to patients on the basis of individual biomarkers, cellular and molecular states, etc. However, the data required is sensitive, voluminous, heterogeneous, and typically distributed across locations where dedicated machine learning hardware is not available. Due to privacy and regulatory reasons, it is also problematic to aggregate all data at a trusted third party.Federated learning is a promising solution to this dilemma, because it enables decentralized, collaborative machine learning without exchanging raw data. In this paper, we perform comparative experiments with the federated learning frameworks TensorFlow Federated and Flower. Our test case is the training of disease prognosis and cell type classification models. We train the models with distributed transcriptom
&lt;/p&gt;</description></item></channel></rss>