<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22810;&#27169;&#24577;&#39640;&#26031;&#36807;&#31243;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;GP-VAEs&#65289;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#25551;&#36848;&#31070;&#32463;&#21644;&#34892;&#20026;&#25968;&#25454;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#39640;&#26031;&#36807;&#31243;&#22240;&#23376;&#20998;&#26512;&#65288;GPFA&#65289;&#21644;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#33021;&#22815;&#25552;&#21462;&#19981;&#21516;&#23454;&#39564;&#27169;&#24577;&#30340;&#20849;&#20139;&#21644;&#29420;&#31435;&#28508;&#21464;&#37327;&#65292;&#24182;&#19988;&#20855;&#26377;&#35299;&#37322;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2310.03111</link><description>&lt;p&gt;
&#22810;&#27169;&#24577;&#39640;&#26031;&#36807;&#31243;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#29992;&#20110;&#31070;&#32463;&#21644;&#34892;&#20026;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Multi-modal Gaussian Process Variational Autoencoders for Neural and Behavioral Data. (arXiv:2310.03111v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03111
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22810;&#27169;&#24577;&#39640;&#26031;&#36807;&#31243;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;GP-VAEs&#65289;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#25551;&#36848;&#31070;&#32463;&#21644;&#34892;&#20026;&#25968;&#25454;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#39640;&#26031;&#36807;&#31243;&#22240;&#23376;&#20998;&#26512;&#65288;GPFA&#65289;&#21644;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#33021;&#22815;&#25552;&#21462;&#19981;&#21516;&#23454;&#39564;&#27169;&#24577;&#30340;&#20849;&#20139;&#21644;&#29420;&#31435;&#28508;&#21464;&#37327;&#65292;&#24182;&#19988;&#20855;&#26377;&#35299;&#37322;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25551;&#36848;&#31070;&#32463;&#32676;&#20307;&#27963;&#21160;&#21644;&#34892;&#20026;&#25968;&#25454;&#20043;&#38388;&#30340;&#20851;&#31995;&#26159;&#31070;&#32463;&#31185;&#23398;&#30340;&#26680;&#24515;&#30446;&#26631;&#12290;&#34429;&#28982;&#28508;&#22312;&#21464;&#37327;&#27169;&#22411;&#65288;LVMs&#65289;&#22312;&#25551;&#36848;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#23427;&#20204;&#36890;&#24120;&#21482;&#29992;&#20110;&#21333;&#19968;&#31867;&#22411;&#30340;&#25968;&#25454;&#65292;&#36825;&#20351;&#24471;&#38590;&#20197;&#35782;&#21035;&#19981;&#21516;&#23454;&#39564;&#25968;&#25454;&#27169;&#24577;&#20043;&#38388;&#30340;&#20849;&#20139;&#32467;&#26500;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#26080;&#30417;&#30563;&#30340;LVM&#26469;&#35299;&#20915;&#36825;&#20010;&#32570;&#28857;&#65292;&#35813;&#27169;&#22411;&#25552;&#21462;&#20102;&#19981;&#21516;&#12289;&#21516;&#26102;&#35760;&#24405;&#30340;&#23454;&#39564;&#27169;&#24577;&#30340;&#26102;&#38388;&#28436;&#21270;&#20849;&#20139;&#21644;&#29420;&#31435;&#28508;&#21464;&#37327;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;&#39640;&#26031;&#36807;&#31243;&#22240;&#23376;&#20998;&#26512;&#65288;GPFA&#65289;&#65292;&#19968;&#31181;&#35299;&#37322;&#24615;&#30340;&#29992;&#20110;&#31070;&#32463;&#23574;&#23792;&#25968;&#25454;&#30340;LVM&#65292;&#24182;&#20855;&#26377;&#26102;&#38388;&#24179;&#28369;&#28508;&#31354;&#38388;&#65292;&#19982;&#39640;&#26031;&#36807;&#31243;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;GP-VAEs&#65289;&#30456;&#32467;&#21512;&#26469;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;GP-VAEs&#21516;&#26679;&#20351;&#29992;&#39640;&#26031;&#20808;&#39564;&#26469;&#25551;&#36848;&#28508;&#31354;&#38388;&#20013;&#30340;&#30456;&#20851;&#24615;&#65292;&#20294;&#30001;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26144;&#23556;&#21040;&#35266;&#27979;&#20540;&#20855;&#26377;&#20016;&#23500;&#30340;&#34920;&#36798;&#33021;&#21147;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;&#28508;&#21464;&#37327;&#20998;&#21306;&#26469;&#23454;&#29616;&#27169;&#22411;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Characterizing the relationship between neural population activity and behavioral data is a central goal of neuroscience. While latent variable models (LVMs) are successful in describing high-dimensional time-series data, they are typically only designed for a single type of data, making it difficult to identify structure shared across different experimental data modalities. Here, we address this shortcoming by proposing an unsupervised LVM which extracts temporally evolving shared and independent latents for distinct, simultaneously recorded experimental modalities. We do this by combining Gaussian Process Factor Analysis (GPFA), an interpretable LVM for neural spiking data with temporally smooth latent space, with Gaussian Process Variational Autoencoders (GP-VAEs), which similarly use a GP prior to characterize correlations in a latent space, but admit rich expressivity due to a deep neural network mapping to observations. We achieve interpretability in our model by partitioning lat
&lt;/p&gt;</description></item></channel></rss>