<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#25552;&#20986;&#20102;3M-Diffusion&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#27169;&#24577;&#20998;&#23376;&#22270;&#29983;&#25104;&#26041;&#27861;&#65292;&#21487;&#20197;&#29983;&#25104;&#20855;&#26377;&#25152;&#38656;&#23646;&#24615;&#30340;&#22810;&#26679;&#21270;&#12289;&#29702;&#24819;&#24773;&#20917;&#19979;&#26159;&#26032;&#39062;&#30340;&#20998;&#23376;&#12290;</title><link>https://arxiv.org/abs/2403.07179</link><description>&lt;p&gt;
3M-Diffusion&#65306;&#29992;&#20110;&#25991;&#26412;&#24341;&#23548;&#29983;&#25104;&#20998;&#23376;&#22270;&#30340;&#28508;&#22312;&#22810;&#27169;&#24577;&#25193;&#25955;
&lt;/p&gt;
&lt;p&gt;
3M-Diffusion: Latent Multi-Modal Diffusion for Text-Guided Generation of Molecular Graphs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07179
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;3M-Diffusion&#65292;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#27169;&#24577;&#20998;&#23376;&#22270;&#29983;&#25104;&#26041;&#27861;&#65292;&#21487;&#20197;&#29983;&#25104;&#20855;&#26377;&#25152;&#38656;&#23646;&#24615;&#30340;&#22810;&#26679;&#21270;&#12289;&#29702;&#24819;&#24773;&#20917;&#19979;&#26159;&#26032;&#39062;&#30340;&#20998;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20855;&#26377;&#25152;&#38656;&#23646;&#24615;&#30340;&#20998;&#23376;&#26159;&#19968;&#39033;&#20851;&#38190;&#20219;&#21153;&#65292;&#22312;&#33647;&#29289;&#21457;&#29616;&#21644;&#26448;&#26009;&#35774;&#35745;&#20013;&#20855;&#26377;&#24191;&#27867;&#24212;&#29992;&#12290;&#21463;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26368;&#26032;&#36827;&#23637;&#30340;&#21551;&#21457;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#23545;&#20351;&#29992;&#20998;&#23376;&#30340;&#33258;&#28982;&#35821;&#35328;&#25551;&#36848;&#26469;&#29983;&#25104;&#20855;&#26377;&#25152;&#38656;&#23646;&#24615;&#30340;&#20998;&#23376;&#20135;&#29983;&#20102;&#20852;&#36259;&#12290;&#22823;&#22810;&#25968;&#29616;&#26377;&#26041;&#27861;&#20391;&#37325;&#20110;&#29983;&#25104;&#19982;&#25991;&#26412;&#25551;&#36848;&#31934;&#30830;&#21305;&#37197;&#30340;&#20998;&#23376;&#12290;&#28982;&#32780;&#65292;&#23454;&#38469;&#24212;&#29992;&#38656;&#35201;&#33021;&#22815;&#29983;&#25104;&#20855;&#26377;&#25152;&#38656;&#23646;&#24615;&#30340;&#22810;&#26679;&#21270;&#65292;&#29702;&#24819;&#24773;&#20917;&#19979;&#26159;&#26032;&#39062;&#30340;&#20998;&#23376;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#27169;&#24577;&#20998;&#23376;&#22270;&#29983;&#25104;&#26041;&#27861;3M-Diffusion&#65292;&#20197;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07179v1 Announce Type: cross  Abstract: Generating molecules with desired properties is a critical task with broad applications in drug discovery and materials design. Inspired by recent advances in large language models, there is a growing interest in using natural language descriptions of molecules to generate molecules with the desired properties. Most existing methods focus on generating molecules that precisely match the text description. However, practical applications call for methods that generate diverse, and ideally novel, molecules with the desired properties. We propose 3M-Diffusion, a novel multi-modal molecular graph generation method, to address this challenge. 3M-Diffusion first encodes molecular graphs into a graph latent space aligned with text descriptions. It then reconstructs the molecular structure and atomic attributes based on the given text descriptions using the molecule decoder. It then learns a probabilistic mapping from the text space to the late
&lt;/p&gt;</description></item><item><title>&#20511;&#21161;&#22810;&#26465;&#20214;&#25193;&#25955;&#24341;&#23548;&#30340;&#36870;&#20998;&#23376;&#35774;&#35745;&#27169;&#22411;&#22312;&#26448;&#26009;&#21644;&#33647;&#29289;&#21457;&#29616;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;&#36890;&#36807;&#24341;&#20837;Transformer-based&#21435;&#22122;&#27169;&#22411;&#21644;&#22270;&#20381;&#36182;&#30340;&#25193;&#25955;&#36807;&#31243;&#65292;&#35813;&#27169;&#22411;&#33021;&#22815;&#22312;&#22810;&#20010;&#26465;&#20214;&#32422;&#26463;&#19979;&#20934;&#30830;&#22320;&#29983;&#25104;&#32858;&#21512;&#29289;&#21644;&#23567;&#20998;&#23376;&#12290;</title><link>http://arxiv.org/abs/2401.13858</link><description>&lt;p&gt;
&#20511;&#21161;&#22810;&#26465;&#20214;&#25193;&#25955;&#24341;&#23548;&#30340;&#36870;&#20998;&#23376;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Inverse Molecular Design with Multi-Conditional Diffusion Guidance. (arXiv:2401.13858v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13858
&lt;/p&gt;
&lt;p&gt;
&#20511;&#21161;&#22810;&#26465;&#20214;&#25193;&#25955;&#24341;&#23548;&#30340;&#36870;&#20998;&#23376;&#35774;&#35745;&#27169;&#22411;&#22312;&#26448;&#26009;&#21644;&#33647;&#29289;&#21457;&#29616;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;&#36890;&#36807;&#24341;&#20837;Transformer-based&#21435;&#22122;&#27169;&#22411;&#21644;&#22270;&#20381;&#36182;&#30340;&#25193;&#25955;&#36807;&#31243;&#65292;&#35813;&#27169;&#22411;&#33021;&#22815;&#22312;&#22810;&#20010;&#26465;&#20214;&#32422;&#26463;&#19979;&#20934;&#30830;&#22320;&#29983;&#25104;&#32858;&#21512;&#29289;&#21644;&#23567;&#20998;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20511;&#21161;&#25193;&#25955;&#27169;&#22411;&#36827;&#34892;&#36870;&#20998;&#23376;&#35774;&#35745;&#22312;&#26448;&#26009;&#21644;&#33647;&#29289;&#21457;&#29616;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;&#34429;&#28982;&#22312;&#26080;&#26465;&#20214;&#20998;&#23376;&#29983;&#25104;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#23558;&#21512;&#25104;&#35780;&#20998;&#21644;&#27668;&#20307;&#28183;&#36879;&#24615;&#31561;&#22810;&#20010;&#23646;&#24615;&#20316;&#20026;&#26465;&#20214;&#32422;&#26463;&#38598;&#25104;&#21040;&#25193;&#25955;&#27169;&#22411;&#20013;&#20173;&#26410;&#34987;&#25506;&#32034;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#22810;&#26465;&#20214;&#25193;&#25955;&#24341;&#23548;&#12290;&#25152;&#25552;&#20986;&#30340;&#22522;&#20110;Transformer&#30340;&#21435;&#22122;&#27169;&#22411;&#20855;&#26377;&#19968;&#20010;&#26465;&#20214;&#32534;&#30721;&#22120;&#65292;&#35813;&#32534;&#30721;&#22120;&#23398;&#20064;&#20102;&#25968;&#20540;&#21644;&#20998;&#31867;&#26465;&#20214;&#30340;&#34920;&#31034;&#12290;&#32452;&#25104;&#32467;&#26500;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#30340;&#21435;&#22122;&#27169;&#22411;&#22312;&#26465;&#20214;&#34920;&#31034;&#19979;&#36827;&#34892;&#21435;&#22122;&#35757;&#32451;&#12290;&#25193;&#25955;&#36807;&#31243;&#21464;&#24471;&#20381;&#36182;&#20110;&#22270;&#26469;&#20934;&#30830;&#20272;&#35745;&#20998;&#23376;&#20013;&#19982;&#22270;&#30456;&#20851;&#30340;&#22122;&#22768;&#65292;&#32780;&#19981;&#20687;&#20197;&#21069;&#30340;&#27169;&#22411;&#20165;&#20851;&#27880;&#21407;&#23376;&#25110;&#38190;&#30340;&#36793;&#32536;&#20998;&#24067;&#12290;&#25105;&#20204;&#24191;&#27867;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22810;&#26465;&#20214;&#32858;&#21512;&#29289;&#21644;&#23567;&#20998;&#23376;&#29983;&#25104;&#26041;&#38754;&#30340;&#20248;&#36234;&#24615;&#12290;&#32467;&#26524;&#26174;&#31034;&#25105;&#20204;&#22312;&#20998;&#24067;&#24230;&#37327;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Inverse molecular design with diffusion models holds great potential for advancements in material and drug discovery. Despite success in unconditional molecule generation, integrating multiple properties such as synthetic score and gas permeability as condition constraints into diffusion models remains unexplored. We introduce multi-conditional diffusion guidance. The proposed Transformer-based denoising model has a condition encoder that learns the representations of numerical and categorical conditions. The denoising model, consisting of a structure encoder-decoder, is trained for denoising under the representation of conditions. The diffusion process becomes graph-dependent to accurately estimate graph-related noise in molecules, unlike the previous models that focus solely on the marginal distributions of atoms or bonds. We extensively validate our model for multi-conditional polymer and small molecule generation. Results demonstrate our superiority across metrics from distribution
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#34507;&#30333;&#36136;&#20316;&#20026;3D&#32593;&#26684;&#30340;&#34920;&#38754;&#34920;&#31034;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#21512;&#22270;&#34920;&#38754;&#30340;&#21327;&#21516;&#26041;&#27861;&#65292;&#26082;&#26377;&#31454;&#20105;&#20248;&#21183;&#65292;&#21448;&#26377;&#23454;&#38469;&#24212;&#29992;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.16519</link><description>&lt;p&gt;
AtomSurf&#65306;&#34507;&#30333;&#36136;&#32467;&#26500;&#19978;&#30340;&#23398;&#20064;&#30340;&#34920;&#38754;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
AtomSurf : Surface Representation for Learning on Protein Structures. (arXiv:2309.16519v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16519
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23558;&#34507;&#30333;&#36136;&#20316;&#20026;3D&#32593;&#26684;&#30340;&#34920;&#38754;&#34920;&#31034;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#21512;&#22270;&#34920;&#38754;&#30340;&#21327;&#21516;&#26041;&#27861;&#65292;&#26082;&#26377;&#31454;&#20105;&#20248;&#21183;&#65292;&#21448;&#26377;&#23454;&#38469;&#24212;&#29992;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#26399;Cryo-EM&#21644;&#34507;&#30333;&#36136;&#32467;&#26500;&#39044;&#27979;&#31639;&#27861;&#30340;&#36827;&#23637;&#20351;&#24471;&#22823;&#35268;&#27169;&#34507;&#30333;&#36136;&#32467;&#26500;&#21487;&#33719;&#24471;&#65292;&#20026;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#21151;&#33021;&#27880;&#37322;&#38138;&#24179;&#20102;&#36947;&#36335;&#12290;&#20960;&#20309;&#28145;&#24230;&#23398;&#20064;&#39046;&#22495;&#20851;&#27880;&#21019;&#24314;&#36866;&#29992;&#20110;&#20960;&#20309;&#25968;&#25454;&#30340;&#26041;&#27861;&#12290;&#20174;&#34507;&#30333;&#36136;&#32467;&#26500;&#20013;&#23398;&#20064;&#30340;&#19968;&#20010;&#37325;&#35201;&#26041;&#38754;&#26159;&#23558;&#36825;&#20123;&#32467;&#26500;&#34920;&#31034;&#20026;&#20960;&#20309;&#23545;&#35937;&#65288;&#22914;&#32593;&#26684;&#12289;&#22270;&#25110;&#34920;&#38754;&#65289;&#24182;&#24212;&#29992;&#36866;&#21512;&#36825;&#31181;&#34920;&#31034;&#24418;&#24335;&#30340;&#23398;&#20064;&#26041;&#27861;&#12290;&#32473;&#23450;&#26041;&#27861;&#30340;&#24615;&#33021;&#23558;&#21462;&#20915;&#20110;&#34920;&#31034;&#21644;&#30456;&#24212;&#30340;&#23398;&#20064;&#26041;&#27861;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#23558;&#34507;&#30333;&#36136;&#34920;&#31034;&#20026;$\textit{3D mesh surfaces}$&#24182;&#23558;&#20854;&#32435;&#20837;&#24050;&#24314;&#31435;&#30340;&#34920;&#31034;&#22522;&#20934;&#20013;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#21457;&#29616;&#26159;&#65292;&#23613;&#31649;&#26377;&#30528;&#26377;&#24076;&#26395;&#30340;&#21021;&#27493;&#32467;&#26524;&#65292;&#20294;&#20165;&#21333;&#29420;&#34920;&#38754;&#34920;&#31034;&#20284;&#20046;&#26080;&#27861;&#19982;3D&#32593;&#26684;&#31454;&#20105;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21327;&#21516;&#26041;&#27861;&#65292;&#23558;&#34920;&#38754;&#34920;&#31034;&#19982;&#22270;&#34920;&#38754;&#32467;&#21512;&#36215;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent advancements in Cryo-EM and protein structure prediction algorithms have made large-scale protein structures accessible, paving the way for machine learning-based functional annotations.The field of geometric deep learning focuses on creating methods working on geometric data. An essential aspect of learning from protein structures is representing these structures as a geometric object (be it a grid, graph, or surface) and applying a learning method tailored to this representation. The performance of a given approach will then depend on both the representation and its corresponding learning method.  In this paper, we investigate representing proteins as $\textit{3D mesh surfaces}$ and incorporate them into an established representation benchmark. Our first finding is that despite promising preliminary results, the surface representation alone does not seem competitive with 3D grids. Building on this, we introduce a synergistic approach, combining surface representations with gra
&lt;/p&gt;</description></item></channel></rss>