<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#30340;&#26032;&#22411;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#27169;&#22411;&#65292;&#36890;&#36807;&#24341;&#20837;&#24378;&#21270;&#23398;&#20064;&#21407;&#29702;&#30340;&#22810;&#21442;&#25968;&#22870;&#21169;&#20989;&#25968;&#65292;&#25104;&#21151;&#20248;&#21270;&#20102;&#23567;&#20998;&#23376;&#29983;&#25104;&#30340;&#33647;&#29289;&#26679;&#24615;&#20272;&#35745;&#65292;&#26368;&#39640;&#25552;&#21319;&#20102;30%&#12290;</title><link>https://arxiv.org/abs/2402.00014</link><description>&lt;p&gt;
&#28151;&#21512;&#37327;&#23376;&#24490;&#29615;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#29992;&#20110;&#23567;&#20998;&#23376;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Hybrid quantum cycle generative adversarial network for small molecule generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00014
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#30340;&#26032;&#22411;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#27169;&#22411;&#65292;&#36890;&#36807;&#24341;&#20837;&#24378;&#21270;&#23398;&#20064;&#21407;&#29702;&#30340;&#22810;&#21442;&#25968;&#22870;&#21169;&#20989;&#25968;&#65292;&#25104;&#21151;&#20248;&#21270;&#20102;&#23567;&#20998;&#23376;&#29983;&#25104;&#30340;&#33647;&#29289;&#26679;&#24615;&#20272;&#35745;&#65292;&#26368;&#39640;&#25552;&#21319;&#20102;30%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20195;&#33647;&#29289;&#35774;&#35745;&#36807;&#31243;&#38656;&#35201;&#22823;&#37327;&#30340;&#26102;&#38388;&#21644;&#36164;&#28304;&#26469;&#24320;&#21457;&#39318;&#27425;&#36827;&#20837;&#24066;&#22330;&#30340;&#27599;&#20010;&#26032;&#21270;&#21512;&#29289;&#12290;&#29983;&#25104;&#23567;&#20998;&#23376;&#26159;&#33647;&#29289;&#21457;&#29616;&#30340;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#65292;&#23545;&#20110;&#24320;&#21457;&#21019;&#26032;&#30340;&#21046;&#33647;&#20135;&#21697;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#23578;&#26410;&#20805;&#20998;&#21457;&#25381;&#29420;&#29305;&#24615;&#12289;&#26377;&#25928;&#24615;&#12289;&#22810;&#26679;&#24615;&#12289;&#33647;&#29289;&#26679;&#24615;&#12289;&#21487;&#21512;&#25104;&#24615;&#21644;&#28342;&#35299;&#24230;&#20998;&#23376;&#33647;&#20195;&#21160;&#21147;&#23398;&#24615;&#36136;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#20960;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#24037;&#31243;&#25972;&#21512;&#21040;&#24050;&#30693;&#20998;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#20013;&#30340;&#26032;&#22411;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#27169;&#22411;&#12290;&#24341;&#20837;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#32467;&#21512;&#20102;&#20197;&#24378;&#21270;&#23398;&#20064;&#21407;&#29702;&#20026;&#22522;&#30784;&#30340;&#26032;&#22411;&#22810;&#21442;&#25968;&#22870;&#21169;&#20989;&#25968;&#12290;&#36890;&#36807;&#22312;&#22522;&#20934;&#33647;&#29289;&#35774;&#35745;&#25968;&#25454;&#38598;QM9&#21644;PC9&#19978;&#36827;&#34892;&#24191;&#27867;&#30340;&#23454;&#39564;&#65292;&#26174;&#31034;&#20986;&#24341;&#20837;&#30340;&#27169;&#22411;&#20248;&#20110;&#20197;&#21069;&#30340;&#35780;&#20998;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#26032;&#30340;&#35780;&#20998;&#34920;&#26126;&#33647;&#29289;&#26679;&#24615;&#23450;&#37327;&#20272;&#35745;&#22686;&#21152;&#20102;&#26368;&#22810;30%&#12290;
&lt;/p&gt;
&lt;p&gt;
The contemporary drug design process demands considerable time and resources to develop each new compound entering the market. Generating small molecules is a pivotal aspect of drug discovery, essential for developing innovative pharmaceuticals. Uniqueness, validity, diversity, druglikeliness, synthesizability, and solubility molecular pharmacokinetic properties, however, are yet to be maximized. This work introduces several new generative adversarial network models based on engineering integration of parametrized quantum circuits into known molecular generative adversarial networks. The introduced machine learning models incorporate a new multi-parameter reward function grounded in reinforcement learning principles. Through extensive experimentation on benchmark drug design datasets, QM9 and PC9, the introduced models are shown to outperform scores achieved previously. Most prominently, the new scores indicate an increase of up to 30% in the druglikeness quantitative estimation. The n
&lt;/p&gt;</description></item></channel></rss>