<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;TDS&#30340;&#25197;&#36716;&#24335;&#25193;&#25955;&#37319;&#26679;&#22120;&#65292;&#23427;&#26159;&#19968;&#31181;&#38024;&#23545;&#25193;&#25955;&#27169;&#22411;&#30340;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#31639;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20351;&#29992;&#25197;&#36716;&#25216;&#26415;&#32467;&#21512;&#21551;&#21457;&#24335;&#36817;&#20284;&#65292;&#33021;&#22815;&#22312;&#19981;&#38656;&#35201;&#29305;&#23450;&#35757;&#32451;&#30340;&#24773;&#20917;&#19979;&#22312;&#24191;&#27867;&#30340;&#26465;&#20214;&#20998;&#24067;&#19978;&#25552;&#20379;&#31934;&#30830;&#30340;&#26679;&#26412;&#12290;</title><link>http://arxiv.org/abs/2306.17775</link><description>&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#20013;&#30340;&#23454;&#29992;&#21644;&#28176;&#36827;&#31934;&#30830;&#26465;&#20214;&#37319;&#26679;
&lt;/p&gt;
&lt;p&gt;
Practical and Asymptotically Exact Conditional Sampling in Diffusion Models. (arXiv:2306.17775v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17775
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;TDS&#30340;&#25197;&#36716;&#24335;&#25193;&#25955;&#37319;&#26679;&#22120;&#65292;&#23427;&#26159;&#19968;&#31181;&#38024;&#23545;&#25193;&#25955;&#27169;&#22411;&#30340;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#31639;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20351;&#29992;&#25197;&#36716;&#25216;&#26415;&#32467;&#21512;&#21551;&#21457;&#24335;&#36817;&#20284;&#65292;&#33021;&#22815;&#22312;&#19981;&#38656;&#35201;&#29305;&#23450;&#35757;&#32451;&#30340;&#24773;&#20917;&#19979;&#22312;&#24191;&#27867;&#30340;&#26465;&#20214;&#20998;&#24067;&#19978;&#25552;&#20379;&#31934;&#30830;&#30340;&#26679;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25193;&#25955;&#27169;&#22411;&#22312;&#20998;&#23376;&#35774;&#35745;&#21644;&#25991;&#26412;&#21040;&#22270;&#20687;&#29983;&#25104;&#31561;&#26465;&#20214;&#29983;&#25104;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#25104;&#23601;&#20027;&#35201;&#20381;&#36182;&#20110;&#20219;&#21153;&#29305;&#23450;&#30340;&#26465;&#20214;&#35757;&#32451;&#25110;&#23481;&#26131;&#20986;&#38169;&#30340;&#21551;&#21457;&#24335;&#36817;&#20284;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#26465;&#20214;&#29983;&#25104;&#26041;&#27861;&#24212;&#35813;&#33021;&#22815;&#22312;&#19981;&#38656;&#35201;&#29305;&#23450;&#35757;&#32451;&#30340;&#24773;&#20917;&#19979;&#20026;&#24191;&#27867;&#30340;&#26465;&#20214;&#20998;&#24067;&#25552;&#20379;&#31934;&#30830;&#30340;&#26679;&#26412;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#25197;&#36716;&#24335;&#25193;&#25955;&#37319;&#26679;&#22120;(TDS)&#12290;TDS&#26159;&#19968;&#31181;&#38024;&#23545;&#25193;&#25955;&#27169;&#22411;&#30340;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;(SMC)&#31639;&#27861;&#12290;&#20854;&#20027;&#35201;&#24605;&#24819;&#26159;&#20351;&#29992;&#25197;&#36716;&#65292;&#19968;&#31181;&#20855;&#26377;&#33391;&#22909;&#35745;&#31639;&#25928;&#29575;&#30340;SMC&#25216;&#26415;&#65292;&#26469;&#32467;&#21512;&#21551;&#21457;&#24335;&#36817;&#20284;&#32780;&#19981;&#24433;&#21709;&#28176;&#36827;&#31934;&#30830;&#24615;&#12290;&#25105;&#20204;&#39318;&#20808;&#22312;&#27169;&#25311;&#23454;&#39564;&#21644;MNIST&#22270;&#20687;&#20462;&#22797;&#20197;&#21450;&#31867;&#26465;&#20214;&#29983;&#25104;&#20219;&#21153;&#20013;&#21457;&#29616;&#65292;TDS&#25552;&#20379;&#20102;&#35745;&#31639;&#32479;&#35745;&#26435;&#34913;&#65292;&#20351;&#29992;&#26356;&#22810;&#31890;&#23376;&#24471;&#21040;&#26356;&#20934;&#30830;&#30340;&#36817;&#20284;&#32467;&#26524;&#65292;&#20294;&#21516;&#26102;&#38656;&#35201;&#26356;&#22810;&#35745;&#31639;&#36164;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;
Diffusion models have been successful on a range of conditional generation tasks including molecular design and text-to-image generation. However, these achievements have primarily depended on task-specific conditional training or error-prone heuristic approximations. Ideally, a conditional generation method should provide exact samples for a broad range of conditional distributions without requiring task-specific training. To this end, we introduce the Twisted Diffusion Sampler, or TDS. TDS is a sequential Monte Carlo (SMC) algorithm that targets the conditional distributions of diffusion models. The main idea is to use twisting, an SMC technique that enjoys good computational efficiency, to incorporate heuristic approximations without compromising asymptotic exactness. We first find in simulation and on MNIST image inpainting and class-conditional generation tasks that TDS provides a computational statistical trade-off, yielding more accurate approximations with many particles but wi
&lt;/p&gt;</description></item></channel></rss>