<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31561;&#21464;Transformer&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#34507;&#30333;&#36136;-&#37197;&#20307;&#23545;&#25509;&#65292;&#36890;&#36807;&#34701;&#21512;&#37197;&#20307;&#30340;&#22270;&#23618;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;TAMformer&#27169;&#22359;&#23398;&#20064;&#37197;&#20307;&#21644;&#34507;&#30333;&#36136;&#30340;&#34920;&#31034;&#65292;&#23454;&#29616;&#20102;&#23545;&#37197;&#20307;&#20301;&#23039;&#30340;&#20934;&#30830;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#36845;&#20195;&#20248;&#21270;&#26041;&#27861;&#29983;&#25104;&#31934;&#28860;&#30340;&#37197;&#20307;&#20301;&#23039;&#12290;</title><link>http://arxiv.org/abs/2310.08061</link><description>&lt;p&gt;
ETDock: &#19968;&#31181;&#26032;&#39062;&#30340;&#31561;&#21464;Transformer&#29992;&#20110;&#34507;&#30333;&#36136;-&#37197;&#20307;&#23545;&#25509;
&lt;/p&gt;
&lt;p&gt;
ETDock: A Novel Equivariant Transformer for Protein-Ligand Docking. (arXiv:2310.08061v1 [q-bio.BM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08061
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31561;&#21464;Transformer&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#34507;&#30333;&#36136;-&#37197;&#20307;&#23545;&#25509;&#65292;&#36890;&#36807;&#34701;&#21512;&#37197;&#20307;&#30340;&#22270;&#23618;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;TAMformer&#27169;&#22359;&#23398;&#20064;&#37197;&#20307;&#21644;&#34507;&#30333;&#36136;&#30340;&#34920;&#31034;&#65292;&#23454;&#29616;&#20102;&#23545;&#37197;&#20307;&#20301;&#23039;&#30340;&#20934;&#30830;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#36845;&#20195;&#20248;&#21270;&#26041;&#27861;&#29983;&#25104;&#31934;&#28860;&#30340;&#37197;&#20307;&#20301;&#23039;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#34507;&#30333;&#36136;&#21644;&#37197;&#20307;&#20043;&#38388;&#30340;&#23545;&#25509;&#26159;&#33647;&#29289;&#24320;&#21457;&#20013;&#20851;&#38190;&#19988;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#30340;&#23545;&#25509;&#26041;&#27861;&#20027;&#35201;&#20381;&#36182;&#20110;&#35780;&#20998;&#20989;&#25968;&#65292;&#32780;&#22522;&#20110;&#28145;&#24230;&#23398;&#20064;&#30340;&#23545;&#25509;&#26041;&#27861;&#36890;&#24120;&#24573;&#30053;&#20102;&#34507;&#30333;&#36136;&#21644;&#37197;&#20307;&#30340;3D&#31354;&#38388;&#20449;&#24687;&#20197;&#21450;&#37197;&#20307;&#30340;&#22270;&#23618;&#29305;&#24449;&#65292;&#38480;&#21046;&#20102;&#23427;&#20204;&#30340;&#24615;&#33021;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#34507;&#30333;&#36136;-&#37197;&#20307;&#23545;&#25509;&#20301;&#23039;&#39044;&#27979;&#30340;&#31561;&#21464;Transformer&#31070;&#32463;&#32593;&#32476;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#29305;&#24449;&#22788;&#29702;&#26469;&#34701;&#21512;&#37197;&#20307;&#30340;&#22270;&#23618;&#29305;&#24449;&#65292;&#28982;&#21518;&#20351;&#29992;&#25105;&#20204;&#25552;&#20986;&#30340;TAMformer&#27169;&#22359;&#23398;&#20064;&#37197;&#20307;&#21644;&#34507;&#30333;&#36136;&#30340;&#34920;&#31034;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37319;&#29992;&#22522;&#20110;&#39044;&#27979;&#30340;&#36317;&#31163;&#30697;&#38453;&#30340;&#36845;&#20195;&#20248;&#21270;&#26041;&#27861;&#26469;&#29983;&#25104;&#31934;&#28860;&#30340;&#37197;&#20307;&#20301;&#23039;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#21487;&#20197;&#36798;&#21040;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
Predicting the docking between proteins and ligands is a crucial and challenging task for drug discovery. However, traditional docking methods mainly rely on scoring functions, and deep learning-based docking approaches usually neglect the 3D spatial information of proteins and ligands, as well as the graph-level features of ligands, which limits their performance. To address these limitations, we propose an equivariant transformer neural network for protein-ligand docking pose prediction. Our approach involves the fusion of ligand graph-level features by feature processing, followed by the learning of ligand and protein representations using our proposed TAMformer module. Additionally, we employ an iterative optimization approach based on the predicted distance matrix to generate refined ligand poses. The experimental results on real datasets show that our model can achieve state-of-the-art performance.
&lt;/p&gt;</description></item></channel></rss>