<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#22823;&#37327;&#26399;&#21002;&#25991;&#31456;&#65292;&#24635;&#32467;&#20102;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#22312;&#24494;&#29983;&#29289;&#32452;&#23398;&#20013;&#30340;&#29616;&#26377;&#23454;&#36341;&#65292;&#25506;&#35752;&#20102;&#23454;&#39564;&#35774;&#35745;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#65292;&#24182;&#25552;&#20986;&#20102;&#22914;&#20309;&#36991;&#20813;&#24120;&#35265;&#23454;&#39564;&#35774;&#35745;&#32570;&#38519;&#30340;&#25351;&#23548;&#12290;</title><link>https://arxiv.org/abs/2402.17621</link><description>&lt;p&gt;
&#29992;&#20110;&#24494;&#29983;&#29289;&#32452;&#23398;&#30340;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#65306;&#24357;&#21512;&#24403;&#21069;&#21644;&#26368;&#20339;&#23454;&#36341;&#20043;&#38388;&#30340;&#24046;&#36317;
&lt;/p&gt;
&lt;p&gt;
Supervised machine learning for microbiomics: bridging the gap between current and best practices
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17621
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#22823;&#37327;&#26399;&#21002;&#25991;&#31456;&#65292;&#24635;&#32467;&#20102;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#22312;&#24494;&#29983;&#29289;&#32452;&#23398;&#20013;&#30340;&#29616;&#26377;&#23454;&#36341;&#65292;&#25506;&#35752;&#20102;&#23454;&#39564;&#35774;&#35745;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#65292;&#24182;&#25552;&#20986;&#20102;&#22914;&#20309;&#36991;&#20813;&#24120;&#35265;&#23454;&#39564;&#35774;&#35745;&#32570;&#38519;&#30340;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#23558;&#21152;&#36895;&#20020;&#24202;&#24494;&#29983;&#29289;&#32452;&#23398;&#21019;&#26032;&#65292;&#22914;&#30142;&#30149;&#35786;&#26029;&#21644;&#39044;&#21518;&#12290;&#36825;&#23558;&#38656;&#35201;&#39640;&#36136;&#37327;&#12289;&#21487;&#37325;&#29616;&#12289;&#21487;&#35299;&#37322;&#30340;&#24037;&#20316;&#27969;&#31243;&#65292;&#20854;&#39044;&#27979;&#33021;&#21147;&#36798;&#21040;&#25110;&#36229;&#36807;&#30417;&#31649;&#26426;&#26500;&#23545;&#20020;&#24202;&#24037;&#20855;&#35774;&#23450;&#30340;&#39640;&#38376;&#27099;&#12290;&#25105;&#20204;&#36890;&#36807;&#28145;&#20837;&#20998;&#26512;2021-2022&#24180;&#21457;&#34920;&#30340;100&#31687;&#21516;&#34892;&#35780;&#35758;&#30340;&#26399;&#21002;&#25991;&#31456;&#65292;&#25429;&#25417;&#20102;&#24403;&#21069;&#23558;&#30417;&#30563;ML&#24212;&#29992;&#20110;&#24494;&#29983;&#29289;&#32452;&#23398;&#25968;&#25454;&#30340;&#23454;&#36341;&#30340;&#19968;&#20010;&#24555;&#29031;&#12290;&#25105;&#20204;&#37319;&#29992;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#65292;&#24341;&#23548;&#35752;&#35770;&#21508;&#31181;&#23454;&#39564;&#35774;&#35745;&#26041;&#27861;&#30340;&#20248;&#28857;&#65292;&#21253;&#25324;&#20851;&#38190;&#32771;&#34385;&#22240;&#32032;&#65292;&#22914;&#22914;&#20309;&#20943;&#36731;&#23567;&#25968;&#25454;&#38598;&#22823;&#23567;&#30340;&#24433;&#21709;&#21516;&#26102;&#36991;&#20813;&#25968;&#25454;&#27844;&#28431;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20379;&#20851;&#20110;&#22914;&#20309;&#36991;&#20813;&#21487;&#33021;&#25439;&#23475;&#27169;&#22411;&#24615;&#33021;&#12289;&#21487;&#20449;&#24230;&#21644;&#21487;&#37325;&#22797;&#24615;&#30340;&#24120;&#35265;&#23454;&#39564;&#35774;&#35745;&#32570;&#38519;&#30340;&#25351;&#21335;&#12290;&#35752;&#35770;&#38468;&#26377;&#19968;&#20010;&#20114;&#21160;&#22312;&#32447;&#25945;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17621v1 Announce Type: cross  Abstract: Machine learning (ML) is set to accelerate innovations in clinical microbiomics, such as in disease diagnostics and prognostics. This will require high-quality, reproducible, interpretable workflows whose predictive capabilities meet or exceed the high thresholds set for clinical tools by regulatory agencies. Here, we capture a snapshot of current practices in the application of supervised ML to microbiomics data, through an in-depth analysis of 100 peer-reviewed journal articles published in 2021-2022. We apply a data-driven approach to steer discussion of the merits of varied approaches to experimental design, including key considerations such as how to mitigate the effects of small dataset size while avoiding data leakage. We further provide guidance on how to avoid common experimental design pitfalls that can hurt model performance, trustworthiness, and reproducibility. Discussion is accompanied by an interactive online tutorial th
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#33647;&#29289;&#19987;&#21033;&#21644;&#29983;&#29289;&#21307;&#23398;&#25968;&#25454;&#24211;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#35782;&#21035;&#20855;&#26377;&#25216;&#26415;&#28508;&#21147;&#21644;&#31185;&#23398;&#35777;&#25454;&#30340;&#33647;&#29289;&#20877;&#23450;&#20301;&#20505;&#36873;&#29289;&#12290;&#36890;&#36807;&#26500;&#24314;&#31185;&#23398;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#21644;&#22522;&#20110;&#19987;&#21033;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#65292;&#25105;&#20204;&#21487;&#20197;&#32508;&#21512;&#20998;&#26512;&#22810;&#31181;&#20449;&#24687;&#28304;&#65292;&#20026;&#33647;&#29289;&#20877;&#23450;&#20301;&#30740;&#31350;&#25552;&#20379;&#26032;&#30340;&#35270;&#35282;&#12290;</title><link>http://arxiv.org/abs/2309.03227</link><description>&lt;p&gt;
&#23398;&#20064;&#22522;&#20110;&#19987;&#21033;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#25581;&#31034;&#33647;&#29289;&#20877;&#23450;&#20301;&#20505;&#36873;&#29289;&#30340;&#25216;&#26415;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
Learning a Patent-Informed Biomedical Knowledge Graph Reveals Technological Potential of Drug Repositioning Candidates. (arXiv:2309.03227v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03227
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#33647;&#29289;&#19987;&#21033;&#21644;&#29983;&#29289;&#21307;&#23398;&#25968;&#25454;&#24211;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#35782;&#21035;&#20855;&#26377;&#25216;&#26415;&#28508;&#21147;&#21644;&#31185;&#23398;&#35777;&#25454;&#30340;&#33647;&#29289;&#20877;&#23450;&#20301;&#20505;&#36873;&#29289;&#12290;&#36890;&#36807;&#26500;&#24314;&#31185;&#23398;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#21644;&#22522;&#20110;&#19987;&#21033;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#65292;&#25105;&#20204;&#21487;&#20197;&#32508;&#21512;&#20998;&#26512;&#22810;&#31181;&#20449;&#24687;&#28304;&#65292;&#20026;&#33647;&#29289;&#20877;&#23450;&#20301;&#30740;&#31350;&#25552;&#20379;&#26032;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33647;&#29289;&#20877;&#23450;&#20301;&#26159;&#19968;&#31181;&#21457;&#29616;&#29616;&#26377;&#33647;&#29289;&#26032;&#27835;&#30103;&#29992;&#36884;&#30340;&#26377;&#21069;&#36884;&#30340;&#31574;&#30053;&#65292;&#36817;&#24180;&#26469;&#22312;&#35745;&#31639;&#31185;&#23398;&#25991;&#29486;&#20013;&#20351;&#29992;&#29983;&#29289;&#21307;&#23398;&#25968;&#25454;&#24211;&#36827;&#34892;&#20102;&#24191;&#27867;&#25506;&#32034;&#12290;&#28982;&#32780;&#65292;&#33647;&#29289;&#20877;&#23450;&#20301;&#20505;&#36873;&#29289;&#30340;&#25216;&#26415;&#28508;&#21147;&#32463;&#24120;&#34987;&#24573;&#35270;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#32508;&#21512;&#20998;&#26512;&#33647;&#29289;&#19987;&#21033;&#21644;&#29983;&#29289;&#21307;&#23398;&#25968;&#25454;&#24211;&#31561;&#22810;&#31181;&#20449;&#24687;&#28304;&#65292;&#35782;&#21035;&#20855;&#26377;&#25216;&#26415;&#28508;&#21147;&#21644;&#31185;&#23398;&#35777;&#25454;&#30340;&#33647;&#29289;&#20877;&#23450;&#20301;&#20505;&#36873;&#29289;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#31185;&#23398;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#65288;s-BKG&#65289;&#65292;&#21253;&#25324;&#26469;&#33258;&#29983;&#29289;&#21307;&#23398;&#25968;&#25454;&#24211;&#30340;&#33647;&#29289;&#12289;&#30142;&#30149;&#21644;&#22522;&#22240;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#28041;&#21450;&#35782;&#21035;&#22312;s-BKG&#20013;&#19982;&#30446;&#26631;&#30142;&#30149;&#20851;&#32852;&#26377;&#38480;&#20294;&#22312;&#31354;&#38388;&#19978;&#32039;&#23494;&#30456;&#37051;&#30340;&#33647;&#29289;&#20316;&#20026;&#28508;&#22312;&#30340;&#33647;&#29289;&#20505;&#36873;&#29289;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#28155;&#21152;&#33647;&#29289;&#19987;&#21033;&#20449;&#24687;&#26500;&#24314;&#20102;&#19968;&#20010;&#22522;&#20110;&#19987;&#21033;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#22270;&#35889;&#65288;p-BKG&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Drug repositioning-a promising strategy for discovering new therapeutic uses for existing drugs-has been increasingly explored in the computational science literature using biomedical databases. However, the technological potential of drug repositioning candidates has often been overlooked. This study presents a novel protocol to comprehensively analyse various sources such as pharmaceutical patents and biomedical databases, and identify drug repositioning candidates with both technological potential and scientific evidence. To this end, first, we constructed a scientific biomedical knowledge graph (s-BKG) comprising relationships between drugs, diseases, and genes derived from biomedical databases. Our protocol involves identifying drugs that exhibit limited association with the target disease but are closely located in the s-BKG, as potential drug candidates. We constructed a patent-informed biomedical knowledge graph (p-BKG) by adding pharmaceutical patent information. Finally, we d
&lt;/p&gt;</description></item></channel></rss>