<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>CREMP&#26159;&#19968;&#20010;&#36164;&#28304;&#65292;&#21253;&#21547;&#36229;&#36807;3&#21315;&#19975;&#20010;&#22823;&#29615;&#32957;&#26500;&#35937;&#24418;&#29366;&#65292;&#26088;&#22312;&#24555;&#36895;&#24320;&#21457;&#21644;&#35780;&#20272;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20197;&#20415;&#26356;&#22909;&#22320;&#27169;&#25311;&#22823;&#29615;&#32957;&#30340;&#26500;&#35937;&#12290;</title><link>http://arxiv.org/abs/2305.08057</link><description>&lt;p&gt;
CREMP: &#22823;&#29615;&#32957;&#30340;&#26500;&#35937;&#26059;&#36716;&#32452;&#21512;&#38598;&#65292;&#29992;&#20110;&#26426;&#22120;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
CREMP: Conformer-Rotamer Ensembles of Macrocyclic Peptides for Machine Learning. (arXiv:2305.08057v1 [q-bio.BM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08057
&lt;/p&gt;
&lt;p&gt;
CREMP&#26159;&#19968;&#20010;&#36164;&#28304;&#65292;&#21253;&#21547;&#36229;&#36807;3&#21315;&#19975;&#20010;&#22823;&#29615;&#32957;&#26500;&#35937;&#24418;&#29366;&#65292;&#26088;&#22312;&#24555;&#36895;&#24320;&#21457;&#21644;&#35780;&#20272;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20197;&#20415;&#26356;&#22909;&#22320;&#27169;&#25311;&#22823;&#29615;&#32957;&#30340;&#26500;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#31639;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23545;&#20110;&#27169;&#25311;&#22823;&#29615;&#32957;&#30340;&#26500;&#35937;&#20855;&#26377;&#28508;&#22312;&#30340;&#21551;&#31034;&#24615;&#20316;&#29992;&#65292;&#33021;&#22815;&#23454;&#29616;&#21512;&#29702;&#30340;&#35774;&#35745;&#21644;&#20248;&#21270;&#12290;&#28982;&#32780;&#65292;&#20934;&#30830;&#12289;&#24555;&#36895;&#12289;&#21487;&#20280;&#32553;&#30340;&#24314;&#27169;&#22823;&#29615;&#32957;&#20960;&#20309;&#24418;&#29366;&#30340;&#26041;&#27861;&#20173;&#28982;&#24456;&#38590;&#24471;&#21040;&#12290;&#36817;&#26399;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#26174;&#33879;&#21152;&#36895;&#20102;&#34507;&#30333;&#36136;&#32467;&#26500;&#39044;&#27979;&#21644;&#23567;&#20998;&#23376;&#26500;&#35937;&#38598;&#21512;&#30340;&#29983;&#25104;&#65292;&#20294;&#30001;&#20110;&#22823;&#29615;&#32957;&#30340;&#29420;&#29305;&#29305;&#24615;&#65292;&#22312;&#22823;&#29615;&#32957;&#30340;&#24314;&#27169;&#26041;&#38754;&#20173;&#26410;&#21462;&#24471;&#31867;&#20284;&#30340;&#36827;&#23637;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;CREMP&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#26469;&#24555;&#36895;&#24320;&#21457;&#21644;&#35780;&#20272;&#22823;&#29615;&#32957;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#36164;&#28304;&#12290;CREMP&#21253;&#21547;36,198&#20010;&#29420;&#29305;&#30340;&#22823;&#29615;&#32957;&#21450;&#20854;&#21033;&#29992;&#26500;&#35937;-&#26059;&#36716;&#32452;&#21512;&#37319;&#26679;&#24037;&#20855;&#65288;CREST&#65289;&#29983;&#25104;&#30340;&#39640;&#36136;&#37327;&#26500;&#35937;&#38598;&#21512;&#12290;&#24635;&#20043;&#65292;&#36825;&#20010;&#26032;&#30340;&#25968;&#25454;&#38598;&#21253;&#21547;&#36817;3130&#19975;&#20010;&#29420;&#29305;&#30340;&#22823;&#29615;&#32957;&#20960;&#20309;&#24418;&#29366;&#65292;&#27599;&#20010;&#24418;&#29366;&#37117;&#29992;&#21322;&#32463;&#39564;&#25193;&#23637;&#32039;&#26463;&#32538;&#65288;xTB&#65289;DF&#23548;&#20986;&#30340;&#33021;&#37327;&#36827;&#34892;&#27880;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Computational and machine learning approaches to model the conformational landscape of macrocyclic peptides have the potential to enable rational design and optimization. However, accurate, fast, and scalable methods for modeling macrocycle geometries remain elusive. Recent deep learning approaches have significantly accelerated protein structure prediction and the generation of small-molecule conformational ensembles, yet similar progress has not been made for macrocyclic peptides due to their unique properties. Here, we introduce CREMP, a resource generated for the rapid development and evaluation of machine learning models for macrocyclic peptides. CREMP contains 36,198 unique macrocyclic peptides and their high-quality structural ensembles generated using the Conformer-Rotamer Ensemble Sampling Tool (CREST). Altogether, this new dataset contains nearly 31.3 million unique macrocycle geometries, each annotated with energies derived from semi-empirical extended tight-binding (xTB) DF
&lt;/p&gt;</description></item></channel></rss>