<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21147;&#24341;&#23548;SE(3)&#25193;&#25955;&#27169;&#22411;ConfDiff&#65292;&#29992;&#20110;&#34507;&#30333;&#36136;&#26500;&#35937;&#29983;&#25104;&#65292;&#36890;&#36807;&#32467;&#21512;&#21147;&#24341;&#23548;&#32593;&#32476;&#19982;&#22522;&#20110;&#25968;&#25454;&#30340;&#20998;&#25968;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#23545;&#34507;&#30333;&#36136;&#26500;&#35937;&#30340;&#20934;&#30830;&#29983;&#25104;&#12290;</title><link>https://arxiv.org/abs/2403.14088</link><description>&lt;p&gt;
&#22522;&#20110;&#21147;&#24341;&#23548;SE(3)&#25193;&#25955;&#27169;&#22411;&#30340;&#34507;&#30333;&#36136;&#26500;&#35937;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Protein Conformation Generation via Force-Guided SE(3) Diffusion Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14088
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21147;&#24341;&#23548;SE(3)&#25193;&#25955;&#27169;&#22411;ConfDiff&#65292;&#29992;&#20110;&#34507;&#30333;&#36136;&#26500;&#35937;&#29983;&#25104;&#65292;&#36890;&#36807;&#32467;&#21512;&#21147;&#24341;&#23548;&#32593;&#32476;&#19982;&#22522;&#20110;&#25968;&#25454;&#30340;&#20998;&#25968;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#23545;&#34507;&#30333;&#36136;&#26500;&#35937;&#30340;&#20934;&#30830;&#29983;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34507;&#30333;&#36136;&#30340;&#26500;&#35937;&#26223;&#35266;&#23545;&#20110;&#29702;&#35299;&#22797;&#26434;&#29983;&#29289;&#36807;&#31243;&#20013;&#30340;&#21151;&#33021;&#33267;&#20851;&#37325;&#35201;&#12290;&#20256;&#32479;&#22522;&#20110;&#29289;&#29702;&#30340;&#35745;&#31639;&#26041;&#27861;&#65292;&#22914;&#20998;&#23376;&#21160;&#21147;&#23398;&#65288;MD&#65289;&#27169;&#25311;&#65292;&#23384;&#22312;&#31232;&#26377;&#20107;&#20214;&#37319;&#26679;&#21644;&#38271;&#26102;&#38388;&#24179;&#34913;&#38382;&#39064;&#65292;&#38480;&#21046;&#20102;&#23427;&#20204;&#22312;&#19968;&#33324;&#34507;&#30333;&#36136;&#31995;&#32479;&#20013;&#30340;&#24212;&#29992;&#12290;&#26368;&#36817;&#65292;&#28145;&#24230;&#29983;&#25104;&#24314;&#27169;&#25216;&#26415;&#65292;&#29305;&#21035;&#26159;&#25193;&#25955;&#27169;&#22411;&#65292;&#24050;&#34987;&#24212;&#29992;&#20110;&#29983;&#25104;&#26032;&#39062;&#30340;&#34507;&#30333;&#36136;&#26500;&#35937;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#22522;&#20110;&#20998;&#25968;&#30340;&#25193;&#25955;&#26041;&#27861;&#26080;&#27861;&#24456;&#22909;&#22320;&#32467;&#21512;&#37325;&#35201;&#30340;&#29289;&#29702;&#20808;&#39564;&#30693;&#35782;&#26469;&#25351;&#23548;&#29983;&#25104;&#36807;&#31243;&#65292;&#23548;&#33268;&#37319;&#26679;&#34507;&#30333;&#36136;&#26500;&#35937;&#19982;&#24179;&#34913;&#20998;&#24067;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#20559;&#24046;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#34507;&#30333;&#36136;&#26500;&#35937;&#29983;&#25104;&#30340;&#21147;&#24341;&#23548;SE(3)&#25193;&#25955;&#27169;&#22411;ConfDiff&#65292;&#20197;&#20811;&#26381;&#36825;&#20123;&#38480;&#21046;&#12290;&#36890;&#36807;&#23558;&#21147;&#24341;&#23548;&#32593;&#32476;&#19982;&#19968;&#31995;&#21015;&#22522;&#20110;&#25968;&#25454;&#30340;&#20998;&#25968;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;ConfDiff&#33021;&#22815;&#23454;&#29616;&#23545;&#34507;&#30333;&#36136;&#26500;&#35937;&#30340;&#20934;&#30830;&#29983;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14088v1 Announce Type: cross  Abstract: The conformational landscape of proteins is crucial to understanding their functionality in complex biological processes. Traditional physics-based computational methods, such as molecular dynamics (MD) simulations, suffer from rare event sampling and long equilibration time problems, hindering their applications in general protein systems. Recently, deep generative modeling techniques, especially diffusion models, have been employed to generate novel protein conformations. However, existing score-based diffusion methods cannot properly incorporate important physical prior knowledge to guide the generation process, causing large deviations in the sampled protein conformations from the equilibrium distribution. In this paper, to overcome these limitations, we propose a force-guided SE(3) diffusion model, ConfDiff, for protein conformation generation. By incorporating a force-guided network with a mixture of data-based score models, Conf
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#20998;&#24067;&#30340;&#20960;&#20309;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#34920;&#31034;&#38750;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#30340;&#20960;&#20309;&#24863;&#30693;&#25110;&#20960;&#20309;&#26080;&#24863;&#30693;&#34920;&#31034;&#65292;&#20197;&#23545;&#24050;&#27979;&#37327;&#36712;&#36857;&#36827;&#34892;&#26080;&#20559;&#27604;&#36739;&#12290;&#21033;&#29992;&#35813;&#26041;&#27861;&#65292;&#33021;&#22815;&#35299;&#37322;&#31070;&#32463;&#21160;&#21147;&#23398;&#30340;&#23884;&#20837;&#65292;&#22312;&#28789;&#38271;&#31867;&#20284;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#26368;&#20808;&#36827;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.03376</link><description>&lt;p&gt;
&#31070;&#32463;&#32676;&#20307;&#21160;&#24577;&#21644;&#20960;&#20309;&#30340;&#21487;&#35299;&#37322;&#32479;&#35745;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Interpretable statistical representations of neural population dynamics and geometry. (arXiv:2304.03376v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03376
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#20998;&#24067;&#30340;&#20960;&#20309;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#34920;&#31034;&#38750;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#30340;&#20960;&#20309;&#24863;&#30693;&#25110;&#20960;&#20309;&#26080;&#24863;&#30693;&#34920;&#31034;&#65292;&#20197;&#23545;&#24050;&#27979;&#37327;&#36712;&#36857;&#36827;&#34892;&#26080;&#20559;&#27604;&#36739;&#12290;&#21033;&#29992;&#35813;&#26041;&#27861;&#65292;&#33021;&#22815;&#35299;&#37322;&#31070;&#32463;&#21160;&#21147;&#23398;&#30340;&#23884;&#20837;&#65292;&#22312;&#28789;&#38271;&#31867;&#20284;&#20219;&#21153;&#20013;&#21462;&#24471;&#20102;&#26368;&#20808;&#36827;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21508;&#31181;&#20219;&#21153;&#20013;&#65292;&#31070;&#32463;&#20803;&#32676;&#20307;&#30340;&#21160;&#24577;&#36890;&#24120;&#22312;&#20302;&#32500;&#27969;&#24418;&#19978;&#28436;&#21270;&#12290;&#28982;&#32780;&#65292;&#21306;&#20998;&#20960;&#20309;&#21644;&#21160;&#24577;&#23545;&#32534;&#30721;&#30456;&#20851;&#34892;&#20026;&#21464;&#37327;&#30340;&#36129;&#29486;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#23616;&#37096;&#30456;&#36712;&#29305;&#24449;&#30340;&#32479;&#35745;&#20998;&#24067;&#30340;&#38750;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#30340;&#20960;&#20309;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#65292;&#29992;&#20110;&#34920;&#31034;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#23545;&#20960;&#20309;&#24863;&#30693;&#25110;&#20960;&#20309;&#26080;&#24863;&#30693;&#34920;&#31034;&#65292;&#20197;&#23545;&#24050;&#27979;&#37327;&#36712;&#36857;&#36827;&#34892;&#26080;&#20559;&#27604;&#36739;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#32479;&#35745;&#34920;&#31034;&#21487;&#20197;&#27178;&#36328;&#31070;&#32463;&#32593;&#32476;&#23454;&#20363;&#36827;&#34892;&#25512;&#24191;&#65292;&#20197;&#21306;&#20998;&#35745;&#31639;&#26426;&#21046;&#65292;&#22312;&#20855;&#26377;&#20960;&#20309;&#23545;&#24212;&#30340;&#28789;&#38271;&#31867;&#20284;&#20219;&#21153;&#20013;&#35299;&#37322;&#23884;&#20837;&#31070;&#32463;&#21160;&#21147;&#23398;&#65292;&#24182;&#24320;&#21457;&#20855;&#26377;&#26368;&#20808;&#36827;&#20934;&#30830;&#24615;&#30340;&#35299;&#30721;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#24378;&#35843;&#20102;&#20351;&#29992;&#20869;&#22312;&#27969;&#24418;&#32467;&#26500;&#20248;&#20110;&#26102;&#38388;&#20449;&#24687;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The dynamics of neuron populations during diverse tasks often evolve on low-dimensional manifolds. However, it remains challenging to discern the contributions of geometry and dynamics for encoding relevant behavioural variables. Here, we introduce an unsupervised geometric deep learning framework for representing non-linear dynamical systems based on statistical distributions of local phase portrait features. Our method provides robust geometry-aware or geometry-agnostic representations for the unbiased comparison of dynamics based on measured trajectories. We demonstrate that our statistical representation can generalise across neural network instances to discriminate computational mechanisms, obtain interpretable embeddings of neural dynamics in a primate reaching task with geometric correspondence to hand kinematics, and develop a decoding algorithm with state-of-the-art accuracy. Our results highlight the importance of using the intrinsic manifold structure over temporal informati
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#32467;&#26500;&#30340;&#33647;&#29289;&#35774;&#35745;&#26041;&#27861;&#65292;&#20351;&#29992;&#20102;&#31561;&#21464;&#25193;&#25955;&#27169;&#22411;DiffSBDD&#26469;&#29983;&#25104;&#20855;&#26377;&#20146;&#21644;&#21147;&#21644;&#29305;&#24322;&#24615;&#30340;&#26032;&#22411;&#33647;&#29289;&#37197;&#20307;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;DiffSBDD&#22312;&#29983;&#25104;&#20855;&#26377;&#31454;&#20105;&#24615;&#23545;&#25509;&#24471;&#20998;&#30340;&#22810;&#26679;&#21270;&#33647;&#29289;&#26679;&#37197;&#20307;&#26041;&#38754;&#20855;&#26377;&#39640;&#25928;&#21644;&#26377;&#25928;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2210.13695</link><description>&lt;p&gt;
&#22522;&#20110;&#32467;&#26500;&#30340;&#33647;&#29289;&#35774;&#35745;&#19982;&#31561;&#21464;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Structure-based Drug Design with Equivariant Diffusion Models. (arXiv:2210.13695v2 [q-bio.BM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.13695
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#32467;&#26500;&#30340;&#33647;&#29289;&#35774;&#35745;&#26041;&#27861;&#65292;&#20351;&#29992;&#20102;&#31561;&#21464;&#25193;&#25955;&#27169;&#22411;DiffSBDD&#26469;&#29983;&#25104;&#20855;&#26377;&#20146;&#21644;&#21147;&#21644;&#29305;&#24322;&#24615;&#30340;&#26032;&#22411;&#33647;&#29289;&#37197;&#20307;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;DiffSBDD&#22312;&#29983;&#25104;&#20855;&#26377;&#31454;&#20105;&#24615;&#23545;&#25509;&#24471;&#20998;&#30340;&#22810;&#26679;&#21270;&#33647;&#29289;&#26679;&#37197;&#20307;&#26041;&#38754;&#20855;&#26377;&#39640;&#25928;&#21644;&#26377;&#25928;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#32467;&#26500;&#30340;&#33647;&#29289;&#35774;&#35745;&#65288;SBDD&#65289;&#26088;&#22312;&#35774;&#35745;&#19982;&#39044;&#23450;&#30340;&#34507;&#30333;&#38774;&#28857;&#20855;&#26377;&#39640;&#20146;&#21644;&#21147;&#21644;&#29305;&#24322;&#24615;&#30340;&#23567;&#20998;&#23376;&#37197;&#20307;&#12290;&#26412;&#25991;&#23558;SBDD&#34920;&#36848;&#20026;&#19968;&#20010;&#19977;&#32500;&#26465;&#20214;&#29983;&#25104;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;DiffSBDD&#65292;&#36825;&#26159;&#19968;&#20010;SE(3)-&#31561;&#21464;&#30340;&#19977;&#32500;&#26465;&#20214;&#25193;&#25955;&#27169;&#22411;&#65292;&#21487;&#20197;&#22312;&#34507;&#30333;&#21475;&#34955;&#30340;&#26465;&#20214;&#19979;&#29983;&#25104;&#26032;&#22411;&#37197;&#20307;&#12290;&#20840;&#38754;&#30340;&#22522;&#20110;&#35745;&#31639;&#26426;&#27169;&#25311;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;DiffSBDD&#22312;&#29983;&#25104;&#20855;&#26377;&#20855;&#26377;&#31454;&#20105;&#24615;&#23545;&#25509;&#24471;&#20998;&#30340;&#26032;&#39062;&#21644;&#22810;&#26679;&#30340;&#33647;&#29289;&#26679;&#37197;&#20307;&#26041;&#38754;&#30340;&#25928;&#29575;&#21644;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25506;&#32034;&#20102;&#25193;&#25955;&#26694;&#26550;&#22312;&#33647;&#29289;&#35774;&#35745;&#27963;&#21160;&#20013;&#26356;&#24191;&#27867;&#20219;&#21153;&#30340;&#28789;&#27963;&#24615;&#65292;&#20363;&#22914;&#21363;&#25554;&#21363;&#29992;&#30340;&#24615;&#36136;&#20248;&#21270;&#21644;&#20174;&#23616;&#37096;&#20998;&#23376;&#35774;&#35745;&#24102;&#26377;&#20462;&#34917;&#30340;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
Structure-based drug design (SBDD) aims to design small-molecule ligands that bind with high affinity and specificity to pre-determined protein targets. In this paper, we formulate SBDD as a 3D-conditional generation problem and present DiffSBDD, an SE(3)-equivariant 3D-conditional diffusion model that generates novel ligands conditioned on protein pockets. Comprehensive in silico experiments demonstrate the efficiency and effectiveness of DiffSBDD in generating novel and diverse drug-like ligands with competitive docking scores. We further explore the flexibility of the diffusion framework for a broader range of tasks in drug design campaigns, such as off-the-shelf property optimization and partial molecular design with inpainting.
&lt;/p&gt;</description></item></channel></rss>