<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36890;&#36807;&#23558;&#36716;&#31227;&#23398;&#20064;&#30340;&#20195;&#29702;&#27169;&#22411;&#19982;&#36125;&#21494;&#26031;&#20248;&#21270;&#30456;&#32467;&#21512;&#65292;&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#22312;&#20248;&#21270;&#20219;&#21153;&#20043;&#38388;&#20849;&#20139;&#20449;&#24687;&#26469;&#20943;&#23569;&#23454;&#39564;&#30340;&#24635;&#25968;&#65292;&#24182;&#19988;&#28436;&#31034;&#20102;&#22312;&#35774;&#35745;&#29992;&#20110;&#25193;&#22686;&#22522;&#22240;&#35786;&#26029;&#27979;&#23450;&#30340;DNA&#31454;&#20105;&#23545;&#25163;&#26102;&#23454;&#39564;&#25968;&#37327;&#30340;&#20943;&#23569;&#12290;</title><link>https://arxiv.org/abs/2402.17704</link><description>&lt;p&gt;
&#23558;&#36125;&#21494;&#26031;&#20248;&#21270;&#24212;&#29992;&#20110;&#36716;&#31227;&#23398;&#20064;&#20197;&#35774;&#35745;&#29992;&#20110;&#35786;&#26029;&#27979;&#23450;&#30340;&#31454;&#20105;&#23545;&#25163;DNA&#20998;&#23376;
&lt;/p&gt;
&lt;p&gt;
Transfer Learning Bayesian Optimization to Design Competitor DNA Molecules for Use in Diagnostic Assays
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17704
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23558;&#36716;&#31227;&#23398;&#20064;&#30340;&#20195;&#29702;&#27169;&#22411;&#19982;&#36125;&#21494;&#26031;&#20248;&#21270;&#30456;&#32467;&#21512;&#65292;&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#22312;&#20248;&#21270;&#20219;&#21153;&#20043;&#38388;&#20849;&#20139;&#20449;&#24687;&#26469;&#20943;&#23569;&#23454;&#39564;&#30340;&#24635;&#25968;&#65292;&#24182;&#19988;&#28436;&#31034;&#20102;&#22312;&#35774;&#35745;&#29992;&#20110;&#25193;&#22686;&#22522;&#22240;&#35786;&#26029;&#27979;&#23450;&#30340;DNA&#31454;&#20105;&#23545;&#25163;&#26102;&#23454;&#39564;&#25968;&#37327;&#30340;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#24037;&#31243;&#29983;&#29289;&#20998;&#23376;&#35774;&#22791;&#30340;&#20852;&#36215;&#65292;&#23450;&#21046;&#29983;&#29289;&#24207;&#21015;&#30340;&#38656;&#27714;&#19981;&#26029;&#22686;&#21152;&#12290;&#36890;&#24120;&#65292;&#20026;&#20102;&#29305;&#23450;&#24212;&#29992;&#38656;&#35201;&#21046;&#20316;&#35768;&#22810;&#31867;&#20284;&#30340;&#29983;&#29289;&#24207;&#21015;&#65292;&#36825;&#24847;&#21619;&#30528;&#38656;&#35201;&#36827;&#34892;&#22823;&#37327;&#29978;&#33267;&#26114;&#36149;&#30340;&#23454;&#39564;&#26469;&#20248;&#21270;&#36825;&#20123;&#24207;&#21015;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36716;&#31227;&#23398;&#20064;&#35774;&#35745;&#23454;&#39564;&#24037;&#20316;&#27969;&#31243;&#65292;&#20351;&#36825;&#31181;&#24320;&#21457;&#21464;&#24471;&#21487;&#34892;&#12290;&#36890;&#36807;&#23558;&#36716;&#31227;&#23398;&#20064;&#20195;&#29702;&#27169;&#22411;&#19982;&#36125;&#21494;&#26031;&#20248;&#21270;&#30456;&#32467;&#21512;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#22312;&#20248;&#21270;&#20219;&#21153;&#20043;&#38388;&#20849;&#20139;&#20449;&#24687;&#26469;&#20943;&#23569;&#23454;&#39564;&#30340;&#24635;&#25968;&#12290;&#25105;&#20204;&#28436;&#31034;&#20102;&#20351;&#29992;&#29992;&#20110;&#25193;&#22686;&#22522;&#22240;&#35786;&#26029;&#27979;&#23450;&#20013;&#20351;&#29992;&#30340;DNA&#31454;&#20105;&#23545;&#25163;&#24320;&#21457;&#25968;&#25454;&#26469;&#20943;&#23569;&#23454;&#39564;&#25968;&#37327;&#12290;&#25105;&#20204;&#20351;&#29992;&#20132;&#21449;&#39564;&#35777;&#26469;&#27604;&#36739;&#19981;&#21516;&#36716;&#31227;&#23398;&#20064;&#27169;&#22411;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#65292;&#28982;&#21518;&#27604;&#36739;&#36825;&#20123;&#27169;&#22411;&#22312;&#21333;&#19968;&#30446;&#26631;&#21644;&#24809;&#32602;&#20248;&#21270;&#19979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17704v1 Announce Type: cross  Abstract: With the rise in engineered biomolecular devices, there is an increased need for tailor-made biological sequences. Often, many similar biological sequences need to be made for a specific application meaning numerous, sometimes prohibitively expensive, lab experiments are necessary for their optimization. This paper presents a transfer learning design of experiments workflow to make this development feasible. By combining a transfer learning surrogate model with Bayesian optimization, we show how the total number of experiments can be reduced by sharing information between optimization tasks. We demonstrate the reduction in the number of experiments using data from the development of DNA competitors for use in an amplification-based diagnostic assay. We use cross-validation to compare the predictive accuracy of different transfer learning models, and then compare the performance of the models for both single objective and penalized opti
&lt;/p&gt;</description></item><item><title>DNABERT-S&#26159;&#19968;&#31181;&#19987;&#38376;&#29992;&#20110;&#21019;&#24314;&#29289;&#31181;&#24863;&#30693;&#30340;DNA&#23884;&#20837;&#30340;&#22522;&#22240;&#32452;&#22522;&#30784;&#27169;&#22411;&#12290;&#20026;&#20102;&#25552;&#39640;&#23545;&#38271;&#35835;DNA&#24207;&#21015;&#30340;&#23884;&#20837;&#25928;&#26524;&#65292;&#24341;&#20837;&#20102;Manifold Instance Mixup (MI-Mix)&#23545;&#27604;&#30446;&#26631;&#26041;&#27861;&#26469;&#35757;&#32451;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2402.08777</link><description>&lt;p&gt;
DNABERT-S: &#23398;&#20064;&#20855;&#26377;&#22522;&#22240;&#32452;&#22522;&#30784;&#27169;&#22411;&#30340;&#29289;&#31181;&#24863;&#30693;DNA&#23884;&#20837;
&lt;/p&gt;
&lt;p&gt;
DNABERT-S: Learning Species-Aware DNA Embedding with Genome Foundation Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08777
&lt;/p&gt;
&lt;p&gt;
DNABERT-S&#26159;&#19968;&#31181;&#19987;&#38376;&#29992;&#20110;&#21019;&#24314;&#29289;&#31181;&#24863;&#30693;&#30340;DNA&#23884;&#20837;&#30340;&#22522;&#22240;&#32452;&#22522;&#30784;&#27169;&#22411;&#12290;&#20026;&#20102;&#25552;&#39640;&#23545;&#38271;&#35835;DNA&#24207;&#21015;&#30340;&#23884;&#20837;&#25928;&#26524;&#65292;&#24341;&#20837;&#20102;Manifold Instance Mixup (MI-Mix)&#23545;&#27604;&#30446;&#26631;&#26041;&#27861;&#26469;&#35757;&#32451;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#25928;&#30340;DNA&#23884;&#20837;&#22312;&#22522;&#22240;&#32452;&#20998;&#26512;&#20013;&#20173;&#28982;&#33267;&#20851;&#37325;&#35201;&#65292;&#29305;&#21035;&#26159;&#22312;&#32570;&#20047;&#29992;&#20110;&#27169;&#22411;&#24494;&#35843;&#30340;&#26631;&#35760;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#65292;&#23613;&#31649;&#22522;&#22240;&#32452;&#22522;&#30784;&#27169;&#22411;&#24050;&#32463;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#12290;&#19968;&#20010;&#20856;&#22411;&#30340;&#20363;&#23376;&#26159;&#23439;&#22522;&#22240;&#32452;&#20998;&#31665;&#65292;&#36825;&#26159;&#24494;&#29983;&#29289;&#32452;&#30740;&#31350;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#36807;&#31243;&#65292;&#26088;&#22312;&#36890;&#36807;&#26469;&#33258;&#21487;&#33021;&#21253;&#21547;&#25104;&#21315;&#19978;&#19975;&#20010;&#19981;&#21516;&#30340;&#12289;&#36890;&#24120;&#27809;&#26377;&#32463;&#36807;&#34920;&#24449;&#30340;&#29289;&#31181;&#30340;&#22797;&#26434;&#28151;&#21512;DNA&#24207;&#21015;&#30340;&#29289;&#31181;&#26469;&#23545;DNA&#24207;&#21015;&#36827;&#34892;&#20998;&#32452;&#12290;&#20026;&#20102;&#22635;&#34917;&#26377;&#25928;&#30340;DNA&#23884;&#20837;&#27169;&#22411;&#30340;&#32570;&#38519;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;DNABERT-S&#65292;&#36825;&#26159;&#19968;&#20010;&#19987;&#38376;&#29992;&#20110;&#21019;&#24314;&#29289;&#31181;&#24863;&#30693;&#30340;DNA&#23884;&#20837;&#30340;&#22522;&#22240;&#32452;&#22522;&#30784;&#27169;&#22411;&#12290;&#20026;&#20102;&#40723;&#21169;&#23545;&#26131;&#20986;&#38169;&#30340;&#38271;&#35835;DNA&#24207;&#21015;&#36827;&#34892;&#26377;&#25928;&#23884;&#20837;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Manifold Instance Mixup(MI-Mix)&#65292;&#19968;&#31181;&#23545;&#27604;&#30446;&#26631;&#65292;&#23427;&#22312;&#38543;&#26426;&#36873;&#25321;&#30340;&#23618;&#27425;&#20013;&#28151;&#21512;DNA&#24207;&#21015;&#30340;&#38544;&#34255;&#34920;&#31034;&#65292;&#24182;&#35757;&#32451;&#27169;&#22411;&#20197;&#22312;&#36755;&#20986;&#23618;&#35782;&#21035;&#21644;&#21306;&#20998;&#36825;&#20123;&#28151;&#21512;&#27604;&#20363;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08777v1 Announce Type: cross Abstract: Effective DNA embedding remains crucial in genomic analysis, particularly in scenarios lacking labeled data for model fine-tuning, despite the significant advancements in genome foundation models. A prime example is metagenomics binning, a critical process in microbiome research that aims to group DNA sequences by their species from a complex mixture of DNA sequences derived from potentially thousands of distinct, often uncharacterized species. To fill the lack of effective DNA embedding models, we introduce DNABERT-S, a genome foundation model that specializes in creating species-aware DNA embeddings. To encourage effective embeddings to error-prone long-read DNA sequences, we introduce Manifold Instance Mixup (MI-Mix), a contrastive objective that mixes the hidden representations of DNA sequences at randomly selected layers and trains the model to recognize and differentiate these mixed proportions at the output layer. We further enha
&lt;/p&gt;</description></item></channel></rss>