<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#20154;&#31867;&#22823;&#33041;&#23545;&#30495;&#23454;&#21644;&#34394;&#20551;&#38899;&#39057;&#26377;&#19981;&#21516;&#30340;&#21453;&#24212;&#27169;&#24335;&#65292;&#19982;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#26816;&#27979;&#31639;&#27861;&#19981;&#21516;&#65292;&#36825;&#20026;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#26816;&#27979;&#31561;&#39046;&#22495;&#30340;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#21021;&#27493;&#35777;&#25454;&#12290;</title><link>https://arxiv.org/abs/2402.14982</link><description>&lt;p&gt;
&#20154;&#31867;&#22823;&#33041;&#22312;&#21548;&#21462;&#30495;&#23454;&#21644;&#34394;&#20551;&#38899;&#39057;&#26102;&#23637;&#29616;&#20986;&#19981;&#21516;&#27169;&#24335;&#65306;&#21021;&#27493;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Human Brain Exhibits Distinct Patterns When Listening to Fake Versus Real Audio: Preliminary Evidence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14982
&lt;/p&gt;
&lt;p&gt;
&#20154;&#31867;&#22823;&#33041;&#23545;&#30495;&#23454;&#21644;&#34394;&#20551;&#38899;&#39057;&#26377;&#19981;&#21516;&#30340;&#21453;&#24212;&#27169;&#24335;&#65292;&#19982;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#26816;&#27979;&#31639;&#27861;&#19981;&#21516;&#65292;&#36825;&#20026;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#26816;&#27979;&#31561;&#39046;&#22495;&#30340;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#21021;&#27493;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20154;&#31867;&#21548;&#21462;&#30495;&#23454;&#21644;&#34394;&#20551;&#38899;&#39057;&#26102;&#22823;&#33041;&#27963;&#21160;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#30340;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;&#65292;&#19968;&#31181;&#26368;&#20808;&#36827;&#30340;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#26816;&#27979;&#31639;&#27861;&#25152;&#23398;&#20064;&#30340;&#34920;&#31034;&#65292;&#24182;&#27809;&#26377;&#26174;&#31034;&#20986;&#30495;&#23454;&#21644;&#34394;&#20551;&#38899;&#39057;&#20043;&#38388;&#30340;&#28165;&#26224;&#19981;&#21516;&#27169;&#24335;&#12290;&#30456;&#21453;&#65292;&#20154;&#31867;&#22823;&#33041;&#27963;&#21160;&#65292;&#36890;&#36807; EEG &#27979;&#37327;&#65292;&#22312;&#20010;&#20307;&#25509;&#35302;&#34394;&#20551;&#19982;&#30495;&#23454;&#38899;&#39057;&#26102;&#26174;&#31034;&#20986;&#19981;&#21516;&#30340;&#27169;&#24335;&#12290;&#36825;&#20123;&#21021;&#27493;&#35777;&#25454;&#20026;&#26410;&#26469;&#22312;&#28145;&#24230;&#20266;&#36896;&#38899;&#39057;&#26816;&#27979;&#31561;&#39046;&#22495;&#25552;&#20379;&#20102;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14982v1 Announce Type: cross  Abstract: In this paper we study the variations in human brain activity when listening to real and fake audio. Our preliminary results suggest that the representations learned by a state-of-the-art deepfake audio detection algorithm, do not exhibit clear distinct patterns between real and fake audio. In contrast, human brain activity, as measured by EEG, displays distinct patterns when individuals are exposed to fake versus real audio. This preliminary evidence enables future research directions in areas such as deepfake audio detection.
&lt;/p&gt;</description></item></channel></rss>