<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#25193;&#23637;&#20102;&#20851;&#20110;&#22810;&#21306;&#22495;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#30340;&#31283;&#23450;&#24615;&#30740;&#31350;&#65292;&#24182;&#22312;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#27169;&#22359;&#21270;&#32467;&#26500;&#19978;&#35777;&#26126;&#20102;&#26494;&#25955;&#31283;&#23450;&#24615;&#26465;&#20214;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#31232;&#30095;&#32452;&#21512;&#32593;&#32476;&#22312;&#27979;&#35797;&#34920;&#29616;&#21644;&#38887;&#24615;&#26041;&#38754;&#34920;&#29616;&#20986;&#36739;&#22909;&#30340;&#24615;&#33021;&#65292;&#24378;&#35843;&#20102;&#31283;&#23450;&#24615;&#23545;&#20110;&#23454;&#29616;&#27169;&#22359;&#21270;RNN&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.01571</link><description>&lt;p&gt;
&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#22522;&#20803;&#30340;&#25910;&#32553;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Contraction Properties of the Global Workspace Primitive. (arXiv:2310.01571v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01571
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25193;&#23637;&#20102;&#20851;&#20110;&#22810;&#21306;&#22495;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#30340;&#31283;&#23450;&#24615;&#30740;&#31350;&#65292;&#24182;&#22312;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#27169;&#22359;&#21270;&#32467;&#26500;&#19978;&#35777;&#26126;&#20102;&#26494;&#25955;&#31283;&#23450;&#24615;&#26465;&#20214;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#31232;&#30095;&#32452;&#21512;&#32593;&#32476;&#22312;&#27979;&#35797;&#34920;&#29616;&#21644;&#38887;&#24615;&#26041;&#38754;&#34920;&#29616;&#20986;&#36739;&#22909;&#30340;&#24615;&#33021;&#65292;&#24378;&#35843;&#20102;&#31283;&#23450;&#24615;&#23545;&#20110;&#23454;&#29616;&#27169;&#22359;&#21270;RNN&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#25512;&#21160;&#20851;&#20110;&#22810;&#21306;&#22495;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;(RNNs)&#30340;&#37325;&#35201;&#26032;&#20852;&#30740;&#31350;&#39046;&#22495;&#65292;&#25105;&#20204;&#22312;Kozachkov&#31561;&#20154;&#30340;&#8220;&#36882;&#24402;&#26500;&#24314;&#31283;&#23450;&#30340;&#36882;&#24402;&#31070;&#32463;&#32593;&#32476;&#32452;&#35013;&#21697;&#8221;&#30340;&#22522;&#30784;&#19978;&#22312;&#29702;&#35770;&#19978;&#21644;&#23454;&#35777;&#19978;&#36827;&#34892;&#20102;&#25193;&#23637;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#26550;&#26500;&#30340;&#26174;&#33879;&#29305;&#20363;&#30340;&#26494;&#25955;&#31283;&#23450;&#24615;&#26465;&#20214;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#27169;&#22359;&#21270;&#32467;&#26500;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#20855;&#26377;&#23569;&#37327;&#21487;&#35757;&#32451;&#21442;&#25968;&#30340;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#31232;&#30095;&#32452;&#21512;&#32593;&#32476;&#36827;&#34892;&#23454;&#35777;&#25104;&#21151;&#65292;&#19981;&#20165;&#22312;&#25972;&#20307;&#27979;&#35797;&#34920;&#29616;&#26041;&#38754;&#34920;&#29616;&#20986;&#24378;&#22823;&#30340;&#24615;&#33021;&#65292;&#36824;&#23545;&#21333;&#20010;&#23376;&#32593;&#32476;&#30340;&#31227;&#38500;&#20855;&#26377;&#26356;&#22823;&#30340;&#38887;&#24615;&#12290;&#36825;&#20123;&#20840;&#23616;&#24037;&#20316;&#31354;&#38388;&#25509;&#35302;&#21306;&#25299;&#25169;&#30340;&#23454;&#35777;&#32467;&#26524;&#20381;&#36182;&#20110;&#31283;&#23450;&#24615;&#30340;&#20445;&#25345;&#65292;&#31361;&#20986;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#24037;&#20316;&#23545;&#20110;&#23454;&#29616;&#27169;&#22359;&#21270;RNN&#30340;&#25104;&#21151;&#30340;&#30456;&#20851;&#24615;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#26356;&#24191;&#27867;&#22320;&#25506;&#32034;&#19981;&#21516;&#23376;&#32593;&#32476;&#27169;&#22359;&#20043;&#38388;&#30340;&#36830;&#25509;&#32467;&#26500;&#30340;&#31232;&#30095;&#24615;&#65292;
&lt;/p&gt;
&lt;p&gt;
To push forward the important emerging research field surrounding multi-area recurrent neural networks (RNNs), we expand theoretically and empirically on the provably stable RNNs of RNNs introduced by Kozachkov et al. in "RNNs of RNNs: Recursive Construction of Stable Assemblies of Recurrent Neural Networks". We prove relaxed stability conditions for salient special cases of this architecture, most notably for a global workspace modular structure. We then demonstrate empirical success for Global Workspace Sparse Combo Nets with a small number of trainable parameters, not only through strong overall test performance but also greater resilience to removal of individual subnetworks. These empirical results for the global workspace inter-area topology are contingent on stability preservation, highlighting the relevance of our theoretical work for enabling modular RNN success. Further, by exploring sparsity in the connectivity structure between different subnetwork modules more broadly, we 
&lt;/p&gt;</description></item></channel></rss>