<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;Grover&#21644;Deutsch-Josza&#31561;&#22522;&#30784;&#37327;&#23376;&#31639;&#27861;&#65292;&#36890;&#36807;&#19968;&#32452;&#31934;&#24515;&#26500;&#24314;&#30340;&#26465;&#20214;&#65292;&#25512;&#26029;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#22312;&#19968;&#27573;&#26102;&#38388;&#20869;&#26159;&#21542;&#20855;&#26377;&#32487;&#32493;&#32500;&#25345;&#21160;&#24577;&#27963;&#21160;&#30340;&#28508;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.18963</link><description>&lt;p&gt;
&#20351;&#29992;&#37327;&#23376;&#35745;&#31639;&#25512;&#26029;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#30340;&#21160;&#24577;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Using Quantum Computing to Infer Dynamic Behaviors of Biological and Artificial Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18963
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;Grover&#21644;Deutsch-Josza&#31561;&#22522;&#30784;&#37327;&#23376;&#31639;&#27861;&#65292;&#36890;&#36807;&#19968;&#32452;&#31934;&#24515;&#26500;&#24314;&#30340;&#26465;&#20214;&#65292;&#25512;&#26029;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#22312;&#19968;&#27573;&#26102;&#38388;&#20869;&#26159;&#21542;&#20855;&#26377;&#32487;&#32493;&#32500;&#25345;&#21160;&#24577;&#27963;&#21160;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26032;&#38382;&#39064;&#31867;&#21035;&#30340;&#25506;&#32034;&#26159;&#37327;&#23376;&#35745;&#31639;&#30740;&#31350;&#30340;&#19968;&#20010;&#27963;&#36291;&#39046;&#22495;&#12290;&#19968;&#20010;&#22522;&#26412;&#19978;&#23436;&#20840;&#26410;&#34987;&#25506;&#35752;&#30340;&#20027;&#39064;&#26159;&#20351;&#29992;&#37327;&#23376;&#31639;&#27861;&#21644;&#35745;&#31639;&#26469;&#25506;&#32034;&#21644;&#35810;&#38382;&#31070;&#32463;&#32593;&#32476;&#30340;&#21151;&#33021;&#21160;&#24577;&#12290;&#36825;&#26159;&#23558;&#37327;&#23376;&#35745;&#31639;&#24212;&#29992;&#20110;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#24314;&#27169;&#21644;&#20223;&#30495;&#30340;&#23578;&#26410;&#25104;&#29087;&#30340;&#20027;&#39064;&#30340;&#19968;&#20010;&#32452;&#25104;&#37096;&#20998;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#31934;&#24515;&#26500;&#24314;&#30340;&#19968;&#32452;&#26465;&#20214;&#26469;&#20351;&#29992;&#20004;&#20010;&#22522;&#30784;&#37327;&#23376;&#31639;&#27861;&#65292;Grover&#21644;Deutsch-Josza&#65292;&#20197;&#20351;&#36755;&#20986;&#27979;&#37327;&#20855;&#26377;&#19968;&#31181;&#35299;&#37322;&#65292;&#20445;&#35777;&#25105;&#20204;&#33021;&#22815;&#25512;&#26029;&#19968;&#20010;&#31616;&#21333;&#30340;&#31070;&#32463;&#32593;&#32476;&#34920;&#31034;&#65288;&#36866;&#29992;&#20110;&#29983;&#29289;&#21644;&#20154;&#24037;&#32593;&#32476;&#65289;&#22312;&#19968;&#27573;&#26102;&#38388;&#21518;&#26159;&#21542;&#26377;&#21487;&#33021;&#32487;&#32493;&#32500;&#25345;&#21160;&#24577;&#27963;&#21160;&#12290;&#25110;&#32773;&#36825;&#20123;&#21160;&#24577;&#20445;&#35777;&#20250;&#20572;&#27490;&#65292;&#35201;&#20040;&#26159;&#36890;&#36807;'&#30315;&#30187;'&#21160;&#24577;&#65292;&#35201;&#20040;&#26159;&#38745;&#27490;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18963v1 Announce Type: cross  Abstract: The exploration of new problem classes for quantum computation is an active area of research. An essentially completely unexplored topic is the use of quantum algorithms and computing to explore and ask questions \textit{about} the functional dynamics of neural networks. This is a component of the still-nascent topic of applying quantum computing to the modeling and simulations of biological and artificial neural networks. In this work, we show how a carefully constructed set of conditions can use two foundational quantum algorithms, Grover and Deutsch-Josza, in such a way that the output measurements admit an interpretation that guarantees we can infer if a simple representation of a neural network (which applies to both biological and artificial networks) after some period of time has the potential to continue sustaining dynamic activity. Or whether the dynamics are guaranteed to stop either through 'epileptic' dynamics or quiescence
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#19987;&#23478;&#35748;&#30693;&#39537;&#21160;&#30340;&#23433;&#20840;&#22122;&#22768;&#26631;&#31614;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#20083;&#33146;&#30284;&#27531;&#20313;&#32959;&#30244;&#30340;&#31934;&#30830;&#20998;&#21106;&#65292;&#35813;&#26041;&#27861;&#23558;&#30149;&#29702;&#19987;&#23478;&#30340;&#35748;&#30693;&#21644;&#20154;&#24037;&#26234;&#33021;&#19987;&#23478;&#30340;&#25968;&#25454;&#24314;&#27169;&#35748;&#30693;&#30456;&#32467;&#21512;&#65292;&#20197;&#32531;&#35299;&#20083;&#33146;&#30284;&#32452;&#32455;&#21644;&#32959;&#30244;&#32454;&#32990;&#24418;&#24577;&#23398;&#25913;&#21464;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2304.07295</link><description>&lt;p&gt;
&#22522;&#20110;&#19987;&#23478;&#35748;&#30693;&#39537;&#21160;&#30340;&#23433;&#20840;&#22122;&#22768;&#26631;&#31614;&#23398;&#20064;&#29992;&#20110;&#20083;&#33146;&#30284;&#27531;&#20313;&#32959;&#30244;&#30340;&#31934;&#30830;&#20998;&#21106;
&lt;/p&gt;
&lt;p&gt;
Experts' cognition-driven safe noisy labels learning for precise segmentation of residual tumor in breast cancer. (arXiv:2304.07295v1 [q-bio.QM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#19987;&#23478;&#35748;&#30693;&#39537;&#21160;&#30340;&#23433;&#20840;&#22122;&#22768;&#26631;&#31614;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#20083;&#33146;&#30284;&#27531;&#20313;&#32959;&#30244;&#30340;&#31934;&#30830;&#20998;&#21106;&#65292;&#35813;&#26041;&#27861;&#23558;&#30149;&#29702;&#19987;&#23478;&#30340;&#35748;&#30693;&#21644;&#20154;&#24037;&#26234;&#33021;&#19987;&#23478;&#30340;&#25968;&#25454;&#24314;&#27169;&#35748;&#30693;&#30456;&#32467;&#21512;&#65292;&#20197;&#32531;&#35299;&#20083;&#33146;&#30284;&#32452;&#32455;&#21644;&#32959;&#30244;&#32454;&#32990;&#24418;&#24577;&#23398;&#25913;&#21464;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26032;&#36741;&#21161;&#21270;&#30103;&#21518;&#20934;&#30830;&#20998;&#21106;&#20083;&#33146;&#30284;&#27531;&#20313;&#32959;&#30244; (PSRTBC) &#26159;&#20083;&#33146;&#30284;&#27835;&#30103;&#36807;&#31243;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#20851;&#38190;&#25216;&#26415;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20083;&#33146;&#30284;&#32452;&#32455;&#21644;&#32959;&#30244;&#32454;&#32990;&#22312;&#26032;&#36741;&#21161;&#21270;&#30103;&#21518;&#24120;&#24120;&#20855;&#26377;&#22797;&#26434;&#21644;&#22810;&#31181;&#22810;&#26679;&#30340;&#24418;&#24577;&#23398;&#25913;&#21464;&#65292;&#22240;&#27492;&#20135;&#29983;&#19968;&#20010;&#20855;&#26377;&#33391;&#22909;&#27867;&#21270;&#24615;&#33021;&#30340;&#39044;&#27979;&#27169;&#22411;&#20173;&#28982;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#31181;&#24773;&#20917;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#19987;&#23478;&#35748;&#30693;&#39537;&#21160;&#30340;&#23433;&#20840;&#22122;&#22768;&#26631;&#31614;&#23398;&#20064; (ECDSNLL) &#26041;&#27861;&#12290;ECDSNLL&#26159;&#22312;&#23433;&#20840;&#22122;&#22768;&#26631;&#31614;&#23398;&#20064;&#30340;&#27010;&#24565;&#19979;&#26500;&#24314;&#30340;&#65292;&#21518;&#32773;&#26159;&#19968;&#31181;&#20856;&#22411;&#30340;&#23433;&#20840;&#24369;&#30417;&#30563;&#23398;&#20064;&#26041;&#27861;&#65292;&#23427;&#23558;&#30149;&#29702;&#19987;&#23478;&#23545;&#20083;&#33146;&#30284;&#27531;&#20313;&#32959;&#30244;&#35782;&#21035;&#30340;&#35748;&#30693;&#19982;&#25552;&#20379;&#30340;&#25968;&#25454;&#22522;&#30784;&#19978;&#30340;&#20154;&#24037;&#26234;&#33021;&#19987;&#23478;&#30340;&#25968;&#25454;&#24314;&#27169;&#35748;&#30693;&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;ECDSNLL&#26041;&#27861;&#30340;&#20248;&#21183;&#21644;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Precise segmentation of residual tumor in breast cancer (PSRTBC) after neoadjuvant chemotherapy is a fundamental key technique in the treatment process of breast cancer. However, achieving PSRTBC is still a challenge, since the breast cancer tissue and tumor cells commonly have complex and varied morphological changes after neoadjuvant chemotherapy, which inevitably increases the difficulty to produce a predictive model that has good generalization with machine learning. To alleviate this situation, in this paper, we propose an experts' cognition-driven safe noisy labels learning (ECDSNLL) approach. In the concept of safe noisy labels learning, which is a typical type of safe weakly supervised learning, ECDSNLL is constructed by integrating the pathology experts' cognition about identifying residual tumor in breast cancer and the artificial intelligence experts' cognition about data modeling with provided data basis. We show the advantages of the proposed ECDSNLL approach and its promi
&lt;/p&gt;</description></item></channel></rss>