<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22330;&#30340;&#27169;&#22411;&#29992;&#20110;&#29983;&#25104;&#25311;&#33647;&#20998;&#23376;&#65292;&#30456;&#27604;&#22522;&#20110;&#28857;&#20113;&#30340;&#26041;&#27861;&#20855;&#26377;&#28789;&#27963;&#24615;&#21644;&#31454;&#20105;&#24615;&#65292;&#33021;&#22815;&#35299;&#20915;&#23545;&#26144;&#24322;&#26500;&#20307;&#38382;&#39064;&#65292;&#36827;&#32780;&#32771;&#34385;&#25152;&#26377;&#20998;&#23376;&#20960;&#20309;&#26041;&#38754;&#12290;</title><link>https://arxiv.org/abs/2402.15864</link><description>&lt;p&gt;
&#22522;&#20110;&#22330;&#30340;&#20998;&#23376;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Field-based Molecule Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15864
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22330;&#30340;&#27169;&#22411;&#29992;&#20110;&#29983;&#25104;&#25311;&#33647;&#20998;&#23376;&#65292;&#30456;&#27604;&#22522;&#20110;&#28857;&#20113;&#30340;&#26041;&#27861;&#20855;&#26377;&#28789;&#27963;&#24615;&#21644;&#31454;&#20105;&#24615;&#65292;&#33021;&#22815;&#35299;&#20915;&#23545;&#26144;&#24322;&#26500;&#20307;&#38382;&#39064;&#65292;&#36827;&#32780;&#32771;&#34385;&#25152;&#26377;&#20998;&#23376;&#20960;&#20309;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;FMG&#65292;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#25311;&#33647;&#20998;&#23376;&#30340;&#22522;&#20110;&#22330;&#30340;&#27169;&#22411;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#30340;&#28789;&#27963;&#24615;&#22914;&#20309;&#30456;&#27604;&#26222;&#36941;&#20351;&#29992;&#30340;&#22522;&#20110;&#28857;&#20113;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#37325;&#35201;&#20248;&#21183;&#65292;&#24182;&#23454;&#29616;&#20102;&#26377;&#31454;&#20105;&#21147;&#30340;&#20998;&#23376;&#31283;&#23450;&#24615;&#29983;&#25104;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#20809;&#23398;&#24322;&#26500;&#20307;&#65288;&#23545;&#26144;&#24322;&#26500;&#20307;&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#20808;&#21069;&#34987;&#24573;&#30053;&#30340;&#23545;&#20110;&#33647;&#29289;&#23433;&#20840;&#24615;&#21644;&#26377;&#25928;&#24615;&#33267;&#20851;&#37325;&#35201;&#30340;&#20998;&#23376;&#23646;&#24615;&#65292;&#24182;&#22240;&#27492;&#32771;&#34385;&#20102;&#25152;&#26377;&#20998;&#23376;&#20960;&#20309;&#26041;&#38754;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20808;&#21069;&#30340;&#26041;&#27861;&#26159;&#23545;&#19968;&#32452;&#21464;&#25442;&#19981;&#21464;&#30340;&#65292;&#20854;&#20013;&#21253;&#25324;&#23545;&#26144;&#24322;&#26500;&#20307;&#25104;&#23545;&#23384;&#22312;&#65292;&#23548;&#33268;&#23427;&#20204;&#23545;&#20998;&#23376;&#30340;R&#21644;S&#26500;&#22411;&#20445;&#25345;&#19981;&#21464;&#65292;&#32780;&#25105;&#20204;&#30340;&#22522;&#20110;&#22330;&#30340;&#29983;&#25104;&#27169;&#22411;&#25429;&#25417;&#20102;&#36825;&#19968;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15864v1 Announce Type: new  Abstract: This work introduces FMG, a field-based model for drug-like molecule generation. We show how the flexibility of this method provides crucial advantages over the prevalent, point-cloud based methods, and achieves competitive molecular stability generation. We tackle optical isomerism (enantiomers), a previously omitted molecular property that is crucial for drug safety and effectiveness, and thus account for all molecular geometry aspects. We demonstrate how previous methods are invariant to a group of transformations that includes enantiomer pairs, leading them invariant to the molecular R and S configurations, while our field-based generative model captures this property.
&lt;/p&gt;</description></item></channel></rss>