<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21152;&#36895;&#35745;&#31639;&#19981;&#21487;&#32422;&#34920;&#31034;&#24352;&#37327;&#31215;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#31561;&#21464;&#25805;&#20316;&#22522;&#30784;&#20174;&#29699;&#24418;&#35856;&#27874;&#25913;&#21464;&#20026;2D&#20613;&#31435;&#21494;&#22522;&#30784;&#65292;&#23454;&#29616;&#20102;&#23545;E(3)&#32676;&#30340;&#31561;&#21464;&#31070;&#32463;&#32593;&#32476;&#30340;&#39640;&#25928;&#24314;&#27169;&#12290;</title><link>http://arxiv.org/abs/2401.10216</link><description>&lt;p&gt;
&#36890;&#36807;Gaunt&#24352;&#37327;&#31215;&#22312;&#20613;&#37324;&#21494;&#22522;&#30784;&#19978;&#23454;&#29616;&#39640;&#25928;&#30340;&#31561;&#21464;&#25805;&#20316;
&lt;/p&gt;
&lt;p&gt;
Enabling Efficient Equivariant Operations in the Fourier Basis via Gaunt Tensor Products. (arXiv:2401.10216v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10216
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21152;&#36895;&#35745;&#31639;&#19981;&#21487;&#32422;&#34920;&#31034;&#24352;&#37327;&#31215;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#31561;&#21464;&#25805;&#20316;&#22522;&#30784;&#20174;&#29699;&#24418;&#35856;&#27874;&#25913;&#21464;&#20026;2D&#20613;&#31435;&#21494;&#22522;&#30784;&#65292;&#23454;&#29616;&#20102;&#23545;E(3)&#32676;&#30340;&#31561;&#21464;&#31070;&#32463;&#32593;&#32476;&#30340;&#39640;&#25928;&#24314;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24314;&#27169;&#29616;&#23454;&#19990;&#30028;&#24212;&#29992;&#20013;&#30340;3D&#25968;&#25454;&#26102;&#65292;&#21457;&#23637;E(3)&#32676;&#30340;&#31561;&#21464;&#31070;&#32463;&#32593;&#32476;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#23454;&#29616;&#36825;&#31181;&#31561;&#21464;&#24615;&#20027;&#35201;&#28041;&#21450;&#21040;&#19981;&#21487;&#32422;&#34920;&#31034;&#65288;irreps&#65289;&#30340;&#24352;&#37327;&#31215;&#12290;&#28982;&#32780;&#65292;&#38543;&#30528;&#20351;&#29992;&#39640;&#38454;&#24352;&#37327;&#65292;&#36825;&#20123;&#25805;&#20316;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#26174;&#33879;&#22686;&#21152;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31995;&#32479;&#30340;&#26041;&#27861;&#26469;&#22823;&#22823;&#21152;&#36895;&#19981;&#21487;&#32422;&#34920;&#31034;&#30340;&#24352;&#37327;&#31215;&#30340;&#35745;&#31639;&#12290;&#25105;&#20204;&#23558;&#24120;&#29992;&#30340;Clebsch-Gordan&#31995;&#25968;&#19982;Gaunt&#31995;&#25968;&#36827;&#34892;&#20102;&#25968;&#23398;&#19978;&#30340;&#36830;&#25509;&#65292;Gaunt&#31995;&#25968;&#26159;&#19977;&#20010;&#29699;&#24418;&#35856;&#27874;&#20056;&#31215;&#30340;&#31215;&#20998;&#12290;&#36890;&#36807;Gaunt&#31995;&#25968;&#65292;&#19981;&#21487;&#32422;&#34920;&#31034;&#30340;&#24352;&#37327;&#31215;&#31561;&#20215;&#20110;&#30001;&#29699;&#24418;&#35856;&#27874;&#34920;&#31034;&#30340;&#29699;&#24418;&#20989;&#25968;&#20043;&#38388;&#30340;&#20056;&#27861;&#12290;&#36825;&#31181;&#35266;&#28857;&#36827;&#19968;&#27493;&#20351;&#25105;&#20204;&#33021;&#22815;&#23558;&#31561;&#21464;&#25805;&#20316;&#30340;&#22522;&#30784;&#20174;&#29699;&#24418;&#35856;&#27874;&#25913;&#21464;&#20026;2D&#20613;&#31435;&#21494;&#22522;&#30784;&#12290;&#22240;&#27492;&#65292;&#29699;&#24418;&#20989;&#25968;&#20043;&#38388;&#30340;&#20056;&#27861;&#21487;&#20197;&#22312;&#20613;&#31435;&#21494;&#22522;&#30784;&#19978;&#36827;&#34892;&#12290;
&lt;/p&gt;
&lt;p&gt;
Developing equivariant neural networks for the E(3) group plays an important role in modeling 3D data across real-world applications. Enforcing this equivariance primarily involves the tensor products of irreducible representations (irreps). However, the computational complexity of such operations increases significantly as higher-order tensors are used. In this work, we propose a systematic approach to substantially accelerate the computation of the tensor products of irreps. We mathematically connect the commonly used Clebsch-Gordan coefficients to the Gaunt coefficients, which are integrals of products of three spherical harmonics. Through Gaunt coefficients, the tensor product of irreps becomes equivalent to the multiplication between spherical functions represented by spherical harmonics. This perspective further allows us to change the basis for the equivariant operations from spherical harmonics to a 2D Fourier basis. Consequently, the multiplication between spherical functions 
&lt;/p&gt;</description></item></channel></rss>