<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#29289;&#29702;&#30693;&#35782;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#31639;&#27861;&#65292;&#36890;&#36807;&#20165;&#20351;&#29992;&#38750;&#20405;&#20837;&#24335;&#24739;&#32773;&#20581;&#24247;&#25968;&#25454;&#35782;&#21035;&#25968;&#23383;&#23402;&#29983;&#20307;&#27169;&#22411;&#21442;&#25968;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#38750;&#20405;&#20837;&#24335;&#21307;&#23398;&#25968;&#23383;&#23402;&#29983;&#20307;&#30340;&#26500;&#24314;&#12290;</title><link>https://arxiv.org/abs/2403.00177</link><description>&lt;p&gt;
&#20351;&#29992;&#29289;&#29702;&#30693;&#35782;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#26500;&#24314;&#38750;&#20405;&#20837;&#24335;&#21307;&#23398;&#25968;&#23383;&#23402;&#29983;&#20307;
&lt;/p&gt;
&lt;p&gt;
Non-Invasive Medical Digital Twins using Physics-Informed Self-Supervised Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00177
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#29289;&#29702;&#30693;&#35782;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#31639;&#27861;&#65292;&#36890;&#36807;&#20165;&#20351;&#29992;&#38750;&#20405;&#20837;&#24335;&#24739;&#32773;&#20581;&#24247;&#25968;&#25454;&#35782;&#21035;&#25968;&#23383;&#23402;&#29983;&#20307;&#27169;&#22411;&#21442;&#25968;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#38750;&#20405;&#20837;&#24335;&#21307;&#23398;&#25968;&#23383;&#23402;&#29983;&#20307;&#30340;&#26500;&#24314;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#20307;&#26159;&#23454;&#29616;&#23454;&#38469;&#29289;&#29702;&#29616;&#35937;&#30340;&#34394;&#25311;&#22797;&#21046;&#21697;&#65292;&#21033;&#29992;&#25968;&#23398;&#24314;&#27169;&#26469;&#34920;&#24449;&#21644;&#27169;&#25311;&#20854;&#23450;&#20041;&#29305;&#24449;&#12290;&#36890;&#36807;&#20026;&#30142;&#30149;&#36807;&#31243;&#26500;&#24314;&#25968;&#23383;&#23402;&#29983;&#20307;&#65292;&#25105;&#20204;&#21487;&#20197;&#36827;&#34892;&#20223;&#30495;&#65292;&#27169;&#25311;&#24739;&#32773;&#22312;&#34394;&#25311;&#29615;&#22659;&#20013;&#30340;&#20581;&#24247;&#29366;&#20917;&#21644;&#22312;&#20551;&#35774;&#24178;&#39044;&#19979;&#30340;&#23545;&#29031;&#32467;&#26524;&#12290;&#36825;&#28040;&#38500;&#20102;&#20405;&#20837;&#24615;&#31243;&#24207;&#25110;&#19981;&#30830;&#23450;&#27835;&#30103;&#20915;&#31574;&#30340;&#38656;&#27714;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20165;&#21033;&#29992;&#38750;&#20405;&#20837;&#24335;&#24739;&#32773;&#20581;&#24247;&#25968;&#25454;&#26469;&#35782;&#21035;&#25968;&#23383;&#23402;&#29983;&#20307;&#27169;&#22411;&#21442;&#25968;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#23558;&#25968;&#23383;&#23402;&#29983;&#20307;&#24314;&#27169;&#30475;&#20316;&#19968;&#20010;&#22797;&#21512;&#36870;&#38382;&#39064;&#65292;&#24182;&#35266;&#23519;&#21040;&#20854;&#32467;&#26500;&#31867;&#20284;&#20110;&#33258;&#30417;&#30563;&#23398;&#20064;&#20013;&#30340;&#39044;&#35757;&#32451;&#21644;&#24494;&#35843;&#12290;&#21033;&#29992;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#29289;&#29702;&#30693;&#35782;&#30340;&#33258;&#30417;&#30563;&#23398;&#20064;&#31639;&#27861;&#65292;&#36825;&#31181;&#31639;&#27861;&#39318;&#20808;&#22312;&#35299;&#20915;&#29289;&#29702;&#27169;&#22411;&#26041;&#31243;&#30340;&#20551;&#23450;&#20219;&#21153;&#19978;&#23545;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#39044;&#35757;&#32451;&#12290;&#38543;&#21518;&#65292;&#35813;&#27169;&#22411;&#34987;&#35757;&#32451;&#20197;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00177v1 Announce Type: new  Abstract: A digital twin is a virtual replica of a real-world physical phenomena that uses mathematical modeling to characterize and simulate its defining features. By constructing digital twins for disease processes, we can perform in-silico simulations that mimic patients' health conditions and counterfactual outcomes under hypothetical interventions in a virtual setting. This eliminates the need for invasive procedures or uncertain treatment decisions. In this paper, we propose a method to identify digital twin model parameters using only noninvasive patient health data. We approach the digital twin modeling as a composite inverse problem, and observe that its structure resembles pretraining and finetuning in self-supervised learning (SSL). Leveraging this, we introduce a physics-informed SSL algorithm that initially pretrains a neural network on the pretext task of solving the physical model equations. Subsequently, the model is trained to rec
&lt;/p&gt;</description></item></channel></rss>