<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36890;&#36807;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;&#20013;&#30340;&#34507;&#30333;&#36136;&#24207;&#21015;-&#32467;&#26500;&#20849;&#35774;&#35745;&#38382;&#39064;&#65292;&#20197;&#29983;&#25104;&#20855;&#26377;&#29702;&#24615;&#32467;&#26500;&#21644;&#33391;&#22909;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#25239;&#20307;&#35774;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.16576</link><description>&lt;p&gt;
&#36890;&#36807;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Antigen-Specific Antibody Design via Direct Energy-based Preference Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16576
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;&#20013;&#30340;&#34507;&#30333;&#36136;&#24207;&#21015;-&#32467;&#26500;&#20849;&#35774;&#35745;&#38382;&#39064;&#65292;&#20197;&#29983;&#25104;&#20855;&#26377;&#29702;&#24615;&#32467;&#26500;&#21644;&#33391;&#22909;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#25239;&#20307;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25239;&#20307;&#35774;&#35745;&#26159;&#19968;&#20010;&#33267;&#20851;&#37325;&#35201;&#30340;&#20219;&#21153;&#65292;&#23545;&#21508;&#31181;&#39046;&#22495;&#37117;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#22914;&#27835;&#30103;&#21644;&#29983;&#29289;&#23398;&#65292;&#30001;&#20110;&#20854;&#38169;&#32508;&#22797;&#26434;&#30340;&#24615;&#36136;&#65292;&#38754;&#20020;&#30528;&#30456;&#24403;&#22823;&#30340;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;&#20316;&#20026;&#19968;&#20010;&#34507;&#30333;&#36136;&#24207;&#21015;-&#32467;&#26500;&#20849;&#35774;&#35745;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#29702;&#24615;&#21644;&#21151;&#33021;&#24615;&#12290;&#21033;&#29992;&#19968;&#20010;&#39044;&#20808;&#35757;&#32451;&#30340;&#26465;&#20214;&#25193;&#25955;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#32852;&#21512;&#24314;&#27169;&#25239;&#20307;&#20013;&#20114;&#34917;&#20915;&#23450;&#21306;&#65288;CDR&#65289;&#30340;&#24207;&#21015;&#21644;&#32467;&#26500;&#65292;&#24182;&#32467;&#21512;&#20102;&#31561;&#21464;&#31070;&#32463;&#32593;&#32476;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#20197;&#24341;&#23548;&#29983;&#25104;&#26082;&#20855;&#26377;&#21512;&#29702;&#32467;&#26500;&#21448;&#20855;&#26377;&#26126;&#26174;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#25239;&#20307;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#28041;&#21450;&#20351;&#29992;&#27531;&#22522;&#32423;&#20998;&#35299;&#33021;&#37327;&#20559;&#22909;&#23545;&#39044;&#20808;&#35757;&#32451;&#30340;&#25193;&#25955;&#27169;&#22411;&#36827;&#34892;&#24494;&#35843;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37319;&#29992;&#26799;&#24230;&#25163;&#26415;&#26469;&#35299;&#20915;&#21508;&#31181;&#31867;&#22411;&#33021;&#37327;&#20043;&#38388;&#30340;&#20914;&#31361;&#65292;&#20363;&#22914;&#21560;&#24341;&#21644;&#26021;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16576v1 Announce Type: cross  Abstract: Antibody design, a crucial task with significant implications across various disciplines such as therapeutics and biology, presents considerable challenges due to its intricate nature. In this paper, we tackle antigen-specific antibody design as a protein sequence-structure co-design problem, considering both rationality and functionality. Leveraging a pre-trained conditional diffusion model that jointly models sequences and structures of complementarity-determining regions (CDR) in antibodies with equivariant neural networks, we propose direct energy-based preference optimization to guide the generation of antibodies with both rational structures and considerable binding affinities to given antigens. Our method involves fine-tuning the pre-trained diffusion model using a residue-level decomposed energy preference. Additionally, we employ gradient surgery to address conflicts between various types of energy, such as attraction and repu
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;Casanovo-DIA&#65292;&#19968;&#31181;&#22522;&#20110;Transformer&#26550;&#26500;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#21487;&#29992;&#20110;&#20174;DIA&#36136;&#35889;&#25968;&#25454;&#20013;&#35299;&#26512;&#32957;&#27573;&#24207;&#21015;&#12290;</title><link>https://arxiv.org/abs/2402.11363</link><description>&lt;p&gt;
&#22522;&#20110;Transformer&#30340;&#20840;&#26032;&#32957;&#27573;&#27979;&#24207;&#25216;&#26415;&#29992;&#20110;&#25968;&#25454;&#26080;&#20559;&#21521;&#37319;&#38598;&#36136;&#35889;
&lt;/p&gt;
&lt;p&gt;
Transformer-based de novo peptide sequencing for data-independent acquisition mass spectrometry
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11363
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;Casanovo-DIA&#65292;&#19968;&#31181;&#22522;&#20110;Transformer&#26550;&#26500;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#21487;&#29992;&#20110;&#20174;DIA&#36136;&#35889;&#25968;&#25454;&#20013;&#35299;&#26512;&#32957;&#27573;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20018;&#32852;&#36136;&#35889;&#65288;MS/MS&#65289;&#20316;&#20026;&#20840;&#38754;&#20998;&#26512;&#29983;&#29289;&#26679;&#26412;&#20013;&#34507;&#30333;&#36136;&#21547;&#37327;&#30340;&#20027;&#35201;&#39640;&#36890;&#37327;&#25216;&#26415;&#65292;&#19968;&#30452;&#26159;&#25512;&#21160;&#34507;&#30333;&#36136;&#32452;&#23398;&#21457;&#23637;&#30340;&#22522;&#30707;&#12290;&#36817;&#24180;&#26469;&#65292;&#22312;&#25968;&#25454;&#26080;&#20559;&#21521;&#37319;&#38598;&#65288;DIA&#65289;&#31574;&#30053;&#26041;&#38754;&#21462;&#24471;&#20102;&#23454;&#36136;&#24615;&#36827;&#23637;&#65292;&#26377;&#21161;&#20110;&#23545;&#21069;&#20307;&#31163;&#23376;&#36827;&#34892;&#20844;&#27491;&#21644;&#38750;&#38774;&#21521;&#30862;&#35010;&#12290;&#30001;&#20110;&#20854;&#22266;&#26377;&#30340;&#39640;&#22810;&#37325;&#24615;&#29305;&#24615;&#65292;DIA&#29983;&#25104;&#30340;MS/MS&#35889;&#22270;&#36896;&#25104;&#20102;&#24040;&#22823;&#38556;&#30861;&#12290;&#27599;&#20010;&#35889;&#22270;&#37117;&#21253;&#21547;&#26469;&#33258;&#22810;&#20010;&#21069;&#20307;&#32957;&#30340;&#30862;&#35010;&#20135;&#29289;&#31163;&#23376;&#12290;&#36825;&#31181;&#22797;&#26434;&#24615;&#29305;&#21035;&#22312;&#20840;&#26032;&#32957;&#27573;/&#34507;&#30333;&#36136;&#27979;&#24207;&#20013;&#26500;&#25104;&#20102;&#19968;&#20010;&#23574;&#38160;&#25361;&#25112;&#65292;&#24403;&#21069;&#26041;&#27861;&#26080;&#27861;&#35299;&#20915;&#22810;&#37325;&#24615;&#38590;&#39064;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;Casanovo-DIA&#65292;&#36825;&#26159;&#19968;&#20010;&#22522;&#20110;Transformer&#26550;&#26500;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#21487;&#20197;&#20174;DIA&#36136;&#35889;&#25968;&#25454;&#20013;&#35299;&#26512;&#32957;&#27573;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11363v1 Announce Type: cross  Abstract: Tandem mass spectrometry (MS/MS) stands as the predominant high-throughput technique for comprehensively analyzing protein content within biological samples. This methodology is a cornerstone driving the advancement of proteomics. In recent years, substantial strides have been made in Data-Independent Acquisition (DIA) strategies, facilitating impartial and non-targeted fragmentation of precursor ions. The DIA-generated MS/MS spectra present a formidable obstacle due to their inherent high multiplexing nature. Each spectrum encapsulates fragmented product ions originating from multiple precursor peptides. This intricacy poses a particularly acute challenge in de novo peptide/protein sequencing, where current methods are ill-equipped to address the multiplexing conundrum. In this paper, we introduce Casanovo-DIA, a deep-learning model based on transformer architecture. It deciphers peptide sequences from DIA mass spectrometry data. Our 
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#32508;&#36848;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#26041;&#27861;&#26469;&#39537;&#21160;AI&#33647;&#29289;&#35774;&#35745;&#65292;&#37325;&#28857;&#20851;&#27880;&#23567;&#20998;&#23376;&#21644;&#34507;&#30333;&#36136;&#29983;&#25104;&#20004;&#20010;&#20027;&#35201;&#20027;&#39064;&#65292;&#20171;&#32461;&#20102;&#21508;&#31181;&#23376;&#20219;&#21153;&#21644;&#24212;&#29992;&#65292;&#24182;&#27604;&#36739;&#20102;&#39030;&#32423;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.08703</link><description>&lt;p&gt;
&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#22312;&#20840;&#26032;&#33647;&#29289;&#35774;&#35745;&#20013;&#30340;&#24212;&#29992;&#27010;&#36848;&#65306;&#20998;&#23376;&#21644;&#34507;&#30333;&#36136;&#29983;&#25104;&#30340;&#26032;&#39046;&#22495;
&lt;/p&gt;
&lt;p&gt;
A Survey of Generative AI for De Novo Drug Design: New Frontiers in Molecule and Protein Generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08703
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#32508;&#36848;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#26041;&#27861;&#26469;&#39537;&#21160;AI&#33647;&#29289;&#35774;&#35745;&#65292;&#37325;&#28857;&#20851;&#27880;&#23567;&#20998;&#23376;&#21644;&#34507;&#30333;&#36136;&#29983;&#25104;&#20004;&#20010;&#20027;&#35201;&#20027;&#39064;&#65292;&#20171;&#32461;&#20102;&#21508;&#31181;&#23376;&#20219;&#21153;&#21644;&#24212;&#29992;&#65292;&#24182;&#27604;&#36739;&#20102;&#39030;&#32423;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#39537;&#21160;&#30340;&#26041;&#27861;&#21487;&#20197;&#26497;&#22823;&#22320;&#25913;&#36827;&#21382;&#26469;&#20195;&#20215;&#39640;&#26114;&#30340;&#33647;&#29289;&#35774;&#35745;&#36807;&#31243;&#65292;&#21508;&#31181;&#29983;&#25104;&#27169;&#22411;&#24050;&#32463;&#22312;&#24191;&#27867;&#20351;&#29992;&#20013;&#12290;&#29305;&#21035;&#26159;&#38024;&#23545;&#20840;&#26032;&#33647;&#29289;&#35774;&#35745;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#19987;&#27880;&#20110;&#20174;&#38646;&#24320;&#22987;&#21019;&#24314;&#26032;&#30340;&#29983;&#29289;&#21270;&#21512;&#29289;&#65292;&#23637;&#31034;&#20102;&#19968;&#20010;&#26377;&#21069;&#26223;&#30340;&#26410;&#26469;&#26041;&#21521;&#12290;&#35813;&#39046;&#22495;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#21152;&#19978;&#33647;&#29289;&#35774;&#35745;&#36807;&#31243;&#30340;&#22266;&#26377;&#22797;&#26434;&#24615;&#65292;&#20026;&#26032;&#30740;&#31350;&#20154;&#21592;&#36827;&#20837;&#21019;&#36896;&#20102;&#19968;&#20010;&#22256;&#38590;&#30340;&#23616;&#38754;&#12290;&#22312;&#36825;&#20221;&#32508;&#36848;&#20013;&#65292;&#25105;&#20204;&#23558;&#20840;&#26032;&#33647;&#29289;&#35774;&#35745;&#20998;&#20026;&#20004;&#20010;&#20027;&#35201;&#20027;&#39064;&#65306;&#23567;&#20998;&#23376;&#21644;&#34507;&#30333;&#36136;&#29983;&#25104;&#12290;&#22312;&#27599;&#20010;&#20027;&#39064;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#21508;&#31181;&#23376;&#20219;&#21153;&#21644;&#24212;&#29992;&#65292;&#37325;&#28857;&#20171;&#32461;&#20102;&#37325;&#35201;&#30340;&#25968;&#25454;&#38598;&#12289;&#22522;&#20934;&#21644;&#27169;&#22411;&#26550;&#26500;&#65292;&#24182;&#23545;&#39030;&#32423;&#27169;&#22411;&#30340;&#24615;&#33021;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#24191;&#20041;&#30340;&#26041;&#27861;&#26469;&#39537;&#21160;AI&#33647;&#29289;&#35774;&#35745;&#65292;&#20801;&#35768;&#22312;&#27599;&#20010;&#23376;&#20219;&#21153;&#20013;&#36827;&#34892;&#21508;&#31181;&#26041;&#27861;&#30340;&#24494;&#35266;&#27604;&#36739;&#21644;&#23439;&#35266;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08703v1 Announce Type: cross Abstract: Artificial intelligence (AI)-driven methods can vastly improve the historically costly drug design process, with various generative models already in widespread use. Generative models for de novo drug design, in particular, focus on the creation of novel biological compounds entirely from scratch, representing a promising future direction. Rapid development in the field, combined with the inherent complexity of the drug design process, creates a difficult landscape for new researchers to enter. In this survey, we organize de novo drug design into two overarching themes: small molecule and protein generation. Within each theme, we identify a variety of subtasks and applications, highlighting important datasets, benchmarks, and model architectures and comparing the performance of top models. We take a broad approach to AI-driven drug design, allowing for both micro-level comparisons of various methods within each subtask and macro-level o
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20934;&#30830;&#39044;&#27979;&#24739;&#32773;&#30340;&#38750;&#20381;&#20174;&#39118;&#38505;&#21644;&#30456;&#20851;&#30340;&#31995;&#32479;&#30151;&#29366;&#35780;&#20998;&#65292;&#20026;&#38271;&#26399;&#36807;&#25935;&#24615;&#40763;&#28814;&#20122;&#21345;&#28608;&#32032;&#30382;&#19979;&#20813;&#30123;&#27835;&#30103;&#30340;&#31649;&#29702;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.11447</link><description>&lt;p&gt;
&#39044;&#27979;&#36807;&#25935;&#24615;&#40763;&#28814;&#20122;&#21345;&#28608;&#32032;&#30382;&#19979;&#20813;&#30123;&#27835;&#30103;&#20013;&#24739;&#32773;&#20381;&#20174;&#24615;&#30340;&#24207;&#21015;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Sequential Model for Predicting Patient Adherence in Subcutaneous Immunotherapy for Allergic Rhinitis. (arXiv:2401.11447v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11447
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20934;&#30830;&#39044;&#27979;&#24739;&#32773;&#30340;&#38750;&#20381;&#20174;&#39118;&#38505;&#21644;&#30456;&#20851;&#30340;&#31995;&#32479;&#30151;&#29366;&#35780;&#20998;&#65292;&#20026;&#38271;&#26399;&#36807;&#25935;&#24615;&#40763;&#28814;&#20122;&#21345;&#28608;&#32032;&#30382;&#19979;&#20813;&#30123;&#27835;&#30103;&#30340;&#31649;&#29702;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#26631;&#65306;&#30382;&#19979;&#20813;&#30123;&#27835;&#30103;(SCIT)&#26159;&#36807;&#25935;&#24615;&#40763;&#28814;&#30340;&#38271;&#25928;&#22240;&#26524;&#27835;&#30103;&#12290;&#22914;&#20309;&#25552;&#39640;&#24739;&#32773;&#23545;&#21464;&#24212;&#21407;&#20813;&#30123;&#27835;&#30103;(AIT)&#30340;&#20381;&#20174;&#24615;&#20197;&#26368;&#22823;&#21270;&#27835;&#30103;&#25928;&#26524;&#65292;&#22312;AIT&#31649;&#29702;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#21033;&#29992;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20934;&#30830;&#39044;&#27979;&#24739;&#32773;&#30340;&#38750;&#20381;&#20174;&#39118;&#38505;&#21644;&#30456;&#20851;&#30340;&#31995;&#32479;&#30151;&#29366;&#35780;&#20998;&#65292;&#20026;&#38271;&#26399;AIT&#30340;&#31649;&#29702;&#25552;&#20379;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#12290;&#26041;&#27861;&#65306;&#26412;&#30740;&#31350;&#24320;&#21457;&#21644;&#20998;&#26512;&#20102;&#20004;&#31181;&#27169;&#22411;&#65292;&#24207;&#21015;&#28508;&#22312;&#34892;&#20026;&#32773;-&#35780;&#35770;&#23478;&#27169;&#22411;(SLAC)&#21644;&#38271;&#30701;&#26399;&#35760;&#24518;&#27169;&#22411;(LSTM)&#65292;&#24182;&#22522;&#20110;&#35780;&#20998;&#21644;&#20381;&#20174;&#24615;&#39044;&#27979;&#33021;&#21147;&#36827;&#34892;&#35780;&#20272;&#12290;&#32467;&#26524;&#65306;&#22312;&#25490;&#38500;&#31532;&#19968;&#26102;&#38388;&#27493;&#30340;&#20559;&#20506;&#26679;&#26412;&#21518;&#65292;SLAC&#27169;&#22411;&#30340;&#39044;&#27979;&#20381;&#20174;&#20934;&#30830;&#29575;&#20026;60%-72%&#65292;&#32780;LSTM&#27169;&#22411;&#30340;&#20934;&#30830;&#29575;&#20026;66%-84%&#65292;&#26681;&#25454;&#26102;&#38388;&#27493;&#38271;&#30340;&#19981;&#21516;&#32780;&#21464;&#21270;&#12290;SLAC&#27169;&#22411;&#30340;&#22343;&#26041;&#26681;&#35823;&#24046;(RMSE)&#33539;&#22260;&#22312;0.93&#21040;2.22&#20043;&#38388;&#65292;&#32780;LSTM&#27169;&#22411;&#30340;RMSE&#33539;&#22260;&#22312;...
&lt;/p&gt;
&lt;p&gt;
Objective: Subcutaneous Immunotherapy (SCIT) is the long-lasting causal treatment of allergic rhinitis. How to enhance the adherence of patients to maximize the benefit of allergen immunotherapy (AIT) plays a crucial role in the management of AIT. This study aims to leverage novel machine learning models to precisely predict the risk of non-adherence of patients and related systematic symptom scores, to provide a novel approach in the management of long-term AIT.  Methods: The research develops and analyzes two models, Sequential Latent Actor-Critic (SLAC) and Long Short-Term Memory (LSTM), evaluating them based on scoring and adherence prediction capabilities.  Results: Excluding the biased samples at the first time step, the predictive adherence accuracy of the SLAC models is from $60\,\%$ to $72\%$, and for LSTM models, it is $66\,\%$ to $84\,\%$, varying according to the time steps. The range of Root Mean Square Error (RMSE) for SLAC models is between $0.93$ and $2.22$, while for L
&lt;/p&gt;</description></item></channel></rss>