<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#22522;&#22240;&#24341;&#23548;GFlowNet (Genetic GFN) &#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#38598;&#25104;&#36845;&#20195;&#36951;&#20256;&#25628;&#32034;&#21644;&#35757;&#32451;&#31574;&#30053;&#65292;&#35813;&#26041;&#27861;&#22312;&#23454;&#38469;&#20998;&#23376;&#20248;&#21270;&#22522;&#20934;&#27979;&#35797;&#20013;&#21462;&#24471;&#20102;16.213&#30340;&#26368;&#26032;&#24471;&#20998;&#65292;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#26368;&#20339;&#24471;&#20998;15.185&#65292;&#21516;&#26102;&#22312;14&#20010;&#20219;&#21153;&#20013;&#36229;&#36234;&#20102;&#25152;&#26377;&#23545;&#27604;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.05961</link><description>&lt;p&gt;
&#22522;&#22240;&#24341;&#23548;GFlowNets&#65306;&#22312;&#23454;&#38469;&#20998;&#23376;&#20248;&#21270;&#22522;&#20934;&#26041;&#38754;&#30340;&#36827;&#23637;
&lt;/p&gt;
&lt;p&gt;
Genetic-guided GFlowNets: Advancing in Practical Molecular Optimization Benchmark
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05961
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#22522;&#22240;&#24341;&#23548;GFlowNet (Genetic GFN) &#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#38598;&#25104;&#36845;&#20195;&#36951;&#20256;&#25628;&#32034;&#21644;&#35757;&#32451;&#31574;&#30053;&#65292;&#35813;&#26041;&#27861;&#22312;&#23454;&#38469;&#20998;&#23376;&#20248;&#21270;&#22522;&#20934;&#27979;&#35797;&#20013;&#21462;&#24471;&#20102;16.213&#30340;&#26368;&#26032;&#24471;&#20998;&#65292;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#26368;&#20339;&#24471;&#20998;15.185&#65292;&#21516;&#26102;&#22312;14&#20010;&#20219;&#21153;&#20013;&#36229;&#36234;&#20102;&#25152;&#26377;&#23545;&#27604;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;GFlowNet&#21464;&#20307;&#65292;&#21363;&#22522;&#22240;&#24341;&#23548;GFlowNet (Genetic GFN)&#65292;&#23427;&#23558;&#36845;&#20195;&#36951;&#20256;&#25628;&#32034;&#38598;&#25104;&#21040;GFlowNet&#20013;&#12290;&#36951;&#20256;&#25628;&#32034;&#26377;&#25928;&#22320;&#24341;&#23548;GFlowNet&#36827;&#20837;&#39640;&#22238;&#25253;&#21306;&#22495;&#65292;&#35299;&#20915;&#20102;&#20840;&#23616;&#36807;&#24230;&#25506;&#32034;&#23548;&#33268;&#30340;&#35757;&#32451;&#25928;&#29575;&#20302;&#19979;&#21644;&#25506;&#32034;&#26377;&#38480;&#21306;&#22495;&#30340;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#36824;&#24341;&#20837;&#20102;&#35757;&#32451;&#31574;&#30053;&#65292;&#22914;&#22522;&#20110;&#25490;&#21517;&#30340;&#37325;&#25918;&#35757;&#32451;&#21644;&#26080;&#30417;&#30563;&#26368;&#22823;&#20284;&#28982;&#39044;&#35757;&#32451;&#65292;&#20197;&#25552;&#39640;&#22522;&#22240;&#24341;&#23548;GFlowNet&#30340;&#26679;&#26412;&#25928;&#29575;&#12290;&#35813;&#26041;&#27861;&#22312;&#23454;&#38469;&#20998;&#23376;&#20248;&#21270; (PMO) &#39046;&#22495;&#30340;&#23448;&#26041;&#22522;&#20934;&#27979;&#35797;&#20013;&#26174;&#31034;&#20102;16.213&#30340;&#26368;&#26032;&#24471;&#20998;&#65292;&#26126;&#26174;&#20248;&#20110;&#22522;&#20934;&#27979;&#35797;&#20013;&#25253;&#21578;&#30340;&#26368;&#20339;&#24471;&#20998;15.185&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;23&#20010;&#20219;&#21153;&#20013;&#30340;14&#20010;&#20219;&#21153;&#20013;&#36229;&#36807;&#20102;&#25152;&#26377;&#23545;&#27604;&#26041;&#27861;&#65292;&#21253;&#25324;&#24378;&#21270;&#23398;&#20064;&#65292;&#36125;&#21494;&#26031;&#20248;&#21270;&#65292;&#29983;&#25104;&#27169;&#22411;&#65292;GFlowNets&#21644;&#36951;&#20256;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a novel variant of GFlowNet, genetic-guided GFlowNet (Genetic GFN), which integrates an iterative genetic search into GFlowNet. Genetic search effectively guides the GFlowNet to high-rewarded regions, addressing global over-exploration that results in training inefficiency and exploring limited regions. In addition, training strategies, such as rank-based replay training and unsupervised maximum likelihood pre-training, are further introduced to improve the sample efficiency of Genetic GFN. The proposed method shows a state-of-the-art score of 16.213, significantly outperforming the reported best score in the benchmark of 15.185, in practical molecular optimization (PMO), which is an official benchmark for sample-efficient molecular optimization. Remarkably, ours exceeds all baselines, including reinforcement learning, Bayesian optimization, generative models, GFlowNets, and genetic algorithms, in 14 out of 23 tasks.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Bridge&#30340;&#27169;&#22411;&#65292;&#33268;&#21147;&#20110;&#35299;&#20915;&#21033;&#29992;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#21253;&#25324;&#22522;&#22240;&#32452;&#26495;&#22359;&#30340;&#21464;&#21270;&#12289;&#27979;&#24207;&#25216;&#26415;&#30340;&#24046;&#24322;&#20197;&#21450;&#25968;&#25454;&#30340;&#39640;&#32500;&#24230;&#21644;&#31232;&#30095;&#24615;&#31561;&#12290;</title><link>https://arxiv.org/abs/2402.00077</link><description>&lt;p&gt;
&#22810;&#26426;&#26500;&#25968;&#25454;&#30340;&#37322;&#25918;&#21147;&#37327;&#65306;&#25972;&#21512;&#21644;&#21327;&#35843;&#36328;&#26426;&#26500;&#30340;&#22522;&#22240;&#32452;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Unlocking the Power of Multi-institutional Data: Integrating and Harmonizing Genomic Data Across Institutions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00077
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Bridge&#30340;&#27169;&#22411;&#65292;&#33268;&#21147;&#20110;&#35299;&#20915;&#21033;&#29992;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#21253;&#25324;&#22522;&#22240;&#32452;&#26495;&#22359;&#30340;&#21464;&#21270;&#12289;&#27979;&#24207;&#25216;&#26415;&#30340;&#24046;&#24322;&#20197;&#21450;&#25968;&#25454;&#30340;&#39640;&#32500;&#24230;&#21644;&#31232;&#30095;&#24615;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30284;&#30151;&#26159;&#30001;&#22522;&#22240;&#31361;&#21464;&#39537;&#21160;&#30340;&#22797;&#26434;&#30142;&#30149;&#65292;&#32959;&#30244;&#27979;&#24207;&#24050;&#25104;&#20026;&#30284;&#30151;&#24739;&#32773;&#20020;&#24202;&#25252;&#29702;&#30340;&#37325;&#35201;&#25163;&#27573;&#12290;&#20986;&#29616;&#30340;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#20026;&#23398;&#20064;&#30495;&#23454;&#19990;&#30028;&#30340;&#35777;&#25454;&#20197;&#22686;&#24378;&#31934;&#20934;&#32959;&#30244;&#21307;&#23398;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#36164;&#28304;&#12290;&#30001;&#32654;&#22269;&#30284;&#30151;&#30740;&#31350;&#21327;&#20250;&#39046;&#23548;&#30340;GENIE BPC&#24314;&#31435;&#20102;&#19968;&#20010;&#29420;&#29305;&#30340;&#25968;&#25454;&#24211;&#65292;&#23558;&#22522;&#22240;&#32452;&#25968;&#25454;&#19982;&#22810;&#20010;&#30284;&#30151;&#20013;&#24515;&#30340;&#20020;&#24202;&#20449;&#24687;&#32852;&#31995;&#36215;&#26469;&#12290;&#28982;&#32780;&#65292;&#21033;&#29992;&#36825;&#31181;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#38754;&#20020;&#30528;&#37325;&#22823;&#25361;&#25112;&#12290;&#22522;&#22240;&#32452;&#26495;&#22359;&#30340;&#21464;&#21270;&#23548;&#33268;&#22312;&#20351;&#29992;&#24120;&#35265;&#22522;&#22240;&#38598;&#36827;&#34892;&#20998;&#26512;&#26102;&#20449;&#24687;&#20002;&#22833;&#12290;&#27492;&#22806;&#65292;&#19981;&#21516;&#30340;&#27979;&#24207;&#25216;&#26415;&#21644;&#26426;&#26500;&#20043;&#38388;&#30340;&#24739;&#32773;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#22797;&#26434;&#24615;&#12290;&#39640;&#32500;&#25968;&#25454;&#12289;&#31232;&#30095;&#22522;&#22240;&#31361;&#21464;&#27169;&#24335;&#20197;&#21450;&#20010;&#20307;&#22522;&#22240;&#27700;&#24179;&#19978;&#30340;&#24369;&#20449;&#21495;&#36827;&#19968;&#27493;&#22686;&#21152;&#20102;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#12290;&#22312;&#36825;&#20123;&#29616;&#23454;&#19990;&#30028;&#30340;&#25361;&#25112;&#30340;&#25512;&#21160;&#19979;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Bridge&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cancer is a complex disease driven by genomic alterations, and tumor sequencing is becoming a mainstay of clinical care for cancer patients. The emergence of multi-institution sequencing data presents a powerful resource for learning real-world evidence to enhance precision oncology. GENIE BPC, led by the American Association for Cancer Research, establishes a unique database linking genomic data with clinical information for patients treated at multiple cancer centers. However, leveraging such multi-institutional sequencing data presents significant challenges. Variations in gene panels result in loss of information when the analysis is conducted on common gene sets. Additionally, differences in sequencing techniques and patient heterogeneity across institutions add complexity. High data dimensionality, sparse gene mutation patterns, and weak signals at the individual gene level further complicate matters. Motivated by these real-world challenges, we introduce the Bridge model. It use
&lt;/p&gt;</description></item></channel></rss>