<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>CausalBench&#25361;&#25112;&#36187;&#26159;&#19968;&#20010;&#26426;&#22120;&#23398;&#20064;&#31454;&#36187;&#65292;&#26088;&#22312;&#26500;&#24314;&#22522;&#22240;&#32593;&#32476;&#25512;&#26029;&#30340;&#26368;&#26032;&#26041;&#27861;&#12290;&#21442;&#19982;&#32773;&#21033;&#29992;&#22823;&#35268;&#27169;&#36951;&#20256;&#24178;&#25200;&#25968;&#25454;&#25552;&#21319;&#20102;&#20808;&#36827;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2308.15395</link><description>&lt;p&gt;
CausalBench&#25361;&#25112;&#36187;&#65306;&#22522;&#20110;&#21333;&#32454;&#32990;&#24178;&#25200;&#25968;&#25454;&#30340;&#22522;&#22240;&#32593;&#32476;&#25512;&#26029;&#30340;&#26426;&#22120;&#23398;&#20064;&#31454;&#36187;
&lt;/p&gt;
&lt;p&gt;
The CausalBench challenge: A machine learning contest for gene network inference from single-cell perturbation data. (arXiv:2308.15395v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15395
&lt;/p&gt;
&lt;p&gt;
CausalBench&#25361;&#25112;&#36187;&#26159;&#19968;&#20010;&#26426;&#22120;&#23398;&#20064;&#31454;&#36187;&#65292;&#26088;&#22312;&#26500;&#24314;&#22522;&#22240;&#32593;&#32476;&#25512;&#26029;&#30340;&#26368;&#26032;&#26041;&#27861;&#12290;&#21442;&#19982;&#32773;&#21033;&#29992;&#22823;&#35268;&#27169;&#36951;&#20256;&#24178;&#25200;&#25968;&#25454;&#25552;&#21319;&#20102;&#20808;&#36827;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#33647;&#29289;&#21457;&#29616;&#20013;&#65292;&#32472;&#21046;&#32454;&#32990;&#31995;&#32479;&#20869;&#22522;&#22240;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#20851;&#31995;&#26159;&#20851;&#38190;&#30340;&#26089;&#26399;&#27493;&#39588;&#12290;&#36825;&#26377;&#21161;&#20110;&#21046;&#23450;&#20851;&#20110;&#21487;&#33021;&#34987;&#26410;&#26469;&#33647;&#29289;&#38774;&#21521;&#30340;&#20998;&#23376;&#26426;&#21046;&#30340;&#20551;&#35774;&#12290;CausalBench&#25361;&#25112;&#26159;&#19968;&#39033;&#36992;&#35831;&#26426;&#22120;&#23398;&#20064;&#31038;&#21306;&#26469;&#25512;&#36827;&#26500;&#24314;&#22522;&#22240;-&#22522;&#22240;&#30456;&#20114;&#20316;&#29992;&#32593;&#32476;&#30340;&#26368;&#26032;&#25216;&#26415;&#30340;&#20513;&#35758;&#12290;&#36825;&#20123;&#32593;&#32476;&#26159;&#20174;&#22823;&#35268;&#27169;&#30495;&#23454;&#19990;&#30028;&#30340;&#21333;&#32454;&#32990;&#25968;&#25454;&#38598;&#20013;&#25512;&#23548;&#20986;&#26469;&#30340;&#65292;&#36825;&#20123;&#25968;&#25454;&#38598;&#32463;&#36807;&#19981;&#21516;&#31867;&#22411;&#30340;&#24178;&#25200;&#12290;&#36825;&#20123;&#32593;&#32476;&#23545;&#20110;&#29702;&#35299;&#30142;&#30149;&#29983;&#29289;&#23398;&#30340;&#22240;&#26524;&#26426;&#21046;&#33267;&#20851;&#37325;&#35201;&#12290;&#21442;&#19982;&#32773;&#21033;&#29992;CausalBench&#22522;&#20934;&#27979;&#35797;&#26694;&#26550;&#65292;&#20219;&#21153;&#26159;&#25552;&#21319;&#20808;&#36827;&#26041;&#27861;&#21033;&#29992;&#22823;&#35268;&#27169;&#36951;&#20256;&#24178;&#25200;&#25968;&#25454;&#30340;&#33021;&#21147;&#12290;&#26412;&#25253;&#21578;&#20998;&#26512;&#21644;&#24635;&#32467;&#20102;&#25361;&#25112;&#36187;&#26399;&#38388;&#25552;&#20132;&#30340;&#26041;&#27861;&#65292;&#20197;&#25551;&#32472;&#31454;&#36187;&#26399;&#38388;&#25216;&#26415;&#21457;&#23637;&#30340;&#37096;&#20998;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
In drug discovery, mapping interactions between genes within cellular systems is a crucial early step. This helps formulate hypotheses regarding molecular mechanisms that could potentially be targeted by future medicines. The CausalBench Challenge was an initiative to invite the machine learning community to advance the state of the art in constructing gene-gene interaction networks. These networks, derived from large-scale, real-world datasets of single cells under various perturbations, are crucial for understanding the causal mechanisms underlying disease biology. Using the framework provided by the CausalBench benchmark, participants were tasked with enhancing the capacity of the state of the art methods to leverage large-scale genetic perturbation data. This report provides an analysis and summary of the methods submitted during the challenge to give a partial image of the state of the art at the time of the challenge. The winning solutions significantly improved performance compa
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20197;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#20998;&#26512;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#20013;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#22797;&#26434;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.03340</link><description>&lt;p&gt;
&#23450;&#21521;&#28436;&#21270;&#21644;&#29983;&#24577;&#36827;&#21270;&#21160;&#21147;&#23398;&#30340;&#29983;&#29289;&#29289;&#29702;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Biophysical Cybernetics of Directed Evolution and Eco-evolutionary Dynamics. (arXiv:2305.03340v1 [q-bio.PE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03340
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20197;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#20998;&#26512;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#20013;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#22797;&#26434;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36827;&#21270;&#21160;&#21147;&#23398;&#20013;&#30340;&#35768;&#22810;&#37325;&#35201;&#38382;&#39064;&#21487;&#20197;&#22312;&#21338;&#24328;&#29702;&#35770;&#32972;&#26223;&#19979;&#20197;&#38543;&#26426;&#36712;&#36857;&#20998;&#26512;&#30340;&#26041;&#24335;&#26377;&#24847;&#20041;&#22320;&#26144;&#23556;&#21040;&#20998;&#26512;&#20013;&#12290;&#36890;&#24120;&#30340;&#26041;&#27861;&#26159;&#20998;&#26512;&#23569;&#37327;&#19981;&#21516;&#30340;&#32676;&#20307;&#21644;/&#25110;&#20551;&#35774;&#21160;&#21147;&#23398;&#21457;&#29983;&#22312;&#20154;&#21475;&#35268;&#27169;&#22823;&#21040;&#36275;&#20197;&#20351;&#30830;&#23450;&#24615;&#36712;&#36857;&#25104;&#20026;&#29616;&#23454;&#30340;&#21306;&#22495;&#12290;&#34987;&#31216;&#20026;&#8220;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#8221;&#30340;&#29983;&#24577;&#22240;&#32032;&#30340;&#28155;&#21152;&#36827;&#19968;&#27493;&#22797;&#26434;&#21270;&#20102;&#21160;&#21147;&#23398;&#65292;&#24182;&#23548;&#33268;&#35768;&#22810;&#38382;&#39064;&#38590;&#20197;&#22788;&#29702;&#25110;&#24403;&#21069;&#30340;&#29702;&#35770;&#26041;&#27861;&#38590;&#20197;&#23454;&#38469;&#24212;&#29992;&#12290;&#20294;&#26159;&#65292;&#19968;&#31181;&#31867;&#20284;&#20294;&#26410;&#34987;&#20805;&#20998;&#25506;&#35752;&#30340;&#26041;&#27861;&#26159;&#23558;&#37325;&#28857;&#25918;&#22312;&#27169;&#22411;&#26412;&#36523;&#30340;&#19981;&#30830;&#23450;&#24615;&#19978;&#65292;&#20381;&#25454;&#24378;&#21270;&#23398;&#20064;&#39046;&#22495;&#21644;&#30456;&#37051;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#30340;&#35821;&#35328;&#65292;&#32780;&#34987;&#31216;&#20026;&#8220;&#37096;&#20998;&#21487;&#35266;&#23519;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#8221;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#23545;&#20598;&#24615;&#65292;&#23558;&#21516;&#26102;&#32771;&#34385;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#30340;&#22797;&#26434;&#24615;&#26144;&#23556;&#21040;&#19968;&#20010;&#26032;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many major questions in the theory of evolutionary dynamics can in a meaningful sense be mapped to analyses of stochastic trajectories in game theoretic contexts. Often the approach is to analyze small numbers of distinct populations and/or to assume dynamics occur within a regime of population sizes large enough that deterministic trajectories are an excellent approximation of reality. The addition of ecological factors, termed "eco-evolutionary dynamics", further complicates the dynamics and results in many problems which are intractable or impractically messy for current theoretical methods. However, an analogous but underexplored approach is to analyze these systems with an eye primarily towards uncertainty in the models themselves. In the language of researchers in Reinforcement Learning and adjacent fields, a Partially Observable Markov Process. Here we introduce a duality which maps the complexity of accounting for both ecology and individual genotypic/phenotypic types onto a pr
&lt;/p&gt;</description></item></channel></rss>