<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21363;&#22810;&#32423;&#22810;&#27169;&#24577;&#23545;&#40784;&#65288;K-M3AID&#65289;&#65292;&#36890;&#36807;&#22312;&#20998;&#23376;&#22270;&#21644;NMR&#20809;&#35889;&#20043;&#38388;&#24314;&#31435;&#23545;&#24212;&#20851;&#31995;&#65292;&#37319;&#29992;&#30693;&#35782;&#24341;&#23548;&#30340;&#23454;&#20363;&#32423;&#23545;&#27604;&#23398;&#20064;&#65292;&#20197;&#35299;&#20915;&#20998;&#23376;&#26816;&#32034;&#12289;&#24322;&#26500;&#20307;&#35782;&#21035;&#21644;&#23792;&#24402;&#23646;&#31561;&#20219;&#21153;&#20013;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2311.13817</link><description>&lt;p&gt;
&#20998;&#23376;&#37492;&#23450;&#19982;&#23792;&#24402;&#23646;&#65306;&#22312;NMR&#19978;&#21033;&#29992;&#22810;&#32423;&#22810;&#27169;&#24577;&#23545;&#40784;
&lt;/p&gt;
&lt;p&gt;
Molecular Identification and Peak Assignment: Leveraging Multi-Level Multimodal Alignment on NMR
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.13817
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21363;&#22810;&#32423;&#22810;&#27169;&#24577;&#23545;&#40784;&#65288;K-M3AID&#65289;&#65292;&#36890;&#36807;&#22312;&#20998;&#23376;&#22270;&#21644;NMR&#20809;&#35889;&#20043;&#38388;&#24314;&#31435;&#23545;&#24212;&#20851;&#31995;&#65292;&#37319;&#29992;&#30693;&#35782;&#24341;&#23548;&#30340;&#23454;&#20363;&#32423;&#23545;&#27604;&#23398;&#20064;&#65292;&#20197;&#35299;&#20915;&#20998;&#23376;&#26816;&#32034;&#12289;&#24322;&#26500;&#20307;&#35782;&#21035;&#21644;&#23792;&#24402;&#23646;&#31561;&#20219;&#21153;&#20013;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2311.13817v2 &#20844;&#21578;&#31867;&#22411;&#65306;&#26367;&#25442; &#25688;&#35201;&#65306;&#26680;&#30913;&#20849;&#25391;&#65288;NMR&#65289;&#20809;&#35889;&#22312;&#35299;&#35835;&#20998;&#23376;&#32467;&#26500;&#21644;&#21160;&#24577;&#34892;&#20026;&#26041;&#38754;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#34429;&#28982;&#22522;&#20110;AI&#30340;NMR&#39044;&#27979;&#27169;&#22411;&#20855;&#26377;&#28508;&#21147;&#65292;&#20294;&#22312;&#20998;&#23376;&#26816;&#32034;&#12289;&#24322;&#26500;&#20307;&#35782;&#21035;&#21644;&#23792;&#24402;&#23646;&#31561;&#20219;&#21153;&#20013;&#20173;&#28982;&#23384;&#22312;&#25361;&#25112;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21363;&#20855;&#26377;&#30693;&#35782;&#24341;&#23548;&#30340;&#23454;&#20363;&#32423;&#23545;&#40784;&#30340;&#22810;&#32423;&#22810;&#27169;&#24577;&#23545;&#40784;&#65288;K-M3AID&#65289;&#65292;&#35813;&#35299;&#20915;&#26041;&#26696;&#22312;&#20004;&#31181;&#24322;&#36136;&#27169;&#24577;&#20043;&#38388;&#24314;&#31435;&#23545;&#24212;&#20851;&#31995;&#65306;&#20998;&#23376;&#22270;&#21644;NMR&#20809;&#35889;&#12290;K-M3AID&#37319;&#29992;&#20102;&#19968;&#20010;&#21452;&#21327;&#35843;&#23545;&#27604;&#23398;&#20064;&#26550;&#26500;&#65292;&#21253;&#21547;&#19977;&#20010;&#20851;&#38190;&#27169;&#22359;&#65306;&#22270;&#32423;&#23545;&#40784;&#27169;&#22359;&#12289;&#33410;&#28857;&#32423;&#23545;&#40784;&#27169;&#22359;&#21644;&#36890;&#20449;&#36890;&#36947;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#22312;&#33410;&#28857;&#32423;&#23545;&#40784;&#27169;&#22359;&#20013;&#65292;K-M3AID&#24341;&#20837;&#20102;&#30693;&#35782;&#24341;&#23548;&#30340;&#23454;&#20363;&#32423;&#23545;&#27604;&#23398;&#20064;&#12290;&#27492;&#22806;&#65292;K-M3AID&#34920;&#26126;&#22312;&#33410;&#28857;&#32423;&#23545;&#40784;&#36807;&#31243;&#20013;&#33719;&#24471;&#30340;&#25216;&#33021;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.13817v2 Announce Type: replace  Abstract: Nuclear magnetic resonance (NMR) spectroscopy plays an essential role in deciphering molecular structure and dynamic behaviors. While AI-enhanced NMR prediction models hold promise, challenges still persist in tasks such as molecular retrieval, isomer recognition, and peak assignment. In response, this paper introduces a novel solution, Multi-Level Multimodal Alignment with Knowledge-Guided Instance-Wise Discrimination (K-M3AID), which establishes correspondences between two heterogeneous modalities: molecular graphs and NMR spectra. K-M3AID employs a dual-coordinated contrastive learning architecture with three key modules: a graph-level alignment module, a node-level alignment module, and a communication channel. Notably, K-M3AID introduces knowledge-guided instance-wise discrimination into contrastive learning within the node-level alignment module. In addition, K-M3AID demonstrates that skills acquired during node-level alignment
&lt;/p&gt;</description></item></channel></rss>