<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;Grover&#21644;Deutsch-Josza&#31561;&#22522;&#30784;&#37327;&#23376;&#31639;&#27861;&#65292;&#36890;&#36807;&#19968;&#32452;&#31934;&#24515;&#26500;&#24314;&#30340;&#26465;&#20214;&#65292;&#25512;&#26029;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#22312;&#19968;&#27573;&#26102;&#38388;&#20869;&#26159;&#21542;&#20855;&#26377;&#32487;&#32493;&#32500;&#25345;&#21160;&#24577;&#27963;&#21160;&#30340;&#28508;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.18963</link><description>&lt;p&gt;
&#20351;&#29992;&#37327;&#23376;&#35745;&#31639;&#25512;&#26029;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#30340;&#21160;&#24577;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Using Quantum Computing to Infer Dynamic Behaviors of Biological and Artificial Neural Networks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18963
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;Grover&#21644;Deutsch-Josza&#31561;&#22522;&#30784;&#37327;&#23376;&#31639;&#27861;&#65292;&#36890;&#36807;&#19968;&#32452;&#31934;&#24515;&#26500;&#24314;&#30340;&#26465;&#20214;&#65292;&#25512;&#26029;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#22312;&#19968;&#27573;&#26102;&#38388;&#20869;&#26159;&#21542;&#20855;&#26377;&#32487;&#32493;&#32500;&#25345;&#21160;&#24577;&#27963;&#21160;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26032;&#38382;&#39064;&#31867;&#21035;&#30340;&#25506;&#32034;&#26159;&#37327;&#23376;&#35745;&#31639;&#30740;&#31350;&#30340;&#19968;&#20010;&#27963;&#36291;&#39046;&#22495;&#12290;&#19968;&#20010;&#22522;&#26412;&#19978;&#23436;&#20840;&#26410;&#34987;&#25506;&#35752;&#30340;&#20027;&#39064;&#26159;&#20351;&#29992;&#37327;&#23376;&#31639;&#27861;&#21644;&#35745;&#31639;&#26469;&#25506;&#32034;&#21644;&#35810;&#38382;&#31070;&#32463;&#32593;&#32476;&#30340;&#21151;&#33021;&#21160;&#24577;&#12290;&#36825;&#26159;&#23558;&#37327;&#23376;&#35745;&#31639;&#24212;&#29992;&#20110;&#29983;&#29289;&#21644;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#24314;&#27169;&#21644;&#20223;&#30495;&#30340;&#23578;&#26410;&#25104;&#29087;&#30340;&#20027;&#39064;&#30340;&#19968;&#20010;&#32452;&#25104;&#37096;&#20998;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#31934;&#24515;&#26500;&#24314;&#30340;&#19968;&#32452;&#26465;&#20214;&#26469;&#20351;&#29992;&#20004;&#20010;&#22522;&#30784;&#37327;&#23376;&#31639;&#27861;&#65292;Grover&#21644;Deutsch-Josza&#65292;&#20197;&#20351;&#36755;&#20986;&#27979;&#37327;&#20855;&#26377;&#19968;&#31181;&#35299;&#37322;&#65292;&#20445;&#35777;&#25105;&#20204;&#33021;&#22815;&#25512;&#26029;&#19968;&#20010;&#31616;&#21333;&#30340;&#31070;&#32463;&#32593;&#32476;&#34920;&#31034;&#65288;&#36866;&#29992;&#20110;&#29983;&#29289;&#21644;&#20154;&#24037;&#32593;&#32476;&#65289;&#22312;&#19968;&#27573;&#26102;&#38388;&#21518;&#26159;&#21542;&#26377;&#21487;&#33021;&#32487;&#32493;&#32500;&#25345;&#21160;&#24577;&#27963;&#21160;&#12290;&#25110;&#32773;&#36825;&#20123;&#21160;&#24577;&#20445;&#35777;&#20250;&#20572;&#27490;&#65292;&#35201;&#20040;&#26159;&#36890;&#36807;'&#30315;&#30187;'&#21160;&#24577;&#65292;&#35201;&#20040;&#26159;&#38745;&#27490;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18963v1 Announce Type: cross  Abstract: The exploration of new problem classes for quantum computation is an active area of research. An essentially completely unexplored topic is the use of quantum algorithms and computing to explore and ask questions \textit{about} the functional dynamics of neural networks. This is a component of the still-nascent topic of applying quantum computing to the modeling and simulations of biological and artificial neural networks. In this work, we show how a carefully constructed set of conditions can use two foundational quantum algorithms, Grover and Deutsch-Josza, in such a way that the output measurements admit an interpretation that guarantees we can infer if a simple representation of a neural network (which applies to both biological and artificial networks) after some period of time has the potential to continue sustaining dynamic activity. Or whether the dynamics are guaranteed to stop either through 'epileptic' dynamics or quiescence
&lt;/p&gt;</description></item></channel></rss>