<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>&#29992;&#20110;&#20998;&#23376;&#23646;&#24615;&#39044;&#27979;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#36890;&#24120;&#26080;&#27861;&#37327;&#21270;&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;AutoGNNUQ&#65292;&#36890;&#36807;&#26550;&#26500;&#25628;&#32034;&#29983;&#25104;&#39640;&#24615;&#33021;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#38598;&#21512;&#65292;&#24182;&#21033;&#29992;&#26041;&#24046;&#20998;&#35299;&#23558;&#25968;&#25454;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#20998;&#24320;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#20943;&#23569;&#19981;&#30830;&#23450;&#24615;&#30340;&#26377;&#20215;&#20540;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2307.10438</link><description>&lt;p&gt;
&#29992;&#22270;&#31070;&#32463;&#32467;&#26500;&#25628;&#32034;&#36827;&#34892;&#20998;&#23376;&#23646;&#24615;&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Uncertainty Quantification for Molecular Property Predictions with Graph Neural Architecture Search. (arXiv:2307.10438v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10438
&lt;/p&gt;
&lt;p&gt;
&#29992;&#20110;&#20998;&#23376;&#23646;&#24615;&#39044;&#27979;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#36890;&#24120;&#26080;&#27861;&#37327;&#21270;&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;AutoGNNUQ&#65292;&#36890;&#36807;&#26550;&#26500;&#25628;&#32034;&#29983;&#25104;&#39640;&#24615;&#33021;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#38598;&#21512;&#65292;&#24182;&#21033;&#29992;&#26041;&#24046;&#20998;&#35299;&#23558;&#25968;&#25454;&#21644;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#20998;&#24320;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#20943;&#23569;&#19981;&#30830;&#23450;&#24615;&#30340;&#26377;&#20215;&#20540;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNN&#65289;&#24050;&#25104;&#20026;&#20998;&#23376;&#23646;&#24615;&#39044;&#27979;&#20013;&#31361;&#20986;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#20856;&#22411;GNN&#27169;&#22411;&#30340;&#19968;&#20010;&#20851;&#38190;&#38480;&#21046;&#26159;&#26080;&#27861;&#37327;&#21270;&#39044;&#27979;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#36825;&#31181;&#33021;&#21147;&#23545;&#20110;&#30830;&#20445;&#22312;&#19979;&#28216;&#20219;&#21153;&#20013;&#21487;&#20449;&#22320;&#20351;&#29992;&#21644;&#37096;&#32626;&#27169;&#22411;&#33267;&#20851;&#37325;&#35201;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;AutoGNNUQ&#65292;&#19968;&#31181;&#33258;&#21160;&#21270;&#30340;&#20998;&#23376;&#23646;&#24615;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#12290;AutoGNNUQ&#21033;&#29992;&#26550;&#26500;&#25628;&#32034;&#29983;&#25104;&#19968;&#32452;&#39640;&#24615;&#33021;&#30340;GNN&#38598;&#21512;&#65292;&#33021;&#22815;&#20272;&#35745;&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#29992;&#26041;&#24046;&#20998;&#35299;&#26469;&#20998;&#31163;&#25968;&#25454;&#65288;aleatoric&#65289;&#21644;&#27169;&#22411;&#65288;epistemic&#65289;&#19981;&#30830;&#23450;&#24615;&#65292;&#20026;&#20943;&#23569;&#23427;&#20204;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;&#22312;&#25105;&#20204;&#30340;&#35745;&#31639;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;AutoGNNUQ&#22312;&#22810;&#20010;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#22312;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#19981;&#30830;&#23450;&#24615;&#27979;&#37327;&#24615;&#33021;&#26041;&#38754;&#36229;&#36807;&#20102;&#29616;&#26377;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21033;&#29992;t-SNE&#21487;&#35270;&#21270;&#26469;&#35299;&#37322;&#19981;&#30830;&#23450;&#24615;&#30340;&#26469;&#28304;&#21644;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Networks (GNNs) have emerged as a prominent class of data-driven methods for molecular property prediction. However, a key limitation of typical GNN models is their inability to quantify uncertainties in the predictions. This capability is crucial for ensuring the trustworthy use and deployment of models in downstream tasks. To that end, we introduce AutoGNNUQ, an automated uncertainty quantification (UQ) approach for molecular property prediction. AutoGNNUQ leverages architecture search to generate an ensemble of high-performing GNNs, enabling the estimation of predictive uncertainties. Our approach employs variance decomposition to separate data (aleatoric) and model (epistemic) uncertainties, providing valuable insights for reducing them. In our computational experiments, we demonstrate that AutoGNNUQ outperforms existing UQ methods in terms of both prediction accuracy and UQ performance on multiple benchmark datasets. Additionally, we utilize t-SNE visualization to exp
&lt;/p&gt;</description></item></channel></rss>