<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;K-DReAM&#30340;&#30693;&#35782;&#22686;&#24378;&#29983;&#25104;&#27169;&#22411;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#23558;&#30693;&#35782;&#22270;&#35889;&#23884;&#20837;&#21040;&#29983;&#25104;&#27169;&#22411;&#20013;&#65292;&#20197;&#20135;&#29983;&#20855;&#26377;&#29305;&#23450;&#29305;&#24449;&#30340;&#26032;&#33647;&#20505;&#36873;&#29289;&#12290;</title><link>https://arxiv.org/abs/2402.08790</link><description>&lt;p&gt;
&#29992;&#30693;&#35782;&#22686;&#24378;&#30340;&#29983;&#25104;&#27169;&#22411;&#25913;&#36827;&#20998;&#23376;&#29983;&#25104;&#21644;&#33647;&#29289;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Improving Molecule Generation and Drug Discovery with a Knowledge-enhanced Generative Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08790
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;K-DReAM&#30340;&#30693;&#35782;&#22686;&#24378;&#29983;&#25104;&#27169;&#22411;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#23558;&#30693;&#35782;&#22270;&#35889;&#23884;&#20837;&#21040;&#29983;&#25104;&#27169;&#22411;&#20013;&#65292;&#20197;&#20135;&#29983;&#20855;&#26377;&#29305;&#23450;&#29305;&#24449;&#30340;&#26032;&#33647;&#20505;&#36873;&#29289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#27169;&#22411;&#22312;&#29983;&#25104;&#20998;&#23376;&#21644;&#26032;&#33647;&#20505;&#36873;&#29289;&#26041;&#38754;&#21462;&#24471;&#20102;&#26368;&#20808;&#36827;&#30340;&#25104;&#26524;&#12290;&#23613;&#31649;&#21462;&#24471;&#20102;&#36825;&#20123;&#25104;&#21151;&#65292;&#20294;&#26159;&#29983;&#25104;&#27169;&#22411;&#19982;&#24191;&#27867;&#30340;&#29983;&#29289;&#21307;&#23398;&#30693;&#35782;&#20043;&#38388;&#20173;&#23384;&#22312;&#37325;&#22823;&#24046;&#36317;&#65292;&#36825;&#20123;&#30693;&#35782;&#36890;&#24120;&#34987;&#31995;&#32479;&#21270;&#22312;&#30693;&#35782;&#22270;&#35889;&#20013;&#65292;&#32780;&#36825;&#20123;&#30693;&#35782;&#23545;&#20110;&#20449;&#24687;&#21644;&#22686;&#24378;&#29983;&#25104;&#36807;&#31243;&#30340;&#28508;&#21147;&#23578;&#26410;&#23454;&#29616;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#21517;&#20026;K-DReAM&#30340;&#30693;&#35782;&#22686;&#24378;&#29983;&#25104;&#27169;&#22411;&#26694;&#26550;&#26469;&#24357;&#21512;&#36825;&#20010;&#24046;&#36317;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#26041;&#27861;&#65292;&#25193;&#23637;&#20102;&#30693;&#35782;&#22270;&#35889;&#30340;&#21151;&#33021;&#65292;&#21516;&#26102;&#20445;&#25345;&#35821;&#20041;&#23436;&#25972;&#24615;&#65292;&#24182;&#23558;&#36825;&#20123;&#19978;&#19979;&#25991;&#20449;&#24687;&#32467;&#21512;&#21040;&#19968;&#20010;&#29983;&#25104;&#26694;&#26550;&#20013;&#65292;&#20197;&#25351;&#23548;&#25193;&#25955;&#27169;&#22411;&#12290;&#30693;&#35782;&#22270;&#35889;&#23884;&#20837;&#19982;&#25105;&#20204;&#30340;&#29983;&#25104;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20026;&#20135;&#29983;&#20855;&#26377;&#29305;&#23450;&#29305;&#24449;&#30340;&#26032;&#33647;&#20505;&#36873;&#29289;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08790v1 Announce Type: new Abstract: Recent advancements in generative models have established state-of-the-art benchmarks in generating molecules and novel drug candidates. Despite these successes, a significant gap persists between generative models and the utilization of extensive biomedical knowledge, often systematized within knowledge graphs, whose potential to inform and enhance generative processes has not been realized. In this paper, we present a novel approach that bridges this divide by developing a framework for knowledge-enhanced generative models called K-DReAM. We develop a scalable methodology to extend the functionality of knowledge graphs while preserving semantic integrity and incorporate this contextual information into a generative framework to guide a diffusion-based model. The integration of knowledge graph embeddings with our generative model furnishes a robust mechanism for producing novel drug candidates possessing specific characteristics while en
&lt;/p&gt;</description></item></channel></rss>