<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>SpanSeq &#26159;&#19968;&#31181;&#29992;&#20110;&#29983;&#29289;&#25968;&#25454;&#24207;&#21015;&#30340;&#25968;&#25454;&#24211;&#20998;&#21306;&#26041;&#27861;&#65292;&#33021;&#22815;&#36991;&#20813;&#35757;&#32451;&#38598;&#21644;&#27979;&#35797;&#38598;&#20043;&#38388;&#30340;&#25968;&#25454;&#27844;&#28431;&#12290;</title><link>https://arxiv.org/abs/2402.14482</link><description>&lt;p&gt;
SpanSeq&#65306;&#29992;&#20110;&#25913;&#36827;&#28145;&#24230;&#23398;&#20064;&#39033;&#30446;&#24320;&#21457;&#21644;&#35780;&#20272;&#30340;&#22522;&#20110;&#30456;&#20284;&#24230;&#30340;&#24207;&#21015;&#25968;&#25454;&#25286;&#20998;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
SpanSeq: Similarity-based sequence data splitting method for improved development and assessment of deep learning projects
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14482
&lt;/p&gt;
&lt;p&gt;
SpanSeq &#26159;&#19968;&#31181;&#29992;&#20110;&#29983;&#29289;&#25968;&#25454;&#24207;&#21015;&#30340;&#25968;&#25454;&#24211;&#20998;&#21306;&#26041;&#27861;&#65292;&#33021;&#22815;&#36991;&#20813;&#35757;&#32451;&#38598;&#21644;&#27979;&#35797;&#38598;&#20043;&#38388;&#30340;&#25968;&#25454;&#27844;&#28431;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20960;&#24180;&#20013;&#65292;&#22312;&#35745;&#31639;&#29983;&#29289;&#23398;&#20013;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;&#22686;&#21152;&#24456;&#22823;&#65292;&#24182;&#19988;&#38543;&#30528;&#35832;&#22914;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#31561;&#39046;&#22495;&#30340;&#24403;&#21069;&#36827;&#23637;&#65292;&#39044;&#35745;&#23558;&#36827;&#19968;&#27493;&#22686;&#21152;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;SpanSeq&#65292;&#36825;&#26159;&#19968;&#31181;&#36866;&#29992;&#20110;&#22823;&#22810;&#25968;&#29983;&#29289;&#24207;&#21015;&#65288;&#22522;&#22240;&#12289;&#34507;&#30333;&#36136;&#21644;&#22522;&#22240;&#32452;&#65289;&#30340;&#26426;&#22120;&#23398;&#20064;&#25968;&#25454;&#24211;&#20998;&#21306;&#26041;&#27861;&#65292;&#26088;&#22312;&#36991;&#20813;&#25968;&#25454;&#38598;&#20043;&#38388;&#30340;&#25968;&#25454;&#27844;&#28431;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14482v1 Announce Type: new  Abstract: The use of deep learning models in computational biology has increased massively in recent years, and is expected to do so further with the current advances in fields like Natural Language Processing. These models, although able to draw complex relations between input and target, are also largely inclined to learn noisy deviations from the pool of data used during their development. In order to assess their performance on unseen data (their capacity to generalize), it is common to randomly split the available data in development (train/validation) and test sets. This procedure, although standard, has lately been shown to produce dubious assessments of generalization due to the existing similarity between samples in the databases used. In this work, we present SpanSeq, a database partition method for machine learning that can scale to most biological sequences (genes, proteins and genomes) in order to avoid data leakage between sets. We a
&lt;/p&gt;</description></item></channel></rss>