<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#26032;&#39062;&#30340;&#26694;&#26550;SFFormer&#65292;&#32467;&#21512;&#20102;&#22810;&#22836;&#20132;&#21449;&#27880;&#24847;&#21147;&#29305;&#24449;&#34701;&#21512;&#27169;&#22359;&#65292;&#22522;&#20110;dMRI&#32420;&#32500;&#26463;&#36861;&#36394;&#65292;&#39044;&#27979;&#20102;&#20027;&#35266;&#35821;&#35328;&#34920;&#29616;&#65292;&#25299;&#23637;&#20102;&#33041;&#32467;&#26500;&#19982;&#20154;&#31867;&#35748;&#30693;&#21151;&#33021;&#30340;&#20851;&#32852;&#30740;&#31350;&#12290;</title><link>https://arxiv.org/abs/2403.19001</link><description>&lt;p&gt;
&#36328;&#39046;&#22495;&#30340;&#32420;&#32500;&#31751;&#24418;&#29366;&#20998;&#26512;&#29992;&#20110;&#35821;&#35328;&#34920;&#29616;&#35748;&#30693;&#20998;&#25968;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Cross--domain Fiber Cluster Shape Analysis for Language Performance Cognitive Score Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19001
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#26032;&#39062;&#30340;&#26694;&#26550;SFFormer&#65292;&#32467;&#21512;&#20102;&#22810;&#22836;&#20132;&#21449;&#27880;&#24847;&#21147;&#29305;&#24449;&#34701;&#21512;&#27169;&#22359;&#65292;&#22522;&#20110;dMRI&#32420;&#32500;&#26463;&#36861;&#36394;&#65292;&#39044;&#27979;&#20102;&#20027;&#35266;&#35821;&#35328;&#34920;&#29616;&#65292;&#25299;&#23637;&#20102;&#33041;&#32467;&#26500;&#19982;&#20154;&#31867;&#35748;&#30693;&#21151;&#33021;&#30340;&#20851;&#32852;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24418;&#29366;&#22312;&#35745;&#31639;&#26426;&#22270;&#24418;&#23398;&#20013;&#25198;&#28436;&#37325;&#35201;&#35282;&#33394;&#65292;&#25552;&#20379;&#20102;&#26377;&#20851;&#23545;&#35937;&#24418;&#24577;&#21644;&#21151;&#33021;&#30340;&#20449;&#24687;&#29305;&#24449;&#12290;&#33041;&#25104;&#20687;&#20013;&#30340;&#24418;&#29366;&#20998;&#26512;&#21487;&#24110;&#21161;&#35299;&#37322;&#20154;&#33041;&#32467;&#26500;&#21644;&#21151;&#33021;&#30340;&#30456;&#20851;&#24615;&#12290;&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#22823;&#33041;&#30340;3D&#30333;&#36136;&#36830;&#25509;&#30340;&#24418;&#29366;&#21450;&#20854;&#19982;&#20154;&#31867;&#35748;&#30693;&#21151;&#33021;&#30340;&#28508;&#22312;&#39044;&#27979;&#20851;&#31995;&#12290;&#25105;&#20204;&#20351;&#29992;&#25193;&#25955;&#30913;&#20849;&#25391;&#25104;&#20687;&#65288;dMRI&#65289;&#32420;&#32500;&#26463;&#36861;&#36394;&#23558;&#22823;&#33041;&#36830;&#25509;&#37325;&#24314;&#20026;3D&#28857;&#24207;&#21015;&#12290;&#20026;&#20102;&#25551;&#36848;&#27599;&#20010;&#36830;&#25509;&#65292;&#25105;&#20204;&#25552;&#21462;&#20102;12&#20010;&#24418;&#29366;&#25551;&#36848;&#31526;&#20197;&#21450;&#20256;&#32479;&#30340;dMRI&#36830;&#25509;&#21644;&#32452;&#32455;&#24494;&#32467;&#26500;&#29305;&#24449;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#24418;&#29366;&#34701;&#21512;&#32420;&#32500;&#31751;&#21464;&#25442;&#22120;&#65288;SFFormer&#65289;&#65292;&#21033;&#29992;&#22810;&#22836;&#20132;&#21449;&#27880;&#24847;&#21147;&#29305;&#24449;&#34701;&#21512;&#27169;&#22359;&#22522;&#20110;dMRI&#32420;&#32500;&#26463;&#36861;&#36394;&#26469;&#39044;&#27979;&#29305;&#23450;&#20010;&#20307;&#30340;&#35821;&#35328;&#34920;&#29616;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#22823;&#22411;&#25968;&#25454;&#38598;&#19978;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19001v1 Announce Type: cross  Abstract: Shape plays an important role in computer graphics, offering informative features to convey an object's morphology and functionality. Shape analysis in brain imaging can help interpret structural and functionality correlations of the human brain. In this work, we investigate the shape of the brain's 3D white matter connections and its potential predictive relationship to human cognitive function. We reconstruct brain connections as sequences of 3D points using diffusion magnetic resonance imaging (dMRI) tractography. To describe each connection, we extract 12 shape descriptors in addition to traditional dMRI connectivity and tissue microstructure features. We introduce a novel framework, Shape--fused Fiber Cluster Transformer (SFFormer), that leverages a multi-head cross-attention feature fusion module to predict subject-specific language performance based on dMRI tractography. We assess the performance of the method on a large dataset
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#30340;&#26032;&#22411;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#27169;&#22411;&#65292;&#36890;&#36807;&#24341;&#20837;&#24378;&#21270;&#23398;&#20064;&#21407;&#29702;&#30340;&#22810;&#21442;&#25968;&#22870;&#21169;&#20989;&#25968;&#65292;&#25104;&#21151;&#20248;&#21270;&#20102;&#23567;&#20998;&#23376;&#29983;&#25104;&#30340;&#33647;&#29289;&#26679;&#24615;&#20272;&#35745;&#65292;&#26368;&#39640;&#25552;&#21319;&#20102;30%&#12290;</title><link>https://arxiv.org/abs/2402.00014</link><description>&lt;p&gt;
&#28151;&#21512;&#37327;&#23376;&#24490;&#29615;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#29992;&#20110;&#23567;&#20998;&#23376;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
Hybrid quantum cycle generative adversarial network for small molecule generation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00014
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#30340;&#26032;&#22411;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#27169;&#22411;&#65292;&#36890;&#36807;&#24341;&#20837;&#24378;&#21270;&#23398;&#20064;&#21407;&#29702;&#30340;&#22810;&#21442;&#25968;&#22870;&#21169;&#20989;&#25968;&#65292;&#25104;&#21151;&#20248;&#21270;&#20102;&#23567;&#20998;&#23376;&#29983;&#25104;&#30340;&#33647;&#29289;&#26679;&#24615;&#20272;&#35745;&#65292;&#26368;&#39640;&#25552;&#21319;&#20102;30%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20195;&#33647;&#29289;&#35774;&#35745;&#36807;&#31243;&#38656;&#35201;&#22823;&#37327;&#30340;&#26102;&#38388;&#21644;&#36164;&#28304;&#26469;&#24320;&#21457;&#39318;&#27425;&#36827;&#20837;&#24066;&#22330;&#30340;&#27599;&#20010;&#26032;&#21270;&#21512;&#29289;&#12290;&#29983;&#25104;&#23567;&#20998;&#23376;&#26159;&#33647;&#29289;&#21457;&#29616;&#30340;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#65292;&#23545;&#20110;&#24320;&#21457;&#21019;&#26032;&#30340;&#21046;&#33647;&#20135;&#21697;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#23578;&#26410;&#20805;&#20998;&#21457;&#25381;&#29420;&#29305;&#24615;&#12289;&#26377;&#25928;&#24615;&#12289;&#22810;&#26679;&#24615;&#12289;&#33647;&#29289;&#26679;&#24615;&#12289;&#21487;&#21512;&#25104;&#24615;&#21644;&#28342;&#35299;&#24230;&#20998;&#23376;&#33647;&#20195;&#21160;&#21147;&#23398;&#24615;&#36136;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#20960;&#31181;&#22522;&#20110;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#24037;&#31243;&#25972;&#21512;&#21040;&#24050;&#30693;&#20998;&#23376;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#20013;&#30340;&#26032;&#22411;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#27169;&#22411;&#12290;&#24341;&#20837;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#32467;&#21512;&#20102;&#20197;&#24378;&#21270;&#23398;&#20064;&#21407;&#29702;&#20026;&#22522;&#30784;&#30340;&#26032;&#22411;&#22810;&#21442;&#25968;&#22870;&#21169;&#20989;&#25968;&#12290;&#36890;&#36807;&#22312;&#22522;&#20934;&#33647;&#29289;&#35774;&#35745;&#25968;&#25454;&#38598;QM9&#21644;PC9&#19978;&#36827;&#34892;&#24191;&#27867;&#30340;&#23454;&#39564;&#65292;&#26174;&#31034;&#20986;&#24341;&#20837;&#30340;&#27169;&#22411;&#20248;&#20110;&#20197;&#21069;&#30340;&#35780;&#20998;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#26032;&#30340;&#35780;&#20998;&#34920;&#26126;&#33647;&#29289;&#26679;&#24615;&#23450;&#37327;&#20272;&#35745;&#22686;&#21152;&#20102;&#26368;&#22810;30%&#12290;
&lt;/p&gt;
&lt;p&gt;
The contemporary drug design process demands considerable time and resources to develop each new compound entering the market. Generating small molecules is a pivotal aspect of drug discovery, essential for developing innovative pharmaceuticals. Uniqueness, validity, diversity, druglikeliness, synthesizability, and solubility molecular pharmacokinetic properties, however, are yet to be maximized. This work introduces several new generative adversarial network models based on engineering integration of parametrized quantum circuits into known molecular generative adversarial networks. The introduced machine learning models incorporate a new multi-parameter reward function grounded in reinforcement learning principles. Through extensive experimentation on benchmark drug design datasets, QM9 and PC9, the introduced models are shown to outperform scores achieved previously. Most prominently, the new scores indicate an increase of up to 30% in the druglikeness quantitative estimation. The n
&lt;/p&gt;</description></item></channel></rss>