<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#38656;&#35201;&#22312;&#20154;&#24037;&#31995;&#32479;&#20013;&#24179;&#34913;&#35752;&#35770;&#24847;&#35782;&#30340;&#21487;&#33021;&#23454;&#29616;&#65292;&#25552;&#20986;&#20102;&#20351;&#29992;&#24847;&#35782;&#30340;&#32500;&#24230;&#21644;&#29305;&#24449;&#26469;&#36827;&#34892;&#35752;&#35770;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.20177</link><description>&lt;p&gt;
&#20154;&#24037;&#24847;&#35782;&#12290;&#19968;&#20123;&#36923;&#36753;&#21644;&#27010;&#24565;&#21021;&#27493;
&lt;/p&gt;
&lt;p&gt;
Artificial consciousness. Some logical and conceptual preliminaries
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.20177
&lt;/p&gt;
&lt;p&gt;
&#38656;&#35201;&#22312;&#20154;&#24037;&#31995;&#32479;&#20013;&#24179;&#34913;&#35752;&#35770;&#24847;&#35782;&#30340;&#21487;&#33021;&#23454;&#29616;&#65292;&#25552;&#20986;&#20102;&#20351;&#29992;&#24847;&#35782;&#30340;&#32500;&#24230;&#21644;&#29305;&#24449;&#26469;&#36827;&#34892;&#35752;&#35770;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.20177v1 &#20844;&#21578;&#31867;&#22411;: &#26032;&#30340; &#25688;&#35201;: &#20154;&#24037;&#24847;&#35782;&#22312;&#29702;&#35770;&#19978;&#26159;&#21542;&#21487;&#33021;&#65311;&#26159;&#21542;&#21512;&#20046;&#24773;&#29702;&#65311;&#22914;&#26524;&#26159;&#65292;&#37027;&#20040;&#25216;&#26415;&#19978;&#21487;&#34892;&#21527;&#65311;&#35201;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#26377;&#24517;&#35201;&#22880;&#23450;&#19968;&#20123;&#22522;&#30784;&#65292;&#38416;&#26126;&#20154;&#24037;&#24847;&#35782;&#20135;&#29983;&#30340;&#36923;&#36753;&#21644;&#32463;&#39564;&#26465;&#20214;&#20197;&#21450;&#28041;&#21450;&#30340;&#30456;&#20851;&#26415;&#35821;&#30340;&#21547;&#20041;&#12290;&#24847;&#35782;&#26159;&#19968;&#20010;&#22810;&#20041;&#35789;&#65306;&#26469;&#33258;&#19981;&#21516;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#65292;&#21253;&#25324;&#31070;&#32463;&#31185;&#23398;&#12289;&#20154;&#24037;&#26234;&#33021;&#12289;&#26426;&#22120;&#20154;&#25216;&#26415;&#21644;&#21746;&#23398;&#31561;&#65292;&#26377;&#26102;&#20250;&#20351;&#29992;&#19981;&#21516;&#26415;&#35821;&#26469;&#25351;&#31216;&#30456;&#21516;&#29616;&#35937;&#65292;&#25110;&#32773;&#20351;&#29992;&#30456;&#21516;&#26415;&#35821;&#26469;&#25351;&#31216;&#19981;&#21516;&#29616;&#35937;&#12290;&#20107;&#23454;&#19978;&#65292;&#22914;&#26524;&#25105;&#20204;&#24819;&#25506;&#35752;&#20154;&#24037;&#24847;&#35782;&#65292;&#23601;&#38656;&#35201;&#24688;&#24403;&#30028;&#23450;&#20851;&#38190;&#27010;&#24565;&#12290;&#22312;&#27492;&#65292;&#32463;&#36807;&#19968;&#20123;&#36923;&#36753;&#21644;&#27010;&#24565;&#21021;&#27493;&#24037;&#20316;&#21518;&#65292;&#25105;&#20204;&#35748;&#20026;&#26377;&#24517;&#35201;&#20351;&#29992;&#24847;&#35782;&#30340;&#32500;&#24230;&#21644;&#29305;&#24449;&#36827;&#34892;&#24179;&#34913;&#35752;&#35770;&#65292;&#25506;&#35752;&#23427;&#20204;&#22312;&#20154;&#24037;&#31995;&#32479;&#20013;&#30340;&#21487;&#33021;&#23454;&#20363;&#21270;&#25110;&#23454;&#29616;&#12290;&#25105;&#20204;&#22312;&#36825;&#39033;&#24037;&#20316;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.20177v1 Announce Type: new  Abstract: Is artificial consciousness theoretically possible? Is it plausible? If so, is it technically feasible? To make progress on these questions, it is necessary to lay some groundwork clarifying the logical and empirical conditions for artificial consciousness to arise and the meaning of relevant terms involved. Consciousness is a polysemic word: researchers from different fields, including neuroscience, Artificial Intelligence, robotics, and philosophy, among others, sometimes use different terms in order to refer to the same phenomena or the same terms to refer to different phenomena. In fact, if we want to pursue artificial consciousness, a proper definition of the key concepts is required. Here, after some logical and conceptual preliminaries, we argue for the necessity of using dimensions and profiles of consciousness for a balanced discussion about their possible instantiation or realisation in artificial systems. Our primary goal in t
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20197;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#20998;&#26512;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#20013;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#22797;&#26434;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.03340</link><description>&lt;p&gt;
&#23450;&#21521;&#28436;&#21270;&#21644;&#29983;&#24577;&#36827;&#21270;&#21160;&#21147;&#23398;&#30340;&#29983;&#29289;&#29289;&#29702;&#25511;&#21046;
&lt;/p&gt;
&lt;p&gt;
Biophysical Cybernetics of Directed Evolution and Eco-evolutionary Dynamics. (arXiv:2305.03340v1 [q-bio.PE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03340
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20197;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#20026;&#22522;&#30784;&#65292;&#20998;&#26512;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#20013;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#22797;&#26434;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36827;&#21270;&#21160;&#21147;&#23398;&#20013;&#30340;&#35768;&#22810;&#37325;&#35201;&#38382;&#39064;&#21487;&#20197;&#22312;&#21338;&#24328;&#29702;&#35770;&#32972;&#26223;&#19979;&#20197;&#38543;&#26426;&#36712;&#36857;&#20998;&#26512;&#30340;&#26041;&#24335;&#26377;&#24847;&#20041;&#22320;&#26144;&#23556;&#21040;&#20998;&#26512;&#20013;&#12290;&#36890;&#24120;&#30340;&#26041;&#27861;&#26159;&#20998;&#26512;&#23569;&#37327;&#19981;&#21516;&#30340;&#32676;&#20307;&#21644;/&#25110;&#20551;&#35774;&#21160;&#21147;&#23398;&#21457;&#29983;&#22312;&#20154;&#21475;&#35268;&#27169;&#22823;&#21040;&#36275;&#20197;&#20351;&#30830;&#23450;&#24615;&#36712;&#36857;&#25104;&#20026;&#29616;&#23454;&#30340;&#21306;&#22495;&#12290;&#34987;&#31216;&#20026;&#8220;&#29983;&#24577;&#28436;&#21270;&#21160;&#21147;&#23398;&#8221;&#30340;&#29983;&#24577;&#22240;&#32032;&#30340;&#28155;&#21152;&#36827;&#19968;&#27493;&#22797;&#26434;&#21270;&#20102;&#21160;&#21147;&#23398;&#65292;&#24182;&#23548;&#33268;&#35768;&#22810;&#38382;&#39064;&#38590;&#20197;&#22788;&#29702;&#25110;&#24403;&#21069;&#30340;&#29702;&#35770;&#26041;&#27861;&#38590;&#20197;&#23454;&#38469;&#24212;&#29992;&#12290;&#20294;&#26159;&#65292;&#19968;&#31181;&#31867;&#20284;&#20294;&#26410;&#34987;&#20805;&#20998;&#25506;&#35752;&#30340;&#26041;&#27861;&#26159;&#23558;&#37325;&#28857;&#25918;&#22312;&#27169;&#22411;&#26412;&#36523;&#30340;&#19981;&#30830;&#23450;&#24615;&#19978;&#65292;&#20381;&#25454;&#24378;&#21270;&#23398;&#20064;&#39046;&#22495;&#21644;&#30456;&#37051;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#30340;&#35821;&#35328;&#65292;&#32780;&#34987;&#31216;&#20026;&#8220;&#37096;&#20998;&#21487;&#35266;&#23519;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#8221;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#23545;&#20598;&#24615;&#65292;&#23558;&#21516;&#26102;&#32771;&#34385;&#29983;&#24577;&#21644;&#20010;&#20307;&#22522;&#22240;&#22411;/&#34920;&#22411;&#31867;&#22411;&#30340;&#22797;&#26434;&#24615;&#26144;&#23556;&#21040;&#19968;&#20010;&#26032;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#27169;&#22411;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many major questions in the theory of evolutionary dynamics can in a meaningful sense be mapped to analyses of stochastic trajectories in game theoretic contexts. Often the approach is to analyze small numbers of distinct populations and/or to assume dynamics occur within a regime of population sizes large enough that deterministic trajectories are an excellent approximation of reality. The addition of ecological factors, termed "eco-evolutionary dynamics", further complicates the dynamics and results in many problems which are intractable or impractically messy for current theoretical methods. However, an analogous but underexplored approach is to analyze these systems with an eye primarily towards uncertainty in the models themselves. In the language of researchers in Reinforcement Learning and adjacent fields, a Partially Observable Markov Process. Here we introduce a duality which maps the complexity of accounting for both ecology and individual genotypic/phenotypic types onto a pr
&lt;/p&gt;</description></item></channel></rss>