<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#24182;&#30740;&#31350;&#20102;&#19968;&#31181;&#27169;&#24335;&#24863;&#30693;&#30340;&#23646;&#24615;&#23631;&#34109;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#30456;&#37051;&#27169;&#24335;&#20013;&#30340;&#21407;&#23376;&#20449;&#24687;&#26469;&#25429;&#25417;&#27169;&#24335;&#38388;&#30340;&#32467;&#26500;&#65292;&#20174;&#32780;&#25552;&#39640;&#20998;&#23376;&#22270;&#39044;&#35757;&#32451;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2309.04589</link><description>&lt;p&gt;
&#38754;&#21521;&#20998;&#23376;&#22270;&#39044;&#35757;&#32451;&#30340;&#27169;&#24335;&#24863;&#30693;&#23646;&#24615;&#23631;&#34109;
&lt;/p&gt;
&lt;p&gt;
Motif-aware Attribute Masking for Molecular Graph Pre-training. (arXiv:2309.04589v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04589
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#24182;&#30740;&#31350;&#20102;&#19968;&#31181;&#27169;&#24335;&#24863;&#30693;&#30340;&#23646;&#24615;&#23631;&#34109;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#30456;&#37051;&#27169;&#24335;&#20013;&#30340;&#21407;&#23376;&#20449;&#24687;&#26469;&#25429;&#25417;&#27169;&#24335;&#38388;&#30340;&#32467;&#26500;&#65292;&#20174;&#32780;&#25552;&#39640;&#20998;&#23376;&#22270;&#39044;&#35757;&#32451;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#39044;&#35757;&#32451;&#20013;&#65292;&#23646;&#24615;&#37325;&#26500;&#29992;&#20110;&#39044;&#27979;&#33410;&#28857;&#25110;&#36793;&#30340;&#29305;&#24449;&#12290;&#36890;&#36807;&#32473;&#23450;&#22823;&#37327;&#30340;&#20998;&#23376;&#65292;&#23427;&#20204;&#23398;&#20064;&#25429;&#25417;&#32467;&#26500;&#30693;&#35782;&#65292;&#36825;&#23545;&#20110;&#21508;&#31181;&#19979;&#28216;&#23646;&#24615;&#39044;&#27979;&#20219;&#21153;&#22312;&#21270;&#23398;&#12289;&#29983;&#29289;&#21307;&#23398;&#21644;&#26448;&#26009;&#31185;&#23398;&#20013;&#33267;&#20851;&#37325;&#35201;&#12290;&#20808;&#21069;&#30340;&#31574;&#30053;&#26159;&#38543;&#26426;&#36873;&#25321;&#33410;&#28857;&#36827;&#34892;&#23646;&#24615;&#23631;&#34109;&#65292;&#21033;&#29992;&#23616;&#37096;&#37051;&#23621;&#30340;&#20449;&#24687;&#12290;&#28982;&#32780;&#65292;&#23545;&#36825;&#20123;&#37051;&#23621;&#30340;&#36807;&#24230;&#20381;&#36182;&#25233;&#21046;&#20102;&#27169;&#22411;&#20174;&#26356;&#39640;&#32423;&#30340;&#20122;&#32467;&#26500;&#20013;&#23398;&#20064;&#12290;&#20363;&#22914;&#65292;&#27169;&#22411;&#20174;&#39044;&#27979;&#33519;&#29615;&#20013;&#30340;&#19977;&#20010;&#30899;&#21407;&#23376;&#20013;&#23398;&#21040;&#30340;&#20449;&#24687;&#24456;&#23569;&#65292;&#20294;&#26159;&#21487;&#20197;&#20174;&#21151;&#33021;&#22522;&#22242;&#20043;&#38388;&#30340;&#30456;&#20114;&#36830;&#25509;&#20013;&#23398;&#21040;&#26356;&#22810;&#20449;&#24687;&#65292;&#20063;&#21487;&#20197;&#31216;&#20026;&#21270;&#23398;&#27169;&#24335;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#24182;&#30740;&#31350;&#20102;&#27169;&#24335;&#24863;&#30693;&#30340;&#23646;&#24615;&#23631;&#34109;&#31574;&#30053;&#65292;&#36890;&#36807;&#21033;&#29992;&#30456;&#37051;&#27169;&#24335;&#20013;&#30340;&#21407;&#23376;&#20449;&#24687;&#26469;&#25429;&#25417;&#27169;&#24335;&#38388;&#30340;&#32467;&#26500;&#12290;&#19968;&#26086;&#27599;&#20010;&#22270;&#34987;&#20998;&#35299;&#20026;&#19981;&#30456;&#20132;&#30340;
&lt;/p&gt;
&lt;p&gt;
Attribute reconstruction is used to predict node or edge features in the pre-training of graph neural networks. Given a large number of molecules, they learn to capture structural knowledge, which is transferable for various downstream property prediction tasks and vital in chemistry, biomedicine, and material science. Previous strategies that randomly select nodes to do attribute masking leverage the information of local neighbors However, the over-reliance of these neighbors inhibits the model's ability to learn from higher-level substructures. For example, the model would learn little from predicting three carbon atoms in a benzene ring based on the other three but could learn more from the inter-connections between the functional groups, or called chemical motifs. In this work, we propose and investigate motif-aware attribute masking strategies to capture inter-motif structures by leveraging the information of atoms in neighboring motifs. Once each graph is decomposed into disjoint
&lt;/p&gt;</description></item></channel></rss>