<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;Transformer&#27169;&#22411;&#32467;&#21512;&#36328;&#36890;&#36947;&#27880;&#24847;&#21147;&#65292;&#25512;&#21160;&#20102;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#21333;&#33033;&#20914;&#30005;&#21050;&#28608;&#21709;&#24212;&#30340;SOZ&#26412;&#22320;&#21270;&#65292;&#22312;&#35780;&#20272;&#20013;&#23637;&#31034;&#20102;&#27169;&#22411;&#23545;&#26410;&#35265;&#24739;&#32773;&#21644;&#30005;&#26497;&#25918;&#32622;&#30340;&#27867;&#21270;&#33021;&#21147;</title><link>https://arxiv.org/abs/2403.20324</link><description>&lt;p&gt;
&#20351;&#29992;&#21464;&#21387;&#22120;&#20174;&#21333;&#33033;&#20914;&#30005;&#21050;&#28608;&#21709;&#24212;&#20013;&#23450;&#20301;&#30315;&#30187;&#21457;&#20316;&#36215;&#22987;&#21306;
&lt;/p&gt;
&lt;p&gt;
Localising the Seizure Onset Zone from Single-Pulse Electrical Stimulation Responses with a Transformer
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.20324
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;Transformer&#27169;&#22411;&#32467;&#21512;&#36328;&#36890;&#36947;&#27880;&#24847;&#21147;&#65292;&#25512;&#21160;&#20102;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#36827;&#34892;&#21333;&#33033;&#20914;&#30005;&#21050;&#28608;&#21709;&#24212;&#30340;SOZ&#26412;&#22320;&#21270;&#65292;&#22312;&#35780;&#20272;&#20013;&#23637;&#31034;&#20102;&#27169;&#22411;&#23545;&#26410;&#35265;&#24739;&#32773;&#21644;&#30005;&#26497;&#25918;&#32622;&#30340;&#27867;&#21270;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30315;&#30187;&#26159;&#26368;&#24120;&#35265;&#30340;&#31070;&#32463;&#30142;&#30149;&#20043;&#19968;&#65292;&#35768;&#22810;&#24739;&#32773;&#22312;&#33647;&#29289;&#26080;&#27861;&#25511;&#21046;&#30315;&#30187;&#21457;&#20316;&#26102;&#38656;&#35201;&#25163;&#26415;&#24178;&#39044;&#12290;&#20026;&#20102;&#21462;&#24471;&#26377;&#25928;&#30340;&#25163;&#26415;&#32467;&#26524;&#65292;&#20934;&#30830;&#23450;&#20301;&#30315;&#30187;&#21457;&#20316;&#36215;&#22987;&#21306; - &#36890;&#24120;&#36817;&#20284;&#20026;&#30315;&#30187;&#21457;&#20316;&#36215;&#22987;&#21306; (SOZ) - &#33267;&#20851;&#37325;&#35201;&#20294;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#36890;&#36807;&#30005;&#21050;&#28608;&#36827;&#34892;&#20027;&#21160;&#25506;&#27979;&#24050;&#32463;&#25104;&#20026;&#35782;&#21035;&#30315;&#30187;&#21457;&#20316;&#21306;&#22495;&#30340;&#26631;&#20934;&#20020;&#24202;&#23454;&#36341;&#12290;&#26412;&#25991;&#25512;&#21160;&#20102;&#28145;&#24230;&#23398;&#20064;&#22312;&#20351;&#29992;&#21333;&#33033;&#20914;&#30005;&#21050;&#28608; (SPES) &#21709;&#24212;&#36827;&#34892; SOZ &#23450;&#20301;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#21253;&#21547;&#36328;&#36890;&#36947;&#27880;&#24847;&#21147;&#30340;Transformer&#27169;&#22411;&#26469;&#23454;&#29616;&#36825;&#19968;&#28857;&#12290;&#25105;&#20204;&#22312;&#20445;&#30041;&#30340;&#24739;&#32773;&#27979;&#35797;&#38598;&#19978;&#35780;&#20272;&#36825;&#20123;&#27169;&#22411;&#65292;&#20197;&#35780;&#20272;&#23427;&#20204;&#23545;&#26410;&#35265;&#24739;&#32773;&#21644;&#30005;&#26497;&#25918;&#32622;&#30340;&#27867;&#21270;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.20324v1 Announce Type: new  Abstract: Epilepsy is one of the most common neurological disorders, and many patients require surgical intervention when medication fails to control seizures. For effective surgical outcomes, precise localisation of the epileptogenic focus - often approximated through the Seizure Onset Zone (SOZ) - is critical yet remains a challenge. Active probing through electrical stimulation is already standard clinical practice for identifying epileptogenic areas. This paper advances the application of deep learning for SOZ localisation using Single Pulse Electrical Stimulation (SPES) responses. We achieve this by introducing Transformer models that incorporate cross-channel attention. We evaluate these models on held-out patient test sets to assess their generalisability to unseen patients and electrode placements.   Our study makes three key contributions: Firstly, we implement an existing deep learning model to compare two SPES analysis paradigms - namel
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25439;&#22833;&#20989;&#25968;&#65292;&#31216;&#20026;&#21152;&#26435;&#28966;&#28857;&#21487;&#24494;MCC&#65292;&#29992;&#20110;&#25913;&#21892;&#20998;&#31867;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#24182;&#22312;&#39044;&#27979;&#21754;&#20083;&#21160;&#29289;&#34507;&#30333;&#36136;&#20013;&#30340;O-GlcNAcylation&#20301;&#28857;&#26041;&#38754;&#21462;&#24471;&#20102;&#36827;&#23637;</title><link>https://arxiv.org/abs/2402.17131</link><description>&lt;p&gt;
&#20351;&#29992;Transformer&#21644;RNN&#22312;&#32463;&#36807;&#35757;&#32451;&#30340;&#26032;&#25439;&#22833;&#20989;&#25968;&#19979;&#39044;&#27979;&#21754;&#20083;&#21160;&#29289;&#34507;&#30333;&#36136;&#20013;&#30340;O-GlcNAcylation&#20301;&#28857;
&lt;/p&gt;
&lt;p&gt;
Predicting O-GlcNAcylation Sites in Mammalian Proteins with Transformers and RNNs Trained with a New Loss Function
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17131
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25439;&#22833;&#20989;&#25968;&#65292;&#31216;&#20026;&#21152;&#26435;&#28966;&#28857;&#21487;&#24494;MCC&#65292;&#29992;&#20110;&#25913;&#21892;&#20998;&#31867;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#24182;&#22312;&#39044;&#27979;&#21754;&#20083;&#21160;&#29289;&#34507;&#30333;&#36136;&#20013;&#30340;O-GlcNAcylation&#20301;&#28857;&#26041;&#38754;&#21462;&#24471;&#20102;&#36827;&#23637;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31958;&#22522;&#21270;&#26159;&#19968;&#31181;&#34507;&#30333;&#36136;&#20462;&#39280;&#65292;&#22312;&#21151;&#33021;&#21644;&#32467;&#26500;&#19978;&#36215;&#30528;&#22810;&#31181;&#37325;&#35201;&#20316;&#29992;&#12290;O-GlcNAcylation&#26159;&#31958;&#22522;&#21270;&#30340;&#19968;&#31181;&#20122;&#22411;&#65292;&#26377;&#28508;&#21147;&#25104;&#20026;&#27835;&#30103;&#30340;&#37325;&#35201;&#38774;&#28857;&#65292;&#20294;&#22312;2023&#24180;&#20043;&#21069;&#23578;&#26410;&#26377;&#21487;&#38752;&#39044;&#27979;O-GlcNAcylation&#20301;&#28857;&#30340;&#26041;&#27861;&#65307;2021&#24180;&#30340;&#19968;&#31687;&#35780;&#35770;&#27491;&#30830;&#25351;&#20986;&#24050;&#21457;&#34920;&#30340;&#27169;&#22411;&#19981;&#36275;&#65292;&#24182;&#19988;&#26410;&#33021;&#27867;&#21270;&#12290;&#27492;&#22806;&#65292;&#35768;&#22810;&#27169;&#22411;&#24050;&#19981;&#20877;&#21487;&#29992;&#12290;2023&#24180;&#65292;&#19968;&#31687;&#20855;&#26377;F$_1$&#20998;&#25968;36.17%&#21644;MCC&#20998;&#25968;34.57%&#30340;&#22823;&#22411;&#25968;&#25454;&#38598;&#19978;&#30340;&#26174;&#30528;&#26356;&#22909;&#30340;RNN&#27169;&#22411;&#34987;&#21457;&#34920;&#12290;&#26412;&#25991;&#39318;&#27425;&#35797;&#22270;&#36890;&#36807;Transformer&#32534;&#30721;&#22120;&#25552;&#39640;&#36825;&#20123;&#25351;&#26631;&#12290;&#23613;&#31649;Transformer&#22312;&#35813;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20986;&#33394;&#65292;&#20294;&#20854;&#24615;&#33021;&#20173;&#19981;&#21450;&#20808;&#21069;&#21457;&#34920;&#30340;RNN&#12290;&#28982;&#21518;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#31181;&#26032;&#30340;&#25439;&#22833;&#20989;&#25968;&#65292;&#31216;&#20026;&#21152;&#26435;&#28966;&#28857;&#21487;&#24494;MCC&#65292;&#20197;&#25552;&#39640;&#20998;&#31867;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17131v1 Announce Type: new  Abstract: Glycosylation, a protein modification, has multiple essential functional and structural roles. O-GlcNAcylation, a subtype of glycosylation, has the potential to be an important target for therapeutics, but methods to reliably predict O-GlcNAcylation sites had not been available until 2023; a 2021 review correctly noted that published models were insufficient and failed to generalize. Moreover, many are no longer usable. In 2023, a considerably better RNN model with an F$_1$ score of 36.17% and an MCC of 34.57% on a large dataset was published. This article first sought to improve these metrics using transformer encoders. While transformers displayed high performance on this dataset, their performance was inferior to that of the previously published RNN. We then created a new loss function, which we call the weighted focal differentiable MCC, to improve the performance of classification models. RNN models trained with this new function di
&lt;/p&gt;</description></item></channel></rss>