<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#37327;&#23376;&#27979;&#37327;&#36807;&#31243;&#20013;&#33539;&#30068;&#24863;&#30693;&#29616;&#35937;&#30340;&#26426;&#21046;&#65292;&#35748;&#20026;&#39068;&#33394;&#22312;&#20154;&#31867;&#35270;&#35273;&#20013;&#21487;&#20197;&#34987;&#35270;&#20026;&#20809;&#23376;&#65292;&#20026;&#35270;&#35273;&#24863;&#30693;&#25552;&#20379;&#20102;&#26032;&#30340;&#37327;&#23376;&#35748;&#30693;&#35270;&#35282;&#12290;</title><link>https://arxiv.org/abs/2403.18850</link><description>&lt;p&gt;
&#20154;&#31867;&#35270;&#35273;&#20013;&#39068;&#33394;&#26159;&#21542;&#26159;&#20809;&#23376;&#65311;&#35270;&#35273;&#30693;&#35273;&#30340;&#37327;&#23376;&#35748;&#30693;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Are Colors Quanta of Light for Human Vision? A Quantum Cognition Study of Visual Perception
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18850
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#37327;&#23376;&#27979;&#37327;&#36807;&#31243;&#20013;&#33539;&#30068;&#24863;&#30693;&#29616;&#35937;&#30340;&#26426;&#21046;&#65292;&#35748;&#20026;&#39068;&#33394;&#22312;&#20154;&#31867;&#35270;&#35273;&#20013;&#21487;&#20197;&#34987;&#35270;&#20026;&#20809;&#23376;&#65292;&#20026;&#35270;&#35273;&#24863;&#30693;&#25552;&#20379;&#20102;&#26032;&#30340;&#37327;&#23376;&#35748;&#30693;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#37327;&#23376;&#27979;&#37327;&#36807;&#31243;&#20013;&#33539;&#30068;&#24863;&#30693;&#30340;&#29616;&#35937;&#12290;&#35813;&#29616;&#35937;&#30340;&#26426;&#21046;&#22312;&#20110;&#34987;&#24863;&#30693;&#30340;&#25193;&#25955;&#21050;&#28608;&#34987;&#35748;&#20026;&#23646;&#20110;&#19981;&#21516;&#31867;&#21035;&#65292;&#32780;&#34987;&#24863;&#30693;&#30340;&#25910;&#32553;&#21050;&#28608;&#34987;&#35748;&#20026;&#23646;&#20110;&#30456;&#21516;&#31867;&#21035;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#65292;&#30001;&#20110;&#32431;&#24577;&#20043;&#38388;&#30340;&#36317;&#31163;&#19982;&#23494;&#24230;&#24577;&#20043;&#38388;&#30340;&#36317;&#31163;&#30340;&#30830;&#23450;&#26041;&#24335;&#33258;&#28982;&#19981;&#21516;&#65292;&#22240;&#27492;&#33539;&#30068;&#24863;&#30693;&#29616;&#35937;&#26681;&#26893;&#20110;&#37327;&#23376;&#27979;&#37327;&#36807;&#31243;&#30340;&#32467;&#26500;&#20013;&#12290;&#25105;&#20204;&#23558;&#30740;&#31350;&#32467;&#26524;&#24212;&#29992;&#20110;&#39068;&#33394;&#30340;&#35270;&#35273;&#24863;&#30693;&#24773;&#20917;&#65292;&#24182;&#35748;&#20026;&#21487;&#20197;&#23558;&#39068;&#33394;&#35270;&#20026;&#20154;&#31867;&#35270;&#35273;&#24863;&#30693;&#20013;&#30340;&#20809;&#23376;&#65292;&#31867;&#20284;&#20110;&#20809;&#39057;&#29289;&#29702;&#27979;&#37327;&#20013;&#30340;&#20809;&#23376;&#12290;&#22312;&#25105;&#20204;&#30340;&#26041;&#27861;&#20013;&#65292;&#25105;&#20204;&#23558;&#30693;&#35273;&#30475;&#20316;&#26159;&#29616;&#26377;&#29289;&#29702;&#29616;&#23454;&#12289;&#21050;&#28608;&#20197;&#21450;&#34987;&#24863;&#30693;&#32773;&#25152;&#26399;&#26395;&#30340;&#29616;&#23454;&#20043;&#38388;&#30340;&#22797;&#26434;&#30456;&#36935;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18850v1 Announce Type: cross  Abstract: We study the phenomenon of categorical perception within the quantum measurement process. The mechanism underlying this phenomenon consists in dilating stimuli being perceived to belong to different categories and contracting stimuli being perceived to belong to the same category. We show that, due to the naturally different way in determining the distance between pure states compared to the distance between density states, the phenomenon of categorical perception is rooted in the structure of the quantum measurement process itself. We apply our findings to the situation of visual perception of colors and argue that it is possible to consider colors as light quanta for human visual perception in a similar way as photons are light quanta for physical measurements of light frequencies. In our approach we see perception as a complex encounter between the existing physical reality, the stimuli, and the reality expected by the perciever, re
&lt;/p&gt;</description></item></channel></rss>