<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20809;&#35889;&#21487;&#21152;&#24615;&#30340;&#26041;&#27861;&#65292;&#20174;&#32473;&#23450;&#25968;&#25454;&#38598;&#20013;&#29983;&#25104;&#20855;&#26377;&#32479;&#35745;&#29420;&#31435;&#26631;&#31614;&#30340;&#39069;&#22806;&#25968;&#25454;&#28857;&#65292;&#29992;&#20110;&#35757;&#32451;&#33021;&#22815;&#22788;&#29702;&#38750;&#39640;&#26031;&#22122;&#22768;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#20851;&#31995;&#30340;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#12290;</title><link>https://arxiv.org/abs/2402.00851</link><description>&lt;p&gt;
&#20855;&#26377;&#39640;&#24230;&#30456;&#20851;&#27880;&#37322;&#30340;&#25289;&#26364;&#20809;&#35889;&#30340;&#25968;&#25454;&#22686;&#24378;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Data Augmentation Scheme for Raman Spectra with Highly Correlated Annotations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00851
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20809;&#35889;&#21487;&#21152;&#24615;&#30340;&#26041;&#27861;&#65292;&#20174;&#32473;&#23450;&#25968;&#25454;&#38598;&#20013;&#29983;&#25104;&#20855;&#26377;&#32479;&#35745;&#29420;&#31435;&#26631;&#31614;&#30340;&#39069;&#22806;&#25968;&#25454;&#28857;&#65292;&#29992;&#20110;&#35757;&#32451;&#33021;&#22815;&#22788;&#29702;&#38750;&#39640;&#26031;&#22122;&#22768;&#21644;&#38750;&#32447;&#24615;&#20381;&#36182;&#20851;&#31995;&#30340;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29983;&#29289;&#25216;&#26415;&#20013;&#65292;&#25289;&#26364;&#20809;&#35889;&#27861;&#20316;&#20026;&#19968;&#31181;&#36807;&#31243;&#20998;&#26512;&#25216;&#26415;&#65288;PAT&#65289;&#24555;&#36895;&#24471;&#21040;&#20102;&#24191;&#27867;&#24212;&#29992;&#65292;&#23427;&#21487;&#20197;&#27979;&#37327;&#32454;&#32990;&#23494;&#24230;&#12289;&#24213;&#29289;&#21644;&#20135;&#29289;&#27987;&#24230;&#12290;&#30001;&#20110;&#25289;&#26364;&#20809;&#35889;&#35760;&#24405;&#20102;&#20998;&#23376;&#30340;&#25391;&#21160;&#27169;&#24335;&#65292;&#22240;&#27492;&#21487;&#20197;&#38750;&#20405;&#20837;&#24615;&#22320;&#22312;&#19968;&#20010;&#20809;&#35889;&#20013;&#25552;&#20379;&#30456;&#20851;&#20449;&#24687;&#12290;&#36890;&#24120;&#65292;&#20559;&#26368;&#23567;&#20108;&#20056;&#65288;PLS&#65289;&#26159;&#20174;&#20809;&#35889;&#20013;&#25512;&#26029;&#24863;&#20852;&#36259;&#21464;&#37327;&#20449;&#24687;&#30340;&#27169;&#22411;&#36873;&#25321;&#12290;&#28982;&#32780;&#65292;&#29983;&#29289;&#36807;&#31243;&#20197;&#20854;&#22797;&#26434;&#24615;&#32780;&#38395;&#21517;&#65292;&#20854;&#20013;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;CNN&#65289;&#26159;&#19968;&#20010;&#24378;&#22823;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;&#23427;&#20204;&#21487;&#20197;&#22788;&#29702;&#38750;&#39640;&#26031;&#22122;&#22768;&#65292;&#24182;&#32771;&#34385;&#20809;&#26463;&#38169;&#20301;&#12289;&#20687;&#32032;&#25925;&#38556;&#25110;&#20854;&#20182;&#29289;&#36136;&#30340;&#23384;&#22312;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#22312;&#27169;&#22411;&#35757;&#32451;&#36807;&#31243;&#20013;&#38656;&#35201;&#22823;&#37327;&#25968;&#25454;&#65292;&#24182;&#19988;&#33021;&#22815;&#25429;&#25417;&#21040;&#36807;&#31243;&#21464;&#37327;&#20043;&#38388;&#30340;&#38750;&#32447;&#24615;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#20809;&#35889;&#30340;&#21487;&#21152;&#24615;&#26469;&#29983;&#25104;&#20174;&#32473;&#23450;&#25968;&#25454;&#38598;&#20013;&#24471;&#21040;&#30340;&#20855;&#26377;&#32479;&#35745;&#29420;&#31435;&#26631;&#31614;&#30340;&#39069;&#22806;&#25968;&#25454;&#28857;&#65292;&#20197;&#20415;&#35757;&#32451;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;
In biotechnology Raman Spectroscopy is rapidly gaining popularity as a process analytical technology (PAT) that measures cell densities, substrate- and product concentrations. As it records vibrational modes of molecules it provides that information non-invasively in a single spectrum. Typically, partial least squares (PLS) is the model of choice to infer information about variables of interest from the spectra. However, biological processes are known for their complexity where convolutional neural networks (CNN) present a powerful alternative. They can handle non-Gaussian noise and account for beam misalignment, pixel malfunctions or the presence of additional substances. However, they require a lot of data during model training, and they pick up non-linear dependencies in the process variables. In this work, we exploit the additive nature of spectra in order to generate additional data points from a given dataset that have statistically independent labels so that a network trained on
&lt;/p&gt;</description></item></channel></rss>