<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29616;&#20195;&#31070;&#32463;&#31185;&#23398;&#30340;&#20449;&#20219;&#26426;&#21046;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#26356;&#22909;&#22320;&#29702;&#35299;&#20154;&#31867;&#32452;&#32455;&#21644;&#20851;&#31995;&#20013;&#20449;&#20219;&#30340;&#24314;&#31435;&#21644;&#22833;&#21435;&#30340;&#22522;&#26412;&#26426;&#21046;&#12290;</title><link>http://arxiv.org/abs/2401.08064</link><description>&lt;p&gt;
&#22522;&#20110;&#31070;&#32463;&#20449;&#24687;&#22788;&#29702;&#30340;&#20449;&#20219;&#26032;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A new model of trust based on neural information processing. (arXiv:2401.08064v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08064
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29616;&#20195;&#31070;&#32463;&#31185;&#23398;&#30340;&#20449;&#20219;&#26426;&#21046;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#26356;&#22909;&#22320;&#29702;&#35299;&#20154;&#31867;&#32452;&#32455;&#21644;&#20851;&#31995;&#20013;&#20449;&#20219;&#30340;&#24314;&#31435;&#21644;&#22833;&#21435;&#30340;&#22522;&#26412;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
30&#22810;&#24180;&#30340;&#30740;&#31350;&#24050;&#32463;&#30830;&#23450;&#20102;&#20449;&#20219;&#22312;&#20154;&#31867;&#32452;&#32455;&#21644;&#20851;&#31995;&#20013;&#30340;&#37325;&#35201;&#20316;&#29992;&#65292;&#20294;&#20154;&#20204;&#24314;&#31435;&#12289;&#22833;&#21435;&#21644;&#37325;&#24314;&#20449;&#20219;&#30340;&#22522;&#26412;&#26426;&#21046;&#20173;&#28982;&#19981;&#23436;&#20840;&#29702;&#35299;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#20915;&#31574;&#31070;&#32463;&#31185;&#23398;&#20026;&#22522;&#30784;&#30340;&#20449;&#20219;&#26426;&#21046;&#27169;&#22411;&#12290;&#30001;&#20110;&#20449;&#20219;&#38656;&#35201;&#39044;&#27979;&#20182;&#20154;&#30340;&#26410;&#26469;&#34892;&#20026;&#65292;&#20219;&#20309;&#26426;&#26800;&#27169;&#22411;&#37117;&#24517;&#39035;&#24314;&#31435;&#22312;&#20851;&#20110;&#22823;&#33041;&#22914;&#20309;&#23398;&#20064;&#12289;&#20195;&#34920;&#21644;&#22788;&#29702;&#26410;&#26469;&#20449;&#24687;&#30340;&#26368;&#26032;&#29702;&#35770;&#20043;&#19978;&#12290;&#24403;&#20449;&#20219;&#30340;&#34892;&#20026;&#24471;&#21040;&#22238;&#25253;&#25110;&#32773;&#34987;&#36829;&#32972;&#26102;&#65292;&#36825;&#25552;&#20379;&#20102;&#26032;&#30340;&#20449;&#24687;&#65292;&#36825;&#21487;&#20197;&#29992;&#20110;&#39044;&#27979;&#26410;&#26469;&#30340;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
More than 30 years of research has firmly established the vital role of trust in human organizations and relationships, but the underlying mechanisms by which people build, lose, and rebuild trust remains incompletely understood. We propose a mechanistic model of trust that is grounded in the modern neuroscience of decision making. Since trust requires anticipating the future actions of others, any mechanistic model must be built upon up-to-date theories on how the brain learns, represents, and processes information about the future within its decision-making systems. Contemporary neuroscience has revealed that decision making arises from multiple parallel systems that perform distinct, complementary information processing. Each system represents information in different forms, and therefore learns via different mechanisms. When an act of trust is reciprocated or violated, this provides new information that can be used to anticipate future actions. The taxonomy of neural information re
&lt;/p&gt;</description></item></channel></rss>