<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36890;&#36807;&#31070;&#32463;&#36827;&#21270;&#31639;&#27861;&#20248;&#21270;&#20154;&#24037;&#33008;&#33146;&#27835;&#30103;&#31574;&#30053;&#65292;&#20943;&#23569;&#31958;&#23615;&#30149;&#24739;&#32773;&#30340;&#34880;&#31958;&#20559;&#24046;&#65292;&#24182;&#19988;&#38477;&#20302;&#27880;&#23556;&#27425;&#25968;&#12290;</title><link>https://arxiv.org/abs/2402.07949</link><description>&lt;p&gt;
&#20248;&#21270;&#20154;&#24037;&#33008;&#33146;&#35774;&#35745;&#20197;&#25913;&#21892;&#31958;&#23615;&#30149;&#31649;&#29702;
&lt;/p&gt;
&lt;p&gt;
Optimizing the Design of an Artificial Pancreas to Improve Diabetes Management
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07949
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#31070;&#32463;&#36827;&#21270;&#31639;&#27861;&#20248;&#21270;&#20154;&#24037;&#33008;&#33146;&#27835;&#30103;&#31574;&#30053;&#65292;&#20943;&#23569;&#31958;&#23615;&#30149;&#24739;&#32773;&#30340;&#34880;&#31958;&#20559;&#24046;&#65292;&#24182;&#19988;&#38477;&#20302;&#27880;&#23556;&#27425;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31958;&#23615;&#30149;&#26159;&#19968;&#31181;&#24930;&#24615;&#30142;&#30149;&#65292;&#24433;&#21709;&#32654;&#22269;&#22659;&#20869;&#26377;3800&#19975;&#20154;&#65292;&#23427;&#20250;&#24433;&#21709;&#36523;&#20307;&#23558;&#39135;&#29289;&#36716;&#21270;&#20026;&#33021;&#37327;&#65288;&#21363;&#34880;&#31958;&#65289;&#30340;&#33021;&#21147;&#12290;&#26631;&#20934;&#30340;&#27835;&#30103;&#26041;&#27861;&#26159;&#36890;&#36807;&#20351;&#29992;&#20154;&#24037;&#33008;&#33146;&#65292;&#21363;&#25345;&#32493;&#33008;&#23707;&#32032;&#27893;&#65288;&#22522;&#30784;&#27880;&#23556;&#65289;&#65292;&#20197;&#21450;&#23450;&#26399;&#27880;&#23556;&#33008;&#23707;&#32032;&#65288;&#31361;&#21457;&#27880;&#23556;&#65289;&#26469;&#34917;&#20805;&#30899;&#27700;&#21270;&#21512;&#29289;&#25668;&#20837;&#37327;&#12290;&#27835;&#30103;&#30446;&#26631;&#26159;&#23558;&#34880;&#31958;&#20445;&#25345;&#22312;&#21487;&#25509;&#21463;&#33539;&#22260;&#30340;&#20013;&#24515;&#20301;&#32622;&#65292;&#36890;&#36807;&#25345;&#32493;&#34880;&#31958;&#27979;&#37327;&#26469;&#36827;&#34892;&#34913;&#37327;&#12290;&#27425;&#35201;&#30446;&#26631;&#26159;&#20943;&#23569;&#27880;&#23556;&#27425;&#25968;&#65292;&#22240;&#20026;&#23545;&#26576;&#20123;&#24739;&#32773;&#26469;&#35828;&#27880;&#23556;&#26159;&#19981;&#24841;&#24555;&#19988;&#38590;&#20197;&#23454;&#26045;&#30340;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#31070;&#32463;&#36827;&#21270;&#26469;&#21457;&#29616;&#27835;&#30103;&#30340;&#26368;&#20339;&#31574;&#30053;&#12290;&#22522;&#20110;30&#22825;&#30340;&#27835;&#30103;&#21644;&#21333;&#20010;&#24739;&#32773;&#30340;&#27979;&#37327;&#25968;&#25454;&#38598;&#65292;&#39318;&#20808;&#35757;&#32451;&#20102;&#38543;&#26426;&#26862;&#26519;&#26469;&#39044;&#27979;&#26410;&#26469;&#30340;&#34880;&#31958;&#27700;&#24179;&#12290;&#28982;&#21518;&#36890;&#36807;&#36827;&#21270;&#20102;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#26469;&#25351;&#23450;&#30899;&#27700;&#21270;&#21512;&#29289;&#25668;&#20837;&#37327;&#12289;&#22522;&#30784;&#27880;&#23556;&#27700;&#24179;&#21644;&#31361;&#21457;&#27880;&#23556;&#12290;&#36827;&#21270;&#21457;&#29616;&#20102;&#19968;&#20010;&#24085;&#32047;&#25176;&#21069;&#27839;&#65292;&#20943;&#23569;&#20102;&#19982;&#30446;&#26631;&#20540;&#30340;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Diabetes, a chronic condition that impairs how the body turns food into energy, i.e. blood glucose, affects 38 million people in the US alone. The standard treatment is to supplement carbohydrate intake with an artificial pancreas, i.e. a continuous insulin pump (basal shots), as well as occasional insulin injections (bolus shots). The goal of the treatment is to keep blood glucose at the center of an acceptable range, as measured through a continuous glucose meter. A secondary goal is to minimize injections, which are unpleasant and difficult for some patients to implement. In this study, neuroevolution was used to discover an optimal strategy for the treatment. Based on a dataset of 30 days of treatment and measurements of a single patient, a random forest was first trained to predict future glucose levels. A neural network was then evolved to prescribe carbohydrates, basal pumping levels, and bolus injections. Evolution discovered a Pareto front that reduced deviation from the targe
&lt;/p&gt;</description></item></channel></rss>