<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#21033;&#29992;&#20915;&#31574;&#36807;&#31243;&#25968;&#25454;&#21644;&#27169;&#22411;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20043;&#38388;&#30340;&#20132;&#20114;&#12290;&#36890;&#36807;&#35814;&#32454;&#25551;&#36848;&#20915;&#31574;&#36807;&#31243;&#21644;&#24314;&#31435;&#20915;&#31574;&#28436;&#21464;&#27169;&#22411;&#65292;&#21487;&#20197;&#25581;&#31034;&#28508;&#22312;&#30340;&#20559;&#22909;&#65292;&#21516;&#26102;&#36861;&#36394;&#20915;&#31574;&#36807;&#31243;&#30340;&#25968;&#25454;&#21487;&#20197;&#25552;&#20379;&#37325;&#35201;&#20449;&#24687;&#65292;&#20174;&#32780;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2308.15225</link><description>&lt;p&gt;
&#20174;DDMs&#21040;DNNs&#65306;&#21033;&#29992;&#20915;&#31574;&#36807;&#31243;&#30340;&#25968;&#25454;&#21644;&#27169;&#22411;&#26469;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20043;&#38388;&#30340;&#20132;&#20114;
&lt;/p&gt;
&lt;p&gt;
From DDMs to DNNs: Using process data and models of decision-making to improve human-AI interactions. (arXiv:2308.15225v1 [q-bio.NC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15225
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#21033;&#29992;&#20915;&#31574;&#36807;&#31243;&#25968;&#25454;&#21644;&#27169;&#22411;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20043;&#38388;&#30340;&#20132;&#20114;&#12290;&#36890;&#36807;&#35814;&#32454;&#25551;&#36848;&#20915;&#31574;&#36807;&#31243;&#21644;&#24314;&#31435;&#20915;&#31574;&#28436;&#21464;&#27169;&#22411;&#65292;&#21487;&#20197;&#25581;&#31034;&#28508;&#22312;&#30340;&#20559;&#22909;&#65292;&#21516;&#26102;&#36861;&#36394;&#20915;&#31574;&#36807;&#31243;&#30340;&#25968;&#25454;&#21487;&#20197;&#25552;&#20379;&#37325;&#35201;&#20449;&#24687;&#65292;&#20174;&#32780;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36807;&#21435;&#30340;&#20960;&#21313;&#24180;&#20013;&#65292;&#35748;&#30693;&#31070;&#32463;&#31185;&#23398;&#23478;&#21644;&#34892;&#20026;&#32463;&#27982;&#23398;&#23478;&#24050;&#32463;&#35748;&#35782;&#21040;&#35814;&#32454;&#25551;&#36848;&#20915;&#31574;&#36807;&#31243;&#21644;&#24314;&#31435;&#20915;&#31574;&#38543;&#26102;&#38388;&#28436;&#21464;&#30340;&#27169;&#22411;&#30340;&#20215;&#20540;&#12290;&#20363;&#22914;&#65292;&#20915;&#31574;&#25152;&#38656;&#30340;&#26102;&#38388;&#21487;&#20197;&#25581;&#31034;&#19968;&#20010;&#20010;&#20307;&#30495;&#27491;&#30340;&#28508;&#22312;&#20559;&#22909;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#20915;&#31574;&#26412;&#36523;&#12290;&#31867;&#20284;&#22320;&#65292;&#36861;&#36394;&#20915;&#31574;&#36807;&#31243;&#30340;&#25968;&#25454;&#65292;&#22914;&#30524;&#21160;&#25110;&#31070;&#32463;&#35760;&#24405;&#65292;&#21253;&#21547;&#20102;&#20851;&#38190;&#30340;&#20449;&#24687;&#65292;&#21363;&#20351;&#27809;&#26377;&#36798;&#25104;&#20915;&#31574;&#20063;&#21487;&#20197;&#34987;&#21033;&#29992;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#35748;&#20026;&#20154;&#24037;&#26234;&#33021;&#30740;&#31350;&#24212;&#26356;&#21152;&#20851;&#27880;&#20915;&#31574;&#22914;&#20309;&#38543;&#26102;&#38388;&#28436;&#21464;&#20197;&#21450;&#22914;&#20309;&#34701;&#20837;&#30456;&#20851;&#30340;&#36807;&#31243;&#25968;&#25454;&#26469;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#30340;&#39044;&#27979;&#65292;&#29305;&#21035;&#26159;&#22312;&#20154;&#19982;&#20154;&#24037;&#26234;&#33021;&#20043;&#38388;&#30340;&#20132;&#20114;&#20013;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#38750;&#24120;&#25104;&#29087;&#30340;&#35745;&#31639;&#26694;&#26550;&#65292;&#35813;&#26694;&#26550;&#35748;&#20026;&#20915;&#31574;&#26159;&#20174;&#26434;&#38899;&#32047;&#31215;&#30340;&#35777;&#25454;&#20013;&#20135;&#29983;&#30340;&#65292;&#24182;&#20171;&#32461;&#20102;&#30456;&#20851;&#30340;&#24515;&#29702;&#23398;&#12289;&#31070;&#32463;&#31185;&#23398;&#21644;&#32463;&#27982;&#23398;&#30340;&#23454;&#35777;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Over the past decades, cognitive neuroscientists and behavioral economists have recognized the value of describing the process of decision making in detail and modeling the emergence of decisions over time. For example, the time it takes to decide can reveal more about an agents true hidden preferences than only the decision itself. Similarly, data that track the ongoing decision process such as eye movements or neural recordings contain critical information that can be exploited, even if no decision is made. Here, we argue that artificial intelligence (AI) research would benefit from a stronger focus on insights about how decisions emerge over time and incorporate related process data to improve AI predictions in general and human-AI interactions in particular. First, we introduce a highly established computational framework that assumes decisions to emerge from the noisy accumulation of evidence, and we present related empirical work in psychology, neuroscience, and economics. Next, 
&lt;/p&gt;</description></item></channel></rss>