<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36890;&#36807;&#25972;&#21512;&#22522;&#20110;&#32467;&#26500;&#30340;&#23545;&#25509;&#21644;&#22522;&#20110;&#24207;&#21015;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#65292;&#26174;&#33879;&#25913;&#21892;&#20102;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.03946</link><description>&lt;p&gt;
&#36890;&#36807;&#20803;&#27169;&#22411;&#25913;&#36827;&#20102;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Improved prediction of ligand-protein binding affinities by meta-modeling. (arXiv:2310.03946v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03946
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25972;&#21512;&#22522;&#20110;&#32467;&#26500;&#30340;&#23545;&#25509;&#21644;&#22522;&#20110;&#24207;&#21015;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#65292;&#26174;&#33879;&#25913;&#21892;&#20102;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35745;&#31639;&#26041;&#27861;&#20934;&#30830;&#31579;&#36873;&#20505;&#36873;&#33647;&#29289;&#37197;&#20307;&#19982;&#38774;&#34507;&#30333;&#30340;&#32467;&#21512;&#26159;&#33647;&#29289;&#24320;&#21457;&#30340;&#20027;&#35201;&#20851;&#27880;&#28857;&#65292;&#22240;&#20026;&#31579;&#36873;&#28508;&#22312;&#20505;&#36873;&#29289;&#33021;&#22815;&#33410;&#30465;&#25214;&#33647;&#29289;&#30340;&#26102;&#38388;&#21644;&#36153;&#29992;&#12290;&#36825;&#31181;&#34394;&#25311;&#31579;&#36873;&#37096;&#20998;&#20381;&#36182;&#20110;&#39044;&#27979;&#37197;&#20307;&#21644;&#34507;&#30333;&#36136;&#20043;&#38388;&#30340;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#26041;&#27861;&#12290;&#37492;&#20110;&#23384;&#22312;&#35768;&#22810;&#35745;&#31639;&#27169;&#22411;&#23545;&#19981;&#21516;&#30446;&#26631;&#30340;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#32467;&#26524;&#19981;&#21516;&#65292;&#25105;&#20204;&#22312;&#36825;&#37324;&#24320;&#21457;&#20102;&#19968;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#65292;&#36890;&#36807;&#25972;&#21512;&#24050;&#21457;&#34920;&#30340;&#22522;&#20110;&#32467;&#26500;&#30340;&#23545;&#25509;&#21644;&#22522;&#20110;&#24207;&#21015;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#26469;&#26500;&#24314;&#12290;&#22312;&#26500;&#24314;&#36825;&#20010;&#26694;&#26550;&#26102;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#35768;&#22810;&#32452;&#21512;&#30340;&#20010;&#21035;&#27169;&#22411;&#12289;&#35757;&#32451;&#25968;&#25454;&#24211;&#20197;&#21450;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#30340;&#20803;&#27169;&#22411;&#26041;&#27861;&#12290;&#25105;&#20204;&#26174;&#31034;&#20986;&#35768;&#22810;&#20803;&#27169;&#22411;&#22312;&#20146;&#21644;&#21147;&#39044;&#27979;&#19978;&#26174;&#33879;&#25913;&#21892;&#20102;&#20010;&#21035;&#22522;&#30784;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#26368;&#22909;&#30340;&#20803;&#27169;&#22411;&#36798;&#21040;&#20102;&#19982;&#26368;&#20808;&#36827;&#30340;&#32431;&#32467;&#26500;&#20026;&#22522;&#30784;&#30340;&#28145;&#24230;&#23398;&#20064;&#24037;&#20855;&#30456;&#24403;&#30340;&#24615;&#33021;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25913;&#21892;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
The accurate screening of candidate drug ligands against target proteins through computational approaches is of prime interest to drug development efforts, as filtering potential candidates would save time and expenses for finding drugs. Such virtual screening depends in part on methods to predict the binding affinity between ligands and proteins. Given many computational models for binding affinity prediction with varying results across targets, we herein develop a meta-modeling framework by integrating published empirical structure-based docking and sequence-based deep learning models. In building this framework, we evaluate many combinations of individual models, training databases, and linear and nonlinear meta-modeling approaches. We show that many of our meta-models significantly improve affinity predictions over individual base models. Our best meta-models achieve comparable performance to state-of-the-art exclusively structure-based deep learning tools. Overall, we demonstrate 
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;Transformer&#27169;&#22411;&#23545;DNA&#24207;&#21015;&#36827;&#34892;&#23545;&#40784;&#65292;&#36890;&#36807;&#29983;&#25104;&#25968;&#20540;&#34920;&#31034;&#26469;&#23454;&#29616;&#12290;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#30701;DNA&#24207;&#21015;&#30340;&#20998;&#31867;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#23545;&#20110;&#22522;&#22240;&#32452;&#23398;&#20998;&#26512;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2309.11087</link><description>&lt;p&gt;
Embed-Search-Align: &#20351;&#29992;Transformer&#27169;&#22411;&#36827;&#34892;DNA&#24207;&#21015;&#23545;&#40784;
&lt;/p&gt;
&lt;p&gt;
Embed-Search-Align: DNA Sequence Alignment using Transformer Models. (arXiv:2309.11087v1 [q-bio.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11087
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;Transformer&#27169;&#22411;&#23545;DNA&#24207;&#21015;&#36827;&#34892;&#23545;&#40784;&#65292;&#36890;&#36807;&#29983;&#25104;&#25968;&#20540;&#34920;&#31034;&#26469;&#23454;&#29616;&#12290;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#30701;DNA&#24207;&#21015;&#30340;&#20998;&#31867;&#20219;&#21153;&#19978;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#23545;&#20110;&#22522;&#22240;&#32452;&#23398;&#20998;&#26512;&#20855;&#26377;&#28508;&#22312;&#30340;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
DNA&#24207;&#21015;&#23545;&#40784;&#28041;&#21450;&#23558;&#30701;DNA&#35835;&#21462;&#20998;&#37197;&#21040;&#24191;&#27867;&#30340;&#21442;&#32771;&#22522;&#22240;&#32452;&#19978;&#30340;&#26368;&#21487;&#33021;&#20301;&#32622;&#12290;&#36825;&#20010;&#36807;&#31243;&#23545;&#20110;&#21508;&#31181;&#22522;&#22240;&#32452;&#23398;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#65292;&#21253;&#25324;&#21464;&#24322;&#35843;&#29992;&#12289;&#36716;&#24405;&#32452;&#23398;&#21644;&#34920;&#35266;&#22522;&#22240;&#32452;&#23398;&#12290;&#20256;&#32479;&#26041;&#27861;&#32463;&#36807;&#25968;&#21313;&#24180;&#30340;&#25913;&#36827;&#65292;&#20197;&#20004;&#20010;&#27493;&#39588;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65306;&#20808;&#36827;&#34892;&#22522;&#22240;&#32452;&#32034;&#24341;&#65292;&#28982;&#21518;&#36827;&#34892;&#39640;&#25928;&#25628;&#32034;&#20197;&#30830;&#23450;&#32473;&#23450;&#35835;&#21462;&#30340;&#21487;&#33021;&#20301;&#32622;&#12290;&#22312;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22312;&#23558;&#25991;&#26412;&#32534;&#30721;&#20026;&#23884;&#20837;&#21521;&#37327;&#26041;&#38754;&#21462;&#24471;&#25104;&#21151;&#30340;&#22522;&#30784;&#19978;&#65292;&#26368;&#36817;&#30340;&#30740;&#31350;&#21162;&#21147;&#25506;&#32034;&#20102;&#26159;&#21542;&#21487;&#20197;&#20351;&#29992;&#30456;&#21516;&#30340;Transformer&#26550;&#26500;&#20026;DNA&#24207;&#21015;&#29983;&#25104;&#25968;&#20540;&#34920;&#31034;&#12290;&#36825;&#26679;&#30340;&#27169;&#22411;&#24050;&#32463;&#22312;&#28041;&#21450;&#20998;&#31867;&#30701;DNA&#24207;&#21015;&#30340;&#20219;&#21153;&#20013;&#26174;&#31034;&#20986;&#26089;&#26399;&#30340;&#28508;&#21147;&#65292;&#20363;&#22914;&#26816;&#27979;&#32534;&#30721;&#21644;&#38750;&#32534;&#30721;&#21306;&#22495;&#20197;&#21450;&#35782;&#21035;&#22686;&#24378;&#23376;&#21644;&#21551;&#21160;&#23376;&#24207;&#21015;&#12290;&#28982;&#32780;&#65292;&#24207;&#21015;&#20998;&#31867;&#20219;&#21153;&#30340;&#24615;&#33021;&#24182;&#19981;&#33021;&#30452;&#25509;&#24212;&#29992;&#20110;&#24207;&#21015;&#23545;&#40784;&#20219;&#21153;&#65292;&#23545;&#40784;&#20219;&#21153;&#30340;&#20851;&#38190;&#26159;&#22312;&#20445;&#25345;&#24207;&#21015;&#30456;&#20284;&#24615;&#30340;&#21516;&#26102;&#25214;&#21040;&#26368;&#20339;&#30340;&#23545;&#24212;&#20301;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
DNA sequence alignment involves assigning short DNA reads to the most probable locations on an extensive reference genome. This process is crucial for various genomic analyses, including variant calling, transcriptomics, and epigenomics. Conventional methods, refined over decades, tackle this challenge in two steps: genome indexing followed by efficient search to locate likely positions for given reads. Building on the success of Large Language Models (LLM) in encoding text into embeddings, where the distance metric captures semantic similarity, recent efforts have explored whether the same Transformer architecture can produce numerical representations for DNA sequences. Such models have shown early promise in tasks involving classification of short DNA sequences, such as the detection of coding vs non-coding regions, as well as the identification of enhancer and promoter sequences. Performance at sequence classification tasks does not, however, translate to sequence alignment, where i
&lt;/p&gt;</description></item></channel></rss>