<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#20027;&#21160;&#25512;&#29702;&#30340;&#35745;&#31639;&#27169;&#22411;&#65292;&#29992;&#20110;&#27169;&#25311;&#38405;&#35835;&#36807;&#31243;&#20013;&#30340;&#30524;&#21160;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#33021;&#22815;&#20934;&#30830;&#22320;&#39044;&#27979;&#21644;&#25512;&#29702;&#19981;&#21516;&#31890;&#24230;&#30340;&#25991;&#26412;&#20449;&#24687;&#65292;&#24182;&#33021;&#22815;&#27169;&#25311;&#38405;&#35835;&#38556;&#30861;&#20013;&#19981;&#36866;&#24212;&#25512;&#29702;&#25928;&#26524;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2308.04941</link><description>&lt;p&gt;
&#38598;&#25104;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#20027;&#21160;&#25512;&#29702;&#20197;&#29702;&#35299;&#38405;&#35835;&#21644;&#38405;&#35835;&#38556;&#30861;&#20013;&#30340;&#30524;&#21160;&#34892;&#20026;
&lt;/p&gt;
&lt;p&gt;
Integrating large language models and active inference to understand eye movements in reading and dyslexia. (arXiv:2308.04941v1 [q-bio.NC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04941
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21644;&#20027;&#21160;&#25512;&#29702;&#30340;&#35745;&#31639;&#27169;&#22411;&#65292;&#29992;&#20110;&#27169;&#25311;&#38405;&#35835;&#36807;&#31243;&#20013;&#30340;&#30524;&#21160;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#33021;&#22815;&#20934;&#30830;&#22320;&#39044;&#27979;&#21644;&#25512;&#29702;&#19981;&#21516;&#31890;&#24230;&#30340;&#25991;&#26412;&#20449;&#24687;&#65292;&#24182;&#33021;&#22815;&#27169;&#25311;&#38405;&#35835;&#38556;&#30861;&#20013;&#19981;&#36866;&#24212;&#25512;&#29702;&#25928;&#26524;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35745;&#31639;&#27169;&#22411;&#65292;&#37319;&#29992;&#23618;&#27425;&#21270;&#20027;&#21160;&#25512;&#29702;&#26469;&#27169;&#25311;&#38405;&#35835;&#21644;&#30524;&#21160;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#23558;&#35821;&#35328;&#22788;&#29702;&#25551;&#36848;&#20026;&#23545;&#23618;&#27425;&#29983;&#25104;&#27169;&#22411;&#30340;&#25512;&#29702;&#65292;&#20174;&#38899;&#33410;&#21040;&#21477;&#23376;&#30340;&#19981;&#21516;&#31890;&#24230;&#23454;&#29616;&#39044;&#27979;&#21644;&#25512;&#29702;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32467;&#21512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#20248;&#21183;&#65292;&#29992;&#20110;&#23454;&#29616;&#36924;&#30495;&#30340;&#25991;&#26412;&#39044;&#27979;&#65292;&#20197;&#21450;&#20027;&#21160;&#25512;&#29702;&#29992;&#20110;&#24341;&#23548;&#30524;&#21160;&#21040;&#20449;&#24687;&#20016;&#23500;&#30340;&#25991;&#26412;&#20449;&#24687;&#65292;&#20174;&#32780;&#20351;&#24471;&#23545;&#39044;&#27979;&#36827;&#34892;&#27979;&#35797;&#25104;&#20026;&#21487;&#33021;&#12290;&#35813;&#27169;&#22411;&#33021;&#22815;&#29087;&#32451;&#38405;&#35835;&#24050;&#30693;&#21644;&#26410;&#30693;&#30340;&#21333;&#35789;&#21644;&#21477;&#23376;&#65292;&#24182;&#36981;&#24490;&#38405;&#35835;&#21452;&#36335;&#29702;&#35770;&#20013;&#30340;&#35789;&#27719;&#21644;&#38750;&#35789;&#27719;&#36335;&#24452;&#30340;&#21306;&#20998;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#20801;&#35768;&#27169;&#25311;&#38405;&#35835;&#36807;&#31243;&#20013;&#23545;&#30524;&#21160;&#34892;&#20026;&#20135;&#29983;&#19981;&#36866;&#24212;&#25512;&#29702;&#25928;&#26524;&#30340;&#24773;&#20917;&#65292;&#20363;&#22914;&#38405;&#35835;&#38556;&#30861;&#12290;&#20026;&#20102;&#27169;&#25311;&#36825;&#31181;&#24773;&#20917;&#65292;&#25105;&#20204;&#22312;&#38405;&#35835;&#36807;&#31243;&#20013;&#20943;&#24369;&#20102;&#20808;&#39564;&#30340;&#36129;&#29486;&#65292;&#23548;&#33268;&#19981;&#27491;&#30830;&#30340;&#25512;&#29702;&#21644;&#26356;&#21152;&#26029;&#29255;&#21270;&#30340;&#38405;&#35835;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a novel computational model employing hierarchical active inference to simulate reading and eye movements. The model characterizes linguistic processing as inference over a hierarchical generative model, facilitating predictions and inferences at various levels of granularity, from syllables to sentences.  Our approach combines the strengths of large language models for realistic textual predictions and active inference for guiding eye movements to informative textual information, enabling the testing of predictions. The model exhibits proficiency in reading both known and unknown words and sentences, adhering to the distinction between lexical and nonlexical routes in dual-route theories of reading. Notably, our model permits the exploration of maladaptive inference effects on eye movements during reading, such as in dyslexia. To simulate this condition, we attenuate the contribution of priors during the reading process, leading to incorrect inferences and a more fragmented
&lt;/p&gt;</description></item></channel></rss>