<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>FraGNNet&#26159;&#19968;&#31181;&#29992;&#20110;&#21270;&#21512;&#29289;&#21040;&#36136;&#35889;&#39044;&#27979;&#30340;&#28145;&#24230;&#27010;&#29575;&#27169;&#22411;&#65292;&#33021;&#22815;&#39640;&#25928;&#20934;&#30830;&#22320;&#39044;&#27979;&#39640;&#20998;&#36776;&#29575;&#35889;&#65292;&#22312;&#24615;&#33021;&#19978;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#27169;&#22411;</title><link>https://arxiv.org/abs/2404.02360</link><description>&lt;p&gt;
FraGNNet&#65306;&#19968;&#31181;&#29992;&#20110;&#36136;&#35889;&#39044;&#27979;&#30340;&#28145;&#24230;&#27010;&#29575;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
FraGNNet: A Deep Probabilistic Model for Mass Spectrum Prediction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02360
&lt;/p&gt;
&lt;p&gt;
FraGNNet&#26159;&#19968;&#31181;&#29992;&#20110;&#21270;&#21512;&#29289;&#21040;&#36136;&#35889;&#39044;&#27979;&#30340;&#28145;&#24230;&#27010;&#29575;&#27169;&#22411;&#65292;&#33021;&#22815;&#39640;&#25928;&#20934;&#30830;&#22320;&#39044;&#27979;&#39640;&#20998;&#36776;&#29575;&#35889;&#65292;&#22312;&#24615;&#33021;&#19978;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35782;&#21035;&#22797;&#26434;&#28151;&#21512;&#29289;&#20013;&#21270;&#21512;&#29289;&#30340;&#26041;&#27861;&#20013;&#65292;&#36136;&#35889;&#30340;&#35782;&#21035;&#26159;&#19968;&#20010;&#20851;&#38190;&#27493;&#39588;&#12290;&#20256;&#32479;&#30340;&#36136;&#35889;&#21040;&#21270;&#21512;&#29289;&#65288;MS2C&#65289;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#28041;&#21450;&#23558;&#26410;&#30693;&#30340;&#36136;&#35889;&#19982;&#24050;&#30693;&#30340;&#36136;&#35889;-&#20998;&#23376;&#24211;&#36827;&#34892;&#21305;&#37197;&#65292;&#20294;&#36825;&#31181;&#26041;&#27861;&#21463;&#38480;&#20110;&#24211;&#35206;&#30422;&#19981;&#23436;&#25972;&#12290;&#21270;&#21512;&#29289;&#21040;&#36136;&#35889;&#65288;C2MS&#65289;&#27169;&#22411;&#21487;&#20197;&#36890;&#36807;&#23558;&#30495;&#23454;&#24211;&#19982;&#39044;&#27979;&#35889;&#36827;&#34892;&#22686;&#24378;&#26469;&#25552;&#39640;&#26816;&#32034;&#29575;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#35768;&#22810;&#29616;&#26377;&#30340;C2MS&#27169;&#22411;&#22312;&#39044;&#27979;&#20998;&#36776;&#29575;&#12289;&#21487;&#25193;&#23637;&#24615;&#25110;&#21487;&#35299;&#37322;&#24615;&#26041;&#38754;&#23384;&#22312;&#38382;&#39064;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;C2MS&#39044;&#27979;&#27010;&#29575;&#26041;&#27861;&#8212;&#8212;FraGNNet&#65292;&#21487;&#20197;&#39640;&#25928;&#20934;&#30830;&#22320;&#39044;&#27979;&#39640;&#20998;&#36776;&#29575;&#35889;&#12290;FraGNNet&#20351;&#29992;&#32467;&#26500;&#21270;&#30340;&#28508;&#22312;&#31354;&#38388;&#26469;&#25581;&#31034;&#23450;&#20041;&#35889;&#30340;&#22522;&#26412;&#36807;&#31243;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#39044;&#27979;&#35823;&#24046;&#26041;&#38754;&#23454;&#29616;&#20102;&#26368;&#20808;&#36827;&#30340;&#24615;&#33021;&#65292;&#24182;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;C2MS&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02360v1 Announce Type: new  Abstract: The process of identifying a compound from its mass spectrum is a critical step in the analysis of complex mixtures. Typical solutions for the mass spectrum to compound (MS2C) problem involve matching the unknown spectrum against a library of known spectrum-molecule pairs, an approach that is limited by incomplete library coverage. Compound to mass spectrum (C2MS) models can improve retrieval rates by augmenting real libraries with predicted spectra. Unfortunately, many existing C2MS models suffer from problems with prediction resolution, scalability, or interpretability. We develop a new probabilistic method for C2MS prediction, FraGNNet, that can efficiently and accurately predict high-resolution spectra. FraGNNet uses a structured latent space to provide insight into the underlying processes that define the spectrum. Our model achieves state-of-the-art performance in terms of prediction error, and surpasses existing C2MS models as a t
&lt;/p&gt;</description></item></channel></rss>