<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#25552;&#20986;&#20102;&#21452;&#31354;&#38388;&#20248;&#21270;&#65288;DSO&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#28508;&#22312;&#31354;&#38388;&#37319;&#26679;&#21644;&#25968;&#25454;&#31354;&#38388;&#36873;&#25321;&#65292;&#20351;&#29992;Latent Prompt Transformer (LPT)&#29983;&#25104;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#20998;&#23376;&#35774;&#35745;&#20013;&#30340;&#20851;&#38190;&#38382;&#39064;&#65292;&#21462;&#24471;&#20102;&#22312;&#19981;&#21516;&#20219;&#21153;&#20013;&#30340;&#24615;&#33021;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2402.17179</link><description>&lt;p&gt;
&#21452;&#31354;&#38388;&#20248;&#21270;&#65306;&#36890;&#36807;&#28508;&#22312;&#25552;&#31034;&#21464;&#25442;&#22120;&#25913;&#36827;&#20998;&#23376;&#24207;&#21015;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Dual-Space Optimization: Improved Molecule Sequence Design by Latent Prompt Transformer
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17179
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#21452;&#31354;&#38388;&#20248;&#21270;&#65288;DSO&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#25972;&#21512;&#28508;&#22312;&#31354;&#38388;&#37319;&#26679;&#21644;&#25968;&#25454;&#31354;&#38388;&#36873;&#25321;&#65292;&#20351;&#29992;Latent Prompt Transformer (LPT)&#29983;&#25104;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#20998;&#23376;&#35774;&#35745;&#20013;&#30340;&#20851;&#38190;&#38382;&#39064;&#65292;&#21462;&#24471;&#20102;&#22312;&#19981;&#21516;&#20219;&#21153;&#20013;&#30340;&#24615;&#33021;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20855;&#26377;&#29702;&#24819;&#24615;&#36136;&#65288;&#22914;&#33647;&#29289;&#26679;&#24615;&#21644;&#23545;&#34507;&#30333;&#38774;&#28857;&#30340;&#39640;&#32467;&#21512;&#20146;&#21644;&#21147;&#65289;&#30340;&#20998;&#23376;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21452;&#31354;&#38388;&#20248;&#21270;&#65288;DSO&#65289;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#25972;&#21512;&#20102;&#28508;&#22312;&#31354;&#38388;&#37319;&#26679;&#21644;&#25968;&#25454;&#31354;&#38388;&#36873;&#25321;&#26469;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#12290;DSO&#36890;&#36807;&#36845;&#20195;&#26356;&#26032;&#28508;&#22312;&#31354;&#38388;&#29983;&#25104;&#27169;&#22411;&#21644;&#21512;&#25104;&#25968;&#25454;&#38598;&#65292;&#36880;&#27493;&#23558;&#29983;&#25104;&#27169;&#22411;&#21644;&#21512;&#25104;&#25968;&#25454;&#31227;&#21521;&#25152;&#38656;&#24615;&#36136;&#25968;&#20540;&#30340;&#21306;&#22495;&#12290;&#25105;&#20204;&#30340;&#29983;&#25104;&#27169;&#22411;&#37319;&#29992;&#28508;&#22312;&#25552;&#31034;&#21464;&#25442;&#22120;&#65288;LPT&#65289;&#30340;&#24418;&#24335;&#65292;&#20854;&#20013;&#28508;&#22312;&#21521;&#37327;&#20805;&#24403;&#22240;&#26524;&#21464;&#25442;&#22120;&#30340;&#25552;&#31034;&#12290;&#25105;&#20204;&#24191;&#27867;&#30340;&#23454;&#39564;&#34920;&#26126;&#20102;&#25552;&#20986;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#35813;&#26041;&#27861;&#22312;&#21333;&#30446;&#26631;&#12289;&#22810;&#30446;&#26631;&#21644;&#32422;&#26463;&#20998;&#23376;&#35774;&#35745;&#20219;&#21153;&#20013;&#26641;&#31435;&#20102;&#26032;&#30340;&#24615;&#33021;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17179v1 Announce Type: new  Abstract: Designing molecules with desirable properties, such as drug-likeliness and high binding affinities towards protein targets, is a challenging problem. In this paper, we propose the Dual-Space Optimization (DSO) method that integrates latent space sampling and data space selection to solve this problem. DSO iteratively updates a latent space generative model and a synthetic dataset in an optimization process that gradually shifts the generative model and the synthetic data towards regions of desired property values. Our generative model takes the form of a Latent Prompt Transformer (LPT) where the latent vector serves as the prompt of a causal transformer. Our extensive experiments demonstrate effectiveness of the proposed method, which sets new performance benchmarks across single-objective, multi-objective and constrained molecule design tasks.
&lt;/p&gt;</description></item></channel></rss>