<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29109;&#21305;&#37197;&#26694;&#26550;&#30340;&#26032;&#30340;&#21487;&#22788;&#29702;&#30340;&#25512;&#26029;&#26041;&#26696;&#65292;&#21487;&#20197;&#23884;&#20837;&#21040;&#26399;&#26395;&#20256;&#25773;&#31639;&#27861;&#20013;&#65292;&#23545;&#20110;&#25551;&#36848;&#31163;&#25955;&#29366;&#24577;&#31354;&#38388;&#36807;&#31243;&#30340;Markov&#36339;&#36291;&#36807;&#31243;&#30340;&#32479;&#35745;&#25512;&#26029;&#38382;&#39064;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#36890;&#36807;&#25552;&#20379;&#19968;&#31867;&#36817;&#20284;&#20998;&#24067;&#30340;&#38381;&#24335;&#32467;&#26524;&#20197;&#21450;&#24212;&#29992;&#20110;&#21270;&#23398;&#21453;&#24212;&#32593;&#32476;&#30340;&#19968;&#33324;&#31867;&#21035;&#26469;&#21152;&#20197;&#35770;&#35777;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#36817;&#20284;&#30340;&#26399;&#26395;&#26368;&#22823;&#21270;&#31243;&#24207;&#23548;&#20986;&#20102;&#28508;&#22312;&#21442;&#25968;&#30340;&#28857;&#20272;&#35745;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#22312;&#21508;&#31181;&#21270;&#23398;&#21453;&#24212;&#32593;&#32476;&#31034;&#20363;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#35813;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#21644;&#26410;&#26469;&#30340;&#28508;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.15604</link><description>&lt;p&gt;
Entropic Matching&#29992;&#20110;Markov&#36339;&#36291;&#36807;&#31243;&#30340;&#26399;&#26395;&#20256;&#25773;&#30340;&#29109;&#21305;&#37197;
&lt;/p&gt;
&lt;p&gt;
Entropic Matching for Expectation Propagation of Markov Jump Processes. (arXiv:2309.15604v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15604
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29109;&#21305;&#37197;&#26694;&#26550;&#30340;&#26032;&#30340;&#21487;&#22788;&#29702;&#30340;&#25512;&#26029;&#26041;&#26696;&#65292;&#21487;&#20197;&#23884;&#20837;&#21040;&#26399;&#26395;&#20256;&#25773;&#31639;&#27861;&#20013;&#65292;&#23545;&#20110;&#25551;&#36848;&#31163;&#25955;&#29366;&#24577;&#31354;&#38388;&#36807;&#31243;&#30340;Markov&#36339;&#36291;&#36807;&#31243;&#30340;&#32479;&#35745;&#25512;&#26029;&#38382;&#39064;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#36890;&#36807;&#25552;&#20379;&#19968;&#31867;&#36817;&#20284;&#20998;&#24067;&#30340;&#38381;&#24335;&#32467;&#26524;&#20197;&#21450;&#24212;&#29992;&#20110;&#21270;&#23398;&#21453;&#24212;&#32593;&#32476;&#30340;&#19968;&#33324;&#31867;&#21035;&#26469;&#21152;&#20197;&#35770;&#35777;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#36817;&#20284;&#30340;&#26399;&#26395;&#26368;&#22823;&#21270;&#31243;&#24207;&#23548;&#20986;&#20102;&#28508;&#22312;&#21442;&#25968;&#30340;&#28857;&#20272;&#35745;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#22312;&#21508;&#31181;&#21270;&#23398;&#21453;&#24212;&#32593;&#32476;&#31034;&#20363;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#35813;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#21644;&#26410;&#26469;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#28508;&#22312;&#36830;&#32493;&#26102;&#38388;&#38543;&#26426;&#36807;&#31243;&#30340;&#32479;&#35745;&#25512;&#26029;&#38382;&#39064;&#65292;&#35813;&#38382;&#39064;&#36890;&#24120;&#38590;&#20197;&#22788;&#29702;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#30001;Markov&#36339;&#36291;&#36807;&#31243;&#25551;&#36848;&#30340;&#31163;&#25955;&#29366;&#24577;&#31354;&#38388;&#36807;&#31243;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21487;&#22788;&#29702;&#30340;&#25512;&#26029;&#26041;&#26696;&#65292;&#22522;&#20110;&#29109;&#21305;&#37197;&#26694;&#26550;&#65292;&#21487;&#20197;&#23884;&#20837;&#21040;&#20247;&#25152;&#21608;&#30693;&#30340;&#26399;&#26395;&#20256;&#25773;&#31639;&#27861;&#20013;&#12290;&#25105;&#20204;&#36890;&#36807;&#20026;&#19968;&#31867;&#31616;&#21333;&#30340;&#36817;&#20284;&#20998;&#24067;&#25552;&#20379;&#38381;&#24335;&#32467;&#26524;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#21270;&#23398;&#21453;&#24212;&#32593;&#32476;&#30340;&#19968;&#33324;&#31867;&#21035;&#65292;&#35813;&#31867;&#21035;&#26159;&#31995;&#32479;&#29983;&#29289;&#23398;&#24314;&#27169;&#30340;&#37325;&#35201;&#24037;&#20855;&#65292;&#26469;&#35777;&#26126;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;&#36817;&#20284;&#30340;&#26399;&#26395;&#26368;&#22823;&#21270;&#31243;&#24207;&#23548;&#20986;&#20102;&#28508;&#22312;&#21442;&#25968;&#30340;&#28857;&#20272;&#35745;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#25105;&#20204;&#26041;&#27861;&#22312;&#21508;&#31181;&#21270;&#23398;&#21453;&#24212;&#32593;&#32476;&#31034;&#20363;&#20013;&#30340;&#24615;&#33021;&#65292;&#21253;&#25324;&#38543;&#26426;&#30340;Lotka-Voltera&#31034;&#20363;&#65292;&#24182;&#35752;&#35770;&#20102;&#23427;&#30340;&#23616;&#38480;&#24615;&#21644;&#26410;&#26469;&#30340;&#28508;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper addresses the problem of statistical inference for latent continuous-time stochastic processes, which is often intractable, particularly for discrete state space processes described by Markov jump processes. To overcome this issue, we propose a new tractable inference scheme based on an entropic matching framework that can be embedded into the well-known expectation propagation algorithm. We demonstrate the effectiveness of our method by providing closed-form results for a simple family of approximate distributions and apply it to the general class of chemical reaction networks, which are a crucial tool for modeling in systems biology. Moreover, we derive closed form expressions for point estimation of the underlying parameters using an approximate expectation maximization procedure. We evaluate the performance of our method on various chemical reaction network instantiations, including a stochastic Lotka-Voltera example, and discuss its limitations and potential for future 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23384;&#22312;&#28151;&#28102;&#25928;&#24212;&#26102;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#22823;&#35268;&#27169;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#27491;&#20132;&#32467;&#26500;&#21644;&#32447;&#24615;&#25237;&#24433;&#30340;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#30001;&#20110;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#24341;&#36215;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.07261</link><description>&lt;p&gt;
&#20855;&#26377;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#21516;&#26102;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Simultaneous inference for generalized linear models with unmeasured confounders. (arXiv:2309.07261v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07261
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23384;&#22312;&#28151;&#28102;&#25928;&#24212;&#26102;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#22823;&#35268;&#27169;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#27491;&#20132;&#32467;&#26500;&#21644;&#32447;&#24615;&#25237;&#24433;&#30340;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#30001;&#20110;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#24341;&#36215;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22522;&#22240;&#32452;&#30740;&#31350;&#20013;&#65292;&#24120;&#24120;&#36827;&#34892;&#25104;&#21315;&#19978;&#19975;&#20010;&#21516;&#26102;&#20551;&#35774;&#26816;&#39564;&#65292;&#20197;&#30830;&#23450;&#24046;&#24322;&#34920;&#36798;&#30340;&#22522;&#22240;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#23384;&#22312;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#65292;&#35768;&#22810;&#26631;&#20934;&#32479;&#35745;&#26041;&#27861;&#21487;&#33021;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#24046;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#23384;&#22312;&#28151;&#28102;&#25928;&#24212;&#26102;&#30340;&#22810;&#20803;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#22823;&#35268;&#27169;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#12290;&#22312;&#20219;&#24847;&#28151;&#28102;&#26426;&#21046;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#27491;&#20132;&#32467;&#26500;&#24182;&#23558;&#32447;&#24615;&#25237;&#24433;&#25972;&#21512;&#21040;&#19977;&#20010;&#20851;&#38190;&#38454;&#27573;&#20013;&#12290;&#39318;&#20808;&#65292;&#21033;&#29992;&#22810;&#20803;&#21709;&#24212;&#21464;&#37327;&#20998;&#31163;&#36793;&#38469;&#21644;&#19981;&#30456;&#20851;&#30340;&#28151;&#28102;&#25928;&#24212;&#65292;&#24674;&#22797;&#28151;&#28102;&#31995;&#25968;&#30340;&#21015;&#31354;&#38388;&#12290;&#38543;&#21518;&#65292;&#21033;&#29992;$\ell_1$&#27491;&#21017;&#21270;&#36827;&#34892;&#31232;&#30095;&#24615;&#20272;&#35745;&#65292;&#24182;&#24378;&#21152;&#27491;&#20132;&#24615;&#38480;&#21046;&#20110;&#28151;&#28102;&#31995;&#25968;&#65292;&#32852;&#21512;&#20272;&#35745;&#28508;&#22312;&#22240;&#23376;&#21644;&#20027;&#35201;&#25928;&#24212;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32467;&#21512;&#25237;&#24433;&#21644;&#21152;&#26435;&#20559;&#24046;&#26657;&#27491;&#27493;&#39588;&#12290;
&lt;/p&gt;
&lt;p&gt;
Tens of thousands of simultaneous hypothesis tests are routinely performed in genomic studies to identify differentially expressed genes. However, due to unmeasured confounders, many standard statistical approaches may be substantially biased. This paper investigates the large-scale hypothesis testing problem for multivariate generalized linear models in the presence of confounding effects. Under arbitrary confounding mechanisms, we propose a unified statistical estimation and inference framework that harnesses orthogonal structures and integrates linear projections into three key stages. It first leverages multivariate responses to separate marginal and uncorrelated confounding effects, recovering the confounding coefficients' column space. Subsequently, latent factors and primary effects are jointly estimated, utilizing $\ell_1$-regularization for sparsity while imposing orthogonality onto confounding coefficients. Finally, we incorporate projected and weighted bias-correction steps 
&lt;/p&gt;</description></item></channel></rss>