<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#20174;&#21333;&#20010;&#19977;&#32500;&#32467;&#26500;MRI&#24555;&#29031;&#20013;&#20272;&#35745;&#33014;&#36136;&#27597;&#32454;&#32990;&#30244;&#65288;GBM&#65289;&#29983;&#38271;&#27169;&#22411;&#30340;&#24739;&#32773;&#29305;&#24322;&#24615;&#21442;&#25968;&#65292;&#24182;&#36890;&#36807;&#25972;&#21512;&#29702;&#35770;&#21644;&#25968;&#25454;&#36827;&#34892;&#20010;&#24615;&#21270;&#39044;&#27979;&#65292;&#20026;&#33014;&#36136;&#27597;&#32454;&#32990;&#30244;&#30340;&#27835;&#30103;&#35774;&#35745;&#25552;&#20379;&#20102;&#20851;&#38190;&#21019;&#26032;&#12290;</title><link>http://arxiv.org/abs/2311.16536</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#39044;&#27979;&#33014;&#36136;&#27597;&#32454;&#32990;&#30244;&#28024;&#28070;:&#25968;&#23398;&#27169;&#22411;&#12289;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#21644;&#22810;&#27169;&#24577;&#25195;&#25551;
&lt;/p&gt;
&lt;p&gt;
Personalized Predictions of Glioblastoma Infiltration: Mathematical Models, Physics-Informed Neural Networks and Multimodal Scans. (arXiv:2311.16536v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.16536
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#20174;&#21333;&#20010;&#19977;&#32500;&#32467;&#26500;MRI&#24555;&#29031;&#20013;&#20272;&#35745;&#33014;&#36136;&#27597;&#32454;&#32990;&#30244;&#65288;GBM&#65289;&#29983;&#38271;&#27169;&#22411;&#30340;&#24739;&#32773;&#29305;&#24322;&#24615;&#21442;&#25968;&#65292;&#24182;&#36890;&#36807;&#25972;&#21512;&#29702;&#35770;&#21644;&#25968;&#25454;&#36827;&#34892;&#20010;&#24615;&#21270;&#39044;&#27979;&#65292;&#20026;&#33014;&#36136;&#27597;&#32454;&#32990;&#30244;&#30340;&#27835;&#30103;&#35774;&#35745;&#25552;&#20379;&#20102;&#20851;&#38190;&#21019;&#26032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#33014;&#36136;&#27597;&#32454;&#32990;&#30244;&#65288;GBM&#65289;&#20174;&#21307;&#23398;MRI&#25195;&#25551;&#20013;&#30340;&#28024;&#28070;&#23545;&#20110;&#29702;&#35299;&#32959;&#30244;&#29983;&#38271;&#21160;&#21147;&#23398;&#21644;&#35774;&#35745;&#20010;&#20307;&#21270;&#25918;&#23556;&#27835;&#30103;&#35745;&#21010;&#33267;&#20851;&#37325;&#35201;&#12290;GBM&#29983;&#38271;&#30340;&#25968;&#23398;&#27169;&#22411;&#21487;&#20197;&#22312;&#39044;&#27979;&#32959;&#30244;&#32454;&#32990;&#30340;&#31354;&#38388;&#20998;&#24067;&#20013;&#34917;&#20805;&#25968;&#25454;&#12290;&#28982;&#32780;&#65292;&#36825;&#38656;&#35201;&#20174;&#20020;&#24202;&#25968;&#25454;&#20013;&#20272;&#35745;&#27169;&#22411;&#30340;&#24739;&#32773;&#29305;&#24322;&#24615;&#21442;&#25968;&#65292;&#30001;&#20110;&#26102;&#38388;&#25968;&#25454;&#26377;&#38480;&#19988;&#25104;&#20687;&#21644;&#35786;&#26029;&#20043;&#38388;&#30340;&#26102;&#38388;&#26377;&#38480;&#65292;&#36825;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#21453;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#29289;&#29702;&#20449;&#24687;&#31070;&#32463;&#32593;&#32476;&#65288;PINNs&#65289;&#20174;&#21333;&#20010;&#19977;&#32500;&#32467;&#26500;MRI&#24555;&#29031;&#20013;&#20272;&#35745;GBM&#29983;&#38271;&#21453;&#24212;&#25193;&#25955;&#20559;&#24494;&#20998;&#26041;&#31243;&#27169;&#22411;&#30340;&#24739;&#32773;&#29305;&#24322;&#24615;&#21442;&#25968;&#30340;&#26041;&#27861;&#12290;PINNs&#23558;&#25968;&#25454;&#21644;PDE&#23884;&#20837;&#21040;&#25439;&#22833;&#20989;&#25968;&#20013;&#65292;&#20174;&#32780;&#25972;&#21512;&#20102;&#29702;&#35770;&#21644;&#25968;&#25454;&#12290;&#20851;&#38190;&#21019;&#26032;&#21253;&#25324;&#29305;&#24449;&#26080;&#37327;&#32434;&#21442;&#25968;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#65292;&#21033;&#29992;&#26080;&#37327;&#32434;&#21442;&#25968;&#30340;&#39044;&#35757;&#32451;&#27493;&#39588;&#20197;&#21450;&#24494;&#35843;&#27493;&#39588;&#12290;
&lt;/p&gt;
&lt;p&gt;
Predicting the infiltration of Glioblastoma (GBM) from medical MRI scans is crucial for understanding tumor growth dynamics and designing personalized radiotherapy treatment plans.Mathematical models of GBM growth can complement the data in the prediction of spatial distributions of tumor cells. However, this requires estimating patient-specific parameters of the model from clinical data, which is a challenging inverse problem due to limited temporal data and the limited time between imaging and diagnosis. This work proposes a method that uses Physics-Informed Neural Networks (PINNs) to estimate patient-specific parameters of a reaction-diffusion PDE model of GBM growth from a single 3D structural MRI snapshot. PINNs embed both the data and the PDE into a loss function, thus integrating theory and data. Key innovations include the identification and estimation of characteristic non-dimensional parameters, a pre-training step that utilizes the non-dimensional parameters and a fine-tunin
&lt;/p&gt;</description></item></channel></rss>