<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20351;&#29992;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#30830;&#23450;&#26368;&#23567;&#21442;&#25968;&#38598;&#65292;&#26377;&#25928;&#25551;&#36848;&#38543;&#26426;&#36807;&#31243;&#21160;&#21147;&#23398;&#65292;&#24182;&#29983;&#25104;&#33021;&#20934;&#30830;&#22797;&#21046;&#39044;&#26399;&#38543;&#26426;&#34892;&#20026;&#30340;&#26032;&#36712;&#36857;&#12290;</title><link>http://arxiv.org/abs/2307.11608</link><description>&lt;p&gt;
&#20351;&#29992;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#23398;&#20064;&#38543;&#26426;&#36807;&#31243;&#30340;&#26368;&#23567;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Learning minimal representations of stochastic processes with variational autoencoders. (arXiv:2307.11608v1 [cond-mat.soft])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11608
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20351;&#29992;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#30830;&#23450;&#26368;&#23567;&#21442;&#25968;&#38598;&#65292;&#26377;&#25928;&#25551;&#36848;&#38543;&#26426;&#36807;&#31243;&#21160;&#21147;&#23398;&#65292;&#24182;&#29983;&#25104;&#33021;&#20934;&#30830;&#22797;&#21046;&#39044;&#26399;&#38543;&#26426;&#34892;&#20026;&#30340;&#26032;&#36712;&#36857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#36807;&#31243;&#22312;&#31185;&#23398;&#20013;&#26377;&#35768;&#22810;&#24212;&#29992;&#65292;&#22240;&#20026;&#23427;&#20204;&#24191;&#27867;&#29992;&#20110;&#27169;&#25311;&#21508;&#31181;&#33258;&#28982;&#29616;&#35937;&#12290;&#30001;&#20110;&#20854;&#22266;&#26377;&#30340;&#38543;&#26426;&#24615;&#21644;&#19981;&#30830;&#23450;&#24615;&#65292;&#23427;&#20204;&#24456;&#38590;&#36827;&#34892;&#34920;&#24449;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26080;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#26377;&#25928;&#25551;&#36848;&#38543;&#26426;&#36807;&#31243;&#21160;&#21147;&#23398;&#25152;&#38656;&#30340;&#26368;&#23567;&#21442;&#25968;&#38598;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#24314;&#31435;&#22312;&#25193;&#23637;&#30340;&#946;-&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#26550;&#26500;&#19978;&#12290;&#36890;&#36807;&#19982;&#20856;&#22411;&#25193;&#25955;&#27169;&#22411;&#30456;&#23545;&#24212;&#30340;&#27169;&#25311;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#23427;&#22312;&#25552;&#21462;&#33021;&#20934;&#30830;&#25551;&#36848;&#36825;&#20123;&#21160;&#21147;&#23398;&#30340;&#26368;&#23567;&#30456;&#20851;&#21442;&#25968;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#29983;&#25104;&#24544;&#23454;&#22797;&#21046;&#39044;&#26399;&#38543;&#26426;&#34892;&#20026;&#30340;&#26032;&#36712;&#36857;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#24471;&#33021;&#22815;&#33258;&#21160;&#21457;&#29616;&#25551;&#36848;&#38543;&#26426;&#36807;&#31243;&#30340;&#26410;&#30693;&#21442;&#25968;&#65292;&#20174;&#32780;&#22686;&#36827;&#23545;&#21508;&#20010;&#39046;&#22495;&#20013;&#22797;&#26434;&#29616;&#35937;&#30340;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stochastic processes have found numerous applications in science, as they are broadly used to model a variety of natural phenomena. Due to their intrinsic randomness and uncertainty, they are however difficult to characterize. Here, we introduce an unsupervised machine learning approach to determine the minimal set of parameters required to effectively describe the dynamics of a stochastic process. Our method builds upon an extended $\beta$-variational autoencoder architecture. By means of simulated datasets corresponding to paradigmatic diffusion models, we showcase its effectiveness in extracting the minimal relevant parameters that accurately describe these dynamics. Furthermore, the method enables the generation of new trajectories that faithfully replicate the expected stochastic behavior. Overall, our approach enables for the autonomous discovery of unknown parameters describing stochastic processes, hence enhancing our comprehension of complex phenomena across various fields.
&lt;/p&gt;</description></item></channel></rss>