<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36825;&#39033;&#24037;&#20316;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;D-Mapper&#30340;&#20998;&#24067;&#24341;&#23548;Mapper&#31639;&#27861;&#65292;&#20351;&#29992;&#27010;&#29575;&#27169;&#22411;&#21644;&#25968;&#25454;&#22266;&#26377;&#29305;&#24449;&#29983;&#25104;&#23494;&#24230;&#24341;&#23548;&#30340;&#35206;&#30422;&#65292;&#24182;&#25552;&#20379;&#22686;&#24378;&#30340;&#25299;&#25169;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2401.12237</link><description>&lt;p&gt;
&#19968;&#31181;&#20998;&#24067;&#24341;&#23548;&#30340;Mapper&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
A distribution-guided Mapper algorithm. (arXiv:2401.12237v1 [math.AT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12237
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;D-Mapper&#30340;&#20998;&#24067;&#24341;&#23548;Mapper&#31639;&#27861;&#65292;&#20351;&#29992;&#27010;&#29575;&#27169;&#22411;&#21644;&#25968;&#25454;&#22266;&#26377;&#29305;&#24449;&#29983;&#25104;&#23494;&#24230;&#24341;&#23548;&#30340;&#35206;&#30422;&#65292;&#24182;&#25552;&#20379;&#22686;&#24378;&#30340;&#25299;&#25169;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#26426;&#65306;Mapper&#31639;&#27861;&#26159;&#25299;&#25169;&#25968;&#25454;&#20998;&#26512;&#20013;&#25506;&#32034;&#25968;&#25454;&#24418;&#29366;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#20351;&#29992;&#25968;&#25454;&#38598;&#20316;&#20026;&#36755;&#20837;&#65292;Mapper&#31639;&#27861;&#36755;&#20986;&#20195;&#34920;&#25972;&#20010;&#25968;&#25454;&#38598;&#25299;&#25169;&#29305;&#24449;&#30340;&#22270;&#24418;&#12290;&#36825;&#20010;&#22270;&#24418;&#36890;&#24120;&#34987;&#35748;&#20026;&#26159;&#25968;&#25454;&#30340;&#19968;&#20010;Reeb&#22270;&#30340;&#36817;&#20284;&#12290;&#32463;&#20856;&#30340;Mapper&#31639;&#27861;&#20351;&#29992;&#22266;&#23450;&#30340;&#21306;&#38388;&#38271;&#24230;&#21644;&#37325;&#21472;&#27604;&#29575;&#65292;&#36825;&#21487;&#33021;&#26080;&#27861;&#25581;&#31034;&#25968;&#25454;&#30340;&#24494;&#22937;&#29305;&#24449;&#65292;&#23588;&#20854;&#26159;&#24403;&#24213;&#23618;&#32467;&#26500;&#22797;&#26434;&#26102;&#12290;&#32467;&#26524;&#65306;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;D-Mapper&#30340;&#20998;&#24067;&#24341;&#23548;Mapper&#31639;&#27861;&#65292;&#21033;&#29992;&#27010;&#29575;&#27169;&#22411;&#30340;&#23646;&#24615;&#21644;&#25968;&#25454;&#22266;&#26377;&#29305;&#24449;&#29983;&#25104;&#23494;&#24230;&#24341;&#23548;&#30340;&#35206;&#30422;&#65292;&#24182;&#25552;&#20379;&#22686;&#24378;&#30340;&#25299;&#25169;&#29305;&#24449;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#31639;&#27861;&#26159;&#19968;&#31181;&#22522;&#20110;&#27010;&#29575;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#20316;&#20026;&#38750;&#27010;&#29575;&#24615;&#26041;&#27861;&#30340;&#26367;&#20195;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#24230;&#37327;&#26469;&#32771;&#34385;&#37325;&#21472;&#32858;&#31867;&#30340;&#36136;&#37327;&#21644;&#25193;&#23637;&#25345;&#32493;&#21516;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivation: The Mapper algorithm is an essential tool to explore shape of data in topology data analysis. With a dataset as an input, the Mapper algorithm outputs a graph representing the topological features of the whole dataset. This graph is often regarded as an approximation of a reeb graph of data. The classic Mapper algorithm uses fixed interval lengths and overlapping ratios, which might fail to reveal subtle features of data, especially when the underlying structure is complex.  Results: In this work, we introduce a distribution guided Mapper algorithm named D-Mapper, that utilizes the property of the probability model and data intrinsic characteristics to generate density guided covers and provides enhanced topological features. Our proposed algorithm is a probabilistic model-based approach, which could serve as an alternative to non-prababilistic ones. Moreover, we introduce a metric accounting for both the quality of overlap clustering and extended persistence homology to me
&lt;/p&gt;</description></item></channel></rss>