<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>MoleculeSDE&#26159;&#29992;&#20110;&#20998;&#23376;&#22810;&#27169;&#24577;&#39044;&#35757;&#32451;&#30340;&#32676;&#23545;&#31216;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#27169;&#22411;&#65292;&#36890;&#36807;&#22312;&#36755;&#20837;&#31354;&#38388;&#20013;&#30452;&#25509;&#29983;&#25104;3D&#20960;&#20309;&#19982;2D&#25299;&#25169;&#20043;&#38388;&#30340;&#36716;&#25442;&#65292;&#23427;&#33021;&#22815;&#26356;&#26377;&#25928;&#22320;&#20445;&#23384;&#20998;&#23376;&#32467;&#26500;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2305.18407</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#20998;&#23376;&#22810;&#27169;&#24577;&#39044;&#35757;&#32451;&#30340;&#32676;&#23545;&#31216;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
A Group Symmetric Stochastic Differential Equation Model for Molecule Multi-modal Pretraining. (arXiv:2305.18407v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18407
&lt;/p&gt;
&lt;p&gt;
MoleculeSDE&#26159;&#29992;&#20110;&#20998;&#23376;&#22810;&#27169;&#24577;&#39044;&#35757;&#32451;&#30340;&#32676;&#23545;&#31216;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#27169;&#22411;&#65292;&#36890;&#36807;&#22312;&#36755;&#20837;&#31354;&#38388;&#20013;&#30452;&#25509;&#29983;&#25104;3D&#20960;&#20309;&#19982;2D&#25299;&#25169;&#20043;&#38388;&#30340;&#36716;&#25442;&#65292;&#23427;&#33021;&#22815;&#26356;&#26377;&#25928;&#22320;&#20445;&#23384;&#20998;&#23376;&#32467;&#26500;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#23376;&#39044;&#35757;&#32451;&#24050;&#32463;&#25104;&#20026;&#25552;&#39640;&#22522;&#20110; AI &#30340;&#33647;&#29289;&#21457;&#29616;&#24615;&#33021;&#30340;&#20027;&#27969;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22823;&#37096;&#20998;&#29616;&#26377;&#30340;&#26041;&#27861;&#21482;&#20851;&#27880;&#21333;&#19968;&#30340;&#27169;&#24577;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#22823;&#21270;&#20004;&#31181;&#27169;&#24577;&#20043;&#38388;&#30340;&#20114;&#20449;&#24687;&#65288;MI&#65289;&#21487;&#20197;&#22686;&#24378;&#20998;&#23376;&#34920;&#31034;&#33021;&#21147;&#12290;&#32780;&#29616;&#26377;&#30340;&#20998;&#23376;&#22810;&#27169;&#24577;&#39044;&#35757;&#32451;&#26041;&#27861;&#22522;&#20110;&#20174;&#25299;&#25169;&#21644;&#20960;&#20309;&#32534;&#30721;&#30340;&#34920;&#31034;&#31354;&#38388;&#26469;&#20272;&#35745; MI&#65292;&#22240;&#27492;&#20002;&#22833;&#20102;&#20998;&#23376;&#30340;&#20851;&#38190;&#32467;&#26500;&#20449;&#24687;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102; MoleculeSDE&#12290;MoleculeSDE&#21033;&#29992;&#32676;&#23545;&#31216;&#65288;&#22914; SE&#65288;3&#65289;-&#31561;&#21464;&#21644;&#21453;&#23556;-&#21453;&#23545;&#31216;&#65289;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#27169;&#22411;&#22312;&#36755;&#20837;&#31354;&#38388;&#20013;&#30452;&#25509;&#29983;&#25104; 3D &#20960;&#20309;&#24418;&#29366;&#19982; 2D &#25299;&#25169;&#20043;&#38388;&#30340;&#36716;&#25442;&#12290;&#23427;&#19981;&#20165;&#33719;&#24471;&#26356;&#32039;&#30340;MI&#30028;&#38480;&#65292;&#32780;&#19988;&#36824;&#33021;&#22815;&#26377;&#25928;&#22320;&#20445;&#23384;&#20998;&#23376;&#32467;&#26500;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Molecule pretraining has quickly become the go-to schema to boost the performance of AI-based drug discovery. Naturally, molecules can be represented as 2D topological graphs or 3D geometric point clouds. Although most existing pertaining methods focus on merely the single modality, recent research has shown that maximizing the mutual information (MI) between such two modalities enhances the molecule representation ability. Meanwhile, existing molecule multi-modal pretraining approaches approximate MI based on the representation space encoded from the topology and geometry, thus resulting in the loss of critical structural information of molecules. To address this issue, we propose MoleculeSDE. MoleculeSDE leverages group symmetric (e.g., SE(3)-equivariant and reflection-antisymmetric) stochastic differential equation models to generate the 3D geometries from 2D topologies, and vice versa, directly in the input space. It not only obtains tighter MI bound but also enables prosperous dow
&lt;/p&gt;</description></item></channel></rss>