<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>&#36890;&#36807;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;&#20013;&#30340;&#34507;&#30333;&#36136;&#24207;&#21015;-&#32467;&#26500;&#20849;&#35774;&#35745;&#38382;&#39064;&#65292;&#20197;&#29983;&#25104;&#20855;&#26377;&#29702;&#24615;&#32467;&#26500;&#21644;&#33391;&#22909;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#25239;&#20307;&#35774;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.16576</link><description>&lt;p&gt;
&#36890;&#36807;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Antigen-Specific Antibody Design via Direct Energy-based Preference Optimization
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16576
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;&#20013;&#30340;&#34507;&#30333;&#36136;&#24207;&#21015;-&#32467;&#26500;&#20849;&#35774;&#35745;&#38382;&#39064;&#65292;&#20197;&#29983;&#25104;&#20855;&#26377;&#29702;&#24615;&#32467;&#26500;&#21644;&#33391;&#22909;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#25239;&#20307;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25239;&#20307;&#35774;&#35745;&#26159;&#19968;&#20010;&#33267;&#20851;&#37325;&#35201;&#30340;&#20219;&#21153;&#65292;&#23545;&#21508;&#31181;&#39046;&#22495;&#37117;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#22914;&#27835;&#30103;&#21644;&#29983;&#29289;&#23398;&#65292;&#30001;&#20110;&#20854;&#38169;&#32508;&#22797;&#26434;&#30340;&#24615;&#36136;&#65292;&#38754;&#20020;&#30528;&#30456;&#24403;&#22823;&#30340;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#25239;&#21407;&#29305;&#24322;&#24615;&#25239;&#20307;&#35774;&#35745;&#20316;&#20026;&#19968;&#20010;&#34507;&#30333;&#36136;&#24207;&#21015;-&#32467;&#26500;&#20849;&#35774;&#35745;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#29702;&#24615;&#21644;&#21151;&#33021;&#24615;&#12290;&#21033;&#29992;&#19968;&#20010;&#39044;&#20808;&#35757;&#32451;&#30340;&#26465;&#20214;&#25193;&#25955;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#32852;&#21512;&#24314;&#27169;&#25239;&#20307;&#20013;&#20114;&#34917;&#20915;&#23450;&#21306;&#65288;CDR&#65289;&#30340;&#24207;&#21015;&#21644;&#32467;&#26500;&#65292;&#24182;&#32467;&#21512;&#20102;&#31561;&#21464;&#31070;&#32463;&#32593;&#32476;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#30452;&#25509;&#22522;&#20110;&#33021;&#37327;&#20559;&#22909;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#20197;&#24341;&#23548;&#29983;&#25104;&#26082;&#20855;&#26377;&#21512;&#29702;&#32467;&#26500;&#21448;&#20855;&#26377;&#26126;&#26174;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#25239;&#20307;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#28041;&#21450;&#20351;&#29992;&#27531;&#22522;&#32423;&#20998;&#35299;&#33021;&#37327;&#20559;&#22909;&#23545;&#39044;&#20808;&#35757;&#32451;&#30340;&#25193;&#25955;&#27169;&#22411;&#36827;&#34892;&#24494;&#35843;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37319;&#29992;&#26799;&#24230;&#25163;&#26415;&#26469;&#35299;&#20915;&#21508;&#31181;&#31867;&#22411;&#33021;&#37327;&#20043;&#38388;&#30340;&#20914;&#31361;&#65292;&#20363;&#22914;&#21560;&#24341;&#21644;&#26021;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16576v1 Announce Type: cross  Abstract: Antibody design, a crucial task with significant implications across various disciplines such as therapeutics and biology, presents considerable challenges due to its intricate nature. In this paper, we tackle antigen-specific antibody design as a protein sequence-structure co-design problem, considering both rationality and functionality. Leveraging a pre-trained conditional diffusion model that jointly models sequences and structures of complementarity-determining regions (CDR) in antibodies with equivariant neural networks, we propose direct energy-based preference optimization to guide the generation of antibodies with both rational structures and considerable binding affinities to given antigens. Our method involves fine-tuning the pre-trained diffusion model using a residue-level decomposed energy preference. Additionally, we employ gradient surgery to address conflicts between various types of energy, such as attraction and repu
&lt;/p&gt;</description></item></channel></rss>