<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#22522;&#20110;Transformer&#32534;&#30721;&#22120;&#30340;EEG&#32534;&#30721;&#22120;&#21644;GAN&#32593;&#32476;&#65292;&#36890;&#36807;&#21512;&#25104;&#22270;&#20687;&#20174;EEG&#20449;&#21495;&#20013;&#24674;&#22797;&#20986;&#21508;&#31181;&#23545;&#35937;&#31867;&#21035;&#30340;&#22270;&#20687;&#65292;&#21516;&#26102;&#32467;&#21512;&#23545;&#25239;&#25439;&#22833;&#21644;&#24863;&#30693;&#25439;&#22833;&#65292;&#25552;&#39640;&#29983;&#25104;&#22270;&#20687;&#30340;&#36136;&#37327;&#12290;</title><link>https://arxiv.org/abs/2402.10115</link><description>&lt;p&gt;
&#20351;&#29992;&#22522;&#20110;Transformer&#32534;&#30721;&#22120;&#30340;EEG&#32534;&#30721;&#22120;&#21644;GAN&#20174;EEG&#35760;&#24405;&#20013;&#29983;&#25104;&#35270;&#35273;&#21050;&#28608;
&lt;/p&gt;
&lt;p&gt;
Generating Visual Stimuli from EEG Recordings using Transformer-encoder based EEG encoder and GAN
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10115
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#22522;&#20110;Transformer&#32534;&#30721;&#22120;&#30340;EEG&#32534;&#30721;&#22120;&#21644;GAN&#32593;&#32476;&#65292;&#36890;&#36807;&#21512;&#25104;&#22270;&#20687;&#20174;EEG&#20449;&#21495;&#20013;&#24674;&#22797;&#20986;&#21508;&#31181;&#23545;&#35937;&#31867;&#21035;&#30340;&#22270;&#20687;&#65292;&#21516;&#26102;&#32467;&#21512;&#23545;&#25239;&#25439;&#22833;&#21644;&#24863;&#30693;&#25439;&#22833;&#65292;&#25552;&#39640;&#29983;&#25104;&#22270;&#20687;&#30340;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#24863;&#30693;&#24615;&#33041;&#35299;&#30721;&#39046;&#22495;&#30340;&#19968;&#20010;&#29616;&#20195;&#30740;&#31350;&#25361;&#25112;&#65292;&#21363;&#20351;&#29992;&#23545;&#25239;&#24335;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;&#20174;EEG&#20449;&#21495;&#20013;&#21512;&#25104;&#22270;&#20687;&#12290;&#20855;&#20307;&#30446;&#26631;&#26159;&#21033;&#29992;&#20027;&#20307;&#35266;&#30475;&#22270;&#20687;&#26102;&#33719;&#24471;&#30340;EEG&#35760;&#24405;&#37325;&#26032;&#21019;&#24314;&#23646;&#20110;&#21508;&#31181;&#23545;&#35937;&#31867;&#21035;&#30340;&#22270;&#20687;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;Transformer&#32534;&#30721;&#22120;&#30340;EEG&#32534;&#30721;&#22120;&#29983;&#25104;EEG&#32534;&#30721;&#65292;&#28982;&#21518;&#23558;&#20854;&#20316;&#20026;GAN&#32593;&#32476;&#30340;&#29983;&#25104;&#22120;&#32452;&#20214;&#30340;&#36755;&#20837;&#12290;&#38500;&#20102;&#23545;&#25239;&#25439;&#22833;&#20043;&#22806;&#65292;&#25105;&#20204;&#36824;&#37319;&#29992;&#20102;&#24863;&#30693;&#25439;&#22833;&#26469;&#25552;&#39640;&#29983;&#25104;&#22270;&#20687;&#30340;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10115v1 Announce Type: new  Abstract: In this study, we tackle a modern research challenge within the field of perceptual brain decoding, which revolves around synthesizing images from EEG signals using an adversarial deep learning framework. The specific objective is to recreate images belonging to various object categories by leveraging EEG recordings obtained while subjects view those images. To achieve this, we employ a Transformer-encoder based EEG encoder to produce EEG encodings, which serve as inputs to the generator component of the GAN network. Alongside the adversarial loss, we also incorporate perceptual loss to enhance the quality of the generated images.
&lt;/p&gt;</description></item></channel></rss>