<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#31070;&#32463;&#32593;&#32476;&#20013;&#25972;&#21512;&#38750;&#32447;&#24615;&#26641;&#31361;&#32467;&#26500;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#27169;&#22411;&#30340;&#23481;&#37327;&#21644;&#24615;&#33021;&#65292;&#21516;&#26102;&#25511;&#21046;&#20449;&#21495;&#36890;&#20449;&#25104;&#26412;&#65292;&#36825;&#23545;&#20110;&#26410;&#26469;&#31070;&#32463;&#32593;&#32476;&#30340;&#21457;&#23637;&#20855;&#26377;&#37325;&#35201;&#30340;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2306.11950</link><description>&lt;p&gt;
&#32531;&#35299;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#36890;&#20449;&#25104;&#26412;&#65306;&#26641;&#31361;&#38750;&#32447;&#24615;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Mitigating Communication Costs in Neural Networks: The Role of Dendritic Nonlinearity. (arXiv:2306.11950v1 [cs.NE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11950
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#31070;&#32463;&#32593;&#32476;&#20013;&#25972;&#21512;&#38750;&#32447;&#24615;&#26641;&#31361;&#32467;&#26500;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#27169;&#22411;&#30340;&#23481;&#37327;&#21644;&#24615;&#33021;&#65292;&#21516;&#26102;&#25511;&#21046;&#20449;&#21495;&#36890;&#20449;&#25104;&#26412;&#65292;&#36825;&#23545;&#20110;&#26410;&#26469;&#31070;&#32463;&#32593;&#32476;&#30340;&#21457;&#23637;&#20855;&#26377;&#37325;&#35201;&#30340;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#29289;&#31070;&#32463;&#32593;&#32476;&#30340;&#29702;&#35299;&#28145;&#21051;&#22320;&#24433;&#21709;&#20102;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#65288;ANNs&#65289;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;ANN&#20013;&#20351;&#29992;&#30340;&#31070;&#32463;&#20803;&#19982;&#20854;&#29983;&#29289;&#27169;&#22411;&#23384;&#22312;&#26126;&#26174;&#20559;&#24046;&#65292;&#20027;&#35201;&#26159;&#30001;&#20110;&#32570;&#23569;&#21253;&#21547;&#23616;&#37096;&#38750;&#32447;&#24615;&#30340;&#22797;&#26434;&#26641;&#31361;&#12290;&#23613;&#31649;&#23384;&#22312;&#36825;&#26679;&#30340;&#24046;&#24322;&#65292;&#20808;&#21069;&#30340;&#30740;&#31350;&#34920;&#26126;&#28857;&#31070;&#32463;&#20803;&#21487;&#20197;&#22312;&#25191;&#34892;&#35745;&#31639;&#20219;&#21153;&#26041;&#38754;&#22312;&#21151;&#33021;&#19978;&#26367;&#20195;&#26641;&#31361;&#31070;&#32463;&#20803;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23457;&#26597;&#20102;&#31070;&#32463;&#32593;&#32476;&#20013;&#38750;&#32447;&#24615;&#26641;&#31361;&#30340;&#37325;&#35201;&#24615;&#12290;&#36890;&#36807;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#26641;&#31361;&#32467;&#26500;&#38750;&#32447;&#24615;&#23545;&#31070;&#32463;&#32593;&#32476;&#24615;&#33021;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#34920;&#26126;&#65292;&#25972;&#21512;&#26641;&#31361;&#32467;&#26500;&#21487;&#20197;&#22312;&#20445;&#25345;&#20449;&#21495;&#36890;&#20449;&#25104;&#26412;&#26377;&#25928;&#25233;&#21046;&#30340;&#21516;&#26102;&#65292;&#26174;&#33879;&#22686;&#24378;&#27169;&#22411;&#23481;&#37327;&#21644;&#24615;&#33021;&#12290;&#36825;&#39033;&#30740;&#31350;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#35265;&#35299;&#65292;&#23545;&#26410;&#26469;&#31070;&#32463;&#32593;&#32476;&#30340;&#21457;&#23637;&#20855;&#26377;&#37325;&#35201;&#30340;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Our comprehension of biological neuronal networks has profoundly influenced the evolution of artificial neural networks (ANNs). However, the neurons employed in ANNs exhibit remarkable deviations from their biological analogs, mainly due to the absence of complex dendritic trees encompassing local nonlinearity. Despite such disparities, previous investigations have demonstrated that point neurons can functionally substitute dendritic neurons in executing computational tasks. In this study, we scrutinized the importance of nonlinear dendrites within neural networks. By employing machine-learning methodologies, we assessed the impact of dendritic structure nonlinearity on neural network performance. Our findings reveal that integrating dendritic structures can substantially enhance model capacity and performance while keeping signal communication costs effectively restrained. This investigation offers pivotal insights that hold considerable implications for the development of future neur
&lt;/p&gt;</description></item></channel></rss>