<rss version="2.0"><channel><title>Chat Arxiv q-bio.BM</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio.BM</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#35757;&#32451;&#31574;&#30053;&#65292;&#24213;&#29289;&#33539;&#22260;&#23545;&#27604;&#23398;&#20064;&#65292;&#20197;&#23398;&#20064;&#36866;&#21512;&#21270;&#23398;&#21453;&#24212;&#24615;&#30340;&#21407;&#23376;&#34920;&#31034;&#12290;</title><link>https://arxiv.org/abs/2402.16882</link><description>&lt;p&gt;
&#24213;&#29289;&#33539;&#22260;&#23545;&#27604;&#23398;&#20064;&#65306;&#37325;&#26032;&#21033;&#29992;&#20154;&#31867;&#20559;&#35265;&#23398;&#20064;&#21407;&#23376;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Substrate Scope Contrastive Learning: Repurposing Human Bias to Learn Atomic Representations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16882
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#35757;&#32451;&#31574;&#30053;&#65292;&#24213;&#29289;&#33539;&#22260;&#23545;&#27604;&#23398;&#20064;&#65292;&#20197;&#23398;&#20064;&#36866;&#21512;&#21270;&#23398;&#21453;&#24212;&#24615;&#30340;&#21407;&#23376;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#20998;&#23376;&#34920;&#31034;&#26159;&#20998;&#23376;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#20851;&#38190;&#27493;&#39588;&#65292;&#23545;&#24314;&#27169;&#25104;&#21151;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#65292;&#23588;&#20854;&#22312;&#25968;&#25454;&#31232;&#32570;&#24773;&#20917;&#19979;&#12290;&#24191;&#20041;&#39044;&#35757;&#32451;&#31070;&#32463;&#32593;&#32476;&#30340;&#27010;&#24565;&#25512;&#21160;&#20102;&#35745;&#31639;&#26426;&#35270;&#35273;&#12289;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#34507;&#30333;&#36136;&#24037;&#31243;&#31561;&#39046;&#22495;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#31867;&#20284;&#30340;&#26041;&#27861;&#22312;&#23567;&#26377;&#26426;&#20998;&#23376;&#26041;&#38754;&#24182;&#26410;&#21462;&#24471;&#31867;&#20284;&#30340;&#25104;&#21151;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#35757;&#32451;&#31574;&#30053;&#65292;&#21363;&#24213;&#29289;&#33539;&#22260;&#23545;&#27604;&#23398;&#20064;&#65292;&#23427;&#23398;&#20064;&#36866;&#21512;&#21270;&#23398;&#21453;&#24212;&#24615;&#30340;&#21407;&#23376;&#34920;&#31034;&#12290;&#36825;&#31181;&#26041;&#27861;&#20197;&#24050;&#21457;&#34920;&#30340;&#24213;&#29289;&#33539;&#22260;&#34920;&#20013;&#24213;&#29289;&#30340;&#20998;&#32452;&#21644;&#20135;&#29289;&#25910;&#29575;&#20316;&#20026;&#21270;&#23398;&#21453;&#24212;&#24615;&#30456;&#20284;&#24615;&#25110;&#19981;&#30456;&#20284;&#24615;&#30340;&#34913;&#37327;&#12290;&#25105;&#20204;&#20851;&#27880; CAS Content Collection &#20013;&#30340; 20,798 &#20010;&#33459;&#39321;&#21348;&#20195;&#28867;&#65292;&#28085;&#30422;&#25968;&#21315;&#31687;&#20986;&#29256;&#29289;&#65292;&#20197;&#23398;&#20064;&#33459;&#39321;&#21348;&#20195;&#28867;&#30340;&#21453;&#24212;&#24615;&#34920;&#31034;&#12290;&#25105;&#20204;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#39044;&#35757;&#32451;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16882v1 Announce Type: cross  Abstract: Learning molecular representation is a critical step in molecular machine learning that significantly influences modeling success, particularly in data-scarce situations. The concept of broadly pre-training neural networks has advanced fields such as computer vision, natural language processing, and protein engineering. However, similar approaches for small organic molecules have not achieved comparable success. In this work, we introduce a novel pre-training strategy, substrate scope contrastive learning, which learns atomic representations tailored to chemical reactivity. This method considers the grouping of substrates and their yields in published substrate scope tables as a measure of their similarity or dissimilarity in terms of chemical reactivity. We focus on 20,798 aryl halides in the CAS Content Collection spanning thousands of publications to learn a representation of aryl halide reactivity. We validate our pre-training appr
&lt;/p&gt;</description></item></channel></rss>