<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#35745;&#31639;&#26694;&#26550;&#65292;&#29992;&#20110;&#32454;&#32990;&#37325;&#32534;&#31243;&#20013;&#30340;&#37325;&#32534;&#31243;&#31574;&#30053;&#35782;&#21035;&#12290;&#22312;&#25511;&#21046;&#38382;&#39064;&#20013;&#65292;&#24341;&#20837;&#20102;&#20266;&#21560;&#24341;&#23376;&#30340;&#27010;&#24565;&#21644;&#35782;&#21035;&#26041;&#27861;&#65292;&#24182;&#35774;&#35745;&#20102;&#19968;&#20010;&#29992;&#20110;&#35299;&#20915;&#35813;&#38382;&#39064;&#30340;&#35745;&#31639;&#26694;&#26550;&#12290;</title><link>https://arxiv.org/abs/2402.08491</link><description>&lt;p&gt;
&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#32454;&#32990;&#37325;&#32534;&#31243;&#30340;&#24067;&#23572;&#27169;&#22411;&#21560;&#24341;&#23376;&#26223;&#35266;&#20013;&#30340;&#25511;&#21046;&#36941;&#21382;&#20013;&#30340;&#24212;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Deep Reinforcement Learning for Controlled Traversing of the Attractor Landscape of Boolean Models in the Context of Cellular Reprogramming
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08491
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#35745;&#31639;&#26694;&#26550;&#65292;&#29992;&#20110;&#32454;&#32990;&#37325;&#32534;&#31243;&#20013;&#30340;&#37325;&#32534;&#31243;&#31574;&#30053;&#35782;&#21035;&#12290;&#22312;&#25511;&#21046;&#38382;&#39064;&#20013;&#65292;&#24341;&#20837;&#20102;&#20266;&#21560;&#24341;&#23376;&#30340;&#27010;&#24565;&#21644;&#35782;&#21035;&#26041;&#27861;&#65292;&#24182;&#35774;&#35745;&#20102;&#19968;&#20010;&#29992;&#20110;&#35299;&#20915;&#35813;&#38382;&#39064;&#30340;&#35745;&#31639;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32454;&#32990;&#37325;&#32534;&#31243;&#21487;&#29992;&#20110;&#39044;&#38450;&#21644;&#27835;&#30103;&#19981;&#21516;&#30142;&#30149;&#12290;&#28982;&#32780;&#65292;&#36890;&#36807;&#20256;&#32479;&#28287;&#23454;&#39564;&#21457;&#29616;&#37325;&#32534;&#31243;&#31574;&#30053;&#30340;&#25928;&#29575;&#21463;&#21040;&#26102;&#38388;&#21644;&#25104;&#26412;&#30340;&#38480;&#21046;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#35745;&#31639;&#26694;&#26550;&#65292;&#20197;&#20415;&#24110;&#21161;&#35782;&#21035;&#37325;&#32534;&#31243;&#31574;&#30053;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#22312;&#32454;&#32990;&#37325;&#32534;&#31243;&#26694;&#26550;&#30340;BNs&#21644;PBNs&#20197;&#21450;&#24322;&#27493;&#26356;&#26032;&#27169;&#24335;&#19979;&#21046;&#23450;&#20102;&#19968;&#20010;&#25511;&#21046;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#20266;&#21560;&#24341;&#23376;&#30340;&#27010;&#24565;&#21644;&#35757;&#32451;&#36807;&#31243;&#20013;&#20266;&#21560;&#24341;&#23376;&#29366;&#24577;&#30340;&#35782;&#21035;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#29992;&#20110;&#35299;&#20915;&#25511;&#21046;&#38382;&#39064;&#30340;&#35745;&#31639;&#26694;&#26550;&#65292;&#24182;&#22312;&#22810;&#20010;&#19981;&#21516;&#27169;&#22411;&#19978;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cellular reprogramming can be used for both the prevention and cure of different diseases. However, the efficiency of discovering reprogramming strategies with classical wet-lab experiments is hindered by lengthy time commitments and high costs. In this study, we develop a~novel computational framework based on deep reinforcement learning that facilitates the identification of reprogramming strategies. For this aim, we formulate a~control problem in the context of cellular reprogramming for the frameworks of BNs and PBNs under the asynchronous update mode. Furthermore, we introduce the notion of a~pseudo-attractor and a~procedure for identification of pseudo-attractor state during training. Finally, we devise a~computational framework for solving the control problem, which we test on a~number of different models.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#22871;&#24320;&#25918;&#25918;&#23556;&#32452;&#23398;&#25968;&#25454;&#38598;&#21644;&#25216;&#26415;&#21327;&#35758;&#65292;&#26088;&#22312;&#35299;&#20915;&#25918;&#23556;&#32452;&#23398;&#22312;&#32467;&#26524;&#21487;&#37325;&#22797;&#24615;&#21644;&#21487;&#35775;&#38382;&#24615;&#26041;&#38754;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;&#36890;&#36807;&#22312;BraTS 2020&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#25918;&#23556;&#32452;&#23398;&#29305;&#24449;&#25552;&#21462;&#23545;&#32467;&#26524;&#21487;&#37325;&#22797;&#24615;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2207.14776</link><description>&lt;p&gt;
&#24320;&#25918;&#25918;&#23556;&#32452;&#23398;&#65306;&#19968;&#31995;&#21015;&#26631;&#20934;&#21270;&#25968;&#25454;&#38598;&#21644;&#21487;&#37325;&#22797;&#25918;&#23556;&#32452;&#23398;&#26426;&#22120;&#23398;&#20064;&#27969;&#31243;&#30340;&#25216;&#26415;&#21327;&#35758;
&lt;/p&gt;
&lt;p&gt;
Open-radiomics: A Collection of Standardized Datasets and a Technical Protocol for Reproducible Radiomics Machine Learning Pipelines. (arXiv:2207.14776v2 [q-bio.QM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.14776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#22871;&#24320;&#25918;&#25918;&#23556;&#32452;&#23398;&#25968;&#25454;&#38598;&#21644;&#25216;&#26415;&#21327;&#35758;&#65292;&#26088;&#22312;&#35299;&#20915;&#25918;&#23556;&#32452;&#23398;&#22312;&#32467;&#26524;&#21487;&#37325;&#22797;&#24615;&#21644;&#21487;&#35775;&#38382;&#24615;&#26041;&#38754;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;&#36890;&#36807;&#22312;BraTS 2020&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#25918;&#23556;&#32452;&#23398;&#29305;&#24449;&#25552;&#21462;&#23545;&#32467;&#26524;&#21487;&#37325;&#22797;&#24615;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#30340;&#65306;&#20316;&#20026;&#21307;&#23398;&#24433;&#20687;&#20013;&#26426;&#22120;&#23398;&#20064;&#27969;&#31243;&#30340;&#19968;&#20010;&#37325;&#35201;&#20998;&#25903;&#65292;&#25918;&#23556;&#32452;&#23398;&#38754;&#20020;&#30528;&#20004;&#20010;&#20027;&#35201;&#25361;&#25112;&#65292;&#21363;&#21487;&#37325;&#22797;&#24615;&#21644;&#21487;&#35775;&#38382;&#24615;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#24320;&#25918;&#25918;&#23556;&#32452;&#23398;&#65292;&#19968;&#22871;&#25918;&#23556;&#32452;&#23398;&#25968;&#25454;&#38598;&#20197;&#21450;&#22522;&#20110;&#25105;&#20204;&#25552;&#20986;&#30340;&#25216;&#26415;&#21327;&#35758;&#30340;&#32508;&#21512;&#25918;&#23556;&#32452;&#23398;&#27969;&#31243;&#65292;&#20197;&#30740;&#31350;&#25918;&#23556;&#32452;&#23398;&#29305;&#24449;&#25552;&#21462;&#23545;&#32467;&#26524;&#21487;&#37325;&#22797;&#24615;&#30340;&#24433;&#21709;&#12290;&#26448;&#26009;&#21644;&#26041;&#27861;&#65306;&#23454;&#39564;&#20351;&#29992;BraTS 2020&#24320;&#28304;&#30913;&#20849;&#25391;&#25104;&#20687;&#65288;MRI&#65289;&#25968;&#25454;&#38598;&#36827;&#34892;&#65292;&#21253;&#25324;369&#21517;&#24739;&#26377;&#33041;&#32959;&#30244;&#30340;&#25104;&#24180;&#24739;&#32773;&#65288;76&#20363;&#20302;&#32423;&#21035;&#33014;&#36136;&#30244;&#65288;LGG&#65289;&#21644;293&#20363;&#39640;&#32423;&#21035;&#33014;&#36136;&#30244;&#65288;HGG&#65289;&#65289;&#12290;&#20351;&#29992;PyRadiomics&#24211;&#36827;&#34892;LGG&#19982;HGG&#20998;&#31867;&#65292;&#24418;&#25104;&#20102;288&#20010;&#25918;&#23556;&#32452;&#23398;&#25968;&#25454;&#38598;&#65307;&#20854;&#20013;&#21253;&#25324;4&#20010;MRI&#24207;&#21015;&#12289;3&#20010;binWidths&#12289;6&#31181;&#22270;&#20687;&#24402;&#19968;&#21270;&#26041;&#27861;&#21644;4&#20010;&#32959;&#30244;&#27425;&#21306;&#22495;&#30340;&#32452;&#21512;&#12290;&#20351;&#29992;&#38543;&#26426;&#26862;&#26519;&#20998;&#31867;&#22120;&#65292;&#24182;&#20026;&#27599;&#20010;&#25918;&#23556;&#32452;&#23398;&#25968;&#25454;&#38598;&#36827;&#34892;&#35757;&#32451;-&#39564;&#35777;-&#27979;&#35797;&#65288;60%/20%/20%&#65289;&#23454;&#39564;&#65292;&#37319;&#29992;&#19981;&#21516;&#30340;&#25968;&#25454;&#21010;&#20998;&#21644;m
&lt;/p&gt;
&lt;p&gt;
Purpose: As an important branch of machine learning pipelines in medical imaging, radiomics faces two major challenges namely reproducibility and accessibility. In this work, we introduce open-radiomics, a set of radiomics datasets along with a comprehensive radiomics pipeline based on our proposed technical protocol to investigate the effects of radiomics feature extraction on the reproducibility of the results.  Materials and Methods: Experiments are conducted on BraTS 2020 open-source Magnetic Resonance Imaging (MRI) dataset that includes 369 adult patients with brain tumors (76 low-grade glioma (LGG), and 293 high-grade glioma (HGG)). Using PyRadiomics library for LGG vs. HGG classification, 288 radiomics datasets are formed; the combinations of 4 MRI sequences, 3 binWidths, 6 image normalization methods, and 4 tumor subregions.  Random Forest classifiers were used, and for each radiomics dataset the training-validation-test (60%/20%/20%) experiment with different data splits and m
&lt;/p&gt;</description></item></channel></rss>