<rss version="2.0"><channel><title>Chat Arxiv q-bio</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-bio</description><item><title>&#36890;&#36807;&#25972;&#21512;&#22522;&#20110;&#32467;&#26500;&#30340;&#23545;&#25509;&#21644;&#22522;&#20110;&#24207;&#21015;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#65292;&#26174;&#33879;&#25913;&#21892;&#20102;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.03946</link><description>&lt;p&gt;
&#36890;&#36807;&#20803;&#27169;&#22411;&#25913;&#36827;&#20102;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Improved prediction of ligand-protein binding affinities by meta-modeling. (arXiv:2310.03946v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03946
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25972;&#21512;&#22522;&#20110;&#32467;&#26500;&#30340;&#23545;&#25509;&#21644;&#22522;&#20110;&#24207;&#21015;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#65292;&#26174;&#33879;&#25913;&#21892;&#20102;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#35745;&#31639;&#26041;&#27861;&#20934;&#30830;&#31579;&#36873;&#20505;&#36873;&#33647;&#29289;&#37197;&#20307;&#19982;&#38774;&#34507;&#30333;&#30340;&#32467;&#21512;&#26159;&#33647;&#29289;&#24320;&#21457;&#30340;&#20027;&#35201;&#20851;&#27880;&#28857;&#65292;&#22240;&#20026;&#31579;&#36873;&#28508;&#22312;&#20505;&#36873;&#29289;&#33021;&#22815;&#33410;&#30465;&#25214;&#33647;&#29289;&#30340;&#26102;&#38388;&#21644;&#36153;&#29992;&#12290;&#36825;&#31181;&#34394;&#25311;&#31579;&#36873;&#37096;&#20998;&#20381;&#36182;&#20110;&#39044;&#27979;&#37197;&#20307;&#21644;&#34507;&#30333;&#36136;&#20043;&#38388;&#30340;&#32467;&#21512;&#20146;&#21644;&#21147;&#30340;&#26041;&#27861;&#12290;&#37492;&#20110;&#23384;&#22312;&#35768;&#22810;&#35745;&#31639;&#27169;&#22411;&#23545;&#19981;&#21516;&#30446;&#26631;&#30340;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#32467;&#26524;&#19981;&#21516;&#65292;&#25105;&#20204;&#22312;&#36825;&#37324;&#24320;&#21457;&#20102;&#19968;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#65292;&#36890;&#36807;&#25972;&#21512;&#24050;&#21457;&#34920;&#30340;&#22522;&#20110;&#32467;&#26500;&#30340;&#23545;&#25509;&#21644;&#22522;&#20110;&#24207;&#21015;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#26469;&#26500;&#24314;&#12290;&#22312;&#26500;&#24314;&#36825;&#20010;&#26694;&#26550;&#26102;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#35768;&#22810;&#32452;&#21512;&#30340;&#20010;&#21035;&#27169;&#22411;&#12289;&#35757;&#32451;&#25968;&#25454;&#24211;&#20197;&#21450;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#30340;&#20803;&#27169;&#22411;&#26041;&#27861;&#12290;&#25105;&#20204;&#26174;&#31034;&#20986;&#35768;&#22810;&#20803;&#27169;&#22411;&#22312;&#20146;&#21644;&#21147;&#39044;&#27979;&#19978;&#26174;&#33879;&#25913;&#21892;&#20102;&#20010;&#21035;&#22522;&#30784;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#26368;&#22909;&#30340;&#20803;&#27169;&#22411;&#36798;&#21040;&#20102;&#19982;&#26368;&#20808;&#36827;&#30340;&#32431;&#32467;&#26500;&#20026;&#22522;&#30784;&#30340;&#28145;&#24230;&#23398;&#20064;&#24037;&#20855;&#30456;&#24403;&#30340;&#24615;&#33021;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20010;&#20803;&#27169;&#22411;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25913;&#21892;&#37197;&#20307;-&#34507;&#30333;&#36136;&#32467;&#21512;&#20146;&#21644;&#21147;&#39044;&#27979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
The accurate screening of candidate drug ligands against target proteins through computational approaches is of prime interest to drug development efforts, as filtering potential candidates would save time and expenses for finding drugs. Such virtual screening depends in part on methods to predict the binding affinity between ligands and proteins. Given many computational models for binding affinity prediction with varying results across targets, we herein develop a meta-modeling framework by integrating published empirical structure-based docking and sequence-based deep learning models. In building this framework, we evaluate many combinations of individual models, training databases, and linear and nonlinear meta-modeling approaches. We show that many of our meta-models significantly improve affinity predictions over individual base models. Our best meta-models achieve comparable performance to state-of-the-art exclusively structure-based deep learning tools. Overall, we demonstrate 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#21517;&#20026;BEBE&#30340;&#21160;&#29289;&#34892;&#20026;&#35745;&#31639;&#20998;&#26512;&#22522;&#20934;&#65292;&#20854;&#20013;&#21253;&#25324;&#20102;1654&#23567;&#26102;&#30340;&#21160;&#29289;&#29983;&#24577;&#29983;&#29702;&#23398;&#25968;&#25454;&#65292;&#36825;&#26159;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#12289;&#26368;&#20855;&#20998;&#31867;&#22810;&#26679;&#24615;&#30340;&#20844;&#24320;&#21487;&#29992;&#30340;&#25968;&#25454;&#38598;&#21512;&#12290;&#22312;&#36825;&#20010;&#22522;&#20934;&#19978;&#65292;&#20316;&#32773;&#20351;&#29992;&#20102;&#21313;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#24182;&#30830;&#23450;&#20102;&#26410;&#26469;&#24037;&#20316;&#20013;&#38656;&#35201;&#35299;&#20915;&#30340;&#20851;&#38190;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.10740</link><description>&lt;p&gt;
&#19968;&#31181;&#21160;&#29289;&#34892;&#20026;&#35745;&#31639;&#20998;&#26512;&#30340;&#22522;&#20934;&#65292;&#20351;&#29992;&#21160;&#29289;&#25658;&#24102;&#30340;&#26631;&#31614;&#12290;
&lt;/p&gt;
&lt;p&gt;
A benchmark for computational analysis of animal behavior, using animal-borne tags. (arXiv:2305.10740v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10740
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#21517;&#20026;BEBE&#30340;&#21160;&#29289;&#34892;&#20026;&#35745;&#31639;&#20998;&#26512;&#22522;&#20934;&#65292;&#20854;&#20013;&#21253;&#25324;&#20102;1654&#23567;&#26102;&#30340;&#21160;&#29289;&#29983;&#24577;&#29983;&#29702;&#23398;&#25968;&#25454;&#65292;&#36825;&#26159;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#12289;&#26368;&#20855;&#20998;&#31867;&#22810;&#26679;&#24615;&#30340;&#20844;&#24320;&#21487;&#29992;&#30340;&#25968;&#25454;&#38598;&#21512;&#12290;&#22312;&#36825;&#20010;&#22522;&#20934;&#19978;&#65292;&#20316;&#32773;&#20351;&#29992;&#20102;&#21313;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#24182;&#30830;&#23450;&#20102;&#26410;&#26469;&#24037;&#20316;&#20013;&#38656;&#35201;&#35299;&#20915;&#30340;&#20851;&#38190;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#29289;&#25658;&#24102;&#30340;&#20256;&#24863;&#22120;&#65288;&#8220;&#29983;&#29289;&#35760;&#24405;&#22120;&#8221;&#65289;&#21487;&#20197;&#35760;&#24405;&#19968;&#31995;&#21015;&#21160;&#21147;&#23398;&#21644;&#29615;&#22659;&#25968;&#25454;&#65292;&#25581;&#31034;&#21160;&#29289;&#29983;&#24577;&#29983;&#29702;&#23398;&#24182;&#25913;&#21892;&#20445;&#25252;&#24037;&#20316;&#12290;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#23545;&#20110;&#35299;&#37322;&#29983;&#29289;&#35760;&#24405;&#22120;&#35760;&#24405;&#30340;&#22823;&#37327;&#25968;&#25454;&#38750;&#24120;&#26377;&#29992;&#65292;&#20294;&#22312;&#36825;&#20010;&#39046;&#22495;&#20013;&#27809;&#26377;&#26631;&#20934;&#26469;&#27604;&#36739;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Bio-logger Ethogram Benchmark&#65288;BEBE&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#24102;&#26377;&#34892;&#20026;&#27880;&#37322;&#65292;&#26631;&#20934;&#21270;&#24314;&#27169;&#20219;&#21153;&#21644;&#35780;&#20272;&#25351;&#26631;&#30340;&#25968;&#25454;&#38598;&#21512;&#12290;BEBE&#26159;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#12289;&#26368;&#20855;&#20998;&#31867;&#22810;&#26679;&#24615;&#21644;&#20844;&#24320;&#21487;&#29992;&#30340;&#36825;&#31181;&#22522;&#20934;&#65292;&#21253;&#25324;&#26469;&#33258;&#20061;&#20010;&#20998;&#31867;&#21333;&#20803;&#20013;149&#20010;&#20010;&#20307;&#25910;&#38598;&#30340;1654&#23567;&#26102;&#25968;&#25454;&#12290;&#25105;&#20204;&#22312;BEBE&#19978;&#35780;&#20272;&#20102;&#21313;&#31181;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#30340;&#24615;&#33021;&#65292;&#24182;&#30830;&#23450;&#20102;&#26410;&#26469;&#24037;&#20316;&#20013;&#38656;&#35201;&#35299;&#20915;&#30340;&#20851;&#38190;&#38382;&#39064;&#12290;&#25968;&#25454;&#38598;&#12289;&#27169;&#22411;&#21644;&#35780;&#20272;&#20195;&#30721;&#24050;&#20844;&#24320;&#21457;&#24067;&#22312;https://github.com/earthspecies/BEBE&#65292;&#20197;&#20415;&#31038;&#21306;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Animal-borne sensors ('bio-loggers') can record a suite of kinematic and environmental data, which can elucidate animal ecophysiology and improve conservation efforts. Machine learning techniques are useful for interpreting the large amounts of data recorded by bio-loggers, but there exists no standard for comparing the different machine learning techniques in this domain. To address this, we present the Bio-logger Ethogram Benchmark (BEBE), a collection of datasets with behavioral annotations, standardized modeling tasks, and evaluation metrics. BEBE is to date the largest, most taxonomically diverse, publicly available benchmark of this type, and includes 1654 hours of data collected from 149 individuals across nine taxa. We evaluate the performance of ten different machine learning methods on BEBE, and identify key challenges to be addressed in future work. Datasets, models, and evaluation code are made publicly available at https://github.com/earthspecies/BEBE, to enable community 
&lt;/p&gt;</description></item></channel></rss>