<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;kNN&#31639;&#27861;&#36827;&#34892;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#37319;&#29992;&#20102;&#33258;&#21160;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#21464;&#37327;&#36873;&#25321;&#25216;&#26415;&#65292;&#25552;&#39640;&#20102;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#21644;&#24615;&#33021;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01635</link><description>&lt;p&gt;
kNN&#31639;&#27861;&#29992;&#20110;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#20272;&#35745;&#65292;&#20855;&#26377;&#33258;&#21160;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#21464;&#37327;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
kNN Algorithm for Conditional Mean and Variance Estimation with Automated Uncertainty Quantification and Variable Selection
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01635
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;kNN&#31639;&#27861;&#36827;&#34892;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#37319;&#29992;&#20102;&#33258;&#21160;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#21464;&#37327;&#36873;&#25321;&#25216;&#26415;&#65292;&#25552;&#39640;&#20102;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#21644;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;kNN&#30340;&#22238;&#24402;&#26041;&#27861;&#65292;&#23558;&#20256;&#32479;&#30340;&#38750;&#21442;&#25968;kNN&#27169;&#22411;&#30340;&#21487;&#25193;&#23637;&#24615;&#21644;&#36866;&#24212;&#24615;&#19982;&#19968;&#31181;&#26032;&#30340;&#21464;&#37327;&#36873;&#25321;&#25216;&#26415;&#30456;&#32467;&#21512;&#12290;&#35813;&#26041;&#27861;&#20027;&#35201;&#30446;&#26631;&#26159;&#20934;&#30830;&#20272;&#35745;&#38543;&#26426;&#21709;&#24212;&#21464;&#37327;&#30340;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#65292;&#20174;&#32780;&#26377;&#25928;&#22320;&#25551;&#36848;&#21508;&#31181;&#24773;&#26223;&#19979;&#30340;&#26465;&#20214;&#20998;&#24067;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#21547;&#20102;&#19968;&#20010;&#20581;&#22766;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26426;&#21046;&#65292;&#21033;&#29992;&#25105;&#20204;&#20043;&#21069;&#20851;&#20110;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#30340;&#20272;&#35745;&#24037;&#20316;&#12290; kNN&#30340;&#24212;&#29992;&#30830;&#20445;&#20102;&#22312;&#39044;&#27979;&#21306;&#38388;&#26102;&#21487;&#25193;&#23637;&#30340;&#35745;&#31639;&#25928;&#29575;&#21644;&#19982;&#26368;&#20248;&#38750;&#21442;&#25968;&#36895;&#29575;&#30456;&#19968;&#33268;&#30340;&#32479;&#35745;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;kNN&#21322;&#21442;&#25968;&#31639;&#27861;&#26469;&#20272;&#35745;&#32771;&#34385;&#21327;&#21464;&#37327;&#30340;ROC&#26354;&#32447;&#12290;&#23545;&#20110;&#36873;&#25321;&#24179;&#28369;&#21442;&#25968;k&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#29702;&#35770;&#20445;&#35777;&#30340;&#31639;&#27861;&#12290;&#21464;&#37327;&#36873;&#25321;&#30340;&#24341;&#20837;&#26174;&#33879;&#25552;&#39640;&#20102;&#35813;&#26041;&#27861;&#30456;&#23545;&#20110;&#20256;&#32479;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we introduce a kNN-based regression method that synergizes the scalability and adaptability of traditional non-parametric kNN models with a novel variable selection technique. This method focuses on accurately estimating the conditional mean and variance of random response variables, thereby effectively characterizing conditional distributions across diverse scenarios.Our approach incorporates a robust uncertainty quantification mechanism, leveraging our prior estimation work on conditional mean and variance. The employment of kNN ensures scalable computational efficiency in predicting intervals and statistical accuracy in line with optimal non-parametric rates. Additionally, we introduce a new kNN semi-parametric algorithm for estimating ROC curves, accounting for covariates. For selecting the smoothing parameter k, we propose an algorithm with theoretical guarantees.Incorporation of variable selection enhances the performance of the method significantly over convention
&lt;/p&gt;</description></item></channel></rss>