<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#36890;&#29992;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#30340;&#21487;&#25193;&#23637;&#36125;&#21494;&#26031;&#25512;&#26029;&#31639;&#27861;&#65292;&#35299;&#20915;&#20102;&#22312;&#22823;&#25968;&#25454;&#29615;&#22659;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#26102;&#30340;&#35745;&#31639;&#38590;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.03007</link><description>&lt;p&gt;
&#36890;&#29992;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#30340;&#21487;&#25193;&#23637;&#36125;&#21494;&#26031;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Scalable Bayesian inference for the generalized linear mixed model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03007
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#36890;&#29992;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#30340;&#21487;&#25193;&#23637;&#36125;&#21494;&#26031;&#25512;&#26029;&#31639;&#27861;&#65292;&#35299;&#20915;&#20102;&#22312;&#22823;&#25968;&#25454;&#29615;&#22659;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#26102;&#30340;&#35745;&#31639;&#38590;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#29992;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#65288;GLMM&#65289;&#26159;&#22788;&#29702;&#30456;&#20851;&#25968;&#25454;&#30340;&#19968;&#31181;&#27969;&#34892;&#32479;&#35745;&#26041;&#27861;&#65292;&#22312;&#21253;&#25324;&#29983;&#29289;&#21307;&#23398;&#25968;&#25454;&#31561;&#22823;&#25968;&#25454;&#24120;&#35265;&#30340;&#24212;&#29992;&#39046;&#22495;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#26412;&#25991;&#30340;&#37325;&#28857;&#26159;&#38024;&#23545;GLMM&#30340;&#21487;&#25193;&#23637;&#32479;&#35745;&#25512;&#26029;&#65292;&#25105;&#20204;&#23558;&#32479;&#35745;&#25512;&#26029;&#23450;&#20041;&#20026;&#65306;&#65288;i&#65289;&#23545;&#24635;&#20307;&#21442;&#25968;&#30340;&#20272;&#35745;&#20197;&#21450;&#65288;ii&#65289;&#22312;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#30340;&#24773;&#20917;&#19979;&#35780;&#20272;&#31185;&#23398;&#20551;&#35774;&#12290;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#23398;&#20064;&#31639;&#27861;&#25797;&#38271;&#21487;&#25193;&#23637;&#30340;&#32479;&#35745;&#20272;&#35745;&#65292;&#20294;&#24456;&#23569;&#21253;&#25324;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#36125;&#21494;&#26031;&#25512;&#26029;&#25552;&#20379;&#23436;&#25972;&#30340;&#32479;&#35745;&#25512;&#26029;&#65292;&#22240;&#20026;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#33258;&#21160;&#26469;&#33258;&#21518;&#39564;&#20998;&#24067;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#21253;&#25324;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#27931;&#65288;MCMC&#65289;&#22312;&#20869;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#31639;&#27861;&#22312;&#22823;&#25968;&#25454;&#29615;&#22659;&#20013;&#21464;&#24471;&#38590;&#20197;&#35745;&#31639;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#32479;&#35745;&#25512;&#26029;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03007v1 Announce Type: cross  Abstract: The generalized linear mixed model (GLMM) is a popular statistical approach for handling correlated data, and is used extensively in applications areas where big data is common, including biomedical data settings. The focus of this paper is scalable statistical inference for the GLMM, where we define statistical inference as: (i) estimation of population parameters, and (ii) evaluation of scientific hypotheses in the presence of uncertainty. Artificial intelligence (AI) learning algorithms excel at scalable statistical estimation, but rarely include uncertainty quantification. In contrast, Bayesian inference provides full statistical inference, since uncertainty quantification results automatically from the posterior distribution. Unfortunately, Bayesian inference algorithms, including Markov Chain Monte Carlo (MCMC), become computationally intractable in big data settings. In this paper, we introduce a statistical inference algorithm 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20943;&#23567;&#20559;&#24046;&#21644;&#20135;&#29983;&#26356;&#20934;&#30830;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#36817;&#20284;&#21518;&#39564;&#35843;&#25972;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#36817;&#20284;&#21518;&#39564;&#30340;&#21464;&#25442;&#26469;&#26368;&#22823;&#21270;&#24471;&#20998;&#35268;&#21017;&#12290;&#36825;&#31181;&#26041;&#27861;&#21482;&#38656;&#35201;&#36827;&#34892;&#23569;&#37327;&#22797;&#26434;&#27169;&#22411;&#27169;&#25311;&#65292;&#19988;&#20855;&#26377;&#25968;&#20540;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2211.05357</link><description>&lt;p&gt;
&#36866;&#29992;&#20110;&#36817;&#20284;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#24471;&#20998;&#26657;&#20934;
&lt;/p&gt;
&lt;p&gt;
Bayesian score calibration for approximate models. (arXiv:2211.05357v4 [stat.CO] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.05357
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20943;&#23567;&#20559;&#24046;&#21644;&#20135;&#29983;&#26356;&#20934;&#30830;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#36817;&#20284;&#21518;&#39564;&#35843;&#25972;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#36817;&#20284;&#21518;&#39564;&#30340;&#21464;&#25442;&#26469;&#26368;&#22823;&#21270;&#24471;&#20998;&#35268;&#21017;&#12290;&#36825;&#31181;&#26041;&#27861;&#21482;&#38656;&#35201;&#36827;&#34892;&#23569;&#37327;&#22797;&#26434;&#27169;&#22411;&#27169;&#25311;&#65292;&#19988;&#20855;&#26377;&#25968;&#20540;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#23478;&#20204;&#19981;&#26029;&#21457;&#23637;&#36234;&#26469;&#36234;&#22797;&#26434;&#30340;&#26426;&#26800;&#27169;&#22411;&#65292;&#20197;&#26356;&#30495;&#23454;&#22320;&#21453;&#26144;&#20182;&#20204;&#30340;&#30693;&#35782;&#12290;&#20351;&#29992;&#36825;&#20123;&#27169;&#22411;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#21487;&#33021;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#20026;&#30456;&#24212;&#30340;&#20284;&#28982;&#20989;&#25968;&#36890;&#24120;&#38590;&#20197;&#22788;&#29702;&#65292;&#24182;&#19988;&#27169;&#22411;&#27169;&#25311;&#21487;&#33021;&#24102;&#26469;&#35745;&#31639;&#36127;&#25285;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#21487;&#20197;&#37319;&#29992;&#26367;&#20195;&#27169;&#22411;&#25110;&#36817;&#20284;&#20284;&#28982;&#20989;&#25968;&#12290;&#30452;&#25509;&#20351;&#29992;&#26367;&#20195;&#20284;&#28982;&#20989;&#25968;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21487;&#33021;&#24456;&#26041;&#20415;&#65292;&#20294;&#21487;&#33021;&#23548;&#33268;&#20559;&#24046;&#21644;&#19981;&#20934;&#30830;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#36817;&#20284;&#21518;&#39564;&#30340;&#21464;&#25442;&#26469;&#26368;&#22823;&#21270;&#24471;&#20998;&#35268;&#21017;&#65292;&#20174;&#32780;&#20943;&#23567;&#20559;&#24046;&#24182;&#20135;&#29983;&#26356;&#20934;&#30830;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21482;&#38656;&#35201;&#36827;&#34892;&#65288;&#22266;&#23450;&#30340;&#65289;&#23569;&#37327;&#22797;&#26434;&#27169;&#22411;&#27169;&#25311;&#65292;&#19988;&#20855;&#26377;&#25968;&#20540;&#31283;&#23450;&#24615;&#12290;&#25105;&#20204;&#22312;&#20960;&#20010;&#19981;&#26029;&#22686;&#21152;&#30340;&#31034;&#20363;&#19978;&#23637;&#31034;&#20102;&#26032;&#26041;&#27861;&#30340;&#33391;&#22909;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientists continue to develop increasingly complex mechanistic models to reflect their knowledge more realistically. Statistical inference using these models can be challenging since the corresponding likelihood function is often intractable and model simulation may be computationally burdensome. Fortunately, in many of these situations, it is possible to adopt a surrogate model or approximate likelihood function. It may be convenient to conduct Bayesian inference directly with the surrogate, but this can result in bias and poor uncertainty quantification. In this paper we propose a new method for adjusting approximate posterior samples to reduce bias and produce more accurate uncertainty quantification. We do this by optimizing a transform of the approximate posterior that maximizes a scoring rule. Our approach requires only a (fixed) small number of complex model simulations and is numerically stable. We demonstrate good performance of the new method on several examples of increasin
&lt;/p&gt;</description></item></channel></rss>