<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#30740;&#31350;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#23545;&#21355;&#26143;&#21644;&#27979;&#31449;&#25968;&#25454;&#36827;&#34892;&#25554;&#20540;&#65292;&#36890;&#36807;&#37327;&#21270;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#26469;&#25552;&#39640;&#38477;&#27700;&#25968;&#25454;&#38598;&#30340;&#20998;&#36776;&#29575;&#12290;</title><link>https://arxiv.org/abs/2311.07511</link><description>&lt;p&gt;
&#29992;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#21355;&#26143;&#38477;&#27700;&#25554;&#20540;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Uncertainty estimation in satellite precipitation interpolation with machine learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.07511
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#23545;&#21355;&#26143;&#21644;&#27979;&#31449;&#25968;&#25454;&#36827;&#34892;&#25554;&#20540;&#65292;&#36890;&#36807;&#37327;&#21270;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#26469;&#25552;&#39640;&#38477;&#27700;&#25968;&#25454;&#38598;&#30340;&#20998;&#36776;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#24182;&#21355;&#26143;&#21644;&#27979;&#31449;&#25968;&#25454;&#24182;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#20135;&#29983;&#39640;&#20998;&#36776;&#29575;&#38477;&#27700;&#25968;&#25454;&#38598;&#65292;&#20294;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#24448;&#24448;&#32570;&#22833;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#27604;&#20845;&#31181;&#31639;&#27861;&#65292;&#22823;&#37096;&#20998;&#26159;&#38024;&#23545;&#36825;&#19968;&#20219;&#21153;&#32780;&#35774;&#35745;&#30340;&#26032;&#31639;&#27861;&#65292;&#26469;&#37327;&#21270;&#31354;&#38388;&#25554;&#20540;&#20013;&#30340;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#36830;&#32493;&#32654;&#22269;&#30340;15&#24180;&#26376;&#24230;&#25968;&#25454;&#19978;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#20998;&#20301;&#25968;&#22238;&#24402;&#65288;QR&#65289;&#12289;&#20998;&#20301;&#25968;&#22238;&#24402;&#26862;&#26519;&#65288;QRF&#65289;&#12289;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#65288;GRF&#65289;&#12289;&#26799;&#24230;&#25552;&#21319;&#26426;&#65288;GBM&#65289;&#12289;&#36731;&#26799;&#24230;&#25552;&#21319;&#26426;&#65288;LightGBM&#65289;&#21644;&#20998;&#20301;&#25968;&#22238;&#24402;&#31070;&#32463;&#32593;&#32476;&#65288;QRNN&#65289;&#12290;&#23427;&#20204;&#33021;&#22815;&#22312;&#20061;&#20010;&#20998;&#20301;&#27700;&#24179;&#65288;0.025&#12289;0.050&#12289;0.100&#12289;0.250&#12289;0.500&#12289;0.750&#12289;0.900&#12289;0.950&#12289;0.975&#65289;&#19978;&#21457;&#24067;&#39044;&#27979;&#38477;&#27700;&#20998;&#20301;&#25968;&#65292;&#20197;&#36817;&#20284;&#23436;&#25972;&#27010;&#29575;&#20998;&#24067;&#65292;&#35780;&#20272;&#26102;&#37319;&#29992;&#20998;&#20301;&#25968;&#35780;&#20998;&#20989;&#25968;&#21644;&#20998;&#20301;&#25968;&#35780;&#20998;&#35268;&#21017;&#12290;&#29305;&#24449;&#37325;&#35201;&#24615;&#20998;&#26512;&#25581;&#31034;&#20102;&#21355;&#26143;&#38477;&#27700;&#65288;PERSIA
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.07511v2 Announce Type: replace-cross  Abstract: Merging satellite and gauge data with machine learning produces high-resolution precipitation datasets, but uncertainty estimates are often missing. We address this gap by benchmarking six algorithms, mostly novel for this task, for quantifying predictive uncertainty in spatial interpolation. On 15 years of monthly data over the contiguous United States (CONUS), we compared quantile regression (QR), quantile regression forests (QRF), generalized random forests (GRF), gradient boosting machines (GBM), light gradient boosting machines (LightGBM), and quantile regression neural networks (QRNN). Their ability to issue predictive precipitation quantiles at nine quantile levels (0.025, 0.050, 0.100, 0.250, 0.500, 0.750, 0.900, 0.950, 0.975), approximating the full probability distribution, was evaluated using quantile scoring functions and the quantile scoring rule. Feature importance analysis revealed satellite precipitation (PERSIA
&lt;/p&gt;</description></item><item><title>&#21033;&#29992;&#29616;&#20195;&#25968;&#25454;&#38598;&#20013;&#22823;&#37327;&#20013;&#38388;&#32467;&#26524;&#30340;&#20107;&#23454;&#65292;&#21363;&#20351;&#27809;&#26377;&#21333;&#20010;&#26367;&#20195;&#25351;&#26631;&#28385;&#36275;&#32479;&#35745;&#26367;&#20195;&#26465;&#20214;&#65292;&#20351;&#29992;&#22810;&#20010;&#26367;&#20195;&#25351;&#26631;&#20063;&#21487;&#33021;&#26159;&#26377;&#25928;&#30340;&#12290;</title><link>https://arxiv.org/abs/1603.09326</link><description>&lt;p&gt;
&#21033;&#29992;&#22810;&#20010;&#26367;&#20195;&#25351;&#26631;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#65306;&#26367;&#20195;&#20998;&#25968;&#21644;&#26367;&#20195;&#25351;&#25968;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Estimating Treatment Effects using Multiple Surrogates: The Role of the Surrogate Score and the Surrogate Index
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1603.09326
&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#29616;&#20195;&#25968;&#25454;&#38598;&#20013;&#22823;&#37327;&#20013;&#38388;&#32467;&#26524;&#30340;&#20107;&#23454;&#65292;&#21363;&#20351;&#27809;&#26377;&#21333;&#20010;&#26367;&#20195;&#25351;&#26631;&#28385;&#36275;&#32479;&#35745;&#26367;&#20195;&#26465;&#20214;&#65292;&#20351;&#29992;&#22810;&#20010;&#26367;&#20195;&#25351;&#26631;&#20063;&#21487;&#33021;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#38271;&#26399;&#20316;&#29992;&#26159;&#35768;&#22810;&#39046;&#22495;&#24863;&#20852;&#36259;&#30340;&#38382;&#39064;&#12290; &#20272;&#35745;&#27492;&#31867;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#20010;&#24120;&#35265;&#25361;&#25112;&#22312;&#20110;&#38271;&#26399;&#32467;&#26524;&#22312;&#38656;&#35201;&#20570;&#20986;&#25919;&#31574;&#20915;&#31574;&#30340;&#26102;&#38388;&#33539;&#22260;&#20869;&#26159;&#26410;&#35266;&#23519;&#21040;&#30340;&#12290; &#20811;&#26381;&#36825;&#31181;&#32570;&#22833;&#25968;&#25454;&#38382;&#39064;&#30340;&#19968;&#31181;&#26041;&#27861;&#26159;&#20998;&#26512;&#27835;&#30103;&#25928;&#26524;&#23545;&#20013;&#38388;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#36890;&#24120;&#31216;&#20026;&#32479;&#35745;&#26367;&#20195;&#25351;&#26631;&#65292;&#22914;&#26524;&#28385;&#36275;&#26465;&#20214;&#65306;&#22312;&#32479;&#35745;&#26367;&#20195;&#25351;&#26631;&#30340;&#26465;&#20214;&#19979;&#65292;&#27835;&#30103;&#21644;&#32467;&#26524;&#26159;&#29420;&#31435;&#30340;&#12290;  &#26367;&#20195;&#26465;&#20214;&#30340;&#26377;&#25928;&#24615;&#32463;&#24120;&#26159;&#26377;&#20105;&#35758;&#30340;&#12290; &#22312;&#29616;&#20195;&#25968;&#25454;&#38598;&#20013;&#65292;&#30740;&#31350;&#20154;&#21592;&#36890;&#24120;&#35266;&#23519;&#21040;&#22823;&#37327;&#20013;&#38388;&#32467;&#26524;&#65292;&#21487;&#33021;&#26159;&#25968;&#30334;&#20010;&#25110;&#25968;&#21315;&#20010;&#65292;&#34987;&#35748;&#20026;&#20301;&#20110;&#27835;&#30103;&#21644;&#38271;&#26399;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#20043;&#38388;&#30340;&#22240;&#26524;&#38142;&#19978;&#25110;&#38468;&#36817;&#12290; &#21363;&#20351;&#27809;&#26377;&#20010;&#21035;&#20195;&#29702;&#28385;&#36275;&#32479;&#35745;&#26367;&#20195;&#26465;&#20214;&#65292;&#20351;&#29992;&#22810;&#20010;&#20195;&#29702;&#20063;&#21487;&#20197;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1603.09326v4 Announce Type: replace-cross  Abstract: Estimating the long-term effects of treatments is of interest in many fields. A common challenge in estimating such treatment effects is that long-term outcomes are unobserved in the time frame needed to make policy decisions. One approach to overcome this missing data problem is to analyze treatments effects on an intermediate outcome, often called a statistical surrogate, if it satisfies the condition that treatment and outcome are independent conditional on the statistical surrogate. The validity of the surrogacy condition is often controversial. Here we exploit that fact that in modern datasets, researchers often observe a large number, possibly hundreds or thousands, of intermediate outcomes, thought to lie on or close to the causal chain between the treatment and the long-term outcome of interest. Even if none of the individual proxies satisfies the statistical surrogacy criterion by itself, using multiple proxies can be 
&lt;/p&gt;</description></item></channel></rss>