<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;Rashomon Set of Optimal Trees (ROOT)&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#30340;&#23569;&#25968;&#20154;&#32676;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#25552;&#20379;&#26356;&#31934;&#30830;&#21644;&#21487;&#35299;&#37322;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.14512</link><description>&lt;p&gt;
&#25105;&#20204;&#38169;&#36807;&#20102;&#35841;&#65311;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#25581;&#31034;&#23569;&#25968;&#20154;&#32676;&#29305;&#24449;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Who Are We Missing? A Principled Approach to Characterizing the Underrepresented Population. (arXiv:2401.14512v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;Rashomon Set of Optimal Trees (ROOT)&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#30340;&#23569;&#25968;&#20154;&#32676;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#25552;&#20379;&#26356;&#31934;&#30830;&#21644;&#21487;&#35299;&#37322;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#22312;&#29702;&#35299;&#22240;&#26524;&#25928;&#24212;&#26041;&#38754;&#36215;&#21040;&#20102;&#20851;&#38190;&#20316;&#29992;&#65292;&#28982;&#32780;&#23558;&#25512;&#35770;&#25193;&#23637;&#21040;&#30446;&#26631;&#20154;&#32676;&#26102;&#38754;&#20020;&#25928;&#24212;&#24322;&#36136;&#24615;&#21644;&#20195;&#34920;&#24615;&#19981;&#36275;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#35770;&#25991;&#35299;&#20915;&#20102;&#22312;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#35782;&#21035;&#21644;&#25551;&#36848;&#23569;&#25968;&#20154;&#32676;&#30340;&#20851;&#38190;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25913;&#36827;&#30446;&#26631;&#20154;&#32676;&#20197;&#25552;&#21319;&#26222;&#36866;&#24615;&#30340;&#21019;&#26032;&#26694;&#26550;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#8212;&#8212;Rashomon Set of Optimal Trees (ROOT)&#65292;&#26469;&#25551;&#36848;&#23569;&#25968;&#20154;&#32676;&#12290;ROOT&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#30830;&#20445;&#26356;&#31934;&#30830;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;ROOT&#29983;&#25104;&#21487;&#35299;&#37322;&#30340;&#23569;&#25968;&#20154;&#32676;&#29305;&#24449;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#20154;&#21592;&#26377;&#25928;&#27807;&#36890;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#26041;&#38754;&#30456;&#23545;&#20110;&#20854;&#20182;&#26041;&#27861;&#23637;&#29616;&#20102;&#25913;&#36827;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Randomized controlled trials (RCTs) serve as the cornerstone for understanding causal effects, yet extending inferences to target populations presents challenges due to effect heterogeneity and underrepresentation. Our paper addresses the critical issue of identifying and characterizing underrepresented subgroups in RCTs, proposing a novel framework for refining target populations to improve generalizability. We introduce an optimization-based approach, Rashomon Set of Optimal Trees (ROOT), to characterize underrepresented groups. ROOT optimizes the target subpopulation distribution by minimizing the variance of the target average treatment effect estimate, ensuring more precise treatment effect estimations. Notably, ROOT generates interpretable characteristics of the underrepresented population, aiding researchers in effective communication. Our approach demonstrates improved precision and interpretability compared to alternatives, as illustrated with synthetic data experiments. We ap
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#26356;&#39640;&#30340;&#25209;&#35780;&#21147;&#37327;&#23558;&#20154;&#31867;&#35302;&#25720;&#19982;AI&#29983;&#25104;&#30340;&#25991;&#26412;&#20998;&#31163;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#22810;&#20010;&#22256;&#24785;&#24230;&#27979;&#35797;&#21644;&#32479;&#35745;&#27169;&#22411;&#30340;&#32467;&#21512;&#65292;&#33021;&#22815;&#26377;&#25928;&#35782;&#21035;&#20986;&#21487;&#33021;&#34987;&#32534;&#36753;&#30340;&#37096;&#20998;&#65292;&#24182;&#25506;&#35752;&#20102;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#21450;&#30456;&#20851;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2308.12747</link><description>&lt;p&gt;
&#20351;&#29992;&#26356;&#39640;&#30340;&#25209;&#35780;&#21147;&#37327;&#23558;&#20154;&#31867;&#35302;&#25720;&#19982;AI&#29983;&#25104;&#30340;&#25991;&#26412;&#20998;&#31163;&#65306;&#19968;&#31181;&#20449;&#24687;&#35770;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Separating the Human Touch from AI-Generated Text using Higher Criticism: An Information-Theoretic Approach. (arXiv:2308.12747v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12747
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#26356;&#39640;&#30340;&#25209;&#35780;&#21147;&#37327;&#23558;&#20154;&#31867;&#35302;&#25720;&#19982;AI&#29983;&#25104;&#30340;&#25991;&#26412;&#20998;&#31163;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#22810;&#20010;&#22256;&#24785;&#24230;&#27979;&#35797;&#21644;&#32479;&#35745;&#27169;&#22411;&#30340;&#32467;&#21512;&#65292;&#33021;&#22815;&#26377;&#25928;&#35782;&#21035;&#20986;&#21487;&#33021;&#34987;&#32534;&#36753;&#30340;&#37096;&#20998;&#65292;&#24182;&#25506;&#35752;&#20102;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#21450;&#30456;&#20851;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#19968;&#31687;&#32473;&#23450;&#25991;&#31456;&#26159;&#23436;&#20840;&#30001;&#29983;&#25104;&#24615;&#35821;&#35328;&#27169;&#22411;&#32534;&#20889;&#30340;&#65292;&#36824;&#26159;&#21253;&#21547;&#20102;&#19968;&#20123;&#30001;&#20854;&#20182;&#20316;&#32773;&#65288;&#21487;&#33021;&#26159;&#20154;&#31867;&#65289;&#36827;&#34892;&#20102;&#37325;&#35201;&#32534;&#36753;&#30340;&#26367;&#20195;&#24773;&#20917;&#12290;&#25105;&#20204;&#30340;&#36807;&#31243;&#28041;&#21450;&#23545;&#20010;&#21035;&#21477;&#23376;&#25110;&#20854;&#20182;&#25991;&#26412;&#21333;&#20301;&#36215;&#28304;&#36827;&#34892;&#30340;&#22810;&#20010;&#22256;&#24785;&#24230;&#27979;&#35797;&#65292;&#23558;&#36825;&#20123;&#22810;&#20010;&#27979;&#35797;&#32467;&#21512;&#36215;&#26469;&#20351;&#29992;&#26356;&#39640;&#30340;&#25209;&#35780;&#21147;&#37327;&#65288;HC&#65289;&#12290;&#20316;&#20026;&#21103;&#20135;&#21697;&#65292;&#35813;&#26041;&#27861;&#36824;&#33021;&#22815;&#35782;&#21035;&#20986;&#21487;&#33021;&#34987;&#32534;&#36753;&#30340;&#37096;&#20998;&#12290;&#35813;&#26041;&#27861;&#21463;&#21040;&#20102;&#23545;&#25968;&#22256;&#24785;&#24230;&#25910;&#25947;&#21040;&#20132;&#21449;&#29109;&#29575;&#30340;&#21551;&#21457;&#65292;&#20197;&#21450;&#19968;&#20010;&#32479;&#35745;&#27169;&#22411;&#26469;&#25551;&#36848;&#34987;&#32534;&#36753;&#30340;&#25991;&#26412;&#65292;&#21363;&#21477;&#23376;&#20027;&#35201;&#30001;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#65292;&#20294;&#21487;&#33021;&#26377;&#23569;&#25968;&#21477;&#23376;&#26159;&#36890;&#36807;&#20854;&#20182;&#26426;&#21046;&#20135;&#29983;&#30340;&#12290;&#25105;&#20204;&#20351;&#29992;&#30495;&#23454;&#25968;&#25454;&#35777;&#26126;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#24433;&#21709;&#20854;&#25104;&#21151;&#30340;&#22240;&#32032;&#12290;&#36825;&#20010;&#20998;&#26512;&#25552;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#24320;&#25918;&#25361;&#25112;&#65292;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#21487;&#33021;&#20250;&#25913;&#21892;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a method to determine whether a given article was entirely written by a generative language model versus an alternative situation in which the article includes some significant edits by a different author, possibly a human. Our process involves many perplexity tests for the origin of individual sentences or other text atoms, combining these multiple tests using Higher Criticism (HC). As a by-product, the method identifies parts suspected to be edited. The method is motivated by the convergence of the log-perplexity to the cross-entropy rate and by a statistical model for edited text saying that sentences are mostly generated by the language model, except perhaps for a few sentences that might have originated via a different mechanism. We demonstrate the effectiveness of our method using real data and analyze the factors affecting its success. This analysis raises several interesting open challenges whose resolution may improve the method's effectiveness.
&lt;/p&gt;</description></item></channel></rss>