<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#20010;&#26032;&#30340;&#36317;&#31163;&#24230;&#37327;&#25351;&#26631;&#65288;s/c&#36317;&#31163;&#12289;&#39532;&#23572;&#31185;&#22827;&#36317;&#31163;&#21644;&#24544;&#23454;&#24230;&#36317;&#31163;&#65289;&#65292;&#29992;&#20110;&#35780;&#20272;&#22240;&#26524;&#25512;&#26029;&#31639;&#27861;&#30340;&#36755;&#20986;&#22270;&#19982;&#30495;&#23454;&#24773;&#20917;&#30340;&#20998;&#31163;/&#36830;&#25509;&#31243;&#24230;&#12290;</title><link>https://arxiv.org/abs/2402.04952</link><description>&lt;p&gt;
&#35780;&#20272;&#22240;&#26524;&#25512;&#26029;&#31639;&#27861;&#30340;&#39532;&#23572;&#31185;&#22827;&#31561;&#20215;&#31867;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Metrics on Markov Equivalence Classes for Evaluating Causal Discovery Algorithms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04952
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19977;&#20010;&#26032;&#30340;&#36317;&#31163;&#24230;&#37327;&#25351;&#26631;&#65288;s/c&#36317;&#31163;&#12289;&#39532;&#23572;&#31185;&#22827;&#36317;&#31163;&#21644;&#24544;&#23454;&#24230;&#36317;&#31163;&#65289;&#65292;&#29992;&#20110;&#35780;&#20272;&#22240;&#26524;&#25512;&#26029;&#31639;&#27861;&#30340;&#36755;&#20986;&#22270;&#19982;&#30495;&#23454;&#24773;&#20917;&#30340;&#20998;&#31163;/&#36830;&#25509;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#26368;&#20808;&#36827;&#30340;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#26088;&#22312;&#29983;&#25104;&#19968;&#20010;&#36755;&#20986;&#22270;&#65292;&#35813;&#22270;&#32534;&#30721;&#20102;&#29983;&#25104;&#25968;&#25454;&#36807;&#31243;&#30340;&#22240;&#26524;&#22270;&#30340;&#22270;&#24418;&#20998;&#31163;&#21644;&#36830;&#25509;&#38472;&#36848;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35748;&#20026;&#65292;&#23545;&#21512;&#25104;&#25968;&#25454;&#30340;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#36827;&#34892;&#35780;&#20272;&#24212;&#35813;&#21253;&#25324;&#20998;&#26512;&#35813;&#26041;&#27861;&#30340;&#36755;&#20986;&#19982;&#30495;&#23454;&#24773;&#20917;&#30340;&#20998;&#31163;/&#36830;&#25509;&#31243;&#24230;&#65292;&#20197;&#34913;&#37327;&#36825;&#19968;&#26126;&#30830;&#30446;&#26631;&#30340;&#23454;&#29616;&#24773;&#20917;&#12290;&#25105;&#20204;&#35777;&#26126;&#29616;&#26377;&#30340;&#35780;&#20272;&#25351;&#26631;&#19981;&#33021;&#20934;&#30830;&#25429;&#25417;&#21040;&#20004;&#20010;&#22240;&#26524;&#22270;&#30340;&#20998;&#31163;/&#36830;&#25509;&#24046;&#24322;&#65292;&#24182;&#24341;&#20837;&#20102;&#19977;&#20010;&#26032;&#30340;&#36317;&#31163;&#24230;&#37327;&#25351;&#26631;&#65292;&#21363;s/c&#36317;&#31163;&#12289;&#39532;&#23572;&#31185;&#22827;&#36317;&#31163;&#21644;&#24544;&#23454;&#24230;&#36317;&#31163;&#65292;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#29609;&#20855;&#31034;&#20363;&#12289;&#23454;&#35777;&#23454;&#39564;&#21644;&#20266;&#20195;&#30721;&#26469;&#34917;&#20805;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many state-of-the-art causal discovery methods aim to generate an output graph that encodes the graphical separation and connection statements of the causal graph that underlies the data-generating process. In this work, we argue that an evaluation of a causal discovery method against synthetic data should include an analysis of how well this explicit goal is achieved by measuring how closely the separations/connections of the method's output align with those of the ground truth. We show that established evaluation measures do not accurately capture the difference in separations/connections of two causal graphs, and we introduce three new measures of distance called s/c-distance, Markov distance and Faithfulness distance that address this shortcoming. We complement our theoretical analysis with toy examples, empirical experiments and pseudocode.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#28508;&#22312;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#24314;&#27169;&#19982;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#35745;&#25968;&#21644;&#24213;&#23618;&#39640;&#26031;&#27169;&#22411;&#30340;&#20108;&#38454;&#29305;&#24615;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21033;&#29992;&#31890;&#23376;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2307.10454</link><description>&lt;p&gt;
&#38024;&#23545;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#28508;&#22312;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#24314;&#27169;&#19982;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Latent Gaussian dynamic factor modeling and forecasting for multivariate count time series. (arXiv:2307.10454v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10454
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#28508;&#22312;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#24314;&#27169;&#19982;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#35745;&#25968;&#21644;&#24213;&#23618;&#39640;&#26031;&#27169;&#22411;&#30340;&#20108;&#38454;&#29305;&#24615;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21033;&#29992;&#31890;&#23376;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#31181;&#22522;&#20110;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#35745;&#25968;&#21644;&#24213;&#23618;&#39640;&#26031;&#27169;&#22411;&#30340;&#20108;&#38454;&#29305;&#24615;&#65292;&#24182;&#36866;&#29992;&#20110;&#27169;&#22411;&#32500;&#25968;&#22823;&#20110;&#26679;&#26412;&#38271;&#24230;&#30340;&#24773;&#20917;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#27169;&#22411;&#36873;&#25321;&#30340;&#26032;&#22411;&#20132;&#21449;&#39564;&#35777;&#26041;&#26696;&#12290;&#39044;&#27979;&#36890;&#36807;&#22522;&#20110;&#31890;&#23376;&#30340;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#65292;&#21033;&#29992;&#21345;&#23572;&#26364;&#28388;&#27874;&#25216;&#26415;&#12290;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#30740;&#31350;&#21644;&#24212;&#29992;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work considers estimation and forecasting in a multivariate count time series model based on a copula-type transformation of a Gaussian dynamic factor model. The estimation is based on second-order properties of the count and underlying Gaussian models and applies to the case where the model dimension is larger than the sample length. In addition, novel cross-validation schemes are suggested for model selection. The forecasting is carried out through a particle-based sequential Monte Carlo, leveraging Kalman filtering techniques. A simulation study and an application are also considered.
&lt;/p&gt;</description></item></channel></rss>