<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#30456;&#20851;&#36755;&#20837;&#25200;&#21160;&#30340;&#24046;&#20998;&#38544;&#31169;&#33539;&#22260;&#26597;&#35810;&#30340;&#23616;&#37096;&#26426;&#21046;&#65292;&#36890;&#36807;&#32423;&#32852;&#37319;&#26679;&#31639;&#27861;&#23454;&#29616;&#65292;&#23454;&#39564;&#34920;&#26126;&#22312;&#20445;&#38556;&#36817;&#20046;&#26368;&#20248;&#30340;&#25928;&#29992;&#30340;&#21516;&#26102;&#65292;&#19982;&#36755;&#20986;&#25200;&#21160;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.07066</link><description>&lt;p&gt;
&#20855;&#26377;&#30456;&#20851;&#36755;&#20837;&#25200;&#21160;&#30340;&#24046;&#20998;&#38544;&#31169;&#33539;&#22260;&#26597;&#35810;
&lt;/p&gt;
&lt;p&gt;
Differentially Private Range Queries with Correlated Input Perturbation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07066
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20855;&#26377;&#30456;&#20851;&#36755;&#20837;&#25200;&#21160;&#30340;&#24046;&#20998;&#38544;&#31169;&#33539;&#22260;&#26597;&#35810;&#30340;&#23616;&#37096;&#26426;&#21046;&#65292;&#36890;&#36807;&#32423;&#32852;&#37319;&#26679;&#31639;&#27861;&#23454;&#29616;&#65292;&#23454;&#39564;&#34920;&#26126;&#22312;&#20445;&#38556;&#36817;&#20046;&#26368;&#20248;&#30340;&#25928;&#29992;&#30340;&#21516;&#26102;&#65292;&#19982;&#36755;&#20986;&#25200;&#21160;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#32447;&#24615;&#26597;&#35810;&#30340;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#26426;&#21046;&#65292;&#29305;&#21035;&#26159;&#33539;&#22260;&#26597;&#35810;&#65292;&#21033;&#29992;&#30456;&#20851;&#36755;&#20837;&#25200;&#21160;&#21516;&#26102;&#23454;&#29616;&#26080;&#20559;&#24615;&#12289;&#19968;&#33268;&#24615;&#12289;&#32479;&#35745;&#36879;&#26126;&#24615;&#21644;&#23545;&#31934;&#24230;&#30446;&#26631;&#30340;&#25511;&#21046;&#65292;&#26080;&#35770;&#26159;&#22312;&#26576;&#20123;&#26597;&#35810;&#36793;&#32536;&#19978;&#36824;&#26159;&#22312;&#23618;&#27425;&#25968;&#25454;&#24211;&#32467;&#26500;&#25152;&#26263;&#31034;&#30340;&#31934;&#24230;&#35201;&#27714;&#19978;&#12290;&#25152;&#25552;&#20986;&#30340;&#32423;&#32852;&#37319;&#26679;&#31639;&#27861;&#20934;&#30830;&#39640;&#25928;&#22320;&#23454;&#29616;&#20102;&#35813;&#26426;&#21046;&#12290;&#25105;&#20204;&#30340;&#30028;&#38480;&#34920;&#26126;&#65292;&#25105;&#20204;&#22312;&#20445;&#38556;&#36817;&#20046;&#26368;&#20248;&#30340;&#25928;&#29992;&#30340;&#21516;&#26102;&#65292;&#19982;&#36755;&#20986;&#25200;&#21160;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#20855;&#26377;&#31454;&#20105;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work proposes a class of locally differentially private mechanisms for linear queries, in particular range queries, that leverages correlated input perturbation to simultaneously achieve unbiasedness, consistency, statistical transparency, and control over utility requirements in terms of accuracy targets expressed either in certain query margins or as implied by the hierarchical database structure. The proposed Cascade Sampling algorithm instantiates the mechanism exactly and efficiently. Our bounds show that we obtain near-optimal utility while being empirically competitive against output perturbation methods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26032;&#30340;&#8220;e-process&#8221;&#21644;&#32622;&#20449;&#24207;&#21015;&#26041;&#27861;&#65292;&#20998;&#21035;&#36890;&#36807;&#26367;&#25442;Lai&#30340;&#28151;&#21512;&#26041;&#27861;&#65292;&#24182;&#20998;&#26512;&#20102;&#25152;&#24471;&#32467;&#26524;&#30340;&#23485;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.03722</link><description>&lt;p&gt;
&#26410;&#30693;&#26041;&#24046;&#19979;&#30340;&#39640;&#26031;&#22343;&#20540;&#30340;&#20219;&#24847;&#26377;&#25928;T&#26816;&#39564;&#21644;&#32622;&#20449;&#24207;&#21015;
&lt;/p&gt;
&lt;p&gt;
Anytime-valid t-tests and confidence sequences for Gaussian means with unknown variance. (arXiv:2310.03722v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03722
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26032;&#30340;&#8220;e-process&#8221;&#21644;&#32622;&#20449;&#24207;&#21015;&#26041;&#27861;&#65292;&#20998;&#21035;&#36890;&#36807;&#26367;&#25442;Lai&#30340;&#28151;&#21512;&#26041;&#27861;&#65292;&#24182;&#20998;&#26512;&#20102;&#25152;&#24471;&#32467;&#26524;&#30340;&#23485;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;1976&#24180;&#65292;Lai&#26500;&#36896;&#20102;&#19968;&#20010;&#38750;&#24179;&#20961;&#30340;&#22343;&#20540;$\mu$&#30340;&#39640;&#26031;&#20998;&#24067;&#30340;&#32622;&#20449;&#24207;&#21015;&#65292;&#35813;&#20998;&#24067;&#30340;&#26041;&#24046;$\sigma$&#26159;&#26410;&#30693;&#30340;&#12290;&#20182;&#20351;&#29992;&#20102;&#20851;&#20110;$\sigma$&#30340;&#19981;&#36866;&#24403;&#65288;&#21491;Haar&#65289;&#28151;&#21512;&#21644;&#20851;&#20110;$\mu$&#30340;&#19981;&#36866;&#24403;&#65288;&#24179;&#22374;&#65289;&#28151;&#21512;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35814;&#32454;&#35828;&#26126;&#20102;&#20182;&#26500;&#24314;&#30340;&#32454;&#33410;&#65292;&#20854;&#20013;&#20351;&#29992;&#20102;&#24191;&#20041;&#30340;&#19981;&#21487;&#31215;&#20998;&#38789;&#21644;&#25193;&#23637;&#30340;&#32500;&#23572;&#19981;&#31561;&#24335;&#12290;&#23613;&#31649;&#36825;&#30830;&#23454;&#20135;&#29983;&#20102;&#19968;&#20010;&#39034;&#24207;T&#26816;&#39564;&#65292;&#20294;&#30001;&#20110;&#20182;&#30340;&#38789;&#19981;&#21487;&#31215;&#20998;&#65292;&#23427;&#24182;&#27809;&#26377;&#20135;&#29983;&#19968;&#20010;&#8220;e-process&#8221;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20026;&#30456;&#21516;&#30340;&#35774;&#32622;&#24320;&#21457;&#20102;&#20004;&#20010;&#26032;&#30340;&#8220;e-process&#8221;&#21644;&#32622;&#20449;&#24207;&#21015;&#65306;&#19968;&#20010;&#26159;&#22312;&#32553;&#20943;&#28388;&#27874;&#22120;&#20013;&#30340;&#27979;&#35797;&#38789;&#65292;&#21478;&#19968;&#20010;&#26159;&#22312;&#35268;&#33539;&#25968;&#25454;&#28388;&#27874;&#22120;&#20013;&#30340;&#8220;e-process&#8221;&#12290;&#36825;&#20123;&#20998;&#21035;&#26159;&#36890;&#36807;&#23558;Lai&#30340;&#24179;&#22374;&#28151;&#21512;&#26367;&#25442;&#20026;&#39640;&#26031;&#28151;&#21512;&#65292;&#24182;&#23558;&#23545;$\sigma$&#30340;&#21491;Haar&#28151;&#21512;&#26367;&#25442;&#20026;&#22312;&#38646;&#31354;&#38388;&#19979;&#30340;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65292;&#23601;&#20687;&#22312;&#36890;&#29992;&#25512;&#26029;&#20013;&#19968;&#26679;&#12290;&#25105;&#20204;&#36824;&#20998;&#26512;&#20102;&#25152;&#24471;&#32467;&#26524;&#30340;&#23485;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
In 1976, Lai constructed a nontrivial confidence sequence for the mean $\mu$ of a Gaussian distribution with unknown variance $\sigma$. Curiously, he employed both an improper (right Haar) mixture over $\sigma$ and an improper (flat) mixture over $\mu$. Here, we elaborate carefully on the details of his construction, which use generalized nonintegrable martingales and an extended Ville's inequality. While this does yield a sequential t-test, it does not yield an ``e-process'' (due to the nonintegrability of his martingale). In this paper, we develop two new e-processes and confidence sequences for the same setting: one is a test martingale in a reduced filtration, while the other is an e-process in the canonical data filtration. These are respectively obtained by swapping Lai's flat mixture for a Gaussian mixture, and swapping the right Haar mixture over $\sigma$ with the maximum likelihood estimate under the null, as done in universal inference. We also analyze the width of resulting 
&lt;/p&gt;</description></item></channel></rss>