<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#20248;&#21270;&#28909;&#39044;&#35686;&#31995;&#32479;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#39062;&#24378;&#21270;&#23398;&#20064;&#29615;&#22659;&#21644;&#32508;&#21512;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#27668;&#20505;&#21644;&#20581;&#24247;&#29615;&#22659;&#20013;&#30340;&#20302;&#20449;&#21495;&#25928;&#24212;&#21644;&#31354;&#38388;&#24322;&#36136;&#24615;&#12290;</title><link>https://arxiv.org/abs/2312.14196</link><description>&lt;p&gt;
&#29992;&#24378;&#21270;&#23398;&#20064;&#20248;&#21270;&#28909;&#39044;&#35686;&#30340;&#21457;&#24067;
&lt;/p&gt;
&lt;p&gt;
Optimizing Heat Alert Issuance with Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.14196
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#20248;&#21270;&#28909;&#39044;&#35686;&#31995;&#32479;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#39062;&#24378;&#21270;&#23398;&#20064;&#29615;&#22659;&#21644;&#32508;&#21512;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#27668;&#20505;&#21644;&#20581;&#24247;&#29615;&#22659;&#20013;&#30340;&#20302;&#20449;&#21495;&#25928;&#24212;&#21644;&#31354;&#38388;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#36866;&#24212;&#27668;&#20505;&#21464;&#21270;&#30340;&#20851;&#38190;&#25112;&#30053;&#20043;&#19968;&#26159;&#21033;&#29992;&#39044;&#35686;&#31995;&#32479;&#20943;&#23569;&#26497;&#31471;&#39640;&#28201;&#20107;&#20214;&#30340;&#19981;&#21033;&#20581;&#24247;&#24433;&#21709;&#65292;&#20197;&#20419;&#20351;&#39044;&#38450;&#24615;&#34892;&#21160;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#20316;&#20026;&#20248;&#21270;&#27492;&#31867;&#31995;&#32479;&#25928;&#26524;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26377;&#19977;&#20010;&#26041;&#38754;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#24378;&#21270;&#23398;&#20064;&#29615;&#22659;&#65292;&#35780;&#20272;&#28909;&#39044;&#35686;&#25919;&#31574;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#20943;&#23569;&#19982;&#39640;&#28201;&#26377;&#20851;&#30340;&#20303;&#38498;&#20154;&#25968;&#12290;&#22870;&#21169;&#27169;&#22411;&#22522;&#20110;&#21382;&#21490;&#22825;&#27668;&#12289;&#21307;&#30103;&#20445;&#38505;&#20581;&#24247;&#35760;&#24405;&#20197;&#21450;&#31038;&#20250;&#32463;&#27982;/&#22320;&#29702;&#29305;&#24449;&#30340;&#20840;&#38754;&#25968;&#25454;&#38598;&#36827;&#34892;&#35757;&#32451;&#12290;&#25105;&#20204;&#20351;&#29992;&#21464;&#20998;&#36125;&#21494;&#26031;&#25216;&#26415;&#35299;&#20915;&#20102;&#22312;&#27668;&#20505;&#21644;&#20581;&#24247;&#29615;&#22659;&#20013;&#24120;&#35265;&#30340;&#20302;&#20449;&#21495;&#25928;&#24212;&#21644;&#31354;&#38388;&#24322;&#36136;&#24615;&#12290;&#36716;&#25442;&#27169;&#22411;&#32467;&#21512;&#20102;&#30495;&#23454;&#30340;&#21382;&#21490;&#22825;&#27668;&#27169;&#24335;&#65292;&#24182;&#36890;&#36807;&#22522;&#20110;&#27668;&#20505;&#21306;&#22495;&#30456;&#20284;&#24615;&#30340;&#25968;&#25454;&#22686;&#24378;&#26426;&#21046;&#36827;&#34892;&#22686;&#24378;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.14196v2 Announce Type: replace  Abstract: A key strategy in societal adaptation to climate change is the use of alert systems to reduce the adverse health impacts of extreme heat events by prompting preventative action. In this work, we investigate reinforcement learning (RL) as a tool to optimize the effectiveness of such systems. Our contributions are threefold. First, we introduce a novel RL environment enabling the evaluation of the effectiveness of heat alert policies to reduce heat-related hospitalizations. The rewards model is trained from a comprehensive dataset of historical weather, Medicare health records, and socioeconomic/geographic features. We use variational Bayesian techniques to address low-signal effects and spatial heterogeneity, which are commonly encountered in climate &amp; health settings. The transition model incorporates real historical weather patterns enriched by a data augmentation mechanism based on climate region similarity. Second, we use this env
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#34920;&#31034;&#30340;&#26032;&#26041;&#27861;&#65292;&#20381;&#38752;&#29702;&#35770;&#29289;&#29702;&#30340;&#24605;&#24819;&#20197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#26500;&#24314;&#32039;&#20945;&#30340;&#34920;&#31034;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#25429;&#25417;&#25968;&#25454;&#30340;&#22522;&#26412;&#32467;&#26500;&#21644;&#20219;&#21153;&#29305;&#23450;&#20449;&#24687;&#65292;&#21516;&#26102;&#20445;&#25345;&#30452;&#35266;&#12289;&#21487;&#35299;&#37322;&#21644;&#21487;&#39564;&#35777;&#24615;&#65292;&#24182;&#21487;&#20197;&#22312;&#24191;&#20041;&#35774;&#32622;&#20013;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2307.01930</link><description>&lt;p&gt;
&#23398;&#20064;ECG&#20449;&#21495;&#29305;&#24449;&#30340;&#38750;&#21453;&#21521;&#20256;&#25773;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Learning ECG signal features without backpropagation. (arXiv:2307.01930v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01930
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#34920;&#31034;&#30340;&#26032;&#26041;&#27861;&#65292;&#20381;&#38752;&#29702;&#35770;&#29289;&#29702;&#30340;&#24605;&#24819;&#20197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#26500;&#24314;&#32039;&#20945;&#30340;&#34920;&#31034;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#25429;&#25417;&#25968;&#25454;&#30340;&#22522;&#26412;&#32467;&#26500;&#21644;&#20219;&#21153;&#29305;&#23450;&#20449;&#24687;&#65292;&#21516;&#26102;&#20445;&#25345;&#30452;&#35266;&#12289;&#21487;&#35299;&#37322;&#21644;&#21487;&#39564;&#35777;&#24615;&#65292;&#24182;&#21487;&#20197;&#22312;&#24191;&#20041;&#35774;&#32622;&#20013;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34920;&#31034;&#23398;&#20064;&#24050;&#32463;&#25104;&#20026;&#26426;&#22120;&#23398;&#20064;&#39046;&#22495;&#30340;&#19968;&#20010;&#20851;&#38190;&#30740;&#31350;&#39046;&#22495;&#65292;&#23427;&#26088;&#22312;&#21457;&#29616;&#29992;&#20110;&#25552;&#39640;&#20998;&#31867;&#21644;&#39044;&#27979;&#31561;&#19979;&#28216;&#20219;&#21153;&#30340;&#21407;&#22987;&#25968;&#25454;&#30340;&#26377;&#25928;&#29305;&#24449;&#30340;&#26377;&#25928;&#26041;&#27861;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#29983;&#25104;&#26102;&#38388;&#24207;&#21015;&#31867;&#22411;&#25968;&#25454;&#34920;&#31034;&#30340;&#26032;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#20381;&#38752;&#29702;&#35770;&#29289;&#29702;&#30340;&#24605;&#24819;&#20197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#26500;&#24314;&#32039;&#20945;&#30340;&#34920;&#31034;&#65292;&#24182;&#21487;&#20197;&#25429;&#25417;&#21040;&#25968;&#25454;&#30340;&#22522;&#26412;&#32467;&#26500;&#21644;&#20219;&#21153;&#29305;&#23450;&#20449;&#24687;&#65292;&#21516;&#26102;&#20445;&#25345;&#30452;&#35266;&#12289;&#21487;&#35299;&#37322;&#21644;&#21487;&#39564;&#35777;&#24615;&#12290;&#36825;&#20010;&#26032;&#26041;&#27861;&#26088;&#22312;&#35782;&#21035;&#33021;&#22815;&#26377;&#25928;&#25429;&#25417;&#23646;&#20110;&#29305;&#23450;&#31867;&#21035;&#30340;&#26679;&#26412;&#20043;&#38388;&#20849;&#20139;&#29305;&#24449;&#30340;&#32447;&#24615;&#35268;&#24459;&#12290;&#36890;&#36807;&#38543;&#21518;&#21033;&#29992;&#36825;&#20123;&#35268;&#24459;&#22312;&#21069;&#21521;&#26041;&#24335;&#19979;&#29983;&#25104;&#19968;&#20010;&#19982;&#20998;&#31867;&#22120;&#26080;&#20851;&#30340;&#34920;&#31034;&#65292;&#23427;&#20204;&#21487;&#20197;&#22312;&#24191;&#20041;&#35774;&#32622;&#20013;&#24212;&#29992;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Representation learning has become a crucial area of research in machine learning, as it aims to discover efficient ways of representing raw data with useful features to increase the effectiveness, scope and applicability of downstream tasks such as classification and prediction. In this paper, we propose a novel method to generate representations for time series-type data. This method relies on ideas from theoretical physics to construct a compact representation in a data-driven way, and it can capture both the underlying structure of the data and task-specific information while still remaining intuitive, interpretable and verifiable. This novel methodology aims to identify linear laws that can effectively capture a shared characteristic among samples belonging to a specific class. By subsequently utilizing these laws to generate a classifier-agnostic representation in a forward manner, they become applicable in a generalized setting. We demonstrate the effectiveness of our approach o
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#21452;&#26679;&#26412;&#26816;&#39564;&#20013;&#21464;&#37327;&#36873;&#25321;&#38382;&#39064;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#26680;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#32479;&#35745;&#37327;&#65292;&#20197;&#26368;&#22823;&#21270;&#26041;&#24046;&#27491;&#21017;&#21270;&#30340;MMD&#32479;&#35745;&#37327;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#26126;&#20854;&#36229;&#32676;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2302.07415</link><description>&lt;p&gt;
&#21464;&#37327;&#36873;&#25321;&#22312;&#26680;&#21452;&#26679;&#26412;&#26816;&#39564;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Variable Selection for Kernel Two-Sample Tests. (arXiv:2302.07415v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.07415
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#21452;&#26679;&#26412;&#26816;&#39564;&#20013;&#21464;&#37327;&#36873;&#25321;&#38382;&#39064;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#26680;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#32479;&#35745;&#37327;&#65292;&#20197;&#26368;&#22823;&#21270;&#26041;&#24046;&#27491;&#21017;&#21270;&#30340;MMD&#32479;&#35745;&#37327;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#26126;&#20854;&#36229;&#32676;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#20004;&#26679;&#26412;&#26816;&#39564;&#20013;&#30340;&#21464;&#37327;&#36873;&#25321;&#38382;&#39064;&#65292;&#26088;&#22312;&#36873;&#25321;&#21306;&#20998;&#20004;&#32452;&#26679;&#26412;&#30340;&#26368;&#26377;&#20449;&#24687;&#21464;&#37327;&#12290;&#20026;&#20102;&#35299;&#20915;&#35813;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26680;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#65288;MMD&#65289;&#30340;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23547;&#27714;&#19968;&#32452;&#21464;&#37327;&#65292;&#20854;&#39044;&#20808;&#30830;&#23450;&#30340;&#22823;&#23567;&#26368;&#22823;&#21270;&#26041;&#24046;&#27491;&#21017;&#21270;&#30340;MMD&#32479;&#35745;&#37327;&#12290;&#36825;&#31181;&#35745;&#31639;&#24418;&#24335;&#20063;&#23545;&#24212;&#20110;&#22312;&#25991;&#29486;&#20013;&#30740;&#31350;&#30340;&#25511;&#21046;&#31867;&#22411;I&#38169;&#35823;&#30340;&#21516;&#26102;&#26368;&#23567;&#21270;&#24322;&#36136;&#31867;&#22411;II&#38169;&#35823;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#28151;&#21512;&#25972;&#25968;&#32534;&#31243;&#20844;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#32447;&#24615;&#21644;&#20108;&#27425;&#31867;&#22411;&#20869;&#26680;&#20989;&#25968;&#30340;&#31934;&#30830;&#21644;&#36817;&#20284;&#31639;&#27861;&#65292;&#24182;&#20855;&#26377;&#24615;&#33021;&#20445;&#35777;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26694;&#26550;&#30340;&#21331;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the variable selection problem for two-sample tests, aiming to select the most informative variables to distinguish samples from two groups. To solve this problem, we propose a framework based on the kernel maximum mean discrepancy (MMD). Our approach seeks a group of variables with a pre-specified size that maximizes the variance-regularized MMD statistics. This formulation also corresponds to the minimization of asymptotic type-II error while controlling type-I error, as studied in the literature. We present mixed-integer programming formulations and offer exact and approximation algorithms with performance guarantees for linear and quadratic types of kernel functions. Experimental results demonstrate the superior performance of our framework.
&lt;/p&gt;</description></item></channel></rss>