<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#32676;&#38543;&#26426;&#35797;&#39564;&#35774;&#35745;&#26041;&#27861;&#65292;&#32771;&#34385;&#20102;&#20132;&#21449;&#38598;&#32676;&#24178;&#25200;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#25490;&#38500;&#21487;&#33021;&#21463;&#21040;&#24178;&#25200;&#24433;&#21709;&#30340;&#21333;&#20803;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#22823;&#22823;&#20943;&#23569;&#20559;&#24046;&#12290;&#36825;&#39033;&#30740;&#31350;&#36824;&#25552;&#20379;&#20102;&#20248;&#21270;&#20272;&#35745;&#22120;&#25910;&#25947;&#36895;&#29575;&#30340;&#38598;&#32676;&#35774;&#35745;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.18836</link><description>&lt;p&gt;
&#35774;&#35745;&#20855;&#26377;&#20132;&#21449;&#38598;&#32676;&#24178;&#25200;&#30340;&#38598;&#32676;&#38543;&#26426;&#35797;&#39564;
&lt;/p&gt;
&lt;p&gt;
Design of Cluster-Randomized Trials with Cross-Cluster Interference. (arXiv:2310.18836v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18836
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38598;&#32676;&#38543;&#26426;&#35797;&#39564;&#35774;&#35745;&#26041;&#27861;&#65292;&#32771;&#34385;&#20102;&#20132;&#21449;&#38598;&#32676;&#24178;&#25200;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#25490;&#38500;&#21487;&#33021;&#21463;&#21040;&#24178;&#25200;&#24433;&#21709;&#30340;&#21333;&#20803;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#22823;&#22823;&#20943;&#23569;&#20559;&#24046;&#12290;&#36825;&#39033;&#30740;&#31350;&#36824;&#25552;&#20379;&#20102;&#20248;&#21270;&#20272;&#35745;&#22120;&#25910;&#25947;&#36895;&#29575;&#30340;&#38598;&#32676;&#35774;&#35745;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38598;&#32676;&#38543;&#26426;&#35797;&#39564;&#32463;&#24120;&#28041;&#21450;&#31354;&#38388;&#19978;&#20998;&#24067;&#19981;&#35268;&#24459;&#19988;&#27809;&#26377;&#26126;&#26174;&#20998;&#31163;&#31038;&#21306;&#30340;&#21333;&#20803;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#30001;&#20110;&#28508;&#22312;&#30340;&#20132;&#21449;&#38598;&#32676;&#24178;&#25200;&#65292;&#38598;&#32676;&#26500;&#24314;&#26159;&#35774;&#35745;&#30340;&#19968;&#20010;&#20851;&#38190;&#26041;&#38754;&#12290;&#29616;&#26377;&#30340;&#25991;&#29486;&#20381;&#36182;&#20110;&#37096;&#20998;&#24178;&#25200;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#23558;&#38598;&#32676;&#35270;&#20026;&#32473;&#23450;&#65292;&#24182;&#20551;&#35774;&#27809;&#26377;&#20132;&#21449;&#38598;&#32676;&#24178;&#25200;&#12290;&#25105;&#20204;&#36890;&#36807;&#20801;&#35768;&#24178;&#25200;&#19982;&#21333;&#20803;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#34928;&#20943;&#26469;&#25918;&#23485;&#36825;&#20010;&#20551;&#35774;&#12290;&#36825;&#23548;&#33268;&#20102;&#19968;&#20010;&#20559;&#24046;-&#26041;&#24046;&#30340;&#26435;&#34913;&#65306;&#26500;&#24314;&#36739;&#23569;&#12289;&#36739;&#22823;&#30340;&#38598;&#32676;&#21487;&#20197;&#20943;&#23569;&#24178;&#25200;&#24341;&#36215;&#30340;&#20559;&#24046;&#65292;&#20294;&#20250;&#22686;&#21152;&#26041;&#24046;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#65292;&#25490;&#38500;&#21487;&#33021;&#21463;&#21040;&#20132;&#21449;&#38598;&#32676;&#24178;&#25200;&#24433;&#21709;&#30340;&#21333;&#20803;&#65292;&#24182;&#26174;&#31034;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#22343;&#20540;&#24046;&#20272;&#35745;&#22120;&#65292;&#36825;&#22823;&#22823;&#38477;&#20302;&#20102;&#28176;&#36817;&#20559;&#24046;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20248;&#21270;&#20272;&#35745;&#22120;&#25910;&#25947;&#36895;&#29575;&#30340;&#38598;&#32676;&#35774;&#35745;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35774;&#35745;&#30340;&#27491;&#24335;&#35777;&#26126;&#65292;&#35813;&#35774;&#35745;&#36873;&#25321;&#20102;&#38598;&#32676;&#30340;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cluster-randomized trials often involve units that are irregularly distributed in space without well-separated communities. In these settings, cluster construction is a critical aspect of the design due to the potential for cross-cluster interference. The existing literature relies on partial interference models, which take clusters as given and assume no cross-cluster interference. We relax this assumption by allowing interference to decay with geographic distance between units. This induces a bias-variance trade-off: constructing fewer, larger clusters reduces bias due to interference but increases variance. We propose new estimators that exclude units most potentially impacted by cross-cluster interference and show that this substantially reduces asymptotic bias relative to conventional difference-in-means estimators. We then study the design of clusters to optimize the estimators' rates of convergence. We provide formal justification for a new design that chooses the number of clus
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#36125;&#21494;&#26031;EM&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#20108;&#20803;&#21644;&#26377;&#24207;&#39033;&#30446;&#21709;&#24212;&#20013;&#20272;&#35745;&#31232;&#30095;&#22240;&#23376;&#36733;&#33655;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#35299;&#20915;&#20102;&#26410;&#30693;&#28508;&#22312;&#22240;&#23376;&#32500;&#24230;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2310.17820</link><description>&lt;p&gt;
&#31232;&#30095;&#36125;&#21494;&#26031;&#22810;&#32500;&#39033;&#30446;&#21453;&#24212;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Sparse Bayesian Multidimensional Item Response Theory. (arXiv:2310.17820v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17820
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#36125;&#21494;&#26031;EM&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#20108;&#20803;&#21644;&#26377;&#24207;&#39033;&#30446;&#21709;&#24212;&#20013;&#20272;&#35745;&#31232;&#30095;&#22240;&#23376;&#36733;&#33655;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#35299;&#20915;&#20102;&#26410;&#30693;&#28508;&#22312;&#22240;&#23376;&#32500;&#24230;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#21464;&#37327;&#39033;&#30446;&#21453;&#24212;&#29702;&#35770;&#65288;MIRT&#65289;&#34987;&#24212;&#29992;&#30740;&#31350;&#20154;&#21592;&#24191;&#27867;&#20351;&#29992;&#65292;&#20197;&#23547;&#25214;&#38382;&#21367;&#25968;&#25454;&#20013;&#21709;&#24212;&#27169;&#24335;&#32972;&#21518;&#30340;&#21487;&#35299;&#37322;&#65288;&#31232;&#30095;&#65289;&#35299;&#37322;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#23545;&#20110;&#36825;&#31181;&#31232;&#30095;&#24615;&#21457;&#29616;&#24037;&#20855;&#30340;&#38656;&#27714;&#23578;&#26410;&#24471;&#21040;&#28385;&#36275;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20108;&#20803;&#21644;&#26377;&#24207;&#39033;&#30446;MIRT&#30340;&#36125;&#21494;&#26031;&#24179;&#21488;&#65292;&#20854;&#38656;&#35201;&#26368;&#23569;&#30340;&#35843;&#25972;&#65292;&#24182;&#19988;&#30001;&#20110;&#20854;&#21487;&#24182;&#34892;&#21270;&#30340;&#29305;&#24615;&#65292;&#22312;&#30456;&#23545;&#36739;&#22823;&#30340;&#25968;&#25454;&#38598;&#19978;&#20855;&#26377;&#33391;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#12290;MIRT&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#26041;&#27861;&#20256;&#32479;&#19978;&#20381;&#36182;&#20110;MCMC&#27169;&#25311;&#65292;&#22312;&#23454;&#36341;&#20013;&#21487;&#33021;&#26082;&#36153;&#26102;&#21448;&#38590;&#20197;&#36890;&#36807;&#39069;&#22806;&#30340;&#38408;&#20540;&#35774;&#23450;&#23454;&#29616;&#31934;&#30830;&#30340;&#31232;&#30095;&#24674;&#22797;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21487;&#25193;&#23637;&#30340;&#36125;&#21494;&#26031;EM&#31639;&#27861;&#65292;&#29992;&#20110;&#20174;&#20108;&#20803;&#21644;&#26377;&#24207;&#39033;&#30446;&#21709;&#24212;&#20013;&#20272;&#35745;&#31232;&#30095;&#22240;&#23376;&#36733;&#33655;&#12290;&#25105;&#20204;&#21033;&#29992;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#35299;&#20915;&#20102;&#26410;&#30693;&#28508;&#22312;&#22240;&#23376;&#32500;&#24230;&#30340;&#30475;&#20284;&#19981;&#21487;&#36926;&#36234;&#30340;&#38382;&#39064;&#65292;&#20174;&#32780;&#20351;&#24471;&#21487;&#20197;&#20272;&#35745;&#22240;&#23376;&#30340;&#25968;&#37327;&#12290;&#36890;&#36807;&#26059;&#36716;&#21487;&#20197;&#23454;&#29616;&#31232;&#30095;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multivariate Item Response Theory (MIRT) is sought-after widely by applied researchers looking for interpretable (sparse) explanations underlying response patterns in questionnaire data. There is, however, an unmet demand for such sparsity discovery tools in practice. Our paper develops a Bayesian platform for binary and ordinal item MIRT which requires minimal tuning and scales well on relatively large datasets due to its parallelizable features. Bayesian methodology for MIRT models has traditionally relied on MCMC simulation, which cannot only be slow in practice, but also often renders exact sparsity recovery impossible without additional thresholding. In this work, we develop a scalable Bayesian EM algorithm to estimate sparse factor loadings from binary and ordinal item responses. We address the seemingly insurmountable problem of unknown latent factor dimensionality with tools from Bayesian nonparametrics which enable estimating the number of factors. Rotations to sparsity throug
&lt;/p&gt;</description></item></channel></rss>