<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22312;&#21512;&#36866;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#31243;&#24207;&#19979;&#65292;&#36870;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#22120;&#65288;IPW&#65289;&#12289;&#22686;&#24378;&#36870;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#22120;&#65288;AIPW&#65289;&#21644;&#36870;&#27010;&#29575;&#21152;&#26435;&#22238;&#24402;&#35843;&#25972;&#20272;&#35745;&#22120;&#65288;IPWRA&#65289;&#22312;&#35780;&#20272;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#25110;&#34987;&#22788;&#29702;&#23545;&#35937;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#19978;&#22312;&#25968;&#20540;&#19978;&#26159;&#30456;&#21516;&#30340;&#65292;&#19988;&#36866;&#24403;&#36873;&#25321;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#26435;&#37325;&#33258;&#21160;&#24402;&#19968;&#21270;&#12290;</title><link>http://arxiv.org/abs/2310.18563</link><description>&lt;p&gt;
&#21327;&#21464;&#37327;&#24179;&#34913;&#21644;&#21152;&#26435;&#19982;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#22312;&#35780;&#20272;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#19978;&#30340;&#31561;&#25928;&#24615;
&lt;/p&gt;
&lt;p&gt;
Covariate Balancing and the Equivalence of Weighting and Doubly Robust Estimators of Average Treatment Effects. (arXiv:2310.18563v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18563
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#22312;&#21512;&#36866;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#31243;&#24207;&#19979;&#65292;&#36870;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#22120;&#65288;IPW&#65289;&#12289;&#22686;&#24378;&#36870;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#22120;&#65288;AIPW&#65289;&#21644;&#36870;&#27010;&#29575;&#21152;&#26435;&#22238;&#24402;&#35843;&#25972;&#20272;&#35745;&#22120;&#65288;IPWRA&#65289;&#22312;&#35780;&#20272;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#25110;&#34987;&#22788;&#29702;&#23545;&#35937;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#19978;&#22312;&#25968;&#20540;&#19978;&#26159;&#30456;&#21516;&#30340;&#65292;&#19988;&#36866;&#24403;&#36873;&#25321;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#26435;&#37325;&#33258;&#21160;&#24402;&#19968;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#24403;&#20542;&#21521;&#24471;&#20998;&#20351;&#29992;&#21512;&#36866;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#31243;&#24207;&#36827;&#34892;&#20272;&#35745;&#26102;&#65292;&#24120;&#29992;&#30340;&#36870;&#27010;&#29575;&#21152;&#26435;&#65288;IPW&#65289;&#20272;&#35745;&#22120;&#65292;&#24102;&#26377;&#32447;&#24615;&#26465;&#20214;&#22343;&#20540;&#30340;&#22686;&#24378;&#36870;&#27010;&#29575;&#21152;&#26435;&#65288;AIPW&#65289;&#20272;&#35745;&#22120;&#20197;&#21450;&#24102;&#26377;&#32447;&#24615;&#26465;&#20214;&#22343;&#20540;&#30340;&#36870;&#27010;&#29575;&#21152;&#26435;&#22238;&#24402;&#35843;&#25972;&#65288;IPWRA&#65289;&#20272;&#35745;&#22120;&#22312;&#35780;&#20272;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#25110;&#34987;&#22788;&#29702;&#23545;&#35937;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#26102;&#25968;&#20540;&#19978;&#26159;&#30456;&#21516;&#30340;&#12290;&#27492;&#22806;&#65292;&#32463;&#36807;&#36866;&#24403;&#36873;&#25321;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#26435;&#37325;&#33258;&#21160;&#36827;&#34892;&#20102;&#24402;&#19968;&#21270;&#22788;&#29702;&#65292;&#36825;&#24847;&#21619;&#30528;&#24402;&#19968;&#21270;&#21644;&#38750;&#24402;&#19968;&#21270;&#29256;&#26412;&#30340;IPW&#21644;AIPW&#26159;&#30456;&#21516;&#30340;&#12290;&#23545;&#20110;&#20272;&#35745;ATE&#65292;&#23454;&#29616;IPW&#65292;AIPW&#21644;IPWRA&#20195;&#25968;&#31561;&#20215;&#30340;&#26435;&#37325;&#26159;&#22522;&#20110;&#20351;&#29992;Graham&#65292;Pinto&#21644;Egel&#65288;2012&#65289;&#25552;&#20986;&#30340;&#36870;&#27010;&#29575;&#20542;&#26012;&#65288;IPT&#65289;&#26041;&#27861;&#20272;&#35745;&#24471;&#21040;&#30340;&#20542;&#21521;&#24471;&#20998;&#35745;&#31639;&#30340;&#12290;&#23545;&#20110;ATT&#65292;&#26435;&#37325;&#26159;&#20351;&#29992;Imai&#21644;Ratkovic&#65288;2014&#65289;&#21457;&#23637;&#30340;&#21327;&#21464;&#37327;&#24179;&#34913;&#20542;&#21521;&#24471;&#20998;&#65288;CBPS&#65289;&#26041;&#27861;&#33719;&#24471;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that when the propensity score is estimated using a suitable covariate balancing procedure, the commonly used inverse probability weighting (IPW) estimator, augmented inverse probability weighting (AIPW) with linear conditional mean, and inverse probability weighted regression adjustment (IPWRA) with linear conditional mean are all numerically the same for estimating the average treatment effect (ATE) or the average treatment effect on the treated (ATT). Further, suitably chosen covariate balancing weights are automatically normalized, which means that normalized and unnormalized versions of IPW and AIPW are identical. For estimating the ATE, the weights that achieve the algebraic equivalence of IPW, AIPW, and IPWRA are based on propensity scores estimated using the inverse probability tilting (IPT) method of Graham, Pinto and Egel (2012). For the ATT, the weights are obtained using the covariate balancing propensity score (CBPS) method developed in Imai and Ratkovic (2014). Th
&lt;/p&gt;</description></item></channel></rss>