<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20943;&#23569;&#23618;&#27425;&#20998;&#31867;&#21464;&#37327;&#32500;&#24230;&#21644;&#31890;&#24230;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23454;&#20307;&#23884;&#20837;&#21644;&#33258;&#19978;&#32780;&#19979;&#32858;&#31867;&#31639;&#27861;&#26469;&#38477;&#20302;&#23618;&#20869;&#32500;&#24230;&#21644;&#25972;&#20307;&#31890;&#24230;&#12290;</title><link>https://arxiv.org/abs/2403.03613</link><description>&lt;p&gt;
&#20943;&#23569;&#23618;&#27425;&#20998;&#31867;&#21464;&#37327;&#30340;&#32500;&#24230;&#21644;&#31890;&#24230;
&lt;/p&gt;
&lt;p&gt;
Reducing the dimensionality and granularity in hierarchical categorical variables
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03613
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20943;&#23569;&#23618;&#27425;&#20998;&#31867;&#21464;&#37327;&#32500;&#24230;&#21644;&#31890;&#24230;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23454;&#20307;&#23884;&#20837;&#21644;&#33258;&#19978;&#32780;&#19979;&#32858;&#31867;&#31639;&#27861;&#26469;&#38477;&#20302;&#23618;&#20869;&#32500;&#24230;&#21644;&#25972;&#20307;&#31890;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23618;&#27425;&#20998;&#31867;&#21464;&#37327;&#24448;&#24448;&#20855;&#26377;&#35768;&#22810;&#32423;&#21035;&#65288;&#39640;&#31890;&#24230;&#65289;&#21644;&#27599;&#20010;&#32423;&#21035;&#20869;&#35768;&#22810;&#31867;&#21035;&#65288;&#39640;&#32500;&#24230;&#65289;&#12290;&#23558;&#36825;&#20123;&#21327;&#21464;&#37327;&#21253;&#21547;&#22312;&#39044;&#27979;&#27169;&#22411;&#20013;&#21487;&#33021;&#23548;&#33268;&#36807;&#24230;&#25311;&#21512;&#21644;&#20272;&#35745;&#38382;&#39064;&#12290;&#22312;&#24403;&#21069;&#25991;&#29486;&#20013;&#65292;&#23618;&#27425;&#21327;&#21464;&#37327;&#36890;&#24120;&#36890;&#36807;&#23884;&#22871;&#38543;&#26426;&#25928;&#24212;&#26469;&#32435;&#20837;&#12290;&#28982;&#32780;&#65292;&#36825;&#24182;&#19981;&#26377;&#21161;&#20110;&#20551;&#35774;&#31867;&#21035;&#23545;&#21709;&#24212;&#21464;&#37327;&#20855;&#26377;&#30456;&#21516;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33719;&#24471;&#23618;&#27425;&#20998;&#31867;&#21464;&#37327;&#31616;&#21270;&#34920;&#31034;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#23618;&#27425;&#35774;&#32622;&#20013;&#24212;&#29992;&#23454;&#20307;&#23884;&#20837;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#19978;&#32780;&#19979;&#30340;&#32858;&#31867;&#31639;&#27861;&#65292;&#21033;&#29992;&#23884;&#20837;&#20013;&#32534;&#30721;&#30340;&#20449;&#24687;&#26469;&#20943;&#23569;&#23618;&#20869;&#32500;&#24230;&#20197;&#21450;&#23618;&#27425;&#20998;&#31867;&#21464;&#37327;&#30340;&#25972;&#20307;&#31890;&#24230;&#12290;&#22312;&#27169;&#25311;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#26377;&#25928;&#22320;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03613v1 Announce Type: cross  Abstract: Hierarchical categorical variables often exhibit many levels (high granularity) and many classes within each level (high dimensionality). This may cause overfitting and estimation issues when including such covariates in a predictive model. In current literature, a hierarchical covariate is often incorporated via nested random effects. However, this does not facilitate the assumption of classes having the same effect on the response variable. In this paper, we propose a methodology to obtain a reduced representation of a hierarchical categorical variable. We show how entity embedding can be applied in a hierarchical setting. Subsequently, we propose a top-down clustering algorithm which leverages the information encoded in the embeddings to reduce both the within-level dimensionality as well as the overall granularity of the hierarchical categorical variable. In simulation experiments, we show that our methodology can effectively appro
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#21452;&#38750;&#22343;&#21248;&#29615;&#22659;&#19979;&#30740;&#31350;&#20102;&#31163;&#32447;&#31574;&#30053;&#35780;&#20272;(OPE)&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#29992;&#20110;&#22870;&#21169;&#21644;&#35266;&#27979;&#36716;&#31227;&#20989;&#25968;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;OPE&#26694;&#26550;&#12290;&#35813;&#30740;&#31350;&#23545;&#26631;&#20934;RL&#20551;&#35774;&#19981;&#28385;&#36275;&#30340;&#29615;&#22659;&#20013;&#30340;OPE&#20570;&#20986;&#20102;&#29702;&#35770;&#36129;&#29486;&#65292;&#24182;&#25552;&#20379;&#20102;&#20960;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2306.08719</link><description>&lt;p&gt;
&#21452;&#38750;&#22343;&#21248;&#29615;&#22659;&#19979;&#30340;&#31163;&#32447;&#31574;&#30053;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Off-policy Evaluation in Doubly Inhomogeneous Environments. (arXiv:2306.08719v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08719
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#21452;&#38750;&#22343;&#21248;&#29615;&#22659;&#19979;&#30740;&#31350;&#20102;&#31163;&#32447;&#31574;&#30053;&#35780;&#20272;(OPE)&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#29992;&#20110;&#22870;&#21169;&#21644;&#35266;&#27979;&#36716;&#31227;&#20989;&#25968;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;OPE&#26694;&#26550;&#12290;&#35813;&#30740;&#31350;&#23545;&#26631;&#20934;RL&#20551;&#35774;&#19981;&#28385;&#36275;&#30340;&#29615;&#22659;&#20013;&#30340;OPE&#20570;&#20986;&#20102;&#29702;&#35770;&#36129;&#29486;&#65292;&#24182;&#25552;&#20379;&#20102;&#20960;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#31163;&#32447;&#31574;&#30053;&#35780;&#20272;&#65288;OPE&#65289;&#22312;&#20004;&#20010;&#20851;&#38190;&#30340;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#20551;&#35774;&#8212;&#8212;&#26102;&#38388;&#31283;&#23450;&#24615;&#21644;&#20010;&#20307;&#22343;&#21248;&#24615;&#22343;&#34987;&#30772;&#22351;&#30340;&#24773;&#20917;&#19979;&#30340;&#24212;&#29992;&#12290;&#20026;&#20102;&#22788;&#29702;&#8220;&#21452;&#38750;&#22343;&#21248;&#24615;&#8221;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31867;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#29992;&#20110;&#22870;&#21169;&#21644;&#35266;&#27979;&#36716;&#31227;&#20989;&#25968;&#65292;&#24182;&#22312;&#27492;&#22522;&#30784;&#19978;&#24320;&#21457;&#20102;&#19968;&#20010;&#21253;&#21547;&#27169;&#22411;&#39537;&#21160;&#21644;&#27169;&#22411;&#33258;&#30001;&#26041;&#27861;&#30340;&#36890;&#29992;OPE&#26694;&#26550;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#36825;&#26159;&#31532;&#19968;&#31687;&#22312;&#31163;&#32447;RL&#20013;&#24320;&#21457;&#32479;&#35745;&#19978;&#21487;&#38752;&#30340;OPE&#26041;&#27861;&#30340;&#35770;&#25991;&#65292;&#24182;&#19988;&#28041;&#21450;&#20102;&#26631;&#20934;RL&#20551;&#35774;&#19981;&#28385;&#36275;&#30340;&#29615;&#22659;&#12290;&#35813;&#30740;&#31350;&#28145;&#20837;&#29702;&#35299;&#20102;&#26631;&#20934;RL&#20551;&#35774;&#19981;&#28385;&#36275;&#30340;&#29615;&#22659;&#20013;&#30340;OPE&#65292;&#24182;&#22312;&#36825;&#20123;&#35774;&#32622;&#20013;&#25552;&#20379;&#20102;&#20960;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#25152;&#25552;&#20986;&#30340;&#20215;&#20540;&#20272;&#35745;&#22120;&#30340;&#29702;&#35770;&#24615;&#36136;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#20248;&#20110;&#24573;&#35270;&#26102;&#38388;&#38750;&#31283;&#23450;&#24615;&#25110;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#31454;&#20105;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#19968;&#20010;&#25968;&#25454;&#38598;&#19978;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work aims to study off-policy evaluation (OPE) under scenarios where two key reinforcement learning (RL) assumptions -- temporal stationarity and individual homogeneity are both violated. To handle the ``double inhomogeneities", we propose a class of latent factor models for the reward and observation transition functions, under which we develop a general OPE framework that consists of both model-based and model-free approaches. To our knowledge, this is the first paper that develops statistically sound OPE methods in offline RL with double inhomogeneities. It contributes to a deeper understanding of OPE in environments, where standard RL assumptions are not met, and provides several practical approaches in these settings. We establish the theoretical properties of the proposed value estimators and empirically show that our approach outperforms competing methods that ignore either temporal nonstationarity or individual heterogeneity. Finally, we illustrate our method on a data set
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31639;&#27861;&#65292;&#21487;&#20197;&#22312;&#21464;&#37327;&#25968;&#37327;&#36828;&#22823;&#20110;&#26679;&#26412;&#22823;&#23567;&#30340;&#24773;&#20917;&#19979;&#65292;&#20934;&#30830;&#22320;&#20272;&#35745;&#22823;&#35268;&#27169;&#22240;&#26524;&#22810;&#26641;&#32467;&#26500;&#65292;&#32780;&#20960;&#20046;&#19981;&#38656;&#35201;&#20219;&#20309;&#20998;&#24067;&#25110;&#24314;&#27169;&#30340;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2209.07028</link><description>&lt;p&gt;
&#20174;&#23567;&#26679;&#26412;&#20013;&#20272;&#35745;&#22823;&#30340;&#22240;&#26524;&#22810;&#26641;
&lt;/p&gt;
&lt;p&gt;
Estimating large causal polytrees from small samples. (arXiv:2209.07028v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.07028
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31639;&#27861;&#65292;&#21487;&#20197;&#22312;&#21464;&#37327;&#25968;&#37327;&#36828;&#22823;&#20110;&#26679;&#26412;&#22823;&#23567;&#30340;&#24773;&#20917;&#19979;&#65292;&#20934;&#30830;&#22320;&#20272;&#35745;&#22823;&#35268;&#27169;&#22240;&#26524;&#22810;&#26641;&#32467;&#26500;&#65292;&#32780;&#20960;&#20046;&#19981;&#38656;&#35201;&#20219;&#20309;&#20998;&#24067;&#25110;&#24314;&#27169;&#30340;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20174;&#30456;&#23545;&#36739;&#23567;&#30340;&#29420;&#31435;&#21516;&#20998;&#24067;&#26679;&#26412;&#20013;&#20272;&#35745;&#22823;&#30340;&#22240;&#26524;&#22810;&#26641;&#30340;&#38382;&#39064;&#12290;&#36825;&#26159;&#22312;&#21464;&#37327;&#25968;&#37327;&#19982;&#26679;&#26412;&#22823;&#23567;&#30456;&#27604;&#38750;&#24120;&#22823;&#30340;&#24773;&#20917;&#19979;&#30830;&#23450;&#22240;&#26524;&#32467;&#26500;&#30340;&#38382;&#39064;&#65292;&#20363;&#22914;&#22522;&#22240;&#35843;&#25511;&#32593;&#32476;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31639;&#27861;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#20197;&#39640;&#20934;&#30830;&#24230;&#24674;&#22797;&#26641;&#24418;&#32467;&#26500;&#12290;&#35813;&#31639;&#27861;&#38500;&#20102;&#19968;&#20123;&#28201;&#21644;&#30340;&#38750;&#36864;&#21270;&#26465;&#20214;&#22806;&#65292;&#22522;&#26412;&#19981;&#38656;&#35201;&#20998;&#24067;&#25110;&#24314;&#27169;&#30340;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of estimating a large causal polytree from a relatively small i.i.d. sample. This is motivated by the problem of determining causal structure when the number of variables is very large compared to the sample size, such as in gene regulatory networks. We give an algorithm that recovers the tree with high accuracy in such settings. The algorithm works under essentially no distributional or modeling assumptions other than some mild non-degeneracy conditions.
&lt;/p&gt;</description></item></channel></rss>