<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#29109;&#27491;&#21017;&#21270;&#20316;&#20026;&#19968;&#31181;&#24179;&#28369;&#26041;&#27861;&#22312;Wasserstein&#20272;&#35745;&#22120;&#20013;&#30340;&#28508;&#22312;&#30410;&#22788;&#65292;&#36890;&#36807;&#26367;&#25442;&#26368;&#20248;&#36755;&#36816;&#25104;&#26412;&#30340;&#27491;&#21017;&#21270;&#29256;&#26412;&#26469;&#23454;&#29616;&#12290;&#20027;&#35201;&#21457;&#29616;&#26159;&#29109;&#27491;&#21017;&#21270;&#21487;&#20197;&#20197;&#36739;&#20302;&#30340;&#35745;&#31639;&#25104;&#26412;&#36798;&#21040;&#19982;&#26410;&#27491;&#21017;&#21270;&#30340;Wasserstein&#20272;&#35745;&#22120;&#30456;&#24403;&#30340;&#32479;&#35745;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2210.06934</link><description>&lt;p&gt;
&#20851;&#20110;&#20351;&#29992;&#29109;&#27491;&#21017;&#21270;&#24179;&#28369;Wasserstein&#20272;&#35745;&#22120;&#30340;&#28508;&#22312;&#30410;&#22788;
&lt;/p&gt;
&lt;p&gt;
On the potential benefits of entropic regularization for smoothing Wasserstein estimators. (arXiv:2210.06934v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.06934
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#29109;&#27491;&#21017;&#21270;&#20316;&#20026;&#19968;&#31181;&#24179;&#28369;&#26041;&#27861;&#22312;Wasserstein&#20272;&#35745;&#22120;&#20013;&#30340;&#28508;&#22312;&#30410;&#22788;&#65292;&#36890;&#36807;&#26367;&#25442;&#26368;&#20248;&#36755;&#36816;&#25104;&#26412;&#30340;&#27491;&#21017;&#21270;&#29256;&#26412;&#26469;&#23454;&#29616;&#12290;&#20027;&#35201;&#21457;&#29616;&#26159;&#29109;&#27491;&#21017;&#21270;&#21487;&#20197;&#20197;&#36739;&#20302;&#30340;&#35745;&#31639;&#25104;&#26412;&#36798;&#21040;&#19982;&#26410;&#27491;&#21017;&#21270;&#30340;Wasserstein&#20272;&#35745;&#22120;&#30456;&#24403;&#30340;&#32479;&#35745;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#19987;&#27880;&#20110;&#30740;&#31350;&#29109;&#27491;&#21017;&#21270;&#22312;&#26368;&#20248;&#36755;&#36816;&#20013;&#20316;&#20026;Wasserstein&#20272;&#35745;&#22120;&#30340;&#24179;&#28369;&#26041;&#27861;&#65292;&#36890;&#36807;&#32479;&#35745;&#23398;&#20013;&#36924;&#36817;&#35823;&#24046;&#21644;&#20272;&#35745;&#35823;&#24046;&#30340;&#32463;&#20856;&#26435;&#34913;&#12290;Wasserstein&#20272;&#35745;&#22120;&#34987;&#23450;&#20041;&#20026;&#35299;&#20915;&#21464;&#20998;&#38382;&#39064;&#30340;&#35299;&#65292;&#20854;&#30446;&#26631;&#20989;&#25968;&#28041;&#21450;&#27010;&#29575;&#27979;&#24230;&#20043;&#38388;&#30340;&#26368;&#20248;&#36755;&#36816;&#25104;&#26412;&#30340;&#20351;&#29992;&#12290;&#36825;&#26679;&#30340;&#20272;&#35745;&#22120;&#21487;&#20197;&#36890;&#36807;&#29992;&#29109;&#24809;&#32602;&#26367;&#25442;&#26368;&#20248;&#36755;&#36816;&#25104;&#26412;&#30340;&#27491;&#21017;&#21270;&#29256;&#26412;&#26469;&#36827;&#34892;&#27491;&#21017;&#21270;&#65292;&#20174;&#32780;&#23545;&#32467;&#26524;&#20272;&#35745;&#22120;&#20135;&#29983;&#28508;&#22312;&#30340;&#24179;&#28369;&#25928;&#26524;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#29109;&#27491;&#21017;&#21270;&#23545;&#27491;&#21017;&#21270;Wasserstein&#20272;&#35745;&#22120;&#30340;&#36924;&#36817;&#21644;&#20272;&#35745;&#24615;&#36136;&#21487;&#33021;&#24102;&#26469;&#30340;&#30410;&#22788;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#36129;&#29486;&#26159;&#35752;&#35770;&#29109;&#27491;&#21017;&#21270;&#22914;&#20309;&#20197;&#26356;&#20302;&#30340;&#35745;&#31639;&#25104;&#26412;&#36798;&#21040;&#19982;&#26410;&#27491;&#21017;&#21270;&#30340;Wasserstein&#20272;&#35745;&#22120;&#30456;&#24403;&#30340;&#32479;&#35745;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is focused on the study of entropic regularization in optimal transport as a smoothing method for Wasserstein estimators, through the prism of the classical tradeoff between approximation and estimation errors in statistics. Wasserstein estimators are defined as solutions of variational problems whose objective function involves the use of an optimal transport cost between probability measures. Such estimators can be regularized by replacing the optimal transport cost by its regularized version using an entropy penalty on the transport plan. The use of such a regularization has a potentially significant smoothing effect on the resulting estimators. In this work, we investigate its potential benefits on the approximation and estimation properties of regularized Wasserstein estimators. Our main contribution is to discuss how entropic regularization may reach, at a lower computational cost, statistical performances that are comparable to those of un-regularized Wasserstein esti
&lt;/p&gt;</description></item></channel></rss>