<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;CANVI&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26500;&#24314;&#19968;&#33268;&#21270;&#39044;&#27979;&#22120;&#24182;&#20351;&#29992;&#39044;&#27979;&#25928;&#29575;&#36827;&#34892;&#27604;&#36739;&#65292;&#26469;&#25552;&#20379;&#20855;&#26377;&#20445;&#35777;&#30340;&#21518;&#39564;&#36817;&#20284;&#32467;&#26524;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#24555;&#36895;&#35745;&#31639;&#65292;&#26131;&#20110;&#23454;&#29616;&#65292;&#24182;&#19988;&#23545;&#20110;&#20505;&#36873;&#36817;&#20284;&#22120;&#30340;&#35774;&#35745;&#20915;&#31574;&#26080;&#38656;&#20851;&#27880;&#12290;&#27492;&#22806;&#65292;CANVI&#33021;&#22815;&#22312;&#26080;&#20284;&#28982;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#12290;</title><link>http://arxiv.org/abs/2305.14275</link><description>&lt;p&gt;
&#20855;&#26377;&#35206;&#30422;&#20445;&#35777;&#30340;&#20998;&#25674;&#21464;&#20998;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Amortized Variational Inference with Coverage Guarantees. (arXiv:2305.14275v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14275
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;CANVI&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26500;&#24314;&#19968;&#33268;&#21270;&#39044;&#27979;&#22120;&#24182;&#20351;&#29992;&#39044;&#27979;&#25928;&#29575;&#36827;&#34892;&#27604;&#36739;&#65292;&#26469;&#25552;&#20379;&#20855;&#26377;&#20445;&#35777;&#30340;&#21518;&#39564;&#36817;&#20284;&#32467;&#26524;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#24555;&#36895;&#35745;&#31639;&#65292;&#26131;&#20110;&#23454;&#29616;&#65292;&#24182;&#19988;&#23545;&#20110;&#20505;&#36873;&#36817;&#20284;&#22120;&#30340;&#35774;&#35745;&#20915;&#31574;&#26080;&#38656;&#20851;&#27880;&#12290;&#27492;&#22806;&#65292;CANVI&#33021;&#22815;&#22312;&#26080;&#20284;&#28982;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25674;&#21464;&#20998;&#25512;&#26029;&#20135;&#29983;&#20102;&#19968;&#20010;&#21518;&#39564;&#36817;&#20284;&#65292;&#21487;&#20197;&#24555;&#36895;&#35745;&#31639;&#32473;&#23450;&#20219;&#20309;&#26032;&#35266;&#27979;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#36825;&#20123;&#36817;&#20284;&#21518;&#39564;&#30340;&#36136;&#37327;&#65292;&#24456;&#23569;&#26377;&#20445;&#35777;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;CANVI&#30340;&#19968;&#33268;&#21270;&#20998;&#25674;&#31070;&#32463;&#21464;&#20998;&#25512;&#26029;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#25193;&#23637;&#12289;&#26131;&#20110;&#23454;&#29616;&#65292;&#24182;&#25552;&#20379;&#20102;&#20445;&#35777;&#30340;&#36793;&#38469;&#35206;&#30422;&#12290;&#32473;&#23450;&#19968;&#31995;&#21015;&#20505;&#36873;&#30340;&#20998;&#25674;&#21518;&#39564;&#36817;&#20284;&#22120;&#65292;CANVI&#22522;&#20110;&#27599;&#20010;&#20505;&#36873;&#26500;&#24314;&#19968;&#33268;&#21270;&#39044;&#27979;&#22120;&#65292;&#20351;&#29992;&#39044;&#27979;&#25928;&#29575;&#36825;&#20010;&#24230;&#37327;&#26631;&#20934;&#27604;&#36739;&#39044;&#27979;&#22120;&#65292;&#24182;&#36820;&#22238;&#26368;&#39640;&#25928;&#30340;&#39044;&#27979;&#22120;&#12290;CANVI&#30830;&#20445;&#25152;&#24471;&#21040;&#30340;&#39044;&#27979;&#22120;&#26500;&#24314;&#30340;&#21306;&#22495;&#20197;&#29992;&#25143;&#25351;&#23450;&#30340;&#27010;&#29575;&#27700;&#24179;&#21253;&#21547;&#30495;&#23454;&#20540;&#12290;CANVI&#23545;&#20505;&#36873;&#36817;&#20284;&#22120;&#30340;&#21046;&#23450;&#20915;&#31574;&#19981;&#20851;&#24515;&#65292;&#24182;&#19988;&#21482;&#38656;&#35201;&#35775;&#38382;&#21069;&#21521;&#27169;&#22411;&#30340;&#26679;&#26412;&#65292;&#21487;&#20197;&#22312;&#26080;&#20284;&#28982;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#39044;&#27979;&#25928;&#29575;&#30340;&#19979;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
Amortized variational inference produces a posterior approximation that can be rapidly computed given any new observation. Unfortunately, there are few guarantees about the quality of these approximate posteriors. We propose Conformalized Amortized Neural Variational Inference (CANVI), a procedure that is scalable, easily implemented, and provides guaranteed marginal coverage. Given a collection of candidate amortized posterior approximators, CANVI constructs conformalized predictors based on each candidate, compares the predictors using a metric known as predictive efficiency, and returns the most efficient predictor. CANVI ensures that the resulting predictor constructs regions that contain the truth with a user-specified level of probability. CANVI is agnostic to design decisions in formulating the candidate approximators and only requires access to samples from the forward model, permitting its use in likelihood-free settings. We prove lower bounds on the predictive efficiency of t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38543;&#26426;&#21709;&#24212;&#26426;&#21046;&#30340;&#25193;&#23637;&#65292;&#21487;&#22312;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#32422;&#26463;&#19979;&#35745;&#31639;&#38750;&#21442;&#25968;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#65292;&#30001;&#27492;&#24471;&#21040;&#30340;&#32467;&#26524;&#21487;&#29992;&#20110;&#29983;&#25104;&#25928;&#29575;&#39640;&#30340;&#32622;&#20449;&#21306;&#38388;&#21644;&#26102;&#38388;&#22343;&#21248;&#32622;&#20449;&#24207;&#21015;&#12290;&#21033;&#29992;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#24182;&#20135;&#29983;&#31169;&#26377;&#27169;&#25311;&#12290;</title><link>http://arxiv.org/abs/2202.08728</link><description>&lt;p&gt;
&#38543;&#26426;&#21709;&#24212;&#31169;&#26377;&#32622;&#20449;&#38598;&#30340;&#38750;&#21442;&#25968;&#25193;&#23637;
&lt;/p&gt;
&lt;p&gt;
Nonparametric extensions of randomized response for private confidence sets. (arXiv:2202.08728v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.08728
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38543;&#26426;&#21709;&#24212;&#26426;&#21046;&#30340;&#25193;&#23637;&#65292;&#21487;&#22312;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#32422;&#26463;&#19979;&#35745;&#31639;&#38750;&#21442;&#25968;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#65292;&#30001;&#27492;&#24471;&#21040;&#30340;&#32467;&#26524;&#21487;&#29992;&#20110;&#29983;&#25104;&#25928;&#29575;&#39640;&#30340;&#32622;&#20449;&#21306;&#38388;&#21644;&#26102;&#38388;&#22343;&#21248;&#32622;&#20449;&#24207;&#21015;&#12290;&#21033;&#29992;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#24182;&#20135;&#29983;&#31169;&#26377;&#27169;&#25311;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#23616;&#37096;&#24046;&#20998;&#38544;&#31169;&#65288;LDP&#65289;&#32422;&#26463;&#19979;&#25191;&#34892;&#38750;&#21442;&#25968;&#12289;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35745;&#31639;&#20855;&#26377;&#22343;&#20540;$\mu^\star$&#30340;&#26377;&#30028;&#35266;&#27979;$(X_1,\dots,X_n)$&#30340;&#32622;&#20449;&#21306;&#38388;&#65288;CI&#65289;&#21644;&#26102;&#38388;&#22343;&#21248;&#32622;&#20449;&#24207;&#21015;&#65288;CS&#65289;&#65292;&#24403;&#21482;&#26377;&#35775;&#38382;&#31169;&#26377;&#25968;&#25454;$(Z_1,\dots,Z_n)$&#26102;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#38750;&#21442;&#25968;&#30340;&#12289;&#39034;&#24207;&#20132;&#20114;&#30340; Warner &#30340;&#33879;&#21517;&#8220;&#38543;&#26426;&#21709;&#24212;&#8221;&#26426;&#21046;&#30340;&#25512;&#24191;&#65292;&#20026;&#20219;&#24847;&#26377;&#30028;&#38543;&#26426;&#21464;&#37327;&#28385;&#36275; LDP&#65292;&#24182;&#25552;&#20379; CIs &#21644; CSs&#65292;&#29992;&#20110;&#35775;&#38382;&#25152;&#24471;&#31169;&#26377;&#21270;&#30340;&#35266;&#27979;&#20540;&#30340;&#22343;&#20540;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#22312;&#22266;&#23450;&#26102;&#38388;&#21644;&#26102;&#38388;&#22343;&#21248;&#21306;&#22495;&#37117;&#20135;&#29983;&#20102; Hoeffding &#19981;&#31561;&#24335;&#30340;&#31169;&#26377;&#27169;&#25311;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123; Hoeffding  &#31867;&#22411;&#30340; CSs &#25193;&#23637;&#21040;&#25429;&#33719;&#26102;&#38388;&#21464;&#21270;&#65288;&#38750;&#24179;&#31283;&#65289;&#30340;&#22343;&#20540;&#65292;&#26368;&#21518;&#35828;&#26126;&#20102;&#22914;&#20309;&#21033;&#29992;&#36825;&#20123;&#26041;&#27861;&#36827;&#34892;&#23454;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work derives methods for performing nonparametric, nonasymptotic statistical inference for population means under the constraint of local differential privacy (LDP). Given bounded observations $(X_1, \dots, X_n)$ with mean $\mu^\star$ that are privatized into $(Z_1, \dots, Z_n)$, we present confidence intervals (CI) and time-uniform confidence sequences (CS) for $\mu^\star$ when only given access to the privatized data. To achieve this, we introduce a nonparametric and sequentially interactive generalization of Warner's famous ``randomized response'' mechanism, satisfying LDP for arbitrary bounded random variables, and then provide CIs and CSs for their means given access to the resulting privatized observations. For example, our results yield private analogues of Hoeffding's inequality in both fixed-time and time-uniform regimes. We extend these Hoeffding-type CSs to capture time-varying (non-stationary) means, and conclude by illustrating how these methods can be used to conduct
&lt;/p&gt;</description></item></channel></rss>