<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36825;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#30340;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#23427;&#25552;&#20379;&#20102;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#26159;&#21487;&#34892;&#30340;&#12290;</title><link>http://arxiv.org/abs/2307.01449</link><description>&lt;p&gt;
&#23558;&#23454;&#39564;&#25968;&#25454;&#19982;&#35266;&#27979;&#25968;&#25454;&#32467;&#21512;&#30340;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Double Machine Learning Approach to Combining Experimental and Observational Data. (arXiv:2307.01449v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01449
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#30340;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#23427;&#25552;&#20379;&#20102;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#26159;&#21487;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#36890;&#24120;&#30001;&#20110;&#26080;&#27861;&#27979;&#35797;&#30340;&#20551;&#35774;&#32780;&#32570;&#20047;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#20351;&#20174;&#19994;&#20154;&#21592;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#36739;&#36731;&#30340;&#20551;&#35774;&#19979;&#27979;&#35797;&#22806;&#37096;&#25928;&#24230;&#21644;&#21487;&#24573;&#35270;&#24615;&#30340;&#36829;&#21453;&#24773;&#20917;&#12290;&#24403;&#21482;&#26377;&#19968;&#20010;&#20551;&#35774;&#34987;&#36829;&#21453;&#26102;&#65292;&#25105;&#20204;&#25552;&#20379;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#30340;&#26080;&#20813;&#36153;&#21320;&#39184;&#23450;&#29702;&#24378;&#35843;&#20102;&#20934;&#30830;&#35782;&#21035;&#36829;&#21453;&#30340;&#20551;&#35774;&#23545;&#19968;&#33268;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#24517;&#35201;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#19977;&#20010;&#23454;&#38469;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#31361;&#20986;&#20102;&#20854;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Experimental and observational studies often lack validity due to untestable assumptions. We propose a double machine learning approach to combine experimental and observational studies, allowing practitioners to test for assumption violations and estimate treatment effects consistently. Our framework tests for violations of external validity and ignorability under milder assumptions. When only one assumption is violated, we provide semi-parametrically efficient treatment effect estimators. However, our no-free-lunch theorem highlights the necessity of accurately identifying the violated assumption for consistent treatment effect estimation. We demonstrate the applicability of our approach in three real-world case studies, highlighting its relevance for practical settings.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#36125;&#32034;&#22827;&#36807;&#31243;&#25512;&#24191;&#21040;&#26102;&#31354;&#39046;&#22495;&#65292;&#20197;&#26356;&#22909;&#22320;&#22788;&#29702;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#20013;&#30340;&#26102;&#31354;&#37325;&#24314;&#12290;&#36890;&#36807;&#26367;&#25442;&#38543;&#26426;&#31995;&#25968;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#20445;&#25345;&#36793;&#32536;&#29305;&#24449;&#24182;&#27169;&#25311;&#21160;&#24577;&#21464;&#21270;&#22270;&#20687;&#30340;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.16378</link><description>&lt;p&gt;
&#36125;&#32034;&#22827;&#20808;&#39564;&#22312;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#20013;&#30340;&#26102;&#31354;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Spatiotemporal Besov Priors for Bayesian Inverse Problems. (arXiv:2306.16378v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16378
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#36125;&#32034;&#22827;&#36807;&#31243;&#25512;&#24191;&#21040;&#26102;&#31354;&#39046;&#22495;&#65292;&#20197;&#26356;&#22909;&#22320;&#22788;&#29702;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#20013;&#30340;&#26102;&#31354;&#37325;&#24314;&#12290;&#36890;&#36807;&#26367;&#25442;&#38543;&#26426;&#31995;&#25968;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#20445;&#25345;&#36793;&#32536;&#29305;&#24449;&#24182;&#27169;&#25311;&#21160;&#24577;&#21464;&#21270;&#22270;&#20687;&#30340;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#31185;&#23398;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#20419;&#20351;&#23545;&#25429;&#25417;&#25968;&#25454;&#29305;&#24449;&#65288;&#22914;&#31361;&#21464;&#25110;&#26126;&#26174;&#23545;&#27604;&#24230;&#65289;&#30340;&#36866;&#24403;&#32479;&#35745;&#24037;&#20855;&#30340;&#38656;&#27714;&#12290;&#35768;&#22810;&#25968;&#25454;&#31185;&#23398;&#24212;&#29992;&#38656;&#35201;&#20174;&#20855;&#26377;&#19981;&#36830;&#32493;&#24615;&#25110;&#22855;&#24322;&#24615;&#30340;&#26102;&#38388;&#30456;&#20851;&#23545;&#35937;&#24207;&#21015;&#20013;&#36827;&#34892;&#26102;&#31354;&#37325;&#24314;&#65292;&#22914;&#24102;&#26377;&#36793;&#32536;&#30340;&#21160;&#24577;&#35745;&#31639;&#26426;&#26029;&#23618;&#24433;&#20687;&#65288;CT&#65289;&#22270;&#20687;&#12290;&#20256;&#32479;&#30340;&#22522;&#20110;&#39640;&#26031;&#36807;&#31243;&#65288;GP&#65289;&#30340;&#26041;&#27861;&#21487;&#33021;&#26080;&#27861;&#25552;&#20379;&#20196;&#20154;&#28385;&#24847;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#22240;&#20026;&#23427;&#20204;&#24448;&#24448;&#25552;&#20379;&#36807;&#24230;&#24179;&#28369;&#30340;&#20808;&#39564;&#20505;&#36873;&#12290;&#26368;&#36817;&#65292;&#36890;&#36807;&#38543;&#26426;&#31995;&#25968;&#30340;&#23567;&#27874;&#23637;&#24320;&#23450;&#20041;&#30340;&#36125;&#32034;&#22827;&#36807;&#31243;&#65288;BP&#65289;&#34987;&#25552;&#20986;&#20316;&#20026;&#36825;&#31867;&#36125;&#21494;&#26031;&#36870;&#38382;&#39064;&#30340;&#26356;&#21512;&#36866;&#30340;&#20808;&#39564;&#12290;BP&#22312;&#25104;&#20687;&#20998;&#26512;&#20013;&#34920;&#29616;&#20986;&#20248;&#20110;GP&#30340;&#24615;&#33021;&#65292;&#33021;&#22815;&#20135;&#29983;&#20445;&#30041;&#36793;&#32536;&#29305;&#24449;&#30340;&#37325;&#24314;&#32467;&#26524;&#65292;&#20294;&#27809;&#26377;&#33258;&#21160;&#22320;&#32435;&#20837;&#21160;&#24577;&#21464;&#21270;&#22270;&#20687;&#20013;&#30340;&#26102;&#38388;&#30456;&#20851;&#24615;&#12290;&#26412;&#25991;&#23558;BP&#25512;&#24191;&#21040;&#26102;&#31354;&#39046;&#22495;&#65288;STBP&#65289;&#65292;&#36890;&#36807;&#22312;&#23567;&#27874;&#23637;&#24320;&#20013;&#26367;&#25442;&#38543;&#26426;&#31995;&#25968;&#65292;&#23454;&#29616;&#20102;&#26102;&#31354;&#30456;&#20851;&#24615;&#30340;&#24314;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;
Fast development in science and technology has driven the need for proper statistical tools to capture special data features such as abrupt changes or sharp contrast. Many applications in the data science seek spatiotemporal reconstruction from a sequence of time-dependent objects with discontinuity or singularity, e.g. dynamic computerized tomography (CT) images with edges. Traditional methods based on Gaussian processes (GP) may not provide satisfactory solutions since they tend to offer over-smooth prior candidates. Recently, Besov process (BP) defined by wavelet expansions with random coefficients has been proposed as a more appropriate prior for this type of Bayesian inverse problems. While BP outperforms GP in imaging analysis to produce edge-preserving reconstructions, it does not automatically incorporate temporal correlation inherited in the dynamically changing images. In this paper, we generalize BP to the spatiotemporal domain (STBP) by replacing the random coefficients in 
&lt;/p&gt;</description></item></channel></rss>