<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#65288;BayesNF&#65289;&#65292;&#32467;&#21512;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#29992;&#20110;&#22788;&#29702;&#22823;&#35268;&#27169;&#26102;&#31354;&#39044;&#27979;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.07657</link><description>&lt;p&gt;
&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#36827;&#34892;&#21487;&#25193;&#23637;&#30340;&#26102;&#31354;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Scalable Spatiotemporal Prediction with Bayesian Neural Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07657
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#65288;BayesNF&#65289;&#65292;&#32467;&#21512;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#29992;&#20110;&#22788;&#29702;&#22823;&#35268;&#27169;&#26102;&#31354;&#39044;&#27979;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#31354;&#25968;&#25454;&#38598;&#30001;&#31354;&#38388;&#21442;&#32771;&#30340;&#26102;&#38388;&#24207;&#21015;&#34920;&#31034;&#65292;&#24191;&#27867;&#24212;&#29992;&#20110;&#35768;&#22810;&#31185;&#23398;&#21644;&#21830;&#19994;&#26234;&#33021;&#39046;&#22495;&#65292;&#20363;&#22914;&#31354;&#27668;&#27745;&#26579;&#30417;&#27979;&#65292;&#30142;&#30149;&#36319;&#36394;&#21644;&#20113;&#38656;&#27714;&#39044;&#27979;&#12290;&#38543;&#30528;&#29616;&#20195;&#25968;&#25454;&#38598;&#35268;&#27169;&#21644;&#22797;&#26434;&#24615;&#30340;&#19981;&#26029;&#22686;&#21152;&#65292;&#38656;&#35201;&#26032;&#30340;&#32479;&#35745;&#26041;&#27861;&#26469;&#25429;&#25417;&#22797;&#26434;&#30340;&#26102;&#31354;&#21160;&#24577;&#24182;&#22788;&#29702;&#22823;&#35268;&#27169;&#39044;&#27979;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;Bayesian Neural Field (BayesNF)&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#25512;&#26029;&#26102;&#31354;&#22495;&#19978;&#20016;&#23500;&#27010;&#29575;&#20998;&#24067;&#30340;&#36890;&#29992;&#39046;&#22495;&#32479;&#35745;&#27169;&#22411;&#65292;&#21487;&#29992;&#20110;&#21253;&#25324;&#39044;&#27979;&#12289;&#25554;&#20540;&#21644;&#21464;&#24322;&#20998;&#26512;&#22312;&#20869;&#30340;&#25968;&#25454;&#20998;&#26512;&#20219;&#21153;&#12290;BayesNF&#23558;&#29992;&#20110;&#39640;&#23481;&#37327;&#20989;&#25968;&#20272;&#35745;&#30340;&#26032;&#22411;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#19982;&#29992;&#20110;&#40065;&#26834;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#30456;&#32467;&#21512;&#12290;&#36890;&#36807;&#22312;&#23450;&#20041;&#20808;&#39564;&#20998;&#24067;&#26041;&#38754;&#36827;&#34892;&#24207;&#21015;&#21270;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07657v1 Announce Type: cross  Abstract: Spatiotemporal datasets, which consist of spatially-referenced time series, are ubiquitous in many scientific and business-intelligence applications, such as air pollution monitoring, disease tracking, and cloud-demand forecasting. As modern datasets continue to increase in size and complexity, there is a growing need for new statistical methods that are flexible enough to capture complex spatiotemporal dynamics and scalable enough to handle large prediction problems. This work presents the Bayesian Neural Field (BayesNF), a domain-general statistical model for inferring rich probability distributions over a spatiotemporal domain, which can be used for data-analysis tasks including forecasting, interpolation, and variography. BayesNF integrates a novel deep neural network architecture for high-capacity function estimation with hierarchical Bayesian inference for robust uncertainty quantification. By defining the prior through a sequenc
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#31574;&#30053;&#30340;&#37327;&#21270;&#38598;&#21453;&#28436;&#26041;&#27861;&#65292;&#36890;&#36807;&#39640;&#26031;&#36807;&#31243;&#24314;&#27169;&#21644;&#36880;&#27493;&#19981;&#30830;&#23450;&#24615;&#20943;&#23569;&#21407;&#29702;&#65292;&#39034;&#24207;&#36873;&#25321;&#35780;&#20272;&#20989;&#25968;&#30340;&#28857;&#65292;&#20174;&#32780;&#26377;&#25928;&#36817;&#20284;&#24863;&#20852;&#36259;&#30340;&#38598;&#21512;&#12290;</title><link>http://arxiv.org/abs/2211.01008</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#24207;&#36143;&#35774;&#35745;&#30340;&#35745;&#31639;&#26426;&#23454;&#39564;&#37327;&#21270;&#38598;&#21453;&#28436;
&lt;/p&gt;
&lt;p&gt;
Bayesian sequential design of computer experiments for quantile set inversion. (arXiv:2211.01008v2 [stat.ML] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.01008
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#31574;&#30053;&#30340;&#37327;&#21270;&#38598;&#21453;&#28436;&#26041;&#27861;&#65292;&#36890;&#36807;&#39640;&#26031;&#36807;&#31243;&#24314;&#27169;&#21644;&#36880;&#27493;&#19981;&#30830;&#23450;&#24615;&#20943;&#23569;&#21407;&#29702;&#65292;&#39034;&#24207;&#36873;&#25321;&#35780;&#20272;&#20989;&#25968;&#30340;&#28857;&#65292;&#20174;&#32780;&#26377;&#25928;&#36817;&#20284;&#24863;&#20852;&#36259;&#30340;&#38598;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#26410;&#30693;&#30340;&#22810;&#20803;&#20989;&#25968;&#65292;&#23427;&#20195;&#34920;&#30528;&#19968;&#20010;&#31995;&#32479;&#65292;&#22914;&#19968;&#20010;&#22797;&#26434;&#30340;&#25968;&#20540;&#27169;&#25311;&#22120;&#65292;&#21516;&#26102;&#20855;&#26377;&#30830;&#23450;&#24615;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#36755;&#20837;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#20272;&#35745;&#30830;&#23450;&#24615;&#36755;&#20837;&#38598;&#65292;&#36825;&#20123;&#36755;&#20837;&#23548;&#33268;&#30340;&#36755;&#20986;&#65288;&#23601;&#19981;&#30830;&#23450;&#24615;&#36755;&#20837;&#30340;&#20998;&#24067;&#32780;&#35328;&#65289;&#23646;&#20110;&#32473;&#23450;&#38598;&#21512;&#30340;&#27010;&#29575;&#23567;&#20110;&#32473;&#23450;&#38408;&#20540;&#12290;&#36825;&#20010;&#38382;&#39064;&#34987;&#31216;&#20026;&#37327;&#21270;&#38598;&#21453;&#28436;&#65288;QSI&#65289;&#65292;&#20363;&#22914;&#22312;&#31283;&#20581;&#65288;&#22522;&#20110;&#21487;&#38752;&#24615;&#65289;&#20248;&#21270;&#38382;&#39064;&#30340;&#32972;&#26223;&#19979;&#65292;&#24403;&#23547;&#25214;&#28385;&#36275;&#32422;&#26463;&#26465;&#20214;&#19988;&#20855;&#26377;&#36275;&#22815;&#22823;&#27010;&#29575;&#30340;&#35299;&#38598;&#26102;&#20250;&#21457;&#29983;&#12290;&#20026;&#20102;&#35299;&#20915;QSI&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#39640;&#26031;&#36807;&#31243;&#24314;&#27169;&#21644;&#36880;&#27493;&#19981;&#30830;&#23450;&#24615;&#20943;&#23569;&#65288;SUR&#65289;&#21407;&#29702;&#30340;&#36125;&#21494;&#26031;&#31574;&#30053;&#65292;&#20197;&#39034;&#24207;&#36873;&#25321;&#24212;&#35813;&#35780;&#20272;&#20989;&#25968;&#30340;&#28857;&#65292;&#20197;&#20415;&#39640;&#25928;&#36817;&#20284;&#24863;&#20852;&#36259;&#30340;&#38598;&#21512;&#12290;&#36890;&#36807;&#20960;&#20010;&#25968;&#20540;&#23454;&#39564;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;SUR&#31574;&#30053;&#30340;&#24615;&#33021;&#21644;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
We consider an unknown multivariate function representing a system-such as a complex numerical simulator-taking both deterministic and uncertain inputs. Our objective is to estimate the set of deterministic inputs leading to outputs whose probability (with respect to the distribution of the uncertain inputs) of belonging to a given set is less than a given threshold. This problem, which we call Quantile Set Inversion (QSI), occurs for instance in the context of robust (reliability-based) optimization problems, when looking for the set of solutions that satisfy the constraints with sufficiently large probability. To solve the QSI problem, we propose a Bayesian strategy based on Gaussian process modeling and the Stepwise Uncertainty Reduction (SUR) principle, to sequentially choose the points at which the function should be evaluated to efficiently approximate the set of interest. We illustrate the performance and interest of the proposed SUR strategy through several numerical experiment
&lt;/p&gt;</description></item></channel></rss>