<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#36890;&#36807;&#23558;&#24635;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#20998;&#35299;&#65292;&#23558;&#22797;&#26434;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.04131</link><description>&lt;p&gt;
&#20174;&#24322;&#36136;&#25928;&#24212;&#20013;&#25552;&#21462;&#26426;&#21046;&#65306;&#20013;&#20171;&#20998;&#26512;&#30340;&#35782;&#21035;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Extract Mechanisms from Heterogeneous Effects: Identification Strategy for Mediation Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04131
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#36890;&#36807;&#23558;&#24635;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#20998;&#35299;&#65292;&#23558;&#22797;&#26434;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#22240;&#26524;&#26426;&#21046;&#23545;&#20110;&#35299;&#37322;&#21644;&#27010;&#25324;&#32463;&#39564;&#29616;&#35937;&#33267;&#20851;&#37325;&#35201;&#12290;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#25552;&#20379;&#20102;&#37327;&#21270;&#20013;&#20171;&#25928;&#24212;&#30340;&#32479;&#35745;&#25216;&#26415;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#36890;&#24120;&#38656;&#35201;&#24378;&#22823;&#30340;&#35782;&#21035;&#20551;&#35774;&#25110;&#22797;&#26434;&#30340;&#30740;&#31350;&#35774;&#35745;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#31616;&#21270;&#20102;&#36825;&#20123;&#20551;&#35774;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#12290;&#35813;&#31574;&#30053;&#22522;&#20110;&#24635;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#22411;&#20998;&#35299;&#65292;&#23558;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#12290;&#26032;&#26041;&#27861;&#24314;&#31435;&#20102;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#26032;&#32852;&#31995;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20960;&#31181;&#30740;&#31350;&#35774;&#35745;&#21644;&#20272;&#35745;&#22120;&#65292;&#20197;&#22686;&#21152;&#25105;&#20204;&#30340;&#35782;&#21035;&#31574;&#30053;&#22312;&#21508;&#31181;&#23454;&#35777;&#30740;&#31350;&#20013;&#30340;&#21487;&#29992;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#23454;&#39564;&#20013;&#20272;&#35745;&#22240;&#26524;&#20013;&#20171;&#25928;&#24212;&#26469;&#28436;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04131v1 Announce Type: cross  Abstract: Understanding causal mechanisms is essential for explaining and generalizing empirical phenomena. Causal mediation analysis offers statistical techniques to quantify mediation effects. However, existing methods typically require strong identification assumptions or sophisticated research designs. We develop a new identification strategy that simplifies these assumptions, enabling the simultaneous estimation of causal and mediation effects. The strategy is based on a novel decomposition of total treatment effects, which transforms the challenging mediation problem into a simple linear regression problem. The new method establishes a new link between causal mediation and causal moderation. We discuss several research designs and estimators to increase the usability of our identification strategy for a variety of empirical studies. We demonstrate the application of our method by estimating the causal mediation effect in experiments concer
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21435;&#22122;&#25193;&#25955;&#36807;&#31243;&#30340;&#38646;&#38454;&#25193;&#25955;&#33945;&#29305;&#21345;&#27931;&#31639;&#27861;&#65292;&#20811;&#26381;&#20102;&#38750;&#23545;&#25968;&#20985;&#20998;&#24067;&#37319;&#26679;&#20013;&#30340;&#20122;&#31283;&#23450;&#24615;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20854;&#37319;&#26679;&#31934;&#24230;&#20855;&#26377;&#20498;&#22810;&#39033;&#24335;&#20381;&#36182;&#12290;</title><link>https://arxiv.org/abs/2402.17886</link><description>&lt;p&gt;
&#29992;&#20110;&#38750;&#23545;&#25968;&#20985;&#20998;&#24067;&#30340;&#38646;&#38454;&#37319;&#26679;&#26041;&#27861;&#65306;&#36890;&#36807;&#21435;&#22122;&#25193;&#25955;&#32531;&#35299;&#20122;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Zeroth-Order Sampling Methods for Non-Log-Concave Distributions: Alleviating Metastability by Denoising Diffusion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17886
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21435;&#22122;&#25193;&#25955;&#36807;&#31243;&#30340;&#38646;&#38454;&#25193;&#25955;&#33945;&#29305;&#21345;&#27931;&#31639;&#27861;&#65292;&#20811;&#26381;&#20102;&#38750;&#23545;&#25968;&#20985;&#20998;&#24067;&#37319;&#26679;&#20013;&#30340;&#20122;&#31283;&#23450;&#24615;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20854;&#37319;&#26679;&#31934;&#24230;&#20855;&#26377;&#20498;&#22810;&#39033;&#24335;&#20381;&#36182;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#32771;&#34385;&#20102;&#22522;&#20110;&#20854;&#38750;&#23545;&#25968;&#20985;&#20998;&#24067;&#26410;&#24402;&#19968;&#21270;&#23494;&#24230;&#26597;&#35810;&#30340;&#37319;&#26679;&#38382;&#39064;&#12290;&#39318;&#20808;&#25551;&#36848;&#20102;&#19968;&#20010;&#22522;&#20110;&#27169;&#25311;&#21435;&#22122;&#25193;&#25955;&#36807;&#31243;&#30340;&#26694;&#26550;&#65292;&#21363;&#25193;&#25955;&#33945;&#29305;&#21345;&#27931;&#65288;DMC&#65289;&#65292;&#20854;&#24471;&#20998;&#20989;&#25968;&#36890;&#36807;&#36890;&#29992;&#33945;&#29305;&#21345;&#27931;&#20272;&#35745;&#22120;&#36924;&#36817;&#12290;DMC&#26159;&#19968;&#20010;&#22522;&#20110;&#31070;&#35861;&#30340;&#20803;&#31639;&#27861;&#65292;&#20854;&#20013;&#31070;&#35861;&#26159;&#20551;&#35774;&#21487;&#20197;&#35775;&#38382;&#29983;&#25104;&#33945;&#29305;&#21345;&#27931;&#20998;&#25968;&#20272;&#35745;&#22120;&#30340;&#26679;&#26412;&#30340;&#35775;&#38382;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110;&#25298;&#32477;&#37319;&#26679;&#30340;&#36825;&#20010;&#31070;&#35861;&#30340;&#23454;&#29616;&#65292;&#36825;&#23558;DMC&#36716;&#21270;&#20026;&#19968;&#20010;&#30495;&#27491;&#30340;&#31639;&#27861;&#65292;&#31216;&#20026;&#38646;&#38454;&#25193;&#25955;&#33945;&#29305;&#21345;&#27931;&#65288;ZOD-MC&#65289;&#12290;&#25105;&#20204;&#36890;&#36807;&#39318;&#20808;&#26500;&#24314;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#21363;DMC&#30340;&#24615;&#33021;&#20445;&#35777;&#65292;&#32780;&#19981;&#20551;&#35774;&#30446;&#26631;&#20998;&#24067;&#20026;&#23545;&#25968;&#20985;&#25110;&#28385;&#36275;&#20219;&#20309;&#31561;&#21608;&#19981;&#31561;&#24335;&#65292;&#25552;&#20379;&#20102;&#25910;&#25947;&#20998;&#26512;&#12290;&#28982;&#21518;&#25105;&#20204;&#35777;&#26126;ZOD-MC&#23545;&#25152;&#38656;&#37319;&#26679;&#31934;&#24230;&#20855;&#26377;&#20498;&#22810;&#39033;&#24335;&#20381;&#36182;&#65292;&#23613;&#31649;&#20173;&#28982;&#21463;&#21040;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17886v1 Announce Type: cross  Abstract: This paper considers the problem of sampling from non-logconcave distribution, based on queries of its unnormalized density. It first describes a framework, Diffusion Monte Carlo (DMC), based on the simulation of a denoising diffusion process with its score function approximated by a generic Monte Carlo estimator. DMC is an oracle-based meta-algorithm, where its oracle is the assumed access to samples that generate a Monte Carlo score estimator. Then we provide an implementation of this oracle, based on rejection sampling, and this turns DMC into a true algorithm, termed Zeroth-Order Diffusion Monte Carlo (ZOD-MC). We provide convergence analyses by first constructing a general framework, i.e. a performance guarantee for DMC, without assuming the target distribution to be log-concave or satisfying any isoperimetric inequality. Then we prove that ZOD-MC admits an inverse polynomial dependence on the desired sampling accuracy, albeit sti
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Bridge&#30340;&#27169;&#22411;&#65292;&#33268;&#21147;&#20110;&#35299;&#20915;&#21033;&#29992;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#21253;&#25324;&#22522;&#22240;&#32452;&#26495;&#22359;&#30340;&#21464;&#21270;&#12289;&#27979;&#24207;&#25216;&#26415;&#30340;&#24046;&#24322;&#20197;&#21450;&#25968;&#25454;&#30340;&#39640;&#32500;&#24230;&#21644;&#31232;&#30095;&#24615;&#31561;&#12290;</title><link>https://arxiv.org/abs/2402.00077</link><description>&lt;p&gt;
&#22810;&#26426;&#26500;&#25968;&#25454;&#30340;&#37322;&#25918;&#21147;&#37327;&#65306;&#25972;&#21512;&#21644;&#21327;&#35843;&#36328;&#26426;&#26500;&#30340;&#22522;&#22240;&#32452;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Unlocking the Power of Multi-institutional Data: Integrating and Harmonizing Genomic Data Across Institutions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00077
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Bridge&#30340;&#27169;&#22411;&#65292;&#33268;&#21147;&#20110;&#35299;&#20915;&#21033;&#29992;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#21253;&#25324;&#22522;&#22240;&#32452;&#26495;&#22359;&#30340;&#21464;&#21270;&#12289;&#27979;&#24207;&#25216;&#26415;&#30340;&#24046;&#24322;&#20197;&#21450;&#25968;&#25454;&#30340;&#39640;&#32500;&#24230;&#21644;&#31232;&#30095;&#24615;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30284;&#30151;&#26159;&#30001;&#22522;&#22240;&#31361;&#21464;&#39537;&#21160;&#30340;&#22797;&#26434;&#30142;&#30149;&#65292;&#32959;&#30244;&#27979;&#24207;&#24050;&#25104;&#20026;&#30284;&#30151;&#24739;&#32773;&#20020;&#24202;&#25252;&#29702;&#30340;&#37325;&#35201;&#25163;&#27573;&#12290;&#20986;&#29616;&#30340;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#20026;&#23398;&#20064;&#30495;&#23454;&#19990;&#30028;&#30340;&#35777;&#25454;&#20197;&#22686;&#24378;&#31934;&#20934;&#32959;&#30244;&#21307;&#23398;&#25552;&#20379;&#20102;&#24378;&#22823;&#30340;&#36164;&#28304;&#12290;&#30001;&#32654;&#22269;&#30284;&#30151;&#30740;&#31350;&#21327;&#20250;&#39046;&#23548;&#30340;GENIE BPC&#24314;&#31435;&#20102;&#19968;&#20010;&#29420;&#29305;&#30340;&#25968;&#25454;&#24211;&#65292;&#23558;&#22522;&#22240;&#32452;&#25968;&#25454;&#19982;&#22810;&#20010;&#30284;&#30151;&#20013;&#24515;&#30340;&#20020;&#24202;&#20449;&#24687;&#32852;&#31995;&#36215;&#26469;&#12290;&#28982;&#32780;&#65292;&#21033;&#29992;&#36825;&#31181;&#22810;&#26426;&#26500;&#27979;&#24207;&#25968;&#25454;&#38754;&#20020;&#30528;&#37325;&#22823;&#25361;&#25112;&#12290;&#22522;&#22240;&#32452;&#26495;&#22359;&#30340;&#21464;&#21270;&#23548;&#33268;&#22312;&#20351;&#29992;&#24120;&#35265;&#22522;&#22240;&#38598;&#36827;&#34892;&#20998;&#26512;&#26102;&#20449;&#24687;&#20002;&#22833;&#12290;&#27492;&#22806;&#65292;&#19981;&#21516;&#30340;&#27979;&#24207;&#25216;&#26415;&#21644;&#26426;&#26500;&#20043;&#38388;&#30340;&#24739;&#32773;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#22797;&#26434;&#24615;&#12290;&#39640;&#32500;&#25968;&#25454;&#12289;&#31232;&#30095;&#22522;&#22240;&#31361;&#21464;&#27169;&#24335;&#20197;&#21450;&#20010;&#20307;&#22522;&#22240;&#27700;&#24179;&#19978;&#30340;&#24369;&#20449;&#21495;&#36827;&#19968;&#27493;&#22686;&#21152;&#20102;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#12290;&#22312;&#36825;&#20123;&#29616;&#23454;&#19990;&#30028;&#30340;&#25361;&#25112;&#30340;&#25512;&#21160;&#19979;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Bridge&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cancer is a complex disease driven by genomic alterations, and tumor sequencing is becoming a mainstay of clinical care for cancer patients. The emergence of multi-institution sequencing data presents a powerful resource for learning real-world evidence to enhance precision oncology. GENIE BPC, led by the American Association for Cancer Research, establishes a unique database linking genomic data with clinical information for patients treated at multiple cancer centers. However, leveraging such multi-institutional sequencing data presents significant challenges. Variations in gene panels result in loss of information when the analysis is conducted on common gene sets. Additionally, differences in sequencing techniques and patient heterogeneity across institutions add complexity. High data dimensionality, sparse gene mutation patterns, and weak signals at the individual gene level further complicate matters. Motivated by these real-world challenges, we introduce the Bridge model. It use
&lt;/p&gt;</description></item></channel></rss>