<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24320;&#21457;&#20102;&#25512;&#26029;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;</title><link>https://arxiv.org/abs/2403.05803</link><description>&lt;p&gt;
&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#30340;&#21322;&#21442;&#25968;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Inference for Regression-Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05803
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24320;&#21457;&#20102;&#25512;&#26029;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDDs&#65289;&#20013;&#65292;&#27835;&#30103;&#25928;&#24212;&#36890;&#24120;&#20351;&#29992;&#23616;&#37096;&#22238;&#24402;&#26041;&#27861;&#36827;&#34892;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;&#20840;&#23616;&#36817;&#20284;&#26041;&#27861;&#36890;&#24120;&#34987;&#35748;&#20026;&#25928;&#29575;&#20302;&#19979;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#19987;&#38376;&#29992;&#20110;&#22312;RDDs&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#20840;&#23616;&#26041;&#27861;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#20854;&#20013;&#32447;&#24615;&#37096;&#20998;&#25429;&#25417;&#27835;&#30103;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#26469;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24182;&#24320;&#21457;&#20102;&#25512;&#26029;&#22312;&#36825;&#20010;&#26694;&#26550;&#20869;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;&#25105;&#20204;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#21508;&#31181;&#22330;&#26223;&#19979;&#34920;&#29616;&#33391;&#22909;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#30495;&#23454;&#25968;&#25454;&#38598;&#30340;&#20363;&#35777;&#65292;&#35828;&#26126;&#25105;&#20204;&#30340;&#20840;&#23616;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#26356;&#21487;&#38752;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05803v1 Announce Type: new  Abstract: Treatment effects in regression discontinuity designs (RDDs) are often estimated using local regression methods. However, global approximation methods are generally deemed inefficient. In this paper, we propose a semiparametric framework tailored for estimating treatment effects in RDDs. Our global approach conceptualizes the identification of treatment effects within RDDs as a partially linear modeling problem, with the linear component capturing the treatment effect. Furthermore, we utilize the P-spline method to approximate the nonparametric function and develop procedures for inferring treatment effects within this framework. We demonstrate through Monte Carlo simulations that the proposed method performs well across various scenarios. Furthermore, we illustrate using real-world datasets that our global approach may result in more reliable inference.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;MOLAR&#65292;&#23427;&#21033;&#29992;&#21327;&#21516;&#32447;&#24615;&#22238;&#24402;&#21644;&#19978;&#19979;&#25991;&#33218;&#38382;&#39064;&#20013;&#30340;&#31232;&#30095;&#24322;&#36136;&#24615;&#26469;&#25552;&#39640;&#20272;&#35745;&#31934;&#24230;&#65292;&#24182;&#19988;&#30456;&#27604;&#29420;&#31435;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2306.06291</link><description>&lt;p&gt;
&#26368;&#20248;&#24322;&#26500;&#21327;&#21516;&#32447;&#24615;&#22238;&#24402;&#21644;&#19978;&#19979;&#25991;&#33218;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Heterogeneous Collaborative Linear Regression and Contextual Bandits. (arXiv:2306.06291v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.06291
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;MOLAR&#65292;&#23427;&#21033;&#29992;&#21327;&#21516;&#32447;&#24615;&#22238;&#24402;&#21644;&#19978;&#19979;&#25991;&#33218;&#38382;&#39064;&#20013;&#30340;&#31232;&#30095;&#24322;&#36136;&#24615;&#26469;&#25552;&#39640;&#20272;&#35745;&#31934;&#24230;&#65292;&#24182;&#19988;&#30456;&#27604;&#29420;&#31435;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#21644;&#22797;&#26434;&#30340;&#25968;&#25454;&#38598;&#24448;&#24448;&#26469;&#33258;&#20110;&#20960;&#20010;&#21487;&#33021;&#26159;&#24322;&#26500;&#30340;&#26469;&#28304;&#12290;&#21327;&#21516;&#23398;&#20064;&#26041;&#27861;&#36890;&#36807;&#21033;&#29992;&#25968;&#25454;&#38598;&#20043;&#38388;&#30340;&#20849;&#24615;&#25552;&#39640;&#25928;&#29575;&#65292;&#21516;&#26102;&#32771;&#34385;&#21487;&#33021;&#20986;&#29616;&#30340;&#24046;&#24322;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#30740;&#31350;&#21327;&#21516;&#32447;&#24615;&#22238;&#24402;&#21644;&#19978;&#19979;&#25991;&#33218;&#38382;&#39064;&#65292;&#20854;&#20013;&#27599;&#20010;&#23454;&#20363;&#30340;&#30456;&#20851;&#21442;&#25968;&#31561;&#20110;&#20840;&#23616;&#21442;&#25968;&#21152;&#19978;&#19968;&#20010;&#31232;&#30095;&#30340;&#23454;&#20363;&#29305;&#23450;&#26415;&#35821;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MOLAR&#30340;&#26032;&#22411;&#20108;&#38454;&#27573;&#20272;&#35745;&#22120;&#65292;&#23427;&#36890;&#36807;&#39318;&#20808;&#26500;&#24314;&#23454;&#20363;&#32447;&#24615;&#22238;&#24402;&#20272;&#35745;&#30340;&#36880;&#39033;&#20013;&#20301;&#25968;&#65292;&#28982;&#21518;&#23558;&#23454;&#20363;&#29305;&#23450;&#20272;&#35745;&#20540;&#25910;&#32553;&#21040;&#20013;&#20301;&#25968;&#38468;&#36817;&#26469;&#21033;&#29992;&#36825;&#31181;&#32467;&#26500;&#12290;&#19982;&#29420;&#31435;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#30456;&#27604;&#65292;MOLAR&#25552;&#39640;&#20102;&#20272;&#35745;&#35823;&#24046;&#23545;&#25968;&#25454;&#32500;&#24230;&#30340;&#20381;&#36182;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;MOLAR&#24212;&#29992;&#20110;&#24320;&#21457;&#29992;&#20110;&#31232;&#30095;&#24322;&#26500;&#21327;&#21516;&#19978;&#19979;&#25991;&#33218;&#30340;&#26041;&#27861;&#65292;&#36825;&#20123;&#26041;&#27861;&#30456;&#27604;&#29420;&#31435;&#33218;&#27169;&#22411;&#20855;&#26377;&#26356;&#22909;&#30340;&#36951;&#25022;&#20445;&#35777;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#36129;&#29486;&#20248;&#20110;&#20808;&#21069;&#22312;&#25991;&#29486;&#20013;&#25253;&#36947;&#30340;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large and complex datasets are often collected from several, possibly heterogeneous sources. Collaborative learning methods improve efficiency by leveraging commonalities across datasets while accounting for possible differences among them. Here we study collaborative linear regression and contextual bandits, where each instance's associated parameters are equal to a global parameter plus a sparse instance-specific term. We propose a novel two-stage estimator called MOLAR that leverages this structure by first constructing an entry-wise median of the instances' linear regression estimates, and then shrinking the instance-specific estimates towards the median. MOLAR improves the dependence of the estimation error on the data dimension, compared to independent least squares estimates. We then apply MOLAR to develop methods for sparsely heterogeneous collaborative contextual bandits, which lead to improved regret guarantees compared to independent bandit methods. We further show that our 
&lt;/p&gt;</description></item></channel></rss>