<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27979;&#35797;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#20998;&#31867;&#25968;&#25454;&#30340;&#32858;&#31867;&#24615;&#33021;&#12290;&#36890;&#36807;&#35745;&#31639;&#23646;&#24615;&#23545;&#30340;&#21345;&#26041;&#32479;&#35745;&#37327;&#30340;&#21644;&#24471;&#21040;&#19968;&#20010;&#35299;&#26512;&#30340;p&#20540;&#20316;&#20026;&#35780;&#20272;&#25351;&#26631;&#12290;&#32467;&#26524;&#34920;&#26126;&#36825;&#31181;&#26041;&#27861;&#22312;&#22522;&#20934;&#20998;&#31867;&#25968;&#25454;&#38598;&#19978;&#30340;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.07346</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#27979;&#35797;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#20998;&#31867;&#25968;&#25454;&#30340;&#32858;&#31867;&#24615;
&lt;/p&gt;
&lt;p&gt;
A testing-based approach to assess the clusterability of categorical data. (arXiv:2307.07346v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07346
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27979;&#35797;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#20998;&#31867;&#25968;&#25454;&#30340;&#32858;&#31867;&#24615;&#33021;&#12290;&#36890;&#36807;&#35745;&#31639;&#23646;&#24615;&#23545;&#30340;&#21345;&#26041;&#32479;&#35745;&#37327;&#30340;&#21644;&#24471;&#21040;&#19968;&#20010;&#35299;&#26512;&#30340;p&#20540;&#20316;&#20026;&#35780;&#20272;&#25351;&#26631;&#12290;&#32467;&#26524;&#34920;&#26126;&#36825;&#31181;&#26041;&#27861;&#22312;&#22522;&#20934;&#20998;&#31867;&#25968;&#25454;&#38598;&#19978;&#30340;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32858;&#31867;&#24615;&#35780;&#20272;&#30340;&#30446;&#26631;&#26159;&#26816;&#26597;&#25968;&#25454;&#38598;&#20013;&#26159;&#21542;&#23384;&#22312;&#32858;&#31867;&#32467;&#26500;&#12290;&#20316;&#20026;&#32858;&#31867;&#20998;&#26512;&#20013;&#19968;&#20010;&#33267;&#20851;&#37325;&#35201;&#20294;&#24120;&#24120;&#34987;&#24573;&#35270;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#22312;&#24212;&#29992;&#20219;&#20309;&#32858;&#31867;&#31639;&#27861;&#20043;&#21069;&#37117;&#38656;&#35201;&#36827;&#34892;&#36825;&#26679;&#30340;&#26816;&#39564;&#12290;&#22914;&#26524;&#19968;&#20010;&#25968;&#25454;&#38598;&#19981;&#21487;&#32858;&#31867;&#65292;&#21017;&#20219;&#20309;&#21518;&#32493;&#30340;&#32858;&#31867;&#20998;&#26512;&#37117;&#19981;&#20250;&#20135;&#29983;&#26377;&#25928;&#32467;&#26524;&#12290;&#23613;&#31649;&#23427;&#30340;&#37325;&#35201;&#24615;&#65292;&#20294;&#29616;&#26377;&#30740;&#31350;&#20013;&#30340;&#22823;&#37096;&#20998;&#20851;&#27880;&#25968;&#20540;&#25968;&#25454;&#65292;&#23558;&#23545;&#20998;&#31867;&#25968;&#25454;&#30340;&#32858;&#31867;&#24615;&#35780;&#20272;&#38382;&#39064;&#30041;&#32473;&#25104;&#20026;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;TestCat&#65292;&#19968;&#31181;&#22522;&#20110;&#27979;&#35797;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#20998;&#31867;&#25968;&#25454;&#30340;&#32858;&#31867;&#24615;&#65292;&#20351;&#29992;&#35299;&#26512;&#30340;p&#20540;&#20316;&#20026;&#35780;&#20272;&#25351;&#26631;&#12290;TestCat&#30340;&#20851;&#38190;&#24605;&#24819;&#26159;&#65292;&#21487;&#32858;&#31867;&#30340;&#20998;&#31867;&#25968;&#25454;&#20855;&#26377;&#35768;&#22810;&#24378;&#30456;&#20851;&#30340;&#23646;&#24615;&#23545;&#65292;&#22240;&#27492;&#23558;&#25152;&#26377;&#23646;&#24615;&#23545;&#30340;&#21345;&#26041;&#32479;&#35745;&#37327;&#30340;&#21644;&#20316;&#20026;p&#20540;&#35745;&#31639;&#30340;&#27979;&#35797;&#32479;&#35745;&#37327;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#19968;&#32452;&#22522;&#20934;&#20998;&#31867;&#25968;&#25454;&#38598;&#65292;&#32467;&#26524;&#34920;&#26126;TestCat&#30340;&#34920;&#29616;&#20248;&#20110;&#29616;&#26377;&#30340;&#20854;&#20182;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The objective of clusterability evaluation is to check whether a clustering structure exists within the data set. As a crucial yet often-overlooked issue in cluster analysis, it is essential to conduct such a test before applying any clustering algorithm. If a data set is unclusterable, any subsequent clustering analysis would not yield valid results. Despite its importance, the majority of existing studies focus on numerical data, leaving the clusterability evaluation issue for categorical data as an open problem. Here we present TestCat, a testing-based approach to assess the clusterability of categorical data in terms of an analytical $p$-value. The key idea underlying TestCat is that clusterable categorical data possess many strongly correlated attribute pairs and hence the sum of chi-squared statistics of all attribute pairs is employed as the test statistic for $p$-value calculation. We apply our method to a set of benchmark categorical data sets, showing that TestCat outperforms
&lt;/p&gt;</description></item></channel></rss>