<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#22810;&#35270;&#35282;&#31526;&#21495;&#22238;&#24402;(MvSR)&#26159;&#19968;&#31181;&#21516;&#26102;&#32771;&#34385;&#22810;&#20010;&#25968;&#25454;&#38598;&#30340;&#31526;&#21495;&#22238;&#24402;&#26041;&#27861;&#65292;&#33021;&#22815;&#25214;&#21040;&#19968;&#20010;&#21442;&#25968;&#21270;&#35299;&#26469;&#20934;&#30830;&#25311;&#21512;&#25152;&#26377;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#26080;&#27861;&#22788;&#29702;&#19981;&#21516;&#23454;&#39564;&#35774;&#32622;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.04298</link><description>&lt;p&gt;
&#22810;&#35270;&#35282;&#31526;&#21495;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Multi-View Symbolic Regression
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04298
&lt;/p&gt;
&lt;p&gt;
&#22810;&#35270;&#35282;&#31526;&#21495;&#22238;&#24402;(MvSR)&#26159;&#19968;&#31181;&#21516;&#26102;&#32771;&#34385;&#22810;&#20010;&#25968;&#25454;&#38598;&#30340;&#31526;&#21495;&#22238;&#24402;&#26041;&#27861;&#65292;&#33021;&#22815;&#25214;&#21040;&#19968;&#20010;&#21442;&#25968;&#21270;&#35299;&#26469;&#20934;&#30830;&#25311;&#21512;&#25152;&#26377;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#26080;&#27861;&#22788;&#29702;&#19981;&#21516;&#23454;&#39564;&#35774;&#32622;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31526;&#21495;&#22238;&#24402;(SR)&#25628;&#32034;&#34920;&#31034;&#35299;&#37322;&#21464;&#37327;&#21644;&#21709;&#24212;&#21464;&#37327;&#20043;&#38388;&#20851;&#31995;&#30340;&#20998;&#26512;&#34920;&#36798;&#24335;&#12290;&#30446;&#21069;&#30340;SR&#26041;&#27861;&#20551;&#35774;&#20174;&#21333;&#20010;&#23454;&#39564;&#20013;&#25552;&#21462;&#30340;&#21333;&#20010;&#25968;&#25454;&#38598;&#12290;&#28982;&#32780;&#65292;&#30740;&#31350;&#20154;&#21592;&#32463;&#24120;&#38754;&#20020;&#26469;&#33258;&#19981;&#21516;&#35774;&#32622;&#30340;&#22810;&#20010;&#23454;&#39564;&#32467;&#26524;&#38598;&#12290;&#20256;&#32479;&#30340;SR&#26041;&#27861;&#21487;&#33021;&#26080;&#27861;&#25214;&#21040;&#28508;&#22312;&#30340;&#34920;&#36798;&#24335;&#65292;&#22240;&#20026;&#27599;&#20010;&#23454;&#39564;&#30340;&#21442;&#25968;&#21487;&#33021;&#19981;&#21516;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22810;&#35270;&#35282;&#31526;&#21495;&#22238;&#24402;(MvSR)&#65292;&#23427;&#21516;&#26102;&#32771;&#34385;&#22810;&#20010;&#25968;&#25454;&#38598;&#65292;&#27169;&#25311;&#23454;&#39564;&#29615;&#22659;&#65292;&#24182;&#36755;&#20986;&#19968;&#20010;&#36890;&#29992;&#30340;&#21442;&#25968;&#21270;&#35299;&#12290;&#36825;&#31181;&#26041;&#27861;&#23558;&#35780;&#20272;&#30340;&#34920;&#36798;&#24335;&#36866;&#24212;&#27599;&#20010;&#29420;&#31435;&#25968;&#25454;&#38598;&#65292;&#24182;&#21516;&#26102;&#36820;&#22238;&#33021;&#22815;&#20934;&#30830;&#25311;&#21512;&#25152;&#26377;&#25968;&#25454;&#38598;&#30340;&#21442;&#25968;&#20989;&#25968;&#26063;f(x; \theta)&#12290;&#25105;&#20204;&#20351;&#29992;&#20174;&#24050;&#30693;&#34920;&#36798;&#24335;&#29983;&#25104;&#30340;&#25968;&#25454;&#20197;&#21450;&#26469;&#33258;&#23454;&#38469;&#19990;&#30028;&#30340;&#25968;&#25454;&#26469;&#23637;&#31034;MvSR&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Symbolic regression (SR) searches for analytical expressions representing the relationship between a set of explanatory and response variables. Current SR methods assume a single dataset extracted from a single experiment. Nevertheless, frequently, the researcher is confronted with multiple sets of results obtained from experiments conducted with different setups. Traditional SR methods may fail to find the underlying expression since the parameters of each experiment can be different. In this work we present Multi-View Symbolic Regression (MvSR), which takes into account multiple datasets simultaneously, mimicking experimental environments, and outputs a general parametric solution. This approach fits the evaluated expression to each independent dataset and returns a parametric family of functions f(x; \theta) simultaneously capable of accurately fitting all datasets. We demonstrate the effectiveness of MvSR using data generated from known expressions, as well as real-world data from 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#38469;&#19978;&#26159;&#22522;&#20110;&#23725;&#22238;&#24402;&#30340;&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;&#65292;&#36825;&#27604;&#20256;&#32479;&#30340;&#29366;&#24577;&#31354;&#38388;&#26041;&#27861;&#35745;&#31639;&#26356;&#24555;&#65292;&#35843;&#25972;&#26356;&#23481;&#26131;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#32463;&#27982;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2009.00401</link><description>&lt;p&gt;
&#20351;&#29992;&#23725;&#22238;&#24402;&#27861;&#30340;&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Time-Varying Parameters as Ridge Regressions. (arXiv:2009.00401v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.00401
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#38469;&#19978;&#26159;&#22522;&#20110;&#23725;&#22238;&#24402;&#30340;&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;&#65292;&#36825;&#27604;&#20256;&#32479;&#30340;&#29366;&#24577;&#31354;&#38388;&#26041;&#27861;&#35745;&#31639;&#26356;&#24555;&#65292;&#35843;&#25972;&#26356;&#23481;&#26131;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#32463;&#27982;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;(TVPs)&#32463;&#24120;&#34987;&#29992;&#20110;&#32463;&#27982;&#23398;&#20013;&#26469;&#25429;&#25417;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;&#25105;&#24378;&#35843;&#20102;&#19968;&#20010;&#34987;&#24573;&#35270;&#30340;&#20107;&#23454;&#8212;&#8212;&#36825;&#20123;&#23454;&#38469;&#19978;&#26159;&#23725;&#22238;&#24402;&#12290;&#36825;&#20351;&#24471;&#35745;&#31639;&#12289;&#35843;&#25972;&#21644;&#23454;&#29616;&#27604;&#29366;&#24577;&#31354;&#38388;&#33539;&#24335;&#26356;&#23481;&#26131;&#12290;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65292;&#35299;&#20915;&#31561;&#20215;&#30340;&#21452;&#37325;&#23725;&#38382;&#39064;&#30340;&#35745;&#31639;&#38750;&#24120;&#24555;,&#20851;&#38190;&#30340;&#8220;&#26102;&#38388;&#21464;&#21270;&#37327;&#8221;&#36890;&#24120;&#26159;&#30001;&#20132;&#21449;&#39564;&#35777;&#26469;&#35843;&#25972;&#30340;&#12290;&#20351;&#29992;&#20004;&#27493;&#22238;&#24402;&#23725;&#22238;&#24402;&#26469;&#22788;&#29702;&#19981;&#26029;&#21464;&#21270;&#30340;&#27874;&#21160;&#24615;&#12290;&#25105;&#32771;&#34385;&#20102;&#22522;&#20110;&#31232;&#30095;&#24615;(&#31639;&#27861;&#36873;&#25321;&#21738;&#20123;&#21442;&#25968;&#21464;&#21270;, &#21738;&#20123;&#19981;&#21464;)&#21644;&#38477;&#20302;&#31209;&#32422;&#26463;&#30340;&#25193;&#23637;(&#21464;&#21270;&#19982;&#22240;&#23376;&#27169;&#22411;&#30456;&#20851;&#32852;)&#12290;&#20026;&#20102;&#23637;&#31034;&#36825;&#31181;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;, &#25105;&#20351;&#29992;&#23427;&#26469;&#30740;&#31350;&#21152;&#25343;&#22823;&#36135;&#24065;&#25919;&#31574;&#30340;&#28436;&#21464;, &#24182;&#20351;&#29992;&#22823;&#35268;&#27169;&#26102;&#21464;&#23616;&#37096;&#25237;&#24433;&#20272;&#35745;&#32422;4600&#20010;TVPs, &#36825;&#19968;&#20219;&#21153;&#23436;&#20840;&#21487;&#20197;&#21033;&#29992;&#36825;&#31181;&#26032;&#26041;&#27861;&#23436;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
Time-varying parameters (TVPs) models are frequently used in economics to capture structural change. I highlight a rather underutilized fact -- that these are actually ridge regressions. Instantly, this makes computations, tuning, and implementation much easier than in the state-space paradigm. Among other things, solving the equivalent dual ridge problem is computationally very fast even in high dimensions, and the crucial "amount of time variation" is tuned by cross-validation. Evolving volatility is dealt with using a two-step ridge regression. I consider extensions that incorporate sparsity (the algorithm selects which parameters vary and which do not) and reduced-rank restrictions (variation is tied to a factor model). To demonstrate the usefulness of the approach, I use it to study the evolution of monetary policy in Canada using large time-varying local projections. The application requires the estimation of about 4600 TVPs, a task well within the reach of the new method.
&lt;/p&gt;</description></item></channel></rss>