<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#24341;&#20837;&#31532;&#19977;&#32500;&#24230;&#65292;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#20026;ROC&#26354;&#38754;&#65292;&#25552;&#20986;VOROS&#20316;&#20026;2D ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;3D&#27867;&#21270;&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25104;&#26412;&#12290;</title><link>https://arxiv.org/abs/2402.18689</link><description>&lt;p&gt;
VOROS&#65306;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#21040;3D
&lt;/p&gt;
&lt;p&gt;
The VOROS: Lifting ROC curves to 3D
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18689
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#31532;&#19977;&#32500;&#24230;&#65292;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#20026;ROC&#26354;&#38754;&#65292;&#25552;&#20986;VOROS&#20316;&#20026;2D ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;3D&#27867;&#21270;&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#26159;&#19968;&#20010;&#24120;&#29992;&#30340;&#24230;&#37327;&#65292;&#36890;&#24120;&#29992;&#20110;&#25490;&#21015;&#19981;&#21516;&#20108;&#20803;&#20998;&#31867;&#22120;&#30340;&#30456;&#23545;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#27491;&#22914;&#20197;&#21069;&#25152;&#25351;&#20986;&#30340;&#65292;&#24403;&#30495;&#23454;&#31867;&#20540;&#25110;&#35823;&#20998;&#31867;&#25104;&#26412;&#22312;&#20004;&#20010;&#31867;&#21035;&#20043;&#38388;&#39640;&#24230;&#19981;&#24179;&#34913;&#26102;&#65292;&#23427;&#21487;&#33021;&#26080;&#27861;&#20934;&#30830;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25928;&#30410;&#12290;&#25105;&#20204;&#24341;&#20837;&#31532;&#19977;&#32500;&#26469;&#25429;&#33719;&#36825;&#20123;&#25104;&#26412;&#65292;&#24182;&#20197;&#19968;&#31181;&#33258;&#28982;&#30340;&#26041;&#24335;&#23558;ROC&#26354;&#32447;&#25552;&#21319;&#20026;ROC&#26354;&#38754;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20010;&#26354;&#38754;&#65292;&#24182;&#24341;&#20837;&#20102;VOROS&#65292;&#21363;ROC&#26354;&#38754;&#19978;&#26041;&#30340;&#20307;&#31215;&#65292;&#20316;&#20026;2D ROC&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;3D&#27867;&#21270;&#12290;&#23545;&#20110;&#23384;&#22312;&#39044;&#26399;&#25104;&#26412;&#25110;&#31867;&#21035;&#19981;&#24179;&#34913;&#36793;&#30028;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#38480;&#21046;&#32771;&#34385;&#36866;&#24403;&#23376;&#21306;&#22495;&#30340;ROC&#26354;&#38754;&#30340;&#20307;&#31215;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;VOROS&#22914;&#20309;&#22312;&#32463;&#20856;&#21644;&#29616;&#20195;&#31034;&#20363;&#25968;&#25454;&#38598;&#19978;&#26356;&#22909;&#22320;&#25429;&#25417;&#19981;&#21516;&#20998;&#31867;&#22120;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18689v1 Announce Type: new  Abstract: The area under the ROC curve is a common measure that is often used to rank the relative performance of different binary classifiers. However, as has been also previously noted, it can be a measure that ill-captures the benefits of different classifiers when either the true class values or misclassification costs are highly unbalanced between the two classes. We introduce a third dimension to capture these costs, and lift the ROC curve to a ROC surface in a natural way. We study both this surface and introduce the VOROS, the volume over this ROC surface, as a 3D generalization of the 2D area under the ROC curve. For problems where there are only bounds on the expected costs or class imbalances, we restrict consideration to the volume of the appropriate subregion of the ROC surface. We show how the VOROS can better capture the costs of different classifiers on both a classical and a modern example dataset.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#65292;&#36890;&#36807;&#38598;&#25104;&#22312;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#30340;&#32467;&#26500;&#20013;&#65292;&#21487;&#20197;&#28789;&#27963;&#12289;&#39640;&#25928;&#22320;&#27169;&#25311;&#20855;&#26377;&#38750;&#24179;&#31283;&#30456;&#20851;&#24615;&#30340;&#26497;&#31471;&#20107;&#20214;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#22312;&#26102;&#38388;&#25928;&#29575;&#21644;&#24615;&#33021;&#19978;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#35768;&#22810;&#20855;&#26377;&#24179;&#31283;&#30456;&#20851;&#24615;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2307.08079</link><description>&lt;p&gt;
&#36890;&#36807;&#21464;&#20998;&#33258;&#21160; &#32534;&#30721;&#22120;&#23454;&#29616;&#28789;&#27963;&#39640;&#25928;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
Flexible and efficient spatial extremes emulation via variational autoencoders. (arXiv:2307.08079v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08079
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#65292;&#36890;&#36807;&#38598;&#25104;&#22312;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120;&#30340;&#32467;&#26500;&#20013;&#65292;&#21487;&#20197;&#28789;&#27963;&#12289;&#39640;&#25928;&#22320;&#27169;&#25311;&#20855;&#26377;&#38750;&#24179;&#31283;&#30456;&#20851;&#24615;&#30340;&#26497;&#31471;&#20107;&#20214;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#22312;&#26102;&#38388;&#25928;&#29575;&#21644;&#24615;&#33021;&#19978;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#35768;&#22810;&#20855;&#26377;&#24179;&#31283;&#30456;&#20851;&#24615;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#29616;&#23454;&#19990;&#30028;&#30340;&#36807;&#31243;&#20855;&#26377;&#22797;&#26434;&#30340;&#23614;&#20381;&#36182;&#32467;&#26500;&#65292;&#36825;&#31181;&#32467;&#26500;&#26080;&#27861;&#20351;&#29992;&#20256;&#32479;&#30340;&#39640;&#26031;&#36807;&#31243;&#26469;&#25551;&#36848;&#12290;&#26356;&#28789;&#27963;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#65292; &#22914;&#39640;&#26031;&#23610;&#24230;&#28151;&#21512;&#27169;&#22411;&#21644;&#21333;&#31449;&#28857;&#35843;&#33410;&#27169;&#22411;&#65292;&#20855;&#26377;&#21560;&#24341;&#20154;&#30340;&#26497;&#31471;&#20381;&#36182;&#24615;&#36136;&#65292;&#20294;&#24448;&#24448;&#38590;&#20197;&#25311;&#21512;&#21644;&#27169;&#25311;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#65292;&#20855;&#26377;&#28789;&#27963;&#21644;&#38750;&#24179;&#31283;&#30340;&#30456;&#20851;&#24615;&#23646;&#24615;&#65292;&#24182;&#23558;&#20854;&#38598;&#25104;&#21040;&#21464;&#20998;&#33258;&#21160;&#32534;&#30721;&#22120; (extVAE) &#30340;&#32534;&#30721;-&#35299;&#30721;&#32467;&#26500;&#20013;&#12290; extVAE &#21487;&#20197;&#20316;&#20026;&#19968;&#20010;&#26102;&#31354;&#27169;&#25311;&#22120;&#65292;&#23545;&#28508;&#22312;&#30340;&#26426;&#21046;&#27169;&#22411;&#36755;&#20986;&#29366;&#24577;&#30340;&#20998;&#24067;&#36827;&#34892;&#24314;&#27169;&#65292;&#24182;&#20135;&#29983;&#20855;&#26377;&#19982;&#36755;&#20837;&#30456;&#21516;&#23646;&#24615;&#30340;&#36755;&#20986;&#65292;&#23588;&#20854;&#26159;&#22312;&#23614;&#37096;&#21306;&#22495;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#65292;&#25105;&#20204;&#35777;&#26126;&#25105;&#20204;&#30340;extVAE&#27604;&#20256;&#32479;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#26356;&#39640;&#25928;&#65292;&#24182;&#19988;&#22312;&#20855;&#26377; &#24179;&#31283;&#30456;&#20851;&#24615;&#32467;&#26500;&#30340;&#35768;&#22810;&#31354;&#38388;&#26497;&#31471;&#20540;&#27169;&#22411;&#20013;&#34920;&#29616; &#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many real-world processes have complex tail dependence structures that cannot be characterized using classical Gaussian processes. More flexible spatial extremes models such as Gaussian scale mixtures and single-station conditioning models exhibit appealing extremal dependence properties but are often exceedingly prohibitive to fit and simulate from. In this paper, we develop a new spatial extremes model that has flexible and non-stationary dependence properties, and we integrate it in the encoding-decoding structure of a variational autoencoder (extVAE). The extVAE can be used as a spatio-temporal emulator that characterizes the distribution of potential mechanistic model output states and produces outputs that have the same properties as the inputs, especially in the tail. Through extensive simulation studies, we show that our extVAE is vastly more time-efficient than traditional Bayesian inference while also outperforming many spatial extremes models with a stationary dependence str
&lt;/p&gt;</description></item></channel></rss>