<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>DS^3M&#26159;&#19968;&#31181;&#28145;&#24230;&#20999;&#25442;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65292;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;&#20855;&#26377;&#22797;&#26434;&#38750;&#32447;&#24615;&#20381;&#36182;&#21644;&#19981;&#35268;&#21017;&#20999;&#25442;&#26426;&#21046;&#30340;&#26102;&#38388;&#24207;&#21015;&#65292;&#20197;&#23454;&#29616;&#32463;&#27982;&#25928;&#30410;&#21644;&#26356;&#28145;&#20837;&#30340;&#29616;&#35937;&#29702;&#35299;&#12290;</title><link>http://arxiv.org/abs/2106.02329</link><description>&lt;p&gt;
&#28145;&#24230;&#20999;&#25442;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;DS^3M&#65289;&#29992;&#20110;&#20855;&#26377;&#20999;&#25442;&#26426;&#21046;&#30340;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Deep Switching State Space Model (DS$^3$M) for Nonlinear Time Series Forecasting with Regime Switching. (arXiv:2106.02329v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.02329
&lt;/p&gt;
&lt;p&gt;
DS^3M&#26159;&#19968;&#31181;&#28145;&#24230;&#20999;&#25442;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65292;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;&#20855;&#26377;&#22797;&#26434;&#38750;&#32447;&#24615;&#20381;&#36182;&#21644;&#19981;&#35268;&#21017;&#20999;&#25442;&#26426;&#21046;&#30340;&#26102;&#38388;&#24207;&#21015;&#65292;&#20197;&#23454;&#29616;&#32463;&#27982;&#25928;&#30410;&#21644;&#26356;&#28145;&#20837;&#30340;&#29616;&#35937;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#32463;&#24120;&#23637;&#31034;&#22797;&#26434;&#30340;&#38750;&#32447;&#24615;&#20381;&#36182;&#20851;&#31995;&#20197;&#21450;&#19981;&#35268;&#21017;&#30340;&#20999;&#25442;&#26426;&#21046;&#34892;&#20026;&#12290;&#36825;&#20123;&#29305;&#24449;&#22312;&#24314;&#27169;&#12289;&#25512;&#29702;&#21644;&#23545;&#28508;&#22312;&#38543;&#26426;&#29616;&#35937;&#25552;&#20379;&#28145;&#20837;&#29702;&#35299;&#26041;&#38754;&#37117;&#23384;&#22312;&#25216;&#26415;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#24314;&#27169;&#26694;&#26550;&#65292;&#21363;&#28145;&#24230;&#20999;&#25442;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;DS^3M&#65289;&#12290;&#35813;&#26694;&#26550;&#26088;&#22312;&#20934;&#30830;&#39044;&#27979;&#27492;&#31867;&#26102;&#38388;&#24207;&#21015;&#65292;&#21516;&#26102;&#29087;&#32451;&#22320;&#35782;&#21035;&#21160;&#24577;&#20013;&#38544;&#34255;&#30340;&#19981;&#35268;&#21017;&#20999;&#25442;&#26426;&#21046;&#12290;&#36825;&#31181;&#35782;&#21035;&#19981;&#20165;&#22312;&#32463;&#27982;&#19978;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#36824;&#26377;&#21161;&#20110;&#26356;&#28145;&#20837;&#22320;&#29702;&#35299;&#28508;&#22312;&#29616;&#35937;&#12290;&#22312;DS^3M&#20013;&#65292;&#35813;&#26550;&#26500;&#20351;&#29992;&#31163;&#25955;&#28508;&#22312;&#21464;&#37327;&#26469;&#34920;&#31034;&#20999;&#25442;&#26426;&#21046;&#65292;&#20351;&#29992;&#36830;&#32493;&#28508;&#22312;&#21464;&#37327;&#26469;&#32771;&#34385;&#38543;&#26426;&#39537;&#21160;&#22240;&#32032;&#12290;&#36890;&#36807;&#23558;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65288;RNN&#65289;&#19982;&#38750;&#32447;&#24615;&#20999;&#25442;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65288;SSSM&#65289;&#30456;&#32467;&#21512;&#65292;&#25105;&#20204;&#25104;&#21151;&#25429;&#25417;&#20102;&#38750;&#32447;&#24615;&#20381;&#36182;&#20851;&#31995;&#21644;&#19981;&#35268;&#21017;&#20999;&#25442;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Modern time series data often display complex nonlinear dependencies along with irregular regime-switching behaviors. These features present technical challenges in modeling, inference, and in offering insightful understanding into the underlying stochastic phenomena. To tackle these challenges, we introduce a novel modeling framework known as the Deep Switching State Space Model (DS$^3$M). This framework is engineered to make accurate forecasts for such time series while adeptly identifying the irregular regimes hidden within the dynamics. These identifications not only have significant economic ramifications but also contribute to a deeper understanding of the underlying phenomena. In DS$^3$M, the architecture employs discrete latent variables to represent regimes and continuous latent variables to account for random driving factors. By melding a Recurrent Neural Network (RNN) with a nonlinear Switching State Space Model (SSSM), we manage to capture the nonlinear dependencies and irr
&lt;/p&gt;</description></item></channel></rss>