<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#22312;&#26410;&#35266;&#27979;&#28151;&#26434;&#22240;&#32032;&#30340;&#24773;&#20917;&#19979;&#65292;&#26412;&#25991;&#23637;&#31034;&#20102;&#21363;&#20351;&#22312;&#25918;&#23485;&#25110;&#29978;&#33267;&#22312;&#25490;&#38500;&#25152;&#26377;&#30456;&#20851;&#39118;&#38505;&#22240;&#32032;&#34987;&#35266;&#27979;&#21040;&#30340;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#20173;&#28982;&#21487;&#20197;&#32473;&#20986;&#23545;&#39640;&#39118;&#38505;&#20010;&#20307;&#20998;&#37197;&#29575;&#30340;&#20449;&#24687;&#20016;&#23500;&#30340;&#30028;&#38480;&#12290;</title><link>https://arxiv.org/abs/2403.14713</link><description>&lt;p&gt;
&#22312;&#26410;&#35266;&#27979;&#28151;&#26434;&#22240;&#32032;&#19979;&#23457;&#35745;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
Auditing Fairness under Unobserved Confounding
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14713
&lt;/p&gt;
&lt;p&gt;
&#22312;&#26410;&#35266;&#27979;&#28151;&#26434;&#22240;&#32032;&#30340;&#24773;&#20917;&#19979;&#65292;&#26412;&#25991;&#23637;&#31034;&#20102;&#21363;&#20351;&#22312;&#25918;&#23485;&#25110;&#29978;&#33267;&#22312;&#25490;&#38500;&#25152;&#26377;&#30456;&#20851;&#39118;&#38505;&#22240;&#32032;&#34987;&#35266;&#27979;&#21040;&#30340;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#20173;&#28982;&#21487;&#20197;&#32473;&#20986;&#23545;&#39640;&#39118;&#38505;&#20010;&#20307;&#20998;&#37197;&#29575;&#30340;&#20449;&#24687;&#20016;&#23500;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20915;&#31574;&#31995;&#32479;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#26159;&#36328;&#36234;&#20154;&#21475;&#32479;&#35745;&#32447;&#23384;&#22312;&#19981;&#20844;&#24179;&#24615;&#12290;&#28982;&#32780;&#65292;&#19981;&#20844;&#24179;&#24615;&#21487;&#33021;&#38590;&#20197;&#37327;&#21270;&#65292;&#29305;&#21035;&#26159;&#22914;&#26524;&#25105;&#20204;&#23545;&#20844;&#24179;&#24615;&#30340;&#29702;&#35299;&#20381;&#36182;&#20110;&#38590;&#20197;&#34913;&#37327;&#30340;&#39118;&#38505;&#31561;&#35266;&#24565;&#65288;&#20363;&#22914;&#65292;&#23545;&#20110;&#37027;&#20123;&#27809;&#26377;&#20854;&#27835;&#30103;&#23601;&#20250;&#27515;&#20129;&#30340;&#20154;&#24179;&#31561;&#33719;&#24471;&#27835;&#30103;&#65289;&#12290;&#23457;&#35745;&#36825;&#31181;&#19981;&#20844;&#24179;&#24615;&#38656;&#35201;&#20934;&#30830;&#27979;&#37327;&#20010;&#20307;&#39118;&#38505;&#65292;&#32780;&#22312;&#26410;&#35266;&#27979;&#28151;&#26434;&#30340;&#29616;&#23454;&#29615;&#22659;&#20013;&#65292;&#38590;&#20197;&#20272;&#35745;&#12290;&#22312;&#36825;&#20123;&#26410;&#35266;&#27979;&#21040;&#30340;&#22240;&#32032;&#8220;&#35299;&#37322;&#8221;&#26126;&#26174;&#24046;&#24322;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#33021;&#20302;&#20272;&#25110;&#39640;&#20272;&#19981;&#20844;&#24179;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#21363;&#20351;&#22312;&#25918;&#23485;&#25110;&#65288;&#20196;&#20154;&#24778;&#35766;&#22320;&#65289;&#29978;&#33267;&#22312;&#25490;&#38500;&#25152;&#26377;&#30456;&#20851;&#39118;&#38505;&#22240;&#32032;&#34987;&#35266;&#27979;&#21040;&#30340;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#20173;&#28982;&#21487;&#20197;&#23545;&#39640;&#39118;&#38505;&#20010;&#20307;&#30340;&#20998;&#37197;&#29575;&#32473;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#21033;&#29992;&#20102;&#22312;&#35768;&#22810;&#23454;&#38469;&#29615;&#22659;&#20013;&#65288;&#20363;&#22914;&#24341;&#20837;&#26032;&#22411;&#27835;&#30103;&#65289;&#25105;&#20204;&#25317;&#26377;&#22312;&#20219;&#20309;&#20998;&#37197;&#20043;&#21069;&#30340;&#25968;&#25454;&#30340;&#20107;&#23454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14713v1 Announce Type: cross  Abstract: A fundamental problem in decision-making systems is the presence of inequity across demographic lines. However, inequity can be difficult to quantify, particularly if our notion of equity relies on hard-to-measure notions like risk (e.g., equal access to treatment for those who would die without it). Auditing such inequity requires accurate measurements of individual risk, which is difficult to estimate in the realistic setting of unobserved confounding. In the case that these unobservables "explain" an apparent disparity, we may understate or overstate inequity. In this paper, we show that one can still give informative bounds on allocation rates among high-risk individuals, even while relaxing or (surprisingly) even when eliminating the assumption that all relevant risk factors are observed. We utilize the fact that in many real-world settings (e.g., the introduction of a novel treatment) we have data from a period prior to any alloc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#28789;&#27963;&#30340;&#36125;&#21494;&#26031;g&#24418;&#24335;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#20855;&#26377;&#26102;&#21464;&#28151;&#26434;&#30340;&#22240;&#26524;&#29983;&#23384;&#20998;&#26512;&#12290;&#23427;&#37319;&#29992;&#36125;&#21494;&#26031;&#38468;&#21152;&#22238;&#24402;&#26641;&#26469;&#27169;&#25311;&#26102;&#21464;&#29983;&#25104;&#32452;&#20214;&#65292;&#24182;&#24341;&#20837;&#20102;&#32437;&#21521;&#24179;&#34913;&#20998;&#25968;&#20197;&#38477;&#20302;&#27169;&#22411;&#38169;&#35823;&#35268;&#33539;&#24341;&#36215;&#30340;&#20559;&#24046;&#12290;</title><link>https://arxiv.org/abs/2402.02306</link><description>&lt;p&gt;
&#24377;&#24615;&#36125;&#21494;&#26031;g&#24418;&#24335;&#22312;&#20855;&#26377;&#26102;&#21464;&#28151;&#26434;&#30340;&#22240;&#26524;&#29983;&#23384;&#20998;&#26512;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A flexible Bayesian g-formula for causal survival analyses with time-dependent confounding
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02306
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#28789;&#27963;&#30340;&#36125;&#21494;&#26031;g&#24418;&#24335;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#20855;&#26377;&#26102;&#21464;&#28151;&#26434;&#30340;&#22240;&#26524;&#29983;&#23384;&#20998;&#26512;&#12290;&#23427;&#37319;&#29992;&#36125;&#21494;&#26031;&#38468;&#21152;&#22238;&#24402;&#26641;&#26469;&#27169;&#25311;&#26102;&#21464;&#29983;&#25104;&#32452;&#20214;&#65292;&#24182;&#24341;&#20837;&#20102;&#32437;&#21521;&#24179;&#34913;&#20998;&#25968;&#20197;&#38477;&#20302;&#27169;&#22411;&#38169;&#35823;&#35268;&#33539;&#24341;&#36215;&#30340;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#26102;&#38388;&#33267;&#20107;&#20214;&#32467;&#26524;&#30340;&#32437;&#21521;&#35266;&#23519;&#24615;&#30740;&#31350;&#20013;&#65292;&#22240;&#26524;&#20998;&#26512;&#30340;&#24120;&#35265;&#30446;&#26631;&#26159;&#22312;&#30740;&#31350;&#32676;&#20307;&#20013;&#20272;&#35745;&#22312;&#20551;&#35774;&#24178;&#39044;&#24773;&#26223;&#19979;&#30340;&#22240;&#26524;&#29983;&#23384;&#26354;&#32447;&#12290;g&#24418;&#24335;&#26159;&#36825;&#31181;&#20998;&#26512;&#30340;&#19968;&#20010;&#29305;&#21035;&#26377;&#29992;&#30340;&#24037;&#20855;&#12290;&#20026;&#20102;&#22686;&#24378;&#20256;&#32479;&#30340;&#21442;&#25968;&#21270;g&#24418;&#24335;&#26041;&#27861;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26356;&#28789;&#27963;&#30340;&#36125;&#21494;&#26031;g&#24418;&#24335;&#20272;&#35745;&#22120;&#12290;&#35813;&#20272;&#35745;&#22120;&#21516;&#26102;&#25903;&#25345;&#32437;&#21521;&#39044;&#27979;&#21644;&#22240;&#26524;&#25512;&#26029;&#12290;&#23427;&#22312;&#27169;&#25311;&#26102;&#21464;&#29983;&#25104;&#32452;&#20214;&#30340;&#24314;&#27169;&#20013;&#24341;&#20837;&#20102;&#36125;&#21494;&#26031;&#38468;&#21152;&#22238;&#24402;&#26641;&#65292;&#26088;&#22312;&#20943;&#36731;&#30001;&#20110;&#27169;&#22411;&#38169;&#35823;&#35268;&#33539;&#36896;&#25104;&#30340;&#20559;&#24046;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31867;&#26356;&#36890;&#29992;&#30340;&#31163;&#25955;&#29983;&#23384;&#25968;&#25454;g&#24418;&#24335;&#12290;&#36825;&#20123;&#20844;&#24335;&#21487;&#20197;&#24341;&#20837;&#32437;&#21521;&#24179;&#34913;&#20998;&#25968;&#65292;&#36825;&#22312;&#22788;&#29702;&#36234;&#26469;&#36234;&#22810;&#30340;&#26102;&#21464;&#28151;&#26434;&#22240;&#32032;&#26102;&#26159;&#19968;&#31181;&#26377;&#25928;&#30340;&#38477;&#32500;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In longitudinal observational studies with a time-to-event outcome, a common objective in causal analysis is to estimate the causal survival curve under hypothetical intervention scenarios within the study cohort. The g-formula is a particularly useful tool for this analysis. To enhance the traditional parametric g-formula approach, we developed a more adaptable Bayesian g-formula estimator. This estimator facilitates both longitudinal predictive and causal inference. It incorporates Bayesian additive regression trees in the modeling of the time-evolving generative components, aiming to mitigate bias due to model misspecification. Specifically, we introduce a more general class of g-formulas for discrete survival data. These formulas can incorporate the longitudinal balancing scores, which serve as an effective method for dimension reduction and are vital when dealing with an expanding array of time-varying confounders. The minimum sufficient formulation of these longitudinal balancing
&lt;/p&gt;</description></item><item><title>&#23545;&#20110;&#24490;&#29615;&#27169;&#22411;&#20013;&#21547;&#26377;&#38544;&#34255;&#22240;&#21464;&#37327;&#30340;&#22240;&#26524;&#21457;&#29616;&#65292;&#24050;&#32463;&#20986;&#29616;&#20102;&#33021;&#22815;&#22788;&#29702;&#36825;&#31181;&#24773;&#20917;&#30340;&#22810;&#31181;&#25216;&#26415;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.13009</link><description>&lt;p&gt;
&#24490;&#29615;&#27169;&#22411;&#20013;&#21547;&#26377;&#38544;&#34255;&#22240;&#21464;&#37327;&#30340;&#22240;&#26524;&#21457;&#29616;&#26041;&#27861;&#30340;&#27604;&#36739;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Comparative Study of Causal Discovery Methods for Cyclic Models with Hidden Confounders. (arXiv:2401.13009v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13009
&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#24490;&#29615;&#27169;&#22411;&#20013;&#21547;&#26377;&#38544;&#34255;&#22240;&#21464;&#37327;&#30340;&#22240;&#26524;&#21457;&#29616;&#65292;&#24050;&#32463;&#20986;&#29616;&#20102;&#33021;&#22815;&#22788;&#29702;&#36825;&#31181;&#24773;&#20917;&#30340;&#22810;&#31181;&#25216;&#26415;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22914;&#20170;&#65292;&#23545;&#22240;&#26524;&#21457;&#29616;&#30340;&#38656;&#27714;&#26080;&#22788;&#19981;&#22312;&#12290;&#29702;&#35299;&#31995;&#32479;&#20013;&#37096;&#20998;&#20043;&#38388;&#30340;&#38543;&#26426;&#20381;&#36182;&#24615;&#20197;&#21450;&#23454;&#38469;&#30340;&#22240;&#26524;&#20851;&#31995;&#23545;&#31185;&#23398;&#30340;&#21508;&#20010;&#37096;&#20998;&#37117;&#33267;&#20851;&#37325;&#35201;&#12290;&#22240;&#27492;&#65292;&#23547;&#25214;&#21487;&#38752;&#30340;&#26041;&#27861;&#26469;&#26816;&#27979;&#22240;&#26524;&#26041;&#21521;&#30340;&#38656;&#27714;&#19981;&#26029;&#22686;&#38271;&#12290;&#22312;&#36807;&#21435;&#30340;50&#24180;&#37324;&#65292;&#20986;&#29616;&#20102;&#35768;&#22810;&#22240;&#26524;&#21457;&#29616;&#31639;&#27861;&#65292;&#20294;&#22823;&#22810;&#25968;&#20165;&#36866;&#29992;&#20110;&#31995;&#32479;&#27809;&#26377;&#21453;&#39304;&#29615;&#36335;&#24182;&#19988;&#20855;&#26377;&#22240;&#26524;&#20805;&#20998;&#24615;&#30340;&#20551;&#35774;&#65292;&#21363;&#27809;&#26377;&#26410;&#27979;&#37327;&#30340;&#23376;&#31995;&#32479;&#33021;&#22815;&#24433;&#21709;&#22810;&#20010;&#24050;&#27979;&#37327;&#21464;&#37327;&#12290;&#36825;&#26159;&#19981;&#24184;&#30340;&#65292;&#22240;&#20026;&#36825;&#20123;&#38480;&#21046;&#22312;&#23454;&#36341;&#20013;&#24448;&#24448;&#19981;&#33021;&#20551;&#23450;&#12290;&#21453;&#39304;&#26159;&#35768;&#22810;&#36807;&#31243;&#30340;&#19968;&#20010;&#37325;&#35201;&#29305;&#24615;&#65292;&#29616;&#23454;&#19990;&#30028;&#30340;&#31995;&#32479;&#24456;&#23569;&#26159;&#23436;&#20840;&#38548;&#31163;&#21644;&#23436;&#20840;&#27979;&#37327;&#30340;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#22312;&#26368;&#36817;&#20960;&#24180;&#20013;&#65292;&#24050;&#32463;&#21457;&#23637;&#20102;&#20960;&#31181;&#33021;&#22815;&#22788;&#29702;&#24490;&#29615;&#30340;&#12289;&#22240;&#26524;&#19981;&#20805;&#20998;&#30340;&#31995;&#32479;&#30340;&#25216;&#26415;&#12290;&#38543;&#30528;&#22810;&#31181;&#26041;&#27861;&#30340;&#20986;&#29616;&#65292;&#19968;&#31181;&#23454;&#38469;&#30340;&#24212;&#29992;&#26041;&#27861;&#24320;&#22987;&#21464;&#24471;&#21487;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nowadays, the need for causal discovery is ubiquitous. A better understanding of not just the stochastic dependencies between parts of a system, but also the actual cause-effect relations, is essential for all parts of science. Thus, the need for reliable methods to detect causal directions is growing constantly. In the last 50 years, many causal discovery algorithms have emerged, but most of them are applicable only under the assumption that the systems have no feedback loops and that they are causally sufficient, i.e. that there are no unmeasured subsystems that can affect multiple measured variables. This is unfortunate since those restrictions can often not be presumed in practice. Feedback is an integral feature of many processes, and real-world systems are rarely completely isolated and fully measured. Fortunately, in recent years, several techniques, that can cope with cyclic, causally insufficient systems, have been developed. And with multiple methods available, a practical ap
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#32437;&#21521;&#26367;&#20195;&#26694;&#26550;&#65292;&#29992;&#20110;&#20934;&#30830;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#30340;&#25928;&#26524;&#12290;&#35770;&#25991;&#36890;&#36807;&#20998;&#35299;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#20026;&#19968;&#31995;&#21015;&#20989;&#25968;&#65292;&#32771;&#34385;&#29992;&#25143;&#23646;&#24615;&#12289;&#30701;&#26399;&#20013;&#38388;&#25351;&#26631;&#21644;&#27835;&#30103;&#20998;&#37197;&#31561;&#22240;&#32032;&#12290;</title><link>http://arxiv.org/abs/2308.08152</link><description>&lt;p&gt;
&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Estimating Effects of Long-Term Treatments. (arXiv:2308.08152v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08152
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#32437;&#21521;&#26367;&#20195;&#26694;&#26550;&#65292;&#29992;&#20110;&#20934;&#30830;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#30340;&#25928;&#26524;&#12290;&#35770;&#25991;&#36890;&#36807;&#20998;&#35299;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#20026;&#19968;&#31995;&#21015;&#20989;&#25968;&#65292;&#32771;&#34385;&#29992;&#25143;&#23646;&#24615;&#12289;&#30701;&#26399;&#20013;&#38388;&#25351;&#26631;&#21644;&#27835;&#30103;&#20998;&#37197;&#31561;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;A/B&#27979;&#35797;&#20013;&#65292;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#30340;&#25928;&#26524;&#26159;&#19968;&#20010;&#24040;&#22823;&#30340;&#25361;&#25112;&#12290;&#36825;&#31181;&#27835;&#30103;&#25514;&#26045;&#21253;&#25324;&#20135;&#21697;&#21151;&#33021;&#30340;&#26356;&#26032;&#12289;&#29992;&#25143;&#30028;&#38754;&#35774;&#35745;&#21644;&#25512;&#33616;&#31639;&#27861;&#31561;&#65292;&#26088;&#22312;&#22312;&#20854;&#21457;&#24067;&#21518;&#38271;&#26399;&#23384;&#22312;&#31995;&#32479;&#20013;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#38271;&#26399;&#35797;&#39564;&#30340;&#38480;&#21046;&#65292;&#20174;&#19994;&#32773;&#36890;&#24120;&#20381;&#36182;&#30701;&#26399;&#23454;&#39564;&#32467;&#26524;&#26469;&#20570;&#20135;&#21697;&#21457;&#24067;&#20915;&#31574;&#12290;&#22914;&#20309;&#20351;&#29992;&#30701;&#26399;&#23454;&#39564;&#25968;&#25454;&#20934;&#30830;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#32437;&#21521;&#26367;&#20195;&#26694;&#26550;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#65292;&#22312;&#26631;&#20934;&#20551;&#35774;&#19979;&#65292;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#21487;&#20197;&#20998;&#35299;&#20026;&#19968;&#31995;&#21015;&#20989;&#25968;&#65292;&#36825;&#20123;&#20989;&#25968;&#20381;&#36182;&#20110;&#29992;&#25143;&#23646;&#24615;&#12289;&#30701;&#26399;&#20013;&#38388;&#25351;&#26631;&#21644;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#25551;&#36848;&#20102;&#35782;&#21035;&#20551;&#35774;&#12289;&#20272;&#35745;&#31574;&#30053;&#21644;&#25512;&#29702;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimating the effects of long-term treatments in A/B testing presents a significant challenge. Such treatments -- including updates to product functions, user interface designs, and recommendation algorithms -- are intended to remain in the system for a long period after their launches. On the other hand, given the constraints of conducting long-term experiments, practitioners often rely on short-term experimental results to make product launch decisions. It remains an open question how to accurately estimate the effects of long-term treatments using short-term experimental data. To address this question, we introduce a longitudinal surrogate framework. We show that, under standard assumptions, the effects of long-term treatments can be decomposed into a series of functions, which depend on the user attributes, the short-term intermediate metrics, and the treatment assignments. We describe the identification assumptions, the estimation strategies, and the inference technique under thi
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#27493;&#38750;&#21442;&#25968;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#24179;&#28369;&#26679;&#26465;&#26469;&#22788;&#29702;&#20869;&#29983;&#24615;&#21644;&#20202;&#22120;&#21464;&#37327;&#65292;&#21516;&#26102;&#35299;&#20915;&#20102;&#21333;&#35843;&#24615;&#38480;&#21046;&#30340;&#38382;&#39064;&#65292;&#24182;&#22312;&#20272;&#35745;Engel&#26354;&#32447;&#26102;&#34920;&#29616;&#20986;&#33391;&#22909;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2307.14867</link><description>&lt;p&gt;
&#19968;&#27493;&#38750;&#21442;&#25968;&#20202;&#22120;&#22238;&#24402;&#20351;&#29992;&#24179;&#28369;&#26679;&#26465;
&lt;/p&gt;
&lt;p&gt;
One-step nonparametric instrumental regression using smoothing splines. (arXiv:2307.14867v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14867
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#27493;&#38750;&#21442;&#25968;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#24179;&#28369;&#26679;&#26465;&#26469;&#22788;&#29702;&#20869;&#29983;&#24615;&#21644;&#20202;&#22120;&#21464;&#37327;&#65292;&#21516;&#26102;&#35299;&#20915;&#20102;&#21333;&#35843;&#24615;&#38480;&#21046;&#30340;&#38382;&#39064;&#65292;&#24182;&#22312;&#20272;&#35745;Engel&#26354;&#32447;&#26102;&#34920;&#29616;&#20986;&#33391;&#22909;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;&#38750;&#21442;&#25968;&#22238;&#24402;&#24179;&#28369;&#26679;&#26465;&#25193;&#23637;&#21040;&#19968;&#31181;&#24773;&#22659;&#65292;&#21363;&#23384;&#22312;&#20869;&#29983;&#24615;&#21644;&#20351;&#29992;&#20202;&#22120;&#21464;&#37327;&#12290;&#19982;&#27969;&#34892;&#30340;&#29616;&#26377;&#20272;&#35745;&#26041;&#27861;&#19981;&#21516;&#65292;&#32467;&#26524;&#20272;&#35745;&#22120;&#26159;&#19968;&#27493;&#30340;&#65292;&#24182;&#20381;&#36182;&#20110;&#21807;&#19968;&#30340;&#27491;&#21017;&#21270;&#21442;&#25968;&#12290;&#25105;&#20204;&#23548;&#20986;&#20102;&#20272;&#35745;&#22120;&#21450;&#20854;&#19968;&#38454;&#23548;&#25968;&#30340;&#22343;&#21248;&#25910;&#25947;&#36895;&#29575;&#12290;&#25105;&#20204;&#36824;&#35299;&#20915;&#20102;&#22312;&#20272;&#35745;&#20013;&#26045;&#21152;&#21333;&#35843;&#24615;&#30340;&#38382;&#39064;&#12290;&#27169;&#25311;&#32467;&#26524;&#35777;&#23454;&#20102;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#19982;&#20004;&#27493;&#31243;&#24207;&#30456;&#27604;&#30340;&#33391;&#22909;&#24615;&#33021;&#12290;&#24403;&#29992;&#20110;&#20272;&#35745;Engel&#26354;&#32447;&#26102;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20135;&#29983;&#20102;&#32463;&#27982;&#19978;&#26377;&#24847;&#20041;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We extend nonparametric regression smoothing splines to a context where there is endogeneity and instrumental variables are available. Unlike popular existing estimators, the resulting estimator is one-step and relies on a unique regularization parameter. We derive uniform rates of the convergence for the estimator and its first derivative. We also address the issue of imposing monotonicity in estimation. Simulations confirm the good performances of our estimator compared to two-step procedures. Our method yields economically sensible results when used to estimate Engel curves.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#25913;&#21892;&#20154;&#31867;&#20915;&#31574;&#30340;&#32479;&#35745;&#26694;&#26550;&#65292;&#36890;&#36807;&#22522;&#20934;&#27979;&#35797;&#19982;&#26426;&#22120;&#39044;&#27979;&#65292;&#26367;&#25442;&#37096;&#20998;&#20154;&#31867;&#20915;&#31574;&#32773;&#30340;&#20915;&#31574;&#21046;&#23450;&#65292;&#24182;&#32463;&#36807;&#23454;&#39564;&#26816;&#39564;&#24471;&#20986;&#31639;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#30495;&#38451;&#24615;&#29575;&#21644;&#26356;&#20302;&#30340;&#20551;&#38451;&#24615;&#29575;&#65292;&#23588;&#20854;&#26159;&#26469;&#33258;&#20892;&#26449;&#22320;&#21306;&#30340;&#21307;&#29983;&#30340;&#35786;&#26029;&#26356;&#23481;&#26131;&#34987;&#26367;&#20195;&#12290;</title><link>http://arxiv.org/abs/2306.11689</link><description>&lt;p&gt;
&#32479;&#35745;&#27979;&#35797;&#26367;&#20195;&#20154;&#31867;&#20915;&#31574;&#32773;&#30340;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Statistical Tests for Replacing Human Decision Makers with Algorithms. (arXiv:2306.11689v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11689
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#25913;&#21892;&#20154;&#31867;&#20915;&#31574;&#30340;&#32479;&#35745;&#26694;&#26550;&#65292;&#36890;&#36807;&#22522;&#20934;&#27979;&#35797;&#19982;&#26426;&#22120;&#39044;&#27979;&#65292;&#26367;&#25442;&#37096;&#20998;&#20154;&#31867;&#20915;&#31574;&#32773;&#30340;&#20915;&#31574;&#21046;&#23450;&#65292;&#24182;&#32463;&#36807;&#23454;&#39564;&#26816;&#39564;&#24471;&#20986;&#31639;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#30495;&#38451;&#24615;&#29575;&#21644;&#26356;&#20302;&#30340;&#20551;&#38451;&#24615;&#29575;&#65292;&#23588;&#20854;&#26159;&#26469;&#33258;&#20892;&#26449;&#22320;&#21306;&#30340;&#21307;&#29983;&#30340;&#35786;&#26029;&#26356;&#23481;&#26131;&#34987;&#26367;&#20195;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#35745;&#26694;&#26550;&#65292;&#21487;&#20197;&#36890;&#36807;&#20154;&#24037;&#26234;&#33021;&#26469;&#25913;&#21892;&#20154;&#31867;&#30340;&#20915;&#31574;&#12290;&#39318;&#20808;&#23558;&#27599;&#20010;&#20154;&#31867;&#20915;&#31574;&#32773;&#30340;&#34920;&#29616;&#19982;&#26426;&#22120;&#39044;&#27979;&#36827;&#34892;&#22522;&#20934;&#27979;&#35797;&#65307;&#28982;&#21518;&#29992;&#25152;&#25552;&#20986;&#30340;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#30340;&#24314;&#35758;&#26367;&#25442;&#20915;&#31574;&#21046;&#23450;&#32773;&#30340;&#19968;&#20010;&#23376;&#38598;&#25152;&#20570;&#20986;&#30340;&#20915;&#31574;&#12290;&#21033;&#29992;&#20840;&#22269;&#22823;&#22411;&#23381;&#20135;&#32467;&#26524;&#21644;&#32321;&#27542;&#24180;&#40836;&#22827;&#22919;&#23381;&#21069;&#26816;&#26597;&#30340;&#21307;&#29983;&#35786;&#26029;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#35797;&#39564;&#20102;&#19968;&#31181;&#21551;&#21457;&#24335;&#39640;&#39057;&#29575;&#26041;&#27861;&#20197;&#21450;&#19968;&#31181;&#36125;&#21494;&#26031;&#21518;&#39564;&#25439;&#22833;&#20989;&#25968;&#26041;&#27861;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#24322;&#24120;&#20986;&#29983;&#26816;&#27979;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#22312;&#19968;&#20010;&#27979;&#35797;&#25968;&#25454;&#38598;&#19978;&#30340;&#32467;&#26524;&#27604;&#20165;&#30001;&#21307;&#29983;&#35786;&#26029;&#30340;&#32467;&#26524;&#20855;&#26377;&#26356;&#39640;&#30340;&#24635;&#20307;&#30495;&#38451;&#24615;&#29575;&#21644;&#26356;&#20302;&#30340;&#20551;&#38451;&#24615;&#29575;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#26469;&#33258;&#20892;&#26449;&#22320;&#21306;&#30340;&#21307;&#29983;&#30340;&#35786;&#26029;&#26356;&#23481;&#26131;&#34987;&#26367;&#20195;&#65292;&#36825;&#34920;&#26126;&#20154;&#24037;&#26234;&#33021;&#36741;&#21161;&#20915;&#31574;&#21046;&#23450;&#26356;&#23481;&#26131;&#25552;&#39640;&#31934;&#30830;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a statistical framework with which artificial intelligence can improve human decision making. The performance of each human decision maker is first benchmarked against machine predictions; we then replace the decisions made by a subset of the decision makers with the recommendation from the proposed artificial intelligence algorithm. Using a large nationwide dataset of pregnancy outcomes and doctor diagnoses from prepregnancy checkups of reproductive age couples, we experimented with both a heuristic frequentist approach and a Bayesian posterior loss function approach with an application to abnormal birth detection. We find that our algorithm on a test dataset results in a higher overall true positive rate and a lower false positive rate than the diagnoses made by doctors only. We also find that the diagnoses of doctors from rural areas are more frequently replaceable, suggesting that artificial intelligence assisted decision making tends to improve precision more i
&lt;/p&gt;</description></item></channel></rss>