<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24212;&#29992;&#27010;&#29575;&#22270;&#27169;&#22411;&#36827;&#34892;&#36870;&#21521;&#25512;&#29702;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20998;&#26512;&#31038;&#20250;&#29983;&#24577;&#31995;&#32479;&#12290;&#23454;&#39564;&#25968;&#25454;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#26041;&#27861;&#33021;&#22815;&#39044;&#27979;&#29983;&#24577;&#31995;&#32479;&#23545;&#20551;&#35774;&#24178;&#39044;&#30340;&#21709;&#24212;&#65292;&#24182;&#30830;&#23450;&#21464;&#37327;&#20043;&#38388;&#30340;&#24433;&#21709;&#12290;&#36825;&#19968;&#26041;&#27861;&#20026;&#22810;&#20010;&#39046;&#22495;&#30340;&#19987;&#23478;&#25552;&#20379;&#20102;&#30452;&#35266;&#26131;&#25026;&#30340;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2401.10101</link><description>&lt;p&gt;
&#29992;&#27010;&#29575;&#22270;&#27169;&#22411;&#36827;&#34892;&#36870;&#21521;&#25512;&#29702;&#20197;&#20998;&#26512;&#31038;&#20250;&#29983;&#24577;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Counterfactual Reasoning with Probabilistic Graphical Models for Analyzing Socioecological Systems. (arXiv:2401.10101v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10101
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24212;&#29992;&#27010;&#29575;&#22270;&#27169;&#22411;&#36827;&#34892;&#36870;&#21521;&#25512;&#29702;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20998;&#26512;&#31038;&#20250;&#29983;&#24577;&#31995;&#32479;&#12290;&#23454;&#39564;&#25968;&#25454;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#26041;&#27861;&#33021;&#22815;&#39044;&#27979;&#29983;&#24577;&#31995;&#32479;&#23545;&#20551;&#35774;&#24178;&#39044;&#30340;&#21709;&#24212;&#65292;&#24182;&#30830;&#23450;&#21464;&#37327;&#20043;&#38388;&#30340;&#24433;&#21709;&#12290;&#36825;&#19968;&#26041;&#27861;&#20026;&#22810;&#20010;&#39046;&#22495;&#30340;&#19987;&#23478;&#25552;&#20379;&#20102;&#30452;&#35266;&#26131;&#25026;&#30340;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22240;&#26524;&#21644;&#36870;&#21521;&#25512;&#29702;&#26159;&#25968;&#25454;&#31185;&#23398;&#20013;&#26032;&#20852;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#35753;&#25105;&#20204;&#25512;&#26029;&#20986;&#20551;&#35774;&#24773;&#26223;&#12290;&#22312;&#23454;&#39564;&#25968;&#25454;&#36890;&#24120;&#19981;&#21487;&#29992;&#30340;&#39046;&#22495;&#65292;&#36825;&#23588;&#20854;&#26377;&#29992;&#12290;&#22312;&#29615;&#22659;&#21644;&#29983;&#24577;&#31185;&#23398;&#39046;&#22495;&#65292;&#22240;&#26524;&#24615;&#20351;&#25105;&#20204;&#33021;&#22815;&#39044;&#27979;&#29983;&#24577;&#31995;&#32479;&#23545;&#20551;&#35774;&#24178;&#39044;&#30340;&#21709;&#24212;&#12290;&#32467;&#26500;&#24615;&#22240;&#26524;&#27169;&#22411;&#26159;&#19968;&#31181;&#29992;&#20110;&#22240;&#26524;&#24615;&#30340;&#27010;&#29575;&#22270;&#27169;&#22411;&#31867;&#21035;&#65292;&#30001;&#20110;&#20854;&#30452;&#35266;&#30340;&#29305;&#24615;&#65292;&#22810;&#20010;&#39046;&#22495;&#30340;&#19987;&#23478;&#21487;&#20197;&#36731;&#26494;&#29702;&#35299;&#12290;&#28982;&#32780;&#65292;&#26576;&#20123;&#26597;&#35810;&#65292;&#31216;&#20026;&#19981;&#21487;&#36777;&#35782;&#30340;&#26597;&#35810;&#65292;&#26080;&#27861;&#20197;&#31934;&#30830;&#30340;&#26041;&#24335;&#35745;&#31639;&#12290;&#26412;&#25991;&#25552;&#20986;&#24212;&#29992;&#19968;&#31181;&#26032;&#39062;&#12289;&#26368;&#36817;&#30340;&#25216;&#26415;&#26469;&#30028;&#23450;&#31038;&#20250;&#29983;&#24577;&#31995;&#32479;&#39046;&#22495;&#20869;&#30340;&#19981;&#21487;&#36777;&#35782;&#26597;&#35810;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#20256;&#32479;&#30340;&#32479;&#35745;&#20998;&#26512;&#65292;&#21253;&#25324;&#27010;&#29575;&#22270;&#27169;&#22411;&#65292;&#21487;&#20197;&#30830;&#23450;&#21464;&#37327;&#20043;&#38388;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#26080;&#27861;&#25552;&#20379;&#20851;&#20110;&#21464;&#37327;&#20043;&#38388;&#30340;&#22240;&#26524;&#20851;&#31995;&#30340;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
Causal and counterfactual reasoning are emerging directions in data science that allow us to reason about hypothetical scenarios. This is particularly useful in domains where experimental data are usually not available. In the context of environmental and ecological sciences, causality enables us, for example, to predict how an ecosystem would respond to hypothetical interventions. A structural causal model is a class of probabilistic graphical models for causality, which, due to its intuitive nature, can be easily understood by experts in multiple fields. However, certain queries, called unidentifiable, cannot be calculated in an exact and precise manner. This paper proposes applying a novel and recent technique for bounding unidentifiable queries within the domain of socioecological systems. Our findings indicate that traditional statistical analysis, including probabilistic graphical models, can identify the influence between variables. However, such methods do not offer insights in
&lt;/p&gt;</description></item></channel></rss>