<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#20307;&#26041;&#27861;&#26469;&#24418;&#25104;&#21453;&#20107;&#23454;&#35299;&#37322;&#65292;&#36890;&#36807;&#21033;&#29992;&#20010;&#20307;&#30340;&#24403;&#21069;&#23494;&#24230;&#26469;&#25351;&#23548;&#25512;&#33616;&#30340;&#34892;&#21160;&#65292;&#35299;&#20915;&#20102;&#20010;&#20307;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#30340;&#26032;&#30340;&#31454;&#20105;&#21644;&#24847;&#24819;&#19981;&#21040;&#30340;&#25104;&#26412;&#38382;&#39064;&#65292;&#24182;&#25913;&#36827;&#20102;&#32463;&#20856;&#21453;&#20107;&#23454;&#35299;&#37322;&#30340;&#26399;&#26395;&#12290;</title><link>https://arxiv.org/abs/2402.04579</link><description>&lt;p&gt;
&#36890;&#36807;&#26368;&#20248;&#20256;&#36755;&#23454;&#29616;&#38598;&#20307;&#21453;&#20107;&#23454;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Collective Counterfactual Explanations via Optimal Transport
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04579
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#20307;&#26041;&#27861;&#26469;&#24418;&#25104;&#21453;&#20107;&#23454;&#35299;&#37322;&#65292;&#36890;&#36807;&#21033;&#29992;&#20010;&#20307;&#30340;&#24403;&#21069;&#23494;&#24230;&#26469;&#25351;&#23548;&#25512;&#33616;&#30340;&#34892;&#21160;&#65292;&#35299;&#20915;&#20102;&#20010;&#20307;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#30340;&#26032;&#30340;&#31454;&#20105;&#21644;&#24847;&#24819;&#19981;&#21040;&#30340;&#25104;&#26412;&#38382;&#39064;&#65292;&#24182;&#25913;&#36827;&#20102;&#32463;&#20856;&#21453;&#20107;&#23454;&#35299;&#37322;&#30340;&#26399;&#26395;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21453;&#20107;&#23454;&#35299;&#37322;&#25552;&#20379;&#20010;&#20307;&#30340;&#25104;&#26412;&#26368;&#20248;&#34892;&#21160;&#65292;&#20197;&#25913;&#21464;&#26631;&#31614;&#20026;&#25152;&#38656;&#30340;&#31867;&#21035;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#22823;&#37327;&#23454;&#20363;&#23547;&#27714;&#29366;&#24577;&#20462;&#25913;&#65292;&#36825;&#31181;&#20010;&#20307;&#20026;&#20013;&#24515;&#30340;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#26032;&#30340;&#31454;&#20105;&#21644;&#24847;&#24819;&#19981;&#21040;&#30340;&#25104;&#26412;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#25512;&#33616;&#24573;&#35270;&#20102;&#22522;&#30784;&#25968;&#25454;&#20998;&#24067;&#65292;&#21487;&#33021;&#20250;&#24314;&#35758;&#29992;&#25143;&#35748;&#20026;&#26159;&#24322;&#24120;&#20540;&#30340;&#34892;&#21160;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#20307;&#26041;&#27861;&#26469;&#24418;&#25104;&#21453;&#20107;&#23454;&#35299;&#37322;&#65292;&#37325;&#28857;&#26159;&#21033;&#29992;&#20010;&#20307;&#30340;&#24403;&#21069;&#23494;&#24230;&#26469;&#25351;&#23548;&#25512;&#33616;&#30340;&#34892;&#21160;&#12290;&#25105;&#20204;&#30340;&#38382;&#39064;&#33258;&#28982;&#22320;&#36716;&#21270;&#20026;&#19968;&#20010;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#12290;&#20511;&#37492;&#26368;&#20248;&#20256;&#36755;&#30340;&#24191;&#27867;&#25991;&#29486;&#65292;&#25105;&#20204;&#35828;&#26126;&#20102;&#36825;&#31181;&#38598;&#20307;&#26041;&#27861;&#22914;&#20309;&#25913;&#36827;&#32463;&#20856;&#21453;&#20107;&#23454;&#35299;&#37322;&#30340;&#26399;&#26395;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#25903;&#25345;&#25105;&#20204;&#30340;&#25552;&#35758;&#65292;&#23637;&#31034;&#20102;&#25152;&#25552;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#20197;&#21450;&#19982;&#32463;&#20856;&#26041;&#27861;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Counterfactual explanations provide individuals with cost-optimal actions that can alter their labels to desired classes. However, if substantial instances seek state modification, such individual-centric methods can lead to new competitions and unanticipated costs. Furthermore, these recommendations, disregarding the underlying data distribution, may suggest actions that users perceive as outliers. To address these issues, our work proposes a collective approach for formulating counterfactual explanations, with an emphasis on utilizing the current density of the individuals to inform the recommended actions. Our problem naturally casts as an optimal transport problem. Leveraging the extensive literature on optimal transport, we illustrate how this collective method improves upon the desiderata of classical counterfactual explanations. We support our proposal with numerical simulations, illustrating the effectiveness of the proposed approach and its relation to classic methods.
&lt;/p&gt;</description></item></channel></rss>