<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>MDI+&#26159;&#19968;&#31181;&#28789;&#27963;&#30340;&#22522;&#20110;&#38543;&#26426;&#26862;&#26519;&#30340;&#29305;&#24449;&#37325;&#35201;&#24615;&#26694;&#26550;&#65292;&#36890;&#36807;&#26367;&#25442;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#21644;&#24230;&#37327;&#65292;&#21033;&#29992;&#27491;&#21017;&#21270;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#21644;&#26356;&#36866;&#21512;&#25968;&#25454;&#32467;&#26500;&#30340;&#24230;&#37327;&#26469;&#25512;&#24191;MDI&#12290;&#27492;&#22806;&#65292;MDI+&#36824;&#24341;&#20837;&#20102;&#20854;&#20182;&#29305;&#24449;&#26469;&#20943;&#36731;&#20915;&#31574;&#26641;&#23545;&#21152;&#27861;&#25110;&#24179;&#28369;&#27169;&#22411;&#30340;&#24050;&#30693;&#20559;&#24046;&#12290;</title><link>http://arxiv.org/abs/2307.01932</link><description>&lt;p&gt;
MDI+:&#19968;&#31181;&#28789;&#27963;&#30340;&#22522;&#20110;&#38543;&#26426;&#26862;&#26519;&#30340;&#29305;&#24449;&#37325;&#35201;&#24615;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
MDI+: A Flexible Random Forest-Based Feature Importance Framework. (arXiv:2307.01932v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01932
&lt;/p&gt;
&lt;p&gt;
MDI+&#26159;&#19968;&#31181;&#28789;&#27963;&#30340;&#22522;&#20110;&#38543;&#26426;&#26862;&#26519;&#30340;&#29305;&#24449;&#37325;&#35201;&#24615;&#26694;&#26550;&#65292;&#36890;&#36807;&#26367;&#25442;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#21644;&#24230;&#37327;&#65292;&#21033;&#29992;&#27491;&#21017;&#21270;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#21644;&#26356;&#36866;&#21512;&#25968;&#25454;&#32467;&#26500;&#30340;&#24230;&#37327;&#26469;&#25512;&#24191;MDI&#12290;&#27492;&#22806;&#65292;MDI+&#36824;&#24341;&#20837;&#20102;&#20854;&#20182;&#29305;&#24449;&#26469;&#20943;&#36731;&#20915;&#31574;&#26641;&#23545;&#21152;&#27861;&#25110;&#24179;&#28369;&#27169;&#22411;&#30340;&#24050;&#30693;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20197;&#19981;&#32431;&#24230;&#20943;&#23569;&#30340;&#24179;&#22343;&#20540;(MDI)&#26159;&#38543;&#26426;&#26862;&#26519;(RF)&#20013;&#19968;&#31181;&#27969;&#34892;&#30340;&#29305;&#24449;&#37325;&#35201;&#24615;&#35780;&#20272;&#26041;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;RF&#20013;&#27599;&#20010;&#26641;&#30340;&#29305;&#24449;$X_k$&#30340;MDI&#31561;&#20215;&#20110;&#21709;&#24212;&#21464;&#37327;&#22312;&#20915;&#31574;&#26641;&#38598;&#21512;&#19978;&#30340;&#32447;&#24615;&#22238;&#24402;&#30340;&#26410;&#24402;&#19968;&#21270;$R^2$&#20540;&#12290;&#25105;&#20204;&#21033;&#29992;&#36825;&#31181;&#35299;&#37322;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#29305;&#24449;&#37325;&#35201;&#24615;&#26694;&#26550;MDI+&#65292;MDI+&#36890;&#36807;&#20801;&#35768;&#20998;&#26512;&#20154;&#21592;&#23558;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#21644;$R^2$&#24230;&#37327;&#26367;&#25442;&#20026;&#27491;&#21017;&#21270;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;(GLM)&#21644;&#26356;&#36866;&#21512;&#32473;&#23450;&#25968;&#25454;&#32467;&#26500;&#30340;&#24230;&#37327;&#26469;&#25512;&#24191;MDI&#12290;&#27492;&#22806;&#65292;MDI+&#36824;&#24341;&#20837;&#20102;&#20854;&#20182;&#29305;&#24449;&#26469;&#20943;&#36731;&#20915;&#31574;&#26641;&#23545;&#21152;&#27861;&#25110;&#24179;&#28369;&#27169;&#22411;&#30340;&#24050;&#30693;&#20559;&#24046;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20379;&#20102;&#20851;&#20110;&#22914;&#20309;&#22522;&#20110;&#21487;&#39044;&#27979;&#24615;&#12289;&#21487;&#35745;&#31639;&#24615;&#21644;&#31283;&#23450;&#24615;&#26694;&#26550;&#36873;&#25321;&#36866;&#24403;&#30340;GLM&#21644;&#24230;&#37327;&#30340;&#25351;&#23548;&#65292;&#20197;&#36827;&#34892;&#30495;&#23454;&#25968;&#25454;&#31185;&#23398;&#30740;&#31350;&#12290;&#22823;&#37327;&#22522;&#20110;&#25968;&#25454;&#30340;&#27169;&#25311;&#32467;&#26524;&#26174;&#31034;&#65292;MDI+&#22312;&#24615;&#33021;&#19978;&#26174;&#33879;&#20248;&#20110;&#20256;&#32479;&#30340;MDI&#12290;
&lt;/p&gt;
&lt;p&gt;
Mean decrease in impurity (MDI) is a popular feature importance measure for random forests (RFs). We show that the MDI for a feature $X_k$ in each tree in an RF is equivalent to the unnormalized $R^2$ value in a linear regression of the response on the collection of decision stumps that split on $X_k$. We use this interpretation to propose a flexible feature importance framework called MDI+. Specifically, MDI+ generalizes MDI by allowing the analyst to replace the linear regression model and $R^2$ metric with regularized generalized linear models (GLMs) and metrics better suited for the given data structure. Moreover, MDI+ incorporates additional features to mitigate known biases of decision trees against additive or smooth models. We further provide guidance on how practitioners can choose an appropriate GLM and metric based upon the Predictability, Computability, Stability framework for veridical data science. Extensive data-inspired simulations show that MDI+ significantly outperfor
&lt;/p&gt;</description></item></channel></rss>