<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#35780;&#20272;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#27835;&#30103;&#32452;&#21644;&#23545;&#29031;&#32452;&#32467;&#26524;&#30340;&#20998;&#20301;&#25968;&#33539;&#22260;&#65292;&#21363;&#20351;&#24179;&#22343;&#25928;&#26524;&#19981;&#26174;&#33879;&#65292;&#20063;&#21487;&#20197;&#25552;&#20379;&#26377;&#29992;&#30340;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2306.15048</link><description>&lt;p&gt;
&#35780;&#20272;&#27835;&#30103;&#25928;&#26524;&#30340;&#24322;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Assessing Heterogeneity of Treatment Effects. (arXiv:2306.15048v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15048
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#35780;&#20272;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#27835;&#30103;&#32452;&#21644;&#23545;&#29031;&#32452;&#32467;&#26524;&#30340;&#20998;&#20301;&#25968;&#33539;&#22260;&#65292;&#21363;&#20351;&#24179;&#22343;&#25928;&#26524;&#19981;&#26174;&#33879;&#65292;&#20063;&#21487;&#20197;&#25552;&#20379;&#26377;&#29992;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#26524;&#22312;&#32463;&#27982;&#23398;&#20013;&#38750;&#24120;&#37325;&#35201;&#65292;&#20294;&#26159;&#20854;&#35780;&#20272;&#24120;&#24120;&#21463;&#21040;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#26080;&#27861;&#30830;&#23450;&#30340;&#22256;&#25200;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#21487;&#33021;&#24076;&#26395;&#35780;&#20272;&#20445;&#38505;&#23545;&#26412;&#26469;&#19981;&#20581;&#24247;&#30340;&#20154;&#30340;&#20581;&#24247;&#24433;&#21709;&#65292;&#20294;&#26159;&#21482;&#32473;&#19981;&#20581;&#24247;&#30340;&#20154;&#20080;&#20445;&#38505;&#26159;&#19981;&#21487;&#34892;&#30340;&#65292;&#22240;&#27492;&#36825;&#20123;&#20154;&#30340;&#22240;&#26524;&#25928;&#24212;&#26080;&#27861;&#30830;&#23450;&#12290;&#21448;&#25110;&#32773;&#65292;&#25105;&#20204;&#21487;&#33021;&#23545;&#26368;&#20302;&#24037;&#36164;&#19978;&#28072;&#20013;&#36194;&#23478;&#30340;&#20221;&#39069;&#24863;&#20852;&#36259;&#65292;&#20294;&#26159;&#22312;&#27809;&#26377;&#35266;&#23519;&#21040;&#21453;&#20107;&#23454;&#30340;&#24773;&#20917;&#19979;&#65292;&#36194;&#23478;&#20063;&#26080;&#27861;&#30830;&#23450;&#12290;&#36825;&#31181;&#24322;&#36136;&#24615;&#24120;&#24120;&#36890;&#36807;&#20998;&#20301;&#25968;&#27835;&#30103;&#25928;&#26524;&#26469;&#35780;&#20272;&#65292;&#20294;&#20854;&#35299;&#37322;&#24182;&#19981;&#28165;&#26224;&#65292;&#32467;&#35770;&#26377;&#26102;&#20063;&#19981;&#19968;&#33268;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36890;&#36807;&#27835;&#30103;&#32452;&#21644;&#23545;&#29031;&#32452;&#32467;&#26524;&#30340;&#20998;&#20301;&#25968;&#65292;&#36825;&#20123;&#25968;&#20540;&#33539;&#22260;&#26159;&#21487;&#20197;&#30830;&#23450;&#30340;&#65292;&#21363;&#20351;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#24182;&#19981;&#26174;&#33879;&#65292;&#23427;&#20204;&#20173;&#28982;&#21487;&#20197;&#25552;&#20379;&#26377;&#29992;&#20449;&#24687;&#12290;&#20004;&#20010;&#24212;&#29992;&#23454;&#20363;&#23637;&#31034;&#20102;&#36825;&#20123;&#33539;&#22260;&#22914;&#20309;&#24110;&#21161;&#25105;&#20204;&#20102;&#35299;&#27835;&#30103;&#25928;&#26524;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Treatment effect heterogeneity is of major interest in economics, but its assessment is often hindered by the fundamental lack of identification of the individual treatment effects. For example, we may want to assess the effect of insurance on the health of otherwise unhealthy individuals, but it is infeasible to insure only the unhealthy, and thus the causal effects for those are not identified. Or, we may be interested in the shares of winners from a minimum wage increase, while without observing the counterfactual, the winners are not identified. Such heterogeneity is often assessed by quantile treatment effects, which do not come with clear interpretation and the takeaway can sometimes be equivocal. We show that, with the quantiles of the treated and control outcomes, the ranges of these quantities are identified and can be informative even when the average treatment effects are not significant. Two applications illustrate how these ranges can inform us about heterogeneity of the t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32593;&#32476;&#32467;&#26500;&#30340;&#23616;&#37096;&#33258;&#36866;&#24212;&#32467;&#26500;&#23398;&#20064;&#31639;&#27861;&#65292;&#21487;&#23558;LD&#32593;&#32476;&#25968;&#25454;&#21644;&#22810;&#20010;&#26679;&#26412;&#30340;&#36741;&#21161;&#25968;&#25454;&#25972;&#21512;&#36215;&#26469;&#65292;&#36890;&#36807;&#25968;&#25454;&#39537;&#21160;&#30340;&#26435;&#37325;&#20998;&#37197;&#26041;&#27861;&#23454;&#29616;&#23545;&#22810;&#37325;&#26816;&#39564;&#30340;&#25511;&#21046;&#65292;&#24182;&#22312;&#32593;&#32476;&#25968;&#25454;&#20855;&#26377;&#20449;&#24687;&#37327;&#26102;&#20855;&#26377;&#26356;&#39640;&#30340;&#21151;&#25928;&#12290;</title><link>http://arxiv.org/abs/2203.11461</link><description>&lt;p&gt;
&#22522;&#20110;&#32593;&#32476;&#32467;&#26500;&#30340;&#23616;&#37096;&#33258;&#36866;&#24212;&#22810;&#37325;&#26816;&#39564;&#31639;&#27861;&#65292;&#21450;&#20854;&#22312;&#20840;&#22522;&#22240;&#32452;&#20851;&#32852;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Locally Adaptive Algorithms for Multiple Testing with Network Structure, with Application to Genome-Wide Association Studies. (arXiv:2203.11461v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.11461
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32593;&#32476;&#32467;&#26500;&#30340;&#23616;&#37096;&#33258;&#36866;&#24212;&#32467;&#26500;&#23398;&#20064;&#31639;&#27861;&#65292;&#21487;&#23558;LD&#32593;&#32476;&#25968;&#25454;&#21644;&#22810;&#20010;&#26679;&#26412;&#30340;&#36741;&#21161;&#25968;&#25454;&#25972;&#21512;&#36215;&#26469;&#65292;&#36890;&#36807;&#25968;&#25454;&#39537;&#21160;&#30340;&#26435;&#37325;&#20998;&#37197;&#26041;&#27861;&#23454;&#29616;&#23545;&#22810;&#37325;&#26816;&#39564;&#30340;&#25511;&#21046;&#65292;&#24182;&#22312;&#32593;&#32476;&#25968;&#25454;&#20855;&#26377;&#20449;&#24687;&#37327;&#26102;&#20855;&#26377;&#26356;&#39640;&#30340;&#21151;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38142;&#25509;&#20998;&#26512;&#22312;&#20840;&#22522;&#22240;&#32452;&#20851;&#32852;&#30740;&#31350;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#29305;&#21035;&#26159;&#22312;&#25581;&#31034;&#19982;&#30142;&#30149;&#34920;&#22411;&#30456;&#20851;&#30340;&#36830;&#38145;&#19981;&#24179;&#34913;&#65288;LD&#65289;&#30340;SNP&#20849;&#21516;&#24433;&#21709;&#26041;&#38754;&#12290;&#28982;&#32780;&#65292;LD&#32593;&#32476;&#25968;&#25454;&#30340;&#28508;&#21147;&#22312;&#25991;&#29486;&#20013;&#24448;&#24448;&#34987;&#24573;&#35270;&#25110;&#26410;&#20805;&#20998;&#21033;&#29992;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23616;&#37096;&#33258;&#36866;&#24212;&#32467;&#26500;&#23398;&#20064;&#31639;&#27861;&#65288;LASLA&#65289;&#65292;&#20026;&#25972;&#21512;&#32593;&#32476;&#25968;&#25454;&#25110;&#26469;&#33258;&#30456;&#20851;&#28304;&#22495;&#30340;&#22810;&#20010;&#26679;&#26412;&#30340;&#36741;&#21161;&#25968;&#25454;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#21407;&#21017;&#19988;&#36890;&#29992;&#30340;&#26694;&#26550;&#65307;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#30340;&#32500;&#24230;/&#32467;&#26500;&#21644;&#19981;&#21516;&#30340;&#20154;&#32676;&#12290;LASLA&#37319;&#29992;$p$&#20540;&#21152;&#26435;&#26041;&#27861;&#65292;&#21033;&#29992;&#32467;&#26500;&#27934;&#23519;&#21147;&#20026;&#21508;&#20010;&#26816;&#39564;&#28857;&#20998;&#37197;&#25968;&#25454;&#39537;&#21160;&#30340;&#26435;&#37325;&#12290;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;&#24403;&#20027;&#35201;&#32479;&#35745;&#37327;&#29420;&#31435;&#25110;&#24369;&#30456;&#20851;&#26102;&#65292;LASLA&#21487;&#20197;&#28176;&#36817;&#22320;&#25511;&#21046;FDR&#65292;&#24182;&#22312;&#32593;&#32476;&#25968;&#25454;&#20855;&#26377;&#20449;&#24687;&#37327;&#26102;&#23454;&#29616;&#26356;&#39640;&#30340;&#21151;&#25928;&#12290;&#36890;&#36807;&#21508;&#31181;&#21512;&#25104;&#23454;&#39564;&#21644;&#19968;&#20010;&#24212;&#29992;&#26696;&#20363;&#65292;&#23637;&#31034;&#20102;LASLA&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Linkage analysis has provided valuable insights to the GWAS studies, particularly in revealing that SNPs in linkage disequilibrium (LD) can jointly influence disease phenotypes. However, the potential of LD network data has often been overlooked or underutilized in the literature. In this paper, we propose a locally adaptive structure learning algorithm (LASLA) that provides a principled and generic framework for incorporating network data or multiple samples of auxiliary data from related source domains; possibly in different dimensions/structures and from diverse populations. LASLA employs a $p$-value weighting approach, utilizing structural insights to assign data-driven weights to individual test points. Theoretical analysis shows that LASLA can asymptotically control FDR with independent or weakly dependent primary statistics, and achieve higher power when the network data is informative. Efficiency again of LASLA is illustrated through various synthetic experiments and an applica
&lt;/p&gt;</description></item></channel></rss>