<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#32437;&#21521;&#26367;&#20195;&#26694;&#26550;&#65292;&#29992;&#20110;&#20934;&#30830;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#30340;&#25928;&#26524;&#12290;&#35770;&#25991;&#36890;&#36807;&#20998;&#35299;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#20026;&#19968;&#31995;&#21015;&#20989;&#25968;&#65292;&#32771;&#34385;&#29992;&#25143;&#23646;&#24615;&#12289;&#30701;&#26399;&#20013;&#38388;&#25351;&#26631;&#21644;&#27835;&#30103;&#20998;&#37197;&#31561;&#22240;&#32032;&#12290;</title><link>http://arxiv.org/abs/2308.08152</link><description>&lt;p&gt;
&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Estimating Effects of Long-Term Treatments. (arXiv:2308.08152v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08152
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#32437;&#21521;&#26367;&#20195;&#26694;&#26550;&#65292;&#29992;&#20110;&#20934;&#30830;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#30340;&#25928;&#26524;&#12290;&#35770;&#25991;&#36890;&#36807;&#20998;&#35299;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#20026;&#19968;&#31995;&#21015;&#20989;&#25968;&#65292;&#32771;&#34385;&#29992;&#25143;&#23646;&#24615;&#12289;&#30701;&#26399;&#20013;&#38388;&#25351;&#26631;&#21644;&#27835;&#30103;&#20998;&#37197;&#31561;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;A/B&#27979;&#35797;&#20013;&#65292;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#30340;&#25928;&#26524;&#26159;&#19968;&#20010;&#24040;&#22823;&#30340;&#25361;&#25112;&#12290;&#36825;&#31181;&#27835;&#30103;&#25514;&#26045;&#21253;&#25324;&#20135;&#21697;&#21151;&#33021;&#30340;&#26356;&#26032;&#12289;&#29992;&#25143;&#30028;&#38754;&#35774;&#35745;&#21644;&#25512;&#33616;&#31639;&#27861;&#31561;&#65292;&#26088;&#22312;&#22312;&#20854;&#21457;&#24067;&#21518;&#38271;&#26399;&#23384;&#22312;&#31995;&#32479;&#20013;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#38271;&#26399;&#35797;&#39564;&#30340;&#38480;&#21046;&#65292;&#20174;&#19994;&#32773;&#36890;&#24120;&#20381;&#36182;&#30701;&#26399;&#23454;&#39564;&#32467;&#26524;&#26469;&#20570;&#20135;&#21697;&#21457;&#24067;&#20915;&#31574;&#12290;&#22914;&#20309;&#20351;&#29992;&#30701;&#26399;&#23454;&#39564;&#25968;&#25454;&#20934;&#30830;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#32437;&#21521;&#26367;&#20195;&#26694;&#26550;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#65292;&#22312;&#26631;&#20934;&#20551;&#35774;&#19979;&#65292;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#21487;&#20197;&#20998;&#35299;&#20026;&#19968;&#31995;&#21015;&#20989;&#25968;&#65292;&#36825;&#20123;&#20989;&#25968;&#20381;&#36182;&#20110;&#29992;&#25143;&#23646;&#24615;&#12289;&#30701;&#26399;&#20013;&#38388;&#25351;&#26631;&#21644;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#25551;&#36848;&#20102;&#35782;&#21035;&#20551;&#35774;&#12289;&#20272;&#35745;&#31574;&#30053;&#21644;&#25512;&#29702;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimating the effects of long-term treatments in A/B testing presents a significant challenge. Such treatments -- including updates to product functions, user interface designs, and recommendation algorithms -- are intended to remain in the system for a long period after their launches. On the other hand, given the constraints of conducting long-term experiments, practitioners often rely on short-term experimental results to make product launch decisions. It remains an open question how to accurately estimate the effects of long-term treatments using short-term experimental data. To address this question, we introduce a longitudinal surrogate framework. We show that, under standard assumptions, the effects of long-term treatments can be decomposed into a series of functions, which depend on the user attributes, the short-term intermediate metrics, and the treatment assignments. We describe the identification assumptions, the estimation strategies, and the inference technique under thi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#65292;&#30740;&#31350;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2211.07823</link><description>&lt;p&gt;
&#20351;&#29992;&#32593;&#32476;&#24178;&#25200;&#36827;&#34892;&#26080;&#20559;&#24615;&#20272;&#35745;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Unconfoundedness with Network Interference. (arXiv:2211.07823v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.07823
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#65292;&#30740;&#31350;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#26469;&#33258;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#23545;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#24178;&#25200;&#38543;&#30528;&#32593;&#32476;&#36317;&#31163;&#30340;&#22686;&#21152;&#32780;&#34928;&#20943;&#65292;&#36825;&#20801;&#35768;&#23545;&#32467;&#26524;&#21644;&#27835;&#30103;&#36873;&#25321;&#30340;&#21516;&#20276;&#24433;&#21709;&#36827;&#34892;&#24314;&#27169;&#12290;&#22312;&#36825;&#20010;&#27169;&#22411;&#19979;&#65292;&#24635;&#32593;&#32476;&#21644;&#25152;&#26377;&#21333;&#20301;&#30340;&#21327;&#21464;&#37327;&#26500;&#25104;&#20102;&#28151;&#28102;&#30340;&#26469;&#28304;&#65292;&#19982;&#29616;&#26377;&#24037;&#20316;&#19981;&#21516;&#30340;&#26159;&#65292;&#29616;&#26377;&#24037;&#20316;&#20551;&#35774;&#28151;&#28102;&#21487;&#20197;&#30001;&#36825;&#20123;&#23545;&#35937;&#30340;&#24050;&#30693;&#20302;&#32500;&#20989;&#25968;&#24635;&#32467;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#20272;&#35745;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#37327;&#30340;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#36817;&#20284;&#31232;&#30095;&#30340;&#32593;&#32476;&#31867;&#27604;&#65292;&#20197;&#35777;&#26126;&#20351;&#29992;&#27973;&#23618;&#32467;&#26500;&#30340;&#21512;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies nonparametric estimation of treatment and spillover effects using observational data from a single large network. We consider a model in which interference decays with network distance, which allows for peer influence in both outcomes and selection into treatment. Under this model, the total network and covariates of all units constitute sources of confounding, in contrast to existing work that assumes confounding can be summarized by a known, low-dimensional function of these objects. We propose to use graph neural networks to estimate the high-dimensional nuisance functions of a doubly robust estimator. We establish a network analog of approximate sparsity to justify the use of shallow architectures.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#23398;&#26657;&#20998;&#37197;&#20013;&#30340;&#38750;&#21442;&#25968;&#21270;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#21644;&#20272;&#35745;&#26041;&#27861;&#65292;&#36890;&#36807;&#35782;&#21035;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#65292;&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#21644;&#25277;&#31614;&#39537;&#21160;&#30340;&#21464;&#24322;&#19979;&#30340;&#23398;&#26657;&#36873;&#25321;&#30340;&#24322;&#36136;&#24615;&#21644;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2112.03872</link><description>&lt;p&gt;
&#23398;&#26657;&#36873;&#25321;&#20013;&#30340;&#38750;&#21442;&#25968;&#21270;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Treatment Effect Identification in School Choice. (arXiv:2112.03872v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.03872
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#23398;&#26657;&#20998;&#37197;&#20013;&#30340;&#38750;&#21442;&#25968;&#21270;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#21644;&#20272;&#35745;&#26041;&#27861;&#65292;&#36890;&#36807;&#35782;&#21035;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#65292;&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#21644;&#25277;&#31614;&#39537;&#21160;&#30340;&#21464;&#24322;&#19979;&#30340;&#23398;&#26657;&#36873;&#25321;&#30340;&#24322;&#36136;&#24615;&#21644;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#38598;&#20013;&#23398;&#26657;&#20998;&#37197;&#20013;&#22240;&#26524;&#25928;&#24212;&#30340;&#38750;&#21442;&#25968;&#21270;&#35782;&#21035;&#21644;&#20272;&#35745;&#12290;&#22312;&#35768;&#22810;&#38598;&#20013;&#20998;&#37197;&#35774;&#32622;&#20013;&#65292;&#23398;&#29983;&#26082;&#21463;&#21040;&#25277;&#31614;&#39537;&#21160;&#30340;&#21464;&#24322;&#65292;&#20063;&#21463;&#21040;&#22238;&#24402;&#19981;&#36830;&#32493;&#65288;RD&#65289;&#39537;&#21160;&#30340;&#21464;&#24322;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#34987;&#35782;&#21035;&#30340;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#65288;aTEs&#65289;&#30340;&#23436;&#25972;&#38598;&#21512;&#65292;&#23450;&#20041;&#20026;&#22312;&#32473;&#23450;&#23398;&#29983;&#29305;&#24449;&#26102;&#65292;&#19968;&#23545;&#23398;&#26657;&#20043;&#38388;&#30340;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#12290;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#26159;&#27835;&#30103;&#23545;&#27604;&#30340;&#22522;&#30784;&#65292;&#24120;&#35265;&#30340;&#20272;&#35745;&#26041;&#27861;&#20250;&#25513;&#30422;&#37325;&#35201;&#30340;&#24322;&#36136;&#24615;&#12290;&#29305;&#21035;&#22320;&#65292;&#35768;&#22810;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#30340;&#32858;&#21512;&#23558;&#22312;RD&#21464;&#24322;&#39537;&#21160;&#19979;&#32622;&#38646;&#26435;&#37325;&#65292;&#24182;&#19988;&#36825;&#31181;&#32858;&#21512;&#30340;&#20272;&#35745;&#22120;&#22312;&#28176;&#36827;&#19979;&#23558;&#23545;RD&#39537;&#21160;&#30340;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#25918;&#32622;&#36880;&#28176;&#28040;&#22833;&#30340;&#26435;&#37325;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#29992;&#20110;&#32463;&#39564;&#35780;&#20272;RD&#21464;&#24322;&#39537;&#21160;&#19979;&#30340;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#26435;&#37325;&#30340;&#35786;&#26029;&#24037;&#20855;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20272;&#35745;&#22120;&#21644;&#30456;&#24212;&#30340;&#28176;&#36827;&#32467;&#26524;&#20197;&#36827;&#34892;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies nonparametric identification and estimation of causal effects in centralized school assignment. In many centralized assignment settings, students are subjected to both lottery-driven variation and regression discontinuity (RD) driven variation. We characterize the full set of identified atomic treatment effects (aTEs), defined as the conditional average treatment effect between a pair of schools, given student characteristics. Atomic treatment effects are the building blocks of more aggregated notions of treatment contrasts, and common approaches estimating aggregations of aTEs can mask important heterogeneity. In particular, many aggregations of aTEs put zero weight on aTEs driven by RD variation, and estimators of such aggregations put asymptotically vanishing weight on the RD-driven aTEs. We develop a diagnostic tool for empirically assessing the weight put on aTEs driven by RD variation. Lastly, we provide estimators and accompanying asymptotic results for infere
&lt;/p&gt;</description></item></channel></rss>