<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#21644;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#24120;&#29992;&#30340;&#20004;&#31181;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2211.14903</link><description>&lt;p&gt;
&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference in Cluster Randomized Trials with Matched Pairs. (arXiv:2211.14903v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.14903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#21644;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#24120;&#29992;&#30340;&#20004;&#31181;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#25512;&#26029;&#30340;&#38382;&#39064;&#12290;&#21305;&#37197;&#23545;&#35774;&#35745;&#24847;&#21619;&#30528;&#26681;&#25454;&#22522;&#32447;&#31751;&#32423;&#21327;&#21464;&#37327;&#23545;&#19968;&#32452;&#31751;&#36827;&#34892;&#21305;&#37197;&#65292;&#28982;&#21518;&#22312;&#27599;&#23545;&#31751;&#20013;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#31751;&#36827;&#34892;&#22788;&#29702;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#30340;&#22823;&#26679;&#26412;&#34892;&#20026;&#65292;&#24182;&#26681;&#25454;&#21305;&#37197;&#36807;&#31243;&#26159;&#21542;&#21305;&#37197;&#31751;&#22823;&#23567;&#65292;&#23548;&#20986;&#20102;&#20004;&#32452;&#19981;&#21516;&#30340;&#32467;&#26524;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#26080;&#35770;&#21305;&#37197;&#36807;&#31243;&#26159;&#21305;&#37197;&#31751;&#22823;&#23567;&#36824;&#26159;&#19981;&#21305;&#37197;&#31751;&#22823;&#23567;&#65292;&#37117;&#26159;&#19968;&#33268;&#30340;&#12290;&#32467;&#21512;&#36825;&#20123;&#32467;&#26524;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#26816;&#39564;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22522;&#20110;&#32447;&#24615;&#22238;&#24402;&#26500;&#36896;&#30340;$t$&#27979;&#35797;&#30340;&#20004;&#31181;&#24120;&#35265;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#65292;&#24182;&#22768;&#31216;&#36825;&#20004;&#31181;&#31243;&#24207;&#36890;&#24120;&#26159;&#20445;&#23432;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers the problem of inference in cluster randomized trials where treatment status is determined according to a "matched pairs'' design. Here, by a cluster randomized experiment, we mean one in which treatment is assigned at the level of the cluster; by a "matched pairs'' design we mean that a sample of clusters is paired according to baseline, cluster-level covariates and, within each pair, one cluster is selected at random for treatment. We study the large sample behavior of a weighted difference-in-means estimator and derive two distinct sets of results depending on if the matching procedure does or does not match on cluster size. We then propose a variance estimator which is consistent in either case. Combining these results establishes the asymptotic exactness of tests based on these estimators. Next, we consider the properties of two common testing procedures based on $t$-tests constructed from linear regressions, and argue that both are generally conservative in o
&lt;/p&gt;</description></item></channel></rss>