<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#39044;&#27979;&#22522;&#20110;&#30707;&#27833;&#30340;&#21830;&#21697;&#30340;&#27874;&#21160;&#24615;&#65292;&#36890;&#36807;&#23558;&#24322;&#36136;&#25345;&#32493;&#24615;&#30340;&#20914;&#20987;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#65292;&#36825;&#31181;&#27169;&#22411;&#22312;&#25913;&#36827;&#27874;&#21160;&#24615;&#39044;&#27979;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#24182;&#19988;&#29305;&#21035;&#36866;&#29992;&#20110;&#36739;&#38271;&#26102;&#38388;&#27573;&#30340;&#39044;&#27979;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01354</link><description>&lt;p&gt;
&#39044;&#27979;&#22522;&#20110;&#30707;&#27833;&#30340;&#21830;&#21697;&#27874;&#21160;&#24615;: &#21160;&#24577;&#25345;&#32493;&#24615;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Forecasting Volatility of Oil-based Commodities: The Model of Dynamic Persistence
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01354
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#39044;&#27979;&#22522;&#20110;&#30707;&#27833;&#30340;&#21830;&#21697;&#30340;&#27874;&#21160;&#24615;&#65292;&#36890;&#36807;&#23558;&#24322;&#36136;&#25345;&#32493;&#24615;&#30340;&#20914;&#20987;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#65292;&#36825;&#31181;&#27169;&#22411;&#22312;&#25913;&#36827;&#27874;&#21160;&#24615;&#39044;&#27979;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#24182;&#19988;&#29305;&#21035;&#36866;&#29992;&#20110;&#36739;&#38271;&#26102;&#38388;&#27573;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#38388;&#21464;&#21160;&#21644;&#25345;&#32493;&#24615;&#26159;&#27874;&#21160;&#24615;&#30340;&#20851;&#38190;&#23646;&#24615;&#65292;&#36890;&#24120;&#22312;&#22522;&#20110;&#30707;&#27833;&#30340;&#27874;&#21160;&#24615;&#39044;&#27979;&#27169;&#22411;&#20013;&#20998;&#21035;&#30740;&#31350;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#20801;&#35768;&#20855;&#26377;&#24322;&#36136;&#25345;&#32493;&#24615;&#30340;&#20914;&#20987;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#65292;&#24182;&#23558;&#20004;&#32773;&#32467;&#21512;&#22312;&#19968;&#36215;&#24314;&#27169;&#12290;&#25105;&#20204;&#35748;&#20026;&#36825;&#24456;&#37325;&#35201;&#65292;&#22240;&#20026;&#36825;&#31181;&#21160;&#24577;&#26159;&#30001;&#20110;&#22522;&#20110;&#30707;&#27833;&#21830;&#21697;&#30340;&#20914;&#20987;&#30340;&#21160;&#24577;&#24615;&#36136;&#33258;&#28982;&#20135;&#29983;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#35782;&#21035;&#20986;&#36825;&#31181;&#21160;&#24577;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#20010;&#26174;&#33879;&#25913;&#36827;&#27874;&#21160;&#24615;&#39044;&#27979;&#30340;&#27169;&#22411;&#12290;&#36825;&#31181;&#22522;&#20110;&#22312;&#26102;&#38388;&#19978;&#24179;&#28369;&#21464;&#21270;&#30340;&#20016;&#23500;&#25345;&#32493;&#24615;&#32467;&#26500;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#36229;&#36234;&#20102;&#26368;&#20808;&#36827;&#30340;&#22522;&#20934;&#27169;&#22411;&#65292;&#24182;&#22312;&#36739;&#38271;&#30340;&#39044;&#27979;&#26102;&#38388;&#27573;&#20869;&#29305;&#21035;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Time variation and persistence are crucial properties of volatility that are often studied separately in oil-based volatility forecasting models. Here, we propose a novel approach that allows shocks with heterogeneous persistence to vary smoothly over time, and thus model the two together. We argue that this is important because such dynamics arise naturally from the dynamic nature of shocks in oil-based commodities. We identify such dynamics from the data using localised regressions and build a model that significantly improves volatility forecasts. Such forecasting models, based on a rich persistence structure that varies smoothly over time, outperform state-of-the-art benchmark models and are particularly useful for forecasting over longer horizons.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#20351;&#29992;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#26469;&#25913;&#36827;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#21453;&#39304;&#24490;&#29615;&#36845;&#20195;&#22320;&#25913;&#36827;&#39044;&#27979;&#22120;&#65292;&#23454;&#29616;&#20102;&#23545;&#26426;&#32452;&#32452;&#21512;&#30340;&#26368;&#20339;&#25805;&#20316;&#12290;</title><link>http://arxiv.org/abs/2208.13065</link><description>&lt;p&gt;
&#25913;&#21892;&#36816;&#33829;&#32463;&#27982;&#23398;&#65306;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#26469;&#39044;&#27979;&#26426;&#32452;&#32452;&#21512;&#30340;&#25805;&#20316;&#35745;&#21010;
&lt;/p&gt;
&lt;p&gt;
Towards Improving Operation Economics: A Bilevel MIP-Based Closed-Loop Predict-and-Optimize Framework for Prescribing Unit Commitment. (arXiv:2208.13065v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.13065
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#20351;&#29992;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#26469;&#25913;&#36827;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#21453;&#39304;&#24490;&#29615;&#36845;&#20195;&#22320;&#25913;&#36827;&#39044;&#27979;&#22120;&#65292;&#23454;&#29616;&#20102;&#23545;&#26426;&#32452;&#32452;&#21512;&#30340;&#26368;&#20339;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#24120;&#65292;&#31995;&#32479;&#25805;&#20316;&#21592;&#22312;&#24320;&#29615;&#39044;&#27979;&#20248;&#21270;&#36807;&#31243;&#20013;&#36827;&#34892;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#65306;&#39318;&#20808;&#39044;&#27979;&#21487;&#20877;&#29983;&#33021;&#28304;(RES)&#30340;&#21487;&#29992;&#24615;&#21644;&#31995;&#32479;&#20648;&#22791;&#38656;&#27714;&#65307;&#26681;&#25454;&#36825;&#20123;&#39044;&#27979;&#65292;&#31995;&#32479;&#25805;&#20316;&#21592;&#35299;&#20915;&#35832;&#22914;&#26426;&#32452;&#32452;&#21512;(UC)&#30340;&#20248;&#21270;&#27169;&#22411;&#65292;&#20197;&#30830;&#23450;&#30456;&#24212;&#30340;&#32463;&#27982;&#36816;&#34892;&#35745;&#21010;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#24320;&#29615;&#36807;&#31243;&#21487;&#33021;&#20250;&#23454;&#36136;&#24615;&#22320;&#25439;&#23475;&#25805;&#20316;&#32463;&#27982;&#24615;&#65292;&#22240;&#20026;&#23427;&#30340;&#39044;&#27979;&#22120;&#30446;&#20809;&#30701;&#27973;&#22320;&#23547;&#27714;&#25913;&#21892;&#21363;&#26102;&#30340;&#32479;&#35745;&#39044;&#27979;&#35823;&#24046;&#65292;&#32780;&#19981;&#26159;&#26368;&#32456;&#30340;&#25805;&#20316;&#25104;&#26412;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#25552;&#20379;&#19968;&#31181;&#39044;&#27979;&#26426;&#32452;&#32452;&#21512;&#20197;&#25913;&#21892;&#25805;&#20316;&#32463;&#27982;&#24615;&#30340;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#21033;&#29992;&#21452;&#23618;&#28151;&#21512;&#25972;&#25968;&#35268;&#21010;&#27169;&#22411;&#38024;&#23545;&#26368;&#20339;&#31995;&#32479;&#25805;&#20316;&#35757;&#32451;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#12290;&#19978;&#23618;&#22522;&#20110;&#20854;&#24341;&#36215;&#30340;&#25805;&#20316;&#25104;&#26412;&#26469;&#35757;&#32451; RES &#21644;&#20648;&#22791;&#39044;&#27979;&#22120;&#65307;&#19979;&#23618;&#21017;&#22312;&#32473;&#23450;&#39044;&#27979;&#30340; RES &#21644;&#20648;&#22791;&#30340;&#24773;&#20917;&#19979;&#65292;&#20381;&#25454;&#26368;&#20339;&#25805;&#20316;&#21407;&#21017;&#27714;&#35299; UC&#12290;&#36825;&#20004;&#20010;&#23618;&#32423;&#36890;&#36807;&#21453;&#39304;&#29615;&#36335;&#36827;&#34892;&#20132;&#20114;&#24615;&#20114;&#21160;&#65292;&#30452;&#21040;&#25910;&#25947;&#20026;&#27490;&#12290;&#22312;&#20462;&#25913;&#21518;&#30340;IEEE 24-bus&#31995;&#32479;&#19978;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#19982;&#19977;&#31181;&#26368;&#20808;&#36827;&#30340; UC &#22522;&#20934;&#32447;&#30456;&#27604;&#65292;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#20855;&#26377;&#39640;&#25928;&#24615;&#21644;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generally, system operators conduct the economic operation of power systems in an open-loop predict-then-optimize process: the renewable energy source (RES) availability and system reserve requirements are first predicted; given the predictions, system operators solve optimization models such as unit commitment (UC) to determine the economical operation plans accordingly. However, such an open-loop process could essentially compromise the operation economics because its predictors myopically seek to improve the immediate statistical prediction errors instead of the ultimate operation cost. To this end, this paper presents a closed-loop predict-and-optimize framework, offering a prescriptive UC to improve the operation economics. First, a bilevel mixed-integer programming model is leveraged to train cost-oriented predictors tailored for optimal system operations: the upper level trains the RES and reserve predictors based on their induced operation cost; the lower level, with given pred
&lt;/p&gt;</description></item></channel></rss>