<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#35780;&#20272;&#20102;&#24046;&#20998;&#38544;&#31169;&#22312;RCT&#20013;&#30340;&#23454;&#29992;&#24615;&#65292;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#24378;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#23545;&#24050;&#21457;&#34920;&#30340;RCT&#20998;&#26512;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#30456;&#23545;&#31616;&#21333;&#30340;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#30340;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;</title><link>http://arxiv.org/abs/2309.14581</link><description>&lt;p&gt;
&#35780;&#20272;&#24046;&#20998;&#38544;&#31169;&#22312;RCT&#20013;&#30340;&#23454;&#29992;&#24615;
&lt;/p&gt;
&lt;p&gt;
Assessing Utility of Differential Privacy for RCTs. (arXiv:2309.14581v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14581
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35780;&#20272;&#20102;&#24046;&#20998;&#38544;&#31169;&#22312;RCT&#20013;&#30340;&#23454;&#29992;&#24615;&#65292;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#24378;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#23545;&#24050;&#21457;&#34920;&#30340;RCT&#20998;&#26512;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#30456;&#23545;&#31616;&#21333;&#30340;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#30340;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#65288;RCT&#65289;&#24050;&#25104;&#20026;&#35780;&#20272;&#24178;&#39044;&#25514;&#26045;&#21644;&#25919;&#31574;&#22312;&#35768;&#22810;&#39046;&#22495;&#20013;&#24433;&#21709;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#23427;&#20204;&#34987;&#35748;&#20026;&#26159;&#29983;&#29289;&#21307;&#23398;&#39046;&#22495;&#21644;&#35768;&#22810;&#31038;&#20250;&#31185;&#23398;&#39046;&#22495;&#25512;&#26029;&#30340;&#40644;&#37329;&#26631;&#20934;&#12290;&#30740;&#31350;&#20154;&#21592;&#24050;&#32463;&#21457;&#34920;&#20102;&#36234;&#26469;&#36234;&#22810;&#20381;&#36182;RCT&#36827;&#34892;&#25512;&#26029;&#30340;&#30740;&#31350;&#65292;&#36825;&#20123;&#30740;&#31350;&#36890;&#24120;&#21253;&#25324;&#32463;&#36807;&#21435;&#26631;&#35782;&#21270;&#21644;&#26377;&#26102;&#36890;&#36807;&#20256;&#32479;&#30340;&#25968;&#25454;&#25259;&#38706;&#38480;&#21046;&#26041;&#27861;&#20445;&#25252;&#30340;&#21709;&#24212;&#25968;&#25454;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#21033;&#29992;&#32463;&#27982;&#23398;&#21644;&#25919;&#31574;&#20998;&#26512;&#20013;&#30340;&#22797;&#21046;&#21253;&#65288;&#30740;&#31350;&#32508;&#36848;&#65289;&#26469;&#23454;&#35777;&#35780;&#20272;&#24378;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#65288;&#20855;&#26377;&#24046;&#20998;&#38544;&#31169;&#20445;&#35777;&#65289;&#23545;&#24050;&#21457;&#34920;&#30340;RCT&#20998;&#26512;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#27169;&#25311;&#30740;&#31350;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#21508;&#31181;&#21442;&#25968;&#21270;&#26465;&#20214;&#19979;&#22797;&#21046;&#23545;&#38544;&#31169;&#20445;&#25252;&#25968;&#25454;&#30340;&#24050;&#21457;&#24067;&#32463;&#27982;&#23398;&#25991;&#31456;&#30340;&#20998;&#26512;&#12290;&#25105;&#20204;&#21457;&#29616;&#30456;&#23545;&#31616;&#21333;&#30340;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#30340;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Randomized control trials, RCTs, have become a powerful tool for assessing the impact of interventions and policies in many contexts. They are considered the gold-standard for inference in the biomedical fields and in many social sciences. Researchers have published an increasing number of studies that rely on RCTs for at least part of the inference, and these studies typically include the response data collected, de-identified and sometimes protected through traditional disclosure limitation methods. In this paper, we empirically assess the impact of strong privacy-preservation methodology (with \ac{DP} guarantees), on published analyses from RCTs, leveraging the availability of replication packages (research compendia) in economics and policy analysis. We provide simulations studies and demonstrate how we can replicate the analysis in a published economics article on privacy-protected data under various parametrizations. We find that relatively straightforward DP-based methods allow 
&lt;/p&gt;</description></item></channel></rss>