<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#38024;&#23545;&#24179;&#28369;&#38382;&#39064;&#65292;&#20351;&#29992;&#20840;&#23616;&#31209;&#26465;&#20214;&#19979;&#30340;&#29305;&#23450;&#31639;&#27861;&#35777;&#26126;&#20102;&#38750;&#20984;&#32467;&#26500;&#19979;&#30340;&#36890;&#29992;&#30697;&#20272;&#35745;&#21644;&#27169;&#25311;&#30697;&#20272;&#35745;&#26159;&#20840;&#23616;&#25910;&#25947;&#30340;&#12290;</title><link>http://arxiv.org/abs/2304.14386</link><description>&lt;p&gt;
&#26080;&#38656;&#20984;&#24615;&#65306;&#24179;&#28369;&#26102;&#21051;&#26465;&#20214;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Convexity Not Required: Estimation of Smooth Moment Condition Models. (arXiv:2304.14386v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14386
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#24179;&#28369;&#38382;&#39064;&#65292;&#20351;&#29992;&#20840;&#23616;&#31209;&#26465;&#20214;&#19979;&#30340;&#29305;&#23450;&#31639;&#27861;&#35777;&#26126;&#20102;&#38750;&#20984;&#32467;&#26500;&#19979;&#30340;&#36890;&#29992;&#30697;&#20272;&#35745;&#21644;&#27169;&#25311;&#30697;&#20272;&#35745;&#26159;&#20840;&#23616;&#25910;&#25947;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#30697;&#21450;&#27169;&#25311;&#30697;&#27861;&#24120;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#24615;&#32463;&#27982;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#30456;&#24212;&#30340;&#30446;&#26631;&#20989;&#25968;&#38750;&#20984;&#65292;&#20248;&#21270;&#24448;&#24448;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#38024;&#23545;&#24179;&#28369;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#19981;&#38656;&#35201;&#20984;&#24615;&#65306;&#22312;&#28041;&#21450;&#26679;&#26412;&#30697;&#38453;&#38597;&#21487;&#27604;&#30340;&#20840;&#23616;&#31209;&#26465;&#20214;&#19979;&#65292;&#26576;&#20123;&#31639;&#27861;&#26159;&#20840;&#23616;&#25910;&#25947;&#30340;&#12290;&#36825;&#20123;&#31639;&#27861;&#21253;&#25324;&#26799;&#24230;&#19979;&#38477;&#21644;&#39640;&#26031;&#29275;&#39039;&#31639;&#27861;&#21450;&#38656;&#35201;&#36866;&#24403;&#36873;&#25321;&#35843;&#25972;&#21442;&#25968;&#12290;&#35813;&#32467;&#26524;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#23545;&#38750;&#20984;&#24615;&#12289;&#21333;&#19968;&#38750;&#32447;&#24615;&#20877;&#21442;&#25968;&#21270;&#20197;&#21450;&#36866;&#24230;&#30340;&#38169;&#35823;&#24314;&#27169;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#30001;&#20110;&#38750;&#20984;&#24615;&#65292;&#29275;&#39039;-&#25289;&#22827;&#26862;&#21644;&#25311;&#29275;&#39039;&#26041;&#27861;&#21487;&#33021;&#26080;&#27861;&#25910;&#25947;&#12290;&#31616;&#21333;&#30340;&#20363;&#23376;&#35828;&#26126;&#20102;&#19968;&#20010;&#28385;&#36275;&#21069;&#36848;&#31209;&#26465;&#20214;&#30340;&#38750;&#20984; GMM &#20272;&#35745;&#38382;&#39064;&#12290;&#23545;&#38543;&#26426;&#31995;&#25968;&#38656;&#27714;&#20272;&#35745;&#21644;&#33033;&#20914;&#21709;&#24212;&#21305;&#37197;&#30340;&#23454;&#35777;&#24212;&#29992;&#36827;&#19968;&#27493;&#35828;&#26126;&#20102;&#26412;&#25991;&#30340;&#30740;&#31350;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generalized and Simulated Method of Moments are often used to estimate structural Economic models. Yet, it is commonly reported that optimization is challenging because the corresponding objective function is non-convex. For smooth problems, this paper shows that convexity is not required: under a global rank condition involving the Jacobian of the sample moments, certain algorithms are globally convergent. These include a gradient-descent and a Gauss-Newton algorithm with appropriate choice of tuning parameters. The results are robust to 1) non-convexity, 2) one-to-one non-linear reparameterizations, and 3) moderate misspecification. In contrast, Newton-Raphson and quasi-Newton methods can fail to converge for the same estimation because of non-convexity. A simple example illustrates a non-convex GMM estimation problem that satisfies the aforementioned rank condition. Empirical applications to random coefficient demand estimation and impulse response matching further illustrate the re
&lt;/p&gt;</description></item></channel></rss>