<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36890;&#36807;&#25968;&#23398;&#20998;&#26512;&#65292;&#30740;&#31350;&#21457;&#29616;AUROC&#21644;AUPRC&#22312;&#31867;&#21035;&#19981;&#24179;&#34913;&#24773;&#20917;&#19979;&#21487;&#20197;&#20197;&#27010;&#29575;&#26415;&#35821;&#31616;&#27905;&#22320;&#30456;&#20851;&#32852;&#12290;&#30456;&#27604;&#20110;&#20154;&#20204;&#26222;&#36941;&#35748;&#20026;&#30340;AUPRC&#20248;&#36234;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;AUPRC&#24182;&#19981;&#22914;&#20154;&#20204;&#39044;&#26399;&#30340;&#26377;&#20248;&#21183;&#65292;&#24182;&#19988;&#21487;&#33021;&#26159;&#19968;&#31181;&#26377;&#23475;&#30340;&#25351;&#26631;&#12290;&#30740;&#31350;&#36824;&#36890;&#36807;&#20998;&#26512;&#22823;&#37327;&#25991;&#29486;&#39564;&#35777;&#20102;&#36825;&#19968;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2401.06091</link><description>&lt;p&gt;
AUROC&#21644;AUPRC&#22312;&#31867;&#19981;&#24179;&#34913;&#19979;&#30340;&#28145;&#20837;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Closer Look at AUROC and AUPRC under Class Imbalance. (arXiv:2401.06091v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06091
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25968;&#23398;&#20998;&#26512;&#65292;&#30740;&#31350;&#21457;&#29616;AUROC&#21644;AUPRC&#22312;&#31867;&#21035;&#19981;&#24179;&#34913;&#24773;&#20917;&#19979;&#21487;&#20197;&#20197;&#27010;&#29575;&#26415;&#35821;&#31616;&#27905;&#22320;&#30456;&#20851;&#32852;&#12290;&#30456;&#27604;&#20110;&#20154;&#20204;&#26222;&#36941;&#35748;&#20026;&#30340;AUPRC&#20248;&#36234;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;AUPRC&#24182;&#19981;&#22914;&#20154;&#20204;&#39044;&#26399;&#30340;&#26377;&#20248;&#21183;&#65292;&#24182;&#19988;&#21487;&#33021;&#26159;&#19968;&#31181;&#26377;&#23475;&#30340;&#25351;&#26631;&#12290;&#30740;&#31350;&#36824;&#36890;&#36807;&#20998;&#26512;&#22823;&#37327;&#25991;&#29486;&#39564;&#35777;&#20102;&#36825;&#19968;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#65292;&#19968;&#20010;&#24191;&#27867;&#30340;&#35266;&#28857;&#26159;&#65292;&#22312;&#20108;&#20998;&#31867;&#20219;&#21153;&#20013;&#65292;&#38754;&#31215;&#21463;&#38480;&#21046;&#30340;&#20934;&#30830;&#29575;&#26354;&#32447;&#65288;AUPRC&#65289;&#27604;&#21463;&#35797;&#32773;&#24037;&#20316;&#29305;&#24449;&#26354;&#32447;&#19979;&#30340;&#38754;&#31215;&#65288;AUROC&#65289;&#26356;&#22909;&#22320;&#29992;&#20110;&#27169;&#22411;&#27604;&#36739;&#65292;&#23588;&#20854;&#26159;&#22312;&#23384;&#22312;&#31867;&#21035;&#19981;&#24179;&#34913;&#30340;&#24773;&#20917;&#19979;&#12290;&#26412;&#25991;&#36890;&#36807;&#26032;&#39062;&#30340;&#25968;&#23398;&#20998;&#26512;&#25361;&#25112;&#20102;&#36825;&#19968;&#35266;&#28857;&#65292;&#24182;&#35828;&#26126;&#20102;AUROC&#21644;AUPRC&#21487;&#20197;&#20197;&#27010;&#29575;&#26415;&#35821;&#31616;&#27905;&#22320;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;AUPRC&#24182;&#19981;&#22914;&#20154;&#20204;&#26222;&#36941;&#35748;&#20026;&#30340;&#22312;&#31867;&#21035;&#19981;&#24179;&#34913;&#30340;&#24773;&#20917;&#19979;&#26356;&#20248;&#65292;&#29978;&#33267;&#21487;&#33021;&#26159;&#19968;&#31181;&#26377;&#23475;&#30340;&#25351;&#26631;&#65292;&#22240;&#20026;&#23427;&#20542;&#21521;&#20110;&#36807;&#20998;&#20559;&#21521;&#20110;&#22312;&#27491;&#26679;&#26412;&#36739;&#20026;&#39057;&#32321;&#30340;&#23376;&#32676;&#20013;&#25913;&#21892;&#27169;&#22411;&#12290;&#36825;&#31181;&#20559;&#24046;&#21487;&#33021;&#20250;&#26080;&#24847;&#20013;&#22686;&#21152;&#31639;&#27861;&#30340;&#24046;&#24322;&#12290;&#22312;&#36825;&#20123;&#27934;&#35265;&#30340;&#25512;&#21160;&#19979;&#65292;&#25105;&#20204;&#23545;&#29616;&#26377;&#30340;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#36827;&#34892;&#20102;&#24443;&#24213;&#30340;&#22238;&#39038;&#65292;&#24182;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23545;arXiv&#19978;&#30340;150&#22810;&#19975;&#31687;&#35770;&#25991;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;&#25105;&#20204;&#30340;&#35843;&#26597;&#37325;&#28857;&#26159;&#39564;&#35777;&#21644;&#35777;&#26126;&#22768;&#31216;&#30340;AUPRC&#20248;&#36234;&#24615;&#30340;&#26222;&#36941;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In machine learning (ML), a widespread adage is that the area under the precision-recall curve (AUPRC) is a superior metric for model comparison to the area under the receiver operating characteristic (AUROC) for binary classification tasks with class imbalance. This paper challenges this notion through novel mathematical analysis, illustrating that AUROC and AUPRC can be concisely related in probabilistic terms. We demonstrate that AUPRC, contrary to popular belief, is not superior in cases of class imbalance and might even be a harmful metric, given its inclination to unduly favor model improvements in subpopulations with more frequent positive labels. This bias can inadvertently heighten algorithmic disparities. Prompted by these insights, a thorough review of existing ML literature was conducted, utilizing large language models to analyze over 1.5 million papers from arXiv. Our investigation focused on the prevalence and substantiation of the purported AUPRC superiority. The result
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#65292;&#36825;&#20351;&#24471;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#65292;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.14311</link><description>&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#20013;&#21322;&#21442;&#25968;&#27169;&#22411;&#30340;&#31616;&#21333;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Simple Estimation of Semiparametric Models with Measurement Errors. (arXiv:2306.14311v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14311
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#65292;&#36825;&#20351;&#24471;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#65292;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#24320;&#21457;&#20102;&#19968;&#31181;&#35299;&#20915;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#23454;&#29992;&#26041;&#27861;&#12290;&#25105;&#20204;&#20851;&#27880;&#30340;&#26159;EIV&#30340;&#21487;&#21464;&#24615;&#26159;&#27979;&#37327;&#35823;&#24046;&#21464;&#37327;&#30340;&#19968;&#23567;&#37096;&#20998;&#30340;&#24773;&#20917;&#65292;&#36825;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#24456;&#24120;&#35265;&#12290;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22522;&#20110;&#36825;&#20123;&#30697;&#30340;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#12290;&#21363;&#20351;EIV&#24456;&#22823;&#65292;&#26420;&#32032;&#20272;&#35745;&#37327;&#65288;&#24573;&#30053;EIV&#38382;&#39064;&#65289;&#21487;&#33021;&#20005;&#37325;&#20559;&#35823;&#24182;&#19988;&#32622;&#20449;&#21306;&#38388;&#30340;&#35206;&#30422;&#29575;&#20026;0&#65285;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20063;&#33021;&#22788;&#29702;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#19981;&#28041;&#21450;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#36825;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a practical way of addressing the Errors-In-Variables (EIV) problem in the Generalized Method of Moments (GMM) framework. We focus on the settings in which the variability of the EIV is a fraction of that of the mismeasured variables, which is typical for empirical applications. For any initial set of moment conditions our approach provides a corrected set of moment conditions that are robust to the EIV. We show that the GMM estimator based on these moments is root-n-consistent, with the standard tests and confidence intervals providing valid inference. This is true even when the EIV are so large that naive estimators (that ignore the EIV problem) may be heavily biased with the confidence intervals having 0% coverage. Our approach involves no nonparametric estimation, which is particularly important for applications with multiple covariates, and settings with multivariate, serially correlated, or non-classical EIV.
&lt;/p&gt;</description></item></channel></rss>