<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36825;&#31687;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#26469;&#35299;&#20915;&#38750;&#36776;&#35782;&#24615;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#20551;&#35774;&#28040;&#36153;&#32773;&#26377;&#26377;&#30028;&#29702;&#24615;&#65292;&#24182;&#19988;&#33021;&#22815;&#20934;&#30830;&#35299;&#37322;&#23458;&#25143;&#30340;&#36873;&#25321;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2302.04354</link><description>&lt;p&gt;
&#19968;&#20010;&#38750;&#21442;&#25968;&#38543;&#26426;&#38598;&#21512;&#27169;&#22411;&#65306;&#37492;&#21035;&#65292;&#20248;&#21270;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
A Nonparametric Stochastic Set Model: Identification, Optimization, and Prediction. (arXiv:2302.04354v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04354
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#26469;&#35299;&#20915;&#38750;&#36776;&#35782;&#24615;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#20551;&#35774;&#28040;&#36153;&#32773;&#26377;&#26377;&#30028;&#29702;&#24615;&#65292;&#24182;&#19988;&#33021;&#22815;&#20934;&#30830;&#35299;&#37322;&#23458;&#25143;&#30340;&#36873;&#25321;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#27169;&#22411;&#30340;&#37492;&#21035;&#23545;&#20110;&#29702;&#35299;&#28040;&#36153;&#32773;&#34892;&#20026;&#65292;&#35774;&#35745;&#33829;&#38144;&#25919;&#31574;&#21644;&#24320;&#21457;&#26032;&#20135;&#21697;&#33267;&#20851;&#37325;&#35201;&#12290;&#21442;&#25968;&#36873;&#25321;&#22522;&#20110;&#38656;&#27714;&#27169;&#22411;&#30340;&#37492;&#21035;&#65292;&#22914;&#22810;&#39033;&#24335;&#36873;&#25321;&#27169;&#22411;&#65288;MNL&#65289;&#65292;&#36890;&#24120;&#26159;&#30452;&#25509;&#30340;&#12290;&#28982;&#32780;&#65292;&#38750;&#21442;&#25968;&#27169;&#22411;&#22312;&#35299;&#37322;&#23458;&#25143;&#36873;&#25321;&#26041;&#38754;&#38750;&#24120;&#26377;&#25928;&#21644;&#28789;&#27963;&#65292;&#20294;&#21487;&#33021;&#20250;&#36935;&#21040;&#32500;&#24230;&#28798;&#38590;&#65292;&#24182;&#22833;&#21435;&#21487;&#36776;&#35782;&#24615;&#12290;&#20363;&#22914;&#65292;&#25490;&#21517;&#27169;&#22411;&#26159;&#19968;&#20010;&#38750;&#21442;&#25968;&#27169;&#22411;&#65292;&#26088;&#22312;&#27169;&#25311;&#38543;&#26426;&#25928;&#29992;&#26368;&#22823;&#21270;&#65288;RUM&#65289;&#21407;&#21017;&#65292;&#24050;&#34987;&#35748;&#20026;&#20809;&#20174;&#36873;&#25321;&#27010;&#29575;&#38598;&#21512;&#26412;&#36523;&#26080;&#27861;&#36776;&#35782;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#31867;&#21035;&#65292;&#19981;&#21463;&#38750;&#36776;&#35782;&#24615;&#38382;&#39064;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20551;&#35774;&#28040;&#36153;&#32773;&#26377;&#26377;&#30028;&#29702;&#24615;&#65292;&#23548;&#33268;&#23545;&#31216;&#38656;&#27714; cannibalization &#24182;&#26377;&#36259;&#22320;&#23454;&#29616;&#23436;&#20840;&#36776;&#35782;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#25105;&#20204;&#21487;&#20197;&#21807;&#19968;&#26500;&#24314;&#27169;&#22411;&#21442;&#25968;&#65292;&#20197;&#31934;&#30830;&#22320;&#35299;&#37322;&#23458;&#25143;&#36873;&#25321;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
The identification of choice models is crucial for understanding consumer behavior, designing marketing policies, and developing new products. The identification of parametric choice-based demand models, such as the multinomial choice model (MNL), is typically straightforward. However, nonparametric models, which are highly effective and flexible in explaining customer choices, may encounter the curse of the dimensionality and lose their identifiability. For example, the ranking-based model, which is a nonparametric model and designed to mirror the random utility maximization (RUM) principle, is known to be nonidentifiable from the collection of choice probabilities alone. In this paper, we develop a new class of nonparametric models that is not subject to the problem of nonidentifiability. Our model assumes bounded rationality of consumers, which results in symmetric demand cannibalization and intriguingly enables full identification. That is to say, we can uniquely construct the mode
&lt;/p&gt;</description></item></channel></rss>