<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#20998;&#21106;&#27169;&#22411;&#65292;&#21487;&#20197;&#22788;&#29702;&#24322;&#36136;&#24615;&#21151;&#33021;&#25968;&#25454;&#65292;&#36890;&#36807;&#21160;&#24577;&#35268;&#21010;&#30340;EM&#31639;&#27861;&#36817;&#20284;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#65292;&#26041;&#27861;&#22312;&#27169;&#25311;&#19982;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#24471;&#21040;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2303.10712</link><description>&lt;p&gt;
&#24322;&#36136;&#24615;&#21151;&#33021;&#25968;&#25454;&#30340;&#28151;&#21512;&#20998;&#21106;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Mixture of segmentation for heterogeneous functional data. (arXiv:2303.10712v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10712
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#20998;&#21106;&#27169;&#22411;&#65292;&#21487;&#20197;&#22788;&#29702;&#24322;&#36136;&#24615;&#21151;&#33021;&#25968;&#25454;&#65292;&#36890;&#36807;&#21160;&#24577;&#35268;&#21010;&#30340;EM&#31639;&#27861;&#36817;&#20284;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#65292;&#26041;&#27861;&#22312;&#27169;&#25311;&#19982;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#24471;&#21040;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#26102;&#38388;&#21644;&#20154;&#21475;&#24322;&#36136;&#24615;&#30340;&#21151;&#33021;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#20998;&#21106;&#27169;&#22411;&#65292;&#26088;&#22312;&#20445;&#25345;&#21151;&#33021;&#32467;&#26500;&#30340;&#21516;&#26102;&#34920;&#31034;&#24322;&#36136;&#24615;&#12290; &#35752;&#35770;&#20102;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#30340;&#21487;&#36776;&#35782;&#24615;&#21644;&#19968;&#33268;&#24615;&#65292;&#24182;&#37319;&#29992;&#21160;&#24577;&#35268;&#21010;&#30340;EM&#31639;&#27861;&#26469;&#36817;&#20284;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#12290; &#35813;&#26041;&#27861;&#22312;&#27169;&#25311;&#25968;&#25454;&#19978;&#36827;&#34892;&#20102;&#35828;&#26126;&#65292;&#24182;&#22312;&#29992;&#30005;&#37327;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#24471;&#21040;&#20102;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we consider functional data with heterogeneity in time and in population. We propose a mixture model with segmentation of time to represent this heterogeneity while keeping the functional structure. Maximum likelihood estimator is considered, proved to be identifiable and consistent. In practice, an EM algorithm is used, combined with dynamic programming for the maximization step, to approximate the maximum likelihood estimator. The method is illustrated on a simulated dataset, and used on a real dataset of electricity consumption.
&lt;/p&gt;</description></item></channel></rss>