<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#27604;&#36739;&#20102;&#22810;&#31181;&#24120;&#29992;&#30340;&#21452;&#37325;&#31283;&#20581;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#23427;&#20204;&#20351;&#29992;&#27835;&#30103;&#27169;&#22411;&#21644;&#32467;&#26524;&#27169;&#22411;&#30340;&#31574;&#30053;&#24322;&#21516;&#65292;&#24182;&#30740;&#31350;&#20102;&#22914;&#20309;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#20197;&#25552;&#39640;&#20854;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2204.10969</link><description>&lt;p&gt;
&#24403;&#21452;&#37325;&#31283;&#20581;&#26041;&#27861;&#36935;&#21040;&#26426;&#22120;&#23398;&#20064;&#65306;&#29992;&#20110;&#20174;&#23454;&#38469;&#25968;&#25454;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#30340;&#27604;&#36739;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
When Doubly Robust Methods Meet Machine Learning for Estimating Treatment Effects from Real-World Data: A Comparative Study. (arXiv:2204.10969v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.10969
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#27604;&#36739;&#20102;&#22810;&#31181;&#24120;&#29992;&#30340;&#21452;&#37325;&#31283;&#20581;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#23427;&#20204;&#20351;&#29992;&#27835;&#30103;&#27169;&#22411;&#21644;&#32467;&#26524;&#27169;&#22411;&#30340;&#31574;&#30053;&#24322;&#21516;&#65292;&#24182;&#30740;&#31350;&#20102;&#22914;&#20309;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#20197;&#25552;&#39640;&#20854;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35266;&#23519;&#24615;&#38431;&#21015;&#30740;&#31350;&#36234;&#26469;&#36234;&#24120;&#29992;&#20110;&#27604;&#36739;&#25928;&#26524;&#30740;&#31350;&#65292;&#20197;&#35780;&#20272;&#27835;&#30103;&#26041;&#27861;&#30340;&#23433;&#20840;&#24615;&#12290;&#26368;&#36817;&#65292;&#21508;&#31181;&#21452;&#37325;&#31283;&#20581;&#26041;&#27861;&#24050;&#34987;&#25552;&#20986;&#65292;&#36890;&#36807;&#21305;&#37197;&#12289;&#21152;&#26435;&#21644;&#22238;&#24402;&#31561;&#19981;&#21516;&#26041;&#24335;&#65292;&#36890;&#36807;&#32452;&#21512;&#27835;&#30103;&#27169;&#22411;&#21644;&#32467;&#26524;&#27169;&#22411;&#26469;&#20272;&#35745;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#12290;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#30340;&#20851;&#38190;&#20248;&#21183;&#22312;&#20110;&#65292;&#23427;&#20204;&#35201;&#27714;&#27835;&#30103;&#27169;&#22411;&#25110;&#32467;&#26524;&#27169;&#22411;&#20043;&#19968;&#34987;&#27491;&#30830;&#35268;&#23450;&#65292;&#20197;&#33719;&#24471;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#20272;&#35745;&#20540;&#65292;&#20174;&#32780;&#23548;&#33268;&#26356;&#20934;&#30830;&#12289;&#36890;&#24120;&#26356;&#31934;&#30830;&#30340;&#25512;&#26029;&#12290;&#28982;&#32780;&#65292;&#24456;&#23569;&#26377;&#24037;&#20316;&#21435;&#29702;&#35299;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#30001;&#20110;&#20351;&#29992;&#27835;&#30103;&#21644;&#32467;&#26524;&#27169;&#22411;&#30340;&#29420;&#29305;&#31574;&#30053;&#22914;&#20309;&#19981;&#21516;&#20197;&#21450;&#22914;&#20309;&#32467;&#21512;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#20197;&#25552;&#39640;&#20854;&#24615;&#33021;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#26816;&#26597;&#20102;&#22810;&#20010;&#21463;&#27426;&#36814;&#30340;&#21452;&#37325;&#31283;&#20581;&#26041;&#27861;&#65292;&#24182;&#20351;&#29992;&#19981;&#21516;&#30340;&#27835;&#30103;&#21644;&#32467;&#26524;&#27169;&#22411;&#27604;&#36739;&#23427;&#20204;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Observational cohort studies are increasingly being used for comparative effectiveness research to assess the safety of therapeutics. Recently, various doubly robust methods have been proposed for average treatment effect estimation by combining the treatment model and the outcome model via different vehicles, such as matching, weighting, and regression. The key advantage of doubly robust estimators is that they require either the treatment model or the outcome model to be correctly specified to obtain a consistent estimator of average treatment effects, and therefore lead to a more accurate and often more precise inference. However, little work has been done to understand how doubly robust estimators differ due to their unique strategies of using the treatment and outcome models and how machine learning techniques can be combined to boost their performance. Here we examine multiple popular doubly robust methods and compare their performance using different treatment and outcome modeli
&lt;/p&gt;</description></item></channel></rss>