<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2402.08941</link><description>&lt;p&gt;
&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Local-Polynomial Estimation for Multivariate Regression Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08941
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#22810;&#20803;&#23616;&#37096;&#32447;&#24615;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#22788;&#29702;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#30340;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20351;&#29992;&#20174;&#36793;&#30028;&#28857;&#21040;&#27431;&#27663;&#36317;&#31163;&#20316;&#20026;&#26631;&#37327;&#36816;&#34892;&#21464;&#37327;&#65292;&#22240;&#27492;&#22810;&#20803;&#35774;&#35745;&#34987;&#22788;&#29702;&#20026;&#21333;&#21464;&#37327;&#35774;&#35745;&#12290;&#28982;&#32780;&#65292;&#36317;&#31163;&#36816;&#34892;&#21464;&#37327;&#19982;&#28176;&#36817;&#26377;&#25928;&#24615;&#30340;&#20551;&#35774;&#19981;&#30456;&#23481;&#12290;&#25105;&#20204;&#23558;&#22810;&#20803;&#35774;&#35745;&#20316;&#20026;&#22810;&#20803;&#22788;&#29702;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#22120;&#30340;&#26032;&#22411;&#28176;&#36817;&#27491;&#24120;&#24615;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#65292;&#24182;&#33021;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#22312;&#21733;&#20262;&#27604;&#20122;&#22870;&#23398;&#37329;&#30740;&#31350;&#20013;&#30340;&#23454;&#35777;&#35828;&#26126;&#25581;&#31034;&#20102;&#27835;&#30103;&#25928;&#24212;&#30340;&#26356;&#20016;&#23500;&#30340;&#24322;&#36136;&#24615;&#65288;&#21253;&#25324;&#20854;&#19981;&#23384;&#22312;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08941v1 Announce Type: new Abstract: We introduce a multivariate local-linear estimator for multivariate regression discontinuity designs in which treatment is assigned by crossing a boundary in the space of running variables. The dominant approach uses the Euclidean distance from a boundary point as the scalar running variable; hence, multivariate designs are handled as uni-variate designs. However, the distance running variable is incompatible with the assumption for asymptotic validity. We handle multivariate designs as multivariate. In this study, we develop a novel asymptotic normality for multivariate local-polynomial estimators. Our estimator is asymptotically valid and can capture heterogeneous treatment effects over the boundary. We demonstrate the effectiveness of our estimator through numerical simulations. Our empirical illustration of a Colombian scholarship study reveals a richer heterogeneity (including its absence) of the treatment effect that is hidden in th
&lt;/p&gt;</description></item><item><title>&#35813;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;Bayesian&#38750;&#21442;&#25968;&#23398;&#20064;&#26694;&#26550;&#65292;&#23545;&#20110;&#27979;&#37327;&#35823;&#24046;&#20855;&#26377;&#24378;&#40065;&#26834;&#24615;&#65292;&#19981;&#38656;&#35201;&#30693;&#36947;&#35823;&#24046;&#20998;&#24067;&#21644;&#21327;&#21464;&#37327;&#21487;&#37325;&#22797;&#27979;&#37327;&#30340;&#20551;&#35774;&#65292;&#24182;&#33021;&#22815;&#21560;&#25910;&#20808;&#39564;&#20449;&#24565;&#65292;&#36825;&#33021;&#20135;&#29983;&#20004;&#31181;&#36890;&#36807;&#19981;&#21516;&#25439;&#22833;&#20989;&#25968;&#30340;&#27979;&#37327;&#35823;&#24046;&#24378;&#40065;&#26834;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2306.01468</link><description>&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#27169;&#22411;&#30340;&#24378;&#40065;&#26834;&#24615;Bayesian&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Robust Bayesian Inference for Measurement Error Models. (arXiv:2306.01468v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01468
&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;Bayesian&#38750;&#21442;&#25968;&#23398;&#20064;&#26694;&#26550;&#65292;&#23545;&#20110;&#27979;&#37327;&#35823;&#24046;&#20855;&#26377;&#24378;&#40065;&#26834;&#24615;&#65292;&#19981;&#38656;&#35201;&#30693;&#36947;&#35823;&#24046;&#20998;&#24067;&#21644;&#21327;&#21464;&#37327;&#21487;&#37325;&#22797;&#27979;&#37327;&#30340;&#20551;&#35774;&#65292;&#24182;&#33021;&#22815;&#21560;&#25910;&#20808;&#39564;&#20449;&#24565;&#65292;&#36825;&#33021;&#20135;&#29983;&#20004;&#31181;&#36890;&#36807;&#19981;&#21516;&#25439;&#22833;&#20989;&#25968;&#30340;&#27979;&#37327;&#35823;&#24046;&#24378;&#40065;&#26834;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#26159;&#25351;&#24433;&#21709;&#21709;&#24212;&#21464;&#37327;&#30340;&#21327;&#21464;&#37327;&#21463;&#21040;&#22122;&#22768;&#24178;&#25200;&#12290;&#36825;&#21487;&#33021;&#20250;&#23548;&#33268;&#35823;&#23548;&#24615;&#30340;&#25512;&#26029;&#32467;&#26524;&#65292;&#23588;&#20854;&#26159;&#22312;&#20272;&#35745;&#21327;&#21464;&#37327;&#21644;&#21709;&#24212;&#21464;&#37327;&#20043;&#38388;&#20851;&#31995;&#30340;&#20934;&#30830;&#24615;&#33267;&#20851;&#37325;&#35201;&#30340;&#38382;&#39064;&#20013;&#65292;&#22914;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#38382;&#39064;&#20013;&#12290;&#29616;&#26377;&#30340;&#22788;&#29702;&#27979;&#37327;&#35823;&#24046;&#30340;&#26041;&#27861;&#36890;&#24120;&#20381;&#36182;&#20110;&#24378;&#20551;&#35774;&#65292;&#20363;&#22914;&#23545;&#35823;&#24046;&#20998;&#24067;&#25110;&#20854;&#26041;&#24046;&#30340;&#30693;&#35782;&#21644;&#21327;&#21464;&#37327;&#21487;&#37325;&#22797;&#27979;&#37327;&#30340;&#21487;&#29992;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;Bayesian&#38750;&#21442;&#25968;&#23398;&#20064;&#26694;&#26550;&#65292;&#23427;&#23545;&#20110;&#27979;&#37327;&#35823;&#24046;&#20855;&#26377;&#24378;&#40065;&#26834;&#24615;&#65292;&#19981;&#38656;&#35201;&#19978;&#36848;&#20551;&#35774;&#65292;&#24182;&#33021;&#22815;&#21560;&#25910;&#20851;&#20110;&#30495;&#23454;&#35823;&#24046;&#20998;&#24067;&#30340;&#20808;&#39564;&#20449;&#24565;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20135;&#29983;&#20102;&#20004;&#31181;&#36890;&#36807;&#19981;&#21516;&#25439;&#22833;&#20989;&#25968;&#30340;&#27979;&#37327;&#35823;&#24046;&#24378;&#40065;&#26834;&#26041;&#27861;&#65306;&#19968;&#31181;&#22522;&#20110;&#24635;&#26368;&#23567;&#20108;&#20056;&#30446;&#26631;&#65292;&#21478;&#19968;&#31181;&#22522;&#20110;&#26368;&#22823;&#24179;&#22343;&#20559;&#24046;&#65288;MMD&#65289;&#12290;&#21518;&#32773;&#20801;&#35768;&#25512;&#24191;&#21040;&#38750;&#39640;&#26031;&#20998;&#24067;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
Measurement error occurs when a set of covariates influencing a response variable are corrupted by noise. This can lead to misleading inference outcomes, particularly in problems where accurately estimating the relationship between covariates and response variables is crucial, such as causal effect estimation. Existing methods for dealing with measurement error often rely on strong assumptions such as knowledge of the error distribution or its variance and availability of replicated measurements of the covariates. We propose a Bayesian Nonparametric Learning framework which is robust to mismeasured covariates, does not require the preceding assumptions, and is able to incorporate prior beliefs about the true error distribution. Our approach gives rise to two methods that are robust to measurement error via different loss functions: one based on the Total Least Squares objective and the other based on Maximum Mean Discrepancy (MMD). The latter allows for generalisation to non-Gaussian d
&lt;/p&gt;</description></item></channel></rss>