<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#65288;BayesNF&#65289;&#65292;&#32467;&#21512;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#29992;&#20110;&#22788;&#29702;&#22823;&#35268;&#27169;&#26102;&#31354;&#39044;&#27979;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.07657</link><description>&lt;p&gt;
&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#36827;&#34892;&#21487;&#25193;&#23637;&#30340;&#26102;&#31354;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Scalable Spatiotemporal Prediction with Bayesian Neural Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07657
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#65288;BayesNF&#65289;&#65292;&#32467;&#21512;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#29992;&#20110;&#22788;&#29702;&#22823;&#35268;&#27169;&#26102;&#31354;&#39044;&#27979;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#31354;&#25968;&#25454;&#38598;&#30001;&#31354;&#38388;&#21442;&#32771;&#30340;&#26102;&#38388;&#24207;&#21015;&#34920;&#31034;&#65292;&#24191;&#27867;&#24212;&#29992;&#20110;&#35768;&#22810;&#31185;&#23398;&#21644;&#21830;&#19994;&#26234;&#33021;&#39046;&#22495;&#65292;&#20363;&#22914;&#31354;&#27668;&#27745;&#26579;&#30417;&#27979;&#65292;&#30142;&#30149;&#36319;&#36394;&#21644;&#20113;&#38656;&#27714;&#39044;&#27979;&#12290;&#38543;&#30528;&#29616;&#20195;&#25968;&#25454;&#38598;&#35268;&#27169;&#21644;&#22797;&#26434;&#24615;&#30340;&#19981;&#26029;&#22686;&#21152;&#65292;&#38656;&#35201;&#26032;&#30340;&#32479;&#35745;&#26041;&#27861;&#26469;&#25429;&#25417;&#22797;&#26434;&#30340;&#26102;&#31354;&#21160;&#24577;&#24182;&#22788;&#29702;&#22823;&#35268;&#27169;&#39044;&#27979;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;Bayesian Neural Field (BayesNF)&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#25512;&#26029;&#26102;&#31354;&#22495;&#19978;&#20016;&#23500;&#27010;&#29575;&#20998;&#24067;&#30340;&#36890;&#29992;&#39046;&#22495;&#32479;&#35745;&#27169;&#22411;&#65292;&#21487;&#29992;&#20110;&#21253;&#25324;&#39044;&#27979;&#12289;&#25554;&#20540;&#21644;&#21464;&#24322;&#20998;&#26512;&#22312;&#20869;&#30340;&#25968;&#25454;&#20998;&#26512;&#20219;&#21153;&#12290;BayesNF&#23558;&#29992;&#20110;&#39640;&#23481;&#37327;&#20989;&#25968;&#20272;&#35745;&#30340;&#26032;&#22411;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#19982;&#29992;&#20110;&#40065;&#26834;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#30456;&#32467;&#21512;&#12290;&#36890;&#36807;&#22312;&#23450;&#20041;&#20808;&#39564;&#20998;&#24067;&#26041;&#38754;&#36827;&#34892;&#24207;&#21015;&#21270;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07657v1 Announce Type: cross  Abstract: Spatiotemporal datasets, which consist of spatially-referenced time series, are ubiquitous in many scientific and business-intelligence applications, such as air pollution monitoring, disease tracking, and cloud-demand forecasting. As modern datasets continue to increase in size and complexity, there is a growing need for new statistical methods that are flexible enough to capture complex spatiotemporal dynamics and scalable enough to handle large prediction problems. This work presents the Bayesian Neural Field (BayesNF), a domain-general statistical model for inferring rich probability distributions over a spatiotemporal domain, which can be used for data-analysis tasks including forecasting, interpolation, and variography. BayesNF integrates a novel deep neural network architecture for high-capacity function estimation with hierarchical Bayesian inference for robust uncertainty quantification. By defining the prior through a sequenc
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#39318;&#27425;&#25552;&#20986;&#20102;&#20026;&#24503;&#22269;&#36830;&#32493;&#26085;&#20869;&#24066;&#22330;&#20132;&#26131;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#36125;&#21494;&#26031;&#39044;&#27979;&#65292;&#32771;&#34385;&#20102;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;2022&#24180;&#30340;&#30005;&#21147;&#20215;&#26684;&#39564;&#35777;&#20013;&#21462;&#24471;&#20102;&#32479;&#35745;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2403.05441</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#23618;&#27425;&#27010;&#29575;&#30340;&#26085;&#20869;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Bayesian Hierarchical Probabilistic Forecasting of Intraday Electricity Prices
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05441
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#39318;&#27425;&#25552;&#20986;&#20102;&#20026;&#24503;&#22269;&#36830;&#32493;&#26085;&#20869;&#24066;&#22330;&#20132;&#26131;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#36125;&#21494;&#26031;&#39044;&#27979;&#65292;&#32771;&#34385;&#20102;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;2022&#24180;&#30340;&#30005;&#21147;&#20215;&#26684;&#39564;&#35777;&#20013;&#21462;&#24471;&#20102;&#32479;&#35745;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#39318;&#27425;&#25552;&#20986;&#20102;&#23545;&#24503;&#22269;&#36830;&#32493;&#26085;&#20869;&#24066;&#22330;&#20132;&#26131;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#36125;&#21494;&#26031;&#39044;&#27979;&#30340;&#30740;&#31350;&#65292;&#20805;&#20998;&#32771;&#34385;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#21464;&#37327;&#26159;IDFull&#20215;&#26684;&#25351;&#25968;&#65292;&#39044;&#27979;&#20197;&#21518;&#39564;&#39044;&#27979;&#20998;&#24067;&#30340;&#24418;&#24335;&#32473;&#20986;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;2022&#24180;&#26497;&#24230;&#27874;&#21160;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#39564;&#35777;&#65292;&#22312;&#20043;&#21069;&#20960;&#20046;&#27809;&#26377;&#25104;&#20026;&#39044;&#27979;&#30740;&#31350;&#23545;&#35937;&#12290;&#20316;&#20026;&#22522;&#20934;&#27169;&#22411;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#39044;&#27979;&#21019;&#24314;&#26102;&#30340;&#25152;&#26377;&#21487;&#29992;&#26085;&#20869;&#20132;&#26131;&#26469;&#35745;&#31639;IDFull&#30340;&#24403;&#21069;&#20540;&#12290;&#26681;&#25454;&#24369;&#24335;&#26377;&#25928;&#20551;&#35774;&#65292;&#20174;&#26368;&#21518;&#20215;&#26684;&#20449;&#24687;&#24314;&#31435;&#30340;&#22522;&#20934;&#26080;&#27861;&#26174;&#33879;&#25913;&#21892;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#22312;&#28857;&#24230;&#37327;&#21644;&#27010;&#29575;&#35780;&#20998;&#26041;&#38754;&#23384;&#22312;&#30528;&#32479;&#35745;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25361;&#25112;&#20102;&#22312;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#20013;&#20351;&#29992;LASSO&#36827;&#34892;&#29305;&#24449;&#36873;&#25321;&#30340;&#23459;&#24067;&#30340;&#40644;&#37329;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05441v1 Announce Type: cross  Abstract: We present a first study of Bayesian forecasting of electricity prices traded on the German continuous intraday market which fully incorporates parameter uncertainty. Our target variable is the IDFull price index, forecasts are given in terms of posterior predictive distributions. For validation we use the exceedingly volatile electricity prices of 2022, which have hardly been the subject of forecasting studies before. As a benchmark model, we use all available intraday transactions at the time of forecast creation to compute a current value for the IDFull. According to the weak-form efficiency hypothesis, it would not be possible to significantly improve this benchmark built from last price information. We do, however, observe statistically significant improvement in terms of both point measures and probability scores. Finally, we challenge the declared gold standard of using LASSO for feature selection in electricity price forecastin
&lt;/p&gt;</description></item></channel></rss>