<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#25193;&#25955;&#27169;&#22411;&#30340;&#22240;&#26524;&#27169;&#22411; (DCM)&#65292;&#23427;&#21487;&#20197;&#22312;&#21482;&#26377;&#35266;&#27979;&#25968;&#25454;&#21644;&#22240;&#26524;&#22270;&#21487;&#29992;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#24178;&#39044;&#21644;&#21453;&#20107;&#23454;&#25512;&#26029;&#65292;&#20854;&#20855;&#26377;&#36739;&#22909;&#30340;&#34920;&#29616;&#12290;&#21516;&#26102;&#65292;&#35770;&#25991;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#20998;&#26512;&#21453;&#20107;&#23454;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#26356;&#24191;&#27867;&#30340;&#22330;&#26223;&#12290;</title><link>http://arxiv.org/abs/2302.00860</link><description>&lt;p&gt;
&#21033;&#29992;&#25193;&#25955;&#27169;&#22411;&#36827;&#34892;&#24178;&#39044;&#21644;&#21453;&#20107;&#23454;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Interventional and Counterfactual Inference with Diffusion Models. (arXiv:2302.00860v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.00860
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#25193;&#25955;&#27169;&#22411;&#30340;&#22240;&#26524;&#27169;&#22411; (DCM)&#65292;&#23427;&#21487;&#20197;&#22312;&#21482;&#26377;&#35266;&#27979;&#25968;&#25454;&#21644;&#22240;&#26524;&#22270;&#21487;&#29992;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#24178;&#39044;&#21644;&#21453;&#20107;&#23454;&#25512;&#26029;&#65292;&#20854;&#20855;&#26377;&#36739;&#22909;&#30340;&#34920;&#29616;&#12290;&#21516;&#26102;&#65292;&#35770;&#25991;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#20998;&#26512;&#21453;&#20107;&#23454;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#26356;&#24191;&#27867;&#30340;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;&#21482;&#26377;&#35266;&#27979;&#25968;&#25454;&#21644;&#22240;&#26524;&#22270;&#21487;&#29992;&#30340;&#22240;&#26524;&#20805;&#20998;&#35774;&#32622;&#20013;&#22238;&#31572;&#35266;&#27979;&#12289;&#24178;&#39044;&#21644;&#21453;&#20107;&#23454;&#26597;&#35810;&#30340;&#38382;&#39064;&#12290;&#21033;&#29992;&#25193;&#25955;&#27169;&#22411;&#30340;&#26368;&#26032;&#21457;&#23637;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#22522;&#20110;&#25193;&#25955;&#30340;&#22240;&#26524;&#27169;&#22411; (DCM)&#65292;&#26469;&#23398;&#20064;&#29983;&#25104;&#29420;&#29305;&#30340;&#28508;&#22312;&#32534;&#30721;&#30340;&#22240;&#26524;&#26426;&#21046;&#12290;&#36825;&#20123;&#32534;&#30721;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#24178;&#39044;&#19979;&#30452;&#25509;&#37319;&#26679;&#21644;&#36827;&#34892;&#21453;&#20107;&#23454;&#25512;&#26029;&#12290;&#25193;&#25955;&#27169;&#22411;&#22312;&#36825;&#37324;&#26159;&#19968;&#20010;&#33258;&#28982;&#30340;&#36873;&#25321;&#65292;&#22240;&#20026;&#23427;&#20204;&#21487;&#20197;&#23558;&#27599;&#20010;&#33410;&#28857;&#32534;&#30721;&#20026;&#19968;&#20010;&#20195;&#34920;&#22806;&#29983;&#22122;&#22768;&#30340;&#28508;&#22312;&#34920;&#31034;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#35780;&#20272;&#34920;&#26126;&#65292;&#22312;&#22238;&#31572;&#22240;&#26524;&#26597;&#35810;&#26041;&#38754;&#65292;&#19982;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#30456;&#27604;&#65292;&#26377;&#26174;&#30528;&#30340;&#25913;&#36827;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#29702;&#35770;&#32467;&#26524;&#65292;&#20026;&#20998;&#26512;&#19968;&#33324;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#27169;&#22411;&#20013;&#30340;&#21453;&#20107;&#23454;&#20272;&#35745;&#25552;&#20379;&#19968;&#31181;&#26041;&#27861;&#65292;&#36825;&#23545;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#20197;&#22806;&#30340;&#35774;&#32622;&#21487;&#33021;&#20063;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of answering observational, interventional, and counterfactual queries in a causally sufficient setting where only observational data and the causal graph are available. Utilizing the recent developments in diffusion models, we introduce diffusion-based causal models (DCM) to learn causal mechanisms, that generate unique latent encodings. These encodings enable us to directly sample under interventions and perform abduction for counterfactuals. Diffusion models are a natural fit here, since they can encode each node to a latent representation that acts as a proxy for exogenous noise. Our empirical evaluations demonstrate significant improvements over existing state-of-the-art methods for answering causal queries. Furthermore, we provide theoretical results that offer a methodology for analyzing counterfactual estimation in general encoder-decoder models, which could be useful in settings beyond our proposed approach.
&lt;/p&gt;</description></item></channel></rss>