<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#24341;&#20837;&#20061;&#31181;&#38598;&#25104;&#23398;&#20064;&#22120;&#24182;&#21033;&#29992;&#26032;&#39062;&#29305;&#24449;&#24037;&#31243;&#31574;&#30053;&#65292;&#32467;&#21512;&#22810;&#31181;&#20998;&#20301;&#25968;&#22238;&#24402;&#31639;&#27861;&#65292;&#22635;&#34917;&#20102;&#31354;&#38388;&#25554;&#20540;&#20013;&#38598;&#25104;&#23398;&#20064;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#39046;&#22495;&#30340;&#30740;&#31350;&#31354;&#30333;</title><link>https://arxiv.org/abs/2403.10567</link><description>&lt;p&gt;
&#38598;&#25104;&#23398;&#20064;&#20013;&#30340;&#21355;&#26143;&#38477;&#27700;&#31354;&#38388;&#25554;&#20540;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Uncertainty estimation in spatial interpolation of satellite precipitation with ensemble learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10567
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20061;&#31181;&#38598;&#25104;&#23398;&#20064;&#22120;&#24182;&#21033;&#29992;&#26032;&#39062;&#29305;&#24449;&#24037;&#31243;&#31574;&#30053;&#65292;&#32467;&#21512;&#22810;&#31181;&#20998;&#20301;&#25968;&#22238;&#24402;&#31639;&#27861;&#65292;&#22635;&#34917;&#20102;&#31354;&#38388;&#25554;&#20540;&#20013;&#38598;&#25104;&#23398;&#20064;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#39046;&#22495;&#30340;&#30740;&#31350;&#31354;&#30333;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10567v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#30340; &#25688;&#35201;&#65306;&#27010;&#29575;&#20998;&#24067;&#24418;&#24335;&#30340;&#39044;&#27979;&#23545;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#12290;&#20998;&#20301;&#25968;&#22238;&#24402;&#22312;&#31354;&#38388;&#25554;&#20540;&#35774;&#32622;&#20013;&#33021;&#22815;&#21512;&#24182;&#36965;&#24863;&#21644;&#38632;&#37327;&#25968;&#25454;&#65292;&#23454;&#29616;&#27492;&#30446;&#26631;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#24773;&#22659;&#19979;&#65292;&#20998;&#20301;&#25968;&#22238;&#24402;&#31639;&#27861;&#30340;&#38598;&#25104;&#23398;&#20064;&#23578;&#26410;&#34987;&#30740;&#31350;&#12290;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#20061;&#31181;&#22522;&#20110;&#20998;&#20301;&#25968;&#30340;&#38598;&#25104;&#23398;&#20064;&#22120;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#22823;&#22411;&#38477;&#27700;&#25968;&#25454;&#38598;&#26469;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29305;&#24449;&#24037;&#31243;&#31574;&#30053;&#65292;&#23558;&#39044;&#27979;&#22240;&#23376;&#20943;&#23569;&#20026;&#30456;&#20851;&#20301;&#32622;&#30340;&#21152;&#26435;&#36317;&#31163;&#21355;&#26143;&#38477;&#27700;&#65292;&#32467;&#21512;&#20301;&#32622;&#39640;&#31243;&#12290;&#25105;&#20204;&#30340;&#38598;&#25104;&#23398;&#20064;&#22120;&#21253;&#25324;&#20845;&#31181;&#22534;&#21472;&#26041;&#27861;&#21644;&#19977;&#31181;&#31616;&#21333;&#26041;&#27861;&#65288;&#22343;&#20540;&#12289;&#20013;&#20301;&#25968;&#12289;&#26368;&#20339;&#32452;&#21512;&#22120;&#65289;&#65292;&#32467;&#21512;&#20102;&#20845;&#31181;&#20010;&#20307;&#31639;&#27861;&#65306;&#20998;&#20301;&#25968;&#22238;&#24402;(QR)&#12289;&#20998;&#20301;&#25968;&#22238;&#24402;&#26862;&#26519;(QRF)&#12289;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;(GRF)&#12289;&#26799;&#24230;&#25552;&#21319;&#26426;(GBM)&#12289;&#36731;&#37327;&#32423;&#26799;&#24230;&#25552;&#21319;&#26426;(LightGBM)&#21644;&#20998;&#20301;&#25968;&#22238;&#24402;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10567v1 Announce Type: new  Abstract: Predictions in the form of probability distributions are crucial for decision-making. Quantile regression enables this within spatial interpolation settings for merging remote sensing and gauge precipitation data. However, ensemble learning of quantile regression algorithms remains unexplored in this context. Here, we address this gap by introducing nine quantile-based ensemble learners and applying them to large precipitation datasets. We employed a novel feature engineering strategy, reducing predictors to distance-weighted satellite precipitation at relevant locations, combined with location elevation. Our ensemble learners include six stacking and three simple methods (mean, median, best combiner), combining six individual algorithms: quantile regression (QR), quantile regression forests (QRF), generalized random forests (GRF), gradient boosting machines (GBM), light gradient boosting machines (LightGBM), and quantile regression neur
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;POTNet&#30340;&#29983;&#25104;&#24314;&#27169;&#32593;&#32476;&#65292;&#22522;&#20110;&#36793;&#32536;&#24809;&#32602;&#30340;Wasserstein&#25439;&#22833;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#24314;&#27169;&#21516;&#26102;&#21253;&#21547;&#20998;&#31867;&#21644;&#36830;&#32493;&#29305;&#24449;&#30340;&#34920;&#26684;&#25968;&#25454;&#12290;</title><link>https://arxiv.org/abs/2402.10456</link><description>&lt;p&gt;
&#36890;&#36807;&#24809;&#32602;&#26368;&#20248;&#36755;&#36816;&#32593;&#32476;&#23545;&#34920;&#26684;&#25968;&#25454;&#36827;&#34892;&#29983;&#25104;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Generative Modeling for Tabular Data via Penalized Optimal Transport Network
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10456
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;POTNet&#30340;&#29983;&#25104;&#24314;&#27169;&#32593;&#32476;&#65292;&#22522;&#20110;&#36793;&#32536;&#24809;&#32602;&#30340;Wasserstein&#25439;&#22833;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#24314;&#27169;&#21516;&#26102;&#21253;&#21547;&#20998;&#31867;&#21644;&#36830;&#32493;&#29305;&#24449;&#30340;&#34920;&#26684;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#23398;&#20064;&#34920;&#26684;&#25968;&#25454;&#20013;&#34892;&#30340;&#27010;&#29575;&#20998;&#24067;&#24182;&#29983;&#25104;&#30495;&#23454;&#30340;&#21512;&#25104;&#26679;&#26412;&#30340;&#20219;&#21153;&#26082;&#20851;&#38190;&#21448;&#38750;&#24179;&#20961;&#12290;Wasserstein&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;(WGAN)&#22312;&#29983;&#25104;&#24314;&#27169;&#20013;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#65292;&#35299;&#20915;&#20102;&#20854;&#21069;&#36523;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#34920;&#26684;&#25968;&#25454;&#20013;&#23384;&#22312;&#28151;&#21512;&#25968;&#25454;&#31867;&#22411;&#21644;&#22810;&#27169;&#24577;&#24615;&#65292;&#29983;&#25104;&#22120;&#21644;&#37492;&#21035;&#22120;&#20043;&#38388;&#30340;&#24494;&#22937;&#24179;&#34913;&#20197;&#21450;Wasserstein&#36317;&#31163;&#22312;&#39640;&#32500;&#24230;&#20013;&#30340;&#22266;&#26377;&#19981;&#31283;&#23450;&#24615;&#65292;WGAN&#36890;&#24120;&#26080;&#27861;&#29983;&#25104;&#39640;&#20445;&#30495;&#26679;&#26412;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;POTNet&#65288;&#24809;&#32602;&#26368;&#20248;&#36755;&#36816;&#32593;&#32476;&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#22522;&#20110;&#26032;&#39062;&#12289;&#24378;&#22823;&#19988;&#21487;&#35299;&#37322;&#30340;&#36793;&#38469;&#24809;&#32602;Wasserstein&#65288;MPW&#65289;&#25439;&#22833;&#30340;&#29983;&#25104;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#12290;POTNet&#33021;&#22815;&#26377;&#25928;&#22320;&#24314;&#27169;&#21253;&#21547;&#20998;&#31867;&#21644;&#36830;&#32493;&#29305;&#24449;&#30340;&#34920;&#26684;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10456v1 Announce Type: cross  Abstract: The task of precisely learning the probability distribution of rows within tabular data and producing authentic synthetic samples is both crucial and non-trivial. Wasserstein generative adversarial network (WGAN) marks a notable improvement in generative modeling, addressing the challenges faced by its predecessor, generative adversarial network. However, due to the mixed data types and multimodalities prevalent in tabular data, the delicate equilibrium between the generator and discriminator, as well as the inherent instability of Wasserstein distance in high dimensions, WGAN often fails to produce high-fidelity samples. To this end, we propose POTNet (Penalized Optimal Transport Network), a generative deep neural network based on a novel, robust, and interpretable marginally-penalized Wasserstein (MPW) loss. POTNet can effectively model tabular data containing both categorical and continuous features. Moreover, it offers the flexibil
&lt;/p&gt;</description></item></channel></rss>