<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2402.08941</link><description>&lt;p&gt;
&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Local-Polynomial Estimation for Multivariate Regression Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08941
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#22810;&#20803;&#23616;&#37096;&#32447;&#24615;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#22788;&#29702;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#30340;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20351;&#29992;&#20174;&#36793;&#30028;&#28857;&#21040;&#27431;&#27663;&#36317;&#31163;&#20316;&#20026;&#26631;&#37327;&#36816;&#34892;&#21464;&#37327;&#65292;&#22240;&#27492;&#22810;&#20803;&#35774;&#35745;&#34987;&#22788;&#29702;&#20026;&#21333;&#21464;&#37327;&#35774;&#35745;&#12290;&#28982;&#32780;&#65292;&#36317;&#31163;&#36816;&#34892;&#21464;&#37327;&#19982;&#28176;&#36817;&#26377;&#25928;&#24615;&#30340;&#20551;&#35774;&#19981;&#30456;&#23481;&#12290;&#25105;&#20204;&#23558;&#22810;&#20803;&#35774;&#35745;&#20316;&#20026;&#22810;&#20803;&#22788;&#29702;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#22120;&#30340;&#26032;&#22411;&#28176;&#36817;&#27491;&#24120;&#24615;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#65292;&#24182;&#33021;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#22312;&#21733;&#20262;&#27604;&#20122;&#22870;&#23398;&#37329;&#30740;&#31350;&#20013;&#30340;&#23454;&#35777;&#35828;&#26126;&#25581;&#31034;&#20102;&#27835;&#30103;&#25928;&#24212;&#30340;&#26356;&#20016;&#23500;&#30340;&#24322;&#36136;&#24615;&#65288;&#21253;&#25324;&#20854;&#19981;&#23384;&#22312;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08941v1 Announce Type: new Abstract: We introduce a multivariate local-linear estimator for multivariate regression discontinuity designs in which treatment is assigned by crossing a boundary in the space of running variables. The dominant approach uses the Euclidean distance from a boundary point as the scalar running variable; hence, multivariate designs are handled as uni-variate designs. However, the distance running variable is incompatible with the assumption for asymptotic validity. We handle multivariate designs as multivariate. In this study, we develop a novel asymptotic normality for multivariate local-polynomial estimators. Our estimator is asymptotically valid and can capture heterogeneous treatment effects over the boundary. We demonstrate the effectiveness of our estimator through numerical simulations. Our empirical illustration of a Colombian scholarship study reveals a richer heterogeneity (including its absence) of the treatment effect that is hidden in th
&lt;/p&gt;</description></item></channel></rss>