<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#21487;&#35270;&#21270;&#21644;&#27169;&#25311;&#30740;&#31350;&#25506;&#35752;&#20102;&#38543;&#26426;&#26862;&#26519;&#30340;&#34892;&#20026;&#65292;&#21457;&#29616;&#22312;&#35757;&#32451;&#38598;&#23384;&#22312;&#36807;&#25311;&#21512;&#30340;&#24773;&#20917;&#19979;&#65292;&#27169;&#22411;&#22312;&#27979;&#35797;&#25968;&#25454;&#19978;&#34920;&#29616;&#20986;&#20102;&#31454;&#20105;&#21147;&#12290;</title><link>https://arxiv.org/abs/2402.18612</link><description>&lt;p&gt;
&#29702;&#35299;&#38543;&#26426;&#26862;&#26519;&#21644;&#36807;&#25311;&#21512;&#65306;&#19968;&#39033;&#21487;&#35270;&#21270;&#21644;&#27169;&#25311;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Understanding random forests and overfitting: a visualization and simulation study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18612
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#36890;&#36807;&#21487;&#35270;&#21270;&#21644;&#27169;&#25311;&#30740;&#31350;&#25506;&#35752;&#20102;&#38543;&#26426;&#26862;&#26519;&#30340;&#34892;&#20026;&#65292;&#21457;&#29616;&#22312;&#35757;&#32451;&#38598;&#23384;&#22312;&#36807;&#25311;&#21512;&#30340;&#24773;&#20917;&#19979;&#65292;&#27169;&#22411;&#22312;&#27979;&#35797;&#25968;&#25454;&#19978;&#34920;&#29616;&#20986;&#20102;&#31454;&#20105;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#26862;&#26519;&#22312;&#20020;&#24202;&#39118;&#38505;&#39044;&#27979;&#24314;&#27169;&#20013;&#21464;&#24471;&#27969;&#34892;&#12290;&#22312;&#19968;&#39033;&#20851;&#20110;&#39044;&#27979;&#21365;&#24034;&#24694;&#24615;&#30340;&#26696;&#20363;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#35757;&#32451;&#38598;&#19978;&#30340;c-&#32479;&#35745;&#20540;&#25509;&#36817;1&#12290;&#23613;&#31649;&#36825;&#34920;&#26126;&#23384;&#22312;&#36807;&#25311;&#21512;&#65292;&#20294;&#22312;&#27979;&#35797;&#25968;&#25454;&#19978;&#34920;&#29616;&#31454;&#20105;&#21147;&#12290;&#25105;&#20204;&#26088;&#22312;&#36890;&#36807;&#65288;1&#65289;&#22312;&#19977;&#20010;&#30495;&#23454;&#26696;&#20363;&#30740;&#31350;&#20013;&#21487;&#35270;&#21270;&#25968;&#25454;&#31354;&#38388;&#21644;&#65288;2&#65289;&#36827;&#34892;&#27169;&#25311;&#30740;&#31350;&#26469;&#29702;&#35299;&#38543;&#26426;&#26862;&#26519;&#30340;&#34892;&#20026;&#12290;&#22312;&#26696;&#20363;&#30740;&#31350;&#20013;&#65292;&#20351;&#29992;&#28909;&#21147;&#22270;&#22312;&#20108;&#32500;&#23376;&#31354;&#38388;&#20013;&#21487;&#35270;&#21270;&#39118;&#38505;&#20272;&#35745;&#12290;&#27169;&#25311;&#30740;&#31350;&#21253;&#25324;48&#20010;&#36923;&#36753;&#25968;&#25454;&#29983;&#25104;&#26426;&#21046;&#65288;DGM&#65289;&#65292;&#21464;&#21270;&#39044;&#27979;&#21464;&#37327;&#20998;&#24067;&#12289;&#39044;&#27979;&#21464;&#37327;&#25968;&#37327;&#12289;&#39044;&#27979;&#21464;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12289;&#30495;&#23454;c-&#32479;&#35745;&#20540;&#21644;&#30495;&#23454;&#39044;&#27979;&#21464;&#37327;&#30340;&#24378;&#24230;&#12290;&#23545;&#20110;&#27599;&#20010;DGM&#65292;&#27169;&#25311;&#29983;&#25104;&#22823;&#23567;&#20026;200&#25110;4000&#30340;1000&#20010;&#35757;&#32451;&#25968;&#25454;&#38598;&#65292;&#24182;&#20351;&#29992;ranger&#21253;&#35757;&#32451;&#26368;&#23567;&#33410;&#28857;&#22823;&#23567;&#20026;2&#25110;20&#30340;&#38543;&#26426;&#26862;&#26519;&#27169;&#22411;&#65292;&#24635;&#20849;&#24471;&#21040;&#20102;192&#20010;&#22330;&#26223;&#12290;&#21487;&#35270;&#21270;&#32467;&#26524;&#34920;&#26126;&#65292;&#27169;&#22411;&#8230;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18612v1 Announce Type: cross  Abstract: Random forests have become popular for clinical risk prediction modelling. In a case study on predicting ovarian malignancy, we observed training c-statistics close to 1. Although this suggests overfitting, performance was competitive on test data. We aimed to understand the behaviour of random forests by (1) visualizing data space in three real world case studies and (2) a simulation study. For the case studies, risk estimates were visualised using heatmaps in a 2-dimensional subspace. The simulation study included 48 logistic data generating mechanisms (DGM), varying the predictor distribution, the number of predictors, the correlation between predictors, the true c-statistic and the strength of true predictors. For each DGM, 1000 training datasets of size 200 or 4000 were simulated and RF models trained with minimum node size 2 or 20 using ranger package, resulting in 192 scenarios in total. The visualizations suggested that the mod
&lt;/p&gt;</description></item></channel></rss>