<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25105;&#20204;&#21457;&#29616;&#22312;&#22238;&#24402;&#20998;&#26512;&#20013;&#65292;&#22810;&#20010;&#22788;&#29702;&#21644;&#28789;&#27963;&#25511;&#21046;&#32452;&#24448;&#24448;&#26080;&#27861;&#31934;&#30830;&#20272;&#35745;&#20984;&#22797;&#21512;&#24179;&#22343;&#20540;&#30340;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#65292;&#32780;&#26159;&#21463;&#21040;&#20854;&#20182;&#22788;&#29702;&#25928;&#24212;&#30340;&#38750;&#20984;&#22797;&#21512;&#24179;&#22343;&#20540;&#30340;&#27745;&#26579;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19977;&#31181;&#36991;&#20813;&#36825;&#31181;&#27745;&#26579;&#20559;&#24046;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;&#37325;&#26032;&#20998;&#26512;&#20061;&#20010;&#23454;&#35777;&#24212;&#29992;&#36824;&#21457;&#29616;&#35266;&#23519;&#30740;&#31350;&#20013;&#23384;&#22312;&#32463;&#27982;&#19978;&#21644;&#32479;&#35745;&#19978;&#26174;&#33879;&#30340;&#27745;&#26579;&#20559;&#24046;&#65292;&#32780;&#23454;&#39564;&#30740;&#31350;&#20013;&#30340;&#27745;&#26579;&#20559;&#24046;&#21017;&#26356;&#21152;&#26377;&#38480;&#12290;</title><link>https://arxiv.org/abs/2106.05024</link><description>&lt;p&gt;
&#32447;&#24615;&#22238;&#24402;&#20013;&#30340;&#27745;&#26579;&#20559;&#24046;
&lt;/p&gt;
&lt;p&gt;
Contamination Bias in Linear Regressions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2106.05024
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#22312;&#22238;&#24402;&#20998;&#26512;&#20013;&#65292;&#22810;&#20010;&#22788;&#29702;&#21644;&#28789;&#27963;&#25511;&#21046;&#32452;&#24448;&#24448;&#26080;&#27861;&#31934;&#30830;&#20272;&#35745;&#20984;&#22797;&#21512;&#24179;&#22343;&#20540;&#30340;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#65292;&#32780;&#26159;&#21463;&#21040;&#20854;&#20182;&#22788;&#29702;&#25928;&#24212;&#30340;&#38750;&#20984;&#22797;&#21512;&#24179;&#22343;&#20540;&#30340;&#27745;&#26579;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19977;&#31181;&#36991;&#20813;&#36825;&#31181;&#27745;&#26579;&#20559;&#24046;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;&#37325;&#26032;&#20998;&#26512;&#20061;&#20010;&#23454;&#35777;&#24212;&#29992;&#36824;&#21457;&#29616;&#35266;&#23519;&#30740;&#31350;&#20013;&#23384;&#22312;&#32463;&#27982;&#19978;&#21644;&#32479;&#35745;&#19978;&#26174;&#33879;&#30340;&#27745;&#26579;&#20559;&#24046;&#65292;&#32780;&#23454;&#39564;&#30740;&#31350;&#20013;&#30340;&#27745;&#26579;&#20559;&#24046;&#21017;&#26356;&#21152;&#26377;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#22810;&#20010;&#22788;&#29702;&#21644;&#28789;&#27963;&#25511;&#21046;&#32452;&#30340;&#22238;&#24402;&#20998;&#26512;&#65292;&#20197;&#28040;&#38500;&#36951;&#28431;&#21464;&#37327;&#20559;&#24046;&#12290;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;&#22238;&#24402;&#36890;&#24120;&#26080;&#27861;&#20272;&#35745;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#30340;&#20984;&#22797;&#21512;&#24179;&#22343;&#20540;-&#30456;&#21453;&#65292;&#27599;&#20010;&#22788;&#29702;&#25928;&#24212;&#30340;&#20272;&#35745;&#37117;&#21463;&#21040;&#20854;&#20182;&#22788;&#29702;&#25928;&#24212;&#30340;&#38750;&#20984;&#22797;&#21512;&#24179;&#22343;&#20540;&#30340;&#27745;&#26579;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#19977;&#31181;&#36991;&#20813;&#27492;&#31867;&#27745;&#26579;&#20559;&#24046;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#21253;&#25324;&#38024;&#23545;&#26368;&#23481;&#26131;&#20272;&#35745;&#30340;&#21152;&#26435;&#24179;&#22343;&#25928;&#24212;&#30340;&#23450;&#21521;&#26041;&#27861;&#12290;&#23545;&#20061;&#20010;&#23454;&#35777;&#24212;&#29992;&#30340;&#37325;&#26032;&#20998;&#26512;&#21457;&#29616;&#35266;&#23519;&#30740;&#31350;&#20013;&#23384;&#22312;&#32463;&#27982;&#19978;&#21644;&#32479;&#35745;&#19978;&#26377;&#24847;&#20041;&#30340;&#27745;&#26579;&#20559;&#24046;&#65307;&#30001;&#20110;&#29305;&#26377;&#25928;&#24212;&#30340;&#24322;&#36136;&#24615;&#65292;&#23454;&#39564;&#30740;&#31350;&#20013;&#30340;&#27745;&#26579;&#20559;&#24046;&#26356;&#20026;&#26377;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2106.05024v4 Announce Type: replace  Abstract: We study regressions with multiple treatments and a set of controls that is flexible enough to purge omitted variable bias. We show that these regressions generally fail to estimate convex averages of heterogeneous treatment effects -- instead, estimates of each treatment's effect are contaminated by non-convex averages of the effects of other treatments. We discuss three estimation approaches that avoid such contamination bias, including the targeting of easiest-to-estimate weighted average effects. A re-analysis of nine empirical applications finds economically and statistically meaningful contamination bias in observational studies; contamination bias in experimental studies is more limited due to idiosyncratic effect heterogeneity.
&lt;/p&gt;</description></item></channel></rss>