<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#38024;&#23545;&#36873;&#25321;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#30340;&#38382;&#39064;&#65292;&#22312;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#21644;&#30830;&#23450;&#25130;&#26029;&#20540;&#26102;&#38754;&#20020;&#22810;&#37325;&#27979;&#35797;&#38382;&#39064;&#65292;&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#32622;&#20449;&#24102;&#26041;&#27861;&#26469;&#35780;&#20272;&#36825;&#20123;&#20010;&#20307;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2310.07973</link><description>&lt;p&gt;
&#23545;&#20110;&#36873;&#25321;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#30340;&#32479;&#35745;&#24615;&#33021;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
Statistical Performance Guarantee for Selecting Those Predicted to Benefit Most from Treatment. (arXiv:2310.07973v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07973
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#36873;&#25321;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#30340;&#38382;&#39064;&#65292;&#22312;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#21644;&#30830;&#23450;&#25130;&#26029;&#20540;&#26102;&#38754;&#20020;&#22810;&#37325;&#27979;&#35797;&#38382;&#39064;&#65292;&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#32622;&#20449;&#24102;&#26041;&#27861;&#26469;&#35780;&#20272;&#36825;&#20123;&#20010;&#20307;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24191;&#27867;&#30340;&#23398;&#31185;&#39046;&#22495;&#20013;&#65292;&#35768;&#22810;&#30740;&#31350;&#20154;&#21592;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26469;&#35782;&#21035;&#19968;&#32452;&#34987;&#31216;&#20026;&#20363;&#22806;&#21453;&#24212;&#32773;&#30340;&#20010;&#20307;&#65292;&#20182;&#20204;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#12290;&#19968;&#20010;&#24120;&#35265;&#30340;&#26041;&#27861;&#21253;&#25324;&#20004;&#20010;&#27493;&#39588;&#12290;&#39318;&#20808;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#20272;&#35745;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#25110;&#20854;&#20195;&#29702;&#12290;&#28982;&#21518;&#30830;&#23450;&#25152;&#24471;&#27835;&#30103;&#20248;&#20808;&#39034;&#24207;&#20998;&#25968;&#30340;&#25130;&#26029;&#20540;&#65292;&#20197;&#36873;&#25321;&#37027;&#20123;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#36825;&#20123;&#20272;&#35745;&#30340;&#27835;&#30103;&#20248;&#20808;&#39034;&#24207;&#20998;&#25968;&#24448;&#24448;&#23384;&#22312;&#20559;&#24046;&#21644;&#22122;&#22768;&#12290;&#27492;&#22806;&#65292;&#21033;&#29992;&#30456;&#21516;&#30340;&#25968;&#25454;&#26082;&#36873;&#25321;&#25130;&#26029;&#20540;&#21448;&#20272;&#35745;&#25152;&#36873;&#20010;&#20307;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#20250;&#36935;&#21040;&#22810;&#37325;&#27979;&#35797;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#32622;&#20449;&#24102;&#26469;&#23454;&#39564;&#24615;&#22320;&#35780;&#20272;&#37027;&#20123;&#27835;&#30103;&#20248;&#20808;&#39034;&#24207;&#20998;&#25968;&#33267;&#23569;&#19982;&#20219;&#20309;&#32473;&#23450;&#37327;&#21270;&#20540;&#30456;&#31561;&#30340;&#20010;&#20307;&#30340;&#25490;&#24207;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;GATES&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Across a wide array of disciplines, many researchers use machine learning (ML) algorithms to identify a subgroup of individuals, called exceptional responders, who are likely to be helped by a treatment the most. A common approach consists of two steps. One first estimates the conditional average treatment effect or its proxy using an ML algorithm. They then determine the cutoff of the resulting treatment prioritization score to select those predicted to benefit most from the treatment. Unfortunately, these estimated treatment prioritization scores are often biased and noisy. Furthermore, utilizing the same data to both choose a cutoff value and estimate the average treatment effect among the selected individuals suffer from a multiple testing problem. To address these challenges, we develop a uniform confidence band for experimentally evaluating the sorted average treatment effect (GATES) among the individuals whose treatment prioritization score is at least as high as any given quant
&lt;/p&gt;</description></item></channel></rss>