<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#22788;&#29702;&#30340;&#22238;&#24402;&#31995;&#25968;&#36890;&#24120;&#19981;&#31561;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65292;&#19988;&#21487;&#33021;&#19981;&#26159;&#30452;&#25509;&#31185;&#23398;&#25110;&#25919;&#31574;&#24863;&#20852;&#36259;&#30340;&#25968;&#37327;&#12290;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#21508;&#31181;&#35299;&#37322;&#12289;&#36793;&#30028;&#21644;&#35786;&#26029;&#36741;&#21161;&#24037;&#20855;&#26469;&#35299;&#37322;&#36825;&#31181;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2403.03299</link><description>&lt;p&gt;
&#29702;&#35299;&#21644;&#36991;&#20813;&#8220;&#22238;&#24402;&#26435;&#37325;&#8221;&#65306;&#24322;&#36136;&#25928;&#24212;&#12289;&#35823;&#35774;&#21644;&#38271;&#20037;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Understanding and avoiding the "weights of regression": Heterogeneous effects, misspecification, and longstanding solutions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03299
&lt;/p&gt;
&lt;p&gt;
&#22788;&#29702;&#30340;&#22238;&#24402;&#31995;&#25968;&#36890;&#24120;&#19981;&#31561;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65292;&#19988;&#21487;&#33021;&#19981;&#26159;&#30452;&#25509;&#31185;&#23398;&#25110;&#25919;&#31574;&#24863;&#20852;&#36259;&#30340;&#25968;&#37327;&#12290;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#21508;&#31181;&#35299;&#37322;&#12289;&#36793;&#30028;&#21644;&#35786;&#26029;&#36741;&#21161;&#24037;&#20855;&#26469;&#35299;&#37322;&#36825;&#31181;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#21162;&#21147;&#36890;&#36807;&#22312;&#22788;&#29702;&#65288;D&#65289;&#21644;&#35266;&#23519;&#21040;&#30340;&#28151;&#26434;&#22240;&#32032;&#65288;X&#65289;&#19978;&#23545;&#32467;&#26524;&#25968;&#25454;&#65288;Y&#65289;&#36827;&#34892;&#22238;&#24402;&#26469;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#12290;&#21363;&#20351;&#19981;&#23384;&#22312;&#26410;&#35266;&#23519;&#21040;&#30340;&#28151;&#26434;&#22240;&#32032;&#65292;&#22788;&#29702;&#30340;&#22238;&#24402;&#31995;&#25968;&#20063;&#20250;&#25253;&#21578;&#20998;&#23618;&#29305;&#23450;&#22788;&#29702;&#25928;&#24212;&#30340;&#21152;&#26435;&#24179;&#22343;&#20540;&#12290;&#24403;&#26080;&#27861;&#25490;&#38500;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#26102;&#65292;&#24471;&#21040;&#30340;&#31995;&#25968;&#36890;&#24120;&#19981;&#31561;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65292;&#20063;&#19981;&#22826;&#21487;&#33021;&#26159;&#30452;&#25509;&#31185;&#23398;&#25110;&#25919;&#31574;&#24863;&#20852;&#36259;&#30340;&#25968;&#37327;&#12290;&#31995;&#25968;&#19982;ATE&#20043;&#38388;&#30340;&#24046;&#24322;&#23548;&#33268;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#21508;&#31181;&#35299;&#37322;&#12289;&#36793;&#30028;&#21644;&#35786;&#26029;&#36741;&#21161;&#24037;&#20855;&#12290;&#25105;&#20204;&#27880;&#24847;&#21040;&#65292;&#22312;&#22788;&#29702;&#25928;&#24212;&#22312;X&#20013;&#26159;&#24322;&#36136;&#30340;&#26102;&#65292;&#23545;Y&#20851;&#20110;D&#21644;X&#30340;&#32447;&#24615;&#22238;&#24402;&#21487;&#33021;&#23384;&#22312;&#35823;&#35774;&#12290;&#22238;&#24402;&#30340;&#8220;&#26435;&#37325;&#8221;&#65292;&#23545;&#27492;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03299v1 Announce Type: cross  Abstract: Researchers in many fields endeavor to estimate treatment effects by regressing outcome data (Y) on a treatment (D) and observed confounders (X). Even absent unobserved confounding, the regression coefficient on the treatment reports a weighted average of strata-specific treatment effects (Angrist, 1998). Where heterogeneous treatment effects cannot be ruled out, the resulting coefficient is thus not generally equal to the average treatment effect (ATE), and is unlikely to be the quantity of direct scientific or policy interest. The difference between the coefficient and the ATE has led researchers to propose various interpretational, bounding, and diagnostic aids (Humphreys, 2009; Aronow and Samii, 2016; Sloczynski, 2022; Chattopadhyay and Zubizarreta, 2023). We note that the linear regression of Y on D and X can be misspecified when the treatment effect is heterogeneous in X. The "weights of regression", for which we provide a new (m
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Variance-Reduced Sketching&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#39640;&#32500;&#24230;&#20013;&#20272;&#35745;&#23494;&#24230;&#20989;&#25968;&#21644;&#38750;&#21442;&#25968;&#22238;&#24402;&#20989;&#25968;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#20989;&#25968;&#27010;&#24565;&#21270;&#20026;&#30697;&#38453;&#65292;&#24182;&#37319;&#29992;&#33609;&#22270;&#25216;&#26415;&#26469;&#38477;&#20302;&#32500;&#24230;&#28798;&#38590;&#24341;&#36215;&#30340;&#26041;&#24046;&#65292;&#23637;&#31034;&#20102;&#40065;&#26834;&#24615;&#33021;&#21644;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2401.11646</link><description>&lt;p&gt;
&#36890;&#36807;&#26041;&#24046;&#38477;&#20302;&#30340;&#33609;&#22270;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Estimation via Variance-Reduced Sketching. (arXiv:2401.11646v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11646
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Variance-Reduced Sketching&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#39640;&#32500;&#24230;&#20013;&#20272;&#35745;&#23494;&#24230;&#20989;&#25968;&#21644;&#38750;&#21442;&#25968;&#22238;&#24402;&#20989;&#25968;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#20989;&#25968;&#27010;&#24565;&#21270;&#20026;&#30697;&#38453;&#65292;&#24182;&#37319;&#29992;&#33609;&#22270;&#25216;&#26415;&#26469;&#38477;&#20302;&#32500;&#24230;&#28798;&#38590;&#24341;&#36215;&#30340;&#26041;&#24046;&#65292;&#23637;&#31034;&#20102;&#40065;&#26834;&#24615;&#33021;&#21644;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#21442;&#25968;&#27169;&#22411;&#22312;&#21508;&#20010;&#31185;&#23398;&#21644;&#24037;&#31243;&#39046;&#22495;&#20013;&#22791;&#21463;&#20851;&#27880;&#12290;&#32463;&#20856;&#30340;&#26680;&#26041;&#27861;&#22312;&#20302;&#32500;&#24773;&#20917;&#19979;&#20855;&#26377;&#25968;&#20540;&#31283;&#23450;&#24615;&#21644;&#32479;&#35745;&#21487;&#38752;&#24615;&#65292;&#20294;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#30001;&#20110;&#32500;&#24230;&#28798;&#38590;&#21464;&#24471;&#19981;&#22815;&#36866;&#29992;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#21517;&#20026;Variance-Reduced Sketching&#65288;VRS&#65289;&#30340;&#26032;&#26694;&#26550;&#65292;&#19987;&#38376;&#29992;&#20110;&#22312;&#38477;&#20302;&#32500;&#24230;&#28798;&#38590;&#30340;&#21516;&#26102;&#22312;&#39640;&#32500;&#24230;&#20013;&#20272;&#35745;&#23494;&#24230;&#20989;&#25968;&#21644;&#38750;&#21442;&#25968;&#22238;&#24402;&#20989;&#25968;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#23558;&#22810;&#21464;&#37327;&#20989;&#25968;&#27010;&#24565;&#21270;&#20026;&#26080;&#38480;&#22823;&#23567;&#30340;&#30697;&#38453;&#65292;&#24182;&#20511;&#37492;&#20102;&#25968;&#20540;&#32447;&#24615;&#20195;&#25968;&#25991;&#29486;&#20013;&#30340;&#19968;&#31181;&#26032;&#30340;&#33609;&#22270;&#25216;&#26415;&#26469;&#38477;&#20302;&#20272;&#35745;&#38382;&#39064;&#20013;&#30340;&#26041;&#24046;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#31995;&#21015;&#30340;&#27169;&#25311;&#23454;&#39564;&#21644;&#30495;&#23454;&#25968;&#25454;&#24212;&#29992;&#23637;&#31034;&#20102;VRS&#30340;&#40065;&#26834;&#24615;&#33021;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#22312;&#35768;&#22810;&#23494;&#24230;&#20272;&#35745;&#38382;&#39064;&#20013;&#65292;VRS&#30456;&#36739;&#20110;&#29616;&#26377;&#30340;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#22120;&#21644;&#32463;&#20856;&#30340;&#26680;&#26041;&#27861;&#34920;&#29616;&#20986;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nonparametric models are of great interest in various scientific and engineering disciplines. Classical kernel methods, while numerically robust and statistically sound in low-dimensional settings, become inadequate in higher-dimensional settings due to the curse of dimensionality. In this paper, we introduce a new framework called Variance-Reduced Sketching (VRS), specifically designed to estimate density functions and nonparametric regression functions in higher dimensions with a reduced curse of dimensionality. Our framework conceptualizes multivariable functions as infinite-size matrices, and facilitates a new sketching technique motivated by numerical linear algebra literature to reduce the variance in estimation problems. We demonstrate the robust numerical performance of VRS through a series of simulated experiments and real-world data applications. Notably, VRS shows remarkable improvement over existing neural network estimators and classical kernel methods in numerous density 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20934;&#24471;&#20998;&#21305;&#37197;&#30340;SAR&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#23454;&#24212;&#29992;&#20013;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#38543;&#26426;&#24102;&#26469;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#35745;&#31639;&#22797;&#26434;&#24230;&#30456;&#23545;&#36739;&#20302;&#12290;</title><link>http://arxiv.org/abs/2305.19721</link><description>&lt;p&gt;
&#38543;&#26426;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#20934;&#24471;&#20998;&#21305;&#37197;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Quasi-Score Matching Estimation for Spatial Autoregressive Model with Random Weights Matrix and Regressors. (arXiv:2305.19721v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19721
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20934;&#24471;&#20998;&#21305;&#37197;&#30340;SAR&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#23454;&#24212;&#29992;&#20013;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#38543;&#26426;&#24102;&#26469;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#35745;&#31639;&#22797;&#26434;&#24230;&#30456;&#23545;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#25968;&#25454;&#25910;&#38598;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#31354;&#38388;&#33258;&#22238;&#24402;&#65288;SAR&#65289;&#27169;&#22411;&#22312;&#23454;&#38469;&#20998;&#26512;&#20013;&#36234;&#26469;&#36234;&#26222;&#36941;&#65292;&#29305;&#21035;&#26159;&#22312;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#26102;&#12290;&#28982;&#32780;&#65292;&#24120;&#29992;&#30340;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65288;QMLE&#65289;&#23545;&#20110;&#22788;&#29702;&#22823;&#22411;&#25968;&#25454;&#19981;&#20855;&#22791;&#21487;&#25193;&#23637;&#24615;&#12290;&#27492;&#22806;&#65292;&#22312;&#32463;&#20856;&#30340;&#31354;&#38388;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#65292;&#24314;&#31435;SAR&#27169;&#22411;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#29305;&#24615;&#26102;&#65292;&#20551;&#35774;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#22343;&#20026;&#38750;&#38543;&#26426;&#30340;&#65292;&#36825;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#21487;&#33021;&#19981;&#22826;&#29616;&#23454;&#12290;&#26412;&#25991;&#21463;&#21040;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#30340;&#21551;&#21457;&#65292;&#25552;&#20986;&#20102;SAR&#27169;&#22411;&#30340;&#20934;&#24471;&#20998;&#21305;&#37197;&#20272;&#35745;&#26041;&#27861;&#12290;&#36825;&#31181;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#20173;&#28982;&#22522;&#20110;&#20284;&#28982;&#65292;&#20294;&#26174;&#33879;&#38477;&#20302;&#20102;QMLE&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#12290;&#24314;&#31435;&#20102;&#38543;&#26426;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#19979;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the rapid advancements in technology for data collection, the application of the spatial autoregressive (SAR) model has become increasingly prevalent in real-world analysis, particularly when dealing with large datasets. However, the commonly used quasi-maximum likelihood estimation (QMLE) for the SAR model is not computationally scalable to handle the data with a large size. In addition, when establishing the asymptotic properties of the parameter estimators of the SAR model, both weights matrix and regressors are assumed to be nonstochastic in classical spatial econometrics, which is perhaps not realistic in real applications. Motivated by the machine learning literature, this paper proposes quasi-score matching estimation for the SAR model. This new estimation approach is still likelihood-based, but significantly reduces the computational complexity of the QMLE. The asymptotic properties of parameter estimators under the random weights matrix and regressors are established, whi
&lt;/p&gt;</description></item></channel></rss>