<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#38544;&#31169;&#20445;&#25252;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#22122;&#22768;&#21709;&#24212;&#21644;&#21327;&#21464;&#37327;&#20197;&#28385;&#36275;&#38544;&#31169;&#20445;&#25252;&#35201;&#27714;&#65292;&#24182;&#24320;&#21457;&#20102;&#32416;&#27491;&#30001;&#22122;&#22768;&#24341;&#20837;&#30340;&#20559;&#24046;&#30340;&#25216;&#26415;&#12290;</title><link>https://arxiv.org/abs/2403.16773</link><description>&lt;p&gt;
&#38544;&#31169;&#20445;&#25252;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Privacy-Protected Spatial Autoregressive Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16773
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#38544;&#31169;&#20445;&#25252;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#22122;&#22768;&#21709;&#24212;&#21644;&#21327;&#21464;&#37327;&#20197;&#28385;&#36275;&#38544;&#31169;&#20445;&#25252;&#35201;&#27714;&#65292;&#24182;&#24320;&#21457;&#20102;&#32416;&#27491;&#30001;&#22122;&#22768;&#24341;&#20837;&#30340;&#20559;&#24046;&#30340;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31354;&#38388;&#33258;&#22238;&#24402;&#65288;SAR&#65289;&#27169;&#22411;&#26159;&#30740;&#31350;&#32593;&#32476;&#25928;&#24212;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#38543;&#30528;&#23545;&#25968;&#25454;&#38544;&#31169;&#30340;&#37325;&#35270;&#22686;&#21152;&#65292;&#25968;&#25454;&#25552;&#20379;&#32773;&#32463;&#24120;&#23454;&#26045;&#38544;&#31169;&#20445;&#25252;&#25514;&#26045;&#65292;&#20351;&#20256;&#32479;&#30340;SAR&#27169;&#22411;&#21464;&#24471;&#19981;&#36866;&#29992;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#24102;&#26377;&#28155;&#21152;&#22122;&#22768;&#21709;&#24212;&#21644;&#21327;&#21464;&#37327;&#30340;&#38544;&#31169;&#20445;&#25252;&#30340;SAR&#27169;&#22411;&#65292;&#20197;&#28385;&#36275;&#38544;&#31169;&#20445;&#25252;&#35201;&#27714;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#30001;&#20110;&#26080;&#27861;&#24314;&#31435;&#20284;&#28982;&#20989;&#25968;&#65292;&#20256;&#32479;&#30340;&#25311;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#21464;&#24471;&#19981;&#21487;&#34892;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#39318;&#20808;&#32771;&#34385;&#20102;&#21482;&#26377;&#22122;&#22768;&#28155;&#21152;&#21709;&#24212;&#30340;&#20284;&#28982;&#20989;&#25968;&#30340;&#26174;&#24335;&#34920;&#36798;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#21327;&#21464;&#37327;&#20013;&#30340;&#22122;&#22768;&#65292;&#23548;&#25968;&#26159;&#26377;&#20559;&#30340;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#21487;&#20197;&#32416;&#27491;&#22122;&#22768;&#24341;&#20837;&#30340;&#20559;&#24046;&#30340;&#25216;&#26415;&#12290;&#30456;&#24212;&#22320;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#20284;&#29275;&#39039;-&#25289;&#24343;&#26862;&#30340;&#31639;&#27861;&#26469;&#33719;&#24471;&#20272;&#35745;&#37327;&#65292;&#20174;&#32780;&#23548;&#33268;&#19968;&#20010;&#20462;&#27491;&#30340;&#20284;&#28982;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16773v1 Announce Type: cross  Abstract: Spatial autoregressive (SAR) models are important tools for studying network effects. However, with an increasing emphasis on data privacy, data providers often implement privacy protection measures that make classical SAR models inapplicable. In this study, we introduce a privacy-protected SAR model with noise-added response and covariates to meet privacy-protection requirements. However, in this scenario, the traditional quasi-maximum likelihood estimator becomes infeasible because the likelihood function cannot be formulated. To address this issue, we first consider an explicit expression for the likelihood function with only noise-added responses. However, the derivatives are biased owing to the noise in the covariates. Therefore, we develop techniques that can correct the biases introduced by noise. Correspondingly, a Newton-Raphson-type algorithm is proposed to obtain the estimator, leading to a corrected likelihood estimator. To
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#30340;&#30446;&#26631;&#26159;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;&#65292;&#36890;&#36807;&#19981;&#23545;&#20854;&#20182;&#21464;&#37327;&#20570;&#22826;&#22810;&#20551;&#35774;&#65292;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#21487;&#35782;&#21035;&#24615;&#32467;&#26524;&#21644;&#20004;&#31181;&#23454;&#29992;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.16048</link><description>&lt;p&gt;
&#23616;&#37096;&#22240;&#26524;&#21457;&#29616;&#20013;&#30340;&#32467;&#26500;&#38480;&#21046;: &#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;
&lt;/p&gt;
&lt;p&gt;
Structural restrictions in local causal discovery: identifying direct causes of a target variable. (arXiv:2307.16048v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.16048
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#30340;&#30446;&#26631;&#26159;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;&#65292;&#36890;&#36807;&#19981;&#23545;&#20854;&#20182;&#21464;&#37327;&#20570;&#22826;&#22810;&#20551;&#35774;&#65292;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#21487;&#35782;&#21035;&#24615;&#32467;&#26524;&#21644;&#20004;&#31181;&#23454;&#29992;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20174;&#35266;&#23519;&#32852;&#21512;&#20998;&#24067;&#20013;&#23398;&#20064;&#30446;&#26631;&#21464;&#37327;&#30340;&#19968;&#32452;&#30452;&#25509;&#21407;&#22240;&#30340;&#38382;&#39064;&#12290;&#23398;&#20064;&#34920;&#31034;&#22240;&#26524;&#32467;&#26500;&#30340;&#26377;&#21521;&#26080;&#29615;&#22270;(DAG)&#26159;&#31185;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#12290;&#24403;&#23436;&#25972;&#30340;DAG&#20174;&#20998;&#24067;&#20013;&#21487;&#35782;&#21035;&#26102;&#65292;&#24050;&#30693;&#26377;&#19968;&#20123;&#32467;&#26524;&#65292;&#20363;&#22914;&#20551;&#35774;&#38750;&#32447;&#24615;&#39640;&#26031;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#12290;&#36890;&#24120;&#65292;&#25105;&#20204;&#21482;&#23545;&#35782;&#21035;&#19968;&#20010;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;&#65288;&#23616;&#37096;&#22240;&#26524;&#32467;&#26500;&#65289;&#65292;&#32780;&#19981;&#26159;&#23436;&#25972;&#30340;DAG&#24863;&#20852;&#36259;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#23545;&#30446;&#26631;&#21464;&#37327;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#30340;&#19981;&#21516;&#20551;&#35774;&#65292;&#35813;&#20551;&#35774;&#19979;&#30452;&#25509;&#21407;&#22240;&#38598;&#21512;&#21487;&#20197;&#20174;&#20998;&#24067;&#20013;&#35782;&#21035;&#20986;&#26469;&#12290;&#22312;&#36825;&#26679;&#20570;&#30340;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#23545;&#38500;&#30446;&#26631;&#21464;&#37327;&#20043;&#22806;&#30340;&#21464;&#37327;&#22522;&#26412;&#19978;&#27809;&#26377;&#20219;&#20309;&#20551;&#35774;&#12290;&#38500;&#20102;&#26032;&#30340;&#21487;&#35782;&#21035;&#24615;&#32467;&#26524;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20004;&#31181;&#20174;&#26377;&#38480;&#38543;&#26426;&#26679;&#26412;&#20272;&#35745;&#30452;&#25509;&#21407;&#22240;&#30340;&#23454;&#29992;&#31639;&#27861;&#65292;&#24182;&#22312;&#20960;&#20010;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of learning a set of direct causes of a target variable from an observational joint distribution. Learning directed acyclic graphs (DAGs) that represent the causal structure is a fundamental problem in science. Several results are known when the full DAG is identifiable from the distribution, such as assuming a nonlinear Gaussian data-generating process. Often, we are only interested in identifying the direct causes of one target variable (local causal structure), not the full DAG. In this paper, we discuss different assumptions for the data-generating process of the target variable under which the set of direct causes is identifiable from the distribution. While doing so, we put essentially no assumptions on the variables other than the target variable. In addition to the novel identifiability results, we provide two practical algorithms for estimating the direct causes from a finite random sample and demonstrate their effectiveness on several benchmark dataset
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.16591</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22240;&#26524;&#20998;&#35299;&#32452;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Causal Decomposition of Group Disparities. (arXiv:2306.16591v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#26469;&#23558;&#32467;&#26524;&#20013;&#30340;&#32452;&#24046;&#24322;&#20998;&#35299;&#20026;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#25429;&#25417;&#20102;&#22522;&#32447;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#21069;&#27839;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#21644;&#22788;&#29702;&#36873;&#25321;&#30340;&#32452;&#24046;&#24322;&#30340;&#36129;&#29486;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#21453;&#20107;&#23454;&#30340;&#26041;&#24335;&#36827;&#34892;&#20102;&#25968;&#23398;&#34920;&#36798;&#65292;&#24182;&#19988;&#33021;&#22815;&#26041;&#20415;&#22320;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;&#29305;&#21035;&#26159;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#22788;&#29702;&#36873;&#25321;&#36827;&#34892;&#30340;&#20998;&#35299;&#37096;&#20998;&#26159;&#29305;&#21035;&#26032;&#39062;&#30340;&#65292;&#25581;&#31034;&#20102;&#19968;&#31181;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26032;&#26426;&#21046;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#22240;&#26524;&#26415;&#35821;&#37325;&#26032;&#23450;&#20041;&#20102;&#32463;&#20856;&#30340;Kitagawa-Blinder-Oaxaca&#20998;&#35299;&#65292;&#36890;&#36807;&#35299;&#37322;&#32452;&#24046;&#24322;&#32780;&#19981;&#26159;&#32452;&#25928;&#24212;&#26469;&#34917;&#20805;&#20102;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#65292;&#24182;&#35299;&#20915;&#20102;&#36817;&#26399;&#38543;&#26426;&#31561;&#21270;&#20998;&#35299;&#30340;&#27010;&#24565;&#22256;&#38590;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#20998;&#35299;&#65292;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#23450;&#20041;&#35780;&#20272;&#21644;&#30456;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#26102;&#32435;&#20837;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a causal framework for decomposing a group disparity in an outcome in terms of an intermediate treatment variable. Our framework captures the contributions of group differences in baseline potential outcome, treatment prevalence, average treatment effect, and selection into treatment. This framework is counterfactually formulated and readily informs policy interventions. The decomposition component for differential selection into treatment is particularly novel, revealing a new mechanism for explaining and ameliorating disparities. This framework reformulates the classic Kitagawa-Blinder-Oaxaca decomposition in causal terms, supplements causal mediation analysis by explaining group disparities instead of group effects, and resolves conceptual difficulties of recent random equalization decompositions. We also provide a conditional decomposition that allows researchers to incorporate covariates in defining the estimands and corresponding interventions. We develop nonparametric
&lt;/p&gt;</description></item></channel></rss>