<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#30740;&#31350;&#39318;&#27425;&#25552;&#20986;&#20102;&#20026;&#24503;&#22269;&#36830;&#32493;&#26085;&#20869;&#24066;&#22330;&#20132;&#26131;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#36125;&#21494;&#26031;&#39044;&#27979;&#65292;&#32771;&#34385;&#20102;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;2022&#24180;&#30340;&#30005;&#21147;&#20215;&#26684;&#39564;&#35777;&#20013;&#21462;&#24471;&#20102;&#32479;&#35745;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;</title><link>https://arxiv.org/abs/2403.05441</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#23618;&#27425;&#27010;&#29575;&#30340;&#26085;&#20869;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Bayesian Hierarchical Probabilistic Forecasting of Intraday Electricity Prices
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05441
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#39318;&#27425;&#25552;&#20986;&#20102;&#20026;&#24503;&#22269;&#36830;&#32493;&#26085;&#20869;&#24066;&#22330;&#20132;&#26131;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#36125;&#21494;&#26031;&#39044;&#27979;&#65292;&#32771;&#34385;&#20102;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;2022&#24180;&#30340;&#30005;&#21147;&#20215;&#26684;&#39564;&#35777;&#20013;&#21462;&#24471;&#20102;&#32479;&#35745;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#39318;&#27425;&#25552;&#20986;&#20102;&#23545;&#24503;&#22269;&#36830;&#32493;&#26085;&#20869;&#24066;&#22330;&#20132;&#26131;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#36125;&#21494;&#26031;&#39044;&#27979;&#30340;&#30740;&#31350;&#65292;&#20805;&#20998;&#32771;&#34385;&#21442;&#25968;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#21464;&#37327;&#26159;IDFull&#20215;&#26684;&#25351;&#25968;&#65292;&#39044;&#27979;&#20197;&#21518;&#39564;&#39044;&#27979;&#20998;&#24067;&#30340;&#24418;&#24335;&#32473;&#20986;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;2022&#24180;&#26497;&#24230;&#27874;&#21160;&#30340;&#30005;&#21147;&#20215;&#26684;&#36827;&#34892;&#39564;&#35777;&#65292;&#22312;&#20043;&#21069;&#20960;&#20046;&#27809;&#26377;&#25104;&#20026;&#39044;&#27979;&#30740;&#31350;&#23545;&#35937;&#12290;&#20316;&#20026;&#22522;&#20934;&#27169;&#22411;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#39044;&#27979;&#21019;&#24314;&#26102;&#30340;&#25152;&#26377;&#21487;&#29992;&#26085;&#20869;&#20132;&#26131;&#26469;&#35745;&#31639;IDFull&#30340;&#24403;&#21069;&#20540;&#12290;&#26681;&#25454;&#24369;&#24335;&#26377;&#25928;&#20551;&#35774;&#65292;&#20174;&#26368;&#21518;&#20215;&#26684;&#20449;&#24687;&#24314;&#31435;&#30340;&#22522;&#20934;&#26080;&#27861;&#26174;&#33879;&#25913;&#21892;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#22312;&#28857;&#24230;&#37327;&#21644;&#27010;&#29575;&#35780;&#20998;&#26041;&#38754;&#23384;&#22312;&#30528;&#32479;&#35745;&#26174;&#33879;&#30340;&#25913;&#36827;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25361;&#25112;&#20102;&#22312;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#20013;&#20351;&#29992;LASSO&#36827;&#34892;&#29305;&#24449;&#36873;&#25321;&#30340;&#23459;&#24067;&#30340;&#40644;&#37329;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05441v1 Announce Type: cross  Abstract: We present a first study of Bayesian forecasting of electricity prices traded on the German continuous intraday market which fully incorporates parameter uncertainty. Our target variable is the IDFull price index, forecasts are given in terms of posterior predictive distributions. For validation we use the exceedingly volatile electricity prices of 2022, which have hardly been the subject of forecasting studies before. As a benchmark model, we use all available intraday transactions at the time of forecast creation to compute a current value for the IDFull. According to the weak-form efficiency hypothesis, it would not be possible to significantly improve this benchmark built from last price information. We do, however, observe statistically significant improvement in terms of both point measures and probability scores. Finally, we challenge the declared gold standard of using LASSO for feature selection in electricity price forecastin
&lt;/p&gt;</description></item></channel></rss>