<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#22522;&#20110;&#36125;&#21494;&#26031;&#26041;&#27861;&#30340;&#22312;&#32447;&#23398;&#20064;&#22312;&#20844;&#20849;&#21355;&#29983;&#24178;&#39044;&#35745;&#21010;&#20013;&#30340;&#36164;&#28304;&#20998;&#37197;&#20013;&#20855;&#26377;&#37325;&#35201;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#36125;&#21494;&#26031;&#23398;&#20064;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#36125;&#21494;&#26031;&#24314;&#27169;&#21644;&#27748;&#26222;&#26862;&#25277;&#26679;&#25216;&#26415;&#65292;&#33021;&#22815;&#28789;&#27963;&#22320;&#22788;&#29702;&#19978;&#19979;&#25991;&#29615;&#22659;&#21644;&#38750;&#31283;&#24577;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#65292;&#24182;&#19988;&#22312;&#39044;&#31639;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#33021;&#22815;&#24555;&#36895;&#23398;&#20064;&#26410;&#30693;&#30340;&#36716;&#31227;&#21160;&#24577;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#23454;&#29616;&#20102;&#26174;&#33879;&#26356;&#39640;&#30340;&#25910;&#30410;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.04933</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#26041;&#27861;&#30340;&#22312;&#32447;&#23398;&#20064;&#22312;&#20855;&#26377;&#19978;&#19979;&#25991;&#29615;&#22659;&#30340;&#19981;&#23433;&#23425;&#36172;&#21338;&#26426;&#20013;&#30340;&#24212;&#29992;&#20110;&#20844;&#20849;&#21355;&#29983;
&lt;/p&gt;
&lt;p&gt;
A Bayesian Approach to Online Learning for Contextual Restless Bandits with Applications to Public Health
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04933
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#26041;&#27861;&#30340;&#22312;&#32447;&#23398;&#20064;&#22312;&#20844;&#20849;&#21355;&#29983;&#24178;&#39044;&#35745;&#21010;&#20013;&#30340;&#36164;&#28304;&#20998;&#37197;&#20013;&#20855;&#26377;&#37325;&#35201;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#36125;&#21494;&#26031;&#23398;&#20064;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#36125;&#21494;&#26031;&#24314;&#27169;&#21644;&#27748;&#26222;&#26862;&#25277;&#26679;&#25216;&#26415;&#65292;&#33021;&#22815;&#28789;&#27963;&#22320;&#22788;&#29702;&#19978;&#19979;&#25991;&#29615;&#22659;&#21644;&#38750;&#31283;&#24577;&#30340;&#22810;&#33218;&#36172;&#21338;&#26426;&#38382;&#39064;&#65292;&#24182;&#19988;&#22312;&#39044;&#31639;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#33021;&#22815;&#24555;&#36895;&#23398;&#20064;&#26410;&#30693;&#30340;&#36716;&#31227;&#21160;&#24577;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#26041;&#27861;&#23454;&#29616;&#20102;&#26174;&#33879;&#26356;&#39640;&#30340;&#25910;&#30410;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19981;&#23433;&#23425;&#22810;&#33218;&#36172;&#21338;&#26426;&#65288;RMABs&#65289;&#29992;&#20110;&#24314;&#27169;&#20844;&#20849;&#21355;&#29983;&#24178;&#39044;&#35745;&#21010;&#20013;&#30340;&#39034;&#24207;&#36164;&#28304;&#20998;&#37197;&#12290;&#22312;&#36825;&#20123;&#24773;&#26223;&#20013;&#65292;&#28508;&#22312;&#30340;&#36716;&#31227;&#21160;&#24577;&#36890;&#24120;&#26159;&#26410;&#30693;&#30340;&#65292;&#38656;&#35201;&#22312;&#32447;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;RMAB&#22312;&#32447;RL&#26041;&#27861;&#26080;&#27861;&#25972;&#21512;&#21040;&#29616;&#23454;&#19990;&#30028;&#30340;&#20844;&#20849;&#21355;&#29983;&#24212;&#29992;&#20013;&#24120;&#35265;&#30340;&#23646;&#24615;&#65292;&#22914;&#19978;&#19979;&#25991;&#20449;&#24687;&#21644;&#38750;&#31283;&#24577;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#27169;&#22411;&#21644;&#27748;&#26222;&#26862;&#25277;&#26679;&#30340;&#19978;&#19979;&#25991;RMAB&#30340;&#36125;&#21494;&#26031;&#23398;&#20064;&#65288;BCoR&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#22312;&#32447;RL&#26041;&#27861;&#65292;&#21487;&#20197;&#28789;&#27963;&#22320;&#27169;&#25311;&#21508;&#31181;&#22797;&#26434;&#30340;RMAB&#35774;&#32622;&#65292;&#22914;&#19978;&#19979;&#25991;&#21644;&#38750;&#31283;&#24577;&#30340;RMAB&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#19968;&#20010;&#37325;&#35201;&#36129;&#29486;&#26159;&#22312;&#39044;&#31639;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#33021;&#22815;&#20805;&#20998;&#21033;&#29992;&#20869;&#37096;&#21644;&#21508;&#20010;&#33218;&#20043;&#38388;&#30340;&#20849;&#20139;&#20449;&#24687;&#65292;&#22312;&#30456;&#23545;&#30701;&#30340;&#26102;&#38388;&#33539;&#22260;&#20869;&#24555;&#36895;&#23398;&#20064;&#26410;&#30693;&#30340;RMAB&#36716;&#31227;&#21160;&#24577;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;BCoR&#22312;&#26377;&#38480;&#30340;&#26102;&#38388;&#20869;&#23454;&#29616;&#20102;&#26174;&#33879;&#26356;&#39640;&#30340;&#25910;&#30410;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Restless multi-armed bandits (RMABs) are used to model sequential resource allocation in public health intervention programs. In these settings, the underlying transition dynamics are often unknown a priori, requiring online reinforcement learning (RL). However, existing methods in online RL for RMABs cannot incorporate properties often present in real-world public health applications, such as contextual information and non-stationarity. We present Bayesian Learning for Contextual RMABs (BCoR), an online RL approach for RMABs that novelly combines techniques in Bayesian modeling with Thompson sampling to flexibly model a wide range of complex RMAB settings, such as contextual and non-stationary RMABs. A key contribution of our approach is its ability to leverage shared information within and between arms to learn unknown RMAB transition dynamics quickly in budget-constrained settings with relatively short time horizons. Empirically, we show that BCoR achieves substantially higher finit
&lt;/p&gt;</description></item></channel></rss>