<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26500;&#24314;&#26465;&#20214;&#20934;&#38543;&#26426;&#21270;&#26816;&#39564;&#26469;&#35299;&#20915;&#32593;&#32476;&#20013;&#24178;&#25200;&#23384;&#22312;&#26102;&#30340;&#25512;&#29702;&#38382;&#39064;&#65292;&#20351;&#38646;&#20551;&#35774;&#22312;&#21463;&#38480;&#20154;&#21475;&#19978;&#25104;&#20026;&#23574;&#38160;&#12290;</title><link>https://arxiv.org/abs/2403.16673</link><description>&lt;p&gt;
&#32593;&#32476;&#24178;&#25200;&#30340;&#20934;&#38543;&#26426;&#21270;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Quasi-randomization tests for network interference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16673
&lt;/p&gt;
&lt;p&gt;
&#26500;&#24314;&#26465;&#20214;&#20934;&#38543;&#26426;&#21270;&#26816;&#39564;&#26469;&#35299;&#20915;&#32593;&#32476;&#20013;&#24178;&#25200;&#23384;&#22312;&#26102;&#30340;&#25512;&#29702;&#38382;&#39064;&#65292;&#20351;&#38646;&#20551;&#35774;&#22312;&#21463;&#38480;&#20154;&#21475;&#19978;&#25104;&#20026;&#23574;&#38160;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#32463;&#20856;&#30340;&#25512;&#29702;&#26041;&#27861;&#22312;&#20154;&#21475;&#21333;&#20301;&#20043;&#38388;&#23384;&#22312;&#24178;&#25200;&#26102;&#22833;&#25928;&#12290;&#36825;&#24847;&#21619;&#30528;&#19968;&#20010;&#21333;&#20301;&#30340;&#22788;&#29702;&#29366;&#24577;&#20250;&#24433;&#21709;&#20154;&#21475;&#20013;&#20854;&#20182;&#21333;&#20301;&#30340;&#28508;&#22312;&#32467;&#26524;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#27979;&#35797;&#36825;&#31181;&#24433;&#21709;&#30340;&#38646;&#20551;&#35774;&#20250;&#20351;&#38646;&#20551;&#35774;&#38750;&#23574;&#38160;&#12290;&#35299;&#20915;&#36825;&#31181;&#35774;&#32622;&#20013;&#38646;&#20551;&#35774;&#38750;&#23574;&#38160;&#24615;&#30340;&#19968;&#20010;&#26377;&#36259;&#26041;&#27861;&#26159;&#26500;&#24314;&#26465;&#20214;&#38543;&#26426;&#21270;&#26816;&#39564;&#65292;&#20351;&#24471;&#38646;&#20551;&#35774;&#22312;&#21463;&#38480;&#20154;&#21475;&#19978;&#26159;&#23574;&#38160;&#30340;&#12290;&#22312;&#38543;&#26426;&#23454;&#39564;&#20013;&#65292;&#26465;&#20214;&#38543;&#26426;&#21270;&#26816;&#39564;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#26377;&#25928;&#24615;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#33021;&#20250;&#24102;&#26469;&#35745;&#31639;&#25361;&#25112;&#65292;&#22240;&#20026;&#26681;&#25454;&#23454;&#39564;&#35774;&#35745;&#25214;&#21040;&#36825;&#20123;&#36866;&#24403;&#30340;&#23376;&#20154;&#21475;&#21487;&#33021;&#28041;&#21450;&#35299;&#20915;&#19968;&#20010;NP&#38590;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#20154;&#21475;&#20043;&#38388;&#30340;&#32593;&#32476;&#35270;&#20026;&#19968;&#20010;&#38543;&#26426;&#21464;&#37327;&#32780;&#19981;&#26159;&#22266;&#23450;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24314;&#31435;&#26465;&#20214;&#20934;&#38543;&#26426;&#21270;&#26816;&#39564;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#24605;&#24819;&#26159;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16673v1 Announce Type: cross  Abstract: Many classical inferential approaches fail to hold when interference exists among the population units. This amounts to the treatment status of one unit affecting the potential outcome of other units in the population. Testing for such spillover effects in this setting makes the null hypothesis non-sharp. An interesting approach to tackling the non-sharp nature of the null hypothesis in this setup is constructing conditional randomization tests such that the null is sharp on the restricted population. In randomized experiments, conditional randomized tests hold finite sample validity. Such approaches can pose computational challenges as finding these appropriate sub-populations based on experimental design can involve solving an NP-hard problem. In this paper, we view the network amongst the population as a random variable instead of being fixed. We propose a new approach that builds a conditional quasi-randomization test. Our main ide
&lt;/p&gt;</description></item></channel></rss>