<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20998;&#37197;&#31119;&#21033;&#30340;&#26368;&#20248;&#27835;&#30103;&#20998;&#37197;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#26681;&#25454;&#20010;&#20307;&#27835;&#30103;&#25928;&#24212;&#30340;&#26465;&#20214;&#20998;&#20301;&#25968;&#26469;&#20915;&#23450;&#27835;&#30103;&#20998;&#37197;&#65292;&#24182;&#24341;&#20837;&#20102;&#40065;&#26834;&#30340;&#26368;&#23567;&#26368;&#22823;&#21270;&#31574;&#30053;&#26469;&#35299;&#20915;&#23545;&#21453;&#20107;&#23454;&#32467;&#26524;&#32852;&#21512;&#20998;&#24067;&#30340;&#24674;&#22797;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2311.15878</link><description>&lt;p&gt;
&#20998;&#37197;&#31119;&#21033;&#30340;&#25919;&#31574;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Policy Learning with Distributional Welfare. (arXiv:2311.15878v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.15878
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20998;&#37197;&#31119;&#21033;&#30340;&#26368;&#20248;&#27835;&#30103;&#20998;&#37197;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#26681;&#25454;&#20010;&#20307;&#27835;&#30103;&#25928;&#24212;&#30340;&#26465;&#20214;&#20998;&#20301;&#25968;&#26469;&#20915;&#23450;&#27835;&#30103;&#20998;&#37197;&#65292;&#24182;&#24341;&#20837;&#20102;&#40065;&#26834;&#30340;&#26368;&#23567;&#26368;&#22823;&#21270;&#31574;&#30053;&#26469;&#35299;&#20915;&#23545;&#21453;&#20107;&#23454;&#32467;&#26524;&#32852;&#21512;&#20998;&#24067;&#30340;&#24674;&#22797;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#38024;&#23545;&#20998;&#37197;&#31119;&#21033;&#30340;&#26368;&#20248;&#27835;&#30103;&#20998;&#37197;&#31574;&#30053;&#12290;&#22823;&#37096;&#20998;&#20851;&#20110;&#27835;&#30103;&#36873;&#25321;&#30340;&#25991;&#29486;&#37117;&#32771;&#34385;&#20102;&#22522;&#20110;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#65288;ATE&#65289;&#30340;&#21151;&#21033;&#31119;&#21033;&#12290;&#34429;&#28982;&#24179;&#22343;&#31119;&#21033;&#26159;&#30452;&#35266;&#30340;&#65292;&#20294;&#22312;&#20010;&#20307;&#24322;&#36136;&#21270;&#65288;&#20363;&#22914;&#65292;&#23384;&#22312;&#31163;&#32676;&#20540;&#65289;&#24773;&#20917;&#19979;&#21487;&#33021;&#20250;&#20135;&#29983;&#19981;&#29702;&#24819;&#30340;&#20998;&#37197; - &#36825;&#27491;&#26159;&#20010;&#24615;&#21270;&#27835;&#30103;&#24341;&#20837;&#30340;&#21407;&#22240;&#20043;&#19968;&#12290;&#36825;&#20010;&#35266;&#23519;&#35753;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26681;&#25454;&#20010;&#20307;&#27835;&#30103;&#25928;&#24212;&#30340;&#26465;&#20214;&#20998;&#20301;&#25968;&#65288;QoTE&#65289;&#26469;&#20998;&#37197;&#27835;&#30103;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;&#26681;&#25454;&#20998;&#20301;&#25968;&#27010;&#29575;&#30340;&#36873;&#25321;&#65292;&#36825;&#20010;&#20934;&#21017;&#21487;&#20197;&#36866;&#24212;&#35880;&#24910;&#25110;&#31895;&#24515;&#30340;&#20915;&#31574;&#32773;&#12290;&#30830;&#23450;QoTE&#30340;&#25361;&#25112;&#22312;&#20110;&#20854;&#38656;&#35201;&#23545;&#21453;&#20107;&#23454;&#32467;&#26524;&#30340;&#32852;&#21512;&#20998;&#24067;&#26377;&#25152;&#20102;&#35299;&#65292;&#20294;&#21363;&#20351;&#20351;&#29992;&#23454;&#39564;&#25968;&#25454;&#65292;&#36890;&#24120;&#20063;&#24456;&#38590;&#24674;&#22797;&#20986;&#26469;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#40065;&#26834;&#30340;&#26368;&#23567;&#26368;&#22823;&#21270;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
In this paper, we explore optimal treatment allocation policies that target distributional welfare. Most literature on treatment choice has considered utilitarian welfare based on the conditional average treatment effect (ATE). While average welfare is intuitive, it may yield undesirable allocations especially when individuals are heterogeneous (e.g., with outliers) - the very reason individualized treatments were introduced in the first place. This observation motivates us to propose an optimal policy that allocates the treatment based on the conditional quantile of individual treatment effects (QoTE). Depending on the choice of the quantile probability, this criterion can accommodate a policymaker who is either prudent or negligent. The challenge of identifying the QoTE lies in its requirement for knowledge of the joint distribution of the counterfactual outcomes, which is generally hard to recover even with experimental data. Therefore, we introduce minimax policies that are robust 
&lt;/p&gt;</description></item></channel></rss>