<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#36890;&#36807;&#21477;&#27861;&#36317;&#31163;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#25506;&#32034;&#35821;&#35328;&#20851;&#31995;&#65292;&#20351;&#29992;POS trigrams&#26368;&#22823;&#21270;&#25429;&#25417;&#21477;&#27861;&#21464;&#21270;&#65292;&#24314;&#31435;&#35821;&#35328;&#36830;&#25509;&#24182;&#25581;&#31034;&#35821;&#35328;&#23478;&#26063;&#21644;&#32676;&#20307;&#30340;&#31751;&#12290;</title><link>https://arxiv.org/abs/2403.18430</link><description>&lt;p&gt;
&#36890;&#36807;&#21477;&#27861;&#36317;&#31163;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#25506;&#32034;&#35821;&#35328;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Exploring language relations through syntactic distances and geographic proximity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18430
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21477;&#27861;&#36317;&#31163;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#25506;&#32034;&#35821;&#35328;&#20851;&#31995;&#65292;&#20351;&#29992;POS trigrams&#26368;&#22823;&#21270;&#25429;&#25417;&#21477;&#27861;&#21464;&#21270;&#65292;&#24314;&#31435;&#35821;&#35328;&#36830;&#25509;&#24182;&#25581;&#31034;&#35821;&#35328;&#23478;&#26063;&#21644;&#32676;&#20307;&#30340;&#31751;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#35328;&#34987;&#20998;&#20026;&#20849;&#20139;&#30456;&#21516;&#35821;&#35328;&#29305;&#24449;&#30340;&#35821;&#31995;&#12290;&#34429;&#28982;&#36825;&#31181;&#26041;&#27861;&#22312;&#29702;&#35299;&#19981;&#21516;&#35821;&#35328;&#20043;&#38388;&#30340;&#22522;&#22240;&#20851;&#31995;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20294;&#38656;&#35201;&#26356;&#22810;&#30340;&#20998;&#26512;&#26469;&#20934;&#30830;&#37327;&#21270;&#23427;&#20204;&#30340;&#20851;&#32852;&#24615;&#65292;&#29305;&#21035;&#26159;&#22312;&#36739;&#23569;&#30740;&#31350;&#30340;&#35821;&#35328;&#23618;&#38754;&#65292;&#27604;&#22914;&#21477;&#27861;&#12290;&#26412;&#25991;&#20351;&#29992;&#20174;Universal Dependencies&#25968;&#25454;&#38598;&#20013;&#25552;&#21462;&#30340;&#19968;&#31995;&#21015;&#35789;&#24615;&#65288;POS&#65289;&#26469;&#25506;&#32034;&#35821;&#35328;&#36317;&#31163;&#12290;&#22312;&#20449;&#24687;&#35770;&#26694;&#26550;&#20869;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#37319;&#29992;POS&#19977;&#20803;&#32452;&#26368;&#22823;&#21270;&#25429;&#25417;&#21477;&#27861;&#21464;&#21270;&#30340;&#21487;&#33021;&#24615;&#65292;&#21516;&#26102;&#19982;&#21487;&#29992;&#25968;&#25454;&#37327;&#20860;&#23481;&#12290;&#36890;&#36807;&#22522;&#20110;POS&#20998;&#24067;&#30340;&#25104;&#23545;&#36317;&#31163;&#35780;&#20272;&#24314;&#31435;&#35821;&#35328;&#36830;&#25509;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#26126;&#30830;&#23545;&#24212;&#20110;&#20247;&#25152;&#21608;&#30693;&#30340;&#35821;&#35328;&#23478;&#26063;&#21644;&#32676;&#20307;&#30340;&#31751;&#65292;&#24322;&#24120;&#24773;&#20917;&#34987;&#35299;&#37322;&#20026;&#29420;&#29305;&#30340;&#24418;&#24577;&#31867;&#22411;&#23398;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#33719;&#24471;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18430v1 Announce Type: new  Abstract: Languages are grouped into families that share common linguistic traits. While this approach has been successful in understanding genetic relations between diverse languages, more analyses are needed to accurately quantify their relatedness, especially in less studied linguistic levels such as syntax. Here, we explore linguistic distances using series of parts of speech (POS) extracted from the Universal Dependencies dataset. Within an information-theoretic framework, we show that employing POS trigrams maximizes the possibility of capturing syntactic variations while being at the same time compatible with the amount of available data. Linguistic connections are then established by assessing pairwise distances based on the POS distributions. Intriguingly, our analysis reveals definite clusters that correspond to well known language families and groups, with exceptions explained by distinct morphological typologies. Furthermore, we obtain
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29289;&#29702;&#22240;&#26524;&#25512;&#29702;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#26426;&#22120;&#20154;&#22312;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#29615;&#22659;&#20013;&#36827;&#34892;&#27010;&#29575;&#25512;&#29702;&#65292;&#25104;&#21151;&#39044;&#27979;&#31215;&#26408;&#22612;&#31283;&#23450;&#24615;&#24182;&#36873;&#25321;&#19979;&#19968;&#26368;&#20339;&#21160;&#20316;&#12290;</title><link>https://arxiv.org/abs/2403.14488</link><description>&lt;p&gt;
&#22522;&#20110;&#29289;&#29702;&#23398;&#22240;&#26524;&#25512;&#29702;&#30340;&#26426;&#22120;&#20154;&#25805;&#20316;&#20219;&#21153;&#20013;&#23433;&#20840;&#31283;&#20581;&#30340;&#19979;&#19968;&#26368;&#20339;&#21160;&#20316;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Physics-Based Causal Reasoning for Safe &amp; Robust Next-Best Action Selection in Robot Manipulation Tasks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14488
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29289;&#29702;&#22240;&#26524;&#25512;&#29702;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#26426;&#22120;&#20154;&#22312;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#29615;&#22659;&#20013;&#36827;&#34892;&#27010;&#29575;&#25512;&#29702;&#65292;&#25104;&#21151;&#39044;&#27979;&#31215;&#26408;&#22612;&#31283;&#23450;&#24615;&#24182;&#36873;&#25321;&#19979;&#19968;&#26368;&#20339;&#21160;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23433;&#20840;&#39640;&#25928;&#30340;&#29289;&#20307;&#25805;&#20316;&#26159;&#35768;&#22810;&#30495;&#23454;&#19990;&#30028;&#26426;&#22120;&#20154;&#24212;&#29992;&#30340;&#20851;&#38190;&#25512;&#25163;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#25361;&#25112;&#22312;&#20110;&#26426;&#22120;&#20154;&#25805;&#20316;&#24517;&#39035;&#23545;&#19968;&#31995;&#21015;&#20256;&#24863;&#22120;&#21644;&#25191;&#34892;&#22120;&#30340;&#19981;&#30830;&#23450;&#24615;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#29289;&#29702;&#30693;&#35782;&#21644;&#22240;&#26524;&#25512;&#29702;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#35753;&#26426;&#22120;&#20154;&#22312;&#37096;&#20998;&#21487;&#35266;&#23519;&#30340;&#29615;&#22659;&#20013;&#23545;&#20505;&#36873;&#21160;&#20316;&#36827;&#34892;&#27010;&#29575;&#25512;&#29702;&#65292;&#20197;&#23436;&#25104;&#19968;&#20010;&#31215;&#26408;&#22534;&#21472;&#20219;&#21153;&#12290;&#25105;&#20204;&#23558;&#21018;&#20307;&#31995;&#32479;&#21160;&#21147;&#23398;&#30340;&#22522;&#20110;&#29289;&#29702;&#23398;&#30340;&#20223;&#30495;&#19982;&#22240;&#26524;&#36125;&#21494;&#26031;&#32593;&#32476;&#65288;CBN&#65289;&#32467;&#21512;&#36215;&#26469;&#65292;&#23450;&#20041;&#20102;&#26426;&#22120;&#20154;&#20915;&#31574;&#36807;&#31243;&#30340;&#22240;&#26524;&#29983;&#25104;&#27010;&#29575;&#27169;&#22411;&#12290;&#36890;&#36807;&#22522;&#20110;&#20223;&#30495;&#30340;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26694;&#26550;&#25104;&#21151;&#22320;&#33021;&#22815;&#65306;(1) &#39640;&#20934;&#30830;&#24230;&#22320;&#39044;&#27979;&#31215;&#26408;&#22612;&#30340;&#31283;&#23450;&#24615;&#65288;&#39044;&#27979;&#20934;&#30830;&#29575;&#65306;88.6%&#65289;&#65307;&#21644;&#65292;(2) &#20026;&#31215;&#26408;&#22534;&#21472;&#20219;&#21153;&#36873;&#25321;&#19968;&#20010;&#36817;&#20284;&#30340;&#19979;&#19968;&#26368;&#20339;&#21160;&#20316;&#65292;&#20379;&#25972;&#21512;&#30340;&#26426;&#22120;&#20154;&#31995;&#32479;&#25191;&#34892;&#65292;&#23454;&#29616;94.2%&#30340;&#20219;&#21153;&#25104;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14488v1 Announce Type: cross  Abstract: Safe and efficient object manipulation is a key enabler of many real-world robot applications. However, this is challenging because robot operation must be robust to a range of sensor and actuator uncertainties. In this paper, we present a physics-informed causal-inference-based framework for a robot to probabilistically reason about candidate actions in a block stacking task in a partially observable setting. We integrate a physics-based simulation of the rigid-body system dynamics with a causal Bayesian network (CBN) formulation to define a causal generative probabilistic model of the robot decision-making process. Using simulation-based Monte Carlo experiments, we demonstrate our framework's ability to successfully: (1) predict block tower stability with high accuracy (Pred Acc: 88.6%); and, (2) select an approximate next-best action for the block stacking task, for execution by an integrated robot system, achieving 94.2% task succe
&lt;/p&gt;</description></item></channel></rss>