<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#25216;&#26415;&#24341;&#20837;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#23884;&#20837;&#26041;&#26696;&#65292;&#25512;&#26029;&#20986;&#20102;&#30693;&#35782;&#20132;&#38169;&#22320;&#22270;&#65292;&#25581;&#31034;&#20102;&#30693;&#35782;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#32852;&#31995;&#65292;&#24182;&#23637;&#31034;&#20102;&#22810;&#20010;&#24212;&#29992;&#22330;&#26223;&#12290;</title><link>http://arxiv.org/abs/2401.11742</link><description>&lt;p&gt;
&#30693;&#35782;&#23548;&#33322;&#65306;&#20174;&#30740;&#31350;&#36712;&#36857;&#20013;&#25512;&#26029;&#30693;&#35782;&#30340;&#20132;&#38169;&#22320;&#22270;
&lt;/p&gt;
&lt;p&gt;
Knowledge Navigation: Inferring the Interlocking Map of Knowledge from Research Trajectories. (arXiv:2401.11742v2 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11742
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#25216;&#26415;&#24341;&#20837;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#23884;&#20837;&#26041;&#26696;&#65292;&#25512;&#26029;&#20986;&#20102;&#30693;&#35782;&#20132;&#38169;&#22320;&#22270;&#65292;&#25581;&#31034;&#20102;&#30693;&#35782;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#32852;&#31995;&#65292;&#24182;&#23637;&#31034;&#20102;&#22810;&#20010;&#24212;&#29992;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
"&#22914;&#26524;&#25105;&#30475;&#24471;&#26356;&#36828;&#65292;&#37027;&#26159;&#22240;&#20026;&#25105;&#31449;&#22312;&#24040;&#20154;&#30340;&#32937;&#33152;&#19978;&#12290;"&#33406;&#33832;&#20811;&#183;&#29275;&#39039;&#30340;&#33879;&#21517;&#22768;&#26126;&#26263;&#31034;&#20102;&#26032;&#30693;&#35782;&#24314;&#31435;&#22312;&#29616;&#26377;&#22522;&#30784;&#20043;&#19978;&#30340;&#20107;&#23454;&#65292;&#36825;&#24847;&#21619;&#30528;&#30693;&#35782;&#20043;&#38388;&#23384;&#22312;&#30528;&#30456;&#20114;&#20381;&#36182;&#30340;&#20851;&#31995;&#65292;&#32780;&#36825;&#31181;&#20851;&#31995;&#22312;&#31185;&#23398;&#20307;&#31995;&#30340;&#21382;&#21490;&#21457;&#23637;&#20013;&#19968;&#30452;&#26410;&#34987;&#25581;&#31034;&#12290;&#36890;&#36807;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#25216;&#26415;&#65292;&#26412;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#23884;&#20837;&#26041;&#26696;&#65292;&#26088;&#22312;&#25512;&#26029;&#8220;&#30693;&#35782;&#20132;&#38169;&#22320;&#22270;&#8221;&#12290;&#36825;&#20010;&#22320;&#22270;&#26159;&#20174;&#25968;&#30334;&#19975;&#23398;&#32773;&#30340;&#30740;&#31350;&#36712;&#36857;&#20013;&#25512;&#23548;&#20986;&#26469;&#30340;&#65292;&#25581;&#31034;&#20102;&#30693;&#35782;&#20043;&#38388;&#38169;&#32508;&#22797;&#26434;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#39564;&#35777;&#20102;&#25512;&#26029;&#20986;&#30340;&#22320;&#22270;&#26377;&#25928;&#22320;&#21246;&#30011;&#20102;&#23398;&#31185;&#36793;&#30028;&#65292;&#24182;&#25429;&#25417;&#21040;&#20102;&#19981;&#21516;&#27010;&#24565;&#20043;&#38388;&#22797;&#26434;&#30340;&#20851;&#31995;&#12290;&#20132;&#38169;&#22320;&#22270;&#30340;&#23454;&#29992;&#24615;&#36890;&#36807;&#22810;&#20010;&#24212;&#29992;&#23637;&#31034;&#20986;&#26469;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#30693;&#35782;&#31354;&#38388;&#20013;&#30340;&#22810;&#27493;&#31867;&#27604;&#25512;&#29702;&#21644;&#27010;&#24565;&#20043;&#38388;&#30340;&#21151;&#33021;&#36830;&#25509;&#12290;
&lt;/p&gt;
&lt;p&gt;
"If I have seen further, it is by standing on the shoulders of giants," Isaac Newton's renowned statement hints that new knowledge builds upon existing foundations, which means there exists an interdependent relationship between knowledge, which, yet uncovered, is implied in the historical development of scientific systems for hundreds of years. By leveraging natural language processing techniques, this study introduces an innovative embedding scheme designed to infer the "knowledge interlocking map." This map, derived from the research trajectories of millions of scholars, reveals the intricate connections among knowledge. We validate that the inferred map effectively delineates disciplinary boundaries and captures the intricate relationships between diverse concepts. The utility of the interlocking map is showcased through multiple applications. Firstly, we demonstrated the multi-step analogy inferences within the knowledge space and the functional connectivity between concepts in di
&lt;/p&gt;</description></item></channel></rss>