<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23545;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#22522;&#30784;&#20998;&#24067;&#21322;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#19981;&#21463;&#38480;&#21046;&#65292;&#34917;&#20805;&#20102;&#24050;&#26377;&#30340;&#32467;&#26524;&#65292;&#24320;&#36767;&#20102;&#20016;&#23500;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2404.02400</link><description>&lt;p&gt;
&#20851;&#20110;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#25439;&#22833;&#30340;&#25913;&#36827;&#21322;&#21442;&#25968;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
On Improved Semi-parametric Bounds for Tail Probability and Expected Loss
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02400
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23545;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#22522;&#30784;&#20998;&#24067;&#21322;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#19981;&#21463;&#38480;&#21046;&#65292;&#34917;&#20805;&#20102;&#24050;&#26377;&#30340;&#32467;&#26524;&#65292;&#24320;&#36767;&#20102;&#20016;&#23500;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#24403;&#20010;&#21035;&#23454;&#29616;&#26159;&#29420;&#31435;&#30340;&#26102;&#65292;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#34892;&#20026;&#30340;&#22522;&#26412;&#38382;&#39064;&#65292;&#24182;&#22312;&#21322;&#21442;&#25968;&#30340;&#22522;&#30784;&#20998;&#24067;&#26410;&#21463;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#24320;&#21457;&#20102;&#23545;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#30340;&#23574;&#38160;&#30028;&#38480;&#24456;&#22909;&#22320;&#34917;&#20805;&#20102;&#25991;&#29486;&#20013;&#24050;&#32463;&#24314;&#31435;&#30340;&#32467;&#26524;&#65292;&#21253;&#25324;&#22522;&#20110;&#32858;&#21512;&#30340;&#26041;&#27861;&#65292;&#21518;&#32773;&#32463;&#24120;&#26410;&#33021;&#20805;&#20998;&#32771;&#34385;&#29420;&#31435;&#24615;&#24182;&#20351;&#29992;&#19981;&#22815;&#20248;&#38597;&#30340;&#35777;&#26126;&#12290;&#26032;&#30340;&#35265;&#35299;&#21253;&#25324;&#22312;&#38750;&#30456;&#21516;&#24773;&#20917;&#19979;&#30340;&#35777;&#26126;&#65292;&#36798;&#21040;&#30028;&#38480;&#30340;&#20998;&#24067;&#20855;&#26377;&#30456;&#31561;&#30340;&#33539;&#22260;&#23646;&#24615;&#65292;&#24182;&#19988;&#27599;&#20010;&#38543;&#26426;&#21464;&#37327;&#23545;&#24635;&#21644;&#30340;&#26399;&#26395;&#20540;&#30340;&#24433;&#21709;&#21487;&#20197;&#36890;&#36807;&#23545;Korkine&#24658;&#31561;&#24335;&#30340;&#25512;&#24191;&#26469;&#23396;&#31435;&#20986;&#26469;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#26032;&#30340;&#30028;&#38480;&#19981;&#20165;&#34917;&#20805;&#20102;&#29616;&#26377;&#32467;&#26524;&#65292;&#32780;&#19988;&#24320;&#25299;&#20102;&#22823;&#37327;&#30340;&#23454;&#38469;&#24212;&#29992;&#65292;&#21253;&#25324;&#25913;&#36827;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02400v1 Announce Type: new  Abstract: We revisit the fundamental issue of tail behavior of accumulated random realizations when individual realizations are independent, and we develop new sharper bounds on the tail probability and expected linear loss. The underlying distribution is semi-parametric in the sense that it remains unrestricted other than the assumed mean and variance. Our sharp bounds complement well-established results in the literature, including those based on aggregation, which often fail to take full account of independence and use less elegant proofs. New insights include a proof that in the non-identical case, the distributions attaining the bounds have the equal range property, and that the impact of each random variable on the expected value of the sum can be isolated using an extension of the Korkine identity. We show that the new bounds not only complement the extant results but also open up abundant practical applications, including improved pricing 
&lt;/p&gt;</description></item></channel></rss>