<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#22635;&#34917;&#20102;&#22312;&#39640;&#32500;&#29305;&#24449;&#21464;&#37327;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#22810;&#38454;&#27573;&#38745;&#24577;&#27835;&#30103;&#31574;&#30053;&#26412;&#36523;&#36827;&#34892;&#25512;&#26029;&#30340;&#24037;&#20316;&#31354;&#30333;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#24378;&#30340;&#20272;&#35745;&#22120;&#20197;&#25552;&#39640;&#20215;&#20540;&#20989;&#25968;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2301.12553</link><description>&lt;p&gt;
&#22810;&#38454;&#27573;&#38745;&#24577;&#27835;&#30103;&#31574;&#30053;&#30340;&#39640;&#32500;&#29305;&#24449;&#28176;&#36817;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Asymptotic Inference for Multi-Stage Stationary Treatment Policy with High Dimensional Features. (arXiv:2301.12553v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.12553
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22635;&#34917;&#20102;&#22312;&#39640;&#32500;&#29305;&#24449;&#21464;&#37327;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#22810;&#38454;&#27573;&#38745;&#24577;&#27835;&#30103;&#31574;&#30053;&#26412;&#36523;&#36827;&#34892;&#25512;&#26029;&#30340;&#24037;&#20316;&#31354;&#30333;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22686;&#24378;&#30340;&#20272;&#35745;&#22120;&#20197;&#25552;&#39640;&#20215;&#20540;&#20989;&#25968;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#27835;&#30103;&#35268;&#21017;&#26159;&#19968;&#31995;&#21015;&#38024;&#23545;&#20010;&#20307;&#29305;&#24449;&#37327;&#36523;&#23450;&#21046;&#30340;&#22810;&#38454;&#27573;&#20915;&#31574;&#20989;&#25968;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#19968;&#31867;&#37325;&#35201;&#30340;&#27835;&#30103;&#31574;&#30053;&#26159;&#22810;&#38454;&#27573;&#38745;&#24577;&#27835;&#30103;&#31574;&#30053;&#65292;&#20854;&#20351;&#29992;&#30456;&#21516;&#30340;&#20915;&#31574;&#20989;&#25968;&#26469;&#25351;&#23450;&#27835;&#30103;&#20998;&#37197;&#27010;&#29575;&#65292;&#22312;&#20915;&#31574;&#26102;&#22522;&#20110;&#21516;&#26102;&#21253;&#25324;&#22522;&#32447;&#21464;&#37327;&#65288;&#20363;&#22914;&#20154;&#21475;&#32479;&#35745;&#23398;&#65289;&#21644;&#26102;&#21464;&#21464;&#37327;&#65288;&#20363;&#22914;&#24120;&#35268;&#26816;&#27979;&#21040;&#30340;&#30142;&#30149;&#29983;&#29289;&#26631;&#24535;&#29289;&#65289;&#30340;&#19968;&#32452;&#29305;&#24449;&#12290;&#34429;&#28982;&#24050;&#32463;&#26377;&#22823;&#37327;&#25991;&#29486;&#23545;&#19982;&#21160;&#24577;&#27835;&#30103;&#31574;&#30053;&#30456;&#20851;&#30340;&#20215;&#20540;&#20989;&#25968;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#65292;&#20294;&#22312;&#39640;&#32500;&#29305;&#24449;&#21464;&#37327;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#27835;&#30103;&#31574;&#30053;&#26412;&#36523;&#30340;&#24037;&#20316;&#36824;&#24456;&#23569;&#12290;&#25105;&#20204;&#26088;&#22312;&#22635;&#34917;&#36825;&#39033;&#24037;&#20316;&#30340;&#31354;&#30333;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#39318;&#20808;&#22522;&#20110;&#22686;&#24378;&#30340;&#20498;&#25968;&#26435;&#37325;&#20272;&#35745;&#22120;&#20272;&#35745;&#22810;&#38454;&#27573;&#38745;&#24577;&#27835;&#30103;&#31574;&#30053;&#65292;&#20197;&#25552;&#39640;&#20215;&#20540;&#20989;&#25968;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic treatment rules or policies are a sequence of decision functions over multiple stages that are tailored to individual features. One important class of treatment policies for practice, namely multi-stage stationary treatment policies, prescribe treatment assignment probabilities using the same decision function over stages, where the decision is based on the same set of features consisting of both baseline variables (e.g., demographics) and time-evolving variables (e.g., routinely collected disease biomarkers). Although there has been extensive literature to construct valid inference for the value function associated with the dynamic treatment policies, little work has been done for the policies themselves, especially in the presence of high dimensional feature variables. We aim to fill in the gap in this work. Specifically, we first estimate the multistage stationary treatment policy based on an augmented inverse probability weighted estimator for the value function to increase
&lt;/p&gt;</description></item></channel></rss>