<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#22312;&#20004;&#20010;&#23454;&#35777;&#35828;&#26126;&#20013;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20250;&#30772;&#22351;&#19968;&#33324;&#19981;&#26159;&#28857;&#36776;&#35782;&#30340;&#65292;&#20294;&#21487;&#20197;&#26500;&#24314;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#19978;&#19979;&#30028;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#23553;&#38381;&#24418;&#24335;&#30340;&#34920;&#31034;&#26469;&#36827;&#34892;&#28857;&#36776;&#35782;&#12290;</title><link>http://arxiv.org/abs/2306.15000</link><description>&lt;p&gt;
&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#24615;&#25919;&#31574;
&lt;/p&gt;
&lt;p&gt;
Identifying Socially Disruptive Policies. (arXiv:2306.15000v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15000
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#22312;&#20004;&#20010;&#23454;&#35777;&#35828;&#26126;&#20013;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20250;&#30772;&#22351;&#19968;&#33324;&#19981;&#26159;&#28857;&#36776;&#35782;&#30340;&#65292;&#20294;&#21487;&#20197;&#26500;&#24314;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#19978;&#19979;&#30028;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#23553;&#38381;&#24418;&#24335;&#30340;&#34920;&#31034;&#26469;&#36827;&#34892;&#28857;&#36776;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#30772;&#22351;&#21457;&#29983;&#22312;&#25919;&#31574;&#21019;&#24314;&#25110;&#30772;&#22351;&#20102;&#35768;&#22810;&#20010;&#20307;&#20043;&#38388;&#30340;&#32593;&#32476;&#36830;&#25509;&#26102;&#12290;&#23545;&#20110;&#25919;&#31574;&#30340;&#31119;&#21033;&#24433;&#21709;&#35780;&#20272;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#23454;&#35777;&#25991;&#29486;&#24314;&#35758;&#27979;&#37327;&#21644;&#32771;&#34385;&#31038;&#20250;&#30772;&#22351;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#24456;&#23569;&#26377;&#24037;&#20316;&#25551;&#36848;&#23454;&#38469;&#25968;&#25454;&#20013;&#33021;&#22815;&#23398;&#21040;&#20851;&#20110;&#31038;&#20250;&#30772;&#22351;&#30340;&#20869;&#23481;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#22312;&#25991;&#29486;&#20013;&#24456;&#21463;&#27426;&#36814;&#30340;&#30740;&#31350;&#35774;&#35745;&#29992;&#20110;&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20004;&#32452;&#36776;&#35782;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20250;&#30772;&#22351;&#36890;&#24120;&#19981;&#26159;&#28857;&#36776;&#35782;&#30340;&#65292;&#20294;&#30740;&#31350;&#32773;&#21487;&#20197;&#20351;&#29992;&#35266;&#27979;&#21040;&#30340;&#32593;&#32476;&#37051;&#25509;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#26500;&#24314;&#20449;&#24687;&#20016;&#23500;&#30340;&#19978;&#19979;&#30028;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#28857;&#36776;&#35782;&#26469;&#33258;&#20110;&#19968;&#20010;&#29702;&#35770;&#19978;&#26377;&#25152;&#21551;&#21457;&#30340;&#21333;&#35843;&#24615;&#26465;&#20214;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#23553;&#38381;&#24418;&#24335;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#22312;&#20004;&#20010;&#23454;&#35777;&#35828;&#26126;&#20013;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social disruption occurs when a policy creates or destroys many network connections between agents. It is a costly side effect of many interventions and so a growing empirical literature recommends measuring and accounting for social disruption when evaluating the welfare impact of a policy. However, there is currently little work characterizing what can actually be learned about social disruption from data in practice. In this paper, we consider the problem of identifying social disruption in a research design that is popular in the literature. We provide two sets of identification results. First, we show that social disruption is not generally point identified, but informative bounds can be constructed using the eigenvalues of the network adjacency matrices observed by the researcher. Second, we show that point identification follows from a theoretically motivated monotonicity condition, and we derive a closed form representation. We apply our methods in two empirical illustrations a
&lt;/p&gt;</description></item></channel></rss>