<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#21512;&#24182;&#20351;&#29992;&#19981;&#21516;&#36807;&#28388;&#22120;&#35745;&#31639;&#30340;e&#36827;&#31243;&#30340;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#20854;&#22312;&#39034;&#24207;&#25512;&#29702;&#20013;&#30340;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.09698</link><description>&lt;p&gt;
&#21512;&#24182;&#19981;&#21516;&#36807;&#28388;&#22120;&#20013;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Combining Evidence Across Filtrations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09698
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#21512;&#24182;&#20351;&#29992;&#19981;&#21516;&#36807;&#28388;&#22120;&#35745;&#31639;&#30340;e&#36827;&#31243;&#30340;&#26041;&#27861;&#65292;&#25506;&#35752;&#20102;&#20854;&#22312;&#39034;&#24207;&#25512;&#29702;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20219;&#20309;&#26102;&#21051;&#26377;&#25928;&#30340;&#39034;&#24207;&#25512;&#29702;&#20013;&#65292;&#24050;&#30693;&#20219;&#20309;&#21487;&#25509;&#21463;&#30340;&#25512;&#29702;&#26041;&#27861;&#24517;&#39035;&#22522;&#20110;&#27979;&#35797;&#38789;&#21644;&#23427;&#20204;&#30340;&#32452;&#21512;&#24191;&#20041;&#21270;&#65292;&#31216;&#20026;e&#36827;&#31243;&#65292;&#23427;&#20204;&#26159;&#38750;&#36127;&#36827;&#31243;&#65292;&#20854;&#22312;&#20219;&#20309;&#20219;&#24847;&#20572;&#26102;&#30340;&#26399;&#26395;&#19978;&#30028;&#19981;&#36229;&#36807;&#19968;&#12290;e&#36827;&#31243;&#37327;&#21270;&#20102;&#38024;&#23545;&#22797;&#21512;&#38646;&#20551;&#35774;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#30340;&#32047;&#31215;&#35777;&#25454;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#19981;&#21516;&#20449;&#24687;&#38598;&#65288;&#21363;&#36807;&#28388;&#22120;&#65289;&#35745;&#31639;&#30340;e&#36827;&#31243;&#30340;&#21512;&#24182;&#26041;&#27861;&#65292;&#38024;&#23545;&#19968;&#20010;&#38646;&#20551;&#35774;&#12290;&#23613;&#31649;&#22312;&#30456;&#21516;&#36807;&#28388;&#22120;&#19978;&#26500;&#24314;&#30340;e&#36827;&#31243;&#21487;&#20197;&#36731;&#26494;&#22320;&#21512;&#24182;&#65288;&#20363;&#22914;&#65292;&#36890;&#36807;&#24179;&#22343;&#65289;&#65292;&#20294;&#22312;&#19981;&#21516;&#36807;&#28388;&#22120;&#19978;&#26500;&#24314;&#30340;e&#36827;&#31243;&#19981;&#33021;&#37027;&#20040;&#23481;&#26131;&#22320;&#21512;&#24182;&#65292;&#22240;&#20026;&#23427;&#20204;&#22312;&#36739;&#31895;&#30340;&#36807;&#28388;&#22120;&#20013;&#30340;&#26377;&#25928;&#24615;&#19981;&#33021;&#36716;&#25442;&#20026;&#22312;&#26356;&#32454;&#30340;&#36807;&#28388;&#22120;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#25991;&#29486;&#20013;&#19977;&#20010;&#20855;&#20307;&#20363;&#23376;&#65306;&#21487;&#20132;&#25442;&#24615;&#27979;&#35797;&#65292;&#29420;&#31435;&#24615;&#27979;&#35797;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09698v1 Announce Type: cross  Abstract: In anytime-valid sequential inference, it is known that any admissible inference procedure must be based on test martingales and their composite generalization, called e-processes, which are nonnegative processes whose expectation at any arbitrary stopping time is upper-bounded by one. An e-process quantifies the accumulated evidence against a composite null hypothesis over a sequence of outcomes. This paper studies methods for combining e-processes that are computed using different information sets, i.e., filtrations, for a null hypothesis. Even though e-processes constructed on the same filtration can be combined effortlessly (e.g., by averaging), e-processes constructed on different filtrations cannot be combined as easily because their validity in a coarser filtration does not translate to validity in a finer filtration. We discuss three concrete examples of such e-processes in the literature: exchangeability tests, independence te
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#38024;&#23545;&#36873;&#25321;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#30340;&#38382;&#39064;&#65292;&#22312;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#21644;&#30830;&#23450;&#25130;&#26029;&#20540;&#26102;&#38754;&#20020;&#22810;&#37325;&#27979;&#35797;&#38382;&#39064;&#65292;&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#32622;&#20449;&#24102;&#26041;&#27861;&#26469;&#35780;&#20272;&#36825;&#20123;&#20010;&#20307;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2310.07973</link><description>&lt;p&gt;
&#23545;&#20110;&#36873;&#25321;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#30340;&#32479;&#35745;&#24615;&#33021;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
Statistical Performance Guarantee for Selecting Those Predicted to Benefit Most from Treatment. (arXiv:2310.07973v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07973
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#36873;&#25321;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#30340;&#38382;&#39064;&#65292;&#22312;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#21644;&#30830;&#23450;&#25130;&#26029;&#20540;&#26102;&#38754;&#20020;&#22810;&#37325;&#27979;&#35797;&#38382;&#39064;&#65292;&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#32622;&#20449;&#24102;&#26041;&#27861;&#26469;&#35780;&#20272;&#36825;&#20123;&#20010;&#20307;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24191;&#27867;&#30340;&#23398;&#31185;&#39046;&#22495;&#20013;&#65292;&#35768;&#22810;&#30740;&#31350;&#20154;&#21592;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26469;&#35782;&#21035;&#19968;&#32452;&#34987;&#31216;&#20026;&#20363;&#22806;&#21453;&#24212;&#32773;&#30340;&#20010;&#20307;&#65292;&#20182;&#20204;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#12290;&#19968;&#20010;&#24120;&#35265;&#30340;&#26041;&#27861;&#21253;&#25324;&#20004;&#20010;&#27493;&#39588;&#12290;&#39318;&#20808;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#20272;&#35745;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#25110;&#20854;&#20195;&#29702;&#12290;&#28982;&#21518;&#30830;&#23450;&#25152;&#24471;&#27835;&#30103;&#20248;&#20808;&#39034;&#24207;&#20998;&#25968;&#30340;&#25130;&#26029;&#20540;&#65292;&#20197;&#36873;&#25321;&#37027;&#20123;&#26368;&#26377;&#21487;&#33021;&#20174;&#27835;&#30103;&#20013;&#33719;&#30410;&#30340;&#20154;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#36825;&#20123;&#20272;&#35745;&#30340;&#27835;&#30103;&#20248;&#20808;&#39034;&#24207;&#20998;&#25968;&#24448;&#24448;&#23384;&#22312;&#20559;&#24046;&#21644;&#22122;&#22768;&#12290;&#27492;&#22806;&#65292;&#21033;&#29992;&#30456;&#21516;&#30340;&#25968;&#25454;&#26082;&#36873;&#25321;&#25130;&#26029;&#20540;&#21448;&#20272;&#35745;&#25152;&#36873;&#20010;&#20307;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#20250;&#36935;&#21040;&#22810;&#37325;&#27979;&#35797;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#32622;&#20449;&#24102;&#26469;&#23454;&#39564;&#24615;&#22320;&#35780;&#20272;&#37027;&#20123;&#27835;&#30103;&#20248;&#20808;&#39034;&#24207;&#20998;&#25968;&#33267;&#23569;&#19982;&#20219;&#20309;&#32473;&#23450;&#37327;&#21270;&#20540;&#30456;&#31561;&#30340;&#20010;&#20307;&#30340;&#25490;&#24207;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;GATES&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Across a wide array of disciplines, many researchers use machine learning (ML) algorithms to identify a subgroup of individuals, called exceptional responders, who are likely to be helped by a treatment the most. A common approach consists of two steps. One first estimates the conditional average treatment effect or its proxy using an ML algorithm. They then determine the cutoff of the resulting treatment prioritization score to select those predicted to benefit most from the treatment. Unfortunately, these estimated treatment prioritization scores are often biased and noisy. Furthermore, utilizing the same data to both choose a cutoff value and estimate the average treatment effect among the selected individuals suffer from a multiple testing problem. To address these challenges, we develop a uniform confidence band for experimentally evaluating the sorted average treatment effect (GATES) among the individuals whose treatment prioritization score is at least as high as any given quant
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#19968;&#31181;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#35823;&#25253;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#26041;&#27861;&#65292;&#21487;&#20197;&#23545;&#23398;&#26657;&#20998;&#37197;&#23545;&#26410;&#26469;&#32467;&#26524;&#20135;&#29983;&#30340;&#24433;&#21709;&#36827;&#34892;&#20934;&#30830;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#21046;&#65292;&#24182;&#33021;&#22815;&#24471;&#21040;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;</title><link>http://arxiv.org/abs/2307.14282</link><description>&lt;p&gt;
&#21305;&#37197;&#26426;&#21046;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#19982;&#31574;&#30053;&#24615;&#25253;&#21578;&#20559;&#22909;
&lt;/p&gt;
&lt;p&gt;
Causal Effects in Matching Mechanisms with Strategically Reported Preferences. (arXiv:2307.14282v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14282
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#19968;&#31181;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#35823;&#25253;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#26041;&#27861;&#65292;&#21487;&#20197;&#23545;&#23398;&#26657;&#20998;&#37197;&#23545;&#26410;&#26469;&#32467;&#26524;&#20135;&#29983;&#30340;&#24433;&#21709;&#36827;&#34892;&#20934;&#30830;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#21046;&#65292;&#24182;&#33021;&#22815;&#24471;&#21040;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20013;&#22830;&#26426;&#26500;&#20351;&#29992;&#20998;&#37197;&#26426;&#21046;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;&#23398;&#26657;&#65292;&#20197;&#21453;&#26144;&#23398;&#29983;&#30340;&#20559;&#22909;&#21644;&#23398;&#26657;&#30340;&#20248;&#20808;&#26435;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#23454;&#19990;&#30028;&#30340;&#26426;&#21046;&#20250;&#32473;&#23398;&#29983;&#25552;&#20379;&#19968;&#31181;&#31574;&#30053;&#24615;&#24182;&#35823;&#25253;&#20182;&#20204;&#30340;&#20559;&#22909;&#30340;&#28608;&#21169;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#35782;&#21035;&#22240;&#26524;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#30340;&#35823;&#25253;&#12290;&#35823;&#25253;&#21487;&#33021;&#20351;&#29616;&#26377;&#30340;&#28857;&#35782;&#21035;&#26041;&#27861;&#26080;&#25928;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#26426;&#21046;&#65292;&#21482;&#35201;&#23384;&#22312;&#25551;&#36848;&#35813;&#26426;&#21046;&#20998;&#37197;&#35268;&#21017;&#30340;&#37197;&#23545;&#20998;&#25968;&#21644;&#25130;&#28857;&#12290;&#25105;&#20204;&#20351;&#29992;&#26234;&#21033;&#19968;&#20010;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#30340;&#25968;&#25454;&#65292;&#35813;&#26426;&#21046;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;1000&#22810;&#20010;&#22823;&#23398;&#19987;&#19994;&#32452;&#21512;&#12290;&#23398;&#29983;&#20986;&#20110;&#31574;&#30053;&#32771;&#34385;&#32780;&#34892;&#21160;&#65292;&#22240;&#20026;&#26234;&#21033;&#30340;&#26426;&#21046;&#38480;&#21046;&#20102;&#23398;&#29983;&#22312;&#20559;&#22909;&#20013;&#25552;&#20132;&#30340;&#19987;&#19994;&#25968;&#37327;&#20026;&#20843;&#20010;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing number of central authorities use assignment mechanisms to allocate students to schools in a way that reflects student preferences and school priorities. However, most real-world mechanisms give students an incentive to be strategic and misreport their preferences. In this paper, we provide an identification approach for causal effects of school assignment on future outcomes that accounts for strategic misreporting. Misreporting may invalidate existing point-identification approaches, and we derive sharp bounds for causal effects that are robust to strategic behavior. Our approach applies to any mechanism as long as there exist placement scores and cutoffs that characterize that mechanism's allocation rule. We use data from a deferred acceptance mechanism that assigns students to more than 1,000 university-major combinations in Chile. Students behave strategically because the mechanism in Chile constrains the number of majors that students submit in their preferences to eight
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#28508;&#22312;&#25928;&#29992;Q&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#23558;&#24739;&#32773;&#20559;&#22909;&#32435;&#20837;&#22797;&#21512;&#32467;&#26524;&#30340;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#20013;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#23545;&#26102;&#38388;&#28857;&#21644;&#32467;&#26524;&#25968;&#37327;&#30340;&#38480;&#21046;&#65292;&#33021;&#22815;&#23454;&#29616;&#24378;&#22823;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2307.12022</link><description>&lt;p&gt;
&#23558;&#24739;&#32773;&#20559;&#22909;&#32435;&#20837;Q&#23398;&#20064;&#30340;&#28789;&#27963;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Flexible Framework for Incorporating Patient Preferences Into Q-Learning. (arXiv:2307.12022v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12022
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#28508;&#22312;&#25928;&#29992;Q&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#23558;&#24739;&#32773;&#20559;&#22909;&#32435;&#20837;&#22797;&#21512;&#32467;&#26524;&#30340;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#20013;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#23545;&#26102;&#38388;&#28857;&#21644;&#32467;&#26524;&#25968;&#37327;&#30340;&#38480;&#21046;&#65292;&#33021;&#22815;&#23454;&#29616;&#24378;&#22823;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29616;&#23454;&#19990;&#30028;&#30340;&#21307;&#30103;&#38382;&#39064;&#20013;&#65292;&#36890;&#24120;&#23384;&#22312;&#22810;&#20010;&#31454;&#20105;&#24615;&#30340;&#20851;&#27880;&#28857;&#65292;&#22914;&#27835;&#30103;&#30103;&#25928;&#21644;&#21103;&#20316;&#29992;&#20005;&#37325;&#31243;&#24230;&#12290;&#28982;&#32780;&#65292;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696; (DTRs) &#30340;&#32479;&#35745;&#26041;&#27861;&#36890;&#24120;&#20551;&#35774;&#21482;&#26377;&#19968;&#20010;&#20851;&#27880;&#28857;&#65292;&#32780;&#22788;&#29702;&#22797;&#21512;&#32467;&#26524;&#30340;&#26041;&#27861;&#24456;&#23569;&#65292;&#23384;&#22312;&#37325;&#35201;&#38480;&#21046;&#65292;&#21253;&#25324;&#23545;&#21333;&#20010;&#26102;&#38388;&#28857;&#21644;&#20004;&#20010;&#32467;&#26524;&#30340;&#38480;&#21046;&#12289;&#26080;&#27861;&#32435;&#20837;&#24739;&#32773;&#30340;&#33258;&#36848;&#20559;&#22909;&#20197;&#21450;&#26377;&#38480;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#28508;&#22312;&#25928;&#29992;Q&#23398;&#20064;(LUQ-Learning)&#12290;LUQ-Learning&#37319;&#29992;&#28508;&#22312;&#27169;&#22411;&#26041;&#27861;&#65292;&#33258;&#28982;&#22320;&#23558;Q&#23398;&#20064;&#25193;&#23637;&#21040;&#22797;&#21512;&#32467;&#26524;&#35774;&#32622;&#65292;&#24182;&#20026;&#27599;&#20010;&#24739;&#32773;&#36873;&#25321;&#29702;&#24819;&#30340;&#32467;&#26524;&#26435;&#34913;&#12290;&#19982;&#20043;&#21069;&#30340;&#26041;&#27861;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#20801;&#35768;&#20219;&#24847;&#25968;&#37327;&#30340;&#26102;&#38388;&#28857;&#21644;&#32467;&#26524;&#65292;&#32435;&#20837;&#38472;&#36848;&#30340;&#20559;&#22909;&#65292;&#24182;&#23454;&#29616;&#24378;&#22823;&#30340;&#28176;&#36817;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
In real-world healthcare problems, there are often multiple competing outcomes of interest, such as treatment efficacy and side effect severity. However, statistical methods for estimating dynamic treatment regimes (DTRs) usually assume a single outcome of interest, and the few methods that deal with composite outcomes suffer from important limitations. This includes restrictions to a single time point and two outcomes, the inability to incorporate self-reported patient preferences and limited theoretical guarantees. To this end, we propose a new method to address these limitations, which we dub Latent Utility Q-Learning (LUQ-Learning). LUQ-Learning uses a latent model approach to naturally extend Q-learning to the composite outcome setting and adopt the ideal trade-off between outcomes to each patient. Unlike previous approaches, our framework allows for an arbitrary number of time points and outcomes, incorporates stated preferences and achieves strong asymptotic performance with rea
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#27491;&#21322;&#23450;&#30697;&#38453;&#30340;&#33258;&#19968;&#33268;&#24615;&#32858;&#31867;&#31639;&#27861;&#65288;K-&#24352;&#37327;&#65289;&#65292;&#36890;&#36807;&#32771;&#34385;&#20854;&#29305;&#24449;&#32467;&#26500;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#23558;&#27491;&#21322;&#23450;&#30697;&#38453;&#36827;&#34892;&#20998;&#21306;&#12290;</title><link>http://arxiv.org/abs/2306.06534</link><description>&lt;p&gt;
K-Tensors&#65306;&#23545;&#27491;&#21322;&#23450;&#30697;&#38453;&#36827;&#34892;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
K-Tensors: Clustering Positive Semi-Definite Matrices. (arXiv:2306.06534v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.06534
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#38024;&#23545;&#27491;&#21322;&#23450;&#30697;&#38453;&#30340;&#33258;&#19968;&#33268;&#24615;&#32858;&#31867;&#31639;&#27861;&#65288;K-&#24352;&#37327;&#65289;&#65292;&#36890;&#36807;&#32771;&#34385;&#20854;&#29305;&#24449;&#32467;&#26500;&#65292;&#33021;&#22815;&#26377;&#25928;&#22320;&#23558;&#27491;&#21322;&#23450;&#30697;&#38453;&#36827;&#34892;&#20998;&#21306;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#33258;&#19968;&#33268;&#24615;&#32858;&#31867;&#31639;&#27861;&#65288;K-Tensors&#65289;&#65292;&#29992;&#20110;&#22522;&#20110;&#23427;&#20204;&#30340;&#29305;&#24449;&#32467;&#26500;&#23558;&#27491;&#21322;&#23450;&#30697;&#38453;&#36827;&#34892;&#20998;&#21306;&#12290;&#30001;&#20110;&#27491;&#21322;&#23450;&#30697;&#38453;&#21487;&#20197;&#22312; p&#8805;2 &#30340;&#31354;&#38388;&#20013;&#34920;&#31034;&#20026;&#26925;&#29699;&#20307;&#65292;&#22240;&#27492;&#20445;&#25345;&#23427;&#20204;&#30340;&#32467;&#26500;&#20449;&#24687;&#20197;&#36827;&#34892;&#26377;&#25928;&#30340;&#32858;&#31867;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#30340;&#30697;&#38453;&#32858;&#31867;&#31639;&#27861;&#24120;&#24120;&#28041;&#21450;&#23558;&#30697;&#38453;&#21521;&#37327;&#21270;&#65292;&#23548;&#33268;&#20851;&#38190;&#32467;&#26500;&#20449;&#24687;&#30340;&#20002;&#22833;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#27491;&#21322;&#23450;&#30697;&#38453;&#32467;&#26500;&#20449;&#24687;&#30340;&#36317;&#31163;&#24230;&#37327;&#26469;&#36827;&#34892;&#32858;&#31867;&#12290;&#36825;&#31181;&#36317;&#31163;&#24230;&#37327;&#20351;&#24471;&#32858;&#31867;&#31639;&#27861;&#33021;&#22815;&#32771;&#34385;&#27491;&#21322;&#23450;&#30697;&#38453;&#19982;&#23427;&#20204;&#22312;&#30001;&#19968;&#32452;&#27491;&#21322;&#23450;&#30697;&#38453;&#23450;&#20041;&#30340;&#27491;&#20132;&#21521;&#37327;&#24352;&#25104;&#30340;&#20849;&#21516;&#31354;&#38388;&#19978;&#30340;&#25237;&#24433;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;&#36825;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#32858;&#31867;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a novel self-consistency clustering algorithm ($K$-Tensors) designed for {partitioning a distribution of} positive-semidefinite matrices based on their eigenstructures. As positive semi-definite matrices can be represented as ellipsoids in $\Re^p$, $p \ge 2$, it is critical to maintain their structural information to perform effective clustering. However, traditional clustering algorithms {applied to matrices} often {involve vectorization of} the matrices, resulting in a loss of essential structural information. To address this issue, we propose a distance metric {for clustering} that is specifically based on the structural information of positive semi-definite matrices. This distance metric enables the clustering algorithm to consider the differences between positive semi-definite matrices and their projections onto {a} common space spanned by \thadJulyTen{orthonormal vectors defined from a set of} positive semi-definite matrices. This innovative approach to clus
&lt;/p&gt;</description></item></channel></rss>