<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#28151;&#21512;&#26680;&#27979;&#37327;&#19981;&#30456;&#20284;&#24615;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#20132;&#21449;&#39564;&#35777;&#25214;&#21040;&#26368;&#20339;&#26680;&#24102;&#23485;&#12290;&#35813;&#26041;&#27861;&#21487;&#20026;&#29616;&#26377;&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#32858;&#31867;&#31639;&#27861;&#25552;&#39640;&#32858;&#31867;&#20934;&#30830;&#24230;&#65292;&#36866;&#29992;&#20110;&#21253;&#21547;&#28151;&#21512;&#31867;&#22411;&#25968;&#25454;&#30340;&#27169;&#25311;&#21644;&#23454;&#38469;&#25968;&#25454;&#38598;&#12290;</title><link>http://arxiv.org/abs/2306.01890</link><description>&lt;p&gt;
&#28151;&#21512;&#31867;&#22411;&#25968;&#25454;&#30340;&#26680;&#24230;&#37327;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Kernel Metric Learning for Clustering Mixed-type Data. (arXiv:2306.01890v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01890
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#28151;&#21512;&#26680;&#27979;&#37327;&#19981;&#30456;&#20284;&#24615;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#20132;&#21449;&#39564;&#35777;&#25214;&#21040;&#26368;&#20339;&#26680;&#24102;&#23485;&#12290;&#35813;&#26041;&#27861;&#21487;&#20026;&#29616;&#26377;&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#32858;&#31867;&#31639;&#27861;&#25552;&#39640;&#32858;&#31867;&#20934;&#30830;&#24230;&#65292;&#36866;&#29992;&#20110;&#21253;&#21547;&#28151;&#21512;&#31867;&#22411;&#25968;&#25454;&#30340;&#27169;&#25311;&#21644;&#23454;&#38469;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#36317;&#31163;&#30340;&#32858;&#31867;&#21644;&#20998;&#31867;&#24191;&#27867;&#24212;&#29992;&#20110;&#21508;&#20010;&#39046;&#22495;&#65292;&#20197;&#23558;&#28151;&#21512;&#25968;&#20540;&#21644;&#20998;&#31867;&#25968;&#25454;&#20998;&#32452;&#12290;&#39044;&#23450;&#20041;&#30340;&#36317;&#31163;&#27979;&#37327;&#29992;&#20110;&#26681;&#25454;&#23427;&#20204;&#30340;&#19981;&#30456;&#20284;&#24615;&#26469;&#32858;&#31867;&#25968;&#25454;&#28857;&#12290;&#34429;&#28982;&#23384;&#22312;&#35768;&#22810;&#36866;&#29992;&#20110;&#20855;&#26377;&#32431;&#25968;&#23383;&#23646;&#24615;&#21644;&#20960;&#20010;&#26377;&#24207;&#21644;&#26080;&#24207;&#20998;&#31867;&#25351;&#26631;&#30340;&#25968;&#25454;&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#24230;&#37327;&#26041;&#27861;&#65292;&#20294;&#28151;&#21512;&#22411;&#25968;&#25454;&#30340;&#26368;&#20339;&#36317;&#31163;&#26159;&#19968;&#20010;&#23578;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#35768;&#22810;&#24230;&#37327;&#23558;&#25968;&#23383;&#23646;&#24615;&#36716;&#25442;&#20026;&#20998;&#31867;&#23646;&#24615;&#25110;&#21453;&#20043;&#20134;&#28982;&#12290;&#20182;&#20204;&#23558;&#25968;&#25454;&#28857;&#22788;&#29702;&#20026;&#21333;&#20010;&#23646;&#24615;&#31867;&#22411;&#65292;&#25110;&#32773;&#20998;&#21035;&#35745;&#31639;&#27599;&#20010;&#23646;&#24615;&#20043;&#38388;&#30340;&#36317;&#31163;&#24182;&#23558;&#23427;&#20204;&#30456;&#21152;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24230;&#37327;&#26041;&#27861;&#65292;&#20351;&#29992;&#28151;&#21512;&#26680;&#27979;&#37327;&#19981;&#30456;&#20284;&#24615;&#65292;&#24182;&#36827;&#34892;&#20132;&#21449;&#39564;&#35777;&#26469;&#23547;&#25214;&#26368;&#20339;&#26680;&#24102;&#23485;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23545;&#21253;&#21547;&#32431;&#36830;&#32493;&#65292;&#20998;&#31867;&#21644;&#28151;&#21512;&#31867;&#22411;&#25968;&#25454;&#30340;&#27169;&#25311;&#21644;&#23454;&#38469;&#25968;&#25454;&#38598;&#24212;&#29992;&#20110;&#29616;&#26377;&#30340;&#22522;&#20110;&#36317;&#31163;&#30340;&#32858;&#31867;&#31639;&#27861;&#26102;&#65292;&#25552;&#39640;&#20102;&#32858;&#31867;&#20934;&#30830;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Distance-based clustering and classification are widely used in various fields to group mixed numeric and categorical data. A predefined distance measurement is used to cluster data points based on their dissimilarity. While there exist numerous distance-based measures for data with pure numerical attributes and several ordered and unordered categorical metrics, an optimal distance for mixed-type data is an open problem. Many metrics convert numerical attributes to categorical ones or vice versa. They handle the data points as a single attribute type or calculate a distance between each attribute separately and add them up. We propose a metric that uses mixed kernels to measure dissimilarity, with cross-validated optimal kernel bandwidths. Our approach improves clustering accuracy when utilized for existing distance-based clustering algorithms on simulated and real-world datasets containing pure continuous, categorical, and mixed-type data.
&lt;/p&gt;</description></item></channel></rss>