<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#19979;&#20010;&#20307;&#21270;&#31574;&#30053;&#35780;&#20272;&#19982;&#23398;&#20064;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21482;&#20551;&#35774;&#21322;&#21442;&#25968;&#32467;&#26500;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#26356;&#20934;&#30830;&#22320;&#35780;&#20272;&#21644;&#23398;&#20064;&#26368;&#20248;&#30340;&#20010;&#20307;&#21270;&#22788;&#29702;&#35268;&#21017;&#12290;</title><link>https://arxiv.org/abs/2311.02467</link><description>&lt;p&gt;
&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#19979;&#30340;&#20010;&#20307;&#21270;&#31574;&#30053;&#35780;&#20272;&#19982;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Individualized Policy Evaluation and Learning under Clustered Network Interference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.02467
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#19979;&#20010;&#20307;&#21270;&#31574;&#30053;&#35780;&#20272;&#19982;&#23398;&#20064;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21482;&#20551;&#35774;&#21322;&#21442;&#25968;&#32467;&#26500;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#26356;&#20934;&#30830;&#22320;&#35780;&#20272;&#21644;&#23398;&#20064;&#26368;&#20248;&#30340;&#20010;&#20307;&#21270;&#22788;&#29702;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#29616;&#22312;&#26377;&#24456;&#22810;&#20851;&#20110;&#25919;&#31574;&#35780;&#20272;&#21644;&#23398;&#20064;&#30340;&#25991;&#29486;&#65292;&#20294;&#22823;&#37096;&#20998;&#20043;&#21069;&#30340;&#24037;&#20316;&#37117;&#20551;&#35774;&#19968;&#20010;&#20010;&#20307;&#30340;&#22788;&#29702;&#20998;&#37197;&#19981;&#20250;&#24433;&#21709;&#21478;&#19968;&#20010;&#20010;&#20307;&#30340;&#32467;&#26524;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#24573;&#35270;&#24178;&#25200;&#21487;&#33021;&#23548;&#33268;&#35780;&#20272;&#20559;&#35823;&#21644;&#26080;&#25928;&#30340;&#23398;&#20064;&#31574;&#30053;&#12290;&#20363;&#22914;&#65292;&#22788;&#29702;&#26377;&#24456;&#22810;&#26379;&#21451;&#30340;&#26377;&#24433;&#21709;&#21147;&#30340;&#20010;&#20307;&#21487;&#33021;&#20135;&#29983;&#27491;&#21521;&#28322;&#20986;&#25928;&#24212;&#65292;&#20174;&#32780;&#25913;&#21892;&#20010;&#20307;&#21270;&#22788;&#29702;&#35268;&#21017;&#65288;ITR&#65289;&#30340;&#25972;&#20307;&#24615;&#33021;&#12290;&#25105;&#20204;&#32771;&#34385;&#22312;&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#65288;&#20063;&#31216;&#20026;&#37096;&#20998;&#24178;&#25200;&#65289;&#19979;&#35780;&#20272;&#21644;&#23398;&#20064;&#26368;&#20248;ITR&#30340;&#38382;&#39064;&#65292;&#22312;&#35813;&#38382;&#39064;&#20013;&#65292;&#21333;&#20301;&#32858;&#31867;&#20174;&#19968;&#20010;&#24635;&#20307;&#20013;&#25277;&#26679;&#65292;&#24182;&#19988;&#22312;&#27599;&#20010;&#32858;&#31867;&#20013;&#21333;&#20301;&#20043;&#38388;&#21487;&#33021;&#20114;&#30456;&#24433;&#21709;&#12290;&#19982;&#20197;&#21069;&#30340;&#26041;&#27861;&#24378;&#21046;&#38480;&#21046;&#28322;&#20986;&#25928;&#24212;&#19981;&#21516;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21482;&#20551;&#35774;&#21322;&#21442;&#25968;&#32467;&#26500;&#27169;&#22411;&#65292;&#27599;&#20010;&#21333;&#20301;&#30340;&#32467;&#26524;&#26159;&#32858;&#31867;&#20013;&#30340;&#20010;&#20307;&#22788;&#29702;&#30340;&#21152;&#27861;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
While there now exists a large literature on policy evaluation and learning, much of prior work assumes that the treatment assignment of one unit does not affect the outcome of another unit. Unfortunately, ignoring interference may lead to biased policy evaluation and ineffective learned policies. For example, treating influential individuals who have many friends can generate positive spillover effects, thereby improving the overall performance of an individualized treatment rule (ITR). We consider the problem of evaluating and learning an optimal ITR under clustered network interference (also known as partial interference) where clusters of units are sampled from a population and units may influence one another within each cluster. Unlike previous methods that impose strong restrictions on spillover effects, the proposed methodology only assumes a semiparametric structural model where each unit's outcome is an additive function of individual treatments within the cluster. Under this 
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#28789;&#27963;&#30340;&#31163;&#25955;Hawkes&#36807;&#31243;&#27169;&#22411;&#65292;&#21487;&#20197;&#38598;&#25104;&#19981;&#21516;&#30340;&#27531;&#24046;&#20998;&#24067;&#65292;&#24182;&#23454;&#29616;&#28388;&#27874;&#21382;&#21490;&#27169;&#25311;&#65292;&#25193;&#23637;&#21040;&#22810;&#21464;&#37327;&#27169;&#22411;&#65292;&#19982;Hawkes&#36807;&#31243;&#30456;&#27604;&#65292;&#22312;&#39640;&#39057;&#37329;&#34701;&#25968;&#25454;&#20272;&#35745;&#19978;&#20855;&#26377;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2401.13890</link><description>&lt;p&gt;
&#28789;&#27963;&#27531;&#24046;&#20998;&#24067;&#21644;&#28388;&#27874;&#21382;&#21490;&#27169;&#25311;&#30340;&#31163;&#25955;Hawkes&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Discrete Hawkes process with flexible residual distribution and filtered historical simulation. (arXiv:2401.13890v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13890
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#28789;&#27963;&#30340;&#31163;&#25955;Hawkes&#36807;&#31243;&#27169;&#22411;&#65292;&#21487;&#20197;&#38598;&#25104;&#19981;&#21516;&#30340;&#27531;&#24046;&#20998;&#24067;&#65292;&#24182;&#23454;&#29616;&#28388;&#27874;&#21382;&#21490;&#27169;&#25311;&#65292;&#25193;&#23637;&#21040;&#22810;&#21464;&#37327;&#27169;&#22411;&#65292;&#19982;Hawkes&#36807;&#31243;&#30456;&#27604;&#65292;&#22312;&#39640;&#39057;&#37329;&#34701;&#25968;&#25454;&#20272;&#35745;&#19978;&#20855;&#26377;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#27169;&#22411;&#65292;&#21487;&#20197;&#23558;&#20854;&#35270;&#20026;&#31163;&#25955;&#24847;&#20041;&#19978;&#30340;Hawkes&#36807;&#31243;&#30340;&#25193;&#23637;&#29256;&#26412;&#12290;&#35813;&#27169;&#22411;&#20351;&#24471;&#33021;&#22815;&#38598;&#25104;&#21508;&#31181;&#27531;&#24046;&#20998;&#24067;&#65292;&#21516;&#26102;&#20445;&#30041;&#21407;&#22987;Hawkes&#36807;&#31243;&#30340;&#22522;&#26412;&#23646;&#24615;&#12290;&#36825;&#31181;&#27169;&#22411;&#30340;&#20016;&#23500;&#24615;&#20351;&#24471;&#28388;&#27874;&#21382;&#21490;&#27169;&#25311;&#33021;&#22815;&#26356;&#20934;&#30830;&#22320;&#34701;&#20837;&#21407;&#22987;&#26102;&#38388;&#24207;&#21015;&#30340;&#29305;&#24615;&#12290;&#35813;&#36807;&#31243;&#33258;&#28982;&#22320;&#25193;&#23637;&#21040;&#23481;&#26131;&#23454;&#29616;&#20272;&#35745;&#21644;&#27169;&#25311;&#30340;&#22810;&#21464;&#37327;&#27169;&#22411;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#28789;&#27963;&#27531;&#24046;&#20998;&#24067;&#23545;&#39640;&#39057;&#37329;&#34701;&#25968;&#25454;&#20272;&#35745;&#30340;&#24433;&#21709;&#65292;&#19982;Hawkes&#36807;&#31243;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a new model which can be considered as a extended version of the Hawkes process in a discrete sense. This model enables the integration of various residual distributions while preserving the fundamental properties of the original Hawkes process. The rich nature of this model enables a filtered historical simulation which incorporate the properties of original time series more accurately. The process naturally extends to multi-variate models with easy implementations of estimation and simulation. We investigate the effect of flexible residual distribution on estimation of high frequency financial data compared with the Hawkes process.
&lt;/p&gt;</description></item></channel></rss>