<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#20114;&#32852;&#32593;&#23553;&#38145;&#23545;&#32463;&#27982;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#23553;&#38145;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2309.14630</link><description>&lt;p&gt;
&#33258;&#30001;&#19981;&#36830;&#32493;&#35774;&#35745;&#65306;&#24212;&#29992;&#20110;&#20114;&#32852;&#32593;&#23553;&#38145;&#30340;&#32463;&#27982;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Free Discontinuity Design: With an Application to the Economic Effects of Internet Shutdowns. (arXiv:2309.14630v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14630
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#20114;&#32852;&#32593;&#23553;&#38145;&#23545;&#32463;&#27982;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#23553;&#38145;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#38408;&#20540;&#21487;&#20197;&#20135;&#29983;&#32467;&#26524;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#20174;&#32780;&#25581;&#31034;&#22240;&#26524;&#27934;&#23519;&#21147;&#12290;&#22312;&#35768;&#22810;&#24773;&#22659;&#20013;&#65292;&#22914;&#22320;&#29702;&#29615;&#22659;&#65292;&#36825;&#20123;&#38408;&#20540;&#26159;&#26410;&#30693;&#21644;&#22810;&#21464;&#37327;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#30001;&#27492;&#20135;&#29983;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#36890;&#36807;&#23558;&#22238;&#24402;&#26354;&#38754;&#20998;&#21106;&#25104;&#24179;&#28369;&#21644;&#19981;&#36830;&#32493;&#37096;&#20998;&#12290;&#35813;&#20272;&#35745;&#22120;&#20351;&#29992;&#20102;Mumford-Shah&#20989;&#25968;&#30340;&#20984;&#26494;&#24347;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20854;&#35782;&#21035;&#21644;&#25910;&#25947;&#24615;&#12290;&#20351;&#29992;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20272;&#35745;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#36828;&#36828;&#36229;&#36807;&#20197;&#21069;&#30340;&#20272;&#35745;&#65292;&#24182;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#27492;&#31867;&#23553;&#38145;&#30340;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Thresholds in treatment assignments can produce discontinuities in outcomes, revealing causal insights. In many contexts, like geographic settings, these thresholds are unknown and multivariate. We propose a non-parametric method to estimate the resulting discontinuities by segmenting the regression surface into smooth and discontinuous parts. This estimator uses a convex relaxation of the Mumford-Shah functional, for which we establish identification and convergence. Using our method, we estimate that an internet shutdown in India resulted in a reduction of economic activity by over 50%, greatly surpassing previous estimates and shedding new light on the true cost of such shutdowns for digital economies globally.
&lt;/p&gt;</description></item></channel></rss>