<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#36827;&#34892;&#22238;&#24402;&#21644;&#20998;&#31867;&#30340;&#39044;&#27979;&#26694;&#26550;&#65292;&#24182;&#24341;&#20837;&#20102;&#36866;&#29992;&#20110;&#22797;&#26434;&#35843;&#26597;&#35774;&#35745;&#25968;&#25454;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#31639;&#27861;&#65292;&#20197;&#35780;&#20272;&#32654;&#22269;&#20154;&#32676;&#31958;&#23615;&#30149;&#39118;&#38505;&#12290;</title><link>https://arxiv.org/abs/2403.19752</link><description>&lt;p&gt;
&#20855;&#26377;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#35843;&#26597;&#25968;&#25454;&#28145;&#24230;&#23398;&#20064;&#26694;&#26550;: &#35780;&#20272;&#21644;&#39044;&#27979;&#32654;&#22269;&#20154;&#32676;&#31958;&#23615;&#30149;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Deep Learning Framework with Uncertainty Quantification for Survey Data: Assessing and Predicting Diabetes Mellitus Risk in the American Population
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19752
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#36827;&#34892;&#22238;&#24402;&#21644;&#20998;&#31867;&#30340;&#39044;&#27979;&#26694;&#26550;&#65292;&#24182;&#24341;&#20837;&#20102;&#36866;&#29992;&#20110;&#22797;&#26434;&#35843;&#26597;&#35774;&#35745;&#25968;&#25454;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#31639;&#27861;&#65292;&#20197;&#35780;&#20272;&#32654;&#22269;&#20154;&#32676;&#31958;&#23615;&#30149;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#31181;&#21307;&#23398;&#38431;&#21015;&#20013;&#36890;&#24120;&#37319;&#29992;&#22797;&#26434;&#30340;&#35843;&#26597;&#35774;&#35745;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24320;&#21457;&#21453;&#26144;&#30740;&#31350;&#35774;&#35745;&#30340;&#29420;&#29305;&#29305;&#24449;&#30340;&#29305;&#23450;&#30149;&#20363;&#39044;&#27979;&#39118;&#38505;&#35780;&#20998;&#27169;&#22411;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#30340;&#30446;&#26631;&#26159;:(i) &#25552;&#20986;&#19968;&#20010;&#36890;&#29992;&#30340;&#39044;&#27979;&#26694;&#26550;&#65292;&#21033;&#29992;&#31070;&#32463;&#32593;&#32476;(NN)&#24314;&#27169;&#36827;&#34892;&#22238;&#24402;&#21644;&#20998;&#31867;&#65292;&#20854;&#23558;&#35843;&#26597;&#26435;&#37325;&#32435;&#20837;&#20272;&#35745;&#36807;&#31243;&#20013;;(ii) &#24341;&#20837;&#19968;&#31181;&#27169;&#22411;&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#31639;&#27861;&#65292;&#19987;&#20026;&#26469;&#33258;&#22797;&#26434;&#35843;&#26597;&#35774;&#35745;&#30340;&#25968;&#25454;&#37327;&#36523;&#23450;&#21046;;(iii) &#24212;&#29992;&#36825;&#31181;&#26041;&#27861;&#24320;&#21457;&#20581;&#22766;&#30340;&#39118;&#38505;&#35780;&#20998;&#27169;&#22411;&#65292;&#35780;&#20272;&#32654;&#22269;&#20154;&#32676;&#31958;&#23615;&#30149;&#39118;&#38505;&#65292;&#21033;&#29992;NHANES 2011-2014&#38431;&#21015;&#20013;&#30340;&#25968;&#25454;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#30340;&#29702;&#35770;&#24615;&#36136;&#26088;&#22312;&#30830;&#20445;&#26368;&#23567;&#20559;&#24046;&#21644;&#32479;&#35745;&#19968;&#33268;&#24615;&#65292;&#20174;&#32780;&#30830;&#20445;&#25105;&#20204;&#30340;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19752v1 Announce Type: cross  Abstract: Complex survey designs are commonly employed in many medical cohorts. In such scenarios, developing case-specific predictive risk score models that reflect the unique characteristics of the study design is essential. This approach is key to minimizing potential selective biases in results. The objectives of this paper are: (i) To propose a general predictive framework for regression and classification using neural network (NN) modeling, which incorporates survey weights into the estimation process; (ii) To introduce an uncertainty quantification algorithm for model prediction, tailored for data from complex survey designs; (iii) To apply this method in developing robust risk score models to assess the risk of Diabetes Mellitus in the US population, utilizing data from the NHANES 2011-2014 cohort. The theoretical properties of our estimators are designed to ensure minimal bias and the statistical consistency, thereby ensuring that our m
&lt;/p&gt;</description></item></channel></rss>