<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#23548;&#20986;&#20102;&#22788;&#29702;&#37096;&#20998;&#35782;&#21035;&#30340;&#31163;&#25955;&#36873;&#25321;&#38382;&#39064;&#30340;&#26368;&#20248;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#65292;&#36890;&#36807;&#20248;&#21270;&#26368;&#22823;&#39118;&#38505;&#25110;&#36951;&#25022;&#26469;&#23454;&#29616;&#26368;&#20248;&#20915;&#31574;&#65292;&#24182;&#36890;&#36807;bootstrap&#21644;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#21442;&#25968;&#21644;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#23454;&#29616;&#65292;&#21487;&#29992;&#20110;&#35299;&#20915;&#26368;&#20248;&#27835;&#30103;&#36873;&#25321;&#21644;&#26368;&#20248;&#23450;&#20215;&#31561;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2204.11748</link><description>&lt;p&gt;
&#25903;&#20184;&#37096;&#20998;&#30830;&#35748;&#26102;&#30340;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Optimal Decision Rules when Payoffs are Partially Identified. (arXiv:2204.11748v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.11748
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#23548;&#20986;&#20102;&#22788;&#29702;&#37096;&#20998;&#35782;&#21035;&#30340;&#31163;&#25955;&#36873;&#25321;&#38382;&#39064;&#30340;&#26368;&#20248;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#65292;&#36890;&#36807;&#20248;&#21270;&#26368;&#22823;&#39118;&#38505;&#25110;&#36951;&#25022;&#26469;&#23454;&#29616;&#26368;&#20248;&#20915;&#31574;&#65292;&#24182;&#36890;&#36807;bootstrap&#21644;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#21442;&#25968;&#21644;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#23454;&#29616;&#65292;&#21487;&#29992;&#20110;&#35299;&#20915;&#26368;&#20248;&#27835;&#30103;&#36873;&#25321;&#21644;&#26368;&#20248;&#23450;&#20215;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#25903;&#20184;&#20381;&#36182;&#20110;&#37096;&#20998;&#30830;&#35748;&#30340;&#21442;&#25968;$\theta$&#19988;&#20915;&#31574;&#32773;&#21487;&#20197;&#20351;&#29992;&#28857;&#30830;&#35748;&#30340;&#21442;&#25968;$P$&#26469;&#25512;&#26029;&#23545;$\theta$&#30340;&#38480;&#21046;&#26102;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#31163;&#25955;&#36873;&#25321;&#38382;&#39064;&#30340;&#26368;&#20248;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#65292;&#20854;&#20013;&#20808;&#36827;&#30340;&#20363;&#23376;&#21253;&#25324;&#37096;&#20998;&#35782;&#21035;&#19979;&#30340;&#26368;&#20248;&#27835;&#30103;&#36873;&#25321;&#21644;&#20855;&#26377;&#20016;&#23500;&#26410;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#30340;&#26368;&#20248;&#23450;&#20215;&#12290;&#25105;&#20204;&#30340;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;&#26368;&#23567;&#21270;&#22312;$P$&#26465;&#20214;&#19979;&#25903;&#20184;&#30830;&#35748;&#38598;&#21512;&#19978;&#30340;&#26368;&#22823;&#39118;&#38505;&#25110;&#36951;&#25022;&#65292;&#24182;&#26377;&#25928;&#22320;&#21033;&#29992;&#25968;&#25454;&#26469;&#23398;&#20064;$P$&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;&#30340;&#36890;&#36807;bootstrap&#21644;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#21442;&#25968;&#21644;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#23454;&#29616;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#27835;&#30103;&#36873;&#25321;&#21644;&#26368;&#20248;&#23450;&#20215;&#30340;&#35814;&#32454;&#24212;&#29992;&#12290;&#20351;&#29992;&#23454;&#39564;&#26497;&#38480;&#26694;&#26550;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26368;&#20248;&#20915;&#31574;&#35268;&#21017;&#21487;&#20197;&#36229;&#36234;&#30475;&#20284;&#33258;&#28982;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#25105;&#20204;&#30340;&#28176;&#36817;&#26041;&#27861;&#38750;&#24120;&#36866;&#21512;&#29616;&#23454;&#32463;&#39564;&#35774;&#32622;&#65292;&#20854;&#20013;&#26377;&#38480;&#26679;&#26412;&#26368;&#20248;&#30340;&#25512;&#23548;&#26159;&#22256;&#38590;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We derive optimal statistical decision rules for discrete choice problems when payoffs depend on a partially-identified parameter $\theta$ and the decision maker can use a point-identified parameter $P$ to deduce restrictions on $\theta$. Leading examples include optimal treatment choice under partial identification and optimal pricing with rich unobserved heterogeneity. Our optimal decision rules minimize the maximum risk or regret over the identified set of payoffs conditional on $P$ and use the data efficiently to learn about $P$. We discuss implementation of optimal decision rules via the bootstrap and Bayesian methods, in both parametric and semiparametric models. We provide detailed applications to treatment choice and optimal pricing. Using a limits of experiments framework, we show that our optimal decision rules can dominate seemingly natural alternatives. Our asymptotic approach is well suited for realistic empirical settings in which the derivation of finite-sample optimal r
&lt;/p&gt;</description></item></channel></rss>