<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#20855;&#26377;&#38598;&#21512;&#20540;&#39044;&#27979;&#21644;&#38169;&#35823;&#35268;&#33539;&#21270;&#30340;&#27169;&#22411;&#20013;&#30340;&#37096;&#20998;&#35782;&#21035;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#21644;&#38169;&#35823;&#26102;&#26377;&#25928;&#22320;&#36827;&#34892;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2401.11046</link><description>&lt;p&gt;
&#20855;&#26377;&#38598;&#21512;&#20540;&#39044;&#27979;&#21644;&#38169;&#35823;&#35268;&#33539;&#21270;&#30340;&#27169;&#22411;&#20013;&#30340;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Information Based Inference in Models with Set-Valued Predictions and Misspecification. (arXiv:2401.11046v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11046
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#20855;&#26377;&#38598;&#21512;&#20540;&#39044;&#27979;&#21644;&#38169;&#35823;&#35268;&#33539;&#21270;&#30340;&#27169;&#22411;&#20013;&#30340;&#37096;&#20998;&#35782;&#21035;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#21644;&#38169;&#35823;&#26102;&#26377;&#25928;&#22320;&#36827;&#34892;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#19981;&#23436;&#25972;&#27169;&#22411;&#20013;&#37096;&#20998;&#35782;&#21035;&#30340;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#22312;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#21644;&#38169;&#35823;&#26102;&#22343;&#26377;&#25928;&#12290;&#35813;&#26041;&#27861;&#30340;&#20851;&#38190;&#29305;&#28857;&#26159;&#65306;&#65288;i&#65289;&#22522;&#20110;&#26368;&#23567;&#21270;&#36866;&#24403;&#23450;&#20041;&#30340;Kullback-Leibler&#20449;&#24687;&#20934;&#21017;&#65292;&#32771;&#34385;&#27169;&#22411;&#30340;&#19981;&#23436;&#25972;&#24615;&#65292;&#24182;&#25552;&#20379;&#38750;&#31354;&#20266;&#30495;&#38598;&#65307;&#65288;ii&#65289;&#35745;&#31639;&#21487;&#34892;&#65307;&#65288;iii&#65289;&#26080;&#35770;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#19982;&#21542;&#65292;&#23454;&#29616;&#26041;&#27861;&#30456;&#21516;&#65307;&#65288;iv&#65289;&#21033;&#29992;&#31163;&#25955;&#21644;&#36830;&#32493;&#21327;&#21464;&#37327;&#30340;&#21464;&#24322;&#25552;&#20379;&#30340;&#25152;&#26377;&#20449;&#24687;&#65307;&#65288;v&#65289;&#20381;&#36182;&#20110;Rao&#30340;&#35780;&#20998;&#32479;&#35745;&#37327;&#65292;&#35813;&#32479;&#35745;&#37327;&#34987;&#35777;&#26126;&#26159;&#28176;&#36817;&#22522;&#26412;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes an information-based inference method for partially identified parameters in incomplete models that is valid both when the model is correctly specified and when it is misspecified. Key features of the method are: (i) it is based on minimizing a suitably defined Kullback-Leibler information criterion that accounts for incompleteness of the model and delivers a non-empty pseudo-true set; (ii) it is computationally tractable; (iii) its implementation is the same for both correctly and incorrectly specified models; (iv) it exploits all information provided by variation in discrete and continuous covariates; (v) it relies on Rao's score statistic, which is shown to be asymptotically pivotal.
&lt;/p&gt;</description></item></channel></rss>