<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;&#19968;&#31181;&#20551;&#35774;&#31616;&#21270;&#21644;&#25968;&#25454;&#33258;&#36866;&#24212;&#30340;&#21518;&#39044;&#27979;&#25512;&#26029;&#65288;POP-Inf&#65289;&#36807;&#31243;&#65292;&#21487;&#20197;&#26377;&#25928;&#19988;&#26377;&#21147;&#22320;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#32467;&#26524;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#12290;</title><link>https://arxiv.org/abs/2311.14220</link><description>&lt;p&gt;
&#20551;&#35774;&#31616;&#21270;&#21644;&#25968;&#25454;&#33258;&#36866;&#24212;&#30340;&#21518;&#39044;&#27979;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Assumption-lean and Data-adaptive Post-Prediction Inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.14220
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#20171;&#32461;&#20102;&#19968;&#31181;&#20551;&#35774;&#31616;&#21270;&#21644;&#25968;&#25454;&#33258;&#36866;&#24212;&#30340;&#21518;&#39044;&#27979;&#25512;&#26029;&#65288;POP-Inf&#65289;&#36807;&#31243;&#65292;&#21487;&#20197;&#26377;&#25928;&#19988;&#26377;&#21147;&#22320;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#32467;&#26524;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#31185;&#23398;&#30740;&#31350;&#38754;&#20020;&#30340;&#20027;&#35201;&#25361;&#25112;&#26159;&#40644;&#37329;&#26631;&#20934;&#25968;&#25454;&#30340;&#26377;&#38480;&#21487;&#29992;&#24615;&#65292;&#32780;&#33719;&#21462;&#36825;&#20123;&#25968;&#25454;&#26082;&#32791;&#36153;&#26102;&#38388;&#21448;&#36153;&#21147;&#12290;&#38543;&#30528;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#31185;&#23398;&#23478;&#20204;&#20381;&#36182;&#20110;ML&#31639;&#27861;&#20351;&#29992;&#26131;&#24471;&#30340;&#21327;&#21464;&#37327;&#26469;&#39044;&#27979;&#36825;&#20123;&#40644;&#37329;&#26631;&#20934;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#39044;&#27979;&#32467;&#26524;&#24120;&#24120;&#30452;&#25509;&#29992;&#20110;&#21518;&#32493;&#30340;&#32479;&#35745;&#20998;&#26512;&#20013;&#65292;&#24573;&#30053;&#20102;&#39044;&#27979;&#36807;&#31243;&#24341;&#20837;&#30340;&#19981;&#31934;&#30830;&#24615;&#21644;&#24322;&#36136;&#24615;&#12290;&#36825;&#21487;&#33021;&#23548;&#33268;&#34394;&#20551;&#30340;&#27491;&#38754;&#32467;&#26524;&#21644;&#26080;&#25928;&#30340;&#31185;&#23398;&#32467;&#35770;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#20551;&#35774;&#31616;&#21270;&#21644;&#25968;&#25454;&#33258;&#36866;&#24212;&#30340;&#21518;&#39044;&#27979;&#25512;&#26029;&#65288;POP-Inf&#65289;&#36807;&#31243;&#65292;&#23427;&#20801;&#35768;&#22522;&#20110;ML&#39044;&#27979;&#32467;&#26524;&#36827;&#34892;&#26377;&#25928;&#21644;&#26377;&#21147;&#30340;&#25512;&#26029;&#12290;&#23427;&#30340;&#8220;&#20551;&#35774;&#31616;&#21270;&#8221;&#23646;&#24615;&#20445;&#35777;&#22312;&#24191;&#27867;&#30340;&#32479;&#35745;&#37327;&#19978;&#19981;&#22522;&#20110;ML&#39044;&#27979;&#20570;&#20986;&#21487;&#38752;&#30340;&#32479;&#35745;&#25512;&#26029;&#12290;&#23427;&#30340;&#8220;&#25968;&#25454;&#33258;&#36866;&#24212;&#8221;&#29305;&#24615;&#20445;&#35777;&#20102;&#30456;&#36739;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#25928;&#29575;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
A primary challenge facing modern scientific research is the limited availability of gold-standard data which can be both costly and labor-intensive to obtain. With the rapid development of machine learning (ML), scientists have relied on ML algorithms to predict these gold-standard outcomes with easily obtained covariates. However, these predicted outcomes are often used directly in subsequent statistical analyses, ignoring imprecision and heterogeneity introduced by the prediction procedure. This will likely result in false positive findings and invalid scientific conclusions. In this work, we introduce an assumption-lean and data-adaptive Post-Prediction Inference (POP-Inf) procedure that allows valid and powerful inference based on ML-predicted outcomes. Its "assumption-lean" property guarantees reliable statistical inference without assumptions on the ML-prediction, for a wide range of statistical quantities. Its "data-adaptive'" feature guarantees an efficiency gain over existing
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#27169;&#25311;&#29305;&#24449;&#20989;&#25968;&#30340;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#26500;&#24314;&#19968;&#20010;&#26222;&#36866;&#19988;&#26080;&#38656;&#20551;&#35774;&#30340;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#26469;&#35299;&#20915;&#12290;&#30740;&#31350;&#22522;&#20110;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#20851;&#36924;&#36817;&#36136;&#37327;&#30340;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.04778</link><description>&lt;p&gt;
&#21033;&#29992;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#27169;&#25311;&#29305;&#24449;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Generative neural networks for characteristic functions. (arXiv:2401.04778v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04778
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#27169;&#25311;&#29305;&#24449;&#20989;&#25968;&#30340;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#26500;&#24314;&#19968;&#20010;&#26222;&#36866;&#19988;&#26080;&#38656;&#20551;&#35774;&#30340;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#26469;&#35299;&#20915;&#12290;&#30740;&#31350;&#22522;&#20110;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#20851;&#36924;&#36817;&#36136;&#37327;&#30340;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#27169;&#25311;&#31639;&#27861;&#26469;&#20174;&#19968;&#20010;&#65288;&#22810;&#20803;&#65289;&#29305;&#24449;&#20989;&#25968;&#20013;&#27169;&#25311;&#65292;&#35813;&#29305;&#24449;&#20989;&#25968;&#20165;&#20197;&#40657;&#30418;&#26684;&#24335;&#21487;&#35775;&#38382;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#65292;&#20854;&#25439;&#22833;&#20989;&#25968;&#21033;&#29992;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#30340;&#29305;&#23450;&#34920;&#31034;&#65292;&#30452;&#25509;&#32467;&#21512;&#30446;&#26631;&#29305;&#24449;&#20989;&#25968;&#12290;&#36825;&#31181;&#26500;&#36896;&#20855;&#26377;&#26222;&#36941;&#24615;&#65292;&#19981;&#20381;&#36182;&#20110;&#32500;&#24230;&#65292;&#24182;&#19988;&#19981;&#38656;&#35201;&#23545;&#32473;&#23450;&#29305;&#24449;&#20989;&#25968;&#36827;&#34892;&#20219;&#20309;&#20551;&#35774;&#12290;&#27492;&#22806;&#65292;&#36824;&#24471;&#20986;&#20102;&#20851;&#20110;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#30340;&#36924;&#36817;&#36136;&#37327;&#30340;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#22312;&#19968;&#20010;&#30701;&#26399;&#27169;&#25311;&#30740;&#31350;&#20013;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we provide a simulation algorithm to simulate from a (multivariate) characteristic function, which is only accessible in a black-box format. We construct a generative neural network, whose loss function exploits a specific representation of the Maximum-Mean-Discrepancy metric to directly incorporate the targeted characteristic function. The construction is universal in the sense that it is independent of the dimension and that it does not require any assumptions on the given characteristic function. Furthermore, finite sample guarantees on the approximation quality in terms of the Maximum-Mean Discrepancy metric are derived. The method is illustrated in a short simulation study.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#32034;&#32852;&#37030;&#26041;&#27861;&#22312;&#27969;&#34892;&#30149;&#30417;&#27979;&#20013;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#36890;&#36807;&#25512;&#36865;&#21040;&#20445;&#31649;&#20154;&#30340;&#38450;&#28779;&#22681;&#24182;&#36827;&#34892;&#20803;&#20998;&#26512;&#65292;&#26469;&#35299;&#20915;&#25968;&#25454;&#20998;&#24067;&#21644;&#20849;&#20139;&#38480;&#21046;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#21512;&#30340;$p$-&#20540;&#21512;&#24182;&#26041;&#27861;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#32852;&#37030;&#27969;&#34892;&#30149;&#30417;&#27979;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2307.02616</link><description>&lt;p&gt;
&#32852;&#37030;&#27969;&#34892;&#30149;&#30417;&#27979;
&lt;/p&gt;
&lt;p&gt;
Federated Epidemic Surveillance. (arXiv:2307.02616v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02616
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#32034;&#32852;&#37030;&#26041;&#27861;&#22312;&#27969;&#34892;&#30149;&#30417;&#27979;&#20013;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#65292;&#36890;&#36807;&#25512;&#36865;&#21040;&#20445;&#31649;&#20154;&#30340;&#38450;&#28779;&#22681;&#24182;&#36827;&#34892;&#20803;&#20998;&#26512;&#65292;&#26469;&#35299;&#20915;&#25968;&#25454;&#20998;&#24067;&#21644;&#20849;&#20139;&#38480;&#21046;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#21512;&#30340;$p$-&#20540;&#21512;&#24182;&#26041;&#27861;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#32852;&#37030;&#27969;&#34892;&#30149;&#30417;&#27979;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#34892;&#30149;&#30340;&#30417;&#27979;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#65292;&#29305;&#21035;&#26159;&#24403;&#20851;&#38190;&#25968;&#25454;&#20998;&#25955;&#19988;&#21033;&#30410;&#30456;&#20851;&#26041;&#26080;&#27861;&#25110;&#19981;&#24895;&#20849;&#20139;&#26102;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#38556;&#30861;&#65292;&#24212;&#24320;&#21457;&#32852;&#37030;&#26041;&#27861;&#26469;&#25972;&#21512;&#23454;&#20307;&#24895;&#24847;&#25552;&#20379;&#30340;&#36739;&#19981;&#25935;&#24863;&#30340;&#35777;&#25454;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#25506;&#32034;&#23558;&#20551;&#35774;&#26816;&#39564;&#25512;&#36865;&#21040;&#27599;&#20010;&#20445;&#31649;&#20154;&#30340;&#38450;&#28779;&#22681;&#21518;&#65292;&#20877;&#36890;&#36807;&#20803;&#20998;&#26512;&#26469;&#21512;&#24182;&#32467;&#26524;&#30340;&#21487;&#34892;&#24615;&#65292;&#24182;&#30830;&#23450;&#37325;&#24314;&#20551;&#35774;&#26816;&#39564;&#21644;&#20248;&#21270;&#25512;&#29702;&#30340;&#26368;&#20339;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26694;&#26550;&#26469;&#35782;&#21035;&#25351;&#26631;&#30340;&#28608;&#22686;&#65292;&#24182;&#23545;&#30495;&#23454;&#25968;&#25454;&#21644;&#21322;&#21512;&#25104;&#25968;&#25454;&#36827;&#34892;&#21151;&#25928;&#20998;&#26512;&#21644;&#23454;&#39564;&#65292;&#20197;&#23637;&#31034;&#25105;&#20204;&#25152;&#25552;&#20986;&#30340;&#20551;&#35774;&#26816;&#39564;&#30340;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#21512;&#36866;&#30340;$p$-&#20540;&#21512;&#24182;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#20984;&#26174;&#20102;&#20351;&#29992;$p$-&#20540;&#21512;&#24182;&#20316;&#20026;&#27969;&#34892;&#30149;&#30417;&#27979;&#30340;&#32852;&#37030;&#26041;&#27861;&#30340;&#28508;&#21147;&#65292;&#24182;&#20026;&#25972;&#21512;&#21487;&#29992;&#20449;&#24687;&#25552;&#20379;&#20102;&#23453;&#36149;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
The surveillance of a pandemic is a challenging task, especially when crucial data is distributed and stakeholders cannot or are unwilling to share. To overcome this obstacle, federated methodologies should be developed to incorporate less sensitive evidence that entities are willing to provide. This study aims to explore the feasibility of pushing hypothesis tests behind each custodian's firewall and then meta-analysis to combine the results, and to determine the optimal approach for reconstructing the hypothesis test and optimizing the inference. We propose a hypothesis testing framework to identify a surge in the indicators and conduct power analyses and experiments on real and semi-synthetic data to showcase the properties of our proposed hypothesis test and suggest suitable methods for combining $p$-values. Our findings highlight the potential of using $p$-value combination as a federated methodology for pandemic surveillance and provide valuable insights into integrating availabl
&lt;/p&gt;</description></item></channel></rss>