<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#32447;&#24615;&#20272;&#35745;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#35797;&#22270;&#24357;&#21512;&#29616;&#26377;&#25968;&#25454;&#21516;&#21270;&#26041;&#27861;&#20013;&#30340;&#24046;&#36317;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#33021;&#22815;&#25512;&#24191;&#33267;&#20219;&#24847;&#38750;&#39640;&#26031;&#20998;&#24067;&#30340;&#20849;&#36717;&#21464;&#25442;&#28388;&#27874;&#22120; (CTF)&#65292;&#24182;&#25552;&#20986;&#20102;&#20854;&#38598;&#21512;&#36817;&#20284;&#29256;&#26412; (ECTF)&#12290;</title><link>http://arxiv.org/abs/2310.10976</link><description>&lt;p&gt;
&#31934;&#30830;&#38750;&#32447;&#24615;&#29366;&#24577;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Exact nonlinear state estimation. (arXiv:2310.10976v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10976
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#32447;&#24615;&#20272;&#35745;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#35797;&#22270;&#24357;&#21512;&#29616;&#26377;&#25968;&#25454;&#21516;&#21270;&#26041;&#27861;&#20013;&#30340;&#24046;&#36317;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#33021;&#22815;&#25512;&#24191;&#33267;&#20219;&#24847;&#38750;&#39640;&#26031;&#20998;&#24067;&#30340;&#20849;&#36717;&#21464;&#25442;&#28388;&#27874;&#22120; (CTF)&#65292;&#24182;&#25552;&#20986;&#20102;&#20854;&#38598;&#21512;&#36817;&#20284;&#29256;&#26412; (ECTF)&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22320;&#29699;&#31185;&#23398;&#20013;&#30340;&#22823;&#22810;&#25968;&#25968;&#25454;&#21516;&#21270;&#26041;&#27861;&#22522;&#20110;&#39640;&#26031;&#20551;&#35774;&#12290;&#23613;&#31649;&#36825;&#20123;&#20551;&#35774;&#26041;&#20415;&#20102;&#39640;&#25928;&#30340;&#31639;&#27861;&#65292;&#20294;&#23427;&#20204;&#20250;&#23548;&#33268;&#20998;&#26512;&#20559;&#24046;&#21644;&#21518;&#32493;&#39044;&#27979;&#24694;&#21270;&#12290;&#38750;&#21442;&#25968;&#12289;&#22522;&#20110;&#31890;&#23376;&#30340;&#25968;&#25454;&#21516;&#21270;&#31639;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#20934;&#30830;&#24615;&#65292;&#20294;&#20854;&#22312;&#39640;&#32500;&#27169;&#22411;&#20013;&#30340;&#24212;&#29992;&#20173;&#38754;&#20020;&#25805;&#20316;&#19978;&#30340;&#25361;&#25112;&#12290;&#26412;&#25991;&#20511;&#37492;&#20102;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#35797;&#22270;&#24357;&#21512;&#25968;&#25454;&#21516;&#21270;&#26041;&#27861;&#20013;&#29616;&#26377;&#24046;&#36317;&#30340;&#26032;&#30340;&#38750;&#32447;&#24615;&#20272;&#35745;&#29702;&#35770;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#20849;&#36717;&#21464;&#25442;&#28388;&#27874;&#22120; (CTF)&#65292;&#24182;&#26174;&#31034;&#20854;&#33021;&#22815;&#25512;&#24191;&#33267;&#20219;&#24847;&#38750;&#39640;&#26031;&#20998;&#24067;&#12290;&#26032;&#30340;&#28388;&#27874;&#22120;&#20855;&#26377;&#20960;&#20010;&#20248;&#28857;&#65292;&#20363;&#22914;&#33021;&#22815;&#20445;&#30041;&#20808;&#21069;&#29366;&#24577;&#20013;&#30340;&#32479;&#35745;&#20851;&#31995;&#24182;&#25910;&#25947;&#33267;&#39640;&#31934;&#24230;&#30340;&#35266;&#27979;&#20540;&#12290;&#21516;&#26102;&#36824;&#25552;&#20986;&#20102;&#26032;&#29702;&#35770;&#30340;&#19968;&#20010;&#38598;&#21512;&#36817;&#20284; (ECTF)&#12290;
&lt;/p&gt;
&lt;p&gt;
The majority of data assimilation (DA) methods in the geosciences are based on Gaussian assumptions. While these assumptions facilitate efficient algorithms, they cause analysis biases and subsequent forecast degradations. Non-parametric, particle-based DA algorithms have superior accuracy, but their application to high-dimensional models still poses operational challenges. Drawing inspiration from recent advances in the field of generative artificial intelligence (AI), this article introduces a new nonlinear estimation theory which attempts to bridge the existing gap in DA methodology. Specifically, a Conjugate Transform Filter (CTF) is derived and shown to generalize the celebrated Kalman filter to arbitrarily non-Gaussian distributions. The new filter has several desirable properties, such as its ability to preserve statistical relationships in the prior state and convergence to highly accurate observations. An ensemble approximation of the new theory (ECTF) is also presented and va
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#20114;&#32852;&#32593;&#23553;&#38145;&#23545;&#32463;&#27982;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#23553;&#38145;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2309.14630</link><description>&lt;p&gt;
&#33258;&#30001;&#19981;&#36830;&#32493;&#35774;&#35745;&#65306;&#24212;&#29992;&#20110;&#20114;&#32852;&#32593;&#23553;&#38145;&#30340;&#32463;&#27982;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Free Discontinuity Design: With an Application to the Economic Effects of Internet Shutdowns. (arXiv:2309.14630v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14630
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#20114;&#32852;&#32593;&#23553;&#38145;&#23545;&#32463;&#27982;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#23553;&#38145;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#38408;&#20540;&#21487;&#20197;&#20135;&#29983;&#32467;&#26524;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#20174;&#32780;&#25581;&#31034;&#22240;&#26524;&#27934;&#23519;&#21147;&#12290;&#22312;&#35768;&#22810;&#24773;&#22659;&#20013;&#65292;&#22914;&#22320;&#29702;&#29615;&#22659;&#65292;&#36825;&#20123;&#38408;&#20540;&#26159;&#26410;&#30693;&#21644;&#22810;&#21464;&#37327;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#30001;&#27492;&#20135;&#29983;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#36890;&#36807;&#23558;&#22238;&#24402;&#26354;&#38754;&#20998;&#21106;&#25104;&#24179;&#28369;&#21644;&#19981;&#36830;&#32493;&#37096;&#20998;&#12290;&#35813;&#20272;&#35745;&#22120;&#20351;&#29992;&#20102;Mumford-Shah&#20989;&#25968;&#30340;&#20984;&#26494;&#24347;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20854;&#35782;&#21035;&#21644;&#25910;&#25947;&#24615;&#12290;&#20351;&#29992;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20272;&#35745;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#36828;&#36828;&#36229;&#36807;&#20197;&#21069;&#30340;&#20272;&#35745;&#65292;&#24182;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#27492;&#31867;&#23553;&#38145;&#30340;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Thresholds in treatment assignments can produce discontinuities in outcomes, revealing causal insights. In many contexts, like geographic settings, these thresholds are unknown and multivariate. We propose a non-parametric method to estimate the resulting discontinuities by segmenting the regression surface into smooth and discontinuous parts. This estimator uses a convex relaxation of the Mumford-Shah functional, for which we establish identification and convergence. Using our method, we estimate that an internet shutdown in India resulted in a reduction of economic activity by over 50%, greatly surpassing previous estimates and shedding new light on the true cost of such shutdowns for digital economies globally.
&lt;/p&gt;</description></item></channel></rss>