<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#38750;&#24120;&#35268;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#20551;&#35774;&#26816;&#39564;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#20284;&#28982;&#27604;&#36807;&#31243;&#30340;&#28176;&#36817;&#19968;&#33268;&#26368;&#24378;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#21270;&#12289;&#35843;&#33410;&#24120;&#25968;&#21644;&#29992;&#25143;&#25351;&#23450;&#22791;&#25321;&#20551;&#35774;&#20540;&#31561;&#26041;&#24335;&#23454;&#29616;&#28176;&#36817;&#26368;&#20248;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.16413</link><description>&lt;p&gt;
&#19968;&#31867;&#38750;&#24120;&#35268;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Optimal testing in a class of nonregular models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16413
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#38750;&#24120;&#35268;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#20551;&#35774;&#26816;&#39564;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#20284;&#28982;&#27604;&#36807;&#31243;&#30340;&#28176;&#36817;&#19968;&#33268;&#26368;&#24378;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#38543;&#26426;&#21270;&#12289;&#35843;&#33410;&#24120;&#25968;&#21644;&#29992;&#25143;&#25351;&#23450;&#22791;&#25321;&#20551;&#35774;&#20540;&#31561;&#26041;&#24335;&#23454;&#29616;&#28176;&#36817;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21442;&#25968;&#20381;&#36182;&#25903;&#25345;&#30340;&#38750;&#24120;&#35268;&#32479;&#35745;&#27169;&#22411;&#30340;&#26368;&#20248;&#20551;&#35774;&#26816;&#39564;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#21333;&#20391;&#21644;&#21452;&#20391;&#20551;&#35774;&#26816;&#39564;&#65292;&#24182;&#22522;&#20110;&#20284;&#28982;&#27604;&#36807;&#31243;&#21457;&#23637;&#20102;&#28176;&#36817;&#19968;&#33268;&#26368;&#24378;&#30340;&#26816;&#39564;&#12290;&#25152;&#25552;&#20986;&#30340;&#21333;&#20391;&#26816;&#39564;&#28041;&#21450;&#38543;&#26426;&#21270;&#20197;&#23454;&#29616;&#28176;&#36817;&#23610;&#23544;&#25511;&#21046;&#65292;&#19968;&#20123;&#35843;&#33410;&#24120;&#25968;&#20197;&#36991;&#20813;&#22312;&#26497;&#38480;&#20284;&#28982;&#27604;&#36807;&#31243;&#20013;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#24182;&#19968;&#20010;&#29992;&#25143;&#25351;&#23450;&#30340;&#22791;&#25321;&#20551;&#35774;&#20540;&#20197;&#36798;&#21040;&#28176;&#36817;&#26368;&#20248;&#24615;&#12290;&#25105;&#20204;&#30340;&#21452;&#20391;&#26816;&#39564;&#22312;&#19981;&#26045;&#21152;&#36827;&#19968;&#27493;&#30340;&#38480;&#21046;&#65288;&#22914;&#26080;&#20559;&#24615;&#65289;&#30340;&#24773;&#20917;&#19979;&#21464;&#20026;&#28176;&#36817;&#19968;&#33268;&#26368;&#24378;&#12290;&#27169;&#25311;&#32467;&#26524;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#26816;&#39564;&#30340;&#29702;&#24819;&#21151;&#25928;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16413v1 Announce Type: cross  Abstract: This paper studies optimal hypothesis testing for nonregular statistical models with parameter-dependent support. We consider both one-sided and two-sided hypothesis testing and develop asymptotically uniformly most powerful tests based on the likelihood ratio process. The proposed one-sided test involves randomization to achieve asymptotic size control, some tuning constant to avoid discontinuities in the limiting likelihood ratio process, and a user-specified alternative hypothetical value to achieve the asymptotic optimality. Our two-sided test becomes asymptotically uniformly most powerful without imposing further restrictions such as unbiasedness. Simulation results illustrate desirable power properties of the proposed tests.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;QATS&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#39640;&#25928;&#35299;&#30721;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#24207;&#21015;&#12290;&#23427;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#20026;&#22810;&#23545;&#25968;&#21644;&#31435;&#26041;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#20855;&#26377;&#30456;&#23545;&#36739;&#23569;&#29366;&#24577;&#30340;&#22823;&#22411;HMM&#12290;</title><link>http://arxiv.org/abs/2305.18578</link><description>&lt;p&gt;
&#24555;&#36895;&#33258;&#36866;&#24212;&#19977;&#20803;&#20998;&#21106;&#65306;&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#30340;&#26377;&#25928;&#35299;&#30721;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quick Adaptive Ternary Segmentation: An Efficient Decoding Procedure For Hidden Markov Models. (arXiv:2305.18578v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18578
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;QATS&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#39640;&#25928;&#35299;&#30721;&#38544;&#34255;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#24207;&#21015;&#12290;&#23427;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#20026;&#22810;&#23545;&#25968;&#21644;&#31435;&#26041;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#20855;&#26377;&#30456;&#23545;&#36739;&#23569;&#29366;&#24577;&#30340;&#22823;&#22411;HMM&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38544;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#65288;HMM&#65289;&#20197;&#19981;&#21487;&#35266;&#23519;&#30340;&#65288;&#38544;&#34255;&#30340;&#65289;&#39532;&#23572;&#21487;&#22827;&#38142;&#21644;&#21487;&#35266;&#27979;&#30340;&#36807;&#31243;&#20026;&#29305;&#24449;&#65292;&#21518;&#32773;&#26159;&#38544;&#34255;&#38142;&#30340;&#22122;&#22768;&#29256;&#26412;&#12290;&#20174;&#22024;&#26434;&#30340;&#35266;&#27979;&#20013;&#35299;&#30721;&#21407;&#22987;&#20449;&#21495;&#65288;&#21363;&#38544;&#34255;&#38142;&#65289;&#26159;&#20960;&#20046;&#25152;&#26377;&#22522;&#20110;HMM&#30340;&#25968;&#25454;&#20998;&#26512;&#30340;&#20027;&#35201;&#30446;&#26631;&#12290;&#29616;&#26377;&#30340;&#35299;&#30721;&#31639;&#27861;&#65292;&#22914;&#32500;&#29305;&#27604;&#31639;&#27861;&#65292;&#22312;&#35266;&#27979;&#24207;&#21015;&#38271;&#24230;&#26368;&#22810;&#32447;&#24615;&#30340;&#24773;&#20917;&#19979;&#20855;&#26377;&#35745;&#31639;&#22797;&#26434;&#24230;&#65292;&#24182;&#19988;&#22312;&#39532;&#23572;&#21487;&#22827;&#38142;&#29366;&#24577;&#31354;&#38388;&#30340;&#22823;&#23567;&#20013;&#20855;&#26377;&#27425;&#20108;&#27425;&#35745;&#31639;&#22797;&#26434;&#24230;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#24555;&#36895;&#33258;&#36866;&#24212;&#19977;&#20803;&#20998;&#21106;&#65288;QATS&#65289;&#65292;&#36825;&#26159;&#19968;&#31181;&#20998;&#32780;&#27835;&#20043;&#30340;&#36807;&#31243;&#65292;&#21487;&#22312;&#24207;&#21015;&#38271;&#24230;&#30340;&#22810;&#23545;&#25968;&#35745;&#31639;&#22797;&#26434;&#24230;&#21644;&#39532;&#23572;&#21487;&#22827;&#38142;&#29366;&#24577;&#31354;&#38388;&#30340;&#19977;&#27425;&#35745;&#31639;&#22797;&#26434;&#24230;&#19979;&#35299;&#30721;&#38544;&#34255;&#30340;&#24207;&#21015;&#65292;&#22240;&#27492;&#29305;&#21035;&#36866;&#29992;&#20110;&#20855;&#26377;&#30456;&#23545;&#36739;&#23569;&#29366;&#24577;&#30340;&#22823;&#35268;&#27169;HMM&#12290;&#35813;&#31243;&#24207;&#36824;&#24314;&#35758;&#19968;&#31181;&#26377;&#25928;&#30340;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65292;&#21363;&#29305;&#23450;&#30340;&#32047;&#31215;&#24635;&#21644;&#12290;&#23454;&#36136;&#19978;&#65292;&#20272;&#35745;&#30340;&#29366;&#24577;&#24207;&#21015;&#25353;&#39034;&#24207;&#26368;&#22823;&#21270;&#23616;&#37096;&#20284;&#28982;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hidden Markov models (HMMs) are characterized by an unobservable (hidden) Markov chain and an observable process, which is a noisy version of the hidden chain. Decoding the original signal (i.e., hidden chain) from the noisy observations is one of the main goals in nearly all HMM based data analyses. Existing decoding algorithms such as the Viterbi algorithm have computational complexity at best linear in the length of the observed sequence, and sub-quadratic in the size of the state space of the Markov chain. We present Quick Adaptive Ternary Segmentation (QATS), a divide-and-conquer procedure which decodes the hidden sequence in polylogarithmic computational complexity in the length of the sequence, and cubic in the size of the state space, hence particularly suited for large scale HMMs with relatively few states. The procedure also suggests an effective way of data storage as specific cumulative sums. In essence, the estimated sequence of states sequentially maximizes local likeliho
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21464;&#28857;&#26816;&#39564;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#26102;&#38388;&#24207;&#21015;&#30340;&#23614;&#37096;&#26816;&#27979;&#21040;&#19968;&#33324;&#22810;&#37325;&#32467;&#26500;&#21464;&#21270;&#65292;&#24182;&#36991;&#20813;&#20102;&#26631;&#20934;&#35823;&#24046;&#20272;&#35745;&#30340;&#38382;&#39064;&#12290;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#26816;&#27979;&#21644;&#37327;&#21270;&#24066;&#22330;&#19981;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/1809.02303</link><description>&lt;p&gt;
&#26102;&#38388;&#24207;&#21015;&#20013;&#39118;&#38505;&#27979;&#24230;&#30340;&#21464;&#28857;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Change-Point Testing for Risk Measures in Time Series. (arXiv:1809.02303v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1809.02303
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21464;&#28857;&#26816;&#39564;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#26102;&#38388;&#24207;&#21015;&#30340;&#23614;&#37096;&#26816;&#27979;&#21040;&#19968;&#33324;&#22810;&#37325;&#32467;&#26500;&#21464;&#21270;&#65292;&#24182;&#36991;&#20813;&#20102;&#26631;&#20934;&#35823;&#24046;&#20272;&#35745;&#30340;&#38382;&#39064;&#12290;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#20013;&#26816;&#27979;&#21644;&#37327;&#21270;&#24066;&#22330;&#19981;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;&#24369;&#30456;&#20851;&#26102;&#38388;&#24207;&#21015;&#20013;&#39044;&#26399;&#25439;&#22833;&#21644;&#30456;&#20851;&#39118;&#38505;&#27979;&#24230;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#36827;&#34892;&#21464;&#28857;&#26816;&#39564;&#12290;&#22312;&#19968;&#33324;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#26816;&#27979;&#21040;&#26102;&#38388;&#24207;&#21015;&#36793;&#32536;&#20998;&#24067;&#23614;&#37096;&#30340;&#19968;&#33324;&#22810;&#37325;&#32467;&#26500;&#21464;&#21270;&#12290;&#33258;&#24402;&#19968;&#21270;&#20351;&#25105;&#20204;&#33021;&#22815;&#36991;&#20813;&#26631;&#20934;&#35823;&#24046;&#20272;&#35745;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#29702;&#35770;&#22522;&#30784;&#26159;&#22312;&#24369;&#20551;&#35774;&#19979;&#21457;&#23637;&#36215;&#26469;&#30340;&#20989;&#25968;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#12290;&#23545;S&amp;P 500&#21644;&#32654;&#22269;&#22269;&#20538;&#22238;&#25253;&#30340;&#23454;&#35777;&#30740;&#31350;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#36890;&#36807;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#23614;&#37096;&#26816;&#27979;&#21644;&#37327;&#21270;&#24066;&#22330;&#19981;&#31283;&#23450;&#24615;&#26041;&#38754;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose novel methods for change-point testing for nonparametric estimators of expected shortfall and related risk measures in weakly dependent time series. We can detect general multiple structural changes in the tails of marginal distributions of time series under general assumptions. Self-normalization allows us to avoid the issues of standard error estimation. The theoretical foundations for our methods are functional central limit theorems, which we develop under weak assumptions. An empirical study of S&amp;P 500 and US Treasury bond returns illustrates the practical use of our methods in detecting and quantifying market instability via the tails of financial time series.
&lt;/p&gt;</description></item></channel></rss>