<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>QuadratiK&#36719;&#20214;&#21253;&#26159;&#19968;&#20010;&#22312;R&#21644;Python&#20013;&#23454;&#29616;&#30340;&#25968;&#25454;&#20998;&#26512;&#24037;&#20855;&#65292;&#23427;&#25552;&#20379;&#20102;&#19968;&#22871;&#20840;&#38754;&#30340;&#25311;&#21512;&#24230;&#27979;&#35797;&#21644;&#22522;&#20110;&#26680;&#26041;&#27861;&#30340;&#32858;&#31867;&#25216;&#26415;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22788;&#29702;&#29699;&#24418;&#25968;&#25454;&#12290;</title><link>https://arxiv.org/abs/2402.02290</link><description>&lt;p&gt;
&#29699;&#24418;&#25968;&#25454;&#30340;&#25311;&#21512;&#24230;&#21644;&#32858;&#31867;&#65306;R&#21644;Python&#20013;&#30340;QuadratiK&#36719;&#20214;&#21253;
&lt;/p&gt;
&lt;p&gt;
Goodness-of-Fit and Clustering of Spherical Data: the QuadratiK package in R and Python
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02290
&lt;/p&gt;
&lt;p&gt;
QuadratiK&#36719;&#20214;&#21253;&#26159;&#19968;&#20010;&#22312;R&#21644;Python&#20013;&#23454;&#29616;&#30340;&#25968;&#25454;&#20998;&#26512;&#24037;&#20855;&#65292;&#23427;&#25552;&#20379;&#20102;&#19968;&#22871;&#20840;&#38754;&#30340;&#25311;&#21512;&#24230;&#27979;&#35797;&#21644;&#22522;&#20110;&#26680;&#26041;&#27861;&#30340;&#32858;&#31867;&#25216;&#26415;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#22788;&#29702;&#29699;&#24418;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;QuadratiK&#36719;&#20214;&#21253;&#65292;&#35813;&#36719;&#20214;&#21253;&#21253;&#21547;&#20102;&#21019;&#26032;&#30340;&#25968;&#25454;&#20998;&#26512;&#26041;&#27861;&#12290;&#35813;&#36719;&#20214;&#21253;&#22312;R&#21644;Python&#20013;&#23454;&#29616;&#65292;&#25552;&#20379;&#20102;&#19968;&#22871;&#20840;&#38754;&#30340;&#36866;&#24212;&#24230;&#25311;&#21512;&#27979;&#35797;&#21644;&#22522;&#20110;&#26680;&#26041;&#27861;&#30340;&#20108;&#27425;&#36317;&#31163;&#30340;&#32858;&#31867;&#25216;&#26415;&#65292;&#20174;&#32780;&#24357;&#21512;&#20102;&#32479;&#35745;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#25105;&#20204;&#30340;&#36719;&#20214;&#23454;&#29616;&#20102;&#21333;&#26679;&#26412;&#12289;&#21452;&#26679;&#26412;&#21644;k&#26679;&#26412;&#36866;&#24212;&#24230;&#25311;&#21512;&#27979;&#35797;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#39640;&#25928;&#19988;&#25968;&#23398;&#19978;&#21512;&#29702;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#27010;&#29575;&#20998;&#24067;&#30340;&#25311;&#21512;&#24230;&#12290;&#25105;&#20204;&#30340;&#36719;&#20214;&#25193;&#23637;&#20102;&#21151;&#33021;&#65292;&#21253;&#25324;&#22522;&#20110;&#27850;&#26494;&#26680;&#23494;&#24230;&#30340;$d$&#32500;&#29699;&#19978;&#22343;&#21248;&#24615;&#27979;&#35797;&#65292;&#20197;&#21450;&#20174;&#27850;&#26494;&#26680;&#23494;&#24230;&#20013;&#29983;&#25104;&#38543;&#26426;&#26679;&#26412;&#30340;&#31639;&#27861;&#12290;&#29305;&#21035;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#36719;&#20214;&#36824;&#21253;&#25324;&#19968;&#31181;&#38024;&#23545;&#29699;&#24418;&#25968;&#25454;&#32780;&#29305;&#21035;&#37327;&#36523;&#23450;&#21046;&#30340;&#29420;&#29305;&#32858;&#31867;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#21033;&#29992;&#20102;&#29699;&#38754;&#19978;&#22522;&#20110;&#27850;&#26494;&#26680;&#23494;&#24230;&#30340;&#28151;&#21512;&#27169;&#22411;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#30340;&#36719;&#20214;&#36824;&#21253;&#25324;&#20854;&#20182;&#22270;&#24418;&#21151;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the QuadratiK package that incorporates innovative data analysis methodologies. The presented software, implemented in both R and Python, offers a comprehensive set of goodness-of-fit tests and clustering techniques using kernel-based quadratic distances, thereby bridging the gap between the statistical and machine learning literatures. Our software implements one, two and k-sample tests for goodness of fit, providing an efficient and mathematically sound way to assess the fit of probability distributions. Expanded capabilities of our software include supporting tests for uniformity on the $d$-dimensional Sphere based on Poisson kernel densities, and algorithms for generating random samples from Poisson kernel densities. Particularly noteworthy is the incorporation of a unique clustering algorithm specifically tailored for spherical data that leverages a mixture of Poisson-kernel-based densities on the sphere. Alongside this, our software includes additional graphical func
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#31350;&#20102;&#19968;&#31181;&#21333;&#27425;&#29983;&#25104;&#27169;&#22411;&#30340;&#22810;&#26679;&#24615;&#65292;&#20027;&#35201;&#32858;&#28966;&#20110;&#23376;&#24207;&#21015;&#30456;&#20284;&#24615;&#22914;&#20309;&#24433;&#21709;&#25972;&#20010;&#24207;&#21015;&#30456;&#20284;&#24615;&#65292;&#24182;&#36890;&#36807;&#29983;&#25104;&#23376;&#24207;&#21015;&#30456;&#20284;&#30340;&#24207;&#21015;&#26469;&#22686;&#24378;&#25968;&#25454;&#38598;&#12290;</title><link>http://arxiv.org/abs/2301.08403</link><description>&lt;p&gt;
&#36890;&#36807;&#23376;&#24207;&#21015;&#30456;&#20284;&#24615;&#29983;&#25104;&#24207;&#21015;&#65306;&#29702;&#35770;&#21450;&#20854;&#22312;&#26080;&#20154;&#26426;&#35782;&#21035;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Sequence Generation via Subsequence Similarity: Theory and Application to UAV Identification. (arXiv:2301.08403v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08403
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#31350;&#20102;&#19968;&#31181;&#21333;&#27425;&#29983;&#25104;&#27169;&#22411;&#30340;&#22810;&#26679;&#24615;&#65292;&#20027;&#35201;&#32858;&#28966;&#20110;&#23376;&#24207;&#21015;&#30456;&#20284;&#24615;&#22914;&#20309;&#24433;&#21709;&#25972;&#20010;&#24207;&#21015;&#30456;&#20284;&#24615;&#65292;&#24182;&#36890;&#36807;&#29983;&#25104;&#23376;&#24207;&#21015;&#30456;&#20284;&#30340;&#24207;&#21015;&#26469;&#22686;&#24378;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20154;&#24037;&#21512;&#25104;&#24207;&#21015;&#30340;&#33021;&#21147;&#22312;&#24191;&#27867;&#30340;&#24212;&#29992;&#20013;&#33267;&#20851;&#37325;&#35201;&#65292;&#32780;&#28145;&#24230;&#23398;&#20064;&#26550;&#26500;&#21644;&#29983;&#25104;&#26694;&#26550;&#30340;&#26368;&#26032;&#36827;&#23637;&#24050;&#32463;&#26497;&#22823;&#22320;&#20419;&#36827;&#20102;&#36825;&#19968;&#36807;&#31243;&#12290;&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#21333;&#27425;&#29983;&#25104;&#27169;&#22411;&#26469;&#37319;&#26679;&#65292;&#36890;&#36807;&#30456;&#20284;&#24615;&#29983;&#25104;&#23376;&#24207;&#21015;&#65292;&#24182;&#35777;&#26126;&#20102;&#23376;&#24207;&#21015;&#30456;&#20284;&#24615;&#23545;&#25972;&#20010;&#24207;&#21015;&#30456;&#20284;&#24615;&#30340;&#24433;&#21709;&#65292;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#19968;&#27425;&#24615;&#29983;&#25104;&#27169;&#22411;&#26469;&#20174;&#21333;&#20010;&#24207;&#21015;&#30340;&#33539;&#22260;&#20869;&#21462;&#26679;&#65292;&#24182;&#29983;&#25104;&#23376;&#24207;&#21015;&#30456;&#20284;&#30340;&#24207;&#21015;&#65292;&#35777;&#26126;&#20102;&#25968;&#25454;&#38598;&#22686;&#24378;&#26041;&#38754;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The ability to generate synthetic sequences is crucial for a wide range of applications, and recent advances in deep learning architectures and generative frameworks have greatly facilitated this process. Particularly, unconditional one-shot generative models constitute an attractive line of research that focuses on capturing the internal information of a single image or video to generate samples with similar contents. Since many of those one-shot models are shifting toward efficient non-deep and non-adversarial approaches, we examine the versatility of a one-shot generative model for augmenting whole datasets. In this work, we focus on how similarity at the subsequence level affects similarity at the sequence level, and derive bounds on the optimal transport of real and generated sequences based on that of corresponding subsequences. We use a one-shot generative model to sample from the vicinity of individual sequences and generate subsequence-similar ones and demonstrate the improvem
&lt;/p&gt;</description></item></channel></rss>