<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#38024;&#23545;&#38169;&#20301;&#22788;&#29702;&#38382;&#39064;&#65292;&#23558;&#20854;&#35270;&#20026;&#27835;&#30103;&#20999;&#25442;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#27010;&#29575;&#27169;&#22411;&#35299;&#20915;&#20102;&#22797;&#22686;&#21644;&#26411;&#20107;&#20214;&#20559;&#24046;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.03247</link><description>&lt;p&gt;
&#19968;&#31181;&#22312;&#19981;&#21487;&#36991;&#20813;&#39118;&#38505;&#23384;&#22312;&#19979;&#36827;&#34892;&#22797;&#21457;&#20107;&#20214;&#22240;&#26524;&#20998;&#26512;&#30340;&#36125;&#21494;&#26031;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Bayesian Framework for Causal Analysis of Recurrent Events in Presence of Immortal Risk. (arXiv:2304.03247v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03247
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#38024;&#23545;&#38169;&#20301;&#22788;&#29702;&#38382;&#39064;&#65292;&#23558;&#20854;&#35270;&#20026;&#27835;&#30103;&#20999;&#25442;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#27010;&#29575;&#27169;&#22411;&#35299;&#20915;&#20102;&#22797;&#22686;&#21644;&#26411;&#20107;&#20214;&#20559;&#24046;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#29289;&#21307;&#23398;&#32479;&#35745;&#23398;&#20013;&#23545;&#22797;&#21457;&#20107;&#20214;&#29575;&#30340;&#35266;&#27979;&#30740;&#31350;&#24456;&#24120;&#35265;&#12290;&#36890;&#24120;&#30340;&#30446;&#26631;&#26159;&#22312;&#35268;&#23450;&#30340;&#38543;&#35775;&#26102;&#38388;&#31383;&#21475;&#20869;&#65292;&#20272;&#35745;&#22312;&#19968;&#20010;&#26126;&#30830;&#23450;&#20041;&#30340;&#30446;&#26631;&#20154;&#32676;&#20013;&#20004;&#31181;&#27835;&#30103;&#26041;&#27861;&#30340;&#20107;&#20214;&#29575;&#24046;&#24322;&#12290;&#20351;&#29992;&#35266;&#27979;&#24615;&#32034;&#36180;&#25968;&#25454;&#36827;&#34892;&#20272;&#35745;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#65292;&#22240;&#20026;&#22312;&#30446;&#26631;&#20154;&#32676;&#30340;&#25104;&#21592;&#36164;&#26684;&#26041;&#38754;&#23450;&#20041;&#26102;&#65292;&#24456;&#23569;&#22312;&#36164;&#26684;&#30830;&#35748;&#26102;&#20934;&#30830;&#20998;&#37197;&#27835;&#30103;&#26041;&#24335;&#12290;&#30446;&#21069;&#30340;&#35299;&#20915;&#26041;&#26696;&#36890;&#24120;&#26159;&#38169;&#20301;&#22788;&#29702;&#65292;&#27604;&#22914;&#22522;&#20110;&#21518;&#32493;&#20998;&#37197;&#65292;&#22312;&#36164;&#26684;&#30830;&#35748;&#26102;&#20998;&#37197;&#27835;&#30103;&#26041;&#24335;&#65292;&#36825;&#20250;&#23558;&#20808;&#21069;&#30340;&#20107;&#20214;&#29575;&#38169;&#35823;&#22320;&#24402;&#22240;&#20110;&#27835;&#30103;-&#20174;&#32780;&#20135;&#29983;&#19981;&#21487;&#36991;&#20813;&#30340;&#39118;&#38505;&#20559;&#24046;&#12290;&#21363;&#20351;&#36164;&#26684;&#21644;&#27835;&#30103;&#24050;&#32463;&#23545;&#40784;&#65292;&#32456;&#27490;&#20107;&#20214;&#36807;&#31243;&#65288;&#20363;&#22914;&#27515;&#20129;&#65289;&#20063;&#32463;&#24120;&#20572;&#27490;&#24863;&#20852;&#36259;&#30340;&#22797;&#21457;&#20107;&#20214;&#36807;&#31243;&#12290;&#21516;&#26679;&#65292;&#36825;&#20004;&#20010;&#36807;&#31243;&#20063;&#21463;&#21040;&#23457;&#26597;&#30340;&#24433;&#21709;&#65292;&#22240;&#27492;&#22312;&#25972;&#20010;&#38543;&#35775;&#26102;&#38388;&#31383;&#21475;&#20869;&#19981;&#33021;&#35266;&#23519;&#21040;&#20107;&#20214;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;&#38169;&#20301;&#22788;&#29702;&#36716;&#21270;&#20026;&#27835;&#30103;&#20999;&#25442;&#38382;&#39064;&#65306;&#19968;&#20123;&#24739;&#32773;&#22312;&#25972;&#20010;&#38543;&#35775;&#26102;&#38388;&#31383;&#21475;&#20869;&#22362;&#25345;&#19968;&#20010;&#29305;&#23450;&#30340;&#27835;&#30103;&#31574;&#30053;&#65292;&#21478;&#19968;&#20123;&#24739;&#32773;&#22312;&#36825;&#20010;&#26102;&#38388;&#31383;&#21475;&#20869;&#32463;&#21382;&#27835;&#30103;&#31574;&#30053;&#30340;&#20999;&#25442;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27010;&#29575;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#25324;&#20004;&#20010;&#22522;&#26412;&#20803;&#32032;&#65306;&#36890;&#36807;&#19968;&#20010;&#21512;&#29702;&#30340;&#26102;&#21051;&#20999;&#25442;&#27169;&#22411;&#65292;&#27491;&#30830;&#22320;&#24314;&#27169;&#27835;&#30103;&#20043;&#38388;&#30340;&#20999;&#25442;&#21644;&#19981;&#21487;&#36991;&#20813;&#39118;&#38505;&#65292;&#36890;&#36807;&#23558;&#38750;&#35266;&#23519;&#20107;&#20214;&#27169;&#22411;&#21270;&#20026;&#22797;&#21457;&#20107;&#20214;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#22797;&#22686;&#21644;&#26411;&#20107;&#20214;&#20559;&#24046;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Observational studies of recurrent event rates are common in biomedical statistics. Broadly, the goal is to estimate differences in event rates under two treatments within a defined target population over a specified followup window. Estimation with observational claims data is challenging because while membership in the target population is defined in terms of eligibility criteria, treatment is rarely assigned exactly at the time of eligibility. Ad-hoc solutions to this timing misalignment, such as assigning treatment at eligibility based on subsequent assignment, incorrectly attribute prior event rates to treatment - resulting in immortal risk bias. Even if eligibility and treatment are aligned, a terminal event process (e.g. death) often stops the recurrent event process of interest. Both processes are also censored so that events are not observed over the entire followup window. Our approach addresses misalignment by casting it as a treatment switching problem: some patients are on
&lt;/p&gt;</description></item></channel></rss>