<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31616;&#21333;&#12289;&#36890;&#29992;&#21644;&#39640;&#25928;&#30340;&#21322;&#21442;&#25968;&#36125;&#21494;&#26031;&#22238;&#24402;&#30340;&#33945;&#29305;&#21345;&#27931;&#25512;&#26029;&#31574;&#30053;&#65292;&#21487;&#29992;&#20110;&#32852;&#21512;&#21518;&#39564;&#19968;&#33268;&#24615;&#65292;&#21363;&#20351;&#32463;&#20856;&#30340;&#20284;&#28982;&#20989;&#25968;&#26159;&#38590;&#20197;&#22788;&#29702;&#25110;&#26410;&#30693;&#30340;&#12290;</title><link>http://arxiv.org/abs/2306.05498</link><description>&lt;p&gt;
&#21322;&#21442;&#25968;&#36125;&#21494;&#26031;&#22238;&#24402;&#30340;&#33945;&#29305;&#21345;&#27931;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Monte Carlo inference for semiparametric Bayesian regression. (arXiv:2306.05498v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05498
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31616;&#21333;&#12289;&#36890;&#29992;&#21644;&#39640;&#25928;&#30340;&#21322;&#21442;&#25968;&#36125;&#21494;&#26031;&#22238;&#24402;&#30340;&#33945;&#29305;&#21345;&#27931;&#25512;&#26029;&#31574;&#30053;&#65292;&#21487;&#29992;&#20110;&#32852;&#21512;&#21518;&#39564;&#19968;&#33268;&#24615;&#65292;&#21363;&#20351;&#32463;&#20856;&#30340;&#20284;&#28982;&#20989;&#25968;&#26159;&#38590;&#20197;&#22788;&#29702;&#25110;&#26410;&#30693;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#36716;&#25442;&#23545;&#20110;&#21442;&#25968;&#22238;&#24402;&#27169;&#22411;&#30340;&#24191;&#27867;&#36866;&#29992;&#24615;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#23545;&#20110;&#36125;&#21494;&#26031;&#20998;&#26512;&#65292;&#32852;&#21512;&#25512;&#26029;&#36716;&#25442;&#21644;&#27169;&#22411;&#21442;&#25968;&#36890;&#24120;&#38656;&#35201;&#38480;&#21046;&#24615;&#21442;&#25968;&#36716;&#25442;&#25110;&#38750;&#21442;&#25968;&#34920;&#31034;&#65292;&#36825;&#23545;&#23454;&#29616;&#21644;&#29702;&#35770;&#20998;&#26512;&#26469;&#35828;&#35745;&#31639;&#25928;&#29575;&#20302;&#19979;&#19988;&#32321;&#29712;&#65292;&#38480;&#21046;&#20102;&#20182;&#20204;&#22312;&#23454;&#36341;&#20013;&#30340;&#21487;&#29992;&#24615;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#31616;&#21333;&#12289;&#36890;&#29992;&#21644;&#39640;&#25928;&#30340;&#31574;&#30053;&#65292;&#30452;&#25509;&#36890;&#36807;&#23558;&#36716;&#25442;&#19982;&#29420;&#31435;&#21464;&#37327;&#21644;&#22240;&#21464;&#37327;&#30340;&#36793;&#32536;&#20998;&#24067;&#30456;&#36830;&#30340;&#26041;&#24335;&#26469;&#23450;&#20301;&#26410;&#30693;&#36716;&#25442;&#21644;&#25152;&#26377;&#22238;&#24402;&#27169;&#22411;&#21442;&#25968;&#30340;&#21518;&#39564;&#20998;&#24067;&#65292;&#24182;&#36890;&#36807;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#27169;&#22411;&#20351;&#29992;&#36125;&#21494;&#26031;&#33258;&#20030;&#26041;&#27861;&#12290;&#20851;&#38190;&#26159;&#65292;&#36825;&#31181;&#26041;&#27861;&#22312;&#24191;&#27867;&#30340;&#22238;&#24402;&#27169;&#22411;&#20013;&#37117;&#21487;&#20197;&#23454;&#29616;(1)&#32852;&#21512;&#21518;&#39564;&#19968;&#33268;&#24615;&#65292;&#21253;&#25324;&#22810;&#20010;&#27169;&#22411;&#38169;&#37197;&#24773;&#20917;&#65292;&#21644;(2)&#39640;&#25928;&#30340;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#65292;&#21363;&#20351;&#32463;&#20856;&#30340;&#20284;&#28982;&#20989;&#25968;&#26159;&#38590;&#20197;&#22788;&#29702;&#25110;&#26410;&#30693;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data transformations are essential for broad applicability of parametric regression models. However, for Bayesian analysis, joint inference of the transformation and model parameters typically involves restrictive parametric transformations or nonparametric representations that are computationally inefficient and cumbersome for implementation and theoretical analysis, which limits their usability in practice. This paper introduces a simple, general, and efficient strategy for joint posterior inference of an unknown transformation and all regression model parameters. The proposed approach directly targets the posterior distribution of the transformation by linking it with the marginal distributions of the independent and dependent variables, and then deploys a Bayesian nonparametric model via the Bayesian bootstrap. Crucially, this approach delivers (1) joint posterior consistency under general conditions, including multiple model misspecifications, and (2) efficient Monte Carlo (not Ma
&lt;/p&gt;</description></item></channel></rss>