<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21160;&#24577;&#21327;&#21464;&#37327;&#24179;&#34913;&#26041;&#27861;&#65292;&#22522;&#20110;&#36807;&#21435;&#21382;&#21490;&#19978;&#28508;&#22312;&#32467;&#26524;&#26399;&#26395;&#30340;&#23616;&#37096;&#25237;&#24433;&#65292;&#20272;&#35745;&#38754;&#26495;&#25968;&#25454;&#20013;&#21160;&#24577;&#21464;&#21270;&#30340;&#27835;&#30103;&#25928;&#26524;&#65292;&#24182;&#32771;&#34385;&#32467;&#26524;&#21644;&#26102;&#38388;&#21464;&#21270;&#30340;&#21327;&#21464;&#37327;&#19982;&#27835;&#30103;&#36712;&#36857;&#30340;&#20851;&#31995;&#20197;&#21450;&#27835;&#30103;&#25928;&#24212;&#30340;&#24322;&#36136;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#20855;&#26377;&#33391;&#22909;&#30340;&#28176;&#36817;&#24615;&#36136;&#21644;&#25968;&#20540;&#29305;&#24615;&#65292;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#20855;&#26377;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2103.01280</link><description>&lt;p&gt;
&#21160;&#24577;&#21327;&#21464;&#37327;&#24179;&#34913;&#65306;&#22522;&#20110;&#28508;&#22312;&#23616;&#37096;&#25237;&#24433;&#30340;&#27835;&#30103;&#25928;&#26524;&#38543;&#26102;&#38388;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Dynamic covariate balancing: estimating treatment effects over time with potential local projections. (arXiv:2103.01280v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.01280
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#21160;&#24577;&#21327;&#21464;&#37327;&#24179;&#34913;&#26041;&#27861;&#65292;&#22522;&#20110;&#36807;&#21435;&#21382;&#21490;&#19978;&#28508;&#22312;&#32467;&#26524;&#26399;&#26395;&#30340;&#23616;&#37096;&#25237;&#24433;&#65292;&#20272;&#35745;&#38754;&#26495;&#25968;&#25454;&#20013;&#21160;&#24577;&#21464;&#21270;&#30340;&#27835;&#30103;&#25928;&#26524;&#65292;&#24182;&#32771;&#34385;&#32467;&#26524;&#21644;&#26102;&#38388;&#21464;&#21270;&#30340;&#21327;&#21464;&#37327;&#19982;&#27835;&#30103;&#36712;&#36857;&#30340;&#20851;&#31995;&#20197;&#21450;&#27835;&#30103;&#25928;&#24212;&#30340;&#24322;&#36136;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#20855;&#26377;&#33391;&#22909;&#30340;&#28176;&#36817;&#24615;&#36136;&#21644;&#25968;&#20540;&#29305;&#24615;&#65292;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38754;&#26495;&#25968;&#25454;&#20013;&#27835;&#30103;&#21382;&#21490;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22312;&#27835;&#30103;&#22312;&#26102;&#38388;&#19978;&#21160;&#24577;&#21464;&#21270;&#30340;&#24773;&#20917;&#19979;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#20801;&#35768;&#27835;&#30103;&#26681;&#25454;&#39640;&#32500;&#21327;&#21464;&#37327;&#12289;&#36807;&#21435;&#30340;&#32467;&#26524;&#21644;&#27835;&#30103;&#21160;&#24577;&#20998;&#37197;&#65292;&#21516;&#26102;&#32771;&#34385;&#32467;&#26524;&#21644;&#26102;&#38388;&#21464;&#21270;&#30340;&#21327;&#21464;&#37327;&#19982;&#27835;&#30103;&#36712;&#36857;&#30340;&#20851;&#31995;&#65292;&#20197;&#21450;&#27835;&#30103;&#25928;&#24212;&#30340;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36890;&#36807;&#22312;&#36807;&#21435;&#21382;&#21490;&#19978;&#23545;&#28508;&#22312;&#32467;&#26524;&#26399;&#26395;&#36827;&#34892;&#36882;&#24402;&#25237;&#24433;&#65292;&#28982;&#21518;&#36890;&#36807;&#24179;&#34913;&#21160;&#24577;&#21487;&#35266;&#27979;&#29305;&#24449;&#26469;&#25511;&#21046;&#20559;&#24046;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#24615;&#36136;&#21644;&#25968;&#20540;&#29305;&#24615;&#65292;&#24182;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the estimation and inference of treatment histories in panel data settings when treatments change dynamically over time.  We propose a method that allows for (i) treatments to be assigned dynamically over time based on high-dimensional covariates, past outcomes and treatments; (ii) outcomes and time-varying covariates to depend on treatment trajectories; (iii) heterogeneity of treatment effects.  Our approach recursively projects potential outcomes' expectations on past histories. It then controls the bias by balancing dynamically observable characteristics. We study the asymptotic and numerical properties of the estimator and illustrate the benefits of the procedure in an empirical application.
&lt;/p&gt;</description></item></channel></rss>