<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#24615;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#20272;&#35745;&#22266;&#23450;&#25928;&#24212;&#30340;&#26368;&#20248;&#32553;&#23567;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#38656;&#35201;&#20998;&#24067;&#20551;&#35774;&#65292;&#24182;&#33021;&#22815;&#20805;&#20998;&#22320;&#21033;&#29992;&#24207;&#21015;&#30456;&#20851;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#12290;&#21516;&#26102;&#65292;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#39044;&#27979;&#26410;&#26469;&#22266;&#23450;&#25928;&#24212;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2308.12485</link><description>&lt;p&gt;
&#32447;&#24615;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#22266;&#23450;&#25928;&#24212;&#26368;&#20248;&#32553;&#23567;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Optimal Shrinkage Estimation of Fixed Effects in Linear Panel Data Models. (arXiv:2308.12485v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12485
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#32447;&#24615;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#20272;&#35745;&#22266;&#23450;&#25928;&#24212;&#30340;&#26368;&#20248;&#32553;&#23567;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#38656;&#35201;&#20998;&#24067;&#20551;&#35774;&#65292;&#24182;&#33021;&#22815;&#20805;&#20998;&#22320;&#21033;&#29992;&#24207;&#21015;&#30456;&#20851;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#12290;&#21516;&#26102;&#65292;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#39044;&#27979;&#26410;&#26469;&#22266;&#23450;&#25928;&#24212;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32553;&#23567;&#20272;&#35745;&#26041;&#27861;&#32463;&#24120;&#34987;&#29992;&#20110;&#20272;&#35745;&#22266;&#23450;&#25928;&#24212;&#65292;&#20197;&#20943;&#23569;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#30340;&#22122;&#22768;&#12290;&#28982;&#32780;&#65292;&#24191;&#27867;&#20351;&#29992;&#30340;&#32553;&#23567;&#20272;&#35745;&#20165;&#22312;&#24378;&#20998;&#24067;&#20551;&#35774;&#19979;&#25165;&#33021;&#20445;&#35777;&#38477;&#20302;&#22122;&#22768;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#20272;&#35745;&#22266;&#23450;&#25928;&#24212;&#30340;&#20272;&#35745;&#22120;&#65292;&#22312;&#32553;&#23567;&#20272;&#35745;&#22120;&#31867;&#21035;&#20013;&#33719;&#24471;&#20102;&#26368;&#20339;&#30340;&#22343;&#26041;&#35823;&#24046;&#12290;&#35813;&#31867;&#21035;&#21253;&#25324;&#20256;&#32479;&#30340;&#32553;&#23567;&#20272;&#35745;&#22120;&#65292;&#19988;&#26368;&#20248;&#24615;&#19981;&#38656;&#35201;&#20998;&#24067;&#20551;&#35774;&#12290;&#35813;&#20272;&#35745;&#22120;&#20855;&#26377;&#30452;&#35266;&#30340;&#24418;&#24335;&#65292;&#24182;&#19988;&#26131;&#20110;&#23454;&#29616;&#12290;&#27492;&#22806;&#65292;&#22266;&#23450;&#25928;&#24212;&#20801;&#35768;&#38543;&#26102;&#38388;&#21464;&#21270;&#65292;&#24182;&#19988;&#21487;&#20197;&#20855;&#26377;&#24207;&#21015;&#30456;&#20851;&#24615;&#65292;&#32780;&#32553;&#23567;&#26041;&#27861;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#21487;&#20197;&#26368;&#20248;&#22320;&#32467;&#21512;&#24213;&#23618;&#30456;&#20851;&#32467;&#26500;&#12290;&#22312;&#36825;&#26679;&#30340;&#32972;&#26223;&#19979;&#65292;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#39044;&#27979;&#26410;&#26469;&#19968;&#20010;&#26102;&#26399;&#22266;&#23450;&#25928;&#24212;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Shrinkage methods are frequently used to estimate fixed effects to reduce the noisiness of the least square estimators. However, widely used shrinkage estimators guarantee such noise reduction only under strong distributional assumptions. I develop an estimator for the fixed effects that obtains the best possible mean squared error within a class of shrinkage estimators. This class includes conventional shrinkage estimators and the optimality does not require distributional assumptions. The estimator has an intuitive form and is easy to implement. Moreover, the fixed effects are allowed to vary with time and to be serially correlated, and the shrinkage optimally incorporates the underlying correlation structure in this case. In such a context, I also provide a method to forecast fixed effects one period ahead.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#30340;&#33258;&#36866;&#24212;&#23398;&#29983;t&#20998;&#24067;&#26041;&#27861;&#65292;&#22522;&#20110;&#26041;&#27861;&#30340;&#19968;&#33324;&#33258;&#36866;&#24212;&#30697;&#21487;&#20197;&#20351;&#29992;&#24265;&#20215;&#30340;&#25351;&#25968;&#31227;&#21160;&#24179;&#22343;&#20540;&#65288;EMA&#65289;&#26469;&#20272;&#35745;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2304.03069</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#23398;&#29983;t&#20998;&#24067;&#19982;&#26041;&#27861;&#30697;&#31227;&#21160;&#20272;&#35745;&#22120;&#29992;&#20110;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;
&lt;/p&gt;
&lt;p&gt;
Adaptive Student's t-distribution with method of moments moving estimator for nonstationary time series. (arXiv:2304.03069v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03069
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#30340;&#33258;&#36866;&#24212;&#23398;&#29983;t&#20998;&#24067;&#26041;&#27861;&#65292;&#22522;&#20110;&#26041;&#27861;&#30340;&#19968;&#33324;&#33258;&#36866;&#24212;&#30697;&#21487;&#20197;&#20351;&#29992;&#24265;&#20215;&#30340;&#25351;&#25968;&#31227;&#21160;&#24179;&#22343;&#20540;&#65288;EMA&#65289;&#26469;&#20272;&#35745;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30495;&#23454;&#30340;&#26102;&#38388;&#24207;&#21015;&#36890;&#24120;&#26159;&#38750;&#24179;&#31283;&#30340;&#65292;&#36825;&#24102;&#26469;&#20102;&#27169;&#22411;&#36866;&#24212;&#30340;&#38590;&#39064;&#12290;&#20256;&#32479;&#26041;&#27861;&#22914;GARCH&#20551;&#23450;&#20219;&#24847;&#31867;&#22411;&#30340;&#20381;&#36182;&#24615;&#12290;&#20026;&#20102;&#36991;&#20813;&#36825;&#31181;&#20559;&#24046;&#65292;&#25105;&#20204;&#23558;&#30528;&#30524;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;&#19981;&#21487;&#30693;&#30340;&#31227;&#21160;&#20272;&#35745;&#22120;&#21746;&#23398;&#65306;&#22312;&#26102;&#38388;$t$&#25214;&#21040;&#20248;&#21270;$F_t=\sum_{\tau&lt;t} (1-\eta)^{t-\tau} \ln(\rho_\theta (x_\tau))$&#31227;&#21160;&#23545;&#25968;&#20284;&#28982;&#30340;&#21442;&#25968;&#65292;&#38543;&#26102;&#38388;&#28436;&#21270;&#12290;&#20363;&#22914;&#65292;&#23427;&#20801;&#35768;&#20351;&#29992;&#24265;&#20215;&#30340;&#25351;&#25968;&#31227;&#21160;&#24179;&#22343;&#20540;&#65288;EMA&#65289;&#26469;&#20272;&#35745;&#21442;&#25968;&#65292;&#20363;&#22914;&#32477;&#23545;&#20013;&#24515;&#30697;$E[|x-\mu|^p]$&#38543;$p\in\mathbb{R}^+$&#30340;&#21464;&#21270;&#32780;&#28436;&#21270;$m_{p,t+1} = m_{p,t} + \eta (|x_t-\mu_t|^p-m_{p,t})$&#12290;&#36825;&#31181;&#22522;&#20110;&#26041;&#27861;&#30340;&#19968;&#33324;&#33258;&#36866;&#24212;&#30697;&#30340;&#24212;&#29992;&#23558;&#21576;&#29616;&#22312;&#23398;&#29983;t&#20998;&#24067;&#19978;&#65292;&#23588;&#20854;&#26159;&#22312;&#32463;&#27982;&#24212;&#29992;&#20013;&#27969;&#34892;&#65292;&#36825;&#37324;&#24212;&#29992;&#20110;DJIA&#20844;&#21496;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
The real life time series are usually nonstationary, bringing a difficult question of model adaptation. Classical approaches like GARCH assume arbitrary type of dependence. To prevent such bias, we will focus on recently proposed agnostic philosophy of moving estimator: in time $t$ finding parameters optimizing e.g. $F_t=\sum_{\tau&lt;t} (1-\eta)^{t-\tau} \ln(\rho_\theta (x_\tau))$ moving log-likelihood, evolving in time. It allows for example to estimate parameters using inexpensive exponential moving averages (EMA), like absolute central moments $E[|x-\mu|^p]$ evolving with $m_{p,t+1} = m_{p,t} + \eta (|x_t-\mu_t|^p-m_{p,t})$ for one or multiple powers $p\in\mathbb{R}^+$. Application of such general adaptive methods of moments will be presented on Student's t-distribution, popular especially in economical applications, here applied to log-returns of DJIA companies.
&lt;/p&gt;</description></item></channel></rss>