<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#20351;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#25366;&#25496;14&#19975;&#26465;&#22810;&#31354;&#31574;&#30053;&#25968;&#25454;&#65292;&#23454;&#29616;&#8220;&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;&#8221;&#65292;&#39044;&#27979;&#39640;&#25910;&#30410;&#38598;&#20013;&#22312;&#20250;&#35745;&#31574;&#30053;&#12289;&#23567;&#30424;&#32929;&#21644;&#26089;&#20110;2004&#24180;&#30340;&#26679;&#26412;&#20013;&#65292;&#20026;&#35760;&#24405;&#36164;&#20135;&#23450;&#20215;&#20107;&#23454;&#25552;&#20379;&#20102;&#20005;&#26684;&#12289;&#26080;&#20559;&#35265;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2311.10685</link><description>&lt;p&gt;
&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
High-Throughput Asset Pricing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.10685
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#25366;&#25496;14&#19975;&#26465;&#22810;&#31354;&#31574;&#30053;&#25968;&#25454;&#65292;&#23454;&#29616;&#8220;&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;&#8221;&#65292;&#39044;&#27979;&#39640;&#25910;&#30410;&#38598;&#20013;&#22312;&#20250;&#35745;&#31574;&#30053;&#12289;&#23567;&#30424;&#32929;&#21644;&#26089;&#20110;2004&#24180;&#30340;&#26679;&#26412;&#20013;&#65292;&#20026;&#35760;&#24405;&#36164;&#20135;&#23450;&#20215;&#20107;&#23454;&#25552;&#20379;&#20102;&#20005;&#26684;&#12289;&#26080;&#20559;&#35265;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#65288;EB&#65289;&#25366;&#25496;&#20102;&#26469;&#33258;&#20250;&#35745;&#27604;&#29575;&#12289;&#36807;&#21435;&#25910;&#30410;&#21644;&#32929;&#31080;&#31526;&#21495;&#26500;&#24314;&#30340;14&#19975;&#26465;&#22810;&#31354;&#31574;&#30053;&#30340;&#25968;&#25454;&#12290;&#36825;&#31181;&#8220;&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;&#8221;&#20135;&#29983;&#30340;&#26679;&#26412;&#22806;&#32489;&#25928;&#19982;&#39030;&#32423;&#37329;&#34701;&#26399;&#21002;&#20013;&#30340;&#31574;&#30053;&#30456;&#24403;&#12290;&#19982;&#24050;&#21457;&#34920;&#30340;&#31574;&#30053;&#19981;&#21516;&#65292;&#25968;&#25454;&#25366;&#25496;&#30340;&#31574;&#30053;&#20813;&#21463;&#21069;&#30651;&#24615;&#20559;&#35265;&#12290;EB &#39044;&#27979;&#39640;&#25910;&#30410;&#38598;&#20013;&#22312;&#20250;&#35745;&#31574;&#30053;&#12289;&#23567;&#30424;&#32929;&#21644;2004&#24180;&#20043;&#21069;&#30340;&#26679;&#26412;&#20013;&#65292;&#19982;&#26377;&#38480;&#27880;&#24847;&#21147;&#29702;&#35770;&#19968;&#33268;&#12290;&#36890;&#36807;T&#32479;&#35745;&#37327;&#30340;&#27178;&#25130;&#38754;&#20998;&#24067;&#21487;&#20197;&#30475;&#20986;&#36825;&#31181;&#30452;&#35273;&#65292;&#23545;&#20110;&#31561;&#26435;&#37325;&#30340;&#20250;&#35745;&#31574;&#30053;&#65292;&#36825;&#20010;&#20998;&#24067;&#19982;&#38646;&#20551;&#35774;&#30456;&#21435;&#29978;&#36828;&#12290;&#39640;&#36890;&#37327;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#20005;&#26684;&#12289;&#26080;&#20559;&#35265;&#30340;&#26041;&#24335;&#65292;&#29992;&#20110;&#35760;&#24405;&#36164;&#20135;&#23450;&#20215;&#20107;&#23454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.10685v2 Announce Type: replace-cross  Abstract: We use empirical Bayes (EB) to mine data on 140,000 long-short strategies constructed from accounting ratios, past returns, and ticker symbols. This "high-throughput asset pricing" produces out-of-sample performance comparable to strategies in top finance journals. But unlike the published strategies, the data-mined strategies are free of look-ahead bias. EB predicts that high returns are concentrated in accounting strategies, small stocks, and pre-2004 samples, consistent with limited attention theories. The intuition is seen in the cross-sectional distribution of t-stats, which is far from the null for equal-weighted accounting strategies. High-throughput methods provide a rigorous, unbiased method for documenting asset pricing facts.
&lt;/p&gt;</description></item></channel></rss>