<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36890;&#36807;&#20004;&#38454;&#27573;&#20272;&#35745;&#31574;&#30053;&#65292;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#20013;&#24178;&#25200;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#26088;&#22312;&#26681;&#25454;&#20854;&#22312;&#20559;&#24046;&#32467;&#26500;&#20013;&#30340;&#20316;&#29992;&#26469;&#20272;&#35745;&#24178;&#25200;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2404.00735</link><description>&lt;p&gt;
&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#30340;&#20004;&#38454;&#27573;&#24178;&#25200;&#20989;&#25968;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Two-Stage Nuisance Function Estimation for Causal Mediation Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00735
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20004;&#38454;&#27573;&#20272;&#35745;&#31574;&#30053;&#65292;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#20013;&#24178;&#25200;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#26088;&#22312;&#26681;&#25454;&#20854;&#22312;&#20559;&#24046;&#32467;&#26500;&#20013;&#30340;&#20316;&#29992;&#26469;&#20272;&#35745;&#24178;&#25200;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20351;&#29992;&#22522;&#20110;&#24433;&#21709;&#20989;&#25968;&#30340;&#20013;&#20171;&#21151;&#33021;&#20272;&#35745;&#22120;&#20272;&#35745;&#30452;&#25509;&#21644;&#38388;&#25509;&#22240;&#26524;&#25928;&#24212;&#26102;&#65292;&#20102;&#35299;&#24212;&#35813;&#20851;&#27880;&#27835;&#30103;&#12289;&#20013;&#20171;&#21644;&#32467;&#26524;&#30340;&#21738;&#20123;&#26041;&#38754;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#23558;&#23427;&#20204;&#35270;&#20026;&#24178;&#25200;&#20989;&#25968;&#65292;&#24182;&#35797;&#22270;&#23613;&#21487;&#33021;&#20934;&#30830;&#22320;&#25311;&#21512;&#36825;&#20123;&#24178;&#25200;&#20989;&#25968;&#24182;&#19981;&#19968;&#23450;&#26159;&#26368;&#22909;&#30340;&#26041;&#27861;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#24178;&#25200;&#20989;&#25968;&#30340;&#20004;&#38454;&#27573;&#20272;&#35745;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#26681;&#25454;&#24178;&#25200;&#20989;&#25968;&#22312;&#24433;&#21709;&#20989;&#25968;&#30340;&#20013;&#20171;&#21151;&#33021;&#20272;&#35745;&#22120;&#30340;&#20559;&#24046;&#32467;&#26500;&#20013;&#21457;&#25381;&#30340;&#20316;&#29992;&#26469;&#20272;&#35745;&#24178;&#25200;&#20989;&#25968;&#12290;&#25105;&#20204;&#23545;&#25152;&#25552;&#20986;&#26041;&#27861;&#36827;&#34892;&#20102;&#31283;&#20581;&#24615;&#20998;&#26512;&#65292;&#20197;&#21450;&#21442;&#25968;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00735v1 Announce Type: cross  Abstract: When estimating the direct and indirect causal effects using the influence function-based estimator of the mediation functional, it is crucial to understand what aspects of the treatment, the mediator, and the outcome mean mechanisms should be focused on. Specifically, considering them as nuisance functions and attempting to fit these nuisance functions as accurate as possible is not necessarily the best approach to take. In this work, we propose a two-stage estimation strategy for the nuisance functions that estimates the nuisance functions based on the role they play in the structure of the bias of the influence function-based estimator of the mediation functional. We provide robustness analysis of the proposed method, as well as sufficient conditions for consistency and asymptotic normality of the estimator of the parameter of interest.
&lt;/p&gt;</description></item><item><title>&#36825;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#30340;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#23427;&#25552;&#20379;&#20102;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#26159;&#21487;&#34892;&#30340;&#12290;</title><link>http://arxiv.org/abs/2307.01449</link><description>&lt;p&gt;
&#23558;&#23454;&#39564;&#25968;&#25454;&#19982;&#35266;&#27979;&#25968;&#25454;&#32467;&#21512;&#30340;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Double Machine Learning Approach to Combining Experimental and Observational Data. (arXiv:2307.01449v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01449
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#30340;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#23427;&#25552;&#20379;&#20102;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#26159;&#21487;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#36890;&#24120;&#30001;&#20110;&#26080;&#27861;&#27979;&#35797;&#30340;&#20551;&#35774;&#32780;&#32570;&#20047;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#20351;&#20174;&#19994;&#20154;&#21592;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#36739;&#36731;&#30340;&#20551;&#35774;&#19979;&#27979;&#35797;&#22806;&#37096;&#25928;&#24230;&#21644;&#21487;&#24573;&#35270;&#24615;&#30340;&#36829;&#21453;&#24773;&#20917;&#12290;&#24403;&#21482;&#26377;&#19968;&#20010;&#20551;&#35774;&#34987;&#36829;&#21453;&#26102;&#65292;&#25105;&#20204;&#25552;&#20379;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#30340;&#26080;&#20813;&#36153;&#21320;&#39184;&#23450;&#29702;&#24378;&#35843;&#20102;&#20934;&#30830;&#35782;&#21035;&#36829;&#21453;&#30340;&#20551;&#35774;&#23545;&#19968;&#33268;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#24517;&#35201;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#19977;&#20010;&#23454;&#38469;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#31361;&#20986;&#20102;&#20854;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Experimental and observational studies often lack validity due to untestable assumptions. We propose a double machine learning approach to combine experimental and observational studies, allowing practitioners to test for assumption violations and estimate treatment effects consistently. Our framework tests for violations of external validity and ignorability under milder assumptions. When only one assumption is violated, we provide semi-parametrically efficient treatment effect estimators. However, our no-free-lunch theorem highlights the necessity of accurately identifying the violated assumption for consistent treatment effect estimation. We demonstrate the applicability of our approach in three real-world case studies, highlighting its relevance for practical settings.
&lt;/p&gt;</description></item><item><title>&#22312;&#23384;&#22312;&#32456;&#32467;&#20107;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#30740;&#31350;&#32463;&#24120;&#24615;&#20107;&#20214;&#30340;&#22240;&#26524;&#25512;&#26029;&#21644;&#39640;&#25928;&#20272;&#35745;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20056;&#27861;&#40065;&#26834;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#19981;&#20381;&#36182;&#20110;&#20998;&#24067;&#20551;&#35774;&#65292;&#24182;&#25351;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#22240;&#26524;&#29983;&#21629;&#21608;&#26399;&#20013;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.16571</link><description>&lt;p&gt;
&#22312;&#23384;&#22312;&#32456;&#32467;&#20107;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#20851;&#20110;&#32463;&#24120;&#24615;&#20107;&#20214;&#30340;&#22240;&#26524;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Causal inference for the expected number of recurrent events in the presence of a terminal event. (arXiv:2306.16571v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16571
&lt;/p&gt;
&lt;p&gt;
&#22312;&#23384;&#22312;&#32456;&#32467;&#20107;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#30740;&#31350;&#32463;&#24120;&#24615;&#20107;&#20214;&#30340;&#22240;&#26524;&#25512;&#26029;&#21644;&#39640;&#25928;&#20272;&#35745;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20056;&#27861;&#40065;&#26834;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#19981;&#20381;&#36182;&#20110;&#20998;&#24067;&#20551;&#35774;&#65292;&#24182;&#25351;&#20986;&#20102;&#19968;&#20123;&#26377;&#36259;&#30340;&#22240;&#26524;&#29983;&#21629;&#21608;&#26399;&#20013;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#32456;&#32467;&#20107;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#20851;&#20110;&#32463;&#24120;&#24615;&#20107;&#20214;&#30340;&#22240;&#26524;&#25512;&#26029;&#21644;&#39640;&#25928;&#20272;&#35745;&#12290;&#25105;&#20204;&#23558;&#20272;&#35745;&#30446;&#26631;&#23450;&#20041;&#20026;&#21253;&#25324;&#32463;&#24120;&#24615;&#20107;&#20214;&#30340;&#39044;&#26399;&#25968;&#37327;&#20197;&#21450;&#22312;&#19968;&#31995;&#21015;&#37324;&#31243;&#30865;&#26102;&#38388;&#28857;&#22788;&#35780;&#20272;&#30340;&#22833;&#36133;&#29983;&#23384;&#20989;&#25968;&#30340;&#21521;&#37327;&#12290;&#25105;&#20204;&#22312;&#21491;&#25130;&#23614;&#21644;&#22240;&#26524;&#36873;&#25321;&#30340;&#24773;&#20917;&#19979;&#30830;&#23450;&#20102;&#20272;&#35745;&#30446;&#26631;&#65292;&#20316;&#20026;&#35266;&#23519;&#25968;&#25454;&#30340;&#21151;&#33021;&#24615;&#65292;&#25512;&#23548;&#20102;&#38750;&#21442;&#25968;&#25928;&#29575;&#30028;&#38480;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#37325;&#40065;&#26834;&#20272;&#35745;&#22120;&#65292;&#35813;&#20272;&#35745;&#22120;&#36798;&#21040;&#20102;&#30028;&#38480;&#65292;&#24182;&#20801;&#35768;&#38750;&#21442;&#25968;&#20272;&#35745;&#36741;&#21161;&#21442;&#25968;&#12290;&#22312;&#25972;&#20010;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#23545;&#22833;&#36133;&#12289;&#25130;&#23614;&#25110;&#35266;&#23519;&#25968;&#25454;&#30340;&#27010;&#29575;&#20998;&#24067;&#27809;&#26377;&#20570;&#32477;&#23545;&#36830;&#32493;&#24615;&#30340;&#20551;&#35774;&#12290;&#27492;&#22806;&#65292;&#24403;&#20998;&#21106;&#20998;&#24067;&#24050;&#30693;&#26102;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#24433;&#21709;&#20989;&#25968;&#30340;&#31867;&#21035;&#65292;&#24182;&#22238;&#39038;&#20102;&#24050;&#21457;&#34920;&#20272;&#35745;&#22120;&#22914;&#20309;&#23646;&#20110;&#35813;&#31867;&#21035;&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#22240;&#26524;&#29983;&#21629;&#21608;&#26399;&#20013;&#19968;&#20123;&#26377;&#36259;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study causal inference and efficient estimation for the expected number of recurrent events in the presence of a terminal event. We define our estimand as the vector comprising both the expected number of recurrent events and the failure survival function evaluated along a sequence of landmark times. We identify the estimand in the presence of right-censoring and causal selection as an observed data functional under coarsening at random, derive the nonparametric efficiency bound, and propose a multiply-robust estimator that achieves the bound and permits nonparametric estimation of nuisance parameters. Throughout, no absolute continuity assumption is made on the underlying probability distributions of failure, censoring, or the observed data. Additionally, we derive the class of influence functions when the coarsening distribution is known and review how published estimators may belong to the class. Along the way, we highlight some interesting inconsistencies in the causal lifetime 
&lt;/p&gt;</description></item></channel></rss>