<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#26356;&#26377;&#25928;&#22320;&#21033;&#29992;&#21327;&#21464;&#37327;&#20449;&#24687;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#21487;&#20197;&#23481;&#32435;&#22823;&#37327;&#30340;&#31163;&#25955;&#25110;&#36830;&#32493;&#21327;&#21464;&#37327;&#65292;&#24182;&#32463;&#30001;&#26426;&#22120;&#23398;&#20064;&#12289;&#38750;&#21442;&#25968;&#22238;&#24402;&#25110;&#32463;&#20856;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#12290;&#36890;&#36807;&#23545;&#32467;&#26524;&#21464;&#37327;&#36866;&#24403;&#20462;&#25913;&#65292;&#36825;&#31181;&#20272;&#35745;&#22120;&#26131;&#20110;&#23454;&#29616;&#65292;&#21487;&#20197;&#36873;&#25321;&#31867;&#20284;&#20110;&#20256;&#32479;RD&#20998;&#26512;&#30340;&#35843;&#25972;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2107.07942</link><description>&lt;p&gt;
&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#30340;&#28789;&#27963;&#21327;&#21464;&#37327;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Flexible Covariate Adjustments in Regression Discontinuity Designs. (arXiv:2107.07942v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.07942
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#26356;&#26377;&#25928;&#22320;&#21033;&#29992;&#21327;&#21464;&#37327;&#20449;&#24687;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#21487;&#20197;&#23481;&#32435;&#22823;&#37327;&#30340;&#31163;&#25955;&#25110;&#36830;&#32493;&#21327;&#21464;&#37327;&#65292;&#24182;&#32463;&#30001;&#26426;&#22120;&#23398;&#20064;&#12289;&#38750;&#21442;&#25968;&#22238;&#24402;&#25110;&#32463;&#20856;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#12290;&#36890;&#36807;&#23545;&#32467;&#26524;&#21464;&#37327;&#36866;&#24403;&#20462;&#25913;&#65292;&#36825;&#31181;&#20272;&#35745;&#22120;&#26131;&#20110;&#23454;&#29616;&#65292;&#21487;&#20197;&#36873;&#25321;&#31867;&#20284;&#20110;&#20256;&#32479;RD&#20998;&#26512;&#30340;&#35843;&#25972;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#35777;&#22238;&#24402;&#19981;&#36830;&#32493;&#65288;RD&#65289;&#30740;&#31350;&#36890;&#24120;&#20351;&#29992;&#21327;&#21464;&#37327;&#26469;&#22686;&#21152;&#20854;&#20272;&#35745;&#32467;&#26524;&#30340;&#31934;&#24230;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#27604;&#30446;&#21069;&#23454;&#36341;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#32447;&#24615;&#35843;&#25972;&#20272;&#35745;&#22120;&#26356;&#26377;&#25928;&#22320;&#21033;&#29992;&#36825;&#20123;&#21327;&#21464;&#37327;&#20449;&#24687;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#23481;&#32435;&#21487;&#33021;&#22823;&#37327;&#30340;&#31163;&#25955;&#25110;&#36830;&#32493;&#21327;&#21464;&#37327;&#12290;&#23427;&#28041;&#21450;&#20351;&#29992;&#36866;&#24403;&#20462;&#25913;&#20102;&#30340;&#32467;&#26524;&#21464;&#37327;&#36816;&#34892;&#26631;&#20934;RD&#20998;&#26512;&#65292;&#35813;&#21464;&#37327;&#30340;&#24418;&#24335;&#20026;&#21407;&#22987;&#32467;&#26524;&#19982;&#21327;&#21464;&#37327;&#20989;&#25968;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#23548;&#33268;&#28176;&#36817;&#26041;&#24046;&#26368;&#23567;&#30340;&#20272;&#35745;&#22120;&#30340;&#20989;&#25968;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#29616;&#20195;&#26426;&#22120;&#23398;&#20064;&#12289;&#38750;&#21442;&#25968;&#22238;&#24402;&#25110;&#32463;&#20856;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#23427;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#20272;&#35745;&#22120;&#26131;&#20110;&#23454;&#29616;&#65292;&#22240;&#20026;&#21487;&#20197;&#36873;&#25321;&#31867;&#20284;&#20110;&#20256;&#32479;RD&#20998;&#26512;&#30340;&#35843;&#25972;&#21442;&#25968;&#12290;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#30340;&#24615;&#33021;&#65292;&#21478;&#22806;&#65292;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;&#31361;&#20986;&#20102;&#23427;&#30340;&#23454;&#35777;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Empirical regression discontinuity (RD) studies often use covariates to increase the precision of their estimates. In this paper, we propose a novel class of estimators that use such covariate information more efficiently than the linear adjustment estimators that are currently used widely in practice. Our approach can accommodate a possibly large number of either discrete or continuous covariates. It involves running a standard RD analysis with an appropriately modified outcome variable, which takes the form of the difference between the original outcome and a function of the covariates. We characterize the function that leads to the estimator with the smallest asymptotic variance, and show how it can be estimated via modern machine learning, nonparametric regression, or classical parametric methods. The resulting estimator is easy to implement, as tuning parameters can be chosen as in a conventional RD analysis. An extensive simulation study illustrates the performance of our approac
&lt;/p&gt;</description></item></channel></rss>