<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20010;&#24615;&#21270;&#21160;&#24577;&#36229;&#32423;&#23398;&#20064;&#31639;&#27861; (POSL)&#65292;&#21487;&#20197;&#23454;&#29616;&#23454;&#26102;&#26356;&#26032;&#30340;&#39044;&#27979;&#12290;&#20316;&#32773;&#36890;&#36807;&#39044;&#27979;&#34880;&#28082;&#36879;&#26512;&#24739;&#32773;&#30340;&#23545;&#27969;&#23481;&#31215;&#65292;&#23637;&#31034;&#20102;POSL&#22312;&#20013;&#20301;&#32477;&#23545;&#35823;&#24046;&#12289;&#22823;&#22411;&#26657;&#20934;&#12289;&#21306;&#20998;&#24230;&#21644;&#20928;&#25910;&#30410;&#26041;&#38754;&#30340;&#20248;&#36234;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2310.08479</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#21160;&#24577;&#36229;&#32423;&#23398;&#20064;&#65306;&#22312;&#39044;&#27979;&#34880;&#28082;&#36879;&#26512;&#30340;&#23545;&#27969;&#23481;&#31215;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Personalised dynamic super learning: an application in predicting hemodiafiltration's convection volumes. (arXiv:2310.08479v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08479
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20010;&#24615;&#21270;&#21160;&#24577;&#36229;&#32423;&#23398;&#20064;&#31639;&#27861; (POSL)&#65292;&#21487;&#20197;&#23454;&#29616;&#23454;&#26102;&#26356;&#26032;&#30340;&#39044;&#27979;&#12290;&#20316;&#32773;&#36890;&#36807;&#39044;&#27979;&#34880;&#28082;&#36879;&#26512;&#24739;&#32773;&#30340;&#23545;&#27969;&#23481;&#31215;&#65292;&#23637;&#31034;&#20102;POSL&#22312;&#20013;&#20301;&#32477;&#23545;&#35823;&#24046;&#12289;&#22823;&#22411;&#26657;&#20934;&#12289;&#21306;&#20998;&#24230;&#21644;&#20928;&#25910;&#30410;&#26041;&#38754;&#30340;&#20248;&#36234;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#26102;&#26356;&#26032;&#30340;&#39044;&#27979;&#26159;&#20010;&#24615;&#21270;&#21307;&#30103;&#30340;&#19968;&#20010;&#37325;&#22823;&#25361;&#25112;&#12290;&#36890;&#36807;&#32467;&#21512;&#21442;&#25968;&#22238;&#24402;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20010;&#24615;&#21270;&#22312;&#32447;&#36229;&#32423;&#23398;&#20064;&#31639;&#27861;&#65288;POSL&#65289;&#21487;&#20197;&#23454;&#29616;&#21160;&#24577;&#21644;&#20010;&#24615;&#21270;&#30340;&#39044;&#27979;&#12290;&#25105;&#20204;&#23558;POSL&#24212;&#29992;&#20110;&#21160;&#24577;&#39044;&#27979;&#37325;&#22797;&#36830;&#32493;&#32467;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39564;&#35777;&#20010;&#24615;&#21270;&#25110;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#39044;&#27979;&#36827;&#34892;&#34880;&#28082;&#36879;&#26512;&#30340;&#24739;&#32773;&#30340;&#23545;&#27969;&#23481;&#31215;&#26469;&#23637;&#31034;&#20854;&#24615;&#33021;&#12290;POSL&#22312;&#20013;&#20301;&#32477;&#23545;&#35823;&#24046;&#12289;&#22823;&#22411;&#26657;&#20934;&#12289;&#21306;&#20998;&#24230;&#21644;&#20928;&#25910;&#30410;&#26041;&#38754;&#30340;&#34920;&#29616;&#20248;&#20110;&#20854;&#20505;&#36873;&#23398;&#20064;&#22120;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#20351;&#29992;POSL&#30340;&#36873;&#25321;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
Obtaining continuously updated predictions is a major challenge for personalised medicine. Leveraging combinations of parametric regressions and machine learning approaches, the personalised online super learner (POSL) can achieve such dynamic and personalised predictions. We adapt POSL to predict a repeated continuous outcome dynamically and propose a new way to validate such personalised or dynamic prediction models. We illustrate its performance by predicting the convection volume of patients undergoing hemodiafiltration. POSL outperformed its candidate learners with respect to median absolute error, calibration-in-the-large, discrimination, and net benefit. We finally discuss the choices and challenges underlying the use of POSL.
&lt;/p&gt;</description></item></channel></rss>