<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#35838;&#31243;&#20171;&#32461;&#20102;&#27969;&#34892;&#30340;&#25968;&#25454;&#31185;&#23398;&#35821;&#35328;R&#65292;&#24182;&#26088;&#22312;&#22521;&#20859;&#23398;&#29983;&#12289;&#20174;&#19994;&#32773;&#21644;&#30740;&#31350;&#32773;&#25104;&#20026;&#29420;&#31435;&#30340;R&#35821;&#35328;&#29992;&#25143;&#12290;</title><link>http://arxiv.org/abs/2301.01188</link><description>&lt;p&gt;
&#28145;&#24230;R&#32534;&#31243;
&lt;/p&gt;
&lt;p&gt;
Deep R Programming. (arXiv:2301.01188v2 [cs.PL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.01188
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35838;&#31243;&#20171;&#32461;&#20102;&#27969;&#34892;&#30340;&#25968;&#25454;&#31185;&#23398;&#35821;&#35328;R&#65292;&#24182;&#26088;&#22312;&#22521;&#20859;&#23398;&#29983;&#12289;&#20174;&#19994;&#32773;&#21644;&#30740;&#31350;&#32773;&#25104;&#20026;&#29420;&#31435;&#30340;R&#35821;&#35328;&#29992;&#25143;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;R&#32534;&#31243;&#26159;&#19968;&#38376;&#20840;&#38754;&#30340;&#35838;&#31243;&#65292;&#37325;&#28857;&#20171;&#32461;&#25968;&#25454;&#31185;&#23398;&#20013;&#26368;&#27969;&#34892;&#30340;&#35821;&#35328;&#20043;&#19968;&#8212;&#8212;R&#35821;&#35328;&#65288;&#32479;&#35745;&#35745;&#31639;&#12289;&#25968;&#25454;&#21487;&#35270;&#21270;&#12289;&#26426;&#22120;&#23398;&#20064;&#12289;&#25968;&#25454;&#28165;&#27927;&#21644;&#20998;&#26512;&#65289;&#12290;&#23427;&#28145;&#20837;&#20171;&#32461;&#20102;R&#35821;&#35328;&#30340;&#22522;&#30784;&#30693;&#35782;&#65292;&#26088;&#22312;&#22521;&#20859;&#26377;&#25265;&#36127;&#30340;&#23398;&#29983;&#12289;&#20174;&#19994;&#32773;&#21644;&#30740;&#31350;&#32773;&#65292;&#35753;&#20182;&#20204;&#25104;&#20026;&#29420;&#31435;&#20351;&#29992;&#36825;&#20010;&#24378;&#22823;&#29615;&#22659;&#30340;&#29992;&#25143;&#12290;&#36825;&#20010;&#25945;&#26448;&#26159;&#19968;&#20010;&#38750;&#30408;&#21033;&#39033;&#30446;&#65292;&#23427;&#30340;&#22312;&#32447;&#21644;PDF&#29256;&#26412;&#21487;&#20197;&#22312; &lt;https://deepr.gagolewski.com/&gt; &#20813;&#36153;&#33719;&#21462;&#12290;&#24076;&#26395;&#36825;&#20010;&#26089;&#26399;&#33609;&#26696;&#21457;&#25918;&#20986;&#26469;&#21518;&#33021;&#23545;&#35835;&#32773;&#26377;&#25152;&#24110;&#21161;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep R Programming is a comprehensive course on one of the most popular languages in data science (statistical computing, graphics, machine learning, data wrangling and analytics). It introduces the base language in-depth and is aimed at ambitious students, practitioners, and researchers who would like to become independent users of this powerful environment. This textbook is a non-profit project. Its online and PDF versions are freely available at &lt;https://deepr.gagolewski.com/&gt;. This early draft is distributed in the hope that it will be useful.
&lt;/p&gt;</description></item></channel></rss>