<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;&#24314;&#27169;&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#21644;&#35746;&#21333;&#23610;&#23544;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#26657;&#20934;&#20998;&#24067;&#25277;&#21462;&#27599;&#20010;&#20107;&#20214;&#30340;&#35746;&#21333;&#23610;&#23544;&#65292;&#24182;&#22312;&#27169;&#22411;&#20013;&#20445;&#25345;&#27491;&#30340;&#20215;&#24046;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#26681;&#25454;&#26102;&#38388;&#26465;&#20214;&#27169;&#22411;&#21442;&#25968;&#25903;&#25345;&#32463;&#39564;&#35266;&#23519;&#65292;&#24182;&#20351;&#29992;&#25913;&#36827;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#26657;&#20934;&#38669;&#20811;&#26031;&#26680;&#20989;&#25968;&#21644;&#25233;&#21046;&#24615;&#20132;&#21449;&#28608;&#21457;&#26680;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2312.08927</link><description>&lt;p&gt;
&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#19982;&#35746;&#21333;&#23610;&#23544;&#24314;&#27169;&#65306;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;
&lt;/p&gt;
&lt;p&gt;
Limit Order Book Dynamics and Order Size Modelling Using Compound Hawkes Process
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.08927
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;&#24314;&#27169;&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#21644;&#35746;&#21333;&#23610;&#23544;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#26657;&#20934;&#20998;&#24067;&#25277;&#21462;&#27599;&#20010;&#20107;&#20214;&#30340;&#35746;&#21333;&#23610;&#23544;&#65292;&#24182;&#22312;&#27169;&#22411;&#20013;&#20445;&#25345;&#27491;&#30340;&#20215;&#24046;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#26681;&#25454;&#26102;&#38388;&#26465;&#20214;&#27169;&#22411;&#21442;&#25968;&#25903;&#25345;&#32463;&#39564;&#35266;&#23519;&#65292;&#24182;&#20351;&#29992;&#25913;&#36827;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#26657;&#20934;&#38669;&#20811;&#26031;&#26680;&#20989;&#25968;&#21644;&#25233;&#21046;&#24615;&#20132;&#21449;&#28608;&#21457;&#26680;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38669;&#20811;&#26031;&#36827;&#31243;&#24050;&#22312;&#25991;&#29486;&#20013;&#22810;&#31181;&#26041;&#24335;&#34987;&#29992;&#20110;&#27169;&#25311;&#38480;&#20215;&#21333;&#31807;&#21160;&#24577;&#65292;&#20294;&#24448;&#24448;&#20165;&#20851;&#27880;&#20107;&#20214;&#38388;&#38548;&#65292;&#32780;&#35746;&#21333;&#23610;&#23544;&#36890;&#24120;&#34987;&#20551;&#35774;&#20026;&#24120;&#25968;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#22797;&#21512;&#38669;&#20811;&#26031;&#36827;&#31243;&#26469;&#27169;&#25311;&#38480;&#20215;&#21333;&#31807;&#65292;&#20854;&#20013;&#27599;&#20010;&#20107;&#20214;&#30340;&#35746;&#21333;&#23610;&#23544;&#26469;&#33258;&#26657;&#20934;&#20998;&#24067;&#12290;&#35813;&#26041;&#27861;&#20197;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#24335;&#26500;&#24314;&#65292;&#20351;&#36827;&#31243;&#30340;&#20215;&#24046;&#22987;&#32456;&#20445;&#25345;&#27491;&#20540;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#26681;&#25454;&#26102;&#38388;&#26465;&#20214;&#27169;&#22411;&#21442;&#25968;&#20197;&#25903;&#25345;&#32463;&#39564;&#35266;&#23519;&#12290;&#25105;&#20204;&#20351;&#29992;&#25913;&#36827;&#30340;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#26657;&#20934;&#38669;&#20811;&#26031;&#26680;&#20989;&#25968;&#65292;&#24182;&#20801;&#35768;&#25233;&#21046;&#24615;&#20132;&#21449;&#28608;&#21457;&#26680;&#20989;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#32435;&#26031;&#36798;&#20811;&#20132;&#26131;&#25152;&#20013;&#19968;&#21482;&#32929;&#31080;&#30340;&#38480;&#20215;&#21333;&#31807;&#19978;&#30340;&#32467;&#26524;&#21644;&#36866;&#24230;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hawkes Process has been used to model Limit Order Book (LOB) dynamics in several ways in the literature however the focus has been limited to capturing the inter-event times while the order size is usually assumed to be constant. We propose a novel methodology of using Compound Hawkes Process for the LOB where each event has an order size sampled from a calibrated distribution. The process is formulated in a novel way such that the spread of the process always remains positive. Further, we condition the model parameters on time of day to support empirical observations. We make use of an enhanced non-parametric method to calibrate the Hawkes kernels and allow for inhibitory cross-excitation kernels. We showcase the results and quality of fits for an equity stock's LOB in the NASDAQ exchange.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#34920;&#26126;&#65292;&#22312;&#23616;&#37096;&#25237;&#24433;&#20998;&#26512;&#20013;&#65292;&#24212;&#35813;&#20351;&#29992;&#26174;&#33879;&#24615;&#24102;&#26469;&#35780;&#20272;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;&#24120;&#29992;&#30340;&#32622;&#20449;&#24230;&#24102;&#12290;</title><link>http://arxiv.org/abs/2306.03073</link><description>&lt;p&gt;
&#23616;&#37096;&#25237;&#24433;&#30340;&#26174;&#33879;&#24615;&#24102;
&lt;/p&gt;
&lt;p&gt;
Significance Bands for Local Projections. (arXiv:2306.03073v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03073
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#34920;&#26126;&#65292;&#22312;&#23616;&#37096;&#25237;&#24433;&#20998;&#26512;&#20013;&#65292;&#24212;&#35813;&#20351;&#29992;&#26174;&#33879;&#24615;&#24102;&#26469;&#35780;&#20272;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;&#24120;&#29992;&#30340;&#32622;&#20449;&#24230;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20914;&#20987;&#21453;&#24212;&#20989;&#25968;&#25551;&#36848;&#20102;&#21050;&#28608;&#25110;&#27835;&#30103;&#21518;&#32467;&#26524;&#21464;&#37327;&#30340;&#21160;&#24577;&#28436;&#21464;&#12290;&#19968;&#20010;&#24120;&#35265;&#30340;&#20852;&#36259;&#20551;&#35774;&#26159;&#27835;&#30103;&#26159;&#21542;&#24433;&#21709;&#20102;&#32467;&#26524;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#26368;&#22909;&#20351;&#29992;&#26174;&#33879;&#24615;&#24102;&#26469;&#35780;&#20272;&#36825;&#20010;&#20551;&#35774;&#65292;&#32780;&#19981;&#26159;&#20381;&#36182;&#20110;&#36890;&#24120;&#26174;&#31034;&#30340;&#32622;&#20449;&#24230;&#24102;&#12290;&#22312;&#38646;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20351;&#29992;LM&#21407;&#21017;&#21487;&#20197;&#20351;&#29992;&#26631;&#20934;&#32479;&#35745;&#36719;&#20214;&#36731;&#26494;&#26500;&#24314;&#26174;&#33879;&#24615;&#24102;&#65292;&#24182;&#19988;&#22312;&#22270;&#24418;&#21270;&#26174;&#31034;&#20914;&#20987;&#21453;&#24212;&#26102;&#24212;&#24403;&#20316;&#20026;&#24120;&#35268;&#25253;&#21578;&#12290;
&lt;/p&gt;
&lt;p&gt;
An impulse response function describes the dynamic evolution of an outcome variable following a stimulus or treatment. A common hypothesis of interest is whether the treatment affects the outcome. We show that this hypothesis is best assessed using significance bands rather than relying on commonly displayed confidence bands. Under the null hypothesis, we show that significance bands are trivial to construct with standard statistical software using the LM principle, and should be reported as a matter of routine when displaying impulse responses graphically.
&lt;/p&gt;</description></item></channel></rss>