<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31232;&#30095;&#21464;&#20998;&#21463;&#24178;&#25200;&#22122;&#22768;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#26694;&#26550;&#65292;&#29992;&#20110;&#26356;&#22909;&#22320;&#22788;&#29702;&#24322;&#26041;&#24046;&#26041;&#24046;&#21644;&#31163;&#32676;&#22122;&#22768;&#65292;&#24212;&#29992;&#20110;&#22320;&#30913;&#25200;&#21160;&#39044;&#27979;&#65292;&#24182;&#23637;&#31034;&#20102;&#26356;&#30701;&#30340;&#39044;&#27979;&#38388;&#38548;&#21644;&#31867;&#20284;&#30340;&#35206;&#30422;&#31934;&#24230;&#12290;</title><link>https://arxiv.org/abs/2402.17570</link><description>&lt;p&gt;
&#31232;&#30095;&#21464;&#20998;&#21463;&#24178;&#25200;&#22122;&#22768;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#29992;&#20110;&#22320;&#30913;&#25200;&#21160;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Sparse Variational Contaminated Noise Gaussian Process Regression for Forecasting Geomagnetic Perturbations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17570
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31232;&#30095;&#21464;&#20998;&#21463;&#24178;&#25200;&#22122;&#22768;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#26694;&#26550;&#65292;&#29992;&#20110;&#26356;&#22909;&#22320;&#22788;&#29702;&#24322;&#26041;&#24046;&#26041;&#24046;&#21644;&#31163;&#32676;&#22122;&#22768;&#65292;&#24212;&#29992;&#20110;&#22320;&#30913;&#25200;&#21160;&#39044;&#27979;&#65292;&#24182;&#23637;&#31034;&#20102;&#26356;&#30701;&#30340;&#39044;&#27979;&#38388;&#38548;&#21644;&#31867;&#20284;&#30340;&#35206;&#30422;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#26031;&#36807;&#31243;&#65288;GP&#65289;&#24050;&#25104;&#20026;&#22788;&#29702;&#22797;&#26434;&#21327;&#26041;&#24046;&#32467;&#26500;&#25968;&#25454;&#38598;&#30340;&#22522;&#20110;&#26680;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;GP&#26694;&#26550;&#25193;&#23637;&#65292;&#20351;&#29992;&#21463;&#24178;&#25200;&#30340;&#27491;&#24577;&#20284;&#28982;&#20989;&#25968;&#26356;&#22909;&#22320;&#32771;&#34385;&#24322;&#26041;&#24046;&#26041;&#24046;&#21644;&#31163;&#32676;&#22122;&#22768;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#31232;&#30095;&#21464;&#20998;&#39640;&#26031;&#36807;&#31243;&#65288;SVGP&#65289;&#26041;&#27861;&#30340;&#21487;&#25193;&#23637;&#25512;&#26029;&#31639;&#27861;&#65292;&#29992;&#20110;&#25311;&#21512;&#20855;&#26377;&#21463;&#24178;&#25200;&#27491;&#24577;&#22122;&#22768;&#30340;&#31232;&#30095;&#39640;&#26031;&#36807;&#31243;&#22238;&#24402;&#27169;&#22411;&#30340;&#22823;&#22411;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#32771;&#23519;&#20102;&#22320;&#30913;&#22320;&#38754;&#25200;&#21160;&#30340;&#24212;&#29992;&#65292;&#20854;&#20013;&#26368;&#20808;&#36827;&#30340;&#39044;&#27979;&#27169;&#22411;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19982;&#20154;&#24037;&#23494;&#38598;&#30340;&#31070;&#32463;&#32593;&#32476;&#22522;&#32447;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20135;&#29983;&#20102;&#26356;&#30701;&#30340;&#39044;&#27979;&#38388;&#38548;&#65292;&#20294;&#20855;&#26377;&#30456;&#20284;&#30340;&#35206;&#30422;&#33539;&#22260;&#21644;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17570v1 Announce Type: new  Abstract: Gaussian Processes (GP) have become popular machine learning methods for kernel based learning on datasets with complicated covariance structures. In this paper, we present a novel extension to the GP framework using a contaminated normal likelihood function to better account for heteroscedastic variance and outlier noise. We propose a scalable inference algorithm based on the Sparse Variational Gaussian Process (SVGP) method for fitting sparse Gaussian process regression models with contaminated normal noise on large datasets. We examine an application to geomagnetic ground perturbations, where the state-of-art prediction model is based on neural networks. We show that our approach yields shorter predictions intervals for similar coverage and accuracy when compared to an artificial dense neural network baseline.
&lt;/p&gt;</description></item></channel></rss>