<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>SportsNGEN&#26159;&#19968;&#31181;&#22522;&#20110;Transformer&#35299;&#30721;&#22120;&#30340;&#27169;&#22411;&#65292;&#32463;&#36807;&#35757;&#32451;&#33021;&#25345;&#32493;&#29983;&#25104;&#36924;&#30495;&#30340;&#22810;&#20154;&#20307;&#32946;&#28216;&#25103;&#65292;&#21253;&#25324;&#27169;&#25311;&#25972;&#20010;&#32593;&#29699;&#27604;&#36187;&#21644;&#20026;&#25945;&#32451;&#21644;&#24191;&#25773;&#21592;&#25552;&#20379;&#27934;&#23519;&#21147;&#30340;&#33021;&#21147;&#12290;</title><link>https://arxiv.org/abs/2403.12977</link><description>&lt;p&gt;
SportsNGEN: &#25345;&#32493;&#29983;&#25104;&#22810;&#20154;&#20307;&#32946;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
SportsNGEN: Sustained Generation of Multi-player Sports Gameplay
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12977
&lt;/p&gt;
&lt;p&gt;
SportsNGEN&#26159;&#19968;&#31181;&#22522;&#20110;Transformer&#35299;&#30721;&#22120;&#30340;&#27169;&#22411;&#65292;&#32463;&#36807;&#35757;&#32451;&#33021;&#25345;&#32493;&#29983;&#25104;&#36924;&#30495;&#30340;&#22810;&#20154;&#20307;&#32946;&#28216;&#25103;&#65292;&#21253;&#25324;&#27169;&#25311;&#25972;&#20010;&#32593;&#29699;&#27604;&#36187;&#21644;&#20026;&#25945;&#32451;&#21644;&#24191;&#25773;&#21592;&#25552;&#20379;&#27934;&#23519;&#21147;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Transformer&#35299;&#30721;&#22120;&#30340;&#27169;&#22411;SportsNGEN&#65292;&#35813;&#27169;&#22411;&#32463;&#36807;&#35757;&#32451;&#20351;&#29992;&#36816;&#21160;&#21592;&#21644;&#29699;&#36861;&#36394;&#24207;&#21015;&#65292;&#33021;&#22815;&#29983;&#25104;&#36924;&#30495;&#19988;&#25345;&#32493;&#30340;&#28216;&#25103;&#22330;&#26223;&#12290;&#25105;&#20204;&#22312;&#22823;&#37327;&#19987;&#19994;&#32593;&#29699;&#36861;&#36394;&#25968;&#25454;&#19978;&#35757;&#32451;&#21644;&#35780;&#20272;SportsNGEN&#65292;&#24182;&#23637;&#31034;&#36890;&#36807;&#23558;&#29983;&#25104;&#30340;&#27169;&#25311;&#19982;&#23556;&#20987;&#20998;&#31867;&#22120;&#21644;&#36923;&#36753;&#30456;&#32467;&#21512;&#26469;&#24320;&#22987;&#21644;&#32467;&#26463;&#29699;&#36187;&#65292;&#31995;&#32479;&#33021;&#22815;&#27169;&#25311;&#25972;&#20010;&#32593;&#29699;&#27604;&#36187;&#12290;&#27492;&#22806;&#65292;SportsNGEN&#30340;&#36890;&#29992;&#29256;&#26412;&#21487;&#20197;&#36890;&#36807;&#22312;&#21253;&#21547;&#35813;&#29699;&#21592;&#30340;&#27604;&#36187;&#25968;&#25454;&#19978;&#24494;&#35843;&#26469;&#23450;&#21046;&#29305;&#23450;&#29699;&#21592;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#32463;&#36807;&#33391;&#22909;&#26657;&#20934;&#65292;&#21487;&#20197;&#36890;&#36807;&#35780;&#20272;&#21453;&#20107;&#23454;&#25110;&#20551;&#35774;&#36873;&#39033;&#20026;&#25945;&#32451;&#21644;&#24191;&#25773;&#21592;&#25552;&#20379;&#27934;&#23519;&#21147;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36136;&#37327;&#32467;&#26524;&#34920;&#26126;&#30456;&#21516;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#36275;&#29699;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12977v1 Announce Type: cross  Abstract: We present a transformer decoder based model, SportsNGEN, that is trained on sports player and ball tracking sequences that is capable of generating realistic and sustained gameplay. We train and evaluate SportsNGEN on a large database of professional tennis tracking data and demonstrate that by combining the generated simulations with a shot classifier and logic to start and end rallies, the system is capable of simulating an entire tennis match. In addition, a generic version of SportsNGEN can be customized to a specific player by fine-tuning on match data that includes that player. We show that our model is well calibrated and can be used to derive insights for coaches and broadcasters by evaluating counterfactual or what if options. Finally, we show qualitative results indicating the same approach works for football.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#23558;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#27861;&#65288;QRA&#65289;&#26041;&#27861;&#21644;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#24179;&#22343;&#26041;&#26696;&#30456;&#32467;&#21512;&#12290;&#22312;&#24503;&#22269;EPEX SPOT&#21644;&#27874;&#20848;&#30005;&#21147;&#20132;&#26131;&#25152;&#65288;TGE&#65289;&#20004;&#20010;&#27431;&#27954;&#33021;&#28304;&#24066;&#22330;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#35777;&#26126;&#35813;&#26041;&#27861;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#33021;&#24102;&#26469;&#39640;&#36798;10&#27431;&#20803;&#30340;&#21033;&#28070;&#12290;</title><link>http://arxiv.org/abs/2303.08565</link><description>&lt;p&gt;
&#22522;&#20110;&#22240;&#23376;&#20998;&#20301;&#25968;&#22238;&#24402;&#30340;&#27010;&#29575;&#39044;&#27979;&#65306;&#24212;&#29992;&#20110;&#30005;&#21147;&#20132;&#26131;
&lt;/p&gt;
&lt;p&gt;
Probabilistic forecasting with Factor Quantile Regression: Application to electricity trading. (arXiv:2303.08565v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08565
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#23558;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#27861;&#65288;QRA&#65289;&#26041;&#27861;&#21644;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#24179;&#22343;&#26041;&#26696;&#30456;&#32467;&#21512;&#12290;&#22312;&#24503;&#22269;EPEX SPOT&#21644;&#27874;&#20848;&#30005;&#21147;&#20132;&#26131;&#25152;&#65288;TGE&#65289;&#20004;&#20010;&#27431;&#27954;&#33021;&#28304;&#24066;&#22330;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#35777;&#26126;&#35813;&#26041;&#27861;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#33021;&#24102;&#26469;&#39640;&#36798;10&#27431;&#20803;&#30340;&#21033;&#28070;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#23558;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#27861;&#65288;QRA&#65289;&#26041;&#27861;&#21644;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#24179;&#22343;&#26041;&#26696;&#30456;&#32467;&#21512;&#12290;&#35813;&#26041;&#27861;&#22312;&#24503;&#22269;EPEX SPOT&#21644;&#27874;&#20848;&#30005;&#21147;&#20132;&#26131;&#25152;&#65288;TGE&#65289;&#20004;&#20010;&#27431;&#27954;&#33021;&#28304;&#24066;&#22330;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#27604;&#25991;&#29486;&#22522;&#20934;&#26356;&#20934;&#30830;&#12290;&#27492;&#22806;&#65292;&#23454;&#35777;&#35777;&#25454;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#22312;&#32463;&#39564;&#35206;&#30422;&#33539;&#22260;&#21644;Christoffersen&#27979;&#35797;&#26041;&#38754;&#20248;&#20110;&#20854;&#31454;&#20105;&#23545;&#25163;&#12290;&#27492;&#22806;&#65292;&#26681;&#25454;&#36130;&#21153;&#25351;&#26631;&#35780;&#20272;&#20102;&#27010;&#29575;&#39044;&#27979;&#30340;&#32463;&#27982;&#20215;&#20540;&#12290;&#25105;&#20204;&#27979;&#35797;&#20102;&#32771;&#34385;&#26085;&#21069;&#24066;&#22330;&#20132;&#26131;&#31574;&#30053;&#30340;&#39044;&#27979;&#27169;&#22411;&#30340;&#32489;&#25928;&#65292;&#35813;&#31574;&#30053;&#21033;&#29992;&#27010;&#29575;&#20215;&#26684;&#39044;&#27979;&#21644;&#20648;&#33021;&#31995;&#32479;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#27599;1 MWh&#20132;&#26131;&#30340;&#21033;&#28070;&#39640;&#36798;10&#27431;&#20803;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a novel approach for constructing probabilistic forecasts, which combines both the Quantile Regression Averaging (QRA) method and the Principal Component Analysis (PCA) averaging scheme. The performance of the approach is evaluated on datasets from two European energy markets - the German EPEX SPOT and the Polish Power Exchange (TGE). The results indicate that newly proposed solutions yield results, which are more accurate than the literature benchmarks. Additionally, empirical evidence indicates that the proposed method outperforms its competitors in terms of the empirical coverage and the Christoffersen test. In addition, the economic value of the probabilistic forecast is evaluated on the basis of financial metrics. We test the performance of forecasting models taking into account a day-ahead market trading strategy that utilizes probabilistic price predictions and an energy storage system. The results indicate that profits of up to 10 EUR per 1 MWh transaction c
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#24179;&#28369;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#65288;SQR Averaging&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;&#22797;&#26434;&#30005;&#21147;&#24066;&#22330;&#30340;&#30005;&#21147;&#20215;&#26684;&#65292;&#36890;&#36807;&#35780;&#20272;&#21487;&#38752;&#24615;&#21644;&#38160;&#24230;&#25351;&#26631;&#34920;&#26126;&#20854;&#24615;&#33021;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#20934;&#26041;&#27861;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#35780;&#20272;&#26041;&#26696;&#26469;&#37327;&#21270;&#39044;&#27979;&#25152;&#24102;&#26469;&#30340;&#32463;&#27982;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2302.00411</link><description>&lt;p&gt;
&#20351;&#29992;&#24179;&#28369;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#30340;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#65306;&#37327;&#21270;&#27010;&#29575;&#39044;&#27979;&#30340;&#32463;&#27982;&#25928;&#30410;
&lt;/p&gt;
&lt;p&gt;
Electricity price forecasting with Smoothing Quantile Regression Averaging: Quantifying economic benefits of probabilistic forecasts. (arXiv:2302.00411v2 [stat.AP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.00411
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#24179;&#28369;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#65288;SQR Averaging&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;&#22797;&#26434;&#30005;&#21147;&#24066;&#22330;&#30340;&#30005;&#21147;&#20215;&#26684;&#65292;&#36890;&#36807;&#35780;&#20272;&#21487;&#38752;&#24615;&#21644;&#38160;&#24230;&#25351;&#26631;&#34920;&#26126;&#20854;&#24615;&#33021;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#20934;&#26041;&#27861;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#35780;&#20272;&#26041;&#26696;&#26469;&#37327;&#21270;&#39044;&#27979;&#25152;&#24102;&#26469;&#30340;&#32463;&#27982;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22797;&#26434;&#30340;&#30005;&#21147;&#24066;&#22330;&#20013;&#65292;&#20934;&#30830;&#30340;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#23545;&#25112;&#30053;&#25237;&#26631;&#33267;&#20851;&#37325;&#35201;&#65292;&#24433;&#21709;&#30528;&#26085;&#24120;&#36816;&#33829;&#21644;&#38271;&#26399;&#25237;&#36164;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#24179;&#28369;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#65288;SQR Averaging&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#23427;&#25913;&#36827;&#20102;&#27010;&#29575;&#39044;&#27979;&#30340;&#39640;&#24615;&#33021;&#26041;&#26696;&#12290;&#20026;&#20102;&#23637;&#31034;&#20854;&#25928;&#29992;&#65292;&#25105;&#20204;&#22312;&#21253;&#25324;COVID-19&#30123;&#24773;&#21644;&#20420;&#32599;&#26031;&#23545;&#20044;&#20811;&#20848;&#30340;&#20837;&#20405;&#30340;&#26368;&#26032;&#25968;&#25454;&#22522;&#30784;&#19978;&#65292;&#23545;&#22235;&#20010;&#30005;&#21147;&#24066;&#22330;&#36827;&#34892;&#20102;&#20840;&#38754;&#30740;&#31350;&#12290;&#36890;&#36807;&#21487;&#38752;&#24615;&#21644;&#38160;&#24230;&#25351;&#26631;&#65292;&#35780;&#20272;&#20102;SQR Averaging&#30340;&#24615;&#33021;&#65292;&#24182;&#23558;&#20854;&#19982;&#26368;&#20808;&#36827;&#30340;&#22522;&#20934;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#27492;&#22806;&#65292;&#36824;&#24341;&#20837;&#20102;&#19968;&#31181;&#35780;&#20272;&#26041;&#26696;&#65292;&#29992;&#20110;&#37327;&#21270;SQR Averaging&#39044;&#27979;&#25152;&#24102;&#26469;&#30340;&#32463;&#27982;&#25928;&#30410;&#12290;&#35813;&#26041;&#26696;&#21487;&#20197;&#24212;&#29992;&#20110;&#20219;&#20309;&#26085;&#21069;&#30005;&#21147;&#24066;&#22330;&#65292;&#24182;&#22522;&#20110;&#19968;&#31181;&#21033;&#29992;&#30005;&#27744;&#20648;&#23384;&#30340;&#20132;&#26131;&#31574;&#30053;&#65292;&#36890;&#36807;&#20351;&#29992;&#36873;&#23450;&#30340;&#39044;&#27979;&#20998;&#24067;&#20998;&#20301;&#25968;&#35774;&#23450;&#38480;&#20215;&#35746;&#21333;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the world of the complex power market, accurate electricity price forecasting is essential for strategic bidding and affects both daily operations and long-term investments. This article introduce a new method dubbed Smoothing Quantile Regression (SQR) Averaging, that improves on well-performing schemes for probabilistic forecasting. To showcase its utility, a comprehensive study is conducted across four power markets, including recent data encompassing the COVID-19 pandemic and the Russian invasion on Ukraine. The performance of SQR Averaging is evaluated and compared to state-of-the-art benchmark methods in terms of the reliability and sharpness measures. Additionally, an evaluation scheme is introduced to quantify the economic benefits derived from SQR Averaging predictions. This scheme can be applied in any day-ahead electricity market and is based on a trading strategy that leverages battery storage and sets limit orders using selected quantiles of the predictive distribution. 
&lt;/p&gt;</description></item></channel></rss>