<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#20445;&#30041;&#36793;&#30340;&#31526;&#21495;&#22312;&#32593;&#32476;&#26500;&#24314;&#36807;&#31243;&#20013;&#25552;&#39640;&#20102;&#20272;&#35745;&#21644;&#32858;&#31867;&#31934;&#24230;&#65292;&#26377;&#21161;&#20110;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.10242</link><description>&lt;p&gt;
&#26377;&#31526;&#21495;&#22810;&#26679;&#21270;&#22810;&#37325;&#32593;&#32476;&#65306;&#32858;&#31867;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Signed Diverse Multiplex Networks: Clustering and Inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10242
&lt;/p&gt;
&lt;p&gt;
&#20445;&#30041;&#36793;&#30340;&#31526;&#21495;&#22312;&#32593;&#32476;&#26500;&#24314;&#36807;&#31243;&#20013;&#25552;&#39640;&#20102;&#20272;&#35745;&#21644;&#32858;&#31867;&#31934;&#24230;&#65292;&#26377;&#21161;&#20110;&#35299;&#20915;&#29616;&#23454;&#19990;&#30028;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26377;&#31526;&#21495;&#30340;&#24191;&#20041;&#38543;&#26426;&#28857;&#31215;&#22270;&#65288;SGRDPG&#65289;&#27169;&#22411;&#65292;&#36825;&#26159;&#24191;&#20041;&#38543;&#26426;&#28857;&#31215;&#22270;&#65288;GRDPG&#65289;&#30340;&#19968;&#20010;&#21464;&#31181;&#65292;&#20854;&#20013;&#36793;&#21487;&#20197;&#26159;&#27491;&#30340;&#20063;&#21487;&#20197;&#26159;&#36127;&#30340;&#12290;&#35813;&#35774;&#32622;&#34987;&#25193;&#23637;&#20026;&#22810;&#37325;&#32593;&#32476;&#29256;&#26412;&#65292;&#20854;&#20013;&#25152;&#26377;&#23618;&#20855;&#26377;&#30456;&#21516;&#30340;&#33410;&#28857;&#38598;&#21512;&#24182;&#36981;&#24490;SGRDPG&#12290;&#32593;&#32476;&#23618;&#30340;&#21807;&#19968;&#20844;&#20849;&#29305;&#24449;&#26159;&#23427;&#20204;&#21487;&#20197;&#34987;&#21010;&#20998;&#20026;&#20855;&#26377;&#20849;&#21516;&#23376;&#31354;&#38388;&#32467;&#26500;&#30340;&#32452;&#65292;&#32780;&#20854;&#20182;&#24773;&#20917;&#19979;&#25152;&#26377;&#36830;&#25509;&#27010;&#29575;&#30697;&#38453;&#21487;&#33021;&#26159;&#23436;&#20840;&#19981;&#21516;&#30340;&#12290;&#19978;&#36848;&#35774;&#32622;&#38750;&#24120;&#28789;&#27963;&#65292;&#24182;&#21253;&#25324;&#21508;&#31181;&#29616;&#26377;&#22810;&#37325;&#32593;&#32476;&#27169;&#22411;&#20316;&#20026;&#20854;&#29305;&#20363;&#12290;&#35770;&#25991;&#23454;&#29616;&#20102;&#20004;&#20010;&#30446;&#26631;&#12290;&#39318;&#20808;&#65292;&#23427;&#34920;&#26126;&#22312;&#32593;&#32476;&#26500;&#24314;&#36807;&#31243;&#20013;&#20445;&#30041;&#36793;&#30340;&#31526;&#21495;&#20250;&#23548;&#33268;&#26356;&#22909;&#30340;&#20272;&#35745;&#21644;&#32858;&#31867;&#31934;&#24230;&#65292;&#22240;&#27492;&#26377;&#21161;&#20110;&#24212;&#23545;&#35832;&#22914;&#22823;&#33041;&#32593;&#32476;&#20998;&#26512;&#20043;&#31867;&#30340;&#29616;&#23454;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10242v1 Announce Type: cross  Abstract: The paper introduces a Signed Generalized Random Dot Product Graph (SGRDPG) model, which is a variant of the Generalized Random Dot Product Graph (GRDPG), where, in addition, edges can be positive or negative. The setting is extended to a multiplex version, where all layers have the same collection of nodes and follow the SGRDPG. The only common feature of the layers of the network is that they can be partitioned into groups with common subspace structures, while otherwise all matrices of connection probabilities can be all different. The setting above is extremely flexible and includes a variety of existing multiplex network models as its particular cases. The paper fulfills two objectives. First, it shows that keeping signs of the edges in the process of network construction leads to a better precision of estimation and clustering and, hence, is beneficial for tackling real world problems such as analysis of brain networks. Second, b
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#25968;&#25454;&#39044;&#27979;&#20219;&#20309;&#20154;&#32676;&#25110;&#23376;&#20154;&#32676;&#30340;&#29305;&#24449;&#65292;&#24182;&#20998;&#26512;&#20102;&#22312;&#23454;&#38469;&#29983;&#27963;&#20013;&#26356;&#37325;&#35201;&#30340;&#32972;&#26223;&#19979;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.07521</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#19982;&#23567;&#21306;&#22495;&#20272;&#35745;&#30340;&#25972;&#21512;&#27493;&#39588;
&lt;/p&gt;
&lt;p&gt;
A step towards the integration of machine learning and small area estimation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07521
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#25968;&#25454;&#39044;&#27979;&#20219;&#20309;&#20154;&#32676;&#25110;&#23376;&#20154;&#32676;&#30340;&#29305;&#24449;&#65292;&#24182;&#20998;&#26512;&#20102;&#22312;&#23454;&#38469;&#29983;&#27963;&#20013;&#26356;&#37325;&#35201;&#30340;&#32972;&#26223;&#19979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30340;&#24212;&#29992;&#24050;&#32463;&#22312;&#35768;&#22810;&#30740;&#31350;&#39046;&#22495;&#24471;&#21040;&#20102;&#21457;&#23637;&#12290;&#30446;&#21069;&#65292;&#22312;&#32479;&#35745;&#23398;&#20013;&#65292;&#21253;&#25324;&#27491;&#24335;&#32479;&#35745;&#23398;&#22312;&#20869;&#65292;&#20063;&#24191;&#27867;&#24212;&#29992;&#20110;&#25968;&#25454;&#25910;&#38598;&#65288;&#22914;&#21355;&#26143;&#22270;&#20687;&#12289;&#32593;&#32476;&#29228;&#21462;&#21644;&#25991;&#26412;&#25366;&#25496;&#12289;&#25968;&#25454;&#28165;&#27927;&#12289;&#38598;&#25104;&#21644;&#25554;&#34917;&#65289;&#20197;&#21450;&#25968;&#25454;&#20998;&#26512;&#12290;&#28982;&#32780;&#65292;&#22312;&#35843;&#26597;&#25277;&#26679;&#21253;&#25324;&#23567;&#21306;&#22495;&#20272;&#35745;&#26041;&#38754;&#65292;&#36825;&#20123;&#26041;&#27861;&#30340;&#20351;&#29992;&#20173;&#28982;&#38750;&#24120;&#26377;&#38480;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#19968;&#20010;&#30001;&#36825;&#20123;&#31639;&#27861;&#25903;&#25345;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#25968;&#25454;&#39044;&#27979;&#20219;&#20309;&#20154;&#32676;&#25110;&#23376;&#20154;&#32676;&#30340;&#29305;&#24449;&#12290;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#24050;&#32463;&#26174;&#31034;&#20986;&#22312;&#35782;&#21035;&#21644;&#24314;&#27169;&#21464;&#37327;&#20043;&#38388;&#22797;&#26434;&#21644;&#38750;&#32447;&#24615;&#20851;&#31995;&#26041;&#38754;&#38750;&#24120;&#24378;&#22823;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;&#24378;&#28872;&#20559;&#31163;&#32463;&#20856;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#20855;&#26377;&#38750;&#24120;&#22909;&#30340;&#24615;&#33021;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#19968;&#31181;&#19981;&#21516;&#30340;&#32972;&#26223;&#19979;&#30340;&#34920;&#29616;&#65292;&#36825;&#20010;&#32972;&#26223;&#22312;&#25105;&#20204;&#30475;&#26469;&#22312;&#23454;&#38469;&#29983;&#27963;&#20013;&#26356;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
The use of machine-learning techniques has grown in numerous research areas. Currently, it is also widely used in statistics, including the official statistics for data collection (e.g. satellite imagery, web scraping and text mining, data cleaning, integration and imputation) but also for data analysis. However, the usage of these methods in survey sampling including small area estimation is still very limited. Therefore, we propose a predictor supported by these algorithms which can be used to predict any population or subpopulation characteristics based on cross-sectional and longitudinal data. Machine learning methods have already been shown to be very powerful in identifying and modelling complex and nonlinear relationships between the variables, which means that they have very good properties in case of strong departures from the classic assumptions. Therefore, we analyse the performance of our proposal under a different set-up, in our opinion of greater importance in real-life s
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#25454;&#21327;&#20316;&#21452;&#26426;&#22120;&#23398;&#20064;&#65288;DC-DML&#65289;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#20445;&#25252;&#20998;&#24067;&#24335;&#25968;&#25454;&#38544;&#31169;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;CATE&#65289;&#27169;&#22411;&#12290;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#35813;&#26041;&#27861;&#30340;&#19977;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#65306;&#23454;&#29616;&#20102;&#23545;&#20998;&#24067;&#24335;&#25968;&#25454;&#19978;&#30340;&#38750;&#36845;&#20195;&#36890;&#20449;&#30340;&#21322;&#21442;&#25968;CATE&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#27979;&#35797;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.02672</link><description>&lt;p&gt;
&#23545;&#20998;&#24067;&#24335;&#25968;&#25454;&#30340;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#65306;&#19968;&#31181;&#20445;&#25252;&#38544;&#31169;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Estimation of conditional average treatment effects on distributed data: A privacy-preserving approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02672
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#25454;&#21327;&#20316;&#21452;&#26426;&#22120;&#23398;&#20064;&#65288;DC-DML&#65289;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#20445;&#25252;&#20998;&#24067;&#24335;&#25968;&#25454;&#38544;&#31169;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;CATE&#65289;&#27169;&#22411;&#12290;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#35813;&#26041;&#27861;&#30340;&#19977;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#65306;&#23454;&#29616;&#20102;&#23545;&#20998;&#24067;&#24335;&#25968;&#25454;&#19978;&#30340;&#38750;&#36845;&#20195;&#36890;&#20449;&#30340;&#21322;&#21442;&#25968;CATE&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#27979;&#35797;&#65292;&#25552;&#39640;&#20102;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21307;&#23398;&#21644;&#31038;&#20250;&#31185;&#23398;&#31561;&#21508;&#20010;&#39046;&#22495;&#20013;&#65292;&#23545;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;CATEs&#65289;&#30340;&#20272;&#35745;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#35838;&#39064;&#12290;&#22914;&#26524;&#20998;&#24067;&#22312;&#22810;&#20010;&#21442;&#19982;&#26041;&#20043;&#38388;&#30340;&#25968;&#25454;&#21487;&#20197;&#38598;&#20013;&#65292;&#21487;&#20197;&#23545;CATEs&#36827;&#34892;&#39640;&#31934;&#24230;&#30340;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#36825;&#20123;&#25968;&#25454;&#21253;&#21547;&#38544;&#31169;&#20449;&#24687;&#65292;&#21017;&#24456;&#38590;&#36827;&#34892;&#25968;&#25454;&#32858;&#21512;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25968;&#25454;&#21327;&#20316;&#21452;&#26426;&#22120;&#23398;&#20064;&#65288;DC-DML&#65289;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#20445;&#25252;&#20998;&#24067;&#24335;&#25968;&#25454;&#38544;&#31169;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;CATE&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#23545;&#35813;&#26041;&#27861;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#24635;&#32467;&#22914;&#19979;&#19977;&#28857;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#33021;&#22815;&#22312;&#20998;&#24067;&#24335;&#25968;&#25454;&#19978;&#36827;&#34892;&#38750;&#36845;&#20195;&#36890;&#20449;&#30340;&#21322;&#21442;&#25968;CATE&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#27979;&#35797;&#12290;&#21322;&#21442;&#25968;&#25110;&#38750;&#21442;&#25968;&#30340;CATE&#27169;&#22411;&#33021;&#22815;&#27604;&#21442;&#25968;&#27169;&#22411;&#26356;&#31283;&#20581;&#22320;&#36827;&#34892;&#20272;&#35745;&#21644;&#27979;&#35797;&#65292;&#23545;&#20110;&#27169;&#22411;&#20559;&#24046;&#30340;&#40065;&#26834;&#24615;&#26356;&#24378;&#12290;&#28982;&#32780;&#65292;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#30446;&#21069;&#36824;&#27809;&#26377;&#25552;&#20986;&#26377;&#25928;&#30340;&#36890;&#20449;&#26041;&#27861;&#26469;&#20272;&#35745;&#21644;&#27979;&#35797;&#36825;&#20123;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimation of conditional average treatment effects (CATEs) is an important topic in various fields such as medical and social sciences. CATEs can be estimated with high accuracy if distributed data across multiple parties can be centralized. However, it is difficult to aggregate such data if they contain privacy information. To address this issue, we proposed data collaboration double machine learning (DC-DML), a method that can estimate CATE models with privacy preservation of distributed data, and evaluated the method through numerical experiments. Our contributions are summarized in the following three points. First, our method enables estimation and testing of semi-parametric CATE models without iterative communication on distributed data. Semi-parametric or non-parametric CATE models enable estimation and testing that is more robust to model mis-specification than parametric models. However, to our knowledge, no communication-efficient method has been proposed for estimating and 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#23398;&#26657;&#20998;&#37197;&#20013;&#30340;&#38750;&#21442;&#25968;&#21270;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#21644;&#20272;&#35745;&#26041;&#27861;&#65292;&#36890;&#36807;&#35782;&#21035;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#65292;&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#21644;&#25277;&#31614;&#39537;&#21160;&#30340;&#21464;&#24322;&#19979;&#30340;&#23398;&#26657;&#36873;&#25321;&#30340;&#24322;&#36136;&#24615;&#21644;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2112.03872</link><description>&lt;p&gt;
&#23398;&#26657;&#36873;&#25321;&#20013;&#30340;&#38750;&#21442;&#25968;&#21270;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Treatment Effect Identification in School Choice. (arXiv:2112.03872v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.03872
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#38598;&#20013;&#23398;&#26657;&#20998;&#37197;&#20013;&#30340;&#38750;&#21442;&#25968;&#21270;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#21644;&#20272;&#35745;&#26041;&#27861;&#65292;&#36890;&#36807;&#35782;&#21035;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#65292;&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#21644;&#25277;&#31614;&#39537;&#21160;&#30340;&#21464;&#24322;&#19979;&#30340;&#23398;&#26657;&#36873;&#25321;&#30340;&#24322;&#36136;&#24615;&#21644;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#38598;&#20013;&#23398;&#26657;&#20998;&#37197;&#20013;&#22240;&#26524;&#25928;&#24212;&#30340;&#38750;&#21442;&#25968;&#21270;&#35782;&#21035;&#21644;&#20272;&#35745;&#12290;&#22312;&#35768;&#22810;&#38598;&#20013;&#20998;&#37197;&#35774;&#32622;&#20013;&#65292;&#23398;&#29983;&#26082;&#21463;&#21040;&#25277;&#31614;&#39537;&#21160;&#30340;&#21464;&#24322;&#65292;&#20063;&#21463;&#21040;&#22238;&#24402;&#19981;&#36830;&#32493;&#65288;RD&#65289;&#39537;&#21160;&#30340;&#21464;&#24322;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#34987;&#35782;&#21035;&#30340;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#65288;aTEs&#65289;&#30340;&#23436;&#25972;&#38598;&#21512;&#65292;&#23450;&#20041;&#20026;&#22312;&#32473;&#23450;&#23398;&#29983;&#29305;&#24449;&#26102;&#65292;&#19968;&#23545;&#23398;&#26657;&#20043;&#38388;&#30340;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#12290;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#26159;&#27835;&#30103;&#23545;&#27604;&#30340;&#22522;&#30784;&#65292;&#24120;&#35265;&#30340;&#20272;&#35745;&#26041;&#27861;&#20250;&#25513;&#30422;&#37325;&#35201;&#30340;&#24322;&#36136;&#24615;&#12290;&#29305;&#21035;&#22320;&#65292;&#35768;&#22810;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#30340;&#32858;&#21512;&#23558;&#22312;RD&#21464;&#24322;&#39537;&#21160;&#19979;&#32622;&#38646;&#26435;&#37325;&#65292;&#24182;&#19988;&#36825;&#31181;&#32858;&#21512;&#30340;&#20272;&#35745;&#22120;&#22312;&#28176;&#36827;&#19979;&#23558;&#23545;RD&#39537;&#21160;&#30340;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#25918;&#32622;&#36880;&#28176;&#28040;&#22833;&#30340;&#26435;&#37325;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#29992;&#20110;&#32463;&#39564;&#35780;&#20272;RD&#21464;&#24322;&#39537;&#21160;&#19979;&#30340;&#21407;&#23376;&#27835;&#30103;&#25928;&#24212;&#26435;&#37325;&#30340;&#35786;&#26029;&#24037;&#20855;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20272;&#35745;&#22120;&#21644;&#30456;&#24212;&#30340;&#28176;&#36827;&#32467;&#26524;&#20197;&#36827;&#34892;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies nonparametric identification and estimation of causal effects in centralized school assignment. In many centralized assignment settings, students are subjected to both lottery-driven variation and regression discontinuity (RD) driven variation. We characterize the full set of identified atomic treatment effects (aTEs), defined as the conditional average treatment effect between a pair of schools, given student characteristics. Atomic treatment effects are the building blocks of more aggregated notions of treatment contrasts, and common approaches estimating aggregations of aTEs can mask important heterogeneity. In particular, many aggregations of aTEs put zero weight on aTEs driven by RD variation, and estimators of such aggregations put asymptotically vanishing weight on the RD-driven aTEs. We develop a diagnostic tool for empirically assessing the weight put on aTEs driven by RD variation. Lastly, we provide estimators and accompanying asymptotic results for infere
&lt;/p&gt;</description></item></channel></rss>