<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>TRIALSCOPE&#26159;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#29983;&#29289;&#21307;&#23398;&#35821;&#35328;&#27169;&#22411;&#23558;&#20020;&#24202;&#25991;&#26412;&#36827;&#34892;&#32467;&#26500;&#21270;&#65292;&#37319;&#29992;&#27010;&#29575;&#24314;&#27169;&#36827;&#34892;&#21435;&#22122;&#21644;&#25554;&#34917;&#65292;&#24182;&#24212;&#29992;&#22240;&#26524;&#25512;&#26029;&#25216;&#26415;&#26469;&#24212;&#23545;&#28151;&#26434;&#22240;&#32032;&#65292;&#20197;&#20174;&#23454;&#38469;&#19990;&#30028;&#25968;&#25454;&#20013;&#25552;&#21462;&#23454;&#35777;&#35777;&#25454;&#21644;&#25512;&#29702;&#20020;&#24202;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2311.01301</link><description>&lt;p&gt;
TRIALSCOPE&#65306;&#19968;&#20010;&#32479;&#19968;&#30340;&#22240;&#26524;&#26694;&#26550;&#65292;&#29992;&#20110;&#21033;&#29992;&#29983;&#29289;&#21307;&#23398;&#35821;&#35328;&#27169;&#22411;&#25193;&#23637;&#23454;&#38469;&#19990;&#30028;&#35777;&#25454;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
TRIALSCOPE A Unifying Causal Framework for Scaling Real-World Evidence Generation with Biomedical Language Models. (arXiv:2311.01301v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01301
&lt;/p&gt;
&lt;p&gt;
TRIALSCOPE&#26159;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#21033;&#29992;&#29983;&#29289;&#21307;&#23398;&#35821;&#35328;&#27169;&#22411;&#23558;&#20020;&#24202;&#25991;&#26412;&#36827;&#34892;&#32467;&#26500;&#21270;&#65292;&#37319;&#29992;&#27010;&#29575;&#24314;&#27169;&#36827;&#34892;&#21435;&#22122;&#21644;&#25554;&#34917;&#65292;&#24182;&#24212;&#29992;&#22240;&#26524;&#25512;&#26029;&#25216;&#26415;&#26469;&#24212;&#23545;&#28151;&#26434;&#22240;&#32032;&#65292;&#20197;&#20174;&#23454;&#38469;&#19990;&#30028;&#25968;&#25454;&#20013;&#25552;&#21462;&#23454;&#35777;&#35777;&#25454;&#21644;&#25512;&#29702;&#20020;&#24202;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#38469;&#19990;&#30028;&#25968;&#25454;&#30340;&#24555;&#36895;&#25968;&#23383;&#21270;&#20026;&#20248;&#21270;&#21307;&#30103;&#26381;&#21153;&#21644;&#21152;&#36895;&#29983;&#29289;&#21307;&#23398;&#21457;&#29616;&#25552;&#20379;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#26426;&#20250;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#36825;&#20123;&#25968;&#25454;&#24448;&#24448;&#20197;&#38750;&#32467;&#26500;&#21270;&#24418;&#24335;&#23384;&#22312;&#65292;&#22914;&#30005;&#23376;&#21307;&#30103;&#35760;&#24405;&#20013;&#30340;&#20020;&#24202;&#31508;&#35760;&#65292;&#24182;&#19988;&#36890;&#24120;&#21463;&#21040;&#28151;&#26434;&#22240;&#32032;&#30340;&#22256;&#25200;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;TRIALSCOPE&#65292;&#19968;&#20010;&#29992;&#20110;&#20174;&#20154;&#32676;&#32423;&#35266;&#23519;&#25968;&#25454;&#20013;&#25552;&#21462;&#23454;&#38469;&#19990;&#30028;&#35777;&#25454;&#30340;&#32479;&#19968;&#26694;&#26550;&#12290;TRIALSCOPE&#21033;&#29992;&#29983;&#29289;&#21307;&#23398;&#35821;&#35328;&#27169;&#22411;&#26469;&#25193;&#23637;&#35268;&#27169;&#21270;&#30340;&#20020;&#24202;&#25991;&#26412;&#65292;&#37319;&#29992;&#20808;&#36827;&#30340;&#27010;&#29575;&#24314;&#27169;&#36827;&#34892;&#21435;&#22122;&#21644;&#25554;&#34917;&#65292;&#24182;&#32467;&#21512;&#26368;&#20808;&#36827;&#30340;&#22240;&#26524;&#25512;&#26029;&#25216;&#26415;&#26469;&#24212;&#23545;&#24120;&#35265;&#30340;&#28151;&#26434;&#22240;&#32032;&#12290;&#21033;&#29992;&#20020;&#24202;&#35797;&#39564;&#35268;&#33539;&#20316;&#20026;&#36890;&#29992;&#34920;&#31034;&#24418;&#24335;&#65292;TRIALSCOPE&#25552;&#20379;&#20102;&#19968;&#20010;&#19968;&#38190;&#24335;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#20351;&#29992;&#35266;&#23519;&#25968;&#25454;&#29983;&#25104;&#21644;&#25512;&#29702;&#20020;&#24202;&#20551;&#35774;&#12290;&#22312;&#19968;&#20010;&#21253;&#21547;&#36229;&#36807;&#19968;&#30334;&#19975;&#20010;&#30284;&#30151;&#24739;&#32773;&#30340;&#22823;&#35268;&#27169;&#23454;&#38469;&#19990;&#30028;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#39564;&#21644;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rapid digitization of real-world data offers an unprecedented opportunity for optimizing healthcare delivery and accelerating biomedical discovery. In practice, however, such data is most abundantly available in unstructured forms, such as clinical notes in electronic medical records (EMRs), and it is generally plagued by confounders. In this paper, we present TRIALSCOPE, a unifying framework for distilling real-world evidence from population-level observational data. TRIALSCOPE leverages biomedical language models to structure clinical text at scale, employs advanced probabilistic modeling for denoising and imputation, and incorporates state-of-the-art causal inference techniques to combat common confounders. Using clinical trial specification as generic representation, TRIALSCOPE provides a turn-key solution to generate and reason with clinical hypotheses using observational data. In extensive experiments and analyses on a large-scale real-world dataset with over one million canc
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#39640;&#32500;&#21333;&#25351;&#25968;&#27169;&#22411;&#20013;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#30340;&#19968;&#33268;&#24615;&#21644;&#21487;&#25193;&#23637;&#31639;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#24191;&#20041;&#20449;&#24687;&#20934;&#21017;&#26469;&#30830;&#23450;&#25903;&#25345;&#30340;&#22238;&#24402;&#31995;&#25968;&#22823;&#23567;&#65292;&#28040;&#38500;&#20102;&#27169;&#22411;&#36873;&#25321;&#30340;&#35843;&#20248;&#38656;&#27714;&#65292;&#24182;&#20855;&#26377;&#23376;&#38598;&#36873;&#25321;&#19968;&#33268;&#24615;&#21644;&#39640;&#27010;&#29575;&#19979;&#30340;&#29702;&#24819;&#23646;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.06230</link><description>&lt;p&gt;
&#21333;&#25351;&#25968;&#27169;&#22411;&#20013;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#30340;&#19968;&#33268;&#24615;&#21644;&#21487;&#25193;&#23637;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Consistent and Scalable Algorithm for Best Subset Selection in Single Index Models. (arXiv:2309.06230v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06230
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#39640;&#32500;&#21333;&#25351;&#25968;&#27169;&#22411;&#20013;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#30340;&#19968;&#33268;&#24615;&#21644;&#21487;&#25193;&#23637;&#31639;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#24191;&#20041;&#20449;&#24687;&#20934;&#21017;&#26469;&#30830;&#23450;&#25903;&#25345;&#30340;&#22238;&#24402;&#31995;&#25968;&#22823;&#23567;&#65292;&#28040;&#38500;&#20102;&#27169;&#22411;&#36873;&#25321;&#30340;&#35843;&#20248;&#38656;&#27714;&#65292;&#24182;&#20855;&#26377;&#23376;&#38598;&#36873;&#25321;&#19968;&#33268;&#24615;&#21644;&#39640;&#27010;&#29575;&#19979;&#30340;&#29702;&#24819;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#32500;&#25968;&#25454;&#30340;&#20998;&#26512;&#24341;&#21457;&#20102;&#23545;&#21333;&#25351;&#25968;&#27169;&#22411;&#65288;SIMs&#65289;&#21644;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#30340;&#22686;&#21152;&#20852;&#36259;&#12290;SIMs&#20026;&#39640;&#32500;&#25968;&#25454;&#25552;&#20379;&#20102;&#19968;&#31181;&#21487;&#35299;&#37322;&#21644;&#28789;&#27963;&#30340;&#24314;&#27169;&#26694;&#26550;&#65292;&#32780;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#26088;&#22312;&#20174;&#22823;&#37327;&#30340;&#39044;&#27979;&#22240;&#23376;&#20013;&#25214;&#21040;&#31232;&#30095;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#27169;&#22411;&#20013;&#30340;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#34987;&#35748;&#20026;&#26159;&#35745;&#31639;&#19978;&#38590;&#20197;&#22788;&#29702;&#30340;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20542;&#21521;&#20110;&#25918;&#23485;&#36873;&#25321;&#65292;&#20294;&#19981;&#33021;&#24471;&#21040;&#26368;&#20339;&#23376;&#38598;&#35299;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#31532;&#19968;&#20010;&#32463;&#36807;&#35777;&#26126;&#30340;&#38024;&#23545;&#39640;&#32500;SIMs&#20013;&#26368;&#20339;&#23376;&#38598;&#36873;&#25321;&#30340;&#21487;&#25193;&#23637;&#31639;&#27861;&#65292;&#30452;&#25509;&#35299;&#20915;&#20102;&#35745;&#31639;&#38590;&#39064;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#35299;&#20855;&#26377;&#23376;&#38598;&#36873;&#25321;&#19968;&#33268;&#24615;&#65292;&#24182;&#19988;&#20960;&#20046;&#32943;&#23450;&#20855;&#26377;&#29992;&#20110;&#21442;&#25968;&#20272;&#35745;&#30340;&#34394;&#25311;&#23646;&#24615;&#12290;&#35813;&#31639;&#27861;&#21253;&#25324;&#19968;&#20010;&#24191;&#20041;&#20449;&#24687;&#20934;&#21017;&#26469;&#30830;&#23450;&#22238;&#24402;&#31995;&#25968;&#30340;&#25903;&#25345;&#22823;&#23567;&#65292;&#28040;&#38500;&#27169;&#22411;&#36873;&#25321;&#35843;&#25972;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#19981;&#20551;&#35774;&#35823;&#24046;&#20998;&#24067;&#25110;&#29305;&#23450;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Analysis of high-dimensional data has led to increased interest in both single index models (SIMs) and best subset selection. SIMs provide an interpretable and flexible modeling framework for high-dimensional data, while best subset selection aims to find a sparse model from a large set of predictors. However, best subset selection in high-dimensional models is known to be computationally intractable. Existing methods tend to relax the selection, but do not yield the best subset solution. In this paper, we directly tackle the intractability by proposing the first provably scalable algorithm for best subset selection in high-dimensional SIMs. Our algorithmic solution enjoys the subset selection consistency and has the oracle property with a high probability. The algorithm comprises a generalized information criterion to determine the support size of the regression coefficients, eliminating the model selection tuning. Moreover, our method does not assume an error distribution or a specif
&lt;/p&gt;</description></item></channel></rss>