<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#30740;&#31350;&#26088;&#22312;&#31995;&#32479;&#27604;&#36739;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#65292;&#20197;&#29983;&#25104;&#27010;&#29575;&#24615;&#22825;&#27668;&#39044;&#27979;&#65292;&#36229;&#36234;&#20256;&#32479;&#22522;&#20110;&#29289;&#29702;&#30340;&#22825;&#27668;&#39044;&#27979;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2403.13458</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#22825;&#27668;&#27169;&#22411;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Uncertainty quantification for data-driven weather models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13458
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#26088;&#22312;&#31995;&#32479;&#27604;&#36739;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#65292;&#20197;&#29983;&#25104;&#27010;&#29575;&#24615;&#22825;&#27668;&#39044;&#27979;&#65292;&#36229;&#36234;&#20256;&#32479;&#22522;&#20110;&#29289;&#29702;&#30340;&#22825;&#27668;&#39044;&#27979;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#39537;&#21160;&#30340;&#25968;&#25454;&#39537;&#21160;&#22825;&#27668;&#39044;&#25253;&#27169;&#22411;&#22312;&#36807;&#21435;&#20960;&#24180;&#21462;&#24471;&#20102;&#24555;&#36895;&#36827;&#23637;&#12290;&#26368;&#36817;&#30340;&#30740;&#31350;&#20351;&#29992;&#20877;&#20998;&#26512;&#25968;&#25454;&#35757;&#32451;&#30340;&#27169;&#22411;&#21462;&#24471;&#20102;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#32467;&#26524;&#65292;&#24182;&#22312;&#19968;&#31995;&#21015;&#21464;&#37327;&#21644;&#35780;&#20272;&#25351;&#26631;&#19978;&#23637;&#31034;&#20102;&#26126;&#26174;&#25913;&#36827;&#65292;&#36229;&#36234;&#20102;&#29616;&#26377;&#30340;&#22522;&#20110;&#29289;&#29702;&#30340;&#25968;&#20540;&#22825;&#27668;&#39044;&#27979;&#27169;&#22411;&#12290;&#38500;&#20102;&#25913;&#36827;&#30340;&#39044;&#27979;&#22806;&#65292;&#25968;&#25454;&#39537;&#21160;&#22825;&#27668;&#27169;&#22411;&#30340;&#20027;&#35201;&#20248;&#21183;&#26159;&#23427;&#20204;&#26174;&#33879;&#36739;&#20302;&#30340;&#35745;&#31639;&#25104;&#26412;&#21644;&#19968;&#26086;&#27169;&#22411;&#34987;&#35757;&#32451;&#23601;&#33021;&#26356;&#24555;&#22320;&#29983;&#25104;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#25968;&#25454;&#39537;&#21160;&#22825;&#27668;&#39044;&#27979;&#30340;&#21162;&#21147;&#37117;&#23616;&#38480;&#20110;&#30830;&#23450;&#24615;&#30340;&#12289;&#28857;&#20540;&#39044;&#27979;&#65292;&#20351;&#24471;&#26080;&#27861;&#37327;&#21270;&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#23545;&#20110;&#30740;&#31350;&#21644;&#24212;&#29992;&#20013;&#30340;&#26368;&#20339;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#30340;&#25972;&#20307;&#30446;&#26631;&#26159;&#31995;&#32479;&#22320;&#30740;&#31350;&#21644;&#27604;&#36739;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#65292;&#20197;&#29983;&#25104;&#27010;&#29575;&#24615;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13458v1 Announce Type: cross  Abstract: Artificial intelligence (AI)-based data-driven weather forecasting models have experienced rapid progress over the last years. Recent studies, with models trained on reanalysis data, achieve impressive results and demonstrate substantial improvements over state-of-the-art physics-based numerical weather prediction models across a range of variables and evaluation metrics. Beyond improved predictions, the main advantages of data-driven weather models are their substantially lower computational costs and the faster generation of forecasts, once a model has been trained. However, most efforts in data-driven weather forecasting have been limited to deterministic, point-valued predictions, making it impossible to quantify forecast uncertainties, which is crucial in research and for optimal decision making in applications. Our overarching aim is to systematically study and compare uncertainty quantification methods to generate probabilistic 
&lt;/p&gt;</description></item></channel></rss>