<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28789;&#27963;&#36125;&#21494;&#26031;&#22238;&#24402;&#26641;&#27169;&#22411;flexBART&#65292;&#21487;&#20197;&#22312;&#21010;&#20998;&#20998;&#31867;&#27700;&#24179;&#30340;&#31163;&#25955;&#38598;&#26102;&#65292;&#23558;&#22810;&#20010;&#27700;&#24179;&#20998;&#37197;&#32473;&#20915;&#31574;&#26641;&#33410;&#28857;&#30340;&#20004;&#20010;&#20998;&#25903;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#23545;&#20998;&#31867;&#39044;&#27979;&#21464;&#37327;&#30340;&#28789;&#27963;&#24314;&#27169;&#65292;&#36328;&#32423;&#21035;&#30340;&#25968;&#25454;&#37096;&#20998;&#27719;&#24635;&#33021;&#21147;&#20063;&#24471;&#21040;&#20102;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2211.04459</link><description>&lt;p&gt;
flexBART:&#20855;&#26377;&#20998;&#31867;&#39044;&#27979;&#21464;&#37327;&#30340;&#28789;&#27963;&#36125;&#21494;&#26031;&#22238;&#24402;&#26641;
&lt;/p&gt;
&lt;p&gt;
flexBART: Flexible Bayesian regression trees with categorical predictors. (arXiv:2211.04459v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.04459
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28789;&#27963;&#36125;&#21494;&#26031;&#22238;&#24402;&#26641;&#27169;&#22411;flexBART&#65292;&#21487;&#20197;&#22312;&#21010;&#20998;&#20998;&#31867;&#27700;&#24179;&#30340;&#31163;&#25955;&#38598;&#26102;&#65292;&#23558;&#22810;&#20010;&#27700;&#24179;&#20998;&#37197;&#32473;&#20915;&#31574;&#26641;&#33410;&#28857;&#30340;&#20004;&#20010;&#20998;&#25903;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#23545;&#20998;&#31867;&#39044;&#27979;&#21464;&#37327;&#30340;&#28789;&#27963;&#24314;&#27169;&#65292;&#36328;&#32423;&#21035;&#30340;&#25968;&#25454;&#37096;&#20998;&#27719;&#24635;&#33021;&#21147;&#20063;&#24471;&#21040;&#20102;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22810;&#25968;&#36125;&#21494;&#26031;&#21152;&#27861;&#22238;&#24402;&#26641;&#65288;BART&#65289;&#30340;&#23454;&#29616;&#26041;&#27861;&#37319;&#29992;&#29420;&#28909;&#32534;&#30721;&#23558;&#20998;&#31867;&#39044;&#27979;&#21464;&#37327;&#26367;&#25442;&#20026;&#22810;&#20010;&#20108;&#36827;&#21046;&#25351;&#26631;&#65292;&#27599;&#20010;&#25351;&#26631;&#23545;&#24212;&#20110;&#27599;&#20010;&#32423;&#21035;&#25110;&#31867;&#21035;&#12290;&#29992;&#36825;&#20123;&#25351;&#26631;&#26500;&#24314;&#30340;&#22238;&#24402;&#26641;&#36890;&#36807;&#21453;&#22797;&#21024;&#38500;&#19968;&#20010;&#32423;&#21035;&#26469;&#21010;&#20998;&#20998;&#31867;&#27700;&#24179;&#30340;&#31163;&#25955;&#38598;&#12290;&#28982;&#32780;&#65292;&#32477;&#22823;&#22810;&#25968;&#20998;&#21106;&#19981;&#33021;&#20351;&#29992;&#27492;&#31574;&#30053;&#26500;&#24314;&#65292;&#20005;&#37325;&#38480;&#21046;&#20102;BART&#22312;&#36328;&#32423;&#21035;&#30340;&#25968;&#25454;&#37096;&#20998;&#27719;&#24635;&#26041;&#38754;&#30340;&#33021;&#21147;&#12290;&#21463;&#23545;&#26834;&#29699;&#25968;&#25454;&#21644;&#37051;&#37324;&#29359;&#32618;&#21160;&#24577;&#20998;&#26512;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#36890;&#36807;&#37325;&#26032;&#23454;&#29616;&#20197;&#33021;&#22815;&#23558;&#22810;&#20010;&#27700;&#24179;&#20998;&#37197;&#32473;&#20915;&#31574;&#26641;&#33410;&#28857;&#30340;&#20004;&#20010;&#20998;&#25903;&#30340;&#22238;&#24402;&#26641;&#26469;&#20811;&#26381;&#20102;&#36825;&#20010;&#38480;&#21046;&#12290;&#20026;&#20102;&#23545;&#32858;&#21512;&#20026;&#23567;&#21306;&#22495;&#30340;&#31354;&#38388;&#25968;&#25454;&#24314;&#27169;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#20915;&#31574;&#35268;&#21017;&#20808;&#39564;&#65292;&#36890;&#36807;&#20174;&#36866;&#24403;&#23450;&#20041;&#30340;&#32593;&#32476;&#30340;&#38543;&#26426;&#29983;&#25104;&#26641;&#20013;&#21024;&#38500;&#19968;&#20010;&#38543;&#26426;&#36793;&#26469;&#21019;&#24314;&#31354;&#38388;&#36830;&#32493;&#30340;&#21306;&#22495;&#12290;&#25105;&#20204;&#30340;&#37325;&#26032;&#23454;&#29616;&#65292;&#21487;&#22312;R&#30340;flexBART&#36719;&#20214;&#21253;&#20013;&#20351;&#29992;&#65292;&#20801;&#35768;&#28789;&#27963;&#22320;&#24314;&#27169;&#20998;&#31867;&#39044;&#27979;&#21464;&#37327;&#24182;&#25913;&#36827;&#36328;&#19981;&#21516;&#32423;&#21035;&#30340;&#25968;&#25454;&#37096;&#20998;&#27719;&#24635;&#12290;
&lt;/p&gt;
&lt;p&gt;
Most implementations of Bayesian additive regression trees (BART) one-hot encode categorical predictors, replacing each one with several binary indicators, one for every level or category. Regression trees built with these indicators partition the discrete set of categorical levels by repeatedly removing one level at a time. Unfortunately, the vast majority of partitions cannot be built with this strategy, severely limiting BART's ability to partially pool data across groups of levels. Motivated by analyses of baseball data and neighborhood-level crime dynamics, we overcame this limitation by re-implementing BART with regression trees that can assign multiple levels to both branches of a decision tree node. To model spatial data aggregated into small regions, we further proposed a new decision rule prior that creates spatially contiguous regions by deleting a random edge from a random spanning tree of a suitably defined network. Our re-implementation, which is available in the flexBART
&lt;/p&gt;</description></item></channel></rss>