<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#22312;&#19981;&#21516;&#32972;&#26223;&#26465;&#20214;&#19979;&#23545;&#26368;&#36817;&#30340;&#22240;&#26524;&#21457;&#29616;&#26041;&#27861;&#22312;&#35266;&#23519;&#24615;&#29420;&#31435;&#21516;&#20998;&#24067;&#25968;&#25454;&#19978;&#30340;&#23454;&#38469;&#24615;&#33021;&#36827;&#34892;&#20102;&#22522;&#20934;&#27979;&#35797;&#65292;&#21457;&#29616;&#22522;&#20110;score matching&#30340;&#26041;&#27861;&#22312;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#22330;&#26223;&#20013;&#34920;&#29616;&#20986;&#20196;&#20154;&#24778;&#35766;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.13387</link><description>&lt;p&gt;
&#22240;&#26524;&#21457;&#29616;&#20013;&#30340;&#20551;&#35774;&#36829;&#35268;&#21644;score matching&#30340;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Assumption violations in causal discovery and the robustness of score matching. (arXiv:2310.13387v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.13387
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#19981;&#21516;&#32972;&#26223;&#26465;&#20214;&#19979;&#23545;&#26368;&#36817;&#30340;&#22240;&#26524;&#21457;&#29616;&#26041;&#27861;&#22312;&#35266;&#23519;&#24615;&#29420;&#31435;&#21516;&#20998;&#24067;&#25968;&#25454;&#19978;&#30340;&#23454;&#38469;&#24615;&#33021;&#36827;&#34892;&#20102;&#22522;&#20934;&#27979;&#35797;&#65292;&#21457;&#29616;&#22522;&#20110;score matching&#30340;&#26041;&#27861;&#22312;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#22330;&#26223;&#20013;&#34920;&#29616;&#20986;&#20196;&#20154;&#24778;&#35766;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#39046;&#22495;&#30693;&#35782;&#26377;&#38480;&#19988;&#23454;&#39564;&#21463;&#21040;&#36947;&#24503;&#12289;&#36130;&#21153;&#25110;&#26102;&#38388;&#38480;&#21046;&#26102;&#65292;&#20174;&#19994;&#32773;&#20250;&#36716;&#21521;&#35266;&#23519;&#24615;&#22240;&#26524;&#21457;&#29616;&#26041;&#27861;&#26469;&#24674;&#22797;&#22240;&#26524;&#32467;&#26500;&#65292;&#21033;&#29992;&#20854;&#25968;&#25454;&#30340;&#32479;&#35745;&#29305;&#24615;&#12290;&#30001;&#20110;&#27809;&#26377;&#36827;&#19968;&#27493;&#30340;&#20551;&#35774;&#65292;&#22240;&#26524;&#21457;&#29616;&#26159;&#19968;&#20010;&#19981;&#36866;&#23450;&#30340;&#38382;&#39064;&#65292;&#27599;&#20010;&#31639;&#27861;&#37117;&#26377;&#20854;&#33258;&#24049;&#30340;&#19968;&#22871;&#36890;&#24120;&#26080;&#27861;&#39564;&#35777;&#30340;&#20551;&#35774;&#65292;&#20854;&#20013;&#19968;&#20123;&#22312;&#30495;&#23454;&#25968;&#25454;&#38598;&#20013;&#24456;&#38590;&#28385;&#36275;&#12290;&#37492;&#20110;&#36825;&#20123;&#32771;&#34385;&#65292;&#26412;&#25991;&#22312;&#19981;&#21516;&#32972;&#26223;&#26465;&#20214;&#19979;&#23545;&#26368;&#36817;&#30340;&#22240;&#26524;&#21457;&#29616;&#26041;&#27861;&#22312;&#35266;&#23519;&#24615;&#29420;&#31435;&#21516;&#20998;&#24067;&#25968;&#25454;&#19978;&#30340;&#23454;&#38469;&#24615;&#33021;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#22522;&#20934;&#27979;&#35797;&#65292;&#20801;&#35768;&#36829;&#21453;&#27599;&#20010;&#36873;&#23450;&#26041;&#27861;&#25152;&#38656;&#30340;&#20851;&#38190;&#20551;&#35774;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#36825;&#20123;&#20855;&#26377;&#25361;&#25112;&#24615;&#22330;&#26223;&#20013;&#65292;&#22522;&#20110;score matching&#30340;&#26041;&#27861;&#22312;&#25512;&#26029;&#30340;&#22270;&#30340;&#35823;&#25253;&#19982;&#28431;&#25253;&#29575;&#26041;&#38754;&#34920;&#29616;&#20986;&#20196;&#20154;&#24778;&#35766;&#30340;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#20854;&#30340;&#29702;&#35770;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
When domain knowledge is limited and experimentation is restricted by ethical, financial, or time constraints, practitioners turn to observational causal discovery methods to recover the causal structure, exploiting the statistical properties of their data. Because causal discovery without further assumptions is an ill-posed problem, each algorithm comes with its own set of usually untestable assumptions, some of which are hard to meet in real datasets. Motivated by these considerations, this paper extensively benchmarks the empirical performance of recent causal discovery methods on observational i.i.d. data generated under different background conditions, allowing for violations of the critical assumptions required by each selected approach. Our experimental findings show that score matching-based methods demonstrate surprising performance in the false positive and false negative rate of the inferred graph in these challenging scenarios, and we provide theoretical insights into their
&lt;/p&gt;</description></item></channel></rss>