<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#65288;BayesNF&#65289;&#65292;&#32467;&#21512;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#29992;&#20110;&#22788;&#29702;&#22823;&#35268;&#27169;&#26102;&#31354;&#39044;&#27979;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.07657</link><description>&lt;p&gt;
&#20351;&#29992;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#36827;&#34892;&#21487;&#25193;&#23637;&#30340;&#26102;&#31354;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Scalable Spatiotemporal Prediction with Bayesian Neural Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07657
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#22330;&#65288;BayesNF&#65289;&#65292;&#32467;&#21512;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#65292;&#29992;&#20110;&#22788;&#29702;&#22823;&#35268;&#27169;&#26102;&#31354;&#39044;&#27979;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#31354;&#25968;&#25454;&#38598;&#30001;&#31354;&#38388;&#21442;&#32771;&#30340;&#26102;&#38388;&#24207;&#21015;&#34920;&#31034;&#65292;&#24191;&#27867;&#24212;&#29992;&#20110;&#35768;&#22810;&#31185;&#23398;&#21644;&#21830;&#19994;&#26234;&#33021;&#39046;&#22495;&#65292;&#20363;&#22914;&#31354;&#27668;&#27745;&#26579;&#30417;&#27979;&#65292;&#30142;&#30149;&#36319;&#36394;&#21644;&#20113;&#38656;&#27714;&#39044;&#27979;&#12290;&#38543;&#30528;&#29616;&#20195;&#25968;&#25454;&#38598;&#35268;&#27169;&#21644;&#22797;&#26434;&#24615;&#30340;&#19981;&#26029;&#22686;&#21152;&#65292;&#38656;&#35201;&#26032;&#30340;&#32479;&#35745;&#26041;&#27861;&#26469;&#25429;&#25417;&#22797;&#26434;&#30340;&#26102;&#31354;&#21160;&#24577;&#24182;&#22788;&#29702;&#22823;&#35268;&#27169;&#39044;&#27979;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;Bayesian Neural Field (BayesNF)&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#25512;&#26029;&#26102;&#31354;&#22495;&#19978;&#20016;&#23500;&#27010;&#29575;&#20998;&#24067;&#30340;&#36890;&#29992;&#39046;&#22495;&#32479;&#35745;&#27169;&#22411;&#65292;&#21487;&#29992;&#20110;&#21253;&#25324;&#39044;&#27979;&#12289;&#25554;&#20540;&#21644;&#21464;&#24322;&#20998;&#26512;&#22312;&#20869;&#30340;&#25968;&#25454;&#20998;&#26512;&#20219;&#21153;&#12290;BayesNF&#23558;&#29992;&#20110;&#39640;&#23481;&#37327;&#20989;&#25968;&#20272;&#35745;&#30340;&#26032;&#22411;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#19982;&#29992;&#20110;&#40065;&#26834;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#30340;&#20998;&#23618;&#36125;&#21494;&#26031;&#25512;&#26029;&#30456;&#32467;&#21512;&#12290;&#36890;&#36807;&#22312;&#23450;&#20041;&#20808;&#39564;&#20998;&#24067;&#26041;&#38754;&#36827;&#34892;&#24207;&#21015;&#21270;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07657v1 Announce Type: cross  Abstract: Spatiotemporal datasets, which consist of spatially-referenced time series, are ubiquitous in many scientific and business-intelligence applications, such as air pollution monitoring, disease tracking, and cloud-demand forecasting. As modern datasets continue to increase in size and complexity, there is a growing need for new statistical methods that are flexible enough to capture complex spatiotemporal dynamics and scalable enough to handle large prediction problems. This work presents the Bayesian Neural Field (BayesNF), a domain-general statistical model for inferring rich probability distributions over a spatiotemporal domain, which can be used for data-analysis tasks including forecasting, interpolation, and variography. BayesNF integrates a novel deep neural network architecture for high-capacity function estimation with hierarchical Bayesian inference for robust uncertainty quantification. By defining the prior through a sequenc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#28508;&#22312;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#24314;&#27169;&#19982;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#35745;&#25968;&#21644;&#24213;&#23618;&#39640;&#26031;&#27169;&#22411;&#30340;&#20108;&#38454;&#29305;&#24615;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21033;&#29992;&#31890;&#23376;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2307.10454</link><description>&lt;p&gt;
&#38024;&#23545;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#28508;&#22312;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#24314;&#27169;&#19982;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Latent Gaussian dynamic factor modeling and forecasting for multivariate count time series. (arXiv:2307.10454v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10454
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#28508;&#22312;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#24314;&#27169;&#19982;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#35745;&#25968;&#21644;&#24213;&#23618;&#39640;&#26031;&#27169;&#22411;&#30340;&#20108;&#38454;&#29305;&#24615;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21033;&#29992;&#31890;&#23376;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#31181;&#22522;&#20110;&#39640;&#26031;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#22810;&#20803;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#35745;&#25968;&#21644;&#24213;&#23618;&#39640;&#26031;&#27169;&#22411;&#30340;&#20108;&#38454;&#29305;&#24615;&#65292;&#24182;&#36866;&#29992;&#20110;&#27169;&#22411;&#32500;&#25968;&#22823;&#20110;&#26679;&#26412;&#38271;&#24230;&#30340;&#24773;&#20917;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#27169;&#22411;&#36873;&#25321;&#30340;&#26032;&#22411;&#20132;&#21449;&#39564;&#35777;&#26041;&#26696;&#12290;&#39044;&#27979;&#36890;&#36807;&#22522;&#20110;&#31890;&#23376;&#30340;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#36827;&#34892;&#65292;&#21033;&#29992;&#21345;&#23572;&#26364;&#28388;&#27874;&#25216;&#26415;&#12290;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#30740;&#31350;&#21644;&#24212;&#29992;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work considers estimation and forecasting in a multivariate count time series model based on a copula-type transformation of a Gaussian dynamic factor model. The estimation is based on second-order properties of the count and underlying Gaussian models and applies to the case where the model dimension is larger than the sample length. In addition, novel cross-validation schemes are suggested for model selection. The forecasting is carried out through a particle-based sequential Monte Carlo, leveraging Kalman filtering techniques. A simulation study and an application are also considered.
&lt;/p&gt;</description></item></channel></rss>