<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#27604;&#36739;&#20102;&#20256;&#32479;&#30340;&#22810;&#37325;&#25554;&#34917;&#19982;&#22522;&#20110;&#26641;&#30340;&#26041;&#27861;&#22312;&#22810;&#23618;&#25968;&#25454;&#19978;&#30340;&#24615;&#33021;&#65292;&#21457;&#29616;MICE&#22312;&#20934;&#30830;&#30340;&#25298;&#32477;&#29575;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#32780;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#22312;&#20943;&#23569;&#20559;&#24046;&#26041;&#38754;&#34920;&#29616;&#36739;&#22909;&#12290;</title><link>http://arxiv.org/abs/2401.14161</link><description>&lt;p&gt;
&#36866;&#24212;&#22810;&#23618;&#25968;&#25454;&#30340;&#22522;&#20110;&#26641;&#30340;&#22810;&#37325;&#25554;&#34917;&#26041;&#27861;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Adapting tree-based multiple imputation methods for multi-level data? A simulation study. (arXiv:2401.14161v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14161
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#27604;&#36739;&#20102;&#20256;&#32479;&#30340;&#22810;&#37325;&#25554;&#34917;&#19982;&#22522;&#20110;&#26641;&#30340;&#26041;&#27861;&#22312;&#22810;&#23618;&#25968;&#25454;&#19978;&#30340;&#24615;&#33021;&#65292;&#21457;&#29616;MICE&#22312;&#20934;&#30830;&#30340;&#25298;&#32477;&#29575;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#32780;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#22312;&#20943;&#23569;&#20559;&#24046;&#26041;&#38754;&#34920;&#29616;&#36739;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#27169;&#25311;&#30740;&#31350;&#35780;&#20272;&#20102;&#38024;&#23545;&#22810;&#23618;&#25968;&#25454;&#30340;&#22810;&#37325;&#25554;&#34917;(MI)&#25216;&#26415;&#30340;&#26377;&#25928;&#24615;&#12290;&#23427;&#27604;&#36739;&#20102;&#20256;&#32479;&#30340;&#20197;&#38142;&#24335;&#26041;&#31243;&#20026;&#22522;&#30784;&#30340;&#22810;&#37325;&#25554;&#34917;(MICE)&#19982;&#22522;&#20110;&#26641;&#30340;&#26041;&#27861;&#65288;&#22914;&#38142;&#24335;&#38543;&#26426;&#26862;&#26519;&#19982;&#39044;&#27979;&#22343;&#20540;&#21305;&#37197;&#21644;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#65289;&#30340;&#24615;&#33021;&#12290;&#36824;&#23545;&#22522;&#20110;&#26641;&#30340;&#26041;&#27861;&#21253;&#25324;&#20102;&#21253;&#25324;&#38598;&#32676;&#25104;&#21592;&#30340;&#34394;&#25311;&#21464;&#37327;&#30340;&#25913;&#36827;&#29256;&#26412;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#35813;&#30740;&#31350;&#20351;&#29992;&#20855;&#26377;&#19981;&#21516;&#38598;&#32676;&#22823;&#23567;(25&#21644;50)&#21644;&#19981;&#23436;&#25972;&#31243;&#24230;(10\%&#21644;50\%)&#30340;&#27169;&#25311;&#20998;&#23618;&#25968;&#25454;&#23545;&#31995;&#25968;&#20272;&#35745;&#20559;&#24046;&#12289;&#32479;&#35745;&#21151;&#25928;&#21644;&#31867;&#22411;I&#38169;&#35823;&#29575;&#36827;&#34892;&#35780;&#20272;&#12290;&#31995;&#25968;&#26159;&#20351;&#29992;&#38543;&#26426;&#25130;&#36317;&#21644;&#38543;&#26426;&#26012;&#29575;&#27169;&#22411;&#36827;&#34892;&#20272;&#35745;&#30340;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#34429;&#28982;MICE&#26356;&#36866;&#21512;&#20934;&#30830;&#30340;&#25298;&#32477;&#29575;&#65292;&#20294;&#26497;&#38480;&#26799;&#24230;&#25552;&#21319;&#26377;&#21161;&#20110;&#20943;&#23569;&#20559;&#24046;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#21457;&#29616;&#65292;&#19981;&#21516;&#38598;&#32676;&#22823;&#23567;&#30340;&#20559;&#24046;&#27700;&#24179;&#30456;&#20284;&#65292;&#20294;&#25298;&#32477;&#29575;&#22312;&#23569;&#25968;&#32570;&#22833;&#24773;&#20917;&#19979;&#36739;&#19981;&#29702;&#24819;&#12290;
&lt;/p&gt;
&lt;p&gt;
This simulation study evaluates the effectiveness of multiple imputation (MI) techniques for multilevel data. It compares the performance of traditional Multiple Imputation by Chained Equations (MICE) with tree-based methods such as Chained Random Forests with Predictive Mean Matching and Extreme Gradient Boosting. Adapted versions that include dummy variables for cluster membership are also included for the tree-based methods. Methods are evaluated for coefficient estimation bias, statistical power, and type I error rates on simulated hierarchical data with different cluster sizes (25 and 50) and levels of missingness (10\% and 50\%). Coefficients are estimated using random intercept and random slope models. The results show that while MICE is preferred for accurate rejection rates, Extreme Gradient Boosting is advantageous for reducing bias. Furthermore, the study finds that bias levels are similar across different cluster sizes, but rejection rates tend to be less favorable with few
&lt;/p&gt;</description></item></channel></rss>