<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>MKL&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#28789;&#27963;&#26377;&#25928;&#30340;&#22810;&#32452;&#23398;&#25968;&#25454;&#38598;&#25104;&#26041;&#27861;&#65292;&#21487;&#20197;&#19982;&#22797;&#26434;&#30340;&#30417;&#30563;&#24335;&#22810;&#32452;&#23398;&#25972;&#21512;&#26041;&#27861;&#31454;&#20105;</title><link>https://arxiv.org/abs/2403.18355</link><description>&lt;p&gt;
&#30417;&#30563;&#22810;&#26680;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;&#22810;&#32452;&#23398;&#25968;&#25454;&#38598;&#25104;
&lt;/p&gt;
&lt;p&gt;
Supervised Multiple Kernel Learning approaches for multi-omics data integration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18355
&lt;/p&gt;
&lt;p&gt;
MKL&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#28789;&#27963;&#26377;&#25928;&#30340;&#22810;&#32452;&#23398;&#25968;&#25454;&#38598;&#25104;&#26041;&#27861;&#65292;&#21487;&#20197;&#19982;&#22797;&#26434;&#30340;&#30417;&#30563;&#24335;&#22810;&#32452;&#23398;&#25972;&#21512;&#26041;&#27861;&#31454;&#20105;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#36890;&#37327;&#25216;&#26415;&#30340;&#36827;&#23637;&#23548;&#33268;&#36234;&#26469;&#36234;&#22810;&#30340;&#32452;&#23398;&#25968;&#25454;&#38598;&#30340;&#21487;&#29992;&#24615;&#12290;&#22810;&#31181;&#24322;&#36136;&#25968;&#25454;&#28304;&#30340;&#38598;&#25104;&#30446;&#21069;&#26159;&#29983;&#29289;&#23398;&#21644;&#29983;&#29289;&#20449;&#24687;&#23398;&#39046;&#22495;&#30340;&#19968;&#20010;&#38382;&#39064;&#12290;&#22810;&#26680;&#23398;&#20064;&#65288;MKL&#65289;&#24050;&#34987;&#35777;&#26126;&#26159;&#19968;&#31181;&#28789;&#27963;&#21644;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#32771;&#34385;&#22810;&#32452;&#23398;&#36755;&#20837;&#30340;&#22810;&#26679;&#24615;&#65292;&#23613;&#31649;&#23427;&#22312;&#22522;&#22240;&#32452;&#25968;&#25454;&#25366;&#25496;&#20013;&#26159;&#19968;&#31181;&#19981;&#24120;&#29992;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;&#19981;&#21516;&#26680;&#34701;&#21512;&#31574;&#30053;&#30340;&#26032;&#39062;MKL&#26041;&#27861;&#12290;&#20026;&#20102;&#20174;&#36755;&#20837;&#26680;&#30340;&#20803;&#26680;&#20013;&#23398;&#20064;&#65292;&#25105;&#20204;&#23558;&#26080;&#30417;&#30563;&#38598;&#25104;&#31639;&#27861;&#35843;&#25972;&#20026;&#25903;&#25345;&#21521;&#37327;&#26426;&#30340;&#30417;&#30563;&#20219;&#21153;&#12290;&#25105;&#20204;&#36824;&#27979;&#35797;&#20102;&#29992;&#20110;&#26680;&#34701;&#21512;&#21644;&#20998;&#31867;&#30340;&#28145;&#24230;&#23398;&#20064;&#26550;&#26500;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22522;&#20110;MKL&#30340;&#27169;&#22411;&#21487;&#20197;&#19982;&#26356;&#22797;&#26434;&#12289;&#26368;&#20808;&#36827;&#30340;&#30417;&#30563;&#24335;&#22810;&#32452;&#23398;&#25972;&#21512;&#26041;&#27861;&#31454;&#20105;&#12290;&#22810;&#26680;&#23398;&#20064;&#20026;&#22810;&#32452;&#23398;&#22522;&#22240;&#32452;&#25968;&#25454;&#20013;&#30340;&#39044;&#27979;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#33258;&#28982;&#30340;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18355v1 Announce Type: cross  Abstract: Advances in high-throughput technologies have originated an ever-increasing availability of omics datasets. The integration of multiple heterogeneous data sources is currently an issue for biology and bioinformatics. Multiple kernel learning (MKL) has shown to be a flexible and valid approach to consider the diverse nature of multi-omics inputs, despite being an underused tool in genomic data mining.We provide novel MKL approaches based on different kernel fusion strategies.To learn from the meta-kernel of input kernels, we adaptedunsupervised integration algorithms for supervised tasks with support vector machines.We also tested deep learning architectures for kernel fusion and classification.The results show that MKL-based models can compete with more complex, state-of-the-art, supervised multi-omics integrative approaches. Multiple kernel learning offers a natural framework for predictive models in multi-omics genomic data. Our resu
&lt;/p&gt;</description></item></channel></rss>