<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#20025;&#40614;&#26234;&#33021;&#21345;&#25968;&#25454;&#21644;&#20840;&#22269;&#20986;&#34892;&#35843;&#26597;&#25968;&#25454;&#65292;&#21457;&#29616;&#22312;&#20844;&#20849;&#20132;&#36890;&#29992;&#25143;&#30340;&#26102;&#38388;&#25253;&#21578;&#20013;&#23384;&#22312;&#20013;&#20301;&#25968;&#20026;11.34&#20998;&#38047;&#30340;&#25253;&#21578;&#35823;&#24046;&#12290;</title><link>http://arxiv.org/abs/2308.01198</link><description>&lt;p&gt;
&#20351;&#29992;&#26234;&#33021;&#21345;&#25968;&#25454;&#20998;&#26512;&#20025;&#40614;&#20840;&#22269;&#20986;&#34892;&#35843;&#26597;&#20013;&#20844;&#20849;&#20132;&#36890;&#30340;&#25253;&#21578;&#35823;&#24046;
&lt;/p&gt;
&lt;p&gt;
Analyzing the Reporting Error of Public Transport Trips in the Danish National Travel Survey Using Smart Card Data. (arXiv:2308.01198v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01198
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#20025;&#40614;&#26234;&#33021;&#21345;&#25968;&#25454;&#21644;&#20840;&#22269;&#20986;&#34892;&#35843;&#26597;&#25968;&#25454;&#65292;&#21457;&#29616;&#22312;&#20844;&#20849;&#20132;&#36890;&#29992;&#25143;&#30340;&#26102;&#38388;&#25253;&#21578;&#20013;&#23384;&#22312;&#20013;&#20301;&#25968;&#20026;11.34&#20998;&#38047;&#30340;&#25253;&#21578;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23478;&#24237;&#20986;&#34892;&#35843;&#26597;&#24050;&#32463;&#29992;&#20110;&#25968;&#21313;&#24180;&#26469;&#25910;&#38598;&#20010;&#20154;&#21644;&#23478;&#24237;&#30340;&#20986;&#34892;&#34892;&#20026;&#12290;&#28982;&#32780;&#65292;&#33258;&#25105;&#25253;&#21578;&#30340;&#35843;&#26597;&#23384;&#22312;&#22238;&#24518;&#20559;&#24046;&#65292;&#22240;&#20026;&#21463;&#35775;&#32773;&#21487;&#33021;&#38590;&#20197;&#20934;&#30830;&#22238;&#24518;&#21644;&#25253;&#21578;&#20182;&#20204;&#30340;&#27963;&#21160;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20004;&#20010;&#25968;&#25454;&#28304;&#30340;&#36830;&#32493;&#20116;&#24180;&#25968;&#25454;&#22312;&#20010;&#20307;&#23618;&#38754;&#36827;&#34892;&#21305;&#37197;&#65288;&#21363;&#20025;&#40614;&#22269;&#23478;&#20986;&#34892;&#35843;&#26597;&#21644;&#20025;&#40614;&#26234;&#33021;&#21345;&#31995;&#32479;&#65289;&#65292;&#26469;&#30740;&#31350;&#20840;&#22269;&#33539;&#22260;&#20869;&#23478;&#24237;&#20986;&#34892;&#35843;&#26597;&#20013;&#20844;&#20849;&#20132;&#36890;&#29992;&#25143;&#30340;&#26102;&#38388;&#25253;&#21578;&#35823;&#24046;&#12290;&#35843;&#26597;&#21463;&#35775;&#32773;&#19982;&#26234;&#33021;&#21345;&#25968;&#25454;&#20013;&#30340;&#26053;&#34892;&#21345;&#36827;&#34892;&#21305;&#37197;&#65292;&#21305;&#37197;&#20165;&#22522;&#20110;&#21463;&#35775;&#32773;&#22768;&#26126;&#30340;&#26102;&#31354;&#26053;&#34892;&#34892;&#20026;&#12290;&#22823;&#32422;70%&#30340;&#21463;&#35775;&#32773;&#25104;&#21151;&#19982;&#26234;&#33021;&#21345;&#36827;&#34892;&#21305;&#37197;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#20013;&#20301;&#25968;&#30340;&#26102;&#38388;&#25253;&#21578;&#35823;&#24046;&#20026;11.34&#20998;&#38047;&#65292;&#22235;&#20998;&#20301;&#33539;&#22260;&#20026;28.14&#20998;&#38047;&#12290;&#27492;&#22806;&#65292;&#36827;&#34892;&#20102;&#32479;&#35745;&#20998;&#26512;&#26469;&#25506;&#32034;&#35843;&#26597;&#21709;&#24212;&#32773;&#29305;&#24449;&#21644;&#25253;&#21578;&#35823;&#24046;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Household travel surveys have been used for decades to collect individuals and households' travel behavior. However, self-reported surveys are subject to recall bias, as respondents might struggle to recall and report their activities accurately. This study addresses examines the time reporting error of public transit users in a nationwide household travel survey by matching, at the individual level, five consecutive years of data from two sources, namely the Danish National Travel Survey (TU) and the Danish Smart Card system (Rejsekort). Survey respondents are matched with travel cards from the Rejsekort data solely based on the respondents' declared spatiotemporal travel behavior. Approximately, 70% of the respondents were successfully matched with Rejsekort travel cards. The findings reveal a median time reporting error of 11.34 minutes, with an Interquartile Range of 28.14 minutes. Furthermore, a statistical analysis was performed to explore the relationships between the survey res
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#26377;&#25928;&#21033;&#29992;&#34987;&#23457;&#26597;&#21644;&#26410;&#34987;&#23457;&#26597;&#30149;&#20154;&#30340;&#20449;&#24687;&#65292;&#39044;&#27979;&#38750;&#23567;&#32454;&#32990;&#32954;&#30284;&#65288;NSCLC&#65289;&#30149;&#20154;&#30340;&#25972;&#20307;&#29983;&#23384;&#12290;</title><link>http://arxiv.org/abs/2307.11465</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#20855;&#26377;&#32570;&#22833;&#20540;&#30340;&#25972;&#20307;&#29983;&#23384;&#20998;&#26512;&#30340;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Deep Learning Approach for Overall Survival Analysis with Missing Values. (arXiv:2307.11465v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11465
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#36890;&#36807;&#26377;&#25928;&#21033;&#29992;&#34987;&#23457;&#26597;&#21644;&#26410;&#34987;&#23457;&#26597;&#30149;&#20154;&#30340;&#20449;&#24687;&#65292;&#39044;&#27979;&#38750;&#23567;&#32454;&#32990;&#32954;&#30284;&#65288;NSCLC&#65289;&#30149;&#20154;&#30340;&#25972;&#20307;&#29983;&#23384;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#21487;&#20197;&#24212;&#29992;&#20110;&#32954;&#30284;&#30740;&#31350;&#65292;&#23588;&#20854;&#26159;&#38750;&#23567;&#32454;&#32990;&#32954;&#30284;&#65288;NSCLC&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#39046;&#22495;&#12290;&#23545;&#20110;&#30149;&#20154;&#29366;&#24577;&#30340;&#25972;&#20307;&#29983;&#23384;&#65288;OS&#65289;&#26159;&#19968;&#20010;&#37325;&#35201;&#25351;&#26631;&#65292;&#21487;&#20197;&#24110;&#21161;&#35782;&#21035;&#29983;&#23384;&#27010;&#29575;&#19981;&#21516;&#30340;&#20122;&#32452;&#65292;&#20174;&#32780;&#23454;&#29616;&#20010;&#20307;&#21270;&#27835;&#30103;&#21644;&#25913;&#21892;&#25972;&#20307;&#29983;&#23384;&#29575;&#12290;&#22312;&#36825;&#20010;&#20998;&#26512;&#20013;&#65292;&#38656;&#35201;&#32771;&#34385;&#20004;&#20010;&#25361;&#25112;&#12290;&#39318;&#20808;&#65292;&#24456;&#23569;&#26377;&#30740;&#31350;&#33021;&#22815;&#26377;&#25928;&#21033;&#29992;&#27599;&#20010;&#30149;&#20154;&#30340;&#21487;&#29992;&#20449;&#24687;&#65292;&#21033;&#29992;&#26410;&#34987;&#23457;&#26597;&#30340;&#65288;&#21363;&#27515;&#20129;&#65289;&#21644;&#34987;&#23457;&#26597;&#30340;&#65288;&#21363;&#24184;&#23384;&#32773;&#65289;&#30149;&#20154;&#30340;&#20449;&#24687;&#65292;&#20063;&#35201;&#32771;&#34385;&#21040;&#27515;&#20129;&#26102;&#38388;&#12290;&#20854;&#27425;&#65292;&#19981;&#23436;&#25972;&#25968;&#25454;&#22788;&#29702;&#26159;&#21307;&#23398;&#39046;&#22495;&#24120;&#35265;&#30340;&#38382;&#39064;&#12290;&#36825;&#20010;&#38382;&#39064;&#36890;&#24120;&#36890;&#36807;&#20351;&#29992;&#25554;&#34917;&#26041;&#27861;&#26469;&#35299;&#20915;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#25552;&#20986;&#19968;&#20010;&#33021;&#22815;&#20811;&#26381;&#36825;&#20123;&#38480;&#21046;&#30340;&#20154;&#24037;&#26234;&#33021;&#27169;&#22411;&#65292;&#33021;&#22815;&#20174;&#34987;&#23457;&#26597;&#21644;&#26410;&#34987;&#23457;&#26597;&#30340;&#30149;&#20154;&#21450;&#20854;&#21487;&#29992;&#29305;&#24449;&#20013;&#26377;&#25928;&#23398;&#20064;&#65292;&#39044;&#27979;NSCLC&#30149;&#20154;&#30340;OS&#12290;
&lt;/p&gt;
&lt;p&gt;
One of the most challenging fields where Artificial Intelligence (AI) can be applied is lung cancer research, specifically non-small cell lung cancer (NSCLC). In particular, overall survival (OS) is a vital indicator of patient status, helping to identify subgroups with diverse survival probabilities, enabling tailored treatment and improved OS rates. In this analysis, there are two challenges to take into account. First, few studies effectively exploit the information available from each patient, leveraging both uncensored (i.e., dead) and censored (i.e., survivors) patients, considering also the death times. Second, the handling of incomplete data is a common issue in the medical field. This problem is typically tackled through the use of imputation methods. Our objective is to present an AI model able to overcome these limits, effectively learning from both censored and uncensored patients and their available features, for the prediction of OS for NSCLC patients. We present a novel 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#36125;&#21494;&#26031;&#23433;&#20840;&#39564;&#35777;&#30340;&#31639;&#27861;&#65292;&#23558;&#40657;&#30418;&#23433;&#20840;&#39564;&#35777;&#38382;&#39064;&#36716;&#21270;&#20026;&#36125;&#21494;&#26031;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#27010;&#29575;&#20195;&#29702;&#27169;&#22411;&#25311;&#21512;&#24555;&#36895;&#39044;&#27979;&#25925;&#38556;&#65292;&#21033;&#29992;&#37325;&#35201;&#24615;&#37319;&#26679;&#20272;&#35745;&#25805;&#20316;&#22495;&#20869;&#30340;&#25925;&#38556;&#27010;&#29575;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#23545;&#39640;&#32500;&#12289;&#21361;&#38505;&#12289;&#35745;&#31639;&#26114;&#36149;&#30340;&#31995;&#32479;&#30340;&#39640;&#25928;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2305.02449</link><description>&lt;p&gt;
&#40657;&#30418;&#31995;&#32479;&#30340;&#36125;&#21494;&#26031;&#23433;&#20840;&#39564;&#35777;
&lt;/p&gt;
&lt;p&gt;
Bayesian Safety Validation for Black-Box Systems. (arXiv:2305.02449v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02449
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#36125;&#21494;&#26031;&#23433;&#20840;&#39564;&#35777;&#30340;&#31639;&#27861;&#65292;&#23558;&#40657;&#30418;&#23433;&#20840;&#39564;&#35777;&#38382;&#39064;&#36716;&#21270;&#20026;&#36125;&#21494;&#26031;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#31639;&#27861;&#36890;&#36807;&#27010;&#29575;&#20195;&#29702;&#27169;&#22411;&#25311;&#21512;&#24555;&#36895;&#39044;&#27979;&#25925;&#38556;&#65292;&#21033;&#29992;&#37325;&#35201;&#24615;&#37319;&#26679;&#20272;&#35745;&#25805;&#20316;&#22495;&#20869;&#30340;&#25925;&#38556;&#27010;&#29575;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#23545;&#39640;&#32500;&#12289;&#21361;&#38505;&#12289;&#35745;&#31639;&#26114;&#36149;&#30340;&#31995;&#32479;&#30340;&#39640;&#25928;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#23433;&#20840;&#20851;&#38190;&#31995;&#32479;&#20934;&#30830;&#20272;&#35745;&#25925;&#38556;&#27010;&#29575;&#23545;&#35748;&#35777;&#33267;&#20851;&#37325;&#35201;&#12290;&#30001;&#20110;&#39640;&#32500;&#36755;&#20837;&#31354;&#38388;&#12289;&#21361;&#38505;&#27979;&#35797;&#22330;&#26223;&#21644;&#35745;&#31639;&#26114;&#36149;&#30340;&#20223;&#30495;&#22120;&#65292;&#20272;&#35745;&#36890;&#24120;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#22240;&#27492;&#30740;&#31350;&#39640;&#25928;&#20272;&#35745;&#25216;&#26415;&#21313;&#20998;&#37325;&#35201;&#12290;&#26412;&#25991;&#23558;&#40657;&#30418;&#23433;&#20840;&#39564;&#35777;&#38382;&#39064;&#37325;&#26032;&#23450;&#20041;&#20026;&#36125;&#21494;&#26031;&#20248;&#21270;&#38382;&#39064;&#65292;&#24182;&#24341;&#20837;&#19968;&#31181;&#31639;&#27861;&#8212;&#8212;&#36125;&#21494;&#26031;&#23433;&#20840;&#39564;&#35777;&#65292;&#35813;&#31639;&#27861;&#36890;&#36807;&#36845;&#20195;&#25311;&#21512;&#27010;&#29575;&#20195;&#29702;&#27169;&#22411;&#26469;&#39640;&#25928;&#39044;&#27979;&#25925;&#38556;&#12290;&#35813;&#31639;&#27861;&#26088;&#22312;&#25628;&#32034;&#25925;&#38556;&#12289;&#35745;&#31639;&#26368;&#21487;&#33021;&#30340;&#25925;&#38556;&#65292;&#24182;&#21033;&#29992;&#37325;&#35201;&#24615;&#37319;&#26679;&#20272;&#35745;&#25805;&#20316;&#22495;&#20869;&#30340;&#25925;&#38556;&#27010;&#29575;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19977;&#31181;&#37319;&#38598;&#20989;&#25968;&#65292;&#37325;&#28857;&#26159;&#36890;&#36807;&#35206;&#30422;&#35774;&#35745;&#31354;&#38388;&#12289;&#20248;&#21270;&#35299;&#26512;&#27966;&#29983;&#30340;&#25925;&#38556;&#36793;&#30028;&#21644;&#37319;&#26679;&#39044;&#27979;&#30340;&#25925;&#38556;&#21306;&#22495;&#26469;&#20943;&#23569;&#19981;&#30830;&#23450;&#24615;&#12290;&#20027;&#35201;&#28041;&#21450;&#21482;&#36755;&#20986;&#20108;&#36827;&#21046;&#25351;&#26631;&#30340;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurately estimating the probability of failure for safety-critical systems is important for certification. Estimation is often challenging due to high-dimensional input spaces, dangerous test scenarios, and computationally expensive simulators; thus, efficient estimation techniques are important to study. This work reframes the problem of black-box safety validation as a Bayesian optimization problem and introduces an algorithm, Bayesian safety validation, that iteratively fits a probabilistic surrogate model to efficiently predict failures. The algorithm is designed to search for failures, compute the most-likely failure, and estimate the failure probability over an operating domain using importance sampling. We introduce a set of three acquisition functions that focus on reducing uncertainty by covering the design space, optimizing the analytically derived failure boundaries, and sampling the predicted failure regions. Mainly concerned with systems that only output a binary indicat
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#20351;&#29992;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#26469;&#25913;&#36827;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#21453;&#39304;&#24490;&#29615;&#36845;&#20195;&#22320;&#25913;&#36827;&#39044;&#27979;&#22120;&#65292;&#23454;&#29616;&#20102;&#23545;&#26426;&#32452;&#32452;&#21512;&#30340;&#26368;&#20339;&#25805;&#20316;&#12290;</title><link>http://arxiv.org/abs/2208.13065</link><description>&lt;p&gt;
&#25913;&#21892;&#36816;&#33829;&#32463;&#27982;&#23398;&#65306;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#26469;&#39044;&#27979;&#26426;&#32452;&#32452;&#21512;&#30340;&#25805;&#20316;&#35745;&#21010;
&lt;/p&gt;
&lt;p&gt;
Towards Improving Operation Economics: A Bilevel MIP-Based Closed-Loop Predict-and-Optimize Framework for Prescribing Unit Commitment. (arXiv:2208.13065v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.13065
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21452;&#23618; MIP &#30340;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#20351;&#29992;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#26469;&#25913;&#36827;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#21453;&#39304;&#24490;&#29615;&#36845;&#20195;&#22320;&#25913;&#36827;&#39044;&#27979;&#22120;&#65292;&#23454;&#29616;&#20102;&#23545;&#26426;&#32452;&#32452;&#21512;&#30340;&#26368;&#20339;&#25805;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#24120;&#65292;&#31995;&#32479;&#25805;&#20316;&#21592;&#22312;&#24320;&#29615;&#39044;&#27979;&#20248;&#21270;&#36807;&#31243;&#20013;&#36827;&#34892;&#30005;&#21147;&#31995;&#32479;&#30340;&#32463;&#27982;&#36816;&#34892;&#65306;&#39318;&#20808;&#39044;&#27979;&#21487;&#20877;&#29983;&#33021;&#28304;(RES)&#30340;&#21487;&#29992;&#24615;&#21644;&#31995;&#32479;&#20648;&#22791;&#38656;&#27714;&#65307;&#26681;&#25454;&#36825;&#20123;&#39044;&#27979;&#65292;&#31995;&#32479;&#25805;&#20316;&#21592;&#35299;&#20915;&#35832;&#22914;&#26426;&#32452;&#32452;&#21512;(UC)&#30340;&#20248;&#21270;&#27169;&#22411;&#65292;&#20197;&#30830;&#23450;&#30456;&#24212;&#30340;&#32463;&#27982;&#36816;&#34892;&#35745;&#21010;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#24320;&#29615;&#36807;&#31243;&#21487;&#33021;&#20250;&#23454;&#36136;&#24615;&#22320;&#25439;&#23475;&#25805;&#20316;&#32463;&#27982;&#24615;&#65292;&#22240;&#20026;&#23427;&#30340;&#39044;&#27979;&#22120;&#30446;&#20809;&#30701;&#27973;&#22320;&#23547;&#27714;&#25913;&#21892;&#21363;&#26102;&#30340;&#32479;&#35745;&#39044;&#27979;&#35823;&#24046;&#65292;&#32780;&#19981;&#26159;&#26368;&#32456;&#30340;&#25805;&#20316;&#25104;&#26412;&#12290;&#20026;&#27492;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#38381;&#29615;&#39044;&#27979;&#20248;&#21270;&#26694;&#26550;&#65292;&#25552;&#20379;&#19968;&#31181;&#39044;&#27979;&#26426;&#32452;&#32452;&#21512;&#20197;&#25913;&#21892;&#25805;&#20316;&#32463;&#27982;&#24615;&#30340;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#21033;&#29992;&#21452;&#23618;&#28151;&#21512;&#25972;&#25968;&#35268;&#21010;&#27169;&#22411;&#38024;&#23545;&#26368;&#20339;&#31995;&#32479;&#25805;&#20316;&#35757;&#32451;&#25104;&#26412;&#23548;&#21521;&#30340;&#39044;&#27979;&#22120;&#12290;&#19978;&#23618;&#22522;&#20110;&#20854;&#24341;&#36215;&#30340;&#25805;&#20316;&#25104;&#26412;&#26469;&#35757;&#32451; RES &#21644;&#20648;&#22791;&#39044;&#27979;&#22120;&#65307;&#19979;&#23618;&#21017;&#22312;&#32473;&#23450;&#39044;&#27979;&#30340; RES &#21644;&#20648;&#22791;&#30340;&#24773;&#20917;&#19979;&#65292;&#20381;&#25454;&#26368;&#20339;&#25805;&#20316;&#21407;&#21017;&#27714;&#35299; UC&#12290;&#36825;&#20004;&#20010;&#23618;&#32423;&#36890;&#36807;&#21453;&#39304;&#29615;&#36335;&#36827;&#34892;&#20132;&#20114;&#24615;&#20114;&#21160;&#65292;&#30452;&#21040;&#25910;&#25947;&#20026;&#27490;&#12290;&#22312;&#20462;&#25913;&#21518;&#30340;IEEE 24-bus&#31995;&#32479;&#19978;&#30340;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#19982;&#19977;&#31181;&#26368;&#20808;&#36827;&#30340; UC &#22522;&#20934;&#32447;&#30456;&#27604;&#65292;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#20855;&#26377;&#39640;&#25928;&#24615;&#21644;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generally, system operators conduct the economic operation of power systems in an open-loop predict-then-optimize process: the renewable energy source (RES) availability and system reserve requirements are first predicted; given the predictions, system operators solve optimization models such as unit commitment (UC) to determine the economical operation plans accordingly. However, such an open-loop process could essentially compromise the operation economics because its predictors myopically seek to improve the immediate statistical prediction errors instead of the ultimate operation cost. To this end, this paper presents a closed-loop predict-and-optimize framework, offering a prescriptive UC to improve the operation economics. First, a bilevel mixed-integer programming model is leveraged to train cost-oriented predictors tailored for optimal system operations: the upper level trains the RES and reserve predictors based on their induced operation cost; the lower level, with given pred
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#20351;&#29992;&#25511;&#21046;&#20989;&#25968;&#26041;&#27861;&#21644;&#27491;&#21017;&#21270;&#26041;&#26696;&#26469;&#33719;&#24471;&#26356;&#22909;&#20869;&#29983;&#20108;&#36827;&#21046;&#21709;&#24212;&#27169;&#22411;&#20272;&#35745;&#32467;&#26524;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#30740;&#31350;&#23478;&#24237;&#25910;&#20837;&#23545;&#22823;&#23398;&#23436;&#25104;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2201.04811</link><description>&lt;p&gt;
&#22810;&#20010;&#24369;&#24037;&#20855;&#30340;&#20108;&#36827;&#21046;&#21709;&#24212;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Binary response model with many weak instruments. (arXiv:2201.04811v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.04811
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#20351;&#29992;&#25511;&#21046;&#20989;&#25968;&#26041;&#27861;&#21644;&#27491;&#21017;&#21270;&#26041;&#26696;&#26469;&#33719;&#24471;&#26356;&#22909;&#20869;&#29983;&#20108;&#36827;&#21046;&#21709;&#24212;&#27169;&#22411;&#20272;&#35745;&#32467;&#26524;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#30740;&#31350;&#23478;&#24237;&#25910;&#20837;&#23545;&#22823;&#23398;&#23436;&#25104;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#20855;&#26377;&#35768;&#22810;&#24369;&#24037;&#20855;&#30340;&#20869;&#29983;&#20108;&#36827;&#21046;&#21709;&#24212;&#27169;&#22411;&#12290;&#25105;&#20204;&#37319;&#29992;&#25511;&#21046;&#20989;&#25968;&#26041;&#27861;&#21644;&#27491;&#21017;&#21270;&#26041;&#26696;&#65292;&#22312;&#23384;&#22312;&#35768;&#22810;&#24369;&#24037;&#20855;&#30340;&#24773;&#20917;&#19979;&#33719;&#24471;&#26356;&#22909;&#30340;&#20869;&#29983;&#20108;&#36827;&#21046;&#21709;&#24212;&#27169;&#22411;&#20272;&#35745;&#32467;&#26524;&#12290;&#25552;&#20379;&#20102;&#20004;&#20010;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#20998;&#24067;&#30340;&#20272;&#35745;&#22120;&#65292;&#20998;&#21035;&#31216;&#20026;&#27491;&#21017;&#21270;&#26465;&#20214;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#65288;RCMLE&#65289;&#21644;&#27491;&#21017;&#21270;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#65288;RNLSE&#65289;&#12290;Monte Carlo&#27169;&#25311;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#22312;&#23384;&#22312;&#35768;&#22810;&#24369;&#24037;&#20855;&#26102;&#20248;&#20110;&#29616;&#26377;&#30340;&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#24212;&#29992;&#20272;&#35745;&#26041;&#27861;&#30740;&#31350;&#23478;&#24237;&#25910;&#20837;&#23545;&#22823;&#23398;&#23436;&#25104;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers an endogenous binary response model with many weak instruments. We in the current paper employ a control function approach and a regularization scheme to obtain better estimation results for the endogenous binary response model in the presence of many weak instruments. Two consistent and asymptotically normally distributed estimators are provided, each of which is called a regularized conditional maximum likelihood estimator (RCMLE) and a regularized nonlinear least square estimator (RNLSE) respectively. Monte Carlo simulations show that the proposed estimators outperform the existing estimators when many weak instruments are present. We apply our estimation method to study the effect of family income on college completion.
&lt;/p&gt;</description></item></channel></rss>