<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#29992;&#20110;SAR&#22270;&#20687;&#20013;&#33337;&#21482;&#26816;&#27979;&#30340;Wilcoxon&#38750;&#21442;&#25968;CFAR&#26041;&#26696;&#65292;&#21487;&#20197;&#22312;&#27809;&#26377;&#24050;&#30693;&#26434;&#27874;&#20998;&#24067;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#32500;&#25345;&#30446;&#26631;&#26816;&#27979;&#30340;&#24658;&#23450;&#34394;&#35686;&#29575;</title><link>https://arxiv.org/abs/2402.18579</link><description>&lt;p&gt;
SAR&#22270;&#20687;&#20013;&#29992;&#20110;&#33337;&#21482;&#26816;&#27979;&#30340;Wilcoxon&#38750;&#21442;&#25968;&#21270;CFAR&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Wilcoxon Nonparametric CFAR Scheme for Ship Detection in SAR Image
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.18579
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#29992;&#20110;SAR&#22270;&#20687;&#20013;&#33337;&#21482;&#26816;&#27979;&#30340;Wilcoxon&#38750;&#21442;&#25968;CFAR&#26041;&#26696;&#65292;&#21487;&#20197;&#22312;&#27809;&#26377;&#24050;&#30693;&#26434;&#27874;&#20998;&#24067;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#32500;&#25345;&#30446;&#26631;&#26816;&#27979;&#30340;&#24658;&#23450;&#34394;&#35686;&#29575;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24120;&#25968;&#34394;&#35686;&#29575;&#65288;CFAR&#65289;&#26816;&#27979;&#31639;&#27861;&#24191;&#27867;&#24212;&#29992;&#20110;&#30446;&#21069;SAR&#22270;&#20687;&#20013;&#26816;&#27979;&#33337;&#21482;&#30446;&#26631;&#65292;&#36825;&#20123;&#31639;&#27861;&#22522;&#20110;&#21508;&#31181;&#32479;&#35745;&#20998;&#24067;&#65292;&#22914;&#39640;&#26031;&#20998;&#24067;&#12289;Gamma&#20998;&#24067;&#12289;Weibull&#20998;&#24067;&#12289;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#12289;G0&#20998;&#24067;&#12289;alpha&#31283;&#23450;&#20998;&#24067;&#31561;&#12290;&#28982;&#32780;&#65292;SAR&#22270;&#20687;&#20013;&#30340;&#26434;&#25955;&#32972;&#26223;&#22797;&#26434;&#22810;&#21464;&#12290;&#24403;&#23454;&#38469;&#26434;&#25955;&#32972;&#26223;&#20559;&#31163;&#20551;&#23450;&#30340;&#32479;&#35745;&#20998;&#24067;&#26102;&#65292;&#21442;&#25968;&#21270;CFAR&#26816;&#27979;&#22120;&#30340;&#24615;&#33021;&#23558;&#19979;&#38477;&#12290;&#38500;&#20102;&#21442;&#25968;&#21270;CFAR&#26041;&#26696;&#65292;&#36824;&#26377;&#21478;&#19968;&#31867;&#38750;&#21442;&#25968;&#21270;CFAR&#26816;&#27979;&#22120;&#65292;&#21487;&#20197;&#22312;&#27809;&#26377;&#24050;&#30693;&#26434;&#27874;&#20998;&#24067;&#30340;&#20551;&#35774;&#24773;&#20917;&#19979;&#20445;&#25345;&#30446;&#26631;&#26816;&#27979;&#30340;&#24658;&#23450;&#34394;&#35686;&#29575;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#29992;&#20110;SAR&#22270;&#20687;&#20013;&#33337;&#21482;&#26816;&#27979;&#30340;Wilcoxon&#38750;&#21442;&#25968;&#21270;CFAR&#26041;&#26696;&#65292;&#24182;&#25512;&#23548;&#20102;Wilcoxon&#38750;&#21442;&#25968;&#26816;&#27979;&#22120;&#30340;&#34394;&#35686;&#29575;&#30340;&#23553;&#38381;&#24418;&#24335;&#20197;&#30830;&#23450;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.18579v1 Announce Type: cross  Abstract: The parametric constant false alarm rate (CFAR) detection algorithms which are based on various statistical distributions, such as Gaussian, Gamma, Weibull, log-normal, G0 distribution, alpha-stable distribution, etc, are most widely used to detect the ship targets in SAR image at present. However, the clutter background in SAR images is complicated and variable. When the actual clutter background deviates from the assumed statistical distribution, the performance of the parametric CFAR detector will deteriorate. In addition to the parametric CFAR schemes, there is another class of nonparametric CFAR detectors which can maintain a constant false alarm rate for the target detection without the assumption of a known clutter distribution. In this work, the Wilcoxon nonparametric CFAR scheme for ship detection in SAR image is proposed and analyzed, and a closed form of the false alarm rate for the Wilcoxon nonparametric detector to determi
&lt;/p&gt;</description></item></channel></rss>