<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#21644;&#31232;&#30095;VAR&#29305;&#27530;&#20998;&#37327;&#65292;&#37325;&#26032;&#20272;&#35745;&#20102;&#39640;&#32500;&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31995;&#32479;&#33539;&#22260;&#36830;&#36890;&#24230;&#65288;SWC&#65289;&#22312;&#20840;&#29699;&#21361;&#26426;&#26399;&#38388;&#24613;&#21095;&#19978;&#21319;&#65292;&#32780;&#35813;&#26041;&#27861;&#33021;&#22815;&#26368;&#23567;&#21270;&#23545;SWC&#20302;&#20272;&#30340;&#39118;&#38505;&#12290;</title><link>https://arxiv.org/abs/2402.02482</link><description>&lt;p&gt;
&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#30340;&#20877;&#25506;&#65306;&#20160;&#20040;&#26159;&#20849;&#21516;&#30340;&#65292;&#29305;&#27530;&#30340;&#21644;&#20309;&#26102;?
&lt;/p&gt;
&lt;p&gt;
Global bank network connectedness revisited: What is common, idiosyncratic and when?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02482
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#21644;&#31232;&#30095;VAR&#29305;&#27530;&#20998;&#37327;&#65292;&#37325;&#26032;&#20272;&#35745;&#20102;&#39640;&#32500;&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31995;&#32479;&#33539;&#22260;&#36830;&#36890;&#24230;&#65288;SWC&#65289;&#22312;&#20840;&#29699;&#21361;&#26426;&#26399;&#38388;&#24613;&#21095;&#19978;&#21319;&#65292;&#32780;&#35813;&#26041;&#27861;&#33021;&#22815;&#26368;&#23567;&#21270;&#23545;SWC&#20302;&#20272;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#20272;&#35745;&#39640;&#32500;&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#30340;&#38382;&#39064;&#12290;&#19982;Demirer&#31561;&#20154;&#65288;2018&#65289;&#30452;&#25509;&#23545;&#23454;&#29616;&#30340;&#39640;&#32500;&#27874;&#21160;&#24615;&#21521;&#37327;&#36827;&#34892;&#27491;&#21017;&#21270;&#19981;&#21516;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#19968;&#20010;&#20855;&#26377;&#31232;&#30095;VAR&#29305;&#27530;&#20998;&#37327;&#30340;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#12290;&#36825;&#26679;&#21487;&#20197;&#21306;&#20998;&#65306;&#65288;I&#65289;&#31995;&#32479;&#33539;&#22260;&#36830;&#36890;&#24230;&#65288;SWC&#65289;&#30001;&#20849;&#21516;&#25104;&#20998;&#20914;&#20987;&#24341;&#36215;&#30340;&#37096;&#20998;&#65288;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#38134;&#34892;&#24066;&#22330;&#8221;&#65289;&#65292;&#20197;&#21450;&#65288;II&#65289;&#30001;&#29305;&#27530;&#20914;&#20987;&#24341;&#36215;&#30340;&#37096;&#20998;&#65288;&#21333;&#20010;&#38134;&#34892;&#65289;&#12290;&#25105;&#20204;&#20351;&#29992;Demirer&#31561;&#20154;&#65288;2018&#65289;&#30340;&#21407;&#22987;&#25968;&#25454;&#38598;&#65288;&#27599;&#26085;&#25968;&#25454;&#65292;2003-2013&#65289;&#20197;&#21450;&#26356;&#26032;&#30340;&#25968;&#25454;&#38598;&#65288;2014-2023&#65289;&#12290;&#23545;&#20110;&#20004;&#32773;&#65292;&#25105;&#20204;&#35745;&#31639;&#30001;&#65288;I&#65289;&#65292;&#65288;II&#65289;&#65292;&#65288;I+II&#65289;&#20135;&#29983;&#30340;SWC&#65292;&#24182;&#25552;&#20379;&#33258;&#21161;&#27861;&#32622;&#20449;&#21306;&#38388;&#12290;&#19982;&#25991;&#29486;&#19968;&#33268;&#65292;&#25105;&#20204;&#21457;&#29616;SWC&#22312;&#20840;&#29699;&#21361;&#26426;&#26399;&#38388;&#29467;&#22686;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;SWC&#20302;&#20272;&#30340;&#39118;&#38505;&#38477;&#33267;&#26368;&#20302;&#65292;&#36825;&#22312;&#39640;&#32500;&#25968;&#25454;&#38598;&#20013;&#65292;&#31995;&#32479;&#39118;&#38505;&#30340;&#21457;&#29983;&#21487;&#33021;&#26082;&#26222;&#36941;&#21448;&#29305;&#27530;&#30340;&#24773;&#20917;&#19979;&#33267;&#20851;&#37325;&#35201;&#12290;&#23454;&#38469;&#19978;&#65292;&#25105;&#20204;&#33021;&#22815;&#21306;&#20998;&#20986;...
&lt;/p&gt;
&lt;p&gt;
We revisit the problem of estimating high-dimensional global bank network connectedness. Instead of directly regularizing the high-dimensional vector of realized volatilities as in Demirer et al. (2018), we estimate a dynamic factor model with sparse VAR idiosyncratic components. This allows to disentangle: (I) the part of system-wide connectedness (SWC) due to the common component shocks (what we call the "banking market"), and (II) the part due to the idiosyncratic shocks (the single banks). We employ both the original dataset as in Demirer et al. (2018) (daily data, 2003-2013), as well as a more recent vintage (2014-2023). For both, we compute SWC due to (I), (II), (I+II) and provide bootstrap confidence bands. In accordance with the literature, we find SWC to spike during global crises. However, our method minimizes the risk of SWC underestimation in high-dimensional datasets where episodes of systemic risk can be both pervasive and idiosyncratic. In fact, we are able to disentangl
&lt;/p&gt;</description></item></channel></rss>