<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>PQMass&#26159;&#19968;&#31181;&#20351;&#29992;&#27010;&#29575;&#36136;&#37327;&#20272;&#35745;&#26469;&#35780;&#20272;&#29983;&#25104;&#27169;&#22411;&#36136;&#37327;&#30340;&#20840;&#38754;&#26041;&#27861;&#65292;&#33021;&#22815;&#30452;&#25509;&#22788;&#29702;&#39640;&#32500;&#25968;&#25454;&#65292;&#19981;&#20381;&#36182;&#20110;&#20551;&#35774;&#25110;&#35757;&#32451;&#20854;&#20182;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2402.04355</link><description>&lt;p&gt;
PQMass: &#20351;&#29992;&#27010;&#29575;&#36136;&#37327;&#20272;&#35745;&#30340;&#29983;&#25104;&#27169;&#22411;&#36136;&#37327;&#30340;&#27010;&#29575;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
PQMass: Probabilistic Assessment of the Quality of Generative Models using Probability Mass Estimation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04355
&lt;/p&gt;
&lt;p&gt;
PQMass&#26159;&#19968;&#31181;&#20351;&#29992;&#27010;&#29575;&#36136;&#37327;&#20272;&#35745;&#26469;&#35780;&#20272;&#29983;&#25104;&#27169;&#22411;&#36136;&#37327;&#30340;&#20840;&#38754;&#26041;&#27861;&#65292;&#33021;&#22815;&#30452;&#25509;&#22788;&#29702;&#39640;&#32500;&#25968;&#25454;&#65292;&#19981;&#20381;&#36182;&#20110;&#20551;&#35774;&#25110;&#35757;&#32451;&#20854;&#20182;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20840;&#38754;&#30340;&#22522;&#20110;&#26679;&#26412;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#29983;&#25104;&#27169;&#22411;&#30340;&#36136;&#37327;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#33021;&#22815;&#20272;&#35745;&#20004;&#20010;&#26679;&#26412;&#38598;&#21512;&#26469;&#33258;&#21516;&#19968;&#20998;&#24067;&#30340;&#27010;&#29575;&#65292;&#20026;&#35780;&#20272;&#21333;&#20010;&#29983;&#25104;&#27169;&#22411;&#30340;&#24615;&#33021;&#25110;&#27604;&#36739;&#22312;&#21516;&#19968;&#25968;&#25454;&#38598;&#19978;&#35757;&#32451;&#30340;&#22810;&#20010;&#31454;&#20105;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#35745;&#19978;&#20005;&#26684;&#30340;&#26041;&#27861;&#12290;&#35813;&#27604;&#36739;&#21487;&#20197;&#36890;&#36807;&#23558;&#31354;&#38388;&#21010;&#20998;&#20026;&#38750;&#37325;&#21472;&#30340;&#21306;&#22495;&#24182;&#27604;&#36739;&#27599;&#20010;&#21306;&#22495;&#20013;&#30340;&#25968;&#25454;&#26679;&#26412;&#25968;&#37327;&#26469;&#36827;&#34892;&#12290;&#35813;&#26041;&#27861;&#20165;&#38656;&#35201;&#29983;&#25104;&#27169;&#22411;&#21644;&#27979;&#35797;&#25968;&#25454;&#30340;&#26679;&#26412;&#12290;&#23427;&#33021;&#22815;&#30452;&#25509;&#22788;&#29702;&#39640;&#32500;&#25968;&#25454;&#65292;&#26080;&#38656;&#38477;&#32500;&#12290;&#26174;&#33879;&#30340;&#26159;&#65292;&#35813;&#26041;&#27861;&#19981;&#20381;&#36182;&#20110;&#20851;&#20110;&#30495;&#23454;&#20998;&#24067;&#23494;&#24230;&#30340;&#20551;&#35774;&#65292;&#24182;&#19988;&#19981;&#20381;&#36182;&#20110;&#35757;&#32451;&#25110;&#25311;&#21512;&#20219;&#20309;&#36741;&#21161;&#27169;&#22411;&#12290;&#30456;&#21453;&#65292;&#23427;&#30528;&#37325;&#20110;&#36817;&#20284;&#35745;&#31639;&#23494;&#24230;&#30340;&#31215;&#20998;&#65288;&#27010;&#29575;&#36136;&#37327;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a comprehensive sample-based method for assessing the quality of generative models. The proposed approach enables the estimation of the probability that two sets of samples are drawn from the same distribution, providing a statistically rigorous method for assessing the performance of a single generative model or the comparison of multiple competing models trained on the same dataset. This comparison can be conducted by dividing the space into non-overlapping regions and comparing the number of data samples in each region. The method only requires samples from the generative model and the test data. It is capable of functioning directly on high-dimensional data, obviating the need for dimensionality reduction. Significantly, the proposed method does not depend on assumptions regarding the density of the true distribution, and it does not rely on training or fitting any auxiliary models. Instead, it focuses on approximating the integral of the density (probability mass) acros
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20811;&#26381;&#20272;&#35745;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;&#20013;&#25351;&#25968;&#32423;&#25903;&#25345;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#21015;&#32852;&#34920;&#27010;&#29575;&#20998;&#24067;&#30340;&#32771;&#34385;&#38598;&#27010;&#29575;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2308.12470</link><description>&lt;p&gt;
&#21487;&#20280;&#32553;&#20272;&#35745;&#20855;&#26377;&#19981;&#30830;&#23450;&#30340;&#36873;&#39033;&#38598;&#30340;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Scalable Estimation of Multinomial Response Models with Uncertain Consideration Sets. (arXiv:2308.12470v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12470
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20811;&#26381;&#20272;&#35745;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;&#20013;&#25351;&#25968;&#32423;&#25903;&#25345;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#21015;&#32852;&#34920;&#27010;&#29575;&#20998;&#24067;&#30340;&#32771;&#34385;&#38598;&#27010;&#29575;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20132;&#21449;&#25110;&#32437;&#21521;&#25968;&#25454;&#30340;&#26080;&#24207;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;&#25311;&#21512;&#20013;&#30340;&#19968;&#20010;&#26631;&#20934;&#20551;&#35774;&#26159;&#65292;&#21709;&#24212;&#26469;&#33258;&#20110;&#30456;&#21516;&#30340;J&#20010;&#31867;&#21035;&#38598;&#21512;&#12290;&#28982;&#32780;&#65292;&#24403;&#21709;&#24212;&#24230;&#37327;&#20027;&#20307;&#20570;&#20986;&#30340;&#36873;&#25321;&#26102;&#65292;&#26356;&#36866;&#21512;&#20551;&#35774;&#22810;&#39033;&#24335;&#21709;&#24212;&#30340;&#20998;&#24067;&#26159;&#22312;&#20027;&#20307;&#29305;&#23450;&#30340;&#32771;&#34385;&#38598;&#26465;&#20214;&#19979;&#65292;&#20854;&#20013;&#36825;&#20010;&#32771;&#34385;&#38598;&#26159;&#20174;{1,2, ..., J}&#30340;&#24130;&#38598;&#20013;&#25277;&#21462;&#30340;&#12290;&#30001;&#20110;&#36825;&#20010;&#24130;&#38598;&#30340;&#22522;&#25968;&#22312;J&#20013;&#26159;&#25351;&#25968;&#32423;&#30340;&#65292;&#19968;&#33324;&#26469;&#35828;&#20272;&#35745;&#26159;&#26080;&#27861;&#23454;&#29616;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#20811;&#26381;&#36825;&#20010;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#27493;&#39588;&#26159;&#22522;&#20110;&#22312;&#21015;&#32852;&#34920;&#19978;&#30340;&#27010;&#29575;&#20998;&#24067;&#30340;&#19968;&#33324;&#34920;&#31034;&#30340;&#32771;&#34385;&#38598;&#30340;&#27010;&#29575;&#27169;&#22411;&#12290;&#23613;&#31649;&#36825;&#20010;&#20998;&#24067;&#30340;&#25903;&#25345;&#26159;&#25351;&#25968;&#32423;&#22823;&#30340;&#65292;&#20294;&#32473;&#23450;&#21442;&#25968;&#30340;&#32771;&#34385;&#38598;&#30340;&#21518;&#39564;&#20998;&#24067;&#36890;&#24120;&#26159;&#31232;&#30095;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
A standard assumption in the fitting of unordered multinomial response models for J mutually exclusive nominal categories, on cross-sectional or longitudinal data, is that the responses arise from the same set of J categories between subjects. However, when responses measure a choice made by the subject, it is more appropriate to assume that the distribution of multinomial responses is conditioned on a subject-specific consideration set, where this consideration set is drawn from the power set of {1,2,...,J}. Because the cardinality of this power set is exponential in J, estimation is infeasible in general. In this paper, we provide an approach to overcoming this problem. A key step in the approach is a probability model over consideration sets, based on a general representation of probability distributions on contingency tables. Although the support of this distribution is exponentially large, the posterior distribution over consideration sets given parameters is typically sparse, and
&lt;/p&gt;</description></item></channel></rss>