<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#24341;&#20837;&#20061;&#31181;&#38598;&#25104;&#23398;&#20064;&#22120;&#24182;&#21033;&#29992;&#26032;&#39062;&#29305;&#24449;&#24037;&#31243;&#31574;&#30053;&#65292;&#32467;&#21512;&#22810;&#31181;&#20998;&#20301;&#25968;&#22238;&#24402;&#31639;&#27861;&#65292;&#22635;&#34917;&#20102;&#31354;&#38388;&#25554;&#20540;&#20013;&#38598;&#25104;&#23398;&#20064;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#39046;&#22495;&#30340;&#30740;&#31350;&#31354;&#30333;</title><link>https://arxiv.org/abs/2403.10567</link><description>&lt;p&gt;
&#38598;&#25104;&#23398;&#20064;&#20013;&#30340;&#21355;&#26143;&#38477;&#27700;&#31354;&#38388;&#25554;&#20540;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Uncertainty estimation in spatial interpolation of satellite precipitation with ensemble learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10567
&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20061;&#31181;&#38598;&#25104;&#23398;&#20064;&#22120;&#24182;&#21033;&#29992;&#26032;&#39062;&#29305;&#24449;&#24037;&#31243;&#31574;&#30053;&#65292;&#32467;&#21512;&#22810;&#31181;&#20998;&#20301;&#25968;&#22238;&#24402;&#31639;&#27861;&#65292;&#22635;&#34917;&#20102;&#31354;&#38388;&#25554;&#20540;&#20013;&#38598;&#25104;&#23398;&#20064;&#30340;&#19981;&#30830;&#23450;&#24615;&#20272;&#35745;&#39046;&#22495;&#30340;&#30740;&#31350;&#31354;&#30333;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10567v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#30340; &#25688;&#35201;&#65306;&#27010;&#29575;&#20998;&#24067;&#24418;&#24335;&#30340;&#39044;&#27979;&#23545;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#12290;&#20998;&#20301;&#25968;&#22238;&#24402;&#22312;&#31354;&#38388;&#25554;&#20540;&#35774;&#32622;&#20013;&#33021;&#22815;&#21512;&#24182;&#36965;&#24863;&#21644;&#38632;&#37327;&#25968;&#25454;&#65292;&#23454;&#29616;&#27492;&#30446;&#26631;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#24773;&#22659;&#19979;&#65292;&#20998;&#20301;&#25968;&#22238;&#24402;&#31639;&#27861;&#30340;&#38598;&#25104;&#23398;&#20064;&#23578;&#26410;&#34987;&#30740;&#31350;&#12290;&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#20061;&#31181;&#22522;&#20110;&#20998;&#20301;&#25968;&#30340;&#38598;&#25104;&#23398;&#20064;&#22120;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#22823;&#22411;&#38477;&#27700;&#25968;&#25454;&#38598;&#26469;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29305;&#24449;&#24037;&#31243;&#31574;&#30053;&#65292;&#23558;&#39044;&#27979;&#22240;&#23376;&#20943;&#23569;&#20026;&#30456;&#20851;&#20301;&#32622;&#30340;&#21152;&#26435;&#36317;&#31163;&#21355;&#26143;&#38477;&#27700;&#65292;&#32467;&#21512;&#20301;&#32622;&#39640;&#31243;&#12290;&#25105;&#20204;&#30340;&#38598;&#25104;&#23398;&#20064;&#22120;&#21253;&#25324;&#20845;&#31181;&#22534;&#21472;&#26041;&#27861;&#21644;&#19977;&#31181;&#31616;&#21333;&#26041;&#27861;&#65288;&#22343;&#20540;&#12289;&#20013;&#20301;&#25968;&#12289;&#26368;&#20339;&#32452;&#21512;&#22120;&#65289;&#65292;&#32467;&#21512;&#20102;&#20845;&#31181;&#20010;&#20307;&#31639;&#27861;&#65306;&#20998;&#20301;&#25968;&#22238;&#24402;(QR)&#12289;&#20998;&#20301;&#25968;&#22238;&#24402;&#26862;&#26519;(QRF)&#12289;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;(GRF)&#12289;&#26799;&#24230;&#25552;&#21319;&#26426;(GBM)&#12289;&#36731;&#37327;&#32423;&#26799;&#24230;&#25552;&#21319;&#26426;(LightGBM)&#21644;&#20998;&#20301;&#25968;&#22238;&#24402;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10567v1 Announce Type: new  Abstract: Predictions in the form of probability distributions are crucial for decision-making. Quantile regression enables this within spatial interpolation settings for merging remote sensing and gauge precipitation data. However, ensemble learning of quantile regression algorithms remains unexplored in this context. Here, we address this gap by introducing nine quantile-based ensemble learners and applying them to large precipitation datasets. We employed a novel feature engineering strategy, reducing predictors to distance-weighted satellite precipitation at relevant locations, combined with location elevation. Our ensemble learners include six stacking and three simple methods (mean, median, best combiner), combining six individual algorithms: quantile regression (QR), quantile regression forests (QRF), generalized random forests (GRF), gradient boosting machines (GBM), light gradient boosting machines (LightGBM), and quantile regression neur
&lt;/p&gt;</description></item><item><title>Yurinskii&#30340;&#32806;&#21512;&#26041;&#27861;&#22312;$\ell^p$-&#33539;&#25968;&#19979;&#25552;&#20379;&#20102;&#26356;&#24369;&#26465;&#20214;&#19979;&#30340;&#36924;&#36817;&#39532;&#19969;&#26684;&#23572;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#26356;&#19968;&#33324;&#30340;&#39640;&#26031;&#28151;&#21512;&#20998;&#24067;&#65292;&#24182;&#25552;&#20379;&#20102;&#31532;&#19977;&#38454;&#32806;&#21512;&#26041;&#27861;&#20197;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#33719;&#24471;&#26356;&#32039;&#23494;&#30340;&#36924;&#36817;&#12290;</title><link>https://arxiv.org/abs/2210.00362</link><description>&lt;p&gt;
Yurinskii&#30340;&#39532;&#19969;&#26684;&#23572;&#32806;&#21512;
&lt;/p&gt;
&lt;p&gt;
Yurinskii's Coupling for Martingales
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2210.00362
&lt;/p&gt;
&lt;p&gt;
Yurinskii&#30340;&#32806;&#21512;&#26041;&#27861;&#22312;$\ell^p$-&#33539;&#25968;&#19979;&#25552;&#20379;&#20102;&#26356;&#24369;&#26465;&#20214;&#19979;&#30340;&#36924;&#36817;&#39532;&#19969;&#26684;&#23572;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#26356;&#19968;&#33324;&#30340;&#39640;&#26031;&#28151;&#21512;&#20998;&#24067;&#65292;&#24182;&#25552;&#20379;&#20102;&#31532;&#19977;&#38454;&#32806;&#21512;&#26041;&#27861;&#20197;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#33719;&#24471;&#26356;&#32039;&#23494;&#30340;&#36924;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Yurinskii&#30340;&#32806;&#21512;&#26159;&#25968;&#23398;&#32479;&#35745;&#21644;&#24212;&#29992;&#27010;&#29575;&#20013;&#19968;&#31181;&#24120;&#29992;&#30340;&#38750;&#28176;&#36817;&#20998;&#24067;&#20998;&#26512;&#29702;&#35770;&#24037;&#20855;&#65292;&#25552;&#20379;&#20102;&#22312;&#26131;&#20110;&#39564;&#35777;&#26465;&#20214;&#19979;&#20855;&#26377;&#26174;&#24335;&#35823;&#24046;&#30028;&#38480;&#30340;&#39640;&#26031;&#24378;&#36924;&#36817;&#12290;&#26368;&#21021;&#22312;&#29420;&#31435;&#38543;&#26426;&#21521;&#37327;&#21644;&#20026;&#30340;$\ell^2$-&#33539;&#25968;&#20013;&#38472;&#36848;&#65292;&#26368;&#36817;&#24050;&#23558;&#20854;&#25193;&#23637;&#21040;$1 \leq p \leq \infty$&#26102;&#30340;$\ell^p$-&#33539;&#25968;&#65292;&#20197;&#21450;&#22312;&#26576;&#20123;&#24378;&#26465;&#20214;&#19979;&#30340;$\ell^2$-&#33539;&#25968;&#30340;&#21521;&#37327;&#20540;&#38789;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#22312;&#36828;&#27604;&#20043;&#21069;&#26045;&#21152;&#30340;&#26465;&#20214;&#26356;&#24369;&#30340;&#24773;&#20917;&#19979;&#65292;&#22312;$\ell^p$-&#33539;&#25968;&#19979;&#25552;&#20379;&#20102;&#36924;&#36817;&#39532;&#19969;&#26684;&#23572;&#30340;Yurinskii&#32806;&#21512;&#12290;&#25105;&#20204;&#30340;&#20844;&#24335;&#36827;&#19968;&#27493;&#20801;&#35768;&#32806;&#21512;&#21464;&#37327;&#36981;&#24490;&#26356;&#19968;&#33324;&#30340;&#39640;&#26031;&#28151;&#21512;&#20998;&#24067;&#65292;&#24182;&#19988;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31532;&#19977;&#38454;&#32806;&#21512;&#26041;&#27861;&#65292;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#25552;&#20379;&#26356;&#32039;&#23494;&#30340;&#36924;&#36817;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#19987;&#38376;&#24212;&#29992;&#20110;&#28151;&#21512;&#39532;&#19969;&#26684;&#23572;&#65292;&#39532;&#19969;&#26684;&#23572;&#21644;&#20854;&#20182;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2210.00362v2 Announce Type: replace-cross  Abstract: Yurinskii's coupling is a popular theoretical tool for non-asymptotic distributional analysis in mathematical statistics and applied probability, offering a Gaussian strong approximation with an explicit error bound under easily verified conditions. Originally stated in $\ell^2$-norm for sums of independent random vectors, it has recently been extended both to the $\ell^p$-norm, for $1 \leq p \leq \infty$, and to vector-valued martingales in $\ell^2$-norm, under some strong conditions. We present as our main result a Yurinskii coupling for approximate martingales in $\ell^p$-norm, under substantially weaker conditions than those previously imposed. Our formulation further allows for the coupling variable to follow a more general Gaussian mixture distribution, and we provide a novel third-order coupling method which gives tighter approximations in certain settings. We specialize our main result to mixingales, martingales, and in
&lt;/p&gt;</description></item></channel></rss>