<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#22810;&#32423;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#23558;&#32676;&#20307;&#25968;&#25454;&#35270;&#20026;&#25972;&#20307;&#26469;&#32771;&#34385;&#65292;&#24182;&#23558;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#21644;&#29289;&#29702;&#30693;&#35782;&#32534;&#30721;&#21040;&#27169;&#22411;&#20013;&#65292;&#20197;&#23454;&#29616;&#28304;&#20301;&#32622;&#30340;&#23450;&#20301;&#12290;</title><link>http://arxiv.org/abs/2305.08657</link><description>&lt;p&gt;
&#23558;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#32534;&#30721;&#21040;&#22810;&#32423;&#27169;&#22411;&#20013;&#29992;&#20110;&#28304;&#20301;&#32622;&#30340;&#23450;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;
Encoding Domain Expertise into Multilevel Models for Source Location. (arXiv:2305.08657v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36125;&#21494;&#26031;&#22810;&#32423;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#23558;&#32676;&#20307;&#25968;&#25454;&#35270;&#20026;&#25972;&#20307;&#26469;&#32771;&#34385;&#65292;&#24182;&#23558;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#21644;&#29289;&#29702;&#30693;&#35782;&#32534;&#30721;&#21040;&#27169;&#22411;&#20013;&#65292;&#20197;&#23454;&#29616;&#28304;&#20301;&#32622;&#30340;&#23450;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#24037;&#19994;&#24212;&#29992;&#20013;&#65292;&#32676;&#20307;&#25968;&#25454;&#26159;&#26222;&#36941;&#23384;&#22312;&#30340;&#12290;&#26426;&#22120;&#21644;&#22522;&#30784;&#35774;&#26045;&#36234;&#26469;&#36234;&#22810;&#22320;&#37197;&#22791;&#20102;&#20256;&#24863;&#31995;&#32479;&#65292;&#21457;&#20986;&#20855;&#26377;&#22797;&#26434;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#30340;&#36965;&#27979;&#25968;&#25454;&#27969;&#12290;&#23454;&#38469;&#19978;&#65292;&#25968;&#25454;&#20013;&#24515;&#30340;&#30417;&#27979;&#31243;&#24207;&#20542;&#21521;&#20110;&#23558;&#36825;&#20123;&#36164;&#20135;&#65288;&#20197;&#21450;&#21508;&#33258;&#30340;&#27169;&#22411;&#65289;&#35270;&#20026;&#19981;&#21516;&#30340;&#23454;&#20307; - &#29420;&#31435;&#36816;&#34892;&#24182;&#19982;&#29420;&#31435;&#25968;&#25454;&#30456;&#20851;&#32852;&#12290;&#30456;&#21453;&#65292;&#36825;&#39033;&#24037;&#20316;&#25429;&#25417;&#20102;&#19968;&#32452;&#31995;&#32479;&#27169;&#22411;&#20043;&#38388;&#30340;&#32479;&#35745;&#30456;&#20851;&#24615;&#21644;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#21033;&#29992;&#36125;&#21494;&#26031;&#22810;&#32423;&#26041;&#27861;&#65292;&#25968;&#25454;&#30340;&#20215;&#20540;&#21487;&#20197;&#24471;&#21040;&#25193;&#23637;&#65292;&#22240;&#20026;&#21487;&#20197;&#23558;&#20154;&#32676;&#20316;&#20026;&#19968;&#20010;&#25972;&#20307;&#26469;&#32771;&#34385;&#65292;&#32780;&#19981;&#26159;&#20316;&#20026;&#32452;&#25104;&#37096;&#20998;&#12290;&#26368;&#26377;&#36259;&#30340;&#26159;&#65292;&#39046;&#22495;&#19987;&#19994;&#30693;&#35782;&#21644;&#22522;&#30784;&#29289;&#29702;&#30693;&#35782;&#21487;&#20197;&#22312;&#31995;&#32479;&#12289;&#23376;&#32452;&#25110;&#20154;&#32676;&#27700;&#24179;&#19978;&#32534;&#30721;&#21040;&#27169;&#22411;&#20013;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#22768;&#21457;&#23556;&#65288;&#21040;&#36798;&#26102;&#38388;&#65289;&#26144;&#23556;&#28304;&#20301;&#32622;&#30340;&#31034;&#20363;&#65292;&#20197;&#35828;&#26126;&#22810;&#32423;&#27169;&#22411;&#22914;&#20309;&#33258;&#28982;&#22320;&#36866;&#29992;&#20110;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data from populations of systems are prevalent in many industrial applications. Machines and infrastructure are increasingly instrumented with sensing systems, emitting streams of telemetry data with complex interdependencies. In practice, data-centric monitoring procedures tend to consider these assets (and respective models) as distinct -- operating in isolation and associated with independent data. In contrast, this work captures the statistical correlations and interdependencies between models of a group of systems. Utilising a Bayesian multilevel approach, the value of data can be extended, since the population can be considered as a whole, rather than constituent parts. Most interestingly, domain expertise and knowledge of the underlying physics can be encoded in the model at the system, subgroup, or population level. We present an example of acoustic emission (time-of-arrival) mapping for source location, to illustrate how multilevel models naturally lend themselves to represent
&lt;/p&gt;</description></item></channel></rss>