<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#20247;&#21253;&#33258;&#36866;&#24212;&#35843;&#26597;&#26041;&#27861;&#65288;CSAS&#65289;&#32467;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#33258;&#36866;&#24212;&#31639;&#27861;&#65292;&#33021;&#22815;&#26681;&#25454;&#29992;&#25143;&#36755;&#20837;&#28436;&#21464;&#38382;&#39064;&#24211;&#65292;&#24182;&#22312;&#35843;&#26597;&#20013;&#36866;&#24212;&#26032;&#30340;&#38382;&#39064;&#65292;&#24212;&#29992;&#22312;&#25289;&#19969;&#35028;&#20449;&#24687;&#29615;&#22659;&#21644;&#35758;&#39064;&#37325;&#35201;&#24615;&#39046;&#22495;&#65292;&#33021;&#22815;&#35782;&#21035;&#38590;&#20197;&#36890;&#36807;&#20256;&#32479;&#26041;&#27861;&#36319;&#36394;&#30340;&#20027;&#24352;&#25110;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.12986</link><description>&lt;p&gt;
&#20247;&#21253;&#33258;&#36866;&#24212;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Crowdsourced Adaptive Surveys. (arXiv:2401.12986v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12986
&lt;/p&gt;
&lt;p&gt;
&#20247;&#21253;&#33258;&#36866;&#24212;&#35843;&#26597;&#26041;&#27861;&#65288;CSAS&#65289;&#32467;&#21512;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#33258;&#36866;&#24212;&#31639;&#27861;&#65292;&#33021;&#22815;&#26681;&#25454;&#29992;&#25143;&#36755;&#20837;&#28436;&#21464;&#38382;&#39064;&#24211;&#65292;&#24182;&#22312;&#35843;&#26597;&#20013;&#36866;&#24212;&#26032;&#30340;&#38382;&#39064;&#65292;&#24212;&#29992;&#22312;&#25289;&#19969;&#35028;&#20449;&#24687;&#29615;&#22659;&#21644;&#35758;&#39064;&#37325;&#35201;&#24615;&#39046;&#22495;&#65292;&#33021;&#22815;&#35782;&#21035;&#38590;&#20197;&#36890;&#36807;&#20256;&#32479;&#26041;&#27861;&#36319;&#36394;&#30340;&#20027;&#24352;&#25110;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#20247;&#33286;&#35770;&#35843;&#26597;&#23545;&#20110;&#27665;&#20027;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#23545;&#20110;&#20256;&#32479;&#35843;&#26597;&#26041;&#27861;&#26469;&#35828;&#65292;&#24555;&#36895;&#21464;&#21270;&#30340;&#20449;&#24687;&#29615;&#22659;&#21644;&#22312;&#23567;&#20247;&#31038;&#21306;&#20013;&#34913;&#37327;&#35266;&#28857;&#21487;&#33021;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20247;&#21253;&#33258;&#36866;&#24212;&#35843;&#26597;&#26041;&#27861;&#65288;CSAS&#65289;&#65292;&#23427;&#23558;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#21644;&#33258;&#36866;&#24212;&#31639;&#27861;&#30340;&#36827;&#23637;&#32467;&#21512;&#36215;&#26469;&#65292;&#29983;&#25104;&#38543;&#30528;&#29992;&#25143;&#36755;&#20837;&#19981;&#26029;&#28436;&#21464;&#30340;&#38382;&#39064;&#24211;&#12290;CSAS&#26041;&#27861;&#23558;&#21442;&#19982;&#32773;&#25552;&#20379;&#30340;&#24320;&#25918;&#24335;&#25991;&#26412;&#36716;&#25442;&#20026;Likert&#24335;&#39033;&#30446;&#65292;&#24182;&#24212;&#29992;&#22810;&#33218;&#36172;&#21338;&#31639;&#27861;&#26469;&#30830;&#23450;&#24212;&#20248;&#20808;&#32771;&#34385;&#22312;&#35843;&#26597;&#20013;&#30340;&#29992;&#25143;&#25552;&#20379;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#30340;&#33258;&#36866;&#24212;&#24615;&#20801;&#35768;&#25506;&#32034;&#26032;&#30340;&#35843;&#26597;&#38382;&#39064;&#65292;&#21516;&#26102;&#22312;&#35843;&#26597;&#38271;&#24230;&#19978;&#26045;&#21152;&#26368;&#23567;&#30340;&#25104;&#26412;&#12290;&#22312;&#25289;&#19969;&#35028;&#20449;&#24687;&#29615;&#22659;&#21644;&#35758;&#39064;&#37325;&#35201;&#24615;&#39046;&#22495;&#30340;&#24212;&#29992;&#23637;&#31034;&#20102;CSAS&#35782;&#21035;&#21487;&#33021;&#38590;&#20197;&#36890;&#36807;&#26631;&#20934;&#26041;&#27861;&#36319;&#36394;&#30340;&#20027;&#24352;&#25110;&#38382;&#39064;&#30340;&#33021;&#21147;&#12290;&#26368;&#21518;&#65292;&#25105;&#25552;&#20986; Conclusion by di&#30340;&#32467;&#26463;&#35821;&#12290;
&lt;/p&gt;
&lt;p&gt;
Public opinion surveys are vital for informing democratic decision-making, but responding to rapidly changing information environments and measuring beliefs within niche communities can be challenging for traditional survey methods. This paper introduces a crowdsourced adaptive survey methodology (CSAS) that unites advances in natural language processing and adaptive algorithms to generate question banks that evolve with user input. The CSAS method converts open-ended text provided by participants into Likert-style items and applies a multi-armed bandit algorithm to determine user-provided questions that should be prioritized in the survey. The method's adaptive nature allows for the exploration of new survey questions, while imposing minimal costs in survey length. Applications in the domains of Latino information environments and issue importance showcase CSAS's ability to identify claims or issues that might otherwise be difficult to track using standard approaches. I conclude by di
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#21464;&#25442;&#30340;&#26032;&#22411;&#32479;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20132;&#36890;&#24066;&#22330;&#21033;&#29575;&#30340;&#39044;&#27979;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#36890;&#29992;&#30340;&#38750;&#32447;&#24615;&#23646;&#24615;&#21644;&#29305;&#24449;&#21464;&#25442;&#26680;&#20989;&#25968;&#65292;&#33021;&#22815;&#39640;&#25928;&#29983;&#25104;&#29305;&#24449;&#65292;&#24182;&#22312;&#39044;&#27979;&#36807;&#31243;&#20013;&#20934;&#30830;&#35782;&#21035;&#23395;&#33410;&#24615;&#21644;&#21046;&#24230;&#36716;&#25442;&#12290;</title><link>http://arxiv.org/abs/2401.04857</link><description>&lt;p&gt;
&#20351;&#29992;&#29305;&#24449;&#21464;&#25442;&#36827;&#34892;&#20132;&#36890;&#24066;&#22330;&#21033;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Transportation Market Rate Forecast Using Signature Transform. (arXiv:2401.04857v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04857
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#21464;&#25442;&#30340;&#26032;&#22411;&#32479;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#20132;&#36890;&#24066;&#22330;&#21033;&#29575;&#30340;&#39044;&#27979;&#25361;&#25112;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#36890;&#29992;&#30340;&#38750;&#32447;&#24615;&#23646;&#24615;&#21644;&#29305;&#24449;&#21464;&#25442;&#26680;&#20989;&#25968;&#65292;&#33021;&#22815;&#39640;&#25928;&#29983;&#25104;&#29305;&#24449;&#65292;&#24182;&#22312;&#39044;&#27979;&#36807;&#31243;&#20013;&#20934;&#30830;&#35782;&#21035;&#23395;&#33410;&#24615;&#21644;&#21046;&#24230;&#36716;&#25442;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#65292;&#20122;&#39532;&#36874;&#22312;&#20132;&#36890;&#24066;&#22330;&#21033;&#29575;&#39044;&#27979;&#19978;&#20381;&#36182;&#31532;&#19977;&#26041;&#65292;&#23613;&#31649;&#36825;&#20123;&#39044;&#27979;&#36136;&#37327;&#24046;&#19988;&#32570;&#20047;&#21487;&#35299;&#37322;&#24615;&#12290;&#34429;&#28982;&#20132;&#36890;&#24066;&#22330;&#21033;&#29575;&#36890;&#24120;&#24456;&#38590;&#20934;&#30830;&#39044;&#27979;&#65292;&#20294;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#29305;&#24449;&#21464;&#25442;&#30340;&#26032;&#22411;&#32479;&#35745;&#25216;&#26415;&#26469;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#24182;&#26500;&#24314;&#20102;&#19968;&#20010;&#39044;&#27979;&#21644;&#33258;&#36866;&#24212;&#27169;&#22411;&#26469;&#39044;&#27979;&#24066;&#22330;&#21033;&#29575;&#12290;&#36825;&#31181;&#26032;&#25216;&#26415;&#22522;&#20110;&#29305;&#24449;&#21464;&#25442;&#30340;&#20004;&#20010;&#20851;&#38190;&#23646;&#24615;&#12290;&#31532;&#19968;&#20010;&#26159;&#20854;&#36890;&#29992;&#30340;&#38750;&#32447;&#24615;&#65292;&#23427;&#32447;&#24615;&#21270;&#29305;&#24449;&#31354;&#38388;&#65292;&#20174;&#32780;&#23558;&#39044;&#27979;&#38382;&#39064;&#36716;&#21270;&#20026;&#32447;&#24615;&#22238;&#24402;&#20998;&#26512;&#65307;&#31532;&#20108;&#20010;&#26159;&#29305;&#24449;&#21464;&#25442;&#26680;&#20989;&#25968;&#65292;&#23427;&#20801;&#35768;&#22312;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#20043;&#38388;&#36827;&#34892;&#35745;&#31639;&#26377;&#25928;&#30340;&#30456;&#20284;&#24615;&#27604;&#36739;&#12290;&#32467;&#21512;&#36215;&#26469;&#65292;&#36825;&#20123;&#23646;&#24615;&#20801;&#35768;&#36827;&#34892;&#39640;&#25928;&#30340;&#29305;&#24449;&#29983;&#25104;&#65292;&#24182;&#22312;&#39044;&#27979;&#36807;&#31243;&#20013;&#26356;&#31934;&#30830;&#22320;&#35782;&#21035;&#23395;&#33410;&#24615;&#21644;&#21046;&#24230;&#36716;&#25442;&#12290;&#27169;&#22411;&#30340;&#21021;&#27493;&#32467;&#26524;&#26174;&#31034;&#65292;&#36825;&#31181;&#26032;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24066;&#22330;&#21033;&#29575;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Currently, Amazon relies on third parties for transportation marketplace rate forecasts, despite the poor quality and lack of interpretability of these forecasts. While transportation marketplace rates are typically very challenging to forecast accurately, we have developed a novel signature-based statistical technique to address these challenges and built a predictive and adaptive model to forecast marketplace rates. This novel technique is based on two key properties of the signature transform. The first is its universal nonlinearity which linearizes the feature space and hence translates the forecasting problem into a linear regression analysis; the second is the signature kernel which allows for comparing computationally efficiently similarities between time series data. Combined, these properties allow for efficient feature generation and more precise identification of seasonality and regime switching in the forecasting process. Preliminary result by the model shows that this new 
&lt;/p&gt;</description></item></channel></rss>