<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#23545;&#20110;&#22240;&#26524;&#26426;&#21046;&#30340;&#25512;&#26029;&#65292;&#24182;&#25351;&#20986;&#20102;&#23384;&#22312;&#30340;&#25361;&#25112;&#21644;&#23616;&#38480;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.01566</link><description>&lt;p&gt;
&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;&#22240;&#26524;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Heterogeneous Treatment Effects and Causal Mechanisms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01566
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#23545;&#20110;&#22240;&#26524;&#26426;&#21046;&#30340;&#25512;&#26029;&#65292;&#24182;&#25351;&#20986;&#20102;&#23384;&#22312;&#30340;&#25361;&#25112;&#21644;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01566v1 &#20844;&#21578;&#31867;&#22411;:&#26032;&#25688;&#35201;:&#21487;&#20449;&#24230;&#38761;&#21629;&#25512;&#21160;&#20102;&#21033;&#29992;&#30740;&#31350;&#35774;&#35745;&#26469;&#35782;&#21035;&#21644;&#20272;&#35745;&#22240;&#26524;&#25928;&#24212;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#20102;&#35299;&#21738;&#20123;&#26426;&#21046;&#20135;&#29983;&#20102;&#27979;&#37327;&#30340;&#22240;&#26524;&#25928;&#24212;&#20173;&#28982;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#30446;&#21069;&#20851;&#20110;&#23450;&#37327;&#35780;&#20272;&#26426;&#21046;&#30340;&#20027;&#35201;&#26041;&#27861;&#20381;&#36182;&#20110;&#26816;&#27979;&#19982;&#22788;&#29702;&#21069;&#21327;&#21464;&#37327;&#30456;&#20851;&#30340;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#29702;&#35299;&#22312;&#20309;&#31181;&#24773;&#20917;&#19979;&#36825;&#31181;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#30340;&#23384;&#22312;&#33021;&#22815;&#25903;&#25345;&#26377;&#20851;&#26426;&#21046;&#28608;&#27963;&#30340;&#25512;&#26029;&#12290;&#25105;&#20204;&#39318;&#20808;&#23637;&#31034;&#65292;&#36825;&#31181;&#35774;&#35745;&#22312;&#27809;&#26377;&#39069;&#22806;&#12289;&#36890;&#24120;&#26159;&#38544;&#21547;&#30340;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#26080;&#27861;&#20026;&#26426;&#21046;&#28608;&#27963;&#25552;&#20379;&#35777;&#25454;&#12290;&#27492;&#22806;&#65292;&#21363;&#20351;&#36825;&#20123;&#20551;&#35774;&#24471;&#21040;&#28385;&#36275;&#65292;&#22914;&#26524;&#19968;&#20010;&#27979;&#37327;&#32467;&#26524;&#26159;&#36890;&#36807;&#30452;&#25509;&#21463;&#24433;&#21709;&#30340;&#24863;&#20852;&#36259;&#29702;&#35770;&#32467;&#26524;&#30340;&#38750;&#32447;&#24615;&#36716;&#25442;&#20135;&#29983;&#30340;&#65292;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#20063;&#19981;&#36275;&#20197;&#25512;&#26029;&#26426;&#21046;&#28608;&#27963;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;n
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01566v1 Announce Type: new  Abstract: The credibility revolution advances the use of research designs that permit identification and estimation of causal effects. However, understanding which mechanisms produce measured causal effects remains a challenge. A dominant current approach to the quantitative evaluation of mechanisms relies on the detection of heterogeneous treatment effects with respect to pre-treatment covariates. This paper develops a framework to understand when the existence of such heterogeneous treatment effects can support inferences about the activation of a mechanism. We show first that this design cannot provide evidence of mechanism activation without additional, generally implicit, assumptions. Further, even when these assumptions are satisfied, if a measured outcome is produced by a non-linear transformation of a directly-affected outcome of theoretical interest, heterogeneous treatment effects are not informative of mechanism activation. We provide n
&lt;/p&gt;</description></item></channel></rss>