<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;logistic-beta&#36807;&#31243;&#29992;&#20110;&#24314;&#27169;&#20855;&#26377;beta&#36793;&#38469;&#20998;&#24067;&#30340;&#30456;&#20851;&#38543;&#26426;&#27010;&#29575;&#12290;&#35813;&#36807;&#31243;&#20855;&#26377;&#28789;&#27963;&#30340;&#30456;&#20851;&#32467;&#26500;&#21644;&#35745;&#31639;&#20248;&#21183;&#65292;&#24182;&#36890;&#36807;&#38750;&#21442;&#25968;&#20108;&#20998;&#31867;&#22238;&#24402;&#27169;&#25311;&#30740;&#31350;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;</title><link>https://arxiv.org/abs/2402.07048</link><description>&lt;p&gt;
&#29992;&#20110;&#24314;&#27169;&#20855;&#26377;beta&#36793;&#38469;&#20998;&#24067;&#30340;&#30456;&#20851;&#38543;&#26426;&#27010;&#29575;&#30340;logistic-beta&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Logistic-beta processes for modeling dependent random probabilities with beta marginals
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07048
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;logistic-beta&#36807;&#31243;&#29992;&#20110;&#24314;&#27169;&#20855;&#26377;beta&#36793;&#38469;&#20998;&#24067;&#30340;&#30456;&#20851;&#38543;&#26426;&#27010;&#29575;&#12290;&#35813;&#36807;&#31243;&#20855;&#26377;&#28789;&#27963;&#30340;&#30456;&#20851;&#32467;&#26500;&#21644;&#35745;&#31639;&#20248;&#21183;&#65292;&#24182;&#36890;&#36807;&#38750;&#21442;&#25968;&#20108;&#20998;&#31867;&#22238;&#24402;&#27169;&#25311;&#30740;&#31350;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
beta&#20998;&#24067;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#27010;&#29575;&#24314;&#27169;&#65292;&#24182;&#22312;&#32479;&#35745;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#20013;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#23588;&#20854;&#22312;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#39046;&#22495;&#12290;&#23613;&#31649;&#20854;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#22312;&#24314;&#27169;&#30456;&#20851;&#38543;&#26426;&#27010;&#29575;&#30340;&#28789;&#27963;&#21644;&#35745;&#31639;&#26041;&#20415;&#30340;&#38543;&#26426;&#36807;&#31243;&#25193;&#23637;&#26041;&#38754;&#65292;&#30456;&#20851;&#24037;&#20316;&#26377;&#38480;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38543;&#26426;&#36807;&#31243;&#65292;&#31216;&#20026;logistic-beta&#36807;&#31243;&#65292;&#20854;logistic&#21464;&#25442;&#29983;&#25104;&#20855;&#26377;&#24120;&#35265;beta&#36793;&#38469;&#20998;&#24067;&#30340;&#38543;&#26426;&#36807;&#31243;&#12290;&#31867;&#20284;&#20110;&#39640;&#26031;&#36807;&#31243;&#65292;logistic-beta&#36807;&#31243;&#21487;&#20197;&#24314;&#27169;&#31163;&#25955;&#21644;&#36830;&#32493;&#22495;&#65288;&#20363;&#22914;&#31354;&#38388;&#25110;&#26102;&#38388;&#65289;&#19978;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#36890;&#36807;&#30456;&#20851;&#26680;&#20989;&#25968;&#20855;&#26377;&#39640;&#24230;&#28789;&#27963;&#30340;&#30456;&#20851;&#32467;&#26500;&#12290;&#27492;&#22806;&#65292;&#23427;&#30340;&#27491;&#24577;&#26041;&#24046;-&#22343;&#20540;&#28151;&#21512;&#34920;&#31034;&#23548;&#33268;&#20102;&#39640;&#25928;&#30340;&#21518;&#39564;&#25512;&#29702;&#31639;&#27861;&#12290;&#36890;&#36807;&#38750;&#21442;&#25968;&#20108;&#20998;&#31867;&#22238;&#24402;&#27169;&#25311;&#30740;&#31350;&#65292;&#23637;&#31034;&#20102;logistic-beta&#36807;&#31243;&#30340;&#28789;&#27963;&#24615;&#21644;&#35745;&#31639;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
The beta distribution serves as a canonical tool for modeling probabilities and is extensively used in statistics and machine learning, especially in the field of Bayesian nonparametrics. Despite its widespread use, there is limited work on flexible and computationally convenient stochastic process extensions for modeling dependent random probabilities. We propose a novel stochastic process called the logistic-beta process, whose logistic transformation yields a stochastic process with common beta marginals. Similar to the Gaussian process, the logistic-beta process can model dependence on both discrete and continuous domains, such as space or time, and has a highly flexible dependence structure through correlation kernels. Moreover, its normal variance-mean mixture representation leads to highly effective posterior inference algorithms. The flexibility and computational benefits of logistic-beta processes are demonstrated through nonparametric binary regression simulation studies. Fur
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23384;&#22312;&#28151;&#28102;&#25928;&#24212;&#26102;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#22823;&#35268;&#27169;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#27491;&#20132;&#32467;&#26500;&#21644;&#32447;&#24615;&#25237;&#24433;&#30340;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#30001;&#20110;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#24341;&#36215;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.07261</link><description>&lt;p&gt;
&#20855;&#26377;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#21516;&#26102;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Simultaneous inference for generalized linear models with unmeasured confounders. (arXiv:2309.07261v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07261
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23384;&#22312;&#28151;&#28102;&#25928;&#24212;&#26102;&#30340;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#22823;&#35268;&#27169;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#27491;&#20132;&#32467;&#26500;&#21644;&#32447;&#24615;&#25237;&#24433;&#30340;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#30001;&#20110;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#24341;&#36215;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22522;&#22240;&#32452;&#30740;&#31350;&#20013;&#65292;&#24120;&#24120;&#36827;&#34892;&#25104;&#21315;&#19978;&#19975;&#20010;&#21516;&#26102;&#20551;&#35774;&#26816;&#39564;&#65292;&#20197;&#30830;&#23450;&#24046;&#24322;&#34920;&#36798;&#30340;&#22522;&#22240;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#23384;&#22312;&#26410;&#27979;&#28151;&#28102;&#22240;&#32032;&#65292;&#35768;&#22810;&#26631;&#20934;&#32479;&#35745;&#26041;&#27861;&#21487;&#33021;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#24046;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#23384;&#22312;&#28151;&#28102;&#25928;&#24212;&#26102;&#30340;&#22810;&#20803;&#24191;&#20041;&#32447;&#24615;&#27169;&#22411;&#30340;&#22823;&#35268;&#27169;&#20551;&#35774;&#26816;&#39564;&#38382;&#39064;&#12290;&#22312;&#20219;&#24847;&#28151;&#28102;&#26426;&#21046;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#32479;&#35745;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#27491;&#20132;&#32467;&#26500;&#24182;&#23558;&#32447;&#24615;&#25237;&#24433;&#25972;&#21512;&#21040;&#19977;&#20010;&#20851;&#38190;&#38454;&#27573;&#20013;&#12290;&#39318;&#20808;&#65292;&#21033;&#29992;&#22810;&#20803;&#21709;&#24212;&#21464;&#37327;&#20998;&#31163;&#36793;&#38469;&#21644;&#19981;&#30456;&#20851;&#30340;&#28151;&#28102;&#25928;&#24212;&#65292;&#24674;&#22797;&#28151;&#28102;&#31995;&#25968;&#30340;&#21015;&#31354;&#38388;&#12290;&#38543;&#21518;&#65292;&#21033;&#29992;$\ell_1$&#27491;&#21017;&#21270;&#36827;&#34892;&#31232;&#30095;&#24615;&#20272;&#35745;&#65292;&#24182;&#24378;&#21152;&#27491;&#20132;&#24615;&#38480;&#21046;&#20110;&#28151;&#28102;&#31995;&#25968;&#65292;&#32852;&#21512;&#20272;&#35745;&#28508;&#22312;&#22240;&#23376;&#21644;&#20027;&#35201;&#25928;&#24212;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32467;&#21512;&#25237;&#24433;&#21644;&#21152;&#26435;&#20559;&#24046;&#26657;&#27491;&#27493;&#39588;&#12290;
&lt;/p&gt;
&lt;p&gt;
Tens of thousands of simultaneous hypothesis tests are routinely performed in genomic studies to identify differentially expressed genes. However, due to unmeasured confounders, many standard statistical approaches may be substantially biased. This paper investigates the large-scale hypothesis testing problem for multivariate generalized linear models in the presence of confounding effects. Under arbitrary confounding mechanisms, we propose a unified statistical estimation and inference framework that harnesses orthogonal structures and integrates linear projections into three key stages. It first leverages multivariate responses to separate marginal and uncorrelated confounding effects, recovering the confounding coefficients' column space. Subsequently, latent factors and primary effects are jointly estimated, utilizing $\ell_1$-regularization for sparsity while imposing orthogonality onto confounding coefficients. Finally, we incorporate projected and weighted bias-correction steps 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#31616;&#21333;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#12290;&#36890;&#36807;&#24341;&#20837;&#24207;&#36143;&#26680;&#23884;&#20837;&#25216;&#26415;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#23545;&#22797;&#26434;&#22240;&#26524;&#20272;&#35745;&#30340;&#31616;&#21270;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#20272;&#35745;&#32467;&#26524;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#24378;&#22823;&#24615;&#33021;&#21644;&#26222;&#36866;&#24615;&#12290;</title><link>http://arxiv.org/abs/2111.03950</link><description>&lt;p&gt;
&#24207;&#36143;&#26680;&#23884;&#20837;&#29992;&#20110;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;
&lt;/p&gt;
&lt;p&gt;
Sequential Kernel Embedding for Mediated and Time-Varying Dose Response Curves. (arXiv:2111.03950v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.03950
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#31616;&#21333;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#12290;&#36890;&#36807;&#24341;&#20837;&#24207;&#36143;&#26680;&#23884;&#20837;&#25216;&#26415;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#23545;&#22797;&#26434;&#22240;&#26524;&#20272;&#35745;&#30340;&#31616;&#21270;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#20272;&#35745;&#32467;&#26524;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#24378;&#22823;&#24615;&#33021;&#21644;&#26222;&#36866;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#30340;&#31616;&#21333;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#12290;&#36890;&#36807;&#23884;&#20837;Pearl&#30340;&#20171;&#23548;&#20844;&#24335;&#21644;Robins&#30340;g&#20844;&#24335;&#19982;&#26680;&#20989;&#25968;&#65292;&#25105;&#20204;&#20801;&#35768;&#22788;&#29702;&#12289;&#20171;&#23548;&#32773;&#21644;&#21327;&#21464;&#37327;&#22312;&#19968;&#33324;&#31354;&#38388;&#20013;&#36830;&#32493;&#21464;&#21270;&#65292;&#20063;&#20801;&#35768;&#38750;&#32447;&#24615;&#30340;&#22788;&#29702;-&#28151;&#28102;&#22240;&#32032;&#21453;&#39304;&#12290;&#25105;&#20204;&#30340;&#20851;&#38190;&#21019;&#26032;&#26159;&#19968;&#31181;&#31216;&#20026;&#24207;&#36143;&#26680;&#23884;&#20837;&#30340;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#25216;&#26415;&#65292;&#25105;&#20204;&#20351;&#29992;&#23427;&#26469;&#26500;&#24314;&#22797;&#26434;&#22240;&#26524;&#20272;&#35745;&#30340;&#31616;&#21333;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20445;&#30041;&#20102;&#32463;&#20856;&#35782;&#21035;&#30340;&#26222;&#36866;&#24615;&#65292;&#21516;&#26102;&#23454;&#29616;&#20102;&#38750;&#28176;&#36827;&#22343;&#21248;&#25910;&#25947;&#36895;&#24230;&#12290;&#22312;&#20855;&#26377;&#35768;&#22810;&#21327;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#24378;&#22823;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#20272;&#35745;&#20102;&#32654;&#22269;&#32844;&#19994;&#35757;&#32451;&#22242;&#30340;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#65292;&#24182;&#28165;&#27905;&#21487;&#33021;&#25104;&#20026;&#26410;&#26469;&#24037;&#20316;&#22522;&#20934;&#30340;&#25968;&#25454;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#25512;&#24191;&#21040;&#20171;&#23548;&#21644;&#26102;&#21464;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#21453;&#20107;&#23454;&#20998;&#24067;&#65292;&#39564;&#35777;&#20102;&#21322;&#21442;&#25968;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose simple nonparametric estimators for mediated and time-varying dose response curves based on kernel ridge regression. By embedding Pearl's mediation formula and Robins' g-formula with kernels, we allow treatments, mediators, and covariates to be continuous in general spaces, and also allow for nonlinear treatment-confounder feedback. Our key innovation is a reproducing kernel Hilbert space technique called sequential kernel embedding, which we use to construct simple estimators for complex causal estimands. Our estimators preserve the generality of classic identification while also achieving nonasymptotic uniform rates. In nonlinear simulations with many covariates, we demonstrate strong performance. We estimate mediated and time-varying dose response curves of the US Job Corps, and clean data that may serve as a benchmark in future work. We extend our results to mediated and time-varying treatment effects and counterfactual distributions, verifying semiparametric efficiency 
&lt;/p&gt;</description></item></channel></rss>