<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>DR-VIDAL&#26159;&#19968;&#20010;&#26032;&#22411;&#30340;&#29983;&#25104;&#26694;&#26550;&#65292;&#21487;&#29992;&#20110;&#22788;&#29702;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#20013;&#30340;&#24178;&#39044;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#65292;&#24182;&#20855;&#26377;&#22788;&#29702;&#28151;&#28102;&#20559;&#24046;&#21644;&#27169;&#22411;&#19981;&#33391;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2303.04201</link><description>&lt;p&gt;
DR-VIDAL--&#21452;&#37325;&#31283;&#20581;&#21464;&#20998;&#20449;&#24687;&#35770;&#28145;&#24230;&#23545;&#25239;&#23398;&#20064;&#29992;&#20110;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#30340;&#21453;&#20107;&#23454;&#39044;&#27979;&#21644;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
DR-VIDAL -- Doubly Robust Variational Information-theoretic Deep Adversarial Learning for Counterfactual Prediction and Treatment Effect Estimation on Real World Data. (arXiv:2303.04201v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.04201
&lt;/p&gt;
&lt;p&gt;
DR-VIDAL&#26159;&#19968;&#20010;&#26032;&#22411;&#30340;&#29983;&#25104;&#26694;&#26550;&#65292;&#21487;&#29992;&#20110;&#22788;&#29702;&#30495;&#23454;&#19990;&#30028;&#25968;&#25454;&#20013;&#30340;&#24178;&#39044;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#65292;&#24182;&#20855;&#26377;&#22788;&#29702;&#28151;&#28102;&#20559;&#24046;&#21644;&#27169;&#22411;&#19981;&#33391;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20174;&#30495;&#23454;&#19990;&#30028;&#30340;&#35266;&#23519;&#24615;&#65288;&#38750;&#38543;&#26426;&#21270;&#65289;&#25968;&#25454;&#20013;&#30830;&#23450;&#24178;&#39044;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#20363;&#22914;&#20351;&#29992;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#30340;&#27835;&#30103;&#37325;&#29992;&#65292;&#30001;&#20110;&#28508;&#22312;&#20559;&#24046;&#32780;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22240;&#26524;&#28145;&#24230;&#23398;&#20064;&#24050;&#32463;&#25913;&#36827;&#20102;&#20256;&#32479;&#25216;&#26415;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#24615;&#21270;&#27835;&#30103;&#25928;&#26524;&#65288;ITE&#65289;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#21452;&#37325;&#31283;&#20581;&#21464;&#20998;&#20449;&#24687;&#35770;&#28145;&#24230;&#23545;&#25239;&#23398;&#20064;&#65288;DR-VIDAL&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#32467;&#21512;&#20102;&#27835;&#30103;&#21644;&#32467;&#26524;&#20004;&#20010;&#32852;&#21512;&#27169;&#22411;&#30340;&#26032;&#22411;&#29983;&#25104;&#26694;&#26550;&#65292;&#30830;&#20445;&#26080;&#20559;&#30340;ITE&#20272;&#35745;&#65292;&#21363;&#20351;&#20854;&#20013;&#19968;&#20010;&#27169;&#22411;&#35774;&#23450;&#19981;&#27491;&#30830;&#12290;DR-VIDAL&#25972;&#21512;&#20102;&#65306; &#65288;i&#65289;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;VAE&#65289;&#26681;&#25454;&#22240;&#26524;&#20551;&#35774;&#23558;&#28151;&#28102;&#21464;&#37327;&#20998;&#35299;&#20026;&#28508;&#22312;&#21464;&#37327;; &#65288;ii&#65289;&#22522;&#20110;&#20449;&#24687;&#35770;&#30340;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;Info-GAN&#65289;&#29992;&#20110;&#29983;&#25104;&#21453;&#20107;&#23454;&#24773;&#20917;; &#65288;iii&#65289;&#19968;&#20010;&#21452;&#37325;&#31283;&#20581;&#22359;&#65292;&#20854;&#20013;&#21253;&#25324;&#27835;&#30103;&#20542;&#21521;&#20110;&#39044;&#27979;&#32467;&#26524;&#12290;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#65288;Infant Health&#21644;Development Program&#65292;Transforming Clinical Practice Initiative [TCPI]&#65289;&#20013;&#36827;&#34892;&#23454;&#39564;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;DR-VIDAL&#22312;&#20272;&#35745;ITE&#26041;&#38754;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#20855;&#26377;&#22788;&#29702;&#28151;&#28102;&#20559;&#24046;&#21644;&#27169;&#22411;&#19981;&#27491;&#30830;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Determining causal effects of interventions onto outcomes from real-world, observational (non-randomized) data, e.g., treatment repurposing using electronic health records, is challenging due to underlying bias. Causal deep learning has improved over traditional techniques for estimating individualized treatment effects (ITE). We present the Doubly Robust Variational Information-theoretic Deep Adversarial Learning (DR-VIDAL), a novel generative framework that combines two joint models of treatment and outcome, ensuring an unbiased ITE estimation even when one of the two is misspecified. DR-VIDAL integrates: (i) a variational autoencoder (VAE) to factorize confounders into latent variables according to causal assumptions; (ii) an information-theoretic generative adversarial network (Info-GAN) to generate counterfactuals; (iii) a doubly robust block incorporating treatment propensities for outcome predictions. On synthetic and real-world datasets (Infant Health and Development Program, T
&lt;/p&gt;</description></item></channel></rss>