<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#32452;&#22810;&#20803;&#20989;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#20854;&#20013;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#26469;&#35299;&#20915;&#19981;&#21516;&#20989;&#25968;&#21327;&#21464;&#37327;&#30340;&#28508;&#22312;&#21516;&#36136;&#24615;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2312.01925</link><description>&lt;p&gt;
&#22312;&#22810;&#20803;&#20989;&#25968;&#22238;&#24402;&#20013;&#30340;&#31995;&#25968;&#24418;&#29366;&#23545;&#40784;
&lt;/p&gt;
&lt;p&gt;
Coefficient Shape Alignment in Multivariate Functional Regression. (arXiv:2312.01925v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.01925
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#32452;&#22810;&#20803;&#20989;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#20854;&#20013;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#26469;&#35299;&#20915;&#19981;&#21516;&#20989;&#25968;&#21327;&#21464;&#37327;&#30340;&#28508;&#22312;&#21516;&#36136;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20803;&#20989;&#25968;&#25968;&#25454;&#20998;&#26512;&#20013;&#65292;&#19981;&#21516;&#30340;&#20989;&#25968;&#21327;&#21464;&#37327;&#21487;&#33021;&#20855;&#26377;&#21516;&#36136;&#24615;&#12290;&#38544;&#34255;&#30340;&#21516;&#36136;&#24615;&#32467;&#26500;&#23545;&#20110;&#19981;&#21516;&#21327;&#21464;&#37327;&#30340;&#36830;&#25509;&#25110;&#20851;&#32852;&#20855;&#26377;&#20449;&#24687;&#20215;&#20540;&#12290;&#20855;&#26377;&#26126;&#26174;&#21516;&#36136;&#24615;&#30340;&#21327;&#21464;&#37327;&#21487;&#20197;&#22312;&#21516;&#19968;&#32676;&#32452;&#20013;&#36827;&#34892;&#32852;&#21512;&#20998;&#26512;&#65292;&#20174;&#32780;&#20135;&#29983;&#19968;&#31181;&#31616;&#21270;&#24314;&#27169;&#22810;&#20803;&#20989;&#25968;&#25968;&#25454;&#30340;&#26041;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20998;&#32452;&#22810;&#20803;&#20989;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#37319;&#29992;&#31216;&#20026;&#8220;&#31995;&#25968;&#24418;&#29366;&#23545;&#40784;&#8221;&#30340;&#26032;&#27491;&#21017;&#21270;&#26041;&#27861;&#26469;&#35299;&#20915;&#19981;&#21516;&#20989;&#25968;&#21327;&#21464;&#37327;&#30340;&#28508;&#22312;&#21516;&#36136;&#24615;&#38382;&#39064;&#12290;&#24314;&#27169;&#36807;&#31243;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#27493;&#39588;&#65306;&#39318;&#20808;&#65292;&#20351;&#29992;&#26032;&#30340;&#27491;&#21017;&#21270;&#26041;&#27861;&#26816;&#27979;&#26410;&#30693;&#20998;&#32452;&#32467;&#26500;&#65292;&#23558;&#21327;&#21464;&#37327;&#32858;&#21512;&#21040;&#19981;&#30456;&#20132;&#30340;&#32676;&#32452;&#20013;&#65307;&#28982;&#21518;&#65292;&#22522;&#20110;&#26816;&#27979;&#21040;&#30340;&#20998;&#32452;&#32467;&#26500;&#24314;&#31435;&#20998;&#32452;&#22810;&#20803;&#20989;&#25968;&#22238;&#24402;&#27169;&#22411;&#12290;&#22312;&#36825;&#20010;&#26032;&#30340;&#20998;&#32452;&#27169;&#22411;&#20013;&#65292;&#21516;&#19968;&#21516;&#36136;&#32676;&#32452;&#20013;&#30340;&#31995;&#25968;&#20989;&#25968;&#24212;&#23545;&#40784;&#12290;
&lt;/p&gt;
&lt;p&gt;
In multivariate functional data analysis, different functional covariates can be homogeneous. The hidden homogeneity structure is informative about the connectivity or association of different covariates. The covariates with pronounced homogeneity can be analyzed jointly within the same group, which gives rise to a way of parsimoniously modeling multivariate functional data. In this paper, a novel grouped multivariate functional regression model with a new regularization approach termed "coefficient shape alignment" is developed to tackle the potential homogeneity of different functional covariates. The modeling procedure includes two main steps: first detect the unknown grouping structure with the new regularization approach to aggregate covariates into disjoint groups; and then the grouped multivariate functional regression model is established based on the detected grouping structure. In this new grouped model, the coefficient functions of covariates in the same homogeneous group sh
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20132;&#36890;&#22270;&#26410;&#35843;&#25972;&#30340; Langevin &#31639;&#27861; (ULA) &#21644; Riemann &#27969;&#24418; Langevin &#21160;&#21147;&#23398; (RMLD)&#65292;&#36890;&#36807;&#24212;&#29992;&#20132;&#36890;&#22270;&#21487;&#20197;&#21152;&#36895; Langevin &#21160;&#21147;&#23398;&#30340;&#25910;&#25947;&#65292;&#24182;&#25552;&#20379;&#20102;&#23398;&#20064;&#24230;&#37327;&#21644;&#25200;&#21160;&#30340;&#26032;&#24605;&#36335;&#12290;</title><link>http://arxiv.org/abs/2302.07227</link><description>&lt;p&gt;
&#20132;&#36890;&#22270;&#26410;&#35843;&#25972;&#30340; Langevin &#31639;&#27861;&#65306;&#23398;&#20064;&#21644;&#31163;&#25955;&#21270;&#25200;&#21160;&#37319;&#26679;&#22120;
&lt;/p&gt;
&lt;p&gt;
Transport map unadjusted Langevin algorithms: learning and discretizing perturbed samplers. (arXiv:2302.07227v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.07227
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#20132;&#36890;&#22270;&#26410;&#35843;&#25972;&#30340; Langevin &#31639;&#27861; (ULA) &#21644; Riemann &#27969;&#24418; Langevin &#21160;&#21147;&#23398; (RMLD)&#65292;&#36890;&#36807;&#24212;&#29992;&#20132;&#36890;&#22270;&#21487;&#20197;&#21152;&#36895; Langevin &#21160;&#21147;&#23398;&#30340;&#25910;&#25947;&#65292;&#24182;&#25552;&#20379;&#20102;&#23398;&#20064;&#24230;&#37327;&#21644;&#25200;&#21160;&#30340;&#26032;&#24605;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Langevin &#21160;&#21147;&#23398;&#34987;&#24191;&#27867;&#29992;&#20110;&#25277;&#26679;&#39640;&#32500;&#12289;&#38750;&#39640;&#26031;&#20998;&#24067;&#65292;&#20854;&#23494;&#24230;&#24050;&#30693;&#20294;&#24120;&#25968;&#26410;&#30693;&#12290;&#29305;&#21035;&#24863;&#20852;&#36259;&#30340;&#26159;&#26410;&#20462;&#27491;&#30340; Langevin &#31639;&#27861; (ULA)&#65292;&#23427;&#30452;&#25509;&#31163;&#25955;&#21270; Langevin &#21160;&#21147;&#23398;&#20197;&#20272;&#35745;&#30446;&#26631;&#20998;&#24067;&#19978;&#30340;&#26399;&#26395;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20351;&#29992;&#20132;&#36890;&#22270;&#26469;&#36817;&#20284;&#26631;&#20934;&#21270;&#30446;&#26631;&#20998;&#24067;&#30340;&#26041;&#27861;&#65292;&#20197;&#39044;&#22788;&#29702;&#21644;&#21152;&#36895; Langevin &#21160;&#21147;&#23398;&#30340;&#25910;&#25947;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#36830;&#32493;&#26102;&#38388;&#19979;&#65292;&#24403;&#23558;&#20132;&#36890;&#22270;&#24212;&#29992;&#20110; Langevin &#21160;&#21147;&#23398;&#26102;&#65292;&#32467;&#26524;&#26159;&#20855;&#26377;&#30001;&#20132;&#36890;&#22270;&#23450;&#20041;&#30340;&#24230;&#37327;&#30340; Riemann &#27969;&#24418; Langevin &#21160;&#21147;&#23398;&#65288;RMLD&#65289;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#23558;&#20132;&#36890;&#22270;&#24212;&#29992;&#20110;&#19981;&#21487;&#36870;&#25200;&#21160;&#30340; ULA &#20250;&#20135;&#29983;&#21407;&#21160;&#21147;&#23398;&#30340;&#20960;&#20309;&#20449;&#24687;&#19981;&#21487;&#36870;&#25200;&#21160; &#65288;GiIrr&#65289;&#12290;&#36825;&#20123;&#32852;&#31995;&#34920;&#26126;&#20102;&#23398;&#20064;&#24230;&#37327;&#21644;&#25200;&#21160;&#30340;&#26356;&#31995;&#32479;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#25551;&#36848; RMLD &#30340;&#26367;&#20195;&#31163;&#25955;&#21270;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Langevin dynamics are widely used in sampling high-dimensional, non-Gaussian distributions whose densities are known up to a normalizing constant. In particular, there is strong interest in unadjusted Langevin algorithms (ULA), which directly discretize Langevin dynamics to estimate expectations over the target distribution. We study the use of transport maps that approximately normalize a target distribution as a way to precondition and accelerate the convergence of Langevin dynamics. We show that in continuous time, when a transport map is applied to Langevin dynamics, the result is a Riemannian manifold Langevin dynamics (RMLD) with metric defined by the transport map. We also show that applying a transport map to an irreversibly-perturbed ULA results in a geometry-informed irreversible perturbation (GiIrr) of the original dynamics. These connections suggest more systematic ways of learning metrics and perturbations, and also yield alternative discretizations of the RMLD described b
&lt;/p&gt;</description></item></channel></rss>