<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30340;&#24615;&#21035;&#22833;&#34913;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#65292;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#65292;&#32780;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#22240;&#27492;&#65292;&#36825;&#34920;&#26126;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;</title><link>http://arxiv.org/abs/2102.00687</link><description>&lt;p&gt;
&#24615;&#21035;&#22833;&#34913;&#23545;&#26085;&#26412;&#23130;&#23035;&#21644;&#29983;&#32946;&#30340;&#24433;&#21709;&#65306;&#20197;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#20026;&#20363;&#35777;
&lt;/p&gt;
&lt;p&gt;
The Impacts of the Gender Imbalance on Marriage and Birth: Evidence from World War II in Japan. (arXiv:2102.00687v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2102.00687
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30340;&#24615;&#21035;&#22833;&#34913;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#65292;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#65292;&#32780;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#22240;&#27492;&#65292;&#36825;&#34920;&#26126;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30007;&#24615;&#25439;&#22833;&#23548;&#33268;&#24615;&#21035;&#27604;&#20363;&#21069;&#25152;&#26410;&#26377;&#30340;&#21464;&#21270;&#65292;&#26469;&#30740;&#31350;&#24615;&#21035;&#22833;&#34913;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;&#26032;&#25968;&#23383;&#21270;&#30340;&#22522;&#20110;&#20154;&#21475;&#26222;&#26597;&#30340;&#21382;&#21490;&#32479;&#35745;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#23478;&#24237;&#20869;&#37096;&#30340;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#12290;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#23588;&#20854;&#26159;&#24180;&#36731;&#20154;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#26159;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#27604;&#20007;&#20598;&#30007;&#24615;&#35201;&#20302;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#22312;1950&#24180;&#20195;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#12290;&#22312;&#25112;&#21518;&#22549;&#32974;&#27861;&#24459;&#30340;&#21046;&#24230;&#21464;&#21270;&#19979;&#65292;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#25105;&#20204;&#20851;&#20110;&#38750;&#23130;&#29983;&#23376;&#22899;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#22312;&#32463;&#27982;&#20307;&#20013;&#26159;&#20855;&#26377;&#31283;&#20581;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study uses the unprecedented changes in the sex ratio due to the losses of men during World War II to identify the impacts of the gender imbalance on marriage market and birth outcomes in Japan. Using newly digitized census-based historical statistics, we find evidence that men had a stronger bargaining position in the marriage market and intra-household fertility decisions than women. Under relative male scarcity, while people, especially younger people, were more likely to marry and divorce, widowed women were less likely to remarry than widowed men. We also find that women's bargaining position in the marriage market might not have improved throughout the 1950s. Given the institutional changes in the abortion law after the war, marital fertility and stillbirth rates increased in the areas that suffered relative male scarcity. Our result on out-of-wedlock births indicates that the theoretical prediction of intra-household bargaining is considered to be robust in an economy in wh
&lt;/p&gt;</description></item></channel></rss>