<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>InVA&#26159;&#19968;&#31181;&#32508;&#21512;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;&#27169;&#24577;&#31070;&#32463;&#24433;&#20687;&#25968;&#25454;&#20013;&#19981;&#21516;&#26469;&#28304;&#30340;&#22810;&#20010;&#22270;&#20687;&#26469;&#36827;&#34892;&#39044;&#27979;&#25512;&#29702;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#30340;VAE&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.02734</link><description>&lt;p&gt;
InVA: &#32508;&#21512;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#29992;&#20110;&#22810;&#27169;&#24577;&#31070;&#32463;&#24433;&#20687;&#25968;&#25454;&#30340;&#21327;&#35843;
&lt;/p&gt;
&lt;p&gt;
InVA: Integrative Variational Autoencoder for Harmonization of Multi-modal Neuroimaging Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02734
&lt;/p&gt;
&lt;p&gt;
InVA&#26159;&#19968;&#31181;&#32508;&#21512;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;&#27169;&#24577;&#31070;&#32463;&#24433;&#20687;&#25968;&#25454;&#20013;&#19981;&#21516;&#26469;&#28304;&#30340;&#22810;&#20010;&#22270;&#20687;&#26469;&#36827;&#34892;&#39044;&#27979;&#25512;&#29702;&#65292;&#30456;&#36739;&#20110;&#20256;&#32479;&#30340;VAE&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25506;&#32034;&#22810;&#20010;&#26469;&#33258;&#19981;&#21516;&#25104;&#20687;&#27169;&#24335;&#30340;&#22270;&#20687;&#20043;&#38388;&#30340;&#38750;&#32447;&#24615;&#20851;&#32852;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#23613;&#31649;&#26377;&#36234;&#26469;&#36234;&#22810;&#30340;&#25991;&#29486;&#30740;&#31350;&#22522;&#20110;&#22810;&#20010;&#22270;&#20687;&#26469;&#25512;&#26029;&#22270;&#20687;&#30340;&#39044;&#27979;&#25512;&#29702;&#65292;&#20294;&#29616;&#26377;&#26041;&#27861;&#22312;&#26377;&#25928;&#20511;&#29992;&#22810;&#20010;&#25104;&#20687;&#27169;&#24335;&#20043;&#38388;&#30340;&#20449;&#24687;&#26469;&#39044;&#27979;&#22270;&#20687;&#26041;&#38754;&#23384;&#22312;&#23616;&#38480;&#12290;&#26412;&#25991;&#24314;&#31435;&#22312;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;VAEs&#65289;&#30340;&#25991;&#29486;&#22522;&#30784;&#19978;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;&#32508;&#21512;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;InVA&#65289;&#26041;&#27861;&#65292;&#23427;&#20174;&#19981;&#21516;&#26469;&#28304;&#33719;&#24471;&#30340;&#22810;&#20010;&#22270;&#20687;&#20013;&#20511;&#29992;&#20449;&#24687;&#26469;&#32472;&#21046;&#22270;&#20687;&#30340;&#39044;&#27979;&#25512;&#29702;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#25429;&#25417;&#20102;&#32467;&#26524;&#22270;&#20687;&#19982;&#36755;&#20837;&#22270;&#20687;&#20043;&#38388;&#30340;&#22797;&#26434;&#38750;&#32447;&#24615;&#20851;&#32852;&#65292;&#24182;&#20801;&#35768;&#24555;&#36895;&#35745;&#31639;&#12290;&#25968;&#20540;&#32467;&#26524;&#34920;&#26126;&#65292;InVA&#30456;&#23545;&#20110;&#36890;&#24120;&#19981;&#20801;&#35768;&#20511;&#29992;&#36755;&#20837;&#22270;&#20687;&#20043;&#38388;&#20449;&#24687;&#30340;VAE&#20855;&#26377;&#26126;&#26174;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
There is a significant interest in exploring non-linear associations among multiple images derived from diverse imaging modalities. While there is a growing literature on image-on-image regression to delineate predictive inference of an image based on multiple images, existing approaches have limitations in efficiently borrowing information between multiple imaging modalities in the prediction of an image. Building on the literature of Variational Auto Encoders (VAEs), this article proposes a novel approach, referred to as Integrative Variational Autoencoder (\texttt{InVA}) method, which borrows information from multiple images obtained from different sources to draw predictive inference of an image. The proposed approach captures complex non-linear association between the outcome image and input images, while allowing rapid computation. Numerical results demonstrate substantial advantages of \texttt{InVA} over VAEs, which typically do not allow borrowing information between input imag
&lt;/p&gt;</description></item></channel></rss>