<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38598;&#25104;&#31283;&#23450;&#36335;&#24452;&#30340;&#26032;&#31283;&#23450;&#36873;&#25321;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#23454;&#36341;&#20013;&#25552;&#39640;&#29305;&#24449;&#36873;&#25321;&#30340;&#28789;&#25935;&#24230;&#24182;&#26356;&#22909;&#22320;&#26657;&#20934;&#30446;&#26631;&#20551;&#38451;&#24615;&#25968;&#37327;&#12290;</title><link>https://arxiv.org/abs/2403.15877</link><description>&lt;p&gt;
&#38598;&#25104;&#36335;&#24452;&#31283;&#23450;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Integrated path stability selection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15877
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38598;&#25104;&#31283;&#23450;&#36335;&#24452;&#30340;&#26032;&#31283;&#23450;&#36873;&#25321;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#23454;&#36341;&#20013;&#25552;&#39640;&#29305;&#24449;&#36873;&#25321;&#30340;&#28789;&#25935;&#24230;&#24182;&#26356;&#22909;&#22320;&#26657;&#20934;&#30446;&#26631;&#20551;&#38451;&#24615;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31283;&#23450;&#36873;&#25321;&#26159;&#19968;&#31181;&#24191;&#27867;&#29992;&#20110;&#25913;&#21892;&#29305;&#24449;&#36873;&#25321;&#31639;&#27861;&#24615;&#33021;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#24050;&#21457;&#29616;&#31283;&#23450;&#36873;&#25321;&#36807;&#20110;&#20445;&#23432;&#65292;&#23548;&#33268;&#28789;&#25935;&#24230;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#23545;&#26399;&#26395;&#30340;&#20551;&#38451;&#24615;&#25968;&#37327;&#30340;&#29702;&#35770;&#30028;&#38480;E(FP)&#30456;&#23545;&#36739;&#26494;&#65292;&#38590;&#20197;&#30693;&#36947;&#23454;&#36341;&#20013;&#20250;&#26377;&#22810;&#23569;&#20551;&#38451;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#38598;&#25104;&#31283;&#23450;&#36335;&#24452;&#32780;&#38750;&#26368;&#22823;&#21270;&#31283;&#23450;&#36335;&#24452;&#30340;&#26032;&#26041;&#27861;&#12290;&#36825;&#20135;&#29983;&#20102;&#23545;E(FP)&#26356;&#32039;&#23494;&#30340;&#30028;&#38480;&#65292;&#23548;&#33268;&#23454;&#36341;&#20013;&#20855;&#26377;&#26356;&#39640;&#28789;&#25935;&#24230;&#30340;&#29305;&#24449;&#36873;&#25321;&#26631;&#20934;&#65292;&#24182;&#19988;&#22312;&#19982;&#30446;&#26631;E(FP)&#21305;&#37197;&#26041;&#38754;&#26356;&#22909;&#22320;&#26657;&#20934;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#19982;&#21407;&#22987;&#31283;&#23450;&#36873;&#25321;&#31639;&#27861;&#38656;&#35201;&#30456;&#21516;&#25968;&#37327;&#30340;&#35745;&#31639;&#65292;&#19988;&#20165;&#38656;&#35201;&#29992;&#25143;&#25351;&#23450;&#19968;&#20010;&#36755;&#20837;&#21442;&#25968;&#65292;&#21363;E(FP)&#30340;&#30446;&#26631;&#20540;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#24615;&#33021;&#30340;&#29702;&#35770;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15877v1 Announce Type: cross  Abstract: Stability selection is a widely used method for improving the performance of feature selection algorithms. However, stability selection has been found to be highly conservative, resulting in low sensitivity. Further, the theoretical bound on the expected number of false positives, E(FP), is relatively loose, making it difficult to know how many false positives to expect in practice. In this paper, we introduce a novel method for stability selection based on integrating the stability paths rather than maximizing over them. This yields a tighter bound on E(FP), resulting in a feature selection criterion that has higher sensitivity in practice and is better calibrated in terms of matching the target E(FP). Our proposed method requires the same amount of computation as the original stability selection algorithm, and only requires the user to specify one input parameter, a target value for E(FP). We provide theoretical bounds on performance
&lt;/p&gt;</description></item></channel></rss>