<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#20013;&#33719;&#24471;&#20102;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#29305;&#21035;&#26159;&#24403;&#24178;&#39044;&#26041;&#26696;&#26159;&#33258;&#36866;&#24212;&#20998;&#37197;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2307.01357</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Adaptive Principal Component Regression with Applications to Panel Data. (arXiv:2307.01357v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01357
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#20013;&#33719;&#24471;&#20102;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#29305;&#21035;&#26159;&#24403;&#24178;&#39044;&#26041;&#26696;&#26159;&#33258;&#36866;&#24212;&#20998;&#37197;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#25104;&#20998;&#22238;&#24402;(PCR)&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#22266;&#23450;&#35774;&#35745;&#35823;&#24046;&#21464;&#37327;&#22238;&#24402;&#25216;&#26415;&#65292;&#23427;&#26159;&#32447;&#24615;&#22238;&#24402;&#30340;&#25512;&#24191;&#65292;&#35266;&#27979;&#30340;&#21327;&#21464;&#37327;&#21463;&#21040;&#38543;&#26426;&#22122;&#22768;&#30340;&#27745;&#26579;&#12290;&#25105;&#20204;&#22312;&#25968;&#25454;&#25910;&#38598;&#26102;&#25552;&#20379;&#20102;&#22312;&#32447;&#65288;&#27491;&#21017;&#21270;&#65289;PCR&#30340;&#31532;&#19968;&#27425;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#30001;&#20110;&#20998;&#26512;&#22266;&#23450;&#35774;&#35745;&#20013;PCR&#30340;&#35777;&#26126;&#25216;&#26415;&#26080;&#27861;&#24456;&#23481;&#26131;&#22320;&#25193;&#23637;&#21040;&#22312;&#32447;&#35774;&#32622;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#20381;&#36182;&#20110;&#23558;&#29616;&#20195;&#38789;&#27987;&#24230;&#30340;&#24037;&#20855;&#36866;&#24212;&#21040;&#35823;&#24046;&#21464;&#37327;&#35774;&#32622;&#20013;&#12290;&#20316;&#20026;&#25105;&#20204;&#30028;&#38480;&#30340;&#24212;&#29992;&#65292;&#25105;&#20204;&#22312;&#38754;&#26495;&#25968;&#25454;&#35774;&#32622;&#20013;&#25552;&#20379;&#20102;&#23454;&#39564;&#35774;&#35745;&#26694;&#26550;&#65292;&#24403;&#24178;&#39044;&#34987;&#33258;&#36866;&#24212;&#22320;&#20998;&#37197;&#26102;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#21512;&#25104;&#25511;&#21046;&#21644;&#21512;&#25104;&#24178;&#39044;&#26694;&#26550;&#30340;&#27867;&#21270;&#65292;&#20854;&#20013;&#25968;&#25454;&#26159;&#36890;&#36807;&#33258;&#36866;&#24212;&#24178;&#39044;&#20998;&#37197;&#31574;&#30053;&#25910;&#38598;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Principal component regression (PCR) is a popular technique for fixed-design error-in-variables regression, a generalization of the linear regression setting in which the observed covariates are corrupted with random noise. We provide the first time-uniform finite sample guarantees for online (regularized) PCR whenever data is collected adaptively. Since the proof techniques for analyzing PCR in the fixed design setting do not readily extend to the online setting, our results rely on adapting tools from modern martingale concentration to the error-in-variables setting. As an application of our bounds, we provide a framework for experiment design in panel data settings when interventions are assigned adaptively. Our framework may be thought of as a generalization of the synthetic control and synthetic interventions frameworks, where data is collected via an adaptive intervention assignment policy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#21644;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#24120;&#29992;&#30340;&#20004;&#31181;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2211.14903</link><description>&lt;p&gt;
&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference in Cluster Randomized Trials with Matched Pairs. (arXiv:2211.14903v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.14903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#21644;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#24120;&#29992;&#30340;&#20004;&#31181;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#25512;&#26029;&#30340;&#38382;&#39064;&#12290;&#21305;&#37197;&#23545;&#35774;&#35745;&#24847;&#21619;&#30528;&#26681;&#25454;&#22522;&#32447;&#31751;&#32423;&#21327;&#21464;&#37327;&#23545;&#19968;&#32452;&#31751;&#36827;&#34892;&#21305;&#37197;&#65292;&#28982;&#21518;&#22312;&#27599;&#23545;&#31751;&#20013;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#31751;&#36827;&#34892;&#22788;&#29702;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#30340;&#22823;&#26679;&#26412;&#34892;&#20026;&#65292;&#24182;&#26681;&#25454;&#21305;&#37197;&#36807;&#31243;&#26159;&#21542;&#21305;&#37197;&#31751;&#22823;&#23567;&#65292;&#23548;&#20986;&#20102;&#20004;&#32452;&#19981;&#21516;&#30340;&#32467;&#26524;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#26080;&#35770;&#21305;&#37197;&#36807;&#31243;&#26159;&#21305;&#37197;&#31751;&#22823;&#23567;&#36824;&#26159;&#19981;&#21305;&#37197;&#31751;&#22823;&#23567;&#65292;&#37117;&#26159;&#19968;&#33268;&#30340;&#12290;&#32467;&#21512;&#36825;&#20123;&#32467;&#26524;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#26816;&#39564;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22522;&#20110;&#32447;&#24615;&#22238;&#24402;&#26500;&#36896;&#30340;$t$&#27979;&#35797;&#30340;&#20004;&#31181;&#24120;&#35265;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#65292;&#24182;&#22768;&#31216;&#36825;&#20004;&#31181;&#31243;&#24207;&#36890;&#24120;&#26159;&#20445;&#23432;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers the problem of inference in cluster randomized trials where treatment status is determined according to a "matched pairs'' design. Here, by a cluster randomized experiment, we mean one in which treatment is assigned at the level of the cluster; by a "matched pairs'' design we mean that a sample of clusters is paired according to baseline, cluster-level covariates and, within each pair, one cluster is selected at random for treatment. We study the large sample behavior of a weighted difference-in-means estimator and derive two distinct sets of results depending on if the matching procedure does or does not match on cluster size. We then propose a variance estimator which is consistent in either case. Combining these results establishes the asymptotic exactness of tests based on these estimators. Next, we consider the properties of two common testing procedures based on $t$-tests constructed from linear regressions, and argue that both are generally conservative in o
&lt;/p&gt;</description></item></channel></rss>