<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24320;&#21457;&#20102;&#25512;&#26029;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;</title><link>https://arxiv.org/abs/2403.05803</link><description>&lt;p&gt;
&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#30340;&#21322;&#21442;&#25968;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Inference for Regression-Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05803
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24320;&#21457;&#20102;&#25512;&#26029;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDDs&#65289;&#20013;&#65292;&#27835;&#30103;&#25928;&#24212;&#36890;&#24120;&#20351;&#29992;&#23616;&#37096;&#22238;&#24402;&#26041;&#27861;&#36827;&#34892;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;&#20840;&#23616;&#36817;&#20284;&#26041;&#27861;&#36890;&#24120;&#34987;&#35748;&#20026;&#25928;&#29575;&#20302;&#19979;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#19987;&#38376;&#29992;&#20110;&#22312;RDDs&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#20840;&#23616;&#26041;&#27861;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#20854;&#20013;&#32447;&#24615;&#37096;&#20998;&#25429;&#25417;&#27835;&#30103;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#26469;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24182;&#24320;&#21457;&#20102;&#25512;&#26029;&#22312;&#36825;&#20010;&#26694;&#26550;&#20869;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;&#25105;&#20204;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#21508;&#31181;&#22330;&#26223;&#19979;&#34920;&#29616;&#33391;&#22909;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#30495;&#23454;&#25968;&#25454;&#38598;&#30340;&#20363;&#35777;&#65292;&#35828;&#26126;&#25105;&#20204;&#30340;&#20840;&#23616;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#26356;&#21487;&#38752;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05803v1 Announce Type: new  Abstract: Treatment effects in regression discontinuity designs (RDDs) are often estimated using local regression methods. However, global approximation methods are generally deemed inefficient. In this paper, we propose a semiparametric framework tailored for estimating treatment effects in RDDs. Our global approach conceptualizes the identification of treatment effects within RDDs as a partially linear modeling problem, with the linear component capturing the treatment effect. Furthermore, we utilize the P-spline method to approximate the nonparametric function and develop procedures for inferring treatment effects within this framework. We demonstrate through Monte Carlo simulations that the proposed method performs well across various scenarios. Furthermore, we illustrate using real-world datasets that our global approach may result in more reliable inference.
&lt;/p&gt;</description></item></channel></rss>