<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#20248;&#21270;&#28909;&#39044;&#35686;&#31995;&#32479;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#39062;&#24378;&#21270;&#23398;&#20064;&#29615;&#22659;&#21644;&#32508;&#21512;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#27668;&#20505;&#21644;&#20581;&#24247;&#29615;&#22659;&#20013;&#30340;&#20302;&#20449;&#21495;&#25928;&#24212;&#21644;&#31354;&#38388;&#24322;&#36136;&#24615;&#12290;</title><link>https://arxiv.org/abs/2312.14196</link><description>&lt;p&gt;
&#29992;&#24378;&#21270;&#23398;&#20064;&#20248;&#21270;&#28909;&#39044;&#35686;&#30340;&#21457;&#24067;
&lt;/p&gt;
&lt;p&gt;
Optimizing Heat Alert Issuance with Reinforcement Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.14196
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#20248;&#21270;&#28909;&#39044;&#35686;&#31995;&#32479;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#39062;&#24378;&#21270;&#23398;&#20064;&#29615;&#22659;&#21644;&#32508;&#21512;&#25968;&#25454;&#38598;&#65292;&#35299;&#20915;&#20102;&#27668;&#20505;&#21644;&#20581;&#24247;&#29615;&#22659;&#20013;&#30340;&#20302;&#20449;&#21495;&#25928;&#24212;&#21644;&#31354;&#38388;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#36866;&#24212;&#27668;&#20505;&#21464;&#21270;&#30340;&#20851;&#38190;&#25112;&#30053;&#20043;&#19968;&#26159;&#21033;&#29992;&#39044;&#35686;&#31995;&#32479;&#20943;&#23569;&#26497;&#31471;&#39640;&#28201;&#20107;&#20214;&#30340;&#19981;&#21033;&#20581;&#24247;&#24433;&#21709;&#65292;&#20197;&#20419;&#20351;&#39044;&#38450;&#24615;&#34892;&#21160;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;&#20316;&#20026;&#20248;&#21270;&#27492;&#31867;&#31995;&#32479;&#25928;&#26524;&#30340;&#24037;&#20855;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26377;&#19977;&#20010;&#26041;&#38754;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#24378;&#21270;&#23398;&#20064;&#29615;&#22659;&#65292;&#35780;&#20272;&#28909;&#39044;&#35686;&#25919;&#31574;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#20943;&#23569;&#19982;&#39640;&#28201;&#26377;&#20851;&#30340;&#20303;&#38498;&#20154;&#25968;&#12290;&#22870;&#21169;&#27169;&#22411;&#22522;&#20110;&#21382;&#21490;&#22825;&#27668;&#12289;&#21307;&#30103;&#20445;&#38505;&#20581;&#24247;&#35760;&#24405;&#20197;&#21450;&#31038;&#20250;&#32463;&#27982;/&#22320;&#29702;&#29305;&#24449;&#30340;&#20840;&#38754;&#25968;&#25454;&#38598;&#36827;&#34892;&#35757;&#32451;&#12290;&#25105;&#20204;&#20351;&#29992;&#21464;&#20998;&#36125;&#21494;&#26031;&#25216;&#26415;&#35299;&#20915;&#20102;&#22312;&#27668;&#20505;&#21644;&#20581;&#24247;&#29615;&#22659;&#20013;&#24120;&#35265;&#30340;&#20302;&#20449;&#21495;&#25928;&#24212;&#21644;&#31354;&#38388;&#24322;&#36136;&#24615;&#12290;&#36716;&#25442;&#27169;&#22411;&#32467;&#21512;&#20102;&#30495;&#23454;&#30340;&#21382;&#21490;&#22825;&#27668;&#27169;&#24335;&#65292;&#24182;&#36890;&#36807;&#22522;&#20110;&#27668;&#20505;&#21306;&#22495;&#30456;&#20284;&#24615;&#30340;&#25968;&#25454;&#22686;&#24378;&#26426;&#21046;&#36827;&#34892;&#22686;&#24378;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.14196v2 Announce Type: replace  Abstract: A key strategy in societal adaptation to climate change is the use of alert systems to reduce the adverse health impacts of extreme heat events by prompting preventative action. In this work, we investigate reinforcement learning (RL) as a tool to optimize the effectiveness of such systems. Our contributions are threefold. First, we introduce a novel RL environment enabling the evaluation of the effectiveness of heat alert policies to reduce heat-related hospitalizations. The rewards model is trained from a comprehensive dataset of historical weather, Medicare health records, and socioeconomic/geographic features. We use variational Bayesian techniques to address low-signal effects and spatial heterogeneity, which are commonly encountered in climate &amp; health settings. The transition model incorporates real historical weather patterns enriched by a data augmentation mechanism based on climate region similarity. Second, we use this env
&lt;/p&gt;</description></item></channel></rss>