<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#26368;&#26032;&#24046;&#24322;&#19982;&#24046;&#24322;&#26041;&#27861;&#20135;&#29983;&#30340;&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#35299;&#37322;&#65292;&#21457;&#29616;&#26032;&#26041;&#27861;&#30340;&#22270;&#24418;&#19982;&#20256;&#32479;&#30340;&#20004;&#26041;&#24335;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#20107;&#20214;&#30740;&#31350;&#30340;&#22270;&#24418;&#19981;&#21305;&#37197;&#65292;&#22240;&#20026;&#26032;&#26041;&#27861;&#23558;&#27835;&#30103;&#21069;&#31995;&#25968;&#19982;&#27835;&#30103;&#21518;&#31995;&#25968;&#36827;&#34892;&#19981;&#23545;&#31216;&#26500;&#24314;&#12290;&#25552;&#20986;&#20102;&#20351;&#29992;&#36825;&#20123;&#26041;&#27861;&#26102;&#26500;&#24314;&#21644;&#35299;&#37322;&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#23454;&#29992;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2401.12309</link><description>&lt;p&gt;
&#20174;&#26368;&#26032;&#30340;&#24046;&#24322;&#19982;&#24046;&#24322;&#26041;&#27861;&#35299;&#35835;&#20107;&#20214;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Interpreting Event-Studies from Recent Difference-in-Differences Methods. (arXiv:2401.12309v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12309
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#26368;&#26032;&#24046;&#24322;&#19982;&#24046;&#24322;&#26041;&#27861;&#20135;&#29983;&#30340;&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#35299;&#37322;&#65292;&#21457;&#29616;&#26032;&#26041;&#27861;&#30340;&#22270;&#24418;&#19982;&#20256;&#32479;&#30340;&#20004;&#26041;&#24335;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#20107;&#20214;&#30740;&#31350;&#30340;&#22270;&#24418;&#19981;&#21305;&#37197;&#65292;&#22240;&#20026;&#26032;&#26041;&#27861;&#23558;&#27835;&#30103;&#21069;&#31995;&#25968;&#19982;&#27835;&#30103;&#21518;&#31995;&#25968;&#36827;&#34892;&#19981;&#23545;&#31216;&#26500;&#24314;&#12290;&#25552;&#20986;&#20102;&#20351;&#29992;&#36825;&#20123;&#26041;&#27861;&#26102;&#26500;&#24314;&#21644;&#35299;&#37322;&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#23454;&#29992;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#26368;&#26032;&#24046;&#24322;&#19982;&#24046;&#24322;&#26041;&#27861;&#20135;&#29983;&#30340;&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#35299;&#37322;&#12290;&#25105;&#23637;&#31034;&#20102;&#21363;&#20351;&#22312;&#38750;&#38169;&#24320;&#27835;&#30103;&#26102;&#26426;&#30340;&#24773;&#20917;&#19979;&#19987;&#38376;&#38024;&#23545;&#24773;&#20917;&#36827;&#34892;&#20102;&#29305;&#27530;&#21270;&#65292;&#19977;&#31181;&#26368;&#27969;&#34892;&#30340;&#26368;&#26032;&#26041;&#27861;&#65288;de Chaisemartin&#21644;D'Haultfoeuille&#65292;2020; Callaway&#21644;SantAnna&#65292;2021; Borusyak&#65292;Jaravel&#21644;Spiess&#65292;2024&#65289;&#36719;&#20214;&#29983;&#25104;&#30340;&#40664;&#35748;&#22270;&#24418;&#19982;&#20256;&#32479;&#30340;&#20004;&#26041;&#24335;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#20107;&#20214;&#30740;&#31350;&#30340;&#22270;&#24418;&#19981;&#21305;&#37197;&#65306;&#26032;&#26041;&#27861;&#21487;&#33021;&#22312;&#27835;&#30103;&#26102;&#20986;&#29616;&#36716;&#25240;&#28857;&#25110;&#36339;&#36291;&#28857;&#65292;&#32780;TWFE&#20107;&#20214;&#30740;&#31350;&#21017;&#26174;&#31034;&#19968;&#26465;&#30452;&#32447;&#12290;&#36825;&#31181;&#24046;&#24322;&#26469;&#33258;&#20110;&#26032;&#26041;&#27861;&#23558;&#27835;&#30103;&#21069;&#31995;&#25968;&#19982;&#27835;&#30103;&#21518;&#31995;&#25968;&#36827;&#34892;&#19981;&#23545;&#31216;&#26500;&#24314;&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#20998;&#26512;TWFE&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#35270;&#35273;&#21551;&#21457;&#65292;&#19981;&#33021;&#31435;&#21363;&#24212;&#29992;&#20110;&#36825;&#20123;&#26041;&#27861;&#30340;&#22270;&#24418;&#19978;&#12290;&#25991;&#31456;&#26368;&#21518;&#32473;&#20986;&#20102;&#22312;&#20351;&#29992;&#36825;&#20123;&#26041;&#27861;&#26102;&#26500;&#24314;&#21644;&#35299;&#37322;&#20107;&#20214;&#30740;&#31350;&#22270;&#30340;&#23454;&#29992;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
This note discusses the interpretation of event-study plots produced by recent difference-in-differences methods. I show that even when specialized to the case of non-staggered treatment timing, the default plots produced by software for three of the most popular recent methods (de Chaisemartin and D'Haultfoeuille, 2020; Callaway and SantAnna, 2021; Borusyak, Jaravel and Spiess, 2024) do not match those of traditional two-way fixed effects (TWFE) event-studies: the new methods may show a kink or jump at the time of treatment even when the TWFE event-study shows a straight line. This difference stems from the fact that the new methods construct the pre-treatment coefficients asymmetrically from the post-treatment coefficients. As a result, visual heuristics for analyzing TWFE event-study plots should not be immediately applied to those from these methods. I conclude with practical recommendations for constructing and interpreting event-study plots when using these methods.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#33258;&#36866;&#24212;&#23454;&#39564;&#20013;&#36827;&#34892;&#26465;&#20214;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#36827;&#19968;&#27493;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20165;&#20351;&#29992;&#26368;&#21518;&#19968;&#25209;&#32467;&#26524;&#36827;&#34892;&#25512;&#26029;&#26159;&#26368;&#20248;&#30340;&#65307;&#24403;&#23454;&#39564;&#30340;&#33258;&#36866;&#24212;&#26041;&#38754;&#26159;&#20301;&#32622;&#19981;&#21464;&#30340;&#26102;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#20102;&#39069;&#22806;&#30340;&#20449;&#24687;&#65307;&#22312;&#20572;&#27490;&#26102;&#38388;&#12289;&#20998;&#37197;&#27010;&#29575;&#21644;&#30446;&#26631;&#21442;&#25968;&#20165;&#20381;&#36182;&#20110;&#25968;&#25454;&#30340;&#22810;&#38754;&#20307;&#20107;&#20214;&#38598;&#21512;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#35745;&#31639;&#21487;&#34892;&#19988;&#26368;&#20248;&#30340;&#26465;&#20214;&#25512;&#26029;&#31243;&#24207;&#12290;</title><link>http://arxiv.org/abs/2309.12162</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#23454;&#39564;&#20013;&#30340;&#26368;&#20248;&#26465;&#20214;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Optimal Conditional Inference in Adaptive Experiments. (arXiv:2309.12162v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12162
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#33258;&#36866;&#24212;&#23454;&#39564;&#20013;&#36827;&#34892;&#26465;&#20214;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#36827;&#19968;&#27493;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20165;&#20351;&#29992;&#26368;&#21518;&#19968;&#25209;&#32467;&#26524;&#36827;&#34892;&#25512;&#26029;&#26159;&#26368;&#20248;&#30340;&#65307;&#24403;&#23454;&#39564;&#30340;&#33258;&#36866;&#24212;&#26041;&#38754;&#26159;&#20301;&#32622;&#19981;&#21464;&#30340;&#26102;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#20102;&#39069;&#22806;&#30340;&#20449;&#24687;&#65307;&#22312;&#20572;&#27490;&#26102;&#38388;&#12289;&#20998;&#37197;&#27010;&#29575;&#21644;&#30446;&#26631;&#21442;&#25968;&#20165;&#20381;&#36182;&#20110;&#25968;&#25454;&#30340;&#22810;&#38754;&#20307;&#20107;&#20214;&#38598;&#21512;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#35745;&#31639;&#21487;&#34892;&#19988;&#26368;&#20248;&#30340;&#26465;&#20214;&#25512;&#26029;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25209;&#37327;&#36172;&#24466;&#23454;&#39564;&#65292;&#24182;&#32771;&#34385;&#20102;&#22312;&#23454;&#29616;&#20572;&#27490;&#26102;&#38388;&#12289;&#20998;&#37197;&#27010;&#29575;&#21644;&#30446;&#26631;&#21442;&#25968;&#30340;&#26465;&#20214;&#19979;&#36827;&#34892;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#25152;&#26377;&#36825;&#20123;&#21487;&#33021;&#37117;&#26159;&#26681;&#25454;&#23454;&#39564;&#30340;&#26368;&#21518;&#19968;&#25209;&#20449;&#24687;&#36827;&#34892;&#33258;&#36866;&#24212;&#36873;&#25321;&#30340;&#12290;&#22312;&#27809;&#26377;&#23545;&#23454;&#39564;&#36827;&#34892;&#36827;&#19968;&#27493;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20165;&#20351;&#29992;&#26368;&#21518;&#19968;&#25209;&#32467;&#26524;&#36827;&#34892;&#25512;&#26029;&#26159;&#26368;&#20248;&#30340;&#12290;&#24403;&#23454;&#39564;&#30340;&#33258;&#36866;&#24212;&#26041;&#38754;&#34987;&#35748;&#20026;&#26159;&#20301;&#32622;&#19981;&#21464;&#30340;&#65292;&#21363;&#24403;&#25105;&#20204;&#23558;&#25152;&#26377;&#25209;&#27425;-&#33218;&#30340;&#24179;&#22343;&#20540;&#37117;&#21521;&#19968;&#20010;&#24120;&#25968;&#31227;&#21160;&#26102;&#65292;&#25105;&#20204;&#35777;&#26126;&#25968;&#25454;&#20013;&#36824;&#23384;&#22312;&#39069;&#22806;&#30340;&#20449;&#24687;&#65292;&#21487;&#20197;&#36890;&#36807;&#19968;&#20010;&#39069;&#22806;&#30340;&#25209;&#27425;-&#33218;&#22343;&#20540;&#30340;&#32447;&#24615;&#20989;&#25968;&#26469;&#25429;&#25417;&#12290;&#22312;&#26356;&#20005;&#26684;&#30340;&#24773;&#20917;&#19979;&#65292;&#20572;&#27490;&#26102;&#38388;&#12289;&#20998;&#37197;&#27010;&#29575;&#21644;&#30446;&#26631;&#21442;&#25968;&#34987;&#35748;&#20026;&#20165;&#20381;&#36182;&#20110;&#25968;&#25454;&#36890;&#36807;&#19968;&#20010;&#22810;&#38754;&#20307;&#20107;&#20214;&#30340;&#38598;&#21512;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#35745;&#31639;&#21487;&#34892;&#19988;&#26368;&#20248;&#30340;&#26465;&#20214;&#25512;&#26029;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study batched bandit experiments and consider the problem of inference conditional on the realized stopping time, assignment probabilities, and target parameter, where all of these may be chosen adaptively using information up to the last batch of the experiment. Absent further restrictions on the experiment, we show that inference using only the results of the last batch is optimal. When the adaptive aspects of the experiment are known to be location-invariant, in the sense that they are unchanged when we shift all batch-arm means by a constant, we show that there is additional information in the data, captured by one additional linear function of the batch-arm means. In the more restrictive case where the stopping time, assignment probabilities, and target parameter are known to depend on the data only through a collection of polyhedral events, we derive computationally tractable and optimal conditional inference procedures.
&lt;/p&gt;</description></item></channel></rss>