<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#22312;&#22823;&#35268;&#27169;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#19978;&#25552;&#20986;&#20102;&#19968;&#31181;&#22343;&#21248;&#25512;&#26029;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#33021;&#22815;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#21253;&#25324;&#32593;&#32476;&#32467;&#26500;&#20013;&#30340;&#38646;&#25110;&#38750;&#38646;&#20803;&#32032;&#12290;</title><link>http://arxiv.org/abs/2105.07424</link><description>&lt;p&gt;
&#39640;&#32500;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#19978;&#30340;&#22343;&#21248;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Uniform Inference on High-dimensional Spatial Panel Networks. (arXiv:2105.07424v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.07424
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#22823;&#35268;&#27169;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#19978;&#25552;&#20986;&#20102;&#19968;&#31181;&#22343;&#21248;&#25512;&#26029;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#33021;&#22815;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#21253;&#25324;&#32593;&#32476;&#32467;&#26500;&#20013;&#30340;&#38646;&#25110;&#38750;&#38646;&#20803;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20559;&#24046;-&#27491;&#21017;&#21270;&#30340;&#39640;&#32500;&#24191;&#20041;&#30697;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#65292;&#29992;&#20110;&#23545;&#22823;&#35268;&#27169;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#36827;&#34892;&#25512;&#26029;&#12290;&#29305;&#21035;&#26159;&#65292;&#21033;&#29992;&#20559;&#24046;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20272;&#35745;&#20855;&#26377;&#28789;&#27963;&#31232;&#30095;&#20559;&#24046;&#30340;&#32593;&#32476;&#32467;&#26500;&#65292;&#36825;&#21487;&#20197;&#34987;&#35270;&#20026;&#28508;&#22312;&#30340;&#25110;&#32773;&#19982;&#39044;&#23450;&#30340;&#37051;&#25509;&#30697;&#38453;&#19981;&#21305;&#37197;&#12290;&#29702;&#35770;&#20998;&#26512;&#30830;&#31435;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#32771;&#34385;&#20102;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#20013;&#30340;&#19968;&#33324;&#26102;&#38388;&#21644;&#31354;&#38388;&#20381;&#36182;&#24615;&#12290;&#35752;&#35770;&#20102;&#20381;&#36182;&#24615;&#23384;&#22312;&#26102;&#30340;&#32500;&#24230;&#20801;&#35768;&#24615;&#12290;&#25105;&#20204;&#30740;&#31350;&#30340;&#19968;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#24320;&#21457;&#20102;&#19968;&#31181;&#22343;&#21248;&#25512;&#26029;&#29702;&#35770;&#65292;&#33021;&#22815;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#21253;&#25324;&#32593;&#32476;&#32467;&#26500;&#20013;&#30340;&#38646;&#25110;&#38750;&#38646;&#20803;&#32032;&#12290;&#27492;&#22806;&#65292;&#23545;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#36827;&#34892;&#20102;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#26102;&#21051;&#30340;&#25512;&#23548;&#12290;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#25152;&#25552;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose employing a debiased-regularized, high-dimensional generalized method of moments (GMM) framework to perform inference on large-scale spatial panel networks. In particular, network structure with a flexible sparse deviation, which can be regarded either as latent or as misspecified from a predetermined adjacency matrix, is estimated using debiased machine learning approach. The theoretical analysis establishes the consistency and asymptotic normality of our proposed estimator, taking into account general temporal and spatial dependency inherent in the data-generating processes. The dimensionality allowance in presence of dependency is discussed. A primary contribution of our study is the development of uniform inference theory that enables hypothesis testing on the parameters of interest, including zero or non-zero elements in the network structure. Additionally, the asymptotic properties for the estimator are derived for both linear and nonlinear moments. Simulations demonst
&lt;/p&gt;</description></item></channel></rss>