<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#36890;&#36807;&#23558;Pearson&#30456;&#20851;&#30697;&#38453;&#31895;&#31890;&#21270;&#65292;&#26681;&#25454;&#24066;&#22330;&#37096;&#38376;&#26469;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#24182;&#27604;&#36739;&#20102;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#22312;&#24066;&#22330;&#29366;&#24577;&#28436;&#21464;&#21644;&#36716;&#25442;&#30697;&#38453;&#19978;&#30340;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#23545;&#24066;&#22330;&#29366;&#24577;&#30340;&#34892;&#20026;&#26159;&#30456;&#20284;&#30340;&#65292;&#24182;&#19988;&#30456;&#20851;&#21464;&#37327;&#25968;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;</title><link>https://arxiv.org/abs/2402.05364</link><description>&lt;p&gt;
&#26681;&#25454;&#23439;&#35266;&#32467;&#26500;&#26469;&#31895;&#31890;&#21270;&#30456;&#20851;&#30697;&#38453;&#65306;&#20197;&#37329;&#34701;&#24066;&#22330;&#20026;&#33539;&#20363;
&lt;/p&gt;
&lt;p&gt;
Coarse graining correlation matrices according to macrostructures: Financial markets as a paradigm
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;Pearson&#30456;&#20851;&#30697;&#38453;&#31895;&#31890;&#21270;&#65292;&#26681;&#25454;&#24066;&#22330;&#37096;&#38376;&#26469;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#24182;&#27604;&#36739;&#20102;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#22312;&#24066;&#22330;&#29366;&#24577;&#28436;&#21464;&#21644;&#36716;&#25442;&#30697;&#38453;&#19978;&#30340;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#23545;&#24066;&#22330;&#29366;&#24577;&#30340;&#34892;&#20026;&#26159;&#30456;&#20284;&#30340;&#65292;&#24182;&#19988;&#30456;&#20851;&#21464;&#37327;&#25968;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#23558;Pearson&#30456;&#20851;&#30697;&#38453;&#26681;&#25454;&#24066;&#22330;&#37096;&#38376;&#36827;&#34892;&#31895;&#31890;&#21270;&#65292;&#20351;&#29992;Guhr&#30340;&#30456;&#20851;&#26041;&#27861;&#24471;&#21040;Guhr&#30697;&#38453;&#65292;&#26469;&#20998;&#26512;&#37329;&#34701;&#24066;&#22330;&#30340;&#30456;&#20851;&#32467;&#26500;&#12290;&#25105;&#20204;&#23558;&#24066;&#22330;&#29366;&#24577;&#30340;&#28436;&#21464;&#21644;&#30456;&#24212;&#30340;&#36716;&#25442;&#30697;&#38453;&#30340;&#32467;&#26524;&#19982;&#20351;&#29992;Pearson&#30456;&#20851;&#30697;&#38453;&#24471;&#21040;&#30340;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#31895;&#31890;&#21270;&#21644;Pearson&#30697;&#38453;&#23545;&#20110;&#24066;&#22330;&#29366;&#24577;&#30340;&#34892;&#20026;&#26159;&#30456;&#20284;&#30340;&#12290;&#28982;&#32780;&#65292;&#30456;&#20851;&#21464;&#37327;&#30340;&#25968;&#37327;&#20943;&#23569;&#20102;&#25968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze correlation structures in financial markets by coarse graining the Pearson correlation matrices according to market sectors to obtain Guhr matrices using Guhr's correlation method according to Ref. [P. Rinn {\it et. al.}, Europhysics Letters 110, 68003 (2015)]. We compare the results for the evolution of market states and the corresponding transition matrices with those obtained using Pearson correlation matrices. The behavior of market states is found to be similar for both the coarse grained and Pearson matrices. However, the number of relevant variables is reduced by orders of magnitude.
&lt;/p&gt;</description></item></channel></rss>