<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#31639;&#27861;&#65292;Shift-NMF&#21644;Nearly-NMF&#65292;&#21487;&#20197;&#22788;&#29702;&#24102;&#26377;&#36127;&#20540;&#30340;&#22024;&#26434;&#25968;&#25454;&#65292;&#22312;&#19981;&#24341;&#20837;&#27491;&#30340;&#20559;&#31227;&#37327;&#30340;&#24773;&#20917;&#19979;&#27491;&#30830;&#24674;&#22797;&#38750;&#36127;&#20449;&#21495;&#12290;</title><link>https://arxiv.org/abs/2311.04855</link><description>&lt;p&gt;
&#29992;&#20110;&#22788;&#29702;&#24102;&#26377;&#36127;&#20540;&#30340;&#22024;&#26434;&#25968;&#25454;&#30340;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Algorithms for Non-Negative Matrix Factorization on Noisy Data With Negative Values
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.04855
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#31639;&#27861;&#65292;Shift-NMF&#21644;Nearly-NMF&#65292;&#21487;&#20197;&#22788;&#29702;&#24102;&#26377;&#36127;&#20540;&#30340;&#22024;&#26434;&#25968;&#25454;&#65292;&#22312;&#19981;&#24341;&#20837;&#27491;&#30340;&#20559;&#31227;&#37327;&#30340;&#24773;&#20917;&#19979;&#27491;&#30830;&#24674;&#22797;&#38750;&#36127;&#20449;&#21495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#65288;NMF&#65289;&#26159;&#19968;&#31181;&#38477;&#32500;&#25216;&#26415;&#65292;&#22312;&#20998;&#26512;&#22024;&#26434;&#25968;&#25454;&#65292;&#29305;&#21035;&#26159;&#22825;&#25991;&#25968;&#25454;&#26041;&#38754;&#34920;&#29616;&#20986;&#20102;&#28508;&#21147;&#12290;&#22312;&#36825;&#20123;&#25968;&#25454;&#38598;&#20013;&#65292;&#30001;&#20110;&#22122;&#22768;&#65292;&#35266;&#27979;&#25968;&#25454;&#21487;&#33021;&#21253;&#21547;&#36127;&#20540;&#65292;&#21363;&#20351;&#30495;&#23454;&#30340;&#29289;&#29702;&#20449;&#21495;&#20005;&#26684;&#20026;&#27491;&#12290;&#20197;&#24448;&#30340;NMF&#24037;&#20316;&#26410;&#20197;&#32479;&#35745;&#19968;&#33268;&#30340;&#26041;&#24335;&#22788;&#29702;&#36127;&#25968;&#25454;&#65292;&#36825;&#22312;&#20302;&#20449;&#22122;&#27604;&#25968;&#25454;&#20013;&#20986;&#29616;&#35768;&#22810;&#36127;&#20540;&#26102;&#20250;&#21464;&#24471;&#26840;&#25163;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#31639;&#27861;&#65292;Shift-NMF&#21644;Nearly-NMF&#65292;&#21487;&#20197;&#22788;&#29702;&#36755;&#20837;&#25968;&#25454;&#30340;&#22024;&#26434;&#24615;&#65292;&#24182;&#28040;&#38500;&#20219;&#20309;&#24341;&#20837;&#30340;&#36127;&#20540;&#12290;&#36825;&#20004;&#31181;&#31639;&#27861;&#37117;&#20351;&#29992;&#36127;&#25968;&#25454;&#31354;&#38388;&#32780;&#19981;&#36827;&#34892;&#25130;&#21462;&#65292;&#24182;&#19988;&#22312;&#28040;&#38500;&#36127;&#25968;&#25454;&#26102;&#19981;&#20250;&#24341;&#20837;&#27491;&#30340;&#20559;&#31227;&#37327;&#12290;&#25105;&#20204;&#22312;&#31616;&#21333;&#21644;&#26356;&#29616;&#23454;&#30340;&#31034;&#20363;&#19978;&#36827;&#34892;&#20102;&#25968;&#20540;&#28436;&#31034;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#20004;&#31181;&#31639;&#27861;&#20855;&#26377;&#21333;&#35843;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.04855v2 Announce Type: replace-cross  Abstract: Non-negative matrix factorization (NMF) is a dimensionality reduction technique that has shown promise for analyzing noisy data, especially astronomical data. For these datasets, the observed data may contain negative values due to noise even when the true underlying physical signal is strictly positive. Prior NMF work has not treated negative data in a statistically consistent manner, which becomes problematic for low signal-to-noise data with many negative values. In this paper we present two algorithms, Shift-NMF and Nearly-NMF, that can handle both the noisiness of the input data and also any introduced negativity. Both of these algorithms use the negative data space without clipping, and correctly recover non-negative signals without any introduced positive offset that occurs when clipping negative data. We demonstrate this numerically on both simple and more realistic examples, and prove that both algorithms have monotoni
&lt;/p&gt;</description></item></channel></rss>