<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#20351;&#29992;&#22240;&#26524;&#24605;&#32500;&#36827;&#34892;&#20915;&#31574;&#30340;&#24517;&#35201;&#24615;&#21644;&#26041;&#27861;&#12290;&#36890;&#36807;&#27169;&#25311;&#38543;&#26426;&#35797;&#39564;&#26469;&#20010;&#24615;&#21270;&#20915;&#31574;&#65292;&#20197;&#20943;&#23569;&#25968;&#25454;&#20013;&#30340;&#20559;&#35265;&#12290;&#36825;&#23545;&#20110;&#20998;&#26512;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#25110;&#32034;&#36180;&#25968;&#25454;&#20197;&#24471;&#20986;&#22240;&#26524;&#32467;&#35770;&#30340;&#26368;&#37325;&#35201;&#38519;&#38449;&#21644;&#32771;&#34385;&#22240;&#32032;&#36827;&#34892;&#20102;&#37325;&#28857;&#24378;&#35843;&#12290;</title><link>http://arxiv.org/abs/2308.01605</link><description>&lt;p&gt;
&#29992;&#20110;&#20915;&#31574;&#30340;&#22240;&#26524;&#24605;&#32500;&#22312;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#30340;&#24212;&#29992;&#65306;&#20026;&#20160;&#20040;&#20197;&#21450;&#22914;&#20309;
&lt;/p&gt;
&lt;p&gt;
Causal thinking for decision making on Electronic Health Records: why and how. (arXiv:2308.01605v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01605
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#20013;&#20351;&#29992;&#22240;&#26524;&#24605;&#32500;&#36827;&#34892;&#20915;&#31574;&#30340;&#24517;&#35201;&#24615;&#21644;&#26041;&#27861;&#12290;&#36890;&#36807;&#27169;&#25311;&#38543;&#26426;&#35797;&#39564;&#26469;&#20010;&#24615;&#21270;&#20915;&#31574;&#65292;&#20197;&#20943;&#23569;&#25968;&#25454;&#20013;&#30340;&#20559;&#35265;&#12290;&#36825;&#23545;&#20110;&#20998;&#26512;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#25110;&#32034;&#36180;&#25968;&#25454;&#20197;&#24471;&#20986;&#22240;&#26524;&#32467;&#35770;&#30340;&#26368;&#37325;&#35201;&#38519;&#38449;&#21644;&#32771;&#34385;&#22240;&#32032;&#36827;&#34892;&#20102;&#37325;&#28857;&#24378;&#35843;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#30340;&#39044;&#27979;&#65292;&#22914;&#21516;&#26426;&#22120;&#23398;&#20064;&#19968;&#26679;&#65292;&#21487;&#33021;&#26080;&#27861;&#20026;&#27599;&#20010;&#24739;&#32773;&#25552;&#20379;&#26368;&#20339;&#21307;&#30103;&#20445;&#20581;&#12290;&#30830;&#23454;&#65292;&#39044;&#27979;&#21487;&#33021;&#21463;&#21040;&#25968;&#25454;&#20013;&#30340;&#25463;&#24452;&#65288;&#22914;&#31181;&#26063;&#20559;&#35265;&#65289;&#30340;&#39537;&#21160;&#12290;&#20026;&#25968;&#25454;&#39537;&#21160;&#30340;&#20915;&#31574;&#38656;&#35201;&#22240;&#26524;&#24605;&#32500;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20851;&#38190;&#35201;&#32032;&#65292;&#37325;&#28857;&#20851;&#27880;&#24120;&#35268;&#25910;&#38598;&#30340;&#25968;&#25454;&#65292;&#21363;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#65288;EHRs&#65289;&#21644;&#32034;&#36180;&#25968;&#25454;&#12290;&#20351;&#29992;&#36825;&#20123;&#25968;&#25454;&#35780;&#20272;&#24178;&#39044;&#30340;&#20215;&#20540;&#38656;&#35201;&#35880;&#24910;&#65306;&#26102;&#38388;&#20381;&#36182;&#24615;&#21644;&#29616;&#26377;&#23454;&#36341;&#24456;&#23481;&#26131;&#28151;&#28102;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#36880;&#27493;&#26694;&#26550;&#65292;&#24110;&#21161;&#20174;&#30495;&#23454;&#24739;&#32773;&#35760;&#24405;&#20013;&#26500;&#24314;&#26377;&#25928;&#30340;&#20915;&#31574;&#65292;&#36890;&#36807;&#27169;&#25311;&#38543;&#26426;&#35797;&#39564;&#26469;&#20010;&#24615;&#21270;&#20915;&#31574;&#65292;&#20363;&#22914;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#24378;&#35843;&#20102;&#20998;&#26512;EHRs&#25110;&#32034;&#36180;&#25968;&#25454;&#20197;&#24471;&#20986;&#22240;&#26524;&#32467;&#35770;&#26102;&#26368;&#37325;&#35201;&#30340;&#38519;&#38449;&#21644;&#32771;&#34385;&#22240;&#32032;&#12290;&#25105;&#20204;&#22312;&#29992;&#20110;&#37325;&#30151;&#21307;&#23398;&#20449;&#24687;&#24066;&#22330;&#20013;&#30340;&#32908;&#37200;&#23545;&#36133;&#34880;&#30151;&#27515;&#20129;&#29575;&#30340;&#24433;&#21709;&#30340;&#30740;&#31350;&#20013;&#35828;&#26126;&#20102;&#21508;&#31181;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurate predictions, as with machine learning, may not suffice to provide optimal healthcare for every patient. Indeed, prediction can be driven by shortcuts in the data, such as racial biases. Causal thinking is needed for data-driven decisions. Here, we give an introduction to the key elements, focusing on routinely-collected data, electronic health records (EHRs) and claims data. Using such data to assess the value of an intervention requires care: temporal dependencies and existing practices easily confound the causal effect. We present a step-by-step framework to help build valid decision making from real-life patient records by emulating a randomized trial before individualizing decisions, eg with machine learning. Our framework highlights the most important pitfalls and considerations in analysing EHRs or claims data to draw causal conclusions. We illustrate the various choices in studying the effect of albumin on sepsis mortality in the Medical Information Mart for Intensive C
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992;&#25913;&#36827;&#30340;&#20272;&#35745;&#22120;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#33021;&#22815;&#35299;&#20915;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#30340;&#38382;&#39064;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#65292;&#37117;&#33021;&#24471;&#21040;&#32479;&#19968;&#26377;&#25928;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2210.06639</link><description>&lt;p&gt;
&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#40065;&#26834;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Robust Estimation and Inference in Panels with Interactive Fixed Effects. (arXiv:2210.06639v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.06639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992;&#25913;&#36827;&#30340;&#20272;&#35745;&#22120;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#33021;&#22815;&#35299;&#20915;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#30340;&#38382;&#39064;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#65292;&#37117;&#33021;&#24471;&#21040;&#32479;&#19968;&#26377;&#25928;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#65288;&#21363;&#20855;&#26377;&#22240;&#23376;&#32467;&#26500;&#65289;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#20043;&#21069;&#24320;&#21457;&#30340;&#20272;&#35745;&#22120;&#21644;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#22312;&#19968;&#20123;&#22240;&#32032;&#36739;&#24369;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20855;&#26377;&#25913;&#36827;&#25910;&#25947;&#36895;&#24230;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#30340;&#20272;&#35745;&#22120;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#37117;&#33021;&#20445;&#25345;&#32479;&#19968;&#26377;&#25928;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#37319;&#29992;&#26368;&#23567;&#21270;&#32447;&#24615;&#20272;&#35745;&#29702;&#35770;&#65292;&#22312;&#21021;&#22987;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#35823;&#24046;&#19978;&#20351;&#29992;&#26680;&#33539;&#25968;&#32422;&#26463;&#26469;&#24418;&#25104;&#19968;&#20010;&#26080;&#20559;&#20272;&#35745;&#12290;&#25105;&#20204;&#21033;&#29992;&#25152;&#24471;&#20272;&#35745;&#26500;&#24314;&#19968;&#20010;&#32771;&#34385;&#21040;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#21097;&#20313;&#20559;&#24046;&#30340;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#12290;&#22312;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#22240;&#32032;&#36739;&#24369;&#30340;&#24773;&#20917;&#19979;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#26377;&#26174;&#33879;&#25913;&#36827;&#65292;&#24182;&#19988;&#22312;&#22240;&#32032;&#36739;&#24378;&#30340;&#24773;&#20917;&#19979;&#20960;&#20046;&#27809;&#26377;&#20272;&#35745;&#35823;&#24046;&#30340;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation and inference for a regression coefficient in panels with interactive fixed effects (i.e., with a factor structure). We show that previously developed estimators and confidence intervals (CIs) might be heavily biased and size-distorted when some of the factors are weak. We propose estimators with improved rates of convergence and bias-aware CIs that are uniformly valid regardless of whether the factors are strong or not. Our approach applies the theory of minimax linear estimation to form a debiased estimate using a nuclear norm bound on the error of an initial estimate of the interactive fixed effects. We use the obtained estimate to construct a bias-aware CI taking into account the remaining bias due to weak factors. In Monte Carlo experiments, we find a substantial improvement over conventional approaches when factors are weak, with little cost to estimation error when factors are strong.
&lt;/p&gt;</description></item></channel></rss>