<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20026;&#20102;&#35299;&#20915;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#20013;"&#37325;&#21472;"&#20551;&#35774;&#30340;&#38382;&#39064;&#30340;&#28608;&#21169;&#24863;&#30693;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#28608;&#21169;&#21333;&#20301;&#37319;&#21462;&#36890;&#24120;&#19981;&#20250;&#32771;&#34385;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#25552;&#20379;&#19982;&#28608;&#21169;&#30456;&#23481;&#30340;&#24178;&#39044;&#24314;&#35758;&#65292;&#20174;&#32780;&#23454;&#29616;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#20934;&#30830;&#20272;&#35745;&#21453;&#20107;&#23454;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2312.16307</link><description>&lt;p&gt;
&#28608;&#21169;&#24863;&#30693;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65306;&#36890;&#36807;&#28608;&#21169;&#25506;&#32034;&#36827;&#34892;&#20934;&#30830;&#30340;&#21453;&#20107;&#23454;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Incentive-Aware Synthetic Control: Accurate Counterfactual Estimation via Incentivized Exploration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.16307
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20026;&#20102;&#35299;&#20915;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#20013;"&#37325;&#21472;"&#20551;&#35774;&#30340;&#38382;&#39064;&#30340;&#28608;&#21169;&#24863;&#30693;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#28608;&#21169;&#21333;&#20301;&#37319;&#21462;&#36890;&#24120;&#19981;&#20250;&#32771;&#34385;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#25552;&#20379;&#19982;&#28608;&#21169;&#30456;&#23481;&#30340;&#24178;&#39044;&#24314;&#35758;&#65292;&#20174;&#32780;&#23454;&#29616;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#20934;&#30830;&#20272;&#35745;&#21453;&#20107;&#23454;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65288;SCMs&#65289;&#30340;&#35774;&#23450;&#65292;&#36825;&#26159;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#20272;&#35745;&#34987;&#27835;&#30103;&#23545;&#35937;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#32463;&#20856;&#26041;&#27861;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;SCMs&#20013;&#32463;&#24120;&#34987;&#24573;&#35270;&#20294;&#26222;&#36941;&#23384;&#22312;&#30340;&#8220;&#37325;&#21472;&#8221;&#20551;&#35774;&#65306;&#19968;&#20010;&#34987;&#27835;&#30103;&#30340;&#21333;&#20301;&#21487;&#20197;&#34987;&#20889;&#25104;&#20445;&#25345;&#25511;&#21046;&#30340;&#21333;&#20301;&#30340;&#26576;&#31181;&#32452;&#21512;&#65288;&#36890;&#24120;&#26159;&#20984;&#25110;&#32447;&#24615;&#32452;&#21512;&#65289;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#21333;&#20301;&#36873;&#25321;&#33258;&#24049;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#24182;&#19988;&#21333;&#20301;&#20043;&#38388;&#30340;&#24322;&#36136;&#24615;&#36275;&#22815;&#22823;&#65292;&#20197;&#33267;&#20110;&#20182;&#20204;&#20559;&#22909;&#19981;&#21516;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#37325;&#21472;&#23558;&#19981;&#25104;&#31435;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#36890;&#36807;&#28608;&#21169;&#20855;&#26377;&#19981;&#21516;&#20559;&#22909;&#30340;&#21333;&#20301;&#26469;&#37319;&#21462;&#20182;&#20204;&#36890;&#24120;&#19981;&#20250;&#32771;&#34385;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#21033;&#29992;&#20449;&#24687;&#35774;&#35745;&#21644;&#22312;&#32447;&#23398;&#20064;&#30340;&#24037;&#20855;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;SCM&#65292;&#36890;&#36807;&#20026;&#21333;&#20301;&#25552;&#20379;&#19982;&#28608;&#21169;&#30456;&#23481;&#30340;&#24178;&#39044;&#24314;&#35758;&#65292;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#28608;&#21169;&#25506;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.16307v2 Announce Type: replace-cross Abstract: We consider the setting of synthetic control methods (SCMs), a canonical approach used to estimate the treatment effect on the treated in a panel data setting. We shed light on a frequently overlooked but ubiquitous assumption made in SCMs of "overlap": a treated unit can be written as some combination -- typically, convex or linear combination -- of the units that remain under control. We show that if units select their own interventions, and there is sufficiently large heterogeneity between units that prefer different interventions, overlap will not hold. We address this issue by proposing a framework which incentivizes units with different preferences to take interventions they would not normally consider. Specifically, leveraging tools from information design and online learning, we propose a SCM that incentivizes exploration in panel data settings by providing incentive-compatible intervention recommendations to units. We e
&lt;/p&gt;</description></item></channel></rss>