<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Ising&#27169;&#22411;&#20013;&#30340;&#24352;&#37327;&#23398;&#20064;&#20013;&#65292;&#36890;&#36807;&#20266;&#20284;&#28982;&#26041;&#27861;&#21644;&#30456;&#20114;&#20316;&#29992;&#31579;&#36873;&#26041;&#27861;&#21487;&#20197;&#24674;&#22797;&#20986;&#24213;&#23618;&#30340;&#36229;&#32593;&#32476;&#32467;&#26500;&#65292;&#24182;&#19988;&#24615;&#33021;&#27604;&#36739;&#34920;&#26126;&#24352;&#37327;&#24674;&#22797;&#36895;&#29575;&#19982;&#26368;&#22823;&#32806;&#21512;&#24378;&#24230;&#21576;&#25351;&#25968;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2310.13232</link><description>&lt;p&gt;
Ising&#27169;&#22411;&#20013;&#30340;&#24352;&#37327;&#23398;&#20064;&#30340;&#30456;&#20114;&#20316;&#29992;&#31579;&#36873;&#21644;&#20266;&#20284;&#28982;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Interaction Screening and Pseudolikelihood Approaches for Tensor Learning in Ising Models. (arXiv:2310.13232v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.13232
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;Ising&#27169;&#22411;&#20013;&#30340;&#24352;&#37327;&#23398;&#20064;&#20013;&#65292;&#36890;&#36807;&#20266;&#20284;&#28982;&#26041;&#27861;&#21644;&#30456;&#20114;&#20316;&#29992;&#31579;&#36873;&#26041;&#27861;&#21487;&#20197;&#24674;&#22797;&#20986;&#24213;&#23618;&#30340;&#36229;&#32593;&#32476;&#32467;&#26500;&#65292;&#24182;&#19988;&#24615;&#33021;&#27604;&#36739;&#34920;&#26126;&#24352;&#37327;&#24674;&#22797;&#36895;&#29575;&#19982;&#26368;&#22823;&#32806;&#21512;&#24378;&#24230;&#21576;&#25351;&#25968;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;$k$-spin Ising&#27169;&#22411;&#20013;&#30340;&#24352;&#37327;&#24674;&#22797;&#20013;&#65292;&#20266;&#20284;&#28982;&#26041;&#27861;&#21644;&#30456;&#20114;&#20316;&#29992;&#31579;&#36873;&#26041;&#27861;&#20004;&#31181;&#24050;&#30693;&#30340;Ising&#32467;&#26500;&#23398;&#20064;&#26041;&#27861;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#36866;&#24403;&#30340;&#27491;&#21017;&#21270;&#19979;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#21487;&#20197;&#20351;&#29992;&#26679;&#26412;&#25968;&#23545;&#25968;&#32423;&#21035;&#22823;&#23567;&#30340;&#26679;&#26412;&#24674;&#22797;&#20986;&#24213;&#23618;&#30340;&#36229;&#32593;&#32476;&#32467;&#26500;&#65292;&#19988;&#19982;&#26368;&#22823;&#30456;&#20114;&#20316;&#29992;&#24378;&#24230;&#21644;&#26368;&#22823;&#33410;&#28857;&#24230;&#25351;&#25968;&#32423;&#20381;&#36182;&#12290;&#25105;&#20204;&#36824;&#23545;&#36825;&#20004;&#31181;&#26041;&#27861;&#30340;&#24352;&#37327;&#24674;&#22797;&#36895;&#29575;&#19982;&#20132;&#20114;&#38454;&#25968;$k$&#30340;&#30830;&#20999;&#20851;&#31995;&#36827;&#34892;&#20102;&#36319;&#36394;&#65292;&#24182;&#20801;&#35768;$k$&#38543;&#26679;&#26412;&#25968;&#21644;&#33410;&#28857;&#25968;&#22686;&#38271;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#20223;&#30495;&#30740;&#31350;&#23545;&#36825;&#20004;&#31181;&#26041;&#27861;&#30340;&#24615;&#33021;&#36827;&#34892;&#20102;&#27604;&#36739;&#35752;&#35770;&#65292;&#32467;&#26524;&#20063;&#26174;&#31034;&#20102;&#24352;&#37327;&#24674;&#22797;&#36895;&#29575;&#19982;&#26368;&#22823;&#32806;&#21512;&#24378;&#24230;&#20043;&#38388;&#30340;&#25351;&#25968;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study two well known methods of Ising structure learning, namely the pseudolikelihood approach and the interaction screening approach, in the context of tensor recovery in $k$-spin Ising models. We show that both these approaches, with proper regularization, retrieve the underlying hypernetwork structure using a sample size logarithmic in the number of network nodes, and exponential in the maximum interaction strength and maximum node-degree. We also track down the exact dependence of the rate of tensor recovery on the interaction order $k$, that is allowed to grow with the number of samples and nodes, for both the approaches. Finally, we provide a comparative discussion of the performance of the two approaches based on simulation studies, which also demonstrate the exponential dependence of the tensor recovery rate on the maximum coupling strength.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#38750;&#21442;&#25968;&#20202;&#22120;&#21464;&#37327;&#27169;&#22411;&#20013;&#30340;&#32467;&#26500;&#20989;&#25968;&#30340;&#19981;&#31561;&#24335;&#21644;&#31561;&#24335;&#38480;&#21046;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#36866;&#24212;&#26410;&#30693;&#30340;&#24179;&#28369;&#24230;&#21644;&#24037;&#20855;&#24378;&#24230;&#65292;&#24182;&#36798;&#21040;&#20102;&#26368;&#23567;&#20540;&#29575;&#30340;&#33258;&#36866;&#24212;&#26368;&#20248;&#26816;&#39564;&#29575;&#12290;</title><link>http://arxiv.org/abs/2006.09587</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;IV&#27169;&#22411;&#20013;&#30340;&#33258;&#36866;&#24212;&#39640;&#25928;&#20551;&#35774;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Adaptive, Rate-Optimal Hypothesis Testing in Nonparametric IV Models. (arXiv:2006.09587v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2006.09587
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#38750;&#21442;&#25968;&#20202;&#22120;&#21464;&#37327;&#27169;&#22411;&#20013;&#30340;&#32467;&#26500;&#20989;&#25968;&#30340;&#19981;&#31561;&#24335;&#21644;&#31561;&#24335;&#38480;&#21046;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#36866;&#24212;&#26410;&#30693;&#30340;&#24179;&#28369;&#24230;&#21644;&#24037;&#20855;&#24378;&#24230;&#65292;&#24182;&#36798;&#21040;&#20102;&#26368;&#23567;&#20540;&#29575;&#30340;&#33258;&#36866;&#24212;&#26368;&#20248;&#26816;&#39564;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#36866;&#24212;&#20551;&#35774;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#38750;&#21442;&#25968;&#20202;&#22120;&#21464;&#37327;&#65288;NPIV&#65289;&#27169;&#22411;&#20013;&#32467;&#26500;&#20989;&#25968;&#30340;&#19981;&#31561;&#24335;&#65288;&#22914;&#21333;&#35843;&#24615;&#12289;&#20984;&#24615;&#65289;&#21644;&#31561;&#24335;&#65288;&#22914;&#21442;&#25968;&#12289;&#21322;&#21442;&#25968;&#65289;&#38480;&#21046;&#12290;&#25105;&#20204;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#22522;&#20110;&#20462;&#25913;&#29256;&#30340;&#30041;&#19968;&#27861;&#26679;&#26412;&#27169;&#25311;&#65292;&#35745;&#31639;&#21463;&#38480;&#21644;&#19981;&#21463;&#38480;&#31579;&#23376;NPIV&#20272;&#35745;&#37327;&#38388;&#30340;&#20108;&#27425;&#36317;&#31163;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#35745;&#31639;&#31616;&#21333;&#12289;&#25968;&#25454;&#39537;&#21160;&#30340;&#31579;&#23376;&#35843;&#21442;&#21644;Bonferroni&#35843;&#25972;&#21345;&#26041;&#20020;&#30028;&#20540;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#26816;&#39564;&#36866;&#24212;&#26410;&#30693;&#30340;&#20869;&#29983;&#24615;&#24179;&#28369;&#24230;&#21644;&#24037;&#20855;&#24378;&#24230;&#65292;&#36798;&#21040;&#20102;$L^2$&#26368;&#23567;&#20540;&#29575;&#30340;&#33258;&#36866;&#24212;&#26368;&#20248;&#26816;&#39564;&#29575;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;&#22797;&#21512;&#38646;&#20551;&#35774;&#19979;&#20854;&#31867;&#22411;I&#35823;&#24046;&#30340;&#24635;&#20307;&#21644;&#20854;&#31867;&#22411;II&#35823;&#24046;&#30340;&#24635;&#20307;&#22343;&#19981;&#33021;&#34987;&#20219;&#20309;&#20854;&#20182;NPIV&#27169;&#22411;&#30340;&#20551;&#35774;&#26816;&#39564;&#25152;&#25552;&#39640;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#22522;&#20110;&#25968;&#25454;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new adaptive hypothesis test for inequality (e.g., monotonicity, convexity) and equality (e.g., parametric, semiparametric) restrictions on a structural function in a nonparametric instrumental variables (NPIV) model. Our test statistic is based on a modified leave-one-out sample analog of a quadratic distance between the restricted and unrestricted sieve NPIV estimators. We provide computationally simple, data-driven choices of sieve tuning parameters and Bonferroni adjusted chi-squared critical values. Our test adapts to the unknown smoothness of alternative functions in the presence of unknown degree of endogeneity and unknown strength of the instruments. It attains the adaptive minimax rate of testing in $L^2$.  That is, the sum of its type I error uniformly over the composite null and its type II error uniformly over nonparametric alternative models cannot be improved by any other hypothesis test for NPIV models of unknown regularities. Data-driven confidence sets in 
&lt;/p&gt;</description></item></channel></rss>