<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#23558;&#28857;&#39044;&#27979;&#36716;&#25442;&#20026;&#27010;&#29575;&#39044;&#27979;&#30340;&#30005;&#21147;&#20215;&#26684;&#21518;&#22788;&#29702;&#26041;&#27861;&#20013;&#65292;&#32467;&#21512;Isotonic Distributional Regression&#19982;&#20854;&#20182;&#20004;&#31181;&#26041;&#27861;&#30340;&#39044;&#27979;&#20998;&#24067;&#21487;&#20197;&#23454;&#29616;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;</title><link>https://arxiv.org/abs/2404.02270</link><description>&lt;p&gt;
&#30005;&#21147;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#30340;&#28857;&#39044;&#27979;&#21518;&#22788;&#29702;&#65306;&#22810;&#26679;&#24615;&#33267;&#20851;&#37325;&#35201;
&lt;/p&gt;
&lt;p&gt;
Postprocessing of point predictions for probabilistic forecasting of electricity prices: Diversity matters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02270
&lt;/p&gt;
&lt;p&gt;
&#23558;&#28857;&#39044;&#27979;&#36716;&#25442;&#20026;&#27010;&#29575;&#39044;&#27979;&#30340;&#30005;&#21147;&#20215;&#26684;&#21518;&#22788;&#29702;&#26041;&#27861;&#20013;&#65292;&#32467;&#21512;Isotonic Distributional Regression&#19982;&#20854;&#20182;&#20004;&#31181;&#26041;&#27861;&#30340;&#39044;&#27979;&#20998;&#24067;&#21487;&#20197;&#23454;&#29616;&#26174;&#33879;&#30340;&#24615;&#33021;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20381;&#36182;&#20110;&#30005;&#21147;&#20215;&#26684;&#30340;&#39044;&#27979;&#20998;&#24067;&#36827;&#34892;&#25805;&#20316;&#20915;&#31574;&#30456;&#36739;&#20110;&#20165;&#22522;&#20110;&#28857;&#39044;&#27979;&#30340;&#20915;&#31574;&#21487;&#20197;&#24102;&#26469;&#26174;&#33879;&#26356;&#39640;&#30340;&#21033;&#28070;&#12290;&#28982;&#32780;&#65292;&#22312;&#23398;&#26415;&#21644;&#24037;&#19994;&#29615;&#22659;&#20013;&#24320;&#21457;&#30340;&#22823;&#22810;&#25968;&#27169;&#22411;&#20165;&#25552;&#20379;&#28857;&#39044;&#27979;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19977;&#31181;&#23558;&#28857;&#39044;&#27979;&#36716;&#25442;&#20026;&#27010;&#29575;&#39044;&#27979;&#30340;&#21518;&#22788;&#29702;&#26041;&#27861;&#65306;&#20998;&#20301;&#25968;&#22238;&#24402;&#24179;&#22343;&#12289;&#19968;&#33268;&#24615;&#39044;&#27979;&#21644;&#26368;&#36817;&#24341;&#20837;&#30340;&#31561;&#28201;&#20998;&#24067;&#22238;&#24402;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#34429;&#28982;&#31561;&#28201;&#20998;&#24067;&#22238;&#24402;&#34920;&#29616;&#26368;&#20026;&#22810;&#26679;&#21270;&#65292;&#20294;&#23558;&#20854;&#39044;&#27979;&#20998;&#24067;&#19982;&#21478;&#22806;&#20004;&#31181;&#26041;&#27861;&#32467;&#21512;&#20351;&#29992;&#65292;&#30456;&#36739;&#20110;&#20855;&#26377;&#27491;&#24577;&#20998;&#24067;&#35823;&#24046;&#30340;&#22522;&#20934;&#27169;&#22411;&#65292;&#22312;&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30340;4.5&#24180;&#27979;&#35797;&#26399;&#38388;&#65288;&#28085;&#30422;COVID&#22823;&#27969;&#34892;&#21644;&#20044;&#20811;&#20848;&#25112;&#20105;&#65289;&#65292;&#23454;&#29616;&#20102;&#32422;7.5%&#30340;&#25913;&#36827;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#31181;&#32452;&#21512;&#30340;&#24615;&#33021;&#19982;&#26368;&#20808;&#36827;&#30340;Dis
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02270v1 Announce Type: new  Abstract: Operational decisions relying on predictive distributions of electricity prices can result in significantly higher profits compared to those based solely on point forecasts. However, the majority of models developed in both academic and industrial settings provide only point predictions. To address this, we examine three postprocessing methods for converting point forecasts into probabilistic ones: Quantile Regression Averaging, Conformal Prediction, and the recently introduced Isotonic Distributional Regression. We find that while IDR demonstrates the most varied performance, combining its predictive distributions with those of the other two methods results in an improvement of ca. 7.5% compared to a benchmark model with normally distributed errors, over a 4.5-year test period in the German power market spanning the COVID pandemic and the war in Ukraine. Remarkably, the performance of this combination is at par with state-of-the-art Dis
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#27169;&#25311;&#20445;&#38505;&#27450;&#35784;&#32593;&#32476;&#25968;&#25454;&#30340;&#24341;&#25806;&#65292;&#21033;&#29992;&#32034;&#36180;&#28041;&#21450;&#26041;&#30340;&#31038;&#20132;&#32593;&#32476;&#29305;&#24449;&#36827;&#34892;&#23398;&#20064;&#26041;&#27861;&#65292;&#26088;&#22312;&#24320;&#21457;&#39640;&#25928;&#20934;&#30830;&#30340;&#27450;&#35784;&#26816;&#27979;&#27169;&#22411;&#12290;&#20294;&#38754;&#20020;&#31867;&#21035;&#19981;&#24179;&#34913;&#12289;&#22823;&#37327;&#26410;&#26631;&#35760;&#25968;&#25454;&#21644;&#32570;&#20047;&#20844;&#24320;&#25968;&#25454;&#31561;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2308.11659</link><description>&lt;p&gt;
&#19968;&#31181;&#27169;&#25311;&#20445;&#38505;&#27450;&#35784;&#32593;&#32476;&#25968;&#25454;&#30340;&#24341;&#25806;
&lt;/p&gt;
&lt;p&gt;
An engine to simulate insurance fraud network data. (arXiv:2308.11659v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11659
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#27169;&#25311;&#20445;&#38505;&#27450;&#35784;&#32593;&#32476;&#25968;&#25454;&#30340;&#24341;&#25806;&#65292;&#21033;&#29992;&#32034;&#36180;&#28041;&#21450;&#26041;&#30340;&#31038;&#20132;&#32593;&#32476;&#29305;&#24449;&#36827;&#34892;&#23398;&#20064;&#26041;&#27861;&#65292;&#26088;&#22312;&#24320;&#21457;&#39640;&#25928;&#20934;&#30830;&#30340;&#27450;&#35784;&#26816;&#27979;&#27169;&#22411;&#12290;&#20294;&#38754;&#20020;&#31867;&#21035;&#19981;&#24179;&#34913;&#12289;&#22823;&#37327;&#26410;&#26631;&#35760;&#25968;&#25454;&#21644;&#32570;&#20047;&#20844;&#24320;&#25968;&#25454;&#31561;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20256;&#32479;&#19978;&#65292;&#26816;&#27979;&#20445;&#38505;&#27450;&#35784;&#32034;&#36180;&#20381;&#36182;&#20110;&#19994;&#21153;&#35268;&#21017;&#21644;&#19987;&#23478;&#21028;&#26029;&#65292;&#36825;&#20351;&#24471;&#36825;&#19968;&#36807;&#31243;&#32791;&#26102;&#19988;&#26114;&#36149;&#12290;&#22240;&#27492;&#65292;&#30740;&#31350;&#20154;&#21592;&#19968;&#30452;&#22312;&#25506;&#32034;&#24320;&#21457;&#39640;&#25928;&#20934;&#30830;&#30340;&#20998;&#26512;&#31574;&#30053;&#26469;&#26631;&#35760;&#21487;&#30097;&#32034;&#36180;&#12290;&#20174;&#32034;&#36180;&#28041;&#21450;&#26041;&#30340;&#31038;&#20132;&#32593;&#32476;&#20013;&#25552;&#21462;&#29305;&#24449;&#24182;&#23558;&#20854;&#39304;&#36865;&#32473;&#23398;&#20064;&#26041;&#27861;&#26159;&#19968;&#31181;&#29305;&#21035;&#26377;&#28508;&#21147;&#30340;&#31574;&#30053;&#12290;&#28982;&#32780;&#65292;&#22312;&#24320;&#21457;&#27450;&#35784;&#26816;&#27979;&#27169;&#22411;&#26102;&#65292;&#25105;&#20204;&#38754;&#20020;&#30528;&#20960;&#20010;&#25361;&#25112;&#12290;&#20363;&#22914;&#65292;&#27450;&#35784;&#30340;&#38750;&#24120;&#35268;&#24615;&#36136;&#23548;&#33268;&#20102;&#39640;&#24230;&#30340;&#31867;&#21035;&#19981;&#24179;&#34913;&#65292;&#36825;&#22686;&#21152;&#20102;&#24320;&#21457;&#24615;&#33021;&#33391;&#22909;&#30340;&#20998;&#26512;&#20998;&#31867;&#27169;&#22411;&#30340;&#38590;&#24230;&#12290;&#27492;&#22806;&#65292;&#21482;&#26377;&#23569;&#25968;&#32034;&#36180;&#24471;&#21040;&#35843;&#26597;&#21644;&#26631;&#31614;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#22823;&#37327;&#26410;&#26631;&#35760;&#30340;&#25968;&#25454;&#12290;&#21478;&#19968;&#20010;&#25361;&#25112;&#26159;&#32570;&#20047;&#20844;&#24320;&#21487;&#29992;&#30340;&#25968;&#25454;&#65292;&#36825;&#22952;&#30861;&#20102;&#30740;&#31350;&#21644;&#27169;&#22411;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Traditionally, the detection of fraudulent insurance claims relies on business rules and expert judgement which makes it a time-consuming and expensive process (\'Oskarsd\'ottir et al., 2022). Consequently, researchers have been examining ways to develop efficient and accurate analytic strategies to flag suspicious claims. Feeding learning methods with features engineered from the social network of parties involved in a claim is a particularly promising strategy (see for example Van Vlasselaer et al. (2016); Tumminello et al. (2023)). When developing a fraud detection model, however, we are confronted with several challenges. The uncommon nature of fraud, for example, creates a high class imbalance which complicates the development of well performing analytic classification models. In addition, only a small number of claims are investigated and get a label, which results in a large corpus of unlabeled data. Yet another challenge is the lack of publicly available data. This hinders not 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;CST-YOLO&#31639;&#27861;&#65292;&#22522;&#20110;&#25913;&#36827;&#30340;YOLOv7&#21644;CNN-Swin Transformer&#65292;&#24341;&#20837;&#20102;&#20960;&#20010;&#26377;&#29992;&#30340;&#27169;&#22411;&#65292;&#26377;&#25928;&#25552;&#39640;&#20102;&#34880;&#32454;&#32990;&#26816;&#27979;&#31934;&#24230;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#20854;&#22312;&#19977;&#20010;&#34880;&#32454;&#32990;&#25968;&#25454;&#38598;&#19978;&#22343;&#20248;&#20110;&#29616;&#26377;&#26368;&#20808;&#36827;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2306.14590</link><description>&lt;p&gt;
CST-YOLO: &#19968;&#31181;&#22522;&#20110;&#25913;&#36827;&#30340;YOLOv7&#21644;CNN-Swin Transformer&#30340;&#34880;&#32454;&#32990;&#26816;&#27979;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
CST-YOLO: A Novel Method for Blood Cell Detection Based on Improved YOLOv7 and CNN-Swin Transformer. (arXiv:2306.14590v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14590
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;CST-YOLO&#31639;&#27861;&#65292;&#22522;&#20110;&#25913;&#36827;&#30340;YOLOv7&#21644;CNN-Swin Transformer&#65292;&#24341;&#20837;&#20102;&#20960;&#20010;&#26377;&#29992;&#30340;&#27169;&#22411;&#65292;&#26377;&#25928;&#25552;&#39640;&#20102;&#34880;&#32454;&#32990;&#26816;&#27979;&#31934;&#24230;&#65292;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#20854;&#22312;&#19977;&#20010;&#34880;&#32454;&#32990;&#25968;&#25454;&#38598;&#19978;&#22343;&#20248;&#20110;&#29616;&#26377;&#26368;&#20808;&#36827;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34880;&#32454;&#32990;&#26816;&#27979;&#26159;&#35745;&#31639;&#26426;&#35270;&#35273;&#20013;&#20856;&#22411;&#30340;&#23567;&#29289;&#20307;&#26816;&#27979;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;CST-YOLO&#27169;&#22411;&#65292;&#22522;&#20110;YOLOv7&#32467;&#26500;&#24182;&#20351;&#29992;CNN-Swin Transformer&#65288;CST&#65289;&#36827;&#34892;&#22686;&#24378;&#65292;&#36825;&#26159;&#19968;&#31181;CNN-Transformer&#34701;&#21512;&#30340;&#26032;&#23581;&#35797;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#19977;&#20010;&#26377;&#29992;&#30340;&#27169;&#22411;&#65306;&#21152;&#26435;&#39640;&#25928;&#23618;&#32858;&#21512;&#32593;&#32476;&#65288;W-ELAN&#65289;&#12289;&#22810;&#23610;&#24230;&#36890;&#36947;&#20998;&#21106;&#65288;MCS&#65289;&#21644;&#32423;&#32852;&#21367;&#31215;&#23618;&#65288;CatConv&#65289;&#65292;&#20197;&#25552;&#39640;&#23567;&#29289;&#20307;&#26816;&#27979;&#31934;&#24230;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;CST-YOLO&#22312;&#19977;&#20010;&#34880;&#32454;&#32990;&#25968;&#25454;&#38598;&#19978;&#20998;&#21035;&#36798;&#21040;&#20102;92.7&#12289;95.6&#21644;91.1 mAP@0.5&#65292;&#20248;&#20110;&#26368;&#20808;&#36827;&#30340;&#29289;&#20307;&#26816;&#27979;&#22120;&#65292;&#22914;YOLOv5&#21644;YOLOv7&#12290;&#25105;&#20204;&#30340;&#20195;&#30721;&#21487;&#22312;https://github.com/mkang315/CST-YOLO&#19978;&#25214;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blood cell detection is a typical small-scale object detection problem in computer vision. In this paper, we propose a CST-YOLO model for blood cell detection based on YOLOv7 architecture and enhance it with the CNN-Swin Transformer (CST), which is a new attempt at CNN-Transformer fusion. We also introduce three other useful modules: Weighted Efficient Layer Aggregation Networks (W-ELAN), Multiscale Channel Split (MCS), and Concatenate Convolutional Layers (CatConv) in our CST-YOLO to improve small-scale object detection precision. Experimental results show that the proposed CST-YOLO achieves 92.7, 95.6, and 91.1 mAP@0.5 respectively on three blood cell datasets, outperforming state-of-the-art object detectors, e.g., YOLOv5 and YOLOv7. Our code is available at https://github.com/mkang315/CST-YOLO.
&lt;/p&gt;</description></item></channel></rss>