<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#23558;&#31163;&#25955;&#29366;&#24577;&#21644;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#32452;&#21512;&#65292;&#26500;&#24314;&#20986;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2308.00913</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
The Bayesian Context Trees State Space Model for time series modelling and forecasting. (arXiv:2308.00913v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00913
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#23558;&#31163;&#25955;&#29366;&#24577;&#21644;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#32452;&#21512;&#65292;&#26500;&#24314;&#20986;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#20010;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#29992;&#20110;&#24320;&#21457;&#29992;&#20110;&#30495;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#30340;&#20016;&#23500;&#28151;&#21512;&#27169;&#22411;&#65292;&#20197;&#21450;&#19968;&#31995;&#21015;&#26377;&#25928;&#30340;&#23398;&#20064;&#21644;&#25512;&#26029;&#24037;&#20855;&#12290;&#22312;&#39030;&#23618;&#65292;&#36890;&#36807;&#36866;&#24403;&#37327;&#21270;&#26368;&#36817;&#26679;&#26412;&#30340;&#19968;&#20123;&#26377;&#24847;&#20041;&#30340;&#31163;&#25955;&#29366;&#24577;&#26469;&#36827;&#34892;&#37492;&#23450;&#12290;&#36825;&#20123;&#21487;&#35266;&#23519;&#29366;&#24577;&#30340;&#38598;&#21512;&#34987;&#25551;&#36848;&#20026;&#31163;&#25955;&#30340;&#19978;&#19979;&#25991;&#26641;&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#22312;&#24213;&#23618;&#65292;&#23558;&#19968;&#20010;&#19981;&#21516;&#30340;&#12289;&#20219;&#24847;&#30340;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65288;&#22522;&#26412;&#27169;&#22411;&#65289;&#19982;&#27599;&#20010;&#29366;&#24577;&#30456;&#20851;&#32852;&#12290;&#36825;&#23450;&#20041;&#20102;&#19968;&#20010;&#38750;&#24120;&#36890;&#29992;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#19982;&#20219;&#20309;&#29616;&#26377;&#27169;&#22411;&#31867;&#19968;&#36215;&#20351;&#29992;&#65292;&#26500;&#24314;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#12290;&#25105;&#20204;&#23558;&#20854;&#31216;&#20026;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65292;&#25110;&#32773;BCT-X&#26694;&#26550;&#12290;&#24341;&#20837;&#20102;&#39640;&#25928;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#23454;&#29616;&#26377;&#25928;&#30340;&#12289;&#31934;&#30830;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#65307;&#29305;&#21035;&#26159;&#21487;&#20197;&#30830;&#23450;&#26368;&#22823;&#21518;&#39564;&#27010;&#29575;&#65288;MAP&#65289;&#19978;&#19979;&#25991;&#26641;&#27169;&#22411;&#12290;&#36825;&#20123;&#31639;&#27861;&#21487;&#20197;&#39034;&#24207;&#26356;&#26032;&#65292;&#20197;&#20415;&#23454;&#29616;&#26377;&#25928;&#30340;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
A hierarchical Bayesian framework is introduced for developing rich mixture models for real-valued time series, along with a collection of effective tools for learning and inference. At the top level, meaningful discrete states are identified as appropriately quantised values of some of the most recent samples. This collection of observable states is described as a discrete context-tree model. Then, at the bottom level, a different, arbitrary model for real-valued time series - a base model - is associated with each state. This defines a very general framework that can be used in conjunction with any existing model class to build flexible and interpretable mixture models. We call this the Bayesian Context Trees State Space Model, or the BCT-X framework. Efficient algorithms are introduced that allow for effective, exact Bayesian inference; in particular, the maximum a posteriori probability (MAP) context-tree model can be identified. These algorithms can be updated sequentially, facili
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#21019;&#26032;&#30340;&#25628;&#32034;&#31639;&#27861;&#65292;&#22312;&#39640;&#32500;&#22270;&#32467;&#26500;&#23398;&#20064;&#20013;&#20351;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;&#35299;&#20915;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#30701;&#26102;&#38388;&#20869;&#29983;&#25104;&#21487;&#38752;&#30340;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;R&#36719;&#20214;&#21253;BDgraph&#30340;&#20195;&#30721;&#23454;&#29616;&#12290;</title><link>http://arxiv.org/abs/2307.00127</link><description>&lt;p&gt;
&#39640;&#32500;&#36125;&#21494;&#26031;&#39640;&#26031;&#22270;&#27169;&#22411;&#20013;&#30340;&#32467;&#26500;&#23398;&#20064;&#26041;&#27861;&#8212;&#8212;&#21033;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
High-Dimensional Bayesian Structure Learning in Gaussian Graphical Models using Marginal Pseudo-Likelihood. (arXiv:2307.00127v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00127
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#21019;&#26032;&#30340;&#25628;&#32034;&#31639;&#27861;&#65292;&#22312;&#39640;&#32500;&#22270;&#32467;&#26500;&#23398;&#20064;&#20013;&#20351;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;&#35299;&#20915;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#30701;&#26102;&#38388;&#20869;&#29983;&#25104;&#21487;&#38752;&#30340;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;R&#36719;&#20214;&#21253;BDgraph&#30340;&#20195;&#30721;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#26031;&#22270;&#27169;&#22411;&#20197;&#22270;&#24418;&#24418;&#24335;&#25551;&#32472;&#20102;&#22810;&#20803;&#27491;&#24577;&#20998;&#24067;&#20013;&#21464;&#37327;&#20043;&#38388;&#30340;&#26465;&#20214;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#20004;&#31181;&#21019;&#26032;&#30340;&#25628;&#32034;&#31639;&#27861;&#65292;&#21033;&#29992;&#36793;&#38469;&#20266;&#20284;&#28982;&#20989;&#25968;&#26469;&#24212;&#23545;&#39640;&#32500;&#22270;&#32467;&#26500;&#23398;&#20064;&#20013;&#30340;&#35745;&#31639;&#22797;&#26434;&#24615;&#38382;&#39064;&#12290;&#36825;&#20123;&#26041;&#27861;&#21487;&#20197;&#22312;&#26631;&#20934;&#35745;&#31639;&#26426;&#19978;&#22312;&#20960;&#20998;&#38047;&#20869;&#24555;&#36895;&#29983;&#25104;&#23545;&#21253;&#21547;1000&#20010;&#21464;&#37327;&#30340;&#38382;&#39064;&#30340;&#21487;&#38752;&#20272;&#35745;&#12290;&#23545;&#20110;&#23545;&#23454;&#38469;&#24212;&#29992;&#24863;&#20852;&#36259;&#30340;&#20154;&#65292;&#25903;&#25345;&#36825;&#31181;&#26032;&#26041;&#27861;&#30340;&#20195;&#30721;&#36890;&#36807;R&#36719;&#20214;&#21253;BDgraph&#25552;&#20379;&#12290;
&lt;/p&gt;
&lt;p&gt;
Gaussian graphical models depict the conditional dependencies between variables within a multivariate normal distribution in a graphical format. The identification of these graph structures is an area known as structure learning. However, when utilizing Bayesian methodologies in structure learning, computational complexities can arise, especially with high-dimensional graphs surpassing 250 nodes. This paper introduces two innovative search algorithms that employ marginal pseudo-likelihood to address this computational challenge. These methods can swiftly generate reliable estimations for problems encompassing 1000 variables in just a few minutes on standard computers. For those interested in practical applications, the code supporting this new approach is made available through the R package BDgraph.
&lt;/p&gt;</description></item></channel></rss>