<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>DHQRN&#21487;&#20197;&#39044;&#27979;&#26356;&#19968;&#33324;&#30340;Huber&#20998;&#20301;&#25968;&#65292;&#24182;&#19988;&#22312;&#39044;&#27979;&#20998;&#24067;&#30340;&#23614;&#37096;&#25552;&#20379;&#26356;&#22909;&#30340;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2306.10306</link><description>&lt;p&gt;
&#28145;&#24230;Huber&#20998;&#20301;&#25968;&#22238;&#24402;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Deep Huber quantile regression networks. (arXiv:2306.10306v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10306
&lt;/p&gt;
&lt;p&gt;
DHQRN&#21487;&#20197;&#39044;&#27979;&#26356;&#19968;&#33324;&#30340;Huber&#20998;&#20301;&#25968;&#65292;&#24182;&#19988;&#22312;&#39044;&#27979;&#20998;&#24067;&#30340;&#23614;&#37096;&#25552;&#20379;&#26356;&#22909;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20856;&#22411;&#30340;&#26426;&#22120;&#23398;&#20064;&#22238;&#24402;&#24212;&#29992;&#26088;&#22312;&#36890;&#36807;&#20351;&#29992;&#24179;&#26041;&#35823;&#24046;&#25110;&#32477;&#23545;&#35823;&#24046;&#35780;&#20998;&#20989;&#25968;&#26469;&#25253;&#21578;&#39044;&#27979;&#27010;&#29575;&#20998;&#24067;&#30340;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#12290;&#21457;&#20986;&#26356;&#22810;&#39044;&#27979;&#27010;&#29575;&#20998;&#24067;&#30340;&#20989;&#25968;&#65288;&#20998;&#20301;&#25968;&#21644;&#26399;&#26395;&#20540;&#65289;&#30340;&#37325;&#35201;&#24615;&#24050;&#34987;&#35748;&#20026;&#26159;&#37327;&#21270;&#39044;&#27979;&#19981;&#30830;&#23450;&#24615;&#30340;&#25163;&#27573;&#12290;&#22312;&#28145;&#24230;&#23398;&#20064;&#65288;DL&#65289;&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#36890;&#36807;&#20998;&#20301;&#25968;&#21644;&#26399;&#26395;&#20540;&#22238;&#24402;&#31070;&#32463;&#32593;&#32476;&#65288;QRNN&#21644;ERNN&#65289;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#28857;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#28145;&#24230;Huber&#20998;&#20301;&#25968;&#22238;&#24402;&#32593;&#32476;&#65288;DHQRN&#65289;&#65292;&#23427;&#23558;QRNN&#21644;ERNN&#23884;&#22871;&#20026;&#36793;&#32536;&#24773;&#20917;&#12290; DHQRN&#21487;&#20197;&#39044;&#27979;Huber&#20998;&#20301;&#25968;&#65292;&#36825;&#26159;&#26356;&#19968;&#33324;&#30340;&#20989;&#25968;&#65292;&#22240;&#20026;&#23427;&#20204;&#23558;&#20998;&#20301;&#25968;&#21644;&#26399;&#26395;&#20540;&#20316;&#20026;&#26497;&#38480;&#24773;&#20917;&#23884;&#22871;&#36215;&#26469;&#12290;&#20027;&#35201;&#24605;&#24819;&#26159;&#20351;&#29992;Huber&#20998;&#20301;&#25968;&#22238;&#24402;&#20989;&#25968;&#35757;&#32451;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#36825;&#19982;Huber&#20998;&#20301;&#25968;&#21151;&#33021;&#19968;&#33268;&#12290;&#20316;&#20026;&#27010;&#24565;&#39564;&#35777;&#65292;DHQRN&#34987;&#24212;&#29992;&#20110;&#39044;&#27979;&#25151;&#20215;&#30340;&#30495;&#23454;&#25968;&#25454;&#38598;&#65292;&#24182;&#19982;&#20854;&#20182;&#22238;&#24402;&#25216;&#26415;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#22312;&#20960;&#20010;&#35823;&#24046;&#25351;&#26631;&#20013;&#65292;DHQRN&#32988;&#36807;&#20854;&#20182;&#25216;&#26415;&#65292;&#22312;&#39044;&#27979;&#20998;&#24067;&#30340;&#23614;&#37096;&#25552;&#20379;&#26356;&#22909;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Typical machine learning regression applications aim to report the mean or the median of the predictive probability distribution, via training with a squared or an absolute error scoring function. The importance of issuing predictions of more functionals of the predictive probability distribution (quantiles and expectiles) has been recognized as a means to quantify the uncertainty of the prediction. In deep learning (DL) applications, that is possible through quantile and expectile regression neural networks (QRNN and ERNN respectively). Here we introduce deep Huber quantile regression networks (DHQRN) that nest QRNNs and ERNNs as edge cases. DHQRN can predict Huber quantiles, which are more general functionals in the sense that they nest quantiles and expectiles as limiting cases. The main idea is to train a deep learning algorithm with the Huber quantile regression function, which is consistent for the Huber quantile functional. As a proof of concept, DHQRN are applied to predict hou
&lt;/p&gt;</description></item></channel></rss>