<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#30340;&#22810;&#20803;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#25193;&#23637;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#21487;&#20197;&#22788;&#29702;&#22810;&#20010;&#30456;&#20851;&#32467;&#26524;&#21464;&#37327;&#30340;&#22238;&#24402;&#21644;&#20998;&#31867;&#20998;&#26512;</title><link>https://arxiv.org/abs/2404.02228</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#30340;&#21307;&#30103;&#20445;&#20581;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Seemingly unrelated Bayesian additive regression trees for cost-effectiveness analyses in healthcare
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02228
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#30340;&#22810;&#20803;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#25193;&#23637;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#21487;&#20197;&#22788;&#29702;&#22810;&#20010;&#30456;&#20851;&#32467;&#26524;&#21464;&#37327;&#30340;&#22238;&#24402;&#21644;&#20998;&#31867;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#30340;&#29702;&#35770;&#32467;&#26524;&#21644;&#27169;&#25311;&#35777;&#25454;&#34920;&#26126;&#65292;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#26159;&#19968;&#31181;&#38750;&#24120;&#26377;&#25928;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#26041;&#27861;&#12290;&#21463;&#21040;&#22312;&#21355;&#29983;&#32463;&#27982;&#23398;&#20013;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#20855;&#26377;&#22810;&#20010;&#30456;&#20851;&#32467;&#26524;&#21464;&#37327;&#30340;&#22238;&#24402;&#21644;&#20998;&#31867;&#20998;&#26512;&#30340;BART&#30340;&#22810;&#20803;&#25193;&#23637;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#36890;&#36807;&#20801;&#35768;&#27599;&#20010;&#20010;&#20307;&#21709;&#24212;&#19982;&#19981;&#21516;&#26641;&#32452;&#30456;&#20851;&#32852;&#65292;&#21516;&#26102;&#22788;&#29702;&#32467;&#26524;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#22810;&#20803;BART&#27169;&#22411;&#30340;&#19968;&#20123;&#20027;&#35201;&#23616;&#38480;&#24615;&#12290;&#22312;&#36830;&#32493;&#32467;&#26524;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#26412;&#36136;&#19978;&#26159;&#34920;&#38754;&#26080;&#20851;&#22238;&#24402;&#30340;&#38750;&#21442;&#25968;&#29256;&#26412;&#12290;&#21516;&#26679;&#65292;&#25105;&#20204;&#38024;&#23545;&#20108;&#20803;&#32467;&#26524;&#30340;&#24314;&#35758;&#26159;&#38750;&#21442;&#25968;&#27010;&#25324;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02228v1 Announce Type: cross  Abstract: In recent years, theoretical results and simulation evidence have shown Bayesian additive regression trees to be a highly-effective method for nonparametric regression. Motivated by cost-effectiveness analyses in health economics, where interest lies in jointly modelling the costs of healthcare treatments and the associated health-related quality of life experienced by a patient, we propose a multivariate extension of BART applicable in regression and classification analyses with several correlated outcome variables. Our framework overcomes some key limitations of existing multivariate BART models by allowing each individual response to be associated with different ensembles of trees, while still handling dependencies between the outcomes. In the case of continuous outcomes, our model is essentially a nonparametric version of seemingly unrelated regression. Likewise, our proposal for binary outcomes is a nonparametric generalisation of
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#24314;&#31435;&#20102;&#30456;&#24212;&#38750;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#21644;Edgeworth&#23637;&#24320;&#65292;&#23545;&#20272;&#35745;&#37327;&#36827;&#34892;&#20102;&#33258;&#20030;&#27861;&#36817;&#20284;&#20998;&#24067;&#65292;&#24182;&#23637;&#31034;&#20855;&#26377;&#20108;&#38454;&#8220;&#20934;&#30830;&#24615;&#8221;&#12290;</title><link>https://arxiv.org/abs/2402.14322</link><description>&lt;p&gt;
&#23545;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Estimation of Spectral Risk Measure for Left Truncated and Right Censored Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14322
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#24314;&#31435;&#20102;&#30456;&#24212;&#38750;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#21644;Edgeworth&#23637;&#24320;&#65292;&#23545;&#20272;&#35745;&#37327;&#36827;&#34892;&#20102;&#33258;&#20030;&#27861;&#36817;&#20284;&#20998;&#24067;&#65292;&#24182;&#23637;&#31034;&#20855;&#26377;&#20108;&#38454;&#8220;&#20934;&#30830;&#24615;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#22312;&#20445;&#38505;&#25439;&#22833;&#25968;&#25454;&#20013;&#32463;&#24120;&#36935;&#21040;&#65292;&#36825;&#26159;&#30001;&#20110;&#20813;&#36180;&#39069;&#21644;&#25919;&#31574;&#38480;&#39069;&#36896;&#25104;&#30340;&#12290;&#39118;&#38505;&#20272;&#35745;&#22312;&#20445;&#38505;&#19994;&#20013;&#26159;&#19968;&#39033;&#37325;&#35201;&#20219;&#21153;&#65292;&#22240;&#20026;&#23427;&#26159;&#30830;&#23450;&#21508;&#31181;&#25919;&#31574;&#26465;&#27454;&#19979;&#30340;&#20445;&#36153;&#30340;&#24517;&#35201;&#27493;&#39588;&#12290;&#35889;&#39118;&#38505;&#24230;&#37327;&#22825;&#29983;&#20855;&#26377;&#19968;&#33268;&#24615;&#65292;&#24182;&#19988;&#23558;&#39118;&#38505;&#24230;&#37327;&#19982;&#29992;&#25143;&#30340;&#39118;&#38505;&#21388;&#24694;&#32852;&#31995;&#36215;&#26469;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24038;&#25130;&#23614;&#21644;&#21491;&#25130;&#23614;&#25968;&#25454;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#20135;&#21697;&#26497;&#38480;&#20272;&#35745;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#24182;&#20026;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#24314;&#31435;&#20102;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#30340;Edgeworth&#23637;&#24320;&#12290;&#24341;&#20837;&#33258;&#20030;&#27861;&#26469;&#36817;&#20284;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#30340;&#20998;&#24067;&#65292;&#24182;&#26174;&#31034;&#20854;&#20026;&#20108;&#38454;&#8220;&#20934;&#30830;&#8221;&#12290;&#36827;&#34892;&#33945;&#29305;&#21345;&#27931;&#30740;&#31350;&#26469;&#27604;&#36739;&#25152;&#25552;&#20986;&#30340;&#35889;&#39118;&#38505;&#24230;&#37327;&#20272;&#35745;&#19982;t
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14322v1 Announce Type: cross  Abstract: Left truncated and right censored data are encountered frequently in insurance loss data due to deductibles and policy limits. Risk estimation is an important task in insurance as it is a necessary step for determining premiums under various policy terms. Spectral risk measures are inherently coherent and have the benefit of connecting the risk measure to the user's risk aversion. In this paper we study the estimation of spectral risk measure based on left truncated and right censored data. We propose a non parametric estimator of spectral risk measure using the product limit estimator and establish the asymptotic normality for our proposed estimator. We also develop an Edgeworth expansion of our proposed estimator. The bootstrap is employed to approximate the distribution of our proposed estimator and shown to be second order ``accurate''. Monte Carlo studies are conducted to compare the proposed spectral risk measure estimator with t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#29992;&#20110;&#25913;&#36827;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#26694;&#26550;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#65292;&#20351;&#29992;&#32452;&#21035;&#29305;&#23450;&#30340;&#32553;&#20943;&#21442;&#25968;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#65292;&#39044;&#27979;&#24615;&#33021;&#22240;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#32780;&#24322;&#65292;&#20294;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2206.04902</link><description>&lt;p&gt;
&#29992;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#65306;&#31232;&#30095;&#36824;&#26159;&#23494;&#38598;&#65311;&#35201;&#30475;&#24773;&#20917;&#65281;
&lt;/p&gt;
&lt;p&gt;
Forecasting macroeconomic data with Bayesian VARs: Sparse or dense? It depends!. (arXiv:2206.04902v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.04902
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#29992;&#20110;&#25913;&#36827;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#26694;&#26550;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#65292;&#20351;&#29992;&#32452;&#21035;&#29305;&#23450;&#30340;&#32553;&#20943;&#21442;&#25968;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#65292;&#39044;&#27979;&#24615;&#33021;&#22240;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#32780;&#24322;&#65292;&#20294;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24314;&#27169;&#21644;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#26102;&#65292;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;VARs&#65289;&#34987;&#24191;&#27867;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#23481;&#26131;&#20986;&#29616;&#36807;&#25311;&#21512;&#38382;&#39064;&#12290;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#20855;&#20307;&#32780;&#35328;&#26159;&#32553;&#20943;&#20808;&#39564;&#26041;&#27861;&#65292;&#24050;&#32463;&#26174;&#31034;&#20986;&#22312;&#25552;&#39640;&#39044;&#27979;&#24615;&#33021;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#20854;&#20013;&#25105;&#20204;&#29992;&#29305;&#23450;&#32452;&#21035;&#30340;&#32553;&#20943;&#21442;&#25968;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#27492;&#26694;&#26550;&#24212;&#29992;&#20110;&#21508;&#31181;&#32553;&#20943;&#20808;&#39564;&#65292;&#22914;&#20840;&#23616;-&#23616;&#37096;&#20808;&#39564;&#21644;&#38543;&#26426;&#25628;&#32034;&#21464;&#37327;&#36873;&#25321;&#20808;&#39564;&#12290;&#25105;&#20204;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23545;&#32654;&#22269;&#32463;&#27982;&#25968;&#25454;&#36827;&#34892;&#30340;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23545;&#27491;&#22312;&#36827;&#34892;&#30340;"&#31232;&#30095;&#20551;&#35937;"&#36777;&#35770;&#36827;&#34892;&#20102;&#26356;&#28145;&#20837;&#30340;&#25506;&#35752;&#65292;&#21457;&#29616;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#30340;&#39044;&#27979;&#24615;&#33021;&#22312;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#20013;&#21464;&#21270;&#24456;&#22823;&#12290;&#28982;&#32780;&#65292;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Vectorautogressions (VARs) are widely applied when it comes to modeling and forecasting macroeconomic variables. In high dimensions, however, they are prone to overfitting. Bayesian methods, more concretely shrinking priors, have shown to be successful in improving prediction performance. In the present paper, we introduce the semi-global framework, in which we replace the traditional global shrinkage parameter with group-specific shrinkage parameters. We show how this framework can be applied to various shrinking priors, such as global-local priors and stochastic search variable selection priors. We demonstrate the virtues of the proposed framework in an extensive simulation study and in an empirical application forecasting data of the US economy. Further, we shed more light on the ongoing ``Illusion of Sparsity'' debate, finding that forecasting performances under sparse/dense priors vary across evaluated economic variables and across time frames. Dynamic model averaging, however, ca
&lt;/p&gt;</description></item></channel></rss>