<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65292;&#36890;&#36807;&#23494;&#24230;&#21305;&#37197;&#26469;&#35299;&#20915;&#29616;&#26377;SCMs&#20013;&#30340;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#23494;&#24230;&#19982;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#23494;&#24230;&#36827;&#34892;&#21152;&#26435;&#24179;&#22343;&#26469;&#20272;&#35745;SC&#26435;&#37325;&#12290;</title><link>http://arxiv.org/abs/2307.11127</link><description>&lt;p&gt;
&#36890;&#36807;&#23494;&#24230;&#21305;&#37197;&#23454;&#29616;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#19979;&#30340;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Synthetic Control Methods by Density Matching under Implicit Endogeneitiy. (arXiv:2307.11127v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11127
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65292;&#36890;&#36807;&#23494;&#24230;&#21305;&#37197;&#26469;&#35299;&#20915;&#29616;&#26377;SCMs&#20013;&#30340;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#23494;&#24230;&#19982;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#23494;&#24230;&#36827;&#34892;&#21152;&#26435;&#24179;&#22343;&#26469;&#20272;&#35745;SC&#26435;&#37325;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65288;SCMs&#65289;&#24050;&#25104;&#20026;&#27604;&#36739;&#26696;&#20363;&#30740;&#31350;&#20013;&#22240;&#26524;&#25512;&#26029;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;SCMs&#30340;&#22522;&#26412;&#24605;&#24819;&#26159;&#36890;&#36807;&#20351;&#29992;&#26469;&#33258;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#35266;&#27979;&#32467;&#26524;&#30340;&#21152;&#26435;&#21644;&#26469;&#20272;&#35745;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#21453;&#20107;&#23454;&#32467;&#26524;&#12290;&#21512;&#25104;&#23545;&#29031;&#65288;SC&#65289;&#30340;&#20934;&#30830;&#24615;&#23545;&#20110;&#20272;&#35745;&#22240;&#26524;&#25928;&#24212;&#33267;&#20851;&#37325;&#35201;&#65292;&#22240;&#27492;&#65292;SC&#26435;&#37325;&#30340;&#20272;&#35745;&#25104;&#20026;&#20102;&#30740;&#31350;&#30340;&#28966;&#28857;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#25351;&#20986;&#29616;&#26377;&#30340;SCMs&#23384;&#22312;&#19968;&#20010;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;&#65292;&#21363;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#19982;&#21453;&#20107;&#23454;&#32467;&#26524;&#27169;&#22411;&#20013;&#30340;&#35823;&#24046;&#39033;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#38382;&#39064;&#20250;&#23545;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#22120;&#20135;&#29983;&#20559;&#24046;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#23494;&#24230;&#21305;&#37197;&#30340;&#26032;&#22411;SCM&#65292;&#20551;&#35774;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#23494;&#24230;&#21487;&#20197;&#29992;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#23494;&#24230;&#30340;&#21152;&#26435;&#24179;&#22343;&#26469;&#36817;&#20284;&#65288;&#21363;&#28151;&#21512;&#27169;&#22411;&#65289;&#12290;&#22522;&#20110;&#36825;&#19968;&#20551;&#35774;&#65292;&#25105;&#20204;&#36890;&#36807;&#21305;&#37197;&#26469;&#20272;&#35745;SC&#26435;&#37325;&#12290;
&lt;/p&gt;
&lt;p&gt;
Synthetic control methods (SCMs) have become a crucial tool for causal inference in comparative case studies. The fundamental idea of SCMs is to estimate counterfactual outcomes for a treated unit by using a weighted sum of observed outcomes from untreated units. The accuracy of the synthetic control (SC) is critical for estimating the causal effect, and hence, the estimation of SC weights has been the focus of much research. In this paper, we first point out that existing SCMs suffer from an implicit endogeneity problem, which is the correlation between the outcomes of untreated units and the error term in the model of a counterfactual outcome. We show that this problem yields a bias in the causal effect estimator. We then propose a novel SCM based on density matching, assuming that the density of outcomes of the treated unit can be approximated by a weighted average of the densities of untreated units (i.e., a mixture model). Based on this assumption, we estimate SC weights by matchi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20851;&#27880;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#22312;&#20351;&#29992;&#22238;&#24402;&#35843;&#25972;&#26102;&#38656;&#35201;&#26435;&#34913;&#25928;&#29575;&#19982;&#20272;&#35745;&#35823;&#24046;&#25104;&#26412;&#12290;&#20316;&#32773;&#25552;&#20379;&#20102;&#20851;&#20110;&#32463;&#36807;&#22238;&#24402;&#35843;&#25972;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#20272;&#35745;&#22120;&#30340;&#32479;&#19968;&#25512;&#26029;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/2304.08184</link><description>&lt;p&gt;
&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#19979;&#30340;&#22810;&#20010;&#22238;&#24402;&#22120;&#30340;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Adjustment with Many Regressors Under Covariate-Adaptive Randomizations. (arXiv:2304.08184v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08184
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#22312;&#20351;&#29992;&#22238;&#24402;&#35843;&#25972;&#26102;&#38656;&#35201;&#26435;&#34913;&#25928;&#29575;&#19982;&#20272;&#35745;&#35823;&#24046;&#25104;&#26412;&#12290;&#20316;&#32773;&#25552;&#20379;&#20102;&#20851;&#20110;&#32463;&#36807;&#22238;&#24402;&#35843;&#25972;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#20272;&#35745;&#22120;&#30340;&#32479;&#19968;&#25512;&#26029;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#65288;CAR&#65289;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#20351;&#29992;&#22238;&#24402;&#35843;&#25972;&#65288;RA&#65289;&#26102;&#23384;&#22312;&#30340;&#26435;&#34913;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;RA&#21487;&#20197;&#36890;&#36807;&#25972;&#21512;&#26410;&#29992;&#20110;&#38543;&#26426;&#20998;&#37197;&#30340;&#21327;&#21464;&#37327;&#20449;&#24687;&#26469;&#25552;&#39640;&#22240;&#26524;&#20272;&#35745;&#22120;&#30340;&#25928;&#29575;&#12290;&#20294;&#26159;&#65292;&#24403;&#22238;&#24402;&#22120;&#25968;&#37327;&#19982;&#26679;&#26412;&#37327;&#21516;&#38454;&#26102;&#65292;RA&#30340;&#20272;&#35745;&#35823;&#24046;&#19981;&#33021;&#28176;&#36817;&#24573;&#30053;&#65292;&#20250;&#38477;&#20302;&#20272;&#35745;&#25928;&#29575;&#12290;&#27809;&#26377;&#32771;&#34385;RA&#25104;&#26412;&#30340;&#32467;&#26524;&#21487;&#33021;&#23548;&#33268;&#22312;&#38646;&#20551;&#35774;&#19979;&#36807;&#24230;&#25298;&#32477;&#22240;&#26524;&#25512;&#26029;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#22312;CAR&#19979;&#20026;&#32463;&#36807;&#22238;&#24402;&#35843;&#25972;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#20272;&#35745;&#22120;&#24320;&#21457;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#25512;&#26029;&#29702;&#35770;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#20855;&#26377;&#20004;&#20010;&#20851;&#38190;&#29305;&#24449;&#65306;&#65288;1&#65289;&#30830;&#20445;&#22312;&#38646;&#20551;&#35774;&#19979;&#30340;&#31934;&#30830;&#28176;&#36817;&#22823;&#23567;&#65292;&#26080;&#35770;&#21327;&#21464;&#37327;&#25968;&#37327;&#26159;&#22266;&#23450;&#36824;&#26159;&#26368;&#22810;&#20197;&#26679;&#26412;&#22823;&#23567;&#30340;&#36895;&#24230;&#21457;&#25955;&#65292;&#65288;2&#65289;&#30830;&#20445;&#22312;&#21327;&#21464;&#37327;&#32500;&#24230;&#26041;&#38754;&#37117;&#27604;&#26410;&#35843;&#25972;&#30340;&#20272;&#35745;&#22120;&#24369;&#25928;&#25552;&#39640;.
&lt;/p&gt;
&lt;p&gt;
Our paper identifies a trade-off when using regression adjustments (RAs) in causal inference under covariate-adaptive randomizations (CARs). On one hand, RAs can improve the efficiency of causal estimators by incorporating information from covariates that are not used in the randomization. On the other hand, RAs can degrade estimation efficiency due to their estimation errors, which are not asymptotically negligible when the number of regressors is of the same order as the sample size. Failure to account for the cost of RAs can result in over-rejection of causal inference under the null hypothesis. To address this issue, we develop a unified inference theory for the regression-adjusted average treatment effect (ATE) estimator under CARs. Our theory has two key features: (1) it ensures the exact asymptotic size under the null hypothesis, regardless of whether the number of covariates is fixed or diverges at most at the rate of the sample size, and (2) it guarantees weak efficiency impro
&lt;/p&gt;</description></item></channel></rss>