<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#30740;&#31350;&#37319;&#29992;&#20013;&#22269;42&#23478;&#19978;&#24066;&#38134;&#34892;2006&#33267;2021&#24180;&#30340;&#24180;&#24230;&#25968;&#25454;&#65292;&#21457;&#29616;&#22269;&#26377;&#38134;&#34892;&#21644;&#22478;&#24066;/&#20892;&#26449;&#21830;&#19994;&#38134;&#34892;&#30340;&#36229;&#25928;&#29575;&#20248;&#20110;&#32929;&#20221;&#21046;&#38134;&#34892;&#65292;&#22269;&#26377;&#38134;&#34892;&#22312;&#20013;&#20171;&#25928;&#29575;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;&#25152;&#26377;&#31867;&#22411;&#30340;&#38134;&#34892;&#37117;&#21463;&#30410;&#20110;&#25152;&#26377;&#26435;&#38598;&#20013;&#24230;&#30340;&#38477;&#20302;&#65292;&#22320;&#26041;&#21830;&#19994;&#38134;&#34892;&#21463;&#30410;&#20110;&#23458;&#25143;&#38598;&#20013;&#24230;&#30340;&#38477;&#20302;&#21644;&#20934;&#22791;&#37329;&#30340;&#22686;&#21152;&#65292;&#22312;&#22686;&#21152;&#36151;&#27454;&#23384;&#27454;&#27604;&#29575;&#26041;&#38754;&#65292;&#22269;&#26377;&#38134;&#34892;&#24212;&#35813;&#37319;&#21462;&#25514;&#26045;&#65292;&#32929;&#20221;&#21046;&#38134;&#34892;&#21017;&#30456;&#21453;&#12290;</title><link>http://arxiv.org/abs/2305.10885</link><description>&lt;p&gt;
&#20013;&#22269;&#19978;&#24066;&#38134;&#34892;&#30340;&#36229;&#25928;&#29575;&#21450;&#20915;&#23450;&#22240;&#32032;&#20998;&#26512;&#65288;2006-2021&#24180;&#65289;
&lt;/p&gt;
&lt;p&gt;
Super-efficiency of Listed Banks in China and Determinants Analysis (2006-2021). (arXiv:2305.10885v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10885
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#20013;&#22269;42&#23478;&#19978;&#24066;&#38134;&#34892;2006&#33267;2021&#24180;&#30340;&#24180;&#24230;&#25968;&#25454;&#65292;&#21457;&#29616;&#22269;&#26377;&#38134;&#34892;&#21644;&#22478;&#24066;/&#20892;&#26449;&#21830;&#19994;&#38134;&#34892;&#30340;&#36229;&#25928;&#29575;&#20248;&#20110;&#32929;&#20221;&#21046;&#38134;&#34892;&#65292;&#22269;&#26377;&#38134;&#34892;&#22312;&#20013;&#20171;&#25928;&#29575;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;&#25152;&#26377;&#31867;&#22411;&#30340;&#38134;&#34892;&#37117;&#21463;&#30410;&#20110;&#25152;&#26377;&#26435;&#38598;&#20013;&#24230;&#30340;&#38477;&#20302;&#65292;&#22320;&#26041;&#21830;&#19994;&#38134;&#34892;&#21463;&#30410;&#20110;&#23458;&#25143;&#38598;&#20013;&#24230;&#30340;&#38477;&#20302;&#21644;&#20934;&#22791;&#37329;&#30340;&#22686;&#21152;&#65292;&#22312;&#22686;&#21152;&#36151;&#27454;&#23384;&#27454;&#27604;&#29575;&#26041;&#38754;&#65292;&#22269;&#26377;&#38134;&#34892;&#24212;&#35813;&#37319;&#21462;&#25514;&#26045;&#65292;&#32929;&#20221;&#21046;&#38134;&#34892;&#21017;&#30456;&#21453;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;2006&#33267;2021&#24180;42&#23478;&#19978;&#24066;&#38134;&#34892;&#30340;&#24180;&#24230;&#38750;&#24179;&#34913;&#38754;&#26495;&#25968;&#25454;&#65292;&#37319;&#29992;&#32771;&#34385;&#19981;&#33391;&#36151;&#27454;&#20026;&#19981;&#24076;&#26395;&#20135;&#20986;&#30340;&#38750;&#24452;&#21521;&#38750;&#23450;&#21521;&#36229;&#25928;&#29575;&#25968;&#25454;&#21253;&#32476;&#20998;&#26512;&#65288;Super-SBM-UND-VRS based DEA&#65289;&#27169;&#22411;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22269;&#26377;&#38134;&#34892;&#21644;&#22478;&#24066;/&#20892;&#26449;&#21830;&#19994;&#38134;&#34892;&#30340;&#30408;&#21033;&#33021;&#21147;&#36229;&#25928;&#29575;&#20248;&#20110;&#32929;&#20221;&#21046;&#38134;&#34892;&#12290;&#23601;&#20013;&#20171;&#25928;&#29575;&#65288;&#23384;&#27454;&#21644;&#36151;&#27454;&#65289;&#32780;&#35328;&#65292;&#22269;&#26377;&#38134;&#34892;&#20855;&#26377;&#20248;&#21183;&#12290;&#20915;&#23450;&#22240;&#32032;&#20998;&#26512;&#34920;&#26126;&#65292;&#25152;&#26377;&#31867;&#22411;&#30340;&#38134;&#34892;&#37117;&#21463;&#30410;&#20110;&#25152;&#26377;&#26435;&#38598;&#20013;&#24230;&#30340;&#38477;&#20302;&#65292;&#25903;&#25345;&#25913;&#38761;&#21644;IPO&#12290;&#22320;&#26041;&#21830;&#19994;&#38134;&#34892;&#26174;&#33879;&#21463;&#30410;&#20110;&#23458;&#25143;&#38598;&#20013;&#24230;&#30340;&#38477;&#20302;&#21644;&#20934;&#22791;&#37329;&#30340;&#22686;&#21152;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22269;&#26377;&#38134;&#34892;&#24212;&#22686;&#21152;&#20854;&#36151;&#27454;&#23384;&#27454;&#27604;&#29575;&#65292;&#32780;&#32929;&#20221;&#21046;&#38134;&#34892;&#24212;&#37319;&#21462;&#30456;&#21453;&#30340;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study employs the annual unbalanced panel data of 42 listed banks in China from 2006 to 2021, adopts the non-radial and non-oriented super-efficiency Data envelopment analysis (Super-SBM-UND-VRS based DEA) model considering NPL as undesired output. Our results show that the profitability super-efficiency of State-owned banks and Rural/City Commercial Banks is better than that of Joint-stock Banks. In terms of intermediary efficiency(deposit and loan), state-owned banks have advantage on other two type of banks. The determinants analysis shows that all type of banks significantly benefits from the decrease of ownership concentration which support reformation and IPO. Regional commercial banks significantly benefit from the decrease of customer concentration and the increase of reserves. On the other hand, State-owned banks should increase its loan to deposit ratio while joint-stock banks should do the opposite.
&lt;/p&gt;</description></item></channel></rss>