<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#65292;&#30740;&#31350;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2211.07823</link><description>&lt;p&gt;
&#20351;&#29992;&#32593;&#32476;&#24178;&#25200;&#36827;&#34892;&#26080;&#20559;&#24615;&#20272;&#35745;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Unconfoundedness with Network Interference. (arXiv:2211.07823v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.07823
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#65292;&#30740;&#31350;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#26469;&#33258;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#23545;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#24178;&#25200;&#38543;&#30528;&#32593;&#32476;&#36317;&#31163;&#30340;&#22686;&#21152;&#32780;&#34928;&#20943;&#65292;&#36825;&#20801;&#35768;&#23545;&#32467;&#26524;&#21644;&#27835;&#30103;&#36873;&#25321;&#30340;&#21516;&#20276;&#24433;&#21709;&#36827;&#34892;&#24314;&#27169;&#12290;&#22312;&#36825;&#20010;&#27169;&#22411;&#19979;&#65292;&#24635;&#32593;&#32476;&#21644;&#25152;&#26377;&#21333;&#20301;&#30340;&#21327;&#21464;&#37327;&#26500;&#25104;&#20102;&#28151;&#28102;&#30340;&#26469;&#28304;&#65292;&#19982;&#29616;&#26377;&#24037;&#20316;&#19981;&#21516;&#30340;&#26159;&#65292;&#29616;&#26377;&#24037;&#20316;&#20551;&#35774;&#28151;&#28102;&#21487;&#20197;&#30001;&#36825;&#20123;&#23545;&#35937;&#30340;&#24050;&#30693;&#20302;&#32500;&#20989;&#25968;&#24635;&#32467;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#20272;&#35745;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#37327;&#30340;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#36817;&#20284;&#31232;&#30095;&#30340;&#32593;&#32476;&#31867;&#27604;&#65292;&#20197;&#35777;&#26126;&#20351;&#29992;&#27973;&#23618;&#32467;&#26500;&#30340;&#21512;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies nonparametric estimation of treatment and spillover effects using observational data from a single large network. We consider a model in which interference decays with network distance, which allows for peer influence in both outcomes and selection into treatment. Under this model, the total network and covariates of all units constitute sources of confounding, in contrast to existing work that assumes confounding can be summarized by a known, low-dimensional function of these objects. We propose to use graph neural networks to estimate the high-dimensional nuisance functions of a doubly robust estimator. We establish a network analog of approximate sparsity to justify the use of shallow architectures.
&lt;/p&gt;</description></item></channel></rss>