<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;&#65292;&#35777;&#26126;&#20102;&#26410;&#21306;&#20998;&#20004;&#31181;&#20869;&#29983;&#24615;&#20250;&#23548;&#33268;&#23545;&#20559;&#25928;&#24212;&#30340;&#20302;&#20272;&#25110;&#39640;&#20272;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2306.14862</link><description>&lt;p&gt;
Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;
&lt;/p&gt;
&lt;p&gt;
Marginal Effects for Probit and Tobit with Endogeneity. (arXiv:2306.14862v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14862
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;&#65292;&#35777;&#26126;&#20102;&#26410;&#21306;&#20998;&#20004;&#31181;&#20869;&#29983;&#24615;&#20250;&#23548;&#33268;&#23545;&#20559;&#25928;&#24212;&#30340;&#20302;&#20272;&#25110;&#39640;&#20272;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35780;&#20272;&#20559;&#25928;&#24212;&#26102;&#65292;&#21306;&#20998;&#32467;&#26500;&#24615;&#20869;&#29983;&#24615;&#21644;&#27979;&#37327;&#35823;&#24046;&#38750;&#24120;&#37325;&#35201;&#12290;&#19982;&#32447;&#24615;&#27169;&#22411;&#19981;&#21516;&#65292;&#36825;&#20004;&#31181;&#20869;&#29983;&#24615;&#26469;&#28304;&#22312;&#38750;&#32447;&#24615;&#27169;&#22411;&#20013;&#23545;&#20559;&#25928;&#24212;&#30340;&#24433;&#21709;&#19981;&#21516;&#12290;&#26412;&#25991;&#20197;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;Probit&#21644;Tobit&#27169;&#22411;&#20026;&#37325;&#28857;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#21363;&#20351;&#23384;&#22312;&#26377;&#25928;&#30340;IV&#65292;&#26410;&#33021;&#21306;&#20998;&#36825;&#20004;&#31181;&#20869;&#29983;&#24615;&#31867;&#22411;&#20063;&#21487;&#33021;&#23548;&#33268;&#20559;&#25928;&#24212;&#34987;&#20302;&#20272;&#25110;&#39640;&#20272;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#35813;&#21306;&#38388;&#27491;&#30830;&#22320;&#32771;&#34385;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#20869;&#29983;&#24615;&#12290;&#25105;&#20204;&#22312;Monte Carlo&#27169;&#25311;&#21644;&#23454;&#35777;&#24212;&#29992;&#20013;&#35828;&#26126;&#20102;&#36825;&#20123;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
When evaluating partial effects, it is important to distinguish between structural endogeneity and measurement errors. In contrast to linear models, these two sources of endogeneity affect partial effects differently in nonlinear models. We study this issue focusing on the Instrumental Variable (IV) Probit and Tobit models. We show that even when a valid IV is available, failing to differentiate between the two types of endogeneity can lead to either under- or over-estimation of the partial effects. We develop simple estimators of the bounds on the partial effects and provide easy to implement confidence intervals that correctly account for both types of endogeneity. We illustrate the methods in a Monte Carlo simulation and an empirical application.
&lt;/p&gt;</description></item></channel></rss>