<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#25311;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#31532;&#19968;&#38454;&#27573;&#30340;&#39057;&#29575;&#20027;&#20041;&#20272;&#35745;&#21644;&#31532;&#20108;&#38454;&#27573;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;/&#25512;&#26029;&#26041;&#27861;&#65292;&#36866;&#29992;&#20110;&#32467;&#26500;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#24615;&#20559;&#35823;&#20462;&#27491;&#65292;&#20854;&#20013;&#25311;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20445;&#25345;&#19968;&#33268;&#65292;&#24182;&#28176;&#36817;&#22320;&#31561;&#20215;&#20110;&#39057;&#29575;&#20027;&#20041;&#20004;&#38454;&#27573;&#20272;&#35745;&#37327;&#12290;</title><link>https://arxiv.org/abs/2402.17374</link><description>&lt;p&gt;
&#20855;&#26377;&#25511;&#21046;&#20989;&#25968;&#30340;&#25311;&#36125;&#21494;&#26031;&#20272;&#35745;&#19982;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Quasi-Bayesian Estimation and Inference with Control Functions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17374
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#25311;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#31532;&#19968;&#38454;&#27573;&#30340;&#39057;&#29575;&#20027;&#20041;&#20272;&#35745;&#21644;&#31532;&#20108;&#38454;&#27573;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;/&#25512;&#26029;&#26041;&#27861;&#65292;&#36866;&#29992;&#20110;&#32467;&#26500;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#24615;&#20559;&#35823;&#20462;&#27491;&#65292;&#20854;&#20013;&#25311;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20445;&#25345;&#19968;&#33268;&#65292;&#24182;&#28176;&#36817;&#22320;&#31561;&#20215;&#20110;&#39057;&#29575;&#20027;&#20041;&#20004;&#38454;&#27573;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#25311;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#31532;&#19968;&#38454;&#27573;&#32467;&#21512;&#20102;&#39057;&#29575;&#20027;&#20041;&#20272;&#35745;&#21644;&#31532;&#20108;&#38454;&#27573;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;/&#25512;&#26029;&#26041;&#27861;&#12290;&#36825;&#39033;&#30740;&#31350;&#21463;&#21040;&#20102;&#20351;&#29992;&#25511;&#21046;&#20989;&#25968;&#26041;&#27861;&#32416;&#27491;&#20869;&#29983;&#24615;&#20559;&#35823;&#30340;&#32467;&#26500;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#21551;&#21457;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#31532;&#19968;&#38454;&#27573;&#20351;&#29992;&#19968;&#20123;&#39057;&#29575;&#20027;&#20041;&#21442;&#25968;&#21270;&#25110;&#38750;&#21442;&#25968;&#21270;&#26041;&#27861;&#26469;&#20272;&#35745;&#25511;&#21046;&#20989;&#25968;&#12290;&#19982;&#19968;&#20123;&#22797;&#26434;&#30340;&#20284;&#28982;&#20989;&#25968;&#30456;&#20851;&#30340;&#32467;&#26500;&#26041;&#31243;&#21487;&#20197;&#26356;&#26041;&#20415;&#22320;&#20351;&#29992;&#36125;&#21494;&#26031;&#26041;&#27861;&#36827;&#34892;&#22788;&#29702;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20174;&#31532;&#20108;&#38454;&#27573;&#33719;&#24471;&#30340;&#25311;&#21518;&#39564;&#20998;&#24067;&#30340;&#28176;&#36817;&#29305;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#30456;&#24212;&#30340;&#25311;&#36125;&#21494;&#26031;&#21487;&#20449;&#38598;&#22312;&#22823;&#26679;&#26412;&#20013;&#19981;&#20855;&#26377;&#25152;&#38656;&#30340;&#35206;&#30422;&#29575;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#25311;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20445;&#25345;&#19968;&#33268;&#65292;&#24182;&#19988;&#28176;&#36817;&#22320;&#31561;&#20215;&#20110;&#39057;&#29575;&#20027;&#20041;&#20004;&#38454;&#27573;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17374v1 Announce Type: new  Abstract: We consider a quasi-Bayesian method that combines a frequentist estimation in the first stage and a Bayesian estimation/inference approach in the second stage. The study is motivated by structural discrete choice models that use the control function methodology to correct for endogeneity bias. In this scenario, the first stage estimates the control function using some frequentist parametric or nonparametric approach. The structural equation in the second stage, associated with certain complicated likelihood functions, can be more conveniently dealt with using a Bayesian approach. This paper studies the asymptotic properties of the quasi-posterior distributions obtained from the second stage. We prove that the corresponding quasi-Bayesian credible set does not have the desired coverage in large samples. Nonetheless, the quasi-Bayesian point estimator remains consistent and is asymptotically equivalent to a frequentist two-stage estimator.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#30340;&#30446;&#26631;&#26159;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;&#65292;&#36890;&#36807;&#19981;&#23545;&#20854;&#20182;&#21464;&#37327;&#20570;&#22826;&#22810;&#20551;&#35774;&#65292;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#21487;&#35782;&#21035;&#24615;&#32467;&#26524;&#21644;&#20004;&#31181;&#23454;&#29992;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.16048</link><description>&lt;p&gt;
&#23616;&#37096;&#22240;&#26524;&#21457;&#29616;&#20013;&#30340;&#32467;&#26500;&#38480;&#21046;: &#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;
&lt;/p&gt;
&lt;p&gt;
Structural restrictions in local causal discovery: identifying direct causes of a target variable. (arXiv:2307.16048v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.16048
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#30340;&#30446;&#26631;&#26159;&#20174;&#35266;&#27979;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;&#65292;&#36890;&#36807;&#19981;&#23545;&#20854;&#20182;&#21464;&#37327;&#20570;&#22826;&#22810;&#20551;&#35774;&#65292;&#30740;&#31350;&#32773;&#25552;&#20986;&#20102;&#21487;&#35782;&#21035;&#24615;&#32467;&#26524;&#21644;&#20004;&#31181;&#23454;&#29992;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20174;&#35266;&#23519;&#32852;&#21512;&#20998;&#24067;&#20013;&#23398;&#20064;&#30446;&#26631;&#21464;&#37327;&#30340;&#19968;&#32452;&#30452;&#25509;&#21407;&#22240;&#30340;&#38382;&#39064;&#12290;&#23398;&#20064;&#34920;&#31034;&#22240;&#26524;&#32467;&#26500;&#30340;&#26377;&#21521;&#26080;&#29615;&#22270;(DAG)&#26159;&#31185;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#12290;&#24403;&#23436;&#25972;&#30340;DAG&#20174;&#20998;&#24067;&#20013;&#21487;&#35782;&#21035;&#26102;&#65292;&#24050;&#30693;&#26377;&#19968;&#20123;&#32467;&#26524;&#65292;&#20363;&#22914;&#20551;&#35774;&#38750;&#32447;&#24615;&#39640;&#26031;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#12290;&#36890;&#24120;&#65292;&#25105;&#20204;&#21482;&#23545;&#35782;&#21035;&#19968;&#20010;&#30446;&#26631;&#21464;&#37327;&#30340;&#30452;&#25509;&#21407;&#22240;&#65288;&#23616;&#37096;&#22240;&#26524;&#32467;&#26500;&#65289;&#65292;&#32780;&#19981;&#26159;&#23436;&#25972;&#30340;DAG&#24863;&#20852;&#36259;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#23545;&#30446;&#26631;&#21464;&#37327;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#30340;&#19981;&#21516;&#20551;&#35774;&#65292;&#35813;&#20551;&#35774;&#19979;&#30452;&#25509;&#21407;&#22240;&#38598;&#21512;&#21487;&#20197;&#20174;&#20998;&#24067;&#20013;&#35782;&#21035;&#20986;&#26469;&#12290;&#22312;&#36825;&#26679;&#20570;&#30340;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#23545;&#38500;&#30446;&#26631;&#21464;&#37327;&#20043;&#22806;&#30340;&#21464;&#37327;&#22522;&#26412;&#19978;&#27809;&#26377;&#20219;&#20309;&#20551;&#35774;&#12290;&#38500;&#20102;&#26032;&#30340;&#21487;&#35782;&#21035;&#24615;&#32467;&#26524;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20004;&#31181;&#20174;&#26377;&#38480;&#38543;&#26426;&#26679;&#26412;&#20272;&#35745;&#30452;&#25509;&#21407;&#22240;&#30340;&#23454;&#29992;&#31639;&#27861;&#65292;&#24182;&#22312;&#20960;&#20010;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of learning a set of direct causes of a target variable from an observational joint distribution. Learning directed acyclic graphs (DAGs) that represent the causal structure is a fundamental problem in science. Several results are known when the full DAG is identifiable from the distribution, such as assuming a nonlinear Gaussian data-generating process. Often, we are only interested in identifying the direct causes of one target variable (local causal structure), not the full DAG. In this paper, we discuss different assumptions for the data-generating process of the target variable under which the set of direct causes is identifiable from the distribution. While doing so, we put essentially no assumptions on the variables other than the target variable. In addition to the novel identifiability results, we provide two practical algorithms for estimating the direct causes from a finite random sample and demonstrate their effectiveness on several benchmark dataset
&lt;/p&gt;</description></item></channel></rss>