<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2404.00221</link><description>&lt;p&gt;
&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#24378;&#20581;&#23398;&#20064;&#20197;&#33719;&#24471;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Robust Learning for Optimal Dynamic Treatment Regimes with Observational Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00221
&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20844;&#20849;&#25919;&#31574;&#21644;&#21307;&#30103;&#24178;&#39044;&#28041;&#21450;&#20854;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#21160;&#24577;&#24615;&#65292;&#27835;&#30103;&#36890;&#24120;&#20381;&#25454;&#20808;&#21069;&#27835;&#30103;&#30340;&#21382;&#21490;&#21644;&#30456;&#20851;&#29305;&#24449;&#23545;&#27599;&#20010;&#38454;&#27573;&#30340;&#25928;&#26524;&#20855;&#26377;&#24322;&#36136;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#32479;&#35745;&#23398;&#20064;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;(DTR)&#65292;&#26681;&#25454;&#20010;&#20307;&#30340;&#21382;&#21490;&#25351;&#23548;&#27599;&#20010;&#38454;&#27573;&#30340;&#26368;&#20339;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#35266;&#27979;&#25968;&#25454;&#30340;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#22312;&#39034;&#24207;&#21487;&#24573;&#30053;&#24615;&#20551;&#35774;&#19979;&#23398;&#20064;&#26368;&#20339;DTR&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#39034;&#24207;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#65292;&#22312;&#27599;&#19968;&#27493;&#20013;&#65292;&#25105;&#20204;&#32467;&#21512;&#20542;&#21521;&#35780;&#20998;&#21644;&#34892;&#21160;&#20540;&#20989;&#25968;(Q&#20989;&#25968;)&#30340;&#20272;&#35745;&#37327;&#65292;&#26500;&#24314;&#20102;&#25919;&#31574;&#20215;&#20540;&#30340;&#22686;&#24378;&#21453;&#21521;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00221v1 Announce Type: cross  Abstract: Many public policies and medical interventions involve dynamics in their treatment assignments, where treatments are sequentially assigned to the same individuals across multiple stages, and the effect of treatment at each stage is usually heterogeneous with respect to the history of prior treatments and associated characteristics. We study statistical learning of optimal dynamic treatment regimes (DTRs) that guide the optimal treatment assignment for each individual at each stage based on the individual's history. We propose a step-wise doubly-robust approach to learn the optimal DTR using observational data under the assumption of sequential ignorability. The approach solves the sequential treatment assignment problem through backward induction, where, at each step, we combine estimators of propensity scores and action-value functions (Q-functions) to construct augmented inverse probability weighting estimators of values of policies 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#65292;&#22522;&#20110;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#26500;&#36896;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#21450;&#20854;&#20182;&#23376;&#20154;&#32676;&#30340;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2403.05850</link><description>&lt;p&gt;
&#29992;&#20108;&#20803;&#24037;&#20855;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#22240;&#26524;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimating Causal Effects of Discrete and Continuous Treatments with Binary Instruments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05850
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#65292;&#22522;&#20110;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#26500;&#36896;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#21450;&#20854;&#20182;&#23376;&#20154;&#32676;&#30340;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#12290;&#25105;&#20204;&#26041;&#27861;&#30340;&#22522;&#30784;&#26159;&#28508;&#22312;&#32467;&#26524;&#21644;&#20915;&#23450;&#22788;&#29702;&#20998;&#37197;&#30340;&#19981;&#21487;&#35266;&#27979;&#21464;&#37327;&#30340;&#32852;&#21512;&#20998;&#24067;&#30340;&#23616;&#37096;Copula&#34920;&#31034;&#12290;&#36825;&#31181;&#34920;&#31034;&#20351;&#25105;&#20204;&#33021;&#22815;&#24341;&#20837;&#19968;&#20010;&#25152;&#35859;&#30340;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#35813;&#20551;&#35774;&#38480;&#21046;&#20102;Copula&#20851;&#20110;&#22788;&#29702;&#20542;&#21521;&#30340;&#23616;&#37096;&#20381;&#36182;&#12290;&#25105;&#20204;&#23637;&#31034;Copula&#19981;&#21464;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#20197;&#21450;&#20854;&#20182;&#20122;&#20154;&#32676;&#65288;&#22914;&#25509;&#21463;&#22788;&#29702;&#32773;&#65289;&#30340;&#22788;&#29702;&#25928;&#24212;&#12290;&#35782;&#21035;&#32467;&#26524;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#23548;&#33268;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;&#23545;&#30561;&#30496;&#23545;&#24184;&#31119;&#24863;&#30340;&#24433;&#21709;&#30340;&#24212;&#29992;&#25581;&#31034;&#20102;&#26377;&#36259;&#30340;&#24322;&#36136;&#24615;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05850v1 Announce Type: new  Abstract: We propose an instrumental variable framework for identifying and estimating average and quantile effects of discrete and continuous treatments with binary instruments. The basis of our approach is a local copula representation of the joint distribution of the potential outcomes and unobservables determining treatment assignment. This representation allows us to introduce an identifying assumption, so-called copula invariance, that restricts the local dependence of the copula with respect to the treatment propensity. We show that copula invariance identifies treatment effects for the entire population and other subpopulations such as the treated. The identification results are constructive and lead to straightforward semiparametric estimation procedures based on distribution regression. An application to the effect of sleep on well-being uncovers interesting patterns of heterogeneity.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.16591</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22240;&#26524;&#20998;&#35299;&#32452;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Causal Decomposition of Group Disparities. (arXiv:2306.16591v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#26469;&#23558;&#32467;&#26524;&#20013;&#30340;&#32452;&#24046;&#24322;&#20998;&#35299;&#20026;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#25429;&#25417;&#20102;&#22522;&#32447;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#21069;&#27839;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#21644;&#22788;&#29702;&#36873;&#25321;&#30340;&#32452;&#24046;&#24322;&#30340;&#36129;&#29486;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#21453;&#20107;&#23454;&#30340;&#26041;&#24335;&#36827;&#34892;&#20102;&#25968;&#23398;&#34920;&#36798;&#65292;&#24182;&#19988;&#33021;&#22815;&#26041;&#20415;&#22320;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;&#29305;&#21035;&#26159;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#22788;&#29702;&#36873;&#25321;&#36827;&#34892;&#30340;&#20998;&#35299;&#37096;&#20998;&#26159;&#29305;&#21035;&#26032;&#39062;&#30340;&#65292;&#25581;&#31034;&#20102;&#19968;&#31181;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26032;&#26426;&#21046;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#22240;&#26524;&#26415;&#35821;&#37325;&#26032;&#23450;&#20041;&#20102;&#32463;&#20856;&#30340;Kitagawa-Blinder-Oaxaca&#20998;&#35299;&#65292;&#36890;&#36807;&#35299;&#37322;&#32452;&#24046;&#24322;&#32780;&#19981;&#26159;&#32452;&#25928;&#24212;&#26469;&#34917;&#20805;&#20102;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#65292;&#24182;&#35299;&#20915;&#20102;&#36817;&#26399;&#38543;&#26426;&#31561;&#21270;&#20998;&#35299;&#30340;&#27010;&#24565;&#22256;&#38590;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#20998;&#35299;&#65292;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#23450;&#20041;&#35780;&#20272;&#21644;&#30456;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#26102;&#32435;&#20837;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a causal framework for decomposing a group disparity in an outcome in terms of an intermediate treatment variable. Our framework captures the contributions of group differences in baseline potential outcome, treatment prevalence, average treatment effect, and selection into treatment. This framework is counterfactually formulated and readily informs policy interventions. The decomposition component for differential selection into treatment is particularly novel, revealing a new mechanism for explaining and ameliorating disparities. This framework reformulates the classic Kitagawa-Blinder-Oaxaca decomposition in causal terms, supplements causal mediation analysis by explaining group disparities instead of group effects, and resolves conceptual difficulties of recent random equalization decompositions. We also provide a conditional decomposition that allows researchers to incorporate covariates in defining the estimands and corresponding interventions. We develop nonparametric
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2209.00991</link><description>&lt;p&gt;
E-backtesting&#8212;&#8212;&#19968;&#31181;ES&#39044;&#27979;&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;
&lt;/p&gt;
&lt;p&gt;
E-backtesting. (arXiv:2209.00991v2 [q-fin.RM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.00991
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#30340;ES&#39044;&#27979;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#30340;&#24052;&#22622;&#23572;&#21327;&#35758;&#20013;&#65292;&#39044;&#26399;&#25439;&#22833;&#65288;ES&#65289;&#21462;&#20195;&#20102;&#20215;&#20540;&#25439;&#22833;&#65288;VaR&#65289;&#25104;&#20026;&#38134;&#34892;&#19994;&#24066;&#22330;&#39118;&#38505;&#30340;&#26631;&#20934;&#39118;&#38505;&#24230;&#37327;&#65292;&#20351;&#23427;&#25104;&#20026;&#37329;&#34701;&#30417;&#31649;&#20013;&#26368;&#37325;&#35201;&#30340;&#39118;&#38505;&#24230;&#37327;&#12290;&#39118;&#38505;&#24314;&#27169;&#23454;&#36341;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#20043;&#19968;&#26159;&#22238;&#27979;&#37329;&#34701;&#26426;&#26500;&#25552;&#20379;&#30340;ES&#39044;&#27979;&#12290;&#20026;&#20102;&#35774;&#35745;&#19968;&#31181;ES&#30340;&#26080;&#27169;&#22411;&#22238;&#27979;&#31243;&#24207;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#26368;&#36817;&#21457;&#23637;&#30340;E-&#20540;&#21644;E-&#36807;&#31243;&#25216;&#26415;&#12290;&#24341;&#20837;&#20102;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#26469;&#21046;&#23450;&#39118;&#38505;&#24230;&#37327;&#39044;&#27979;&#30340;E-&#36807;&#31243;&#65292;&#24182;&#21033;&#29992;&#37492;&#21035;&#20989;&#25968;&#30340;&#26368;&#26032;&#32467;&#26524;&#20026;VaR&#21644;ES&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#30830;&#23450;&#20102;&#29420;&#29305;&#30340;&#24418;&#24335;&#12290;&#23545;&#20110;&#32473;&#23450;&#30340;&#26080;&#27169;&#22411;E-&#32479;&#35745;&#37327;&#65292;&#30740;&#31350;&#20102;&#26500;&#24314;E-&#36807;&#31243;&#30340;&#26368;&#20248;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#33258;&#28982;&#22320;&#24212;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#39118;&#38505;&#24230;&#37327;&#21644;&#32479;&#35745;&#37327;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#22823;&#37327;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#25968;&#25454;&#20998;&#26512;&#65292;&#20197;&#35828;&#26126;&#26080;&#27169;&#22411;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the recent Basel Accords, the Expected Shortfall (ES) replaces the Value-at-Risk (VaR) as the standard risk measure for market risk in the banking sector, making it the most important risk measure in financial regulation. One of the most challenging tasks in risk modeling practice is to backtest ES forecasts provided by financial institutions. To design a model-free backtesting procedure for ES, we make use of the recently developed techniques of e-values and e-processes. Model-free e-statistics are introduced to formulate e-processes for risk measure forecasts, and unique forms of model-free e-statistics for VaR and ES are characterized using recent results on identification functions. For a given model-free e-statistic, optimal ways of constructing the e-processes are studied. The proposed method can be naturally applied to many other risk measures and statistical quantities. We conduct extensive simulation studies and data analysis to illustrate the advantages of the model-free b
&lt;/p&gt;</description></item></channel></rss>