<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#39640;&#32500;&#24230;&#31232;&#30095;&#32447;&#24615;&#22238;&#24402;&#20013;&#24322;&#26041;&#24046;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#22522;&#20110;&#20998;&#21306;&#32463;&#39564;&#36125;&#21494;&#26031;ECM&#31639;&#27861;&#30340;&#24322;&#26041;&#24046;&#39640;&#32500;&#24230;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#26469;&#23454;&#29616;&#12290;&#36825;&#20010;&#27169;&#22411;&#21487;&#20197;&#22788;&#29702;&#27531;&#24046;&#26041;&#24046;&#19981;&#24658;&#23450;&#30340;&#24773;&#20917;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#25554;&#20540;&#30340;&#32463;&#39564;&#36125;&#21494;&#26031;&#20272;&#35745;&#36229;&#21442;&#25968;&#26469;&#28789;&#27963;&#22320;&#35843;&#25972;&#26041;&#24046;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2309.08783</link><description>&lt;p&gt;
&#39640;&#32500;&#24230;&#31232;&#30095;&#32447;&#24615;&#22238;&#24402;&#20013;&#30340;&#24322;&#26041;&#24046;&#38382;&#39064;&#21450;&#22522;&#20110;&#20998;&#21306;&#32463;&#39564;&#36125;&#21494;&#26031;ECM&#31639;&#27861;&#30340;&#35299;&#20915;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Heteroscedastic sparse high-dimensional linear regression with a partitioned empirical Bayes ECM algorithm. (arXiv:2309.08783v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08783
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#39640;&#32500;&#24230;&#31232;&#30095;&#32447;&#24615;&#22238;&#24402;&#20013;&#24322;&#26041;&#24046;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#22522;&#20110;&#20998;&#21306;&#32463;&#39564;&#36125;&#21494;&#26031;ECM&#31639;&#27861;&#30340;&#24322;&#26041;&#24046;&#39640;&#32500;&#24230;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#26469;&#23454;&#29616;&#12290;&#36825;&#20010;&#27169;&#22411;&#21487;&#20197;&#22788;&#29702;&#27531;&#24046;&#26041;&#24046;&#19981;&#24658;&#23450;&#30340;&#24773;&#20917;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#25554;&#20540;&#30340;&#32463;&#39564;&#36125;&#21494;&#26031;&#20272;&#35745;&#36229;&#21442;&#25968;&#26469;&#28789;&#27963;&#22320;&#35843;&#25972;&#26041;&#24046;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#32500;&#24230;&#25968;&#25454;&#30340;&#31232;&#30095;&#32447;&#24615;&#22238;&#24402;&#26041;&#27861;&#36890;&#24120;&#20551;&#35774;&#27531;&#24046;&#20855;&#26377;&#24120;&#25968;&#26041;&#24046;&#12290;&#24403;&#36825;&#19968;&#20551;&#35774;&#34987;&#36829;&#32972;&#26102;&#65292;&#20250;&#23548;&#33268;&#20272;&#35745;&#31995;&#25968;&#30340;&#20559;&#24046;&#65292;&#39044;&#27979;&#21306;&#38388;&#38271;&#24230;&#19981;&#21512;&#36866;&#20197;&#21450;&#22686;&#21152;I&#22411;&#38169;&#35823;&#12290;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#20998;&#21306;&#32463;&#39564;&#36125;&#21494;&#26031;&#26399;&#26395;&#26465;&#20214;&#26368;&#22823;&#21270;(H-PROBE)&#31639;&#27861;&#30340;&#24322;&#26041;&#24046;&#39640;&#32500;&#24230;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#12290;H-PROBE&#26159;&#19968;&#31181;&#35745;&#31639;&#25928;&#29575;&#39640;&#30340;&#26368;&#22823;&#21518;&#39564;&#20272;&#35745;&#26041;&#27861;&#65292;&#22522;&#20110;&#21442;&#25968;&#25193;&#23637;&#30340;&#26399;&#26395;&#26465;&#20214;&#26368;&#22823;&#21270;(PX-ECM)&#31639;&#27861;&#12290;&#23427;&#36890;&#36807;&#25554;&#20540;&#30340;&#32463;&#39564;&#36125;&#21494;&#26031;&#20272;&#35745;&#36229;&#21442;&#25968;&#65292;&#22312;&#22238;&#24402;&#21442;&#25968;&#19978;&#20551;&#35774;&#26368;&#23567;&#12290;&#26041;&#24046;&#27169;&#22411;&#20351;&#29992;&#20102;&#22810;&#20803;&#23545;&#25968;&#20285;&#39532;&#20998;&#24067;&#29702;&#35770;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#24182;&#21487;&#20197;&#21253;&#21547;&#20551;&#35774;&#20250;&#24433;&#21709;&#24322;&#36136;&#24615;&#30340;&#21327;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#21160;&#26426;&#26159;&#36890;&#36807;T2&#39640;&#20998;&#36776;&#29575;&#31070;&#32463;&#24433;&#20687;&#30740;&#31350;&#19982;&#22833;&#35821;&#25351;&#25968;(AQ)&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sparse linear regression methods for high-dimensional data often assume that residuals have constant variance. When this assumption is violated, it can lead to bias in estimated coefficients, prediction intervals with improper length, and increased type I errors. This paper proposes a heteroscedastic (H) high-dimensional linear regression model through a partitioned empirical Bayes Expectation Conditional Maximization (H-PROBE) algorithm. H-PROBE is a computationally efficient maximum a posteriori (MAP) estimation approach based on a Parameter-Expanded Expectation-Conditional-Maximization (PX-ECM) algorithm. It requires minimal prior assumptions on the regression parameters through plug-in empirical Bayes estimates of hyperparameters. The variance model uses recent advances in multivariate log-Gamma distribution theory and can include covariates hypothesized to impact heterogeneity. The motivation of our approach is a study relating Aphasia Quotient (AQ) to high-resolution T2 neuroimag
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25216;&#26415;&#65292;&#31216;&#20026;UTOPIA&#65292;&#29992;&#20110;&#32858;&#21512;&#22810;&#20010;&#39044;&#27979;&#21306;&#38388;&#20197;&#20943;&#23567;&#20854;&#23485;&#24230;&#24182;&#20445;&#35777;&#35206;&#30422;&#29575;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#32447;&#24615;&#25110;&#20984;&#35268;&#21010;&#65292;&#26131;&#20110;&#23454;&#29616;&#65292;&#36866;&#29992;&#33539;&#22260;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2306.16549</link><description>&lt;p&gt;
UTOPIA&#65306;&#36890;&#29992;&#21487;&#35757;&#32451;&#30340;&#26368;&#20248;&#39044;&#27979;&#21306;&#38388;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
UTOPIA: Universally Trainable Optimal Prediction Intervals Aggregation. (arXiv:2306.16549v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16549
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25216;&#26415;&#65292;&#31216;&#20026;UTOPIA&#65292;&#29992;&#20110;&#32858;&#21512;&#22810;&#20010;&#39044;&#27979;&#21306;&#38388;&#20197;&#20943;&#23567;&#20854;&#23485;&#24230;&#24182;&#20445;&#35777;&#35206;&#30422;&#29575;&#12290;&#35813;&#26041;&#27861;&#22522;&#20110;&#32447;&#24615;&#25110;&#20984;&#35268;&#21010;&#65292;&#26131;&#20110;&#23454;&#29616;&#65292;&#36866;&#29992;&#33539;&#22260;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26159;&#19968;&#20010;&#26377;&#36259;&#30340;&#38382;&#39064;&#65292;&#22312;&#29983;&#29289;&#21307;&#23398;&#31185;&#23398;&#12289;&#32463;&#27982;&#30740;&#31350;&#21644;&#22825;&#27668;&#39044;&#25253;&#31561;&#21508;&#20010;&#39046;&#22495;&#26377;&#37325;&#35201;&#30340;&#24212;&#29992;&#12290;&#26500;&#24314;&#39044;&#27979;&#21306;&#38388;&#30340;&#26041;&#27861;&#26377;&#24456;&#22810;&#65292;&#22914;&#20998;&#20301;&#25968;&#22238;&#24402;&#21644;&#19968;&#33268;&#24615;&#39044;&#27979;&#31561;&#12290;&#28982;&#32780;&#65292;&#27169;&#22411;&#38169;&#35823;&#35268;&#23450;&#65288;&#23588;&#20854;&#26159;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65289;&#25110;&#27425;&#20248;&#30340;&#26500;&#36896;&#36890;&#24120;&#20250;&#23548;&#33268;&#26377;&#20559;&#25110;&#36807;&#23485;&#30340;&#39044;&#27979;&#21306;&#38388;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#19988;&#24191;&#27867;&#36866;&#29992;&#30340;&#25216;&#26415;&#65292;&#29992;&#20110;&#32858;&#21512;&#22810;&#20010;&#39044;&#27979;&#21306;&#38388;&#20197;&#26368;&#23567;&#21270;&#39044;&#27979;&#24102;&#30340;&#24179;&#22343;&#23485;&#24230;&#21644;&#35206;&#30422;&#20445;&#35777;&#65292;&#31216;&#20026;&#36890;&#29992;&#21487;&#35757;&#32451;&#30340;&#26368;&#20248;&#39044;&#27979;&#21306;&#38388;&#32858;&#21512;&#65288;UTOPIA&#65289;&#12290;&#35813;&#26041;&#27861;&#36824;&#20801;&#35768;&#25105;&#20204;&#26681;&#25454;&#22522;&#26412;&#30340;&#22522;&#20989;&#25968;&#30452;&#25509;&#26500;&#24314;&#39044;&#27979;&#24102;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;&#32447;&#24615;&#25110;&#20984;&#35268;&#21010;&#65292;&#26131;&#20110;&#23454;&#29616;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#25152;&#26377;&#26041;&#27861;&#37117;&#24471;&#21040;&#20102;&#23454;&#39564;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
Uncertainty quantification for prediction is an intriguing problem with significant applications in various fields, such as biomedical science, economic studies, and weather forecasts. Numerous methods are available for constructing prediction intervals, such as quantile regression and conformal predictions, among others. Nevertheless, model misspecification (especially in high-dimension) or sub-optimal constructions can frequently result in biased or unnecessarily-wide prediction intervals. In this paper, we propose a novel and widely applicable technique for aggregating multiple prediction intervals to minimize the average width of the prediction band along with coverage guarantee, called Universally Trainable Optimal Predictive Intervals Aggregation (UTOPIA). The method also allows us to directly construct predictive bands based on elementary basis functions. Our approach is based on linear or convex programming which is easy to implement. All of our proposed methodologies are suppo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#21464;&#37327;&#22788;&#29702;&#24773;&#20917;&#19979;&#30340;&#21453;&#20107;&#23454;&#29983;&#25104;&#27169;&#22411;&#65292;&#33021;&#22815;&#25429;&#25417;&#25972;&#20010;&#21453;&#20107;&#23454;&#20998;&#24067;&#65292;&#24182;&#19988;&#33021;&#22815;&#26377;&#25928;&#25512;&#26029;&#21453;&#20107;&#23454;&#20998;&#24067;&#30340;&#26576;&#20123;&#32479;&#35745;&#37327;&#65292;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#21644;&#20844;&#20849;&#25919;&#31574;&#21046;&#23450;&#39046;&#22495;&#12290;</title><link>http://arxiv.org/abs/2305.15742</link><description>&lt;p&gt;
&#26102;&#38388;&#21464;&#21270;&#22788;&#29702;&#30340;&#21453;&#20107;&#23454;&#29983;&#25104;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Counterfactual Generative Models for Time-Varying Treatments. (arXiv:2305.15742v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15742
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#21464;&#37327;&#22788;&#29702;&#24773;&#20917;&#19979;&#30340;&#21453;&#20107;&#23454;&#29983;&#25104;&#27169;&#22411;&#65292;&#33021;&#22815;&#25429;&#25417;&#25972;&#20010;&#21453;&#20107;&#23454;&#20998;&#24067;&#65292;&#24182;&#19988;&#33021;&#22815;&#26377;&#25928;&#25512;&#26029;&#21453;&#20107;&#23454;&#20998;&#24067;&#30340;&#26576;&#20123;&#32479;&#35745;&#37327;&#65292;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#21644;&#20844;&#20849;&#25919;&#31574;&#21046;&#23450;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20272;&#35745;&#24179;&#22343;&#22240;&#26524;&#25928;&#24212;&#26159;&#27979;&#35797;&#26032;&#30103;&#27861;&#30340;&#24120;&#29992;&#20570;&#27861;&#12290;&#28982;&#32780;&#65292;&#24179;&#22343;&#25928;&#24212;&#20250;&#25513;&#30422;&#21453;&#20107;&#23454;&#20998;&#24067;&#20013;&#37325;&#35201;&#30340;&#20010;&#20307;&#29305;&#24449;&#65292;&#21487;&#33021;&#20250;&#24341;&#36215;&#23433;&#20840;&#12289;&#20844;&#24179;&#21644;&#36947;&#24503;&#26041;&#38754;&#30340;&#25285;&#24551;&#12290;&#36825;&#20010;&#38382;&#39064;&#22312;&#26102;&#38388;&#35774;&#32622;&#20013;&#26356;&#21152;&#20005;&#37325;&#65292;&#22240;&#20026;&#22788;&#29702;&#26159;&#26102;&#24207;&#30340;&#21644;&#26102;&#21464;&#30340;&#65292;&#23545;&#21453;&#20107;&#23454;&#20998;&#24067;&#20135;&#29983;&#20102;&#38169;&#32508;&#22797;&#26434;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#29983;&#25104;&#24314;&#27169;&#26041;&#27861;&#65292;&#20197;&#25429;&#33719;&#25972;&#20010;&#21453;&#20107;&#23454;&#20998;&#24067;&#65292;&#20801;&#35768;&#23545;&#21453;&#20107;&#23454;&#20998;&#24067;&#30340;&#26576;&#20123;&#32479;&#35745;&#37327;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#12290;&#36825;&#20351;&#24471;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#23588;&#20854;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#21644;&#20844;&#20849;&#25919;&#31574;&#21046;&#23450;&#39046;&#22495;&#12290;&#25105;&#20204;&#30340;&#29983;&#25104;&#24314;&#27169;&#26041;&#27861;&#36890;&#36807;&#36793;&#38469;&#32467;&#26500;&#27169;&#22411;&#35880;&#24910;&#22320;&#35299;&#20915;&#20102;&#35266;&#23519;&#25968;&#25454;&#21644;&#30446;&#26631;&#21453;&#20107;&#23454;&#20998;&#24067;&#20043;&#38388;&#30340;&#20998;&#24067;&#19981;&#21305;&#37197;&#12290;&#22312;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#19978;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20248;&#20110;&#29616;&#26377;&#30340;&#22522;&#32447;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimating average causal effects is a common practice to test new treatments. However, the average effect ''masks'' important individual characteristics in the counterfactual distribution, which may lead to safety, fairness, and ethical concerns. This issue is exacerbated in the temporal setting, where the treatment is sequential and time-varying, leading to an intricate influence on the counterfactual distribution. In this paper, we propose a novel conditional generative modeling approach to capture the whole counterfactual distribution, allowing efficient inference on certain statistics of the counterfactual distribution. This makes the proposed approach particularly suitable for healthcare and public policy making. Our generative modeling approach carefully tackles the distribution mismatch in the observed data and the targeted counterfactual distribution via a marginal structural model. Our method outperforms state-of-the-art baselines on both synthetic and real data.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#20851;&#31995;&#25968;&#25454;&#30340;&#20998;&#35299;&#34701;&#21512;&#21387;&#32553;&#27169;&#22411;&#65292;&#36890;&#36807;&#23545;&#20998;&#35299;&#30697;&#38453;&#30340;&#34892;&#21521;&#37327;&#30340;&#36880;&#27425;&#24046;&#20540;&#26045;&#21152;&#20840;&#23616;-&#23616;&#37096;&#21387;&#32553;&#20808;&#39564;&#33719;&#24471;&#25910;&#32553;&#65292;&#24182;&#20855;&#26377;&#35768;&#22810;&#26377;&#21033;&#30340;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2210.00091</link><description>&lt;p&gt;
&#21160;&#24577;&#20851;&#31995;&#25968;&#25454;&#30340;&#20998;&#35299;&#34701;&#21512;&#21387;&#32553;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Factorized Fusion Shrinkage for Dynamic Relational Data. (arXiv:2210.00091v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.00091
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#20851;&#31995;&#25968;&#25454;&#30340;&#20998;&#35299;&#34701;&#21512;&#21387;&#32553;&#27169;&#22411;&#65292;&#36890;&#36807;&#23545;&#20998;&#35299;&#30697;&#38453;&#30340;&#34892;&#21521;&#37327;&#30340;&#36880;&#27425;&#24046;&#20540;&#26045;&#21152;&#20840;&#23616;-&#23616;&#37096;&#21387;&#32553;&#20808;&#39564;&#33719;&#24471;&#25910;&#32553;&#65292;&#24182;&#20855;&#26377;&#35768;&#22810;&#26377;&#21033;&#30340;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#25968;&#25454;&#31185;&#23398;&#24212;&#29992;&#32463;&#24120;&#28041;&#21450;&#20855;&#26377;&#21160;&#24577;&#32467;&#26500;&#30340;&#22797;&#26434;&#20851;&#31995;&#25968;&#25454;&#12290;&#27492;&#31867;&#21160;&#24577;&#20851;&#31995;&#25968;&#25454;&#30340;&#31361;&#21464;&#36890;&#24120;&#20986;&#29616;&#22312;&#30001;&#20110;&#24178;&#39044;&#32780;&#32463;&#21382;&#21046;&#24230;&#21464;&#21270;&#30340;&#31995;&#32479;&#20013;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#20998;&#35299;&#34701;&#21512;&#21387;&#32553;&#27169;&#22411;&#65292;&#20854;&#20013;&#25152;&#26377;&#20998;&#35299;&#22240;&#23376;&#37117;&#34987;&#21160;&#24577;&#22320;&#25910;&#32553;&#21040;&#32452;&#20869;&#34701;&#21512;&#32467;&#26500;&#65292;&#25910;&#32553;&#36890;&#36807;&#23545;&#20998;&#35299;&#30697;&#38453;&#30340;&#34892;&#21521;&#37327;&#30340;&#36880;&#27425;&#24046;&#20540;&#26045;&#21152;&#20840;&#23616;-&#23616;&#37096;&#21387;&#32553;&#20808;&#39564;&#26469;&#33719;&#24471;&#12290;&#25152;&#25552;&#20986;&#30340;&#20808;&#39564;&#22312;&#20272;&#35745;&#30340;&#21160;&#24577;&#28508;&#22312;&#22240;&#23376;&#30340;&#27604;&#36739;&#21644;&#32858;&#31867;&#26041;&#38754;&#20855;&#26377;&#35768;&#22810;&#26377;&#21033;&#30340;&#24615;&#36136;&#12290;&#27604;&#36739;&#20272;&#35745;&#30340;&#28508;&#22312;&#22240;&#23376;&#28041;&#21450;&#30456;&#37051;&#21644;&#38271;&#26399;&#27604;&#36739;&#65292;&#32771;&#34385;&#21040;&#27604;&#36739;&#30340;&#26102;&#38388;&#33539;&#22260;&#20316;&#20026;&#21464;&#37327;&#12290;&#22312;&#26576;&#20123;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#21518;&#39564;&#20998;&#24067;&#36798;&#21040;&#26368;&#23567;&#21270;&#26368;&#22823;&#39118;&#38505;&#65292;&#30452;&#21040;&#23545;&#25968;&#22240;&#23376;&#12290;&#22312;&#35745;&#31639;&#26041;&#38754;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32467;&#26500;&#21270;&#30340;&#22343;&#20540;&#22330;&#21464;&#20998;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Modern data science applications often involve complex relational data with dynamic structures. An abrupt change in such dynamic relational data is typically observed in systems that undergo regime changes due to interventions. In such a case, we consider a factorized fusion shrinkage model in which all decomposed factors are dynamically shrunk towards group-wise fusion structures, where the shrinkage is obtained by applying global-local shrinkage priors to the successive differences of the row vectors of the factorized matrices. The proposed priors enjoy many favorable properties in comparison and clustering of the estimated dynamic latent factors. Comparing estimated latent factors involves both adjacent and long-term comparisons, with the time range of comparison considered as a variable. Under certain conditions, we demonstrate that the posterior distribution attains the minimax optimal rate up to logarithmic factors. In terms of computation, we present a structured mean-field vari
&lt;/p&gt;</description></item></channel></rss>