<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#28151;&#21512;&#21464;&#37327;&#30340;&#26497;&#31471;&#22270;&#27169;&#22411;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#24674;&#22797;&#26465;&#20214;&#22270;&#21644;&#28508;&#21464;&#37327;&#25968;&#37327;&#12290;</title><link>https://arxiv.org/abs/2403.09604</link><description>&lt;p&gt;
&#28151;&#21512;&#21464;&#37327;&#30340;&#26497;&#31471;&#22270;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Extremal graphical modeling with latent variables
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09604
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#28151;&#21512;&#21464;&#37327;&#30340;&#26497;&#31471;&#22270;&#27169;&#22411;&#30340;&#23398;&#20064;&#26041;&#27861;&#65292;&#33021;&#22815;&#26377;&#25928;&#24674;&#22797;&#26465;&#20214;&#22270;&#21644;&#28508;&#21464;&#37327;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26497;&#31471;&#22270;&#27169;&#22411;&#32534;&#30721;&#22810;&#21464;&#37327;&#26497;&#31471;&#26465;&#20214;&#29420;&#31435;&#32467;&#26500;&#65292;&#24182;&#20026;&#37327;&#21270;&#32597;&#35265;&#20107;&#20214;&#39118;&#38505;&#25552;&#20379;&#24378;&#22823;&#24037;&#20855;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#38754;&#21521;&#28508;&#21464;&#37327;&#30340;&#21487;&#24310;&#20280;&#22270;&#27169;&#22411;&#30340;&#21487;&#34892;&#20984;&#35268;&#21010;&#26041;&#27861;&#65292;&#23558; H\"usler-Reiss &#31934;&#24230;&#30697;&#38453;&#20998;&#35299;&#20026;&#32534;&#30721;&#35266;&#23519;&#21464;&#37327;&#20043;&#38388;&#30340;&#22270;&#32467;&#26500;&#30340;&#31232;&#30095;&#37096;&#20998;&#21644;&#32534;&#30721;&#23569;&#37327;&#28508;&#21464;&#37327;&#23545;&#35266;&#23519;&#21464;&#37327;&#30340;&#24433;&#21709;&#30340;&#20302;&#31209;&#37096;&#20998;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;\texttt{eglatent}&#30340;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#65292;&#24182;&#23637;&#31034;&#23427;&#33021;&#19968;&#33268;&#22320;&#24674;&#22797;&#26465;&#20214;&#22270;&#20197;&#21450;&#28508;&#21464;&#37327;&#30340;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09604v1 Announce Type: cross  Abstract: Extremal graphical models encode the conditional independence structure of multivariate extremes and provide a powerful tool for quantifying the risk of rare events. Prior work on learning these graphs from data has focused on the setting where all relevant variables are observed. For the popular class of H\"usler-Reiss models, we propose the \texttt{eglatent} method, a tractable convex program for learning extremal graphical models in the presence of latent variables. Our approach decomposes the H\"usler-Reiss precision matrix into a sparse component encoding the graphical structure among the observed variables after conditioning on the latent variables, and a low-rank component encoding the effect of a few latent variables on the observed variables. We provide finite-sample guarantees of \texttt{eglatent} and show that it consistently recovers the conditional graph as well as the number of latent variables. We highlight the improved 
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#24635;&#32467;&#20102;&#22312;&#20581;&#24247;&#39046;&#22495;&#20013;&#35780;&#20272;AI&#31995;&#32479;&#26102;&#30340;&#19968;&#20010;&#37325;&#35201;&#38382;&#39064;&#65306;&#22522;&#20934;&#20107;&#23454;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#36890;&#24120;&#24573;&#35270;&#20102;&#36825;&#19968;&#28857;&#65292;&#32780;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#32479;&#35745;&#27169;&#22411;&#32858;&#21512;&#27880;&#37322;&#30340;&#26694;&#26550;&#65292;&#20197;&#26356;&#20934;&#30830;&#22320;&#35780;&#20272;AI&#31995;&#32479;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2307.02191</link><description>&lt;p&gt;
&#22312;&#19981;&#30830;&#23450;&#30340;&#22522;&#20934;&#20107;&#23454;&#19979;&#35780;&#20272;AI&#31995;&#32479;&#65306;&#30382;&#32932;&#30149;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Evaluating AI systems under uncertain ground truth: a case study in dermatology. (arXiv:2307.02191v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02191
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#24635;&#32467;&#20102;&#22312;&#20581;&#24247;&#39046;&#22495;&#20013;&#35780;&#20272;AI&#31995;&#32479;&#26102;&#30340;&#19968;&#20010;&#37325;&#35201;&#38382;&#39064;&#65306;&#22522;&#20934;&#20107;&#23454;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#36890;&#24120;&#24573;&#35270;&#20102;&#36825;&#19968;&#28857;&#65292;&#32780;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#32479;&#35745;&#27169;&#22411;&#32858;&#21512;&#27880;&#37322;&#30340;&#26694;&#26550;&#65292;&#20197;&#26356;&#20934;&#30830;&#22320;&#35780;&#20272;AI&#31995;&#32479;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#23433;&#20840;&#36215;&#35265;&#65292;&#22312;&#37096;&#32626;&#20043;&#21069;&#65292;&#21355;&#29983;&#39046;&#22495;&#30340;AI&#31995;&#32479;&#38656;&#35201;&#32463;&#36807;&#20840;&#38754;&#30340;&#35780;&#20272;&#65292;&#23558;&#20854;&#39044;&#27979;&#32467;&#26524;&#19982;&#20551;&#23450;&#20026;&#30830;&#23450;&#30340;&#22522;&#20934;&#20107;&#23454;&#36827;&#34892;&#39564;&#35777;&#12290;&#28982;&#32780;&#65292;&#23454;&#38469;&#24773;&#20917;&#24182;&#38750;&#22914;&#27492;&#65292;&#22522;&#20934;&#20107;&#23454;&#21487;&#33021;&#26159;&#19981;&#30830;&#23450;&#30340;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#22312;&#26631;&#20934;&#30340;AI&#27169;&#22411;&#35780;&#20272;&#20013;&#65292;&#36825;&#19968;&#28857;&#34987;&#22823;&#37096;&#20998;&#24573;&#35270;&#20102;&#65292;&#20294;&#26159;&#23427;&#21487;&#33021;&#20250;&#20135;&#29983;&#20005;&#37325;&#21518;&#26524;&#65292;&#22914;&#39640;&#20272;&#26410;&#26469;&#30340;&#24615;&#33021;&#12290;&#20026;&#20102;&#36991;&#20813;&#36825;&#31181;&#24773;&#20917;&#65292;&#25105;&#20204;&#27979;&#37327;&#20102;&#22522;&#20934;&#20107;&#23454;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#25105;&#20204;&#20551;&#35774;&#23427;&#21487;&#20197;&#20998;&#35299;&#20026;&#20004;&#20010;&#20027;&#35201;&#37096;&#20998;&#65306;&#27880;&#37322;&#19981;&#30830;&#23450;&#24615;&#26159;&#30001;&#20110;&#32570;&#20047;&#21487;&#38752;&#27880;&#37322;&#65292;&#20197;&#21450;&#30001;&#20110;&#26377;&#38480;&#30340;&#35266;&#27979;&#20449;&#24687;&#32780;&#23548;&#33268;&#30340;&#22266;&#26377;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#30830;&#23450;&#22320;&#32858;&#21512;&#27880;&#37322;&#26102;&#65292;&#36890;&#24120;&#20250;&#24573;&#35270;&#36825;&#31181;&#22522;&#20934;&#20107;&#23454;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#20363;&#22914;&#36890;&#36807;&#22810;&#25968;&#25237;&#31080;&#25110;&#24179;&#22343;&#20540;&#26469;&#32858;&#21512;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#22312;&#35813;&#26694;&#26550;&#20013;&#20351;&#29992;&#32479;&#35745;&#27169;&#22411;&#36827;&#34892;&#27880;&#37322;&#30340;&#32858;&#21512;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23558;&#27880;&#37322;&#30340;&#32858;&#21512;&#26694;&#26550;&#35299;&#37322;&#20026;&#25152;&#35859;&#21487;&#33021;&#24615;&#30340;&#21518;&#39564;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
For safety, AI systems in health undergo thorough evaluations before deployment, validating their predictions against a ground truth that is assumed certain. However, this is actually not the case and the ground truth may be uncertain. Unfortunately, this is largely ignored in standard evaluation of AI models but can have severe consequences such as overestimating the future performance. To avoid this, we measure the effects of ground truth uncertainty, which we assume decomposes into two main components: annotation uncertainty which stems from the lack of reliable annotations, and inherent uncertainty due to limited observational information. This ground truth uncertainty is ignored when estimating the ground truth by deterministically aggregating annotations, e.g., by majority voting or averaging. In contrast, we propose a framework where aggregation is done using a statistical model. Specifically, we frame aggregation of annotations as posterior inference of so-called plausibilities
&lt;/p&gt;</description></item></channel></rss>