<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#21644;&#26497;&#20540;&#29702;&#35770;&#30340;&#21160;&#24577;&#39118;&#38505;&#27979;&#37327;&#27169;&#22411;&#65292;&#32467;&#21512;&#37325;&#23614;&#20998;&#24067;&#21644;&#26464;&#26438;&#25928;&#24212;&#65292;&#33021;&#22815;&#26356;&#26377;&#25928;&#22320;&#36991;&#20813;&#37329;&#34701;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2201.09434</link><description>&lt;p&gt;
&#36890;&#36807;MCMC&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;EVT&#21160;&#24577;&#39118;&#38505;&#27979;&#37327;
&lt;/p&gt;
&lt;p&gt;
Dynamic Risk Measurement by EVT based on Stochastic Volatility models via MCMC. (arXiv:2201.09434v4 [stat.AP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.09434
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#21644;&#26497;&#20540;&#29702;&#35770;&#30340;&#21160;&#24577;&#39118;&#38505;&#27979;&#37327;&#27169;&#22411;&#65292;&#32467;&#21512;&#37325;&#23614;&#20998;&#24067;&#21644;&#26464;&#26438;&#25928;&#24212;&#65292;&#33021;&#22815;&#26356;&#26377;&#25928;&#22320;&#36991;&#20813;&#37329;&#34701;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#25551;&#36848;&#37329;&#34701;&#24066;&#22330;&#22238;&#25253;&#21644;&#27874;&#21160;&#24615;&#30340;&#20856;&#22411;&#20107;&#23454;&#29305;&#24449;&#65292;&#24182;&#35299;&#20915;&#36164;&#20135;&#22238;&#25253;&#30340;&#23614;&#37096;&#29305;&#24449;&#26410;&#34987;&#20805;&#20998;&#32771;&#34385;&#30340;&#38382;&#39064;&#65292;&#20197;&#26356;&#26377;&#25928;&#22320;&#36991;&#20813;&#39118;&#38505;&#21644;&#29983;&#20135;&#24615;&#22320;&#31649;&#29702;&#32929;&#31080;&#24066;&#22330;&#39118;&#38505;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#23558;&#37325;&#23614;&#20998;&#24067;&#21644;&#26464;&#26438;&#25928;&#24212;&#24341;&#20837;SV&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#36890;&#36807;MCMC&#20272;&#31639;&#27169;&#22411;&#21442;&#25968;&#12290;&#38543;&#21518;&#65292;&#20840;&#38754;&#25551;&#36848;&#20102;&#37329;&#34701;&#24066;&#22330;&#22238;&#25253;&#30340;&#37325;&#23614;&#20998;&#24067;&#65292;&#24182;&#23558;&#20854;&#19982;&#26497;&#20540;&#29702;&#35770;&#30456;&#32467;&#21512;&#65292;&#20197;&#25311;&#21512;&#26631;&#20934;&#27531;&#24046;&#30340;&#23614;&#37096;&#20998;&#24067;&#12290;&#20854;&#21518;&#65292;&#24314;&#31435;&#20102;&#19968;&#31181;&#26032;&#30340;&#37329;&#34701;&#39118;&#38505;&#27979;&#37327;&#27169;&#22411;&#65292;&#31216;&#20026;SV-EVT-VaR&#21160;&#24577;&#27169;&#22411;&#12290;&#36890;&#36807;&#20351;&#29992;&#27599;&#26085;&#30340;&#26631;&#26222;500&#25351;&#25968;&#21644;&#27169;&#25311;&#22238;&#25253;&#65292;&#36798;&#25104;&#20102;&#23454;&#35777;&#32467;&#26524;&#65292;&#25581;&#31034;&#20102;SV-EVT&#27169;&#22411;&#22312;&#22806;&#26679;&#26412;&#22238;&#27979;&#20013;&#21487;&#20197;&#20248;&#20110;&#20854;&#20182;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to characterize the typical factual characteristics of financial market returns and volatility and address the problem that the tail characteristics of asset returns have been not sufficiently considered, as an attempt to more effectively avoid risks and productively manage stock market risks. Thus, in this paper, the fat-tailed distribution and the leverage effect are introduced into the SV model. Next, the model parameters are estimated through MCMC. Subsequently, the fat-tailed distribution of financial market returns is comprehensively characterized and then incorporated with extreme value theory to fit the tail distribution of standard residuals. Afterward, a new financial risk measurement model is built, which is termed the SV-EVT-VaR-based dynamic model. With the use of daily S&amp;P 500 index and simulated returns, the empirical results are achieved, which reveal that the SV-EVT-based models can outperform other models for out-of-sample data in backtesting and depic
&lt;/p&gt;</description></item></channel></rss>