<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#32593;&#32476;&#24178;&#25200;&#19979;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;&#26469;&#20272;&#35745;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#36873;&#25321;&#26368;&#20248;&#32858;&#31867;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#29616;&#25104;&#30340;&#21322;&#23450;&#35268;&#21010;&#31639;&#27861;&#35745;&#31639;&#19968;&#20010;&#26032;&#22411;&#24809;&#32602;&#26368;&#23567;&#21106;&#20248;&#21270;&#38382;&#39064;&#30340;&#35299;&#26469;&#36817;&#20284;&#26368;&#20248;&#32858;&#31867;&#65292;&#21516;&#26102;&#36824;&#30830;&#23450;&#20102;&#36873;&#25321;&#31751;&#25110;&#20010;&#20307;&#32423;&#38543;&#26426;&#21270;&#20043;&#38388;&#26131;&#20110;&#26816;&#26597;&#30340;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2310.14983</link><description>&lt;p&gt;
&#22240;&#26524;&#32858;&#31867;&#65306;&#22312;&#32593;&#32476;&#24178;&#25200;&#19979;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Causal clustering: design of cluster experiments under network interference. (arXiv:2310.14983v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14983
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#32593;&#32476;&#24178;&#25200;&#19979;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;&#26469;&#20272;&#35745;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#36873;&#25321;&#26368;&#20248;&#32858;&#31867;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#29616;&#25104;&#30340;&#21322;&#23450;&#35268;&#21010;&#31639;&#27861;&#35745;&#31639;&#19968;&#20010;&#26032;&#22411;&#24809;&#32602;&#26368;&#23567;&#21106;&#20248;&#21270;&#38382;&#39064;&#30340;&#35299;&#26469;&#36817;&#20284;&#26368;&#20248;&#32858;&#31867;&#65292;&#21516;&#26102;&#36824;&#30830;&#23450;&#20102;&#36873;&#25321;&#31751;&#25110;&#20010;&#20307;&#32423;&#38543;&#26426;&#21270;&#20043;&#38388;&#26131;&#20110;&#26816;&#26597;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21333;&#19968;&#32593;&#32476;&#23384;&#22312;&#22806;&#28322;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#65292;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;&#26469;&#20272;&#35745;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#35745;&#37327;&#32463;&#27982;&#23398;&#30340;&#26694;&#26550;&#65292;&#36873;&#25321;&#26368;&#23567;&#21270;&#20272;&#35745;&#30340;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#30340;&#26368;&#22351;&#22343;&#26041;&#35823;&#24046;&#30340;&#32858;&#31867;&#26041;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#26368;&#20248;&#32858;&#31867;&#26041;&#27861;&#21487;&#20197;&#36817;&#20284;&#20026;&#36890;&#36807;&#29616;&#25104;&#30340;&#21322;&#23450;&#35268;&#21010;&#31639;&#27861;&#35745;&#31639;&#30340;&#19968;&#31181;&#26032;&#22411;&#24809;&#32602;&#26368;&#23567;&#21106;&#20248;&#21270;&#38382;&#39064;&#30340;&#35299;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#36824;&#30830;&#23450;&#20102;&#36873;&#25321;&#31751;&#25110;&#20010;&#20307;&#32423;&#38543;&#26426;&#21270;&#20043;&#38388;&#26131;&#20110;&#26816;&#26597;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;Facebook&#29992;&#25143;&#23431;&#23449;&#30340;&#29420;&#29305;&#32593;&#32476;&#25968;&#25454;&#21644;&#29616;&#26377;&#30340;&#32593;&#32476;&#23454;&#39564;&#25968;&#25454;&#26469;&#35828;&#26126;&#35813;&#26041;&#27861;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the design of cluster experiments to estimate the global treatment effect in the presence of spillovers on a single network. We provide an econometric framework to choose the clustering that minimizes the worst-case mean-squared error of the estimated global treatment effect. We show that the optimal clustering can be approximated as the solution of a novel penalized min-cut optimization problem computed via off-the-shelf semi-definite programming algorithms. Our analysis also characterizes easy-to-check conditions to choose between a cluster or individual-level randomization. We illustrate the method's properties using unique network data from the universe of Facebook's users and existing network data from a field experiment.
&lt;/p&gt;</description></item></channel></rss>