<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25193;&#23637;&#20102;ICP&#21407;&#21017;&#65292;&#32771;&#34385;&#20102;&#22312;&#19981;&#21516;&#29615;&#22659;&#19979;&#20855;&#26377;&#23616;&#37096;&#32447;&#24615;&#27169;&#22411;&#30340;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#20219;&#21153;&#12290;&#36890;&#36807;&#25552;&#20379;&#22240;&#26524;&#29238;&#33410;&#28857;&#30340;&#21487;&#36776;&#35782;&#24615;&#26465;&#20214;&#21644;&#24341;&#20837;LoLICaP&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#35266;&#23519;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#22240;&#26524;&#29238;&#33410;&#28857;&#12290;</title><link>http://arxiv.org/abs/2401.05218</link><description>&lt;p&gt;
&#20855;&#26377;&#23616;&#37096;&#32447;&#24615;&#27169;&#22411;&#30340;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Invariant Causal Prediction with Locally Linear Models. (arXiv:2401.05218v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05218
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25193;&#23637;&#20102;ICP&#21407;&#21017;&#65292;&#32771;&#34385;&#20102;&#22312;&#19981;&#21516;&#29615;&#22659;&#19979;&#20855;&#26377;&#23616;&#37096;&#32447;&#24615;&#27169;&#22411;&#30340;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#20219;&#21153;&#12290;&#36890;&#36807;&#25552;&#20379;&#22240;&#26524;&#29238;&#33410;&#28857;&#30340;&#21487;&#36776;&#35782;&#24615;&#26465;&#20214;&#21644;&#24341;&#20837;LoLICaP&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#35266;&#23519;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#22240;&#26524;&#29238;&#33410;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#36890;&#36807;&#35266;&#23519;&#25968;&#25454;&#65292;&#20174;&#19968;&#32452;&#20505;&#36873;&#21464;&#37327;&#20013;&#35782;&#21035;&#20986;&#30446;&#26631;&#21464;&#37327;&#30340;&#22240;&#26524;&#29238;&#33410;&#28857;&#30340;&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#20551;&#35774;&#26159;&#20505;&#36873;&#21464;&#37327;&#22312;&#19981;&#21516;&#30340;&#29615;&#22659;&#20013;&#34987;&#35266;&#23519;&#21040;&#65292;&#36825;&#20123;&#29615;&#22659;&#21487;&#20197;&#23545;&#24212;&#20110;&#26426;&#22120;&#30340;&#19981;&#21516;&#35774;&#32622;&#25110;&#32773;&#21160;&#24577;&#36807;&#31243;&#20013;&#30340;&#19981;&#21516;&#26102;&#38388;&#38388;&#38548;&#31561;&#12290;&#22312;&#19968;&#23450;&#30340;&#20551;&#35774;&#26465;&#20214;&#19979;&#65292;&#19981;&#21516;&#30340;&#29615;&#22659;&#21487;&#20197;&#34987;&#35270;&#20026;&#23545;&#35266;&#23519;&#31995;&#32479;&#30340;&#24178;&#39044;&#12290;&#25105;&#20204;&#20551;&#35774;&#30446;&#26631;&#21464;&#37327;&#21644;&#21327;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#32447;&#24615;&#20851;&#31995;&#65292;&#22312;&#27599;&#20010;&#29615;&#22659;&#19979;&#21487;&#33021;&#19981;&#21516;&#65292;&#20294;&#22240;&#26524;&#32467;&#26500;&#22312;&#19981;&#21516;&#29615;&#22659;&#20013;&#26159;&#19981;&#21464;&#30340;&#12290;&#36825;&#26159;Peters&#31561;&#20154;[2016]&#25552;&#20986;&#30340;ICP&#65288;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#65289;&#21407;&#21017;&#30340;&#25193;&#23637;&#65292;&#21518;&#32773;&#20551;&#35774;&#25152;&#26377;&#29615;&#22659;&#19979;&#23384;&#22312;&#19968;&#20010;&#22266;&#23450;&#30340;&#32447;&#24615;&#20851;&#31995;&#12290;&#22312;&#25105;&#20204;&#25552;&#20986;&#30340;&#35774;&#32622;&#19979;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#22240;&#26524;&#29238;&#33410;&#28857;&#21487;&#36776;&#35782;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#21517;&#20026;LoLICaP&#30340;&#23454;&#29992;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the task of identifying the causal parents of a target variable among a set of candidate variables from observational data. Our main assumption is that the candidate variables are observed in different environments which may, for example, correspond to different settings of a machine or different time intervals in a dynamical process. Under certain assumptions different environments can be regarded as interventions on the observed system. We assume a linear relationship between target and covariates, which can be different in each environment with the only restriction that the causal structure is invariant across environments. This is an extension of the ICP ($\textbf{I}$nvariant $\textbf{C}$ausal $\textbf{P}$rediction) principle by Peters et al. [2016], who assumed a fixed linear relationship across all environments. Within our proposed setting we provide sufficient conditions for identifiability of the causal parents and introduce a practical method called LoLICaP ($\text
&lt;/p&gt;</description></item></channel></rss>