<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;2019&#24180;&#33267;2022&#24180;&#38388;&#30340;&#39640;&#39057;&#27604;&#29305;&#24065;&#26085;&#20869;&#25968;&#25454;&#38598;&#65292;&#21457;&#29616;&#27604;&#29305;&#24065;&#20215;&#26684;&#22238;&#25253;&#34920;&#29616;&#20986;&#20102;&#20004;&#20010;&#19981;&#21516;&#26102;&#26399;&#30340;&#24322;&#24120;&#25193;&#25955;&#36807;&#31243;&#65292;&#20855;&#26377;&#37325;&#23614;&#29305;&#24449;&#21644;&#26102;&#38388;&#20381;&#36182;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.11930</link><description>&lt;p&gt;
&#39640;&#39057;&#27604;&#29305;&#24065;&#26102;&#38388;&#24207;&#21015;&#30340;&#39118;&#26684;&#21270;&#20107;&#23454;
&lt;/p&gt;
&lt;p&gt;
Stylized Facts of High-Frequency Bitcoin Time Series
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11930
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;2019&#24180;&#33267;2022&#24180;&#38388;&#30340;&#39640;&#39057;&#27604;&#29305;&#24065;&#26085;&#20869;&#25968;&#25454;&#38598;&#65292;&#21457;&#29616;&#27604;&#29305;&#24065;&#20215;&#26684;&#22238;&#25253;&#34920;&#29616;&#20986;&#20102;&#20004;&#20010;&#19981;&#21516;&#26102;&#26399;&#30340;&#24322;&#24120;&#25193;&#25955;&#36807;&#31243;&#65292;&#20855;&#26377;&#37325;&#23614;&#29305;&#24449;&#21644;&#26102;&#38388;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;2019&#24180;&#33267;2022&#24180;&#38388;&#30340;&#39640;&#39057;&#27604;&#29305;&#24065;&#26085;&#20869;&#25968;&#25454;&#38598;&#12290;&#22312;&#27492;&#26399;&#38388;&#65292;&#27604;&#29305;&#24065;&#24066;&#22330;&#25351;&#25968;&#34920;&#29616;&#20986;&#20004;&#20010;&#26126;&#26174;&#26102;&#26399;&#65292;&#20854;&#29305;&#24449;&#26159;&#27874;&#21160;&#24615;&#30340;&#31361;&#28982;&#21464;&#21270;&#12290;&#20004;&#20010;&#26102;&#26399;&#30340;&#27604;&#29305;&#24065;&#20215;&#26684;&#22238;&#25253;&#21487;&#29992;&#24322;&#24120;&#25193;&#25955;&#36807;&#31243;&#26469;&#25551;&#36848;&#65292;&#20174;&#30701;&#26102;&#38388;&#38388;&#38548;&#19979;&#30340;&#27425;&#25193;&#25955;&#36807;&#28193;&#21040;&#38271;&#26102;&#38388;&#38388;&#38548;&#19978;&#30340;&#24369;&#36229;&#25193;&#25955;&#12290;&#26412;&#25991;&#30740;&#31350;&#30340;&#19982;&#36825;&#31181;&#24322;&#24120;&#34892;&#20026;&#30456;&#20851;&#30340;&#29305;&#24449;&#21253;&#25324;&#37325;&#23614;&#65292;&#21487;&#20197;&#29992;$q$-&#39640;&#26031;&#20998;&#24067;&#21644;&#30456;&#20851;&#24615;&#26469;&#25551;&#36848;&#12290;&#24403;&#23545;&#32477;&#23545;&#22238;&#25253;&#30340;&#33258;&#30456;&#20851;&#36827;&#34892;&#21462;&#26679;&#26102;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#19968;&#31181;&#24130;&#24459;&#20851;&#31995;&#65292;&#34920;&#26126;&#20004;&#20010;&#26102;&#26399;&#20013;&#26368;&#21021;&#23384;&#22312;&#26102;&#38388;&#20381;&#36182;&#24615;&#12290;&#22238;&#25253;&#30340;&#25972;&#20307;&#33258;&#30456;&#20851;&#36805;&#36895;&#34928;&#20943;&#24182;&#34920;&#29616;&#20986;&#21608;&#26399;&#24615;&#12290;&#25105;&#20204;&#23558;&#33258;&#30456;&#20851;&#25311;&#21512;&#20026;&#24130;&#24459;&#21644;&#20313;&#24358;&#20989;&#25968;&#65292;&#20197;&#25429;&#25417;&#34928;&#20943;&#21644;&#27874;&#21160;&#65292;&#24182;&#21457;&#29616;&#20102;&#36825;&#20004;&#31181;&#20989;&#25968;&#30340;&#29305;&#24449;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11930v1 Announce Type: new  Abstract: This paper analyses the high-frequency intraday Bitcoin dataset from 2019 to 2022. During this time frame, the Bitcoin market index exhibited two distinct periods characterized by abrupt changes in volatility. The Bitcoin price returns for both periods can be described by an anomalous diffusion process, transitioning from subdiffusion for short intervals to weak superdiffusion over longer time intervals. The characteristic features related to this anomalous behavior studied in the present paper include heavy tails, which can be described using a $q$-Gaussian distribution and correlations. When we sample the autocorrelation of absolute returns, we observe a power-law relationship, indicating time dependency in both periods initially. The ensemble autocorrelation of returns decays rapidly and exhibits periodicity. We fitted the autocorrelation with a power law and a cosine function to capture both the decay and the fluctuation and found th
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#34701;&#21512;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#30340;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#22312;&#25439;&#22833;&#20989;&#25968;&#20013;&#20351;&#29992;Wasserstein&#21644;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#65292;&#23454;&#29616;&#20102;&#23545;&#28508;&#22312;&#31354;&#38388;&#30340;&#26377;&#25928;&#23398;&#20064;&#65292;&#24182;&#33021;&#22815;&#29983;&#25104;&#22810;&#26679;&#19988;&#39640;&#36136;&#37327;&#30340;&#26679;&#26412;&#12290;</title><link>http://arxiv.org/abs/2308.14048</link><description>&lt;p&gt;
&#19968;&#31181;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#29992;&#20110;&#29983;&#25104;&#27169;&#22411;&#65306;&#20351;&#29992;Wasserstein&#21644;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#38598;&#25104;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#21644;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
A Bayesian Non-parametric Approach to Generative Models: Integrating Variational Autoencoder and Generative Adversarial Networks using Wasserstein and Maximum Mean Discrepancy. (arXiv:2308.14048v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.14048
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#34701;&#21512;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#21644;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#30340;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#22312;&#25439;&#22833;&#20989;&#25968;&#20013;&#20351;&#29992;Wasserstein&#21644;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#65292;&#23454;&#29616;&#20102;&#23545;&#28508;&#22312;&#31354;&#38388;&#30340;&#26377;&#25928;&#23398;&#20064;&#65292;&#24182;&#33021;&#22815;&#29983;&#25104;&#22810;&#26679;&#19988;&#39640;&#36136;&#37327;&#30340;&#26679;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#27169;&#22411;&#24050;&#25104;&#20026;&#19968;&#31181;&#20135;&#29983;&#19982;&#30495;&#23454;&#22270;&#20687;&#38590;&#20197;&#21306;&#20998;&#30340;&#39640;&#36136;&#37327;&#22270;&#20687;&#30340;&#26377;&#21069;&#36884;&#30340;&#25216;&#26415;&#12290;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#21644;&#21464;&#20998;&#33258;&#32534;&#30721;&#22120;&#65288;VAE&#65289;&#26159;&#26368;&#20026;&#37325;&#35201;&#19988;&#34987;&#24191;&#27867;&#30740;&#31350;&#30340;&#20004;&#31181;&#29983;&#25104;&#27169;&#22411;&#12290;GAN&#22312;&#29983;&#25104;&#36924;&#30495;&#22270;&#20687;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#65292;&#32780;VAE&#21017;&#33021;&#22815;&#29983;&#25104;&#22810;&#26679;&#30340;&#22270;&#20687;&#12290;&#28982;&#32780;&#65292;GAN&#24573;&#35270;&#20102;&#22823;&#37096;&#20998;&#21487;&#33021;&#30340;&#36755;&#20986;&#31354;&#38388;&#65292;&#36825;&#23548;&#33268;&#19981;&#33021;&#23436;&#20840;&#20307;&#29616;&#30446;&#26631;&#20998;&#24067;&#30340;&#22810;&#26679;&#24615;&#65292;&#32780;VAE&#21017;&#24120;&#24120;&#29983;&#25104;&#27169;&#31946;&#22270;&#20687;&#12290;&#20026;&#20102;&#20805;&#20998;&#21457;&#25381;&#20004;&#31181;&#27169;&#22411;&#30340;&#20248;&#28857;&#24182;&#20943;&#36731;&#23427;&#20204;&#30340;&#24369;&#28857;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#36125;&#21494;&#26031;&#38750;&#21442;&#25968;&#26041;&#27861;&#23558;GAN&#21644;VAE&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#25439;&#22833;&#20989;&#25968;&#20013;&#21516;&#26102;&#20351;&#29992;&#20102;Wasserstein&#21644;&#26368;&#22823;&#22343;&#20540;&#24046;&#24322;&#24230;&#37327;&#65292;&#20197;&#26377;&#25928;&#23398;&#20064;&#28508;&#22312;&#31354;&#38388;&#24182;&#29983;&#25104;&#22810;&#26679;&#19988;&#39640;&#36136;&#37327;&#30340;&#26679;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative models have emerged as a promising technique for producing high-quality images that are indistinguishable from real images. Generative adversarial networks (GANs) and variational autoencoders (VAEs) are two of the most prominent and widely studied generative models. GANs have demonstrated excellent performance in generating sharp realistic images and VAEs have shown strong abilities to generate diverse images. However, GANs suffer from ignoring a large portion of the possible output space which does not represent the full diversity of the target distribution, and VAEs tend to produce blurry images. To fully capitalize on the strengths of both models while mitigating their weaknesses, we employ a Bayesian non-parametric (BNP) approach to merge GANs and VAEs. Our procedure incorporates both Wasserstein and maximum mean discrepancy (MMD) measures in the loss function to enable effective learning of the latent space and generate diverse and high-quality samples. By fusing the di
&lt;/p&gt;</description></item></channel></rss>