<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#25968;&#23383;&#23402;&#29983;&#25216;&#26415;&#22312;&#22303;&#26408;&#24037;&#31243;&#39046;&#22495;&#30340;&#37319;&#29992;&#31574;&#30053;&#38656;&#35201;&#37325;&#26032;&#23450;&#20301;&#65292;&#20197;&#35299;&#20915;&#19981;&#21516;&#38454;&#27573;&#30340;&#25361;&#25112;&#21644;&#24212;&#29992;&#20998;&#25955;&#24615;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.02426</link><description>&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#21644;&#22303;&#26408;&#24037;&#31243;&#38454;&#27573;&#65306;&#37325;&#26032;&#23450;&#20301;&#37319;&#29992;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Digital Twins and Civil Engineering Phases: Reorienting Adoption Strategies
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02426
&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#25216;&#26415;&#22312;&#22303;&#26408;&#24037;&#31243;&#39046;&#22495;&#30340;&#37319;&#29992;&#31574;&#30053;&#38656;&#35201;&#37325;&#26032;&#23450;&#20301;&#65292;&#20197;&#35299;&#20915;&#19981;&#21516;&#38454;&#27573;&#30340;&#25361;&#25112;&#21644;&#24212;&#29992;&#20998;&#25955;&#24615;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#23402;&#29983;&#65288;DT&#65289;&#25216;&#26415;&#22810;&#24180;&#26469;&#21463;&#21040;&#26497;&#22823;&#20851;&#27880;&#65292;&#22240;&#20026;&#23427;&#20026;&#31185;&#23398;&#21644;&#24037;&#31243;&#21508;&#21033;&#30410;&#30456;&#20851;&#32773;&#24102;&#26469;&#20102;&#35768;&#22810;&#25215;&#35834;&#12290;&#22240;&#27492;&#65292;&#20154;&#20204;&#25506;&#35752;&#20102;&#25968;&#23383;&#23402;&#29983;&#30340;&#19981;&#21516;&#20027;&#39064;&#39046;&#22495;&#12290;&#22303;&#26408;&#24037;&#31243;&#31561;&#29305;&#23450;&#39046;&#22495;&#20063;&#19981;&#20363;&#22806;&#65292;&#23548;&#33268;&#20102;&#38024;&#23545;&#29305;&#23450;&#39046;&#22495;&#24212;&#29992;&#30340;&#30862;&#29255;&#21270;&#26041;&#27861;&#12290;&#22303;&#26408;&#24037;&#31243;&#34892;&#19994;&#22312;&#36825;&#26041;&#38754;&#36827;&#19968;&#27493;&#22788;&#20110;&#19981;&#21033;&#22320;&#20301;&#65292;&#22240;&#20026;&#23427;&#20381;&#36182;&#20854;&#20182;&#24037;&#31243;&#39046;&#22495;&#30340;&#22806;&#37096;&#25216;&#26415;&#26469;&#36827;&#34892;&#25968;&#23383;&#23402;&#29983;&#30340;&#37319;&#29992;&#12290;&#36825;&#20123;&#25193;&#23637;&#30340;&#19968;&#20010;&#19981;&#26029;&#22686;&#21152;&#30340;&#21518;&#26524;&#26159;&#23558;&#25968;&#23383;&#23402;&#29983;&#38598;&#20013;&#24212;&#29992;&#20110;&#36816;&#33829;&#21644;&#32500;&#25252;&#38454;&#27573;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#24314;&#31569;&#20449;&#24687;&#24314;&#27169;&#65288;BIM&#65289;&#34987;&#24191;&#27867;&#29992;&#20110;&#35268;&#21010;/&#35774;&#35745;&#38454;&#27573;&#65292;&#32780;&#26045;&#24037;&#38454;&#27573;&#30340;&#30636;&#21464;&#24615;&#36136;&#23545;&#20110;&#25968;&#23383;&#23402;&#29983;&#30340;&#37319;&#29992;&#26500;&#25104;&#20102;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25968;&#23383;&#23402;&#29983;&#22312;&#24314;&#31569;&#35774;&#35745;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02426v1 Announce Type: cross  Abstract: Digital twin (DT) technology has received immense attention over the years due to the promises it presents to various stakeholders in science and engineering. As a result, different thematic areas of DT have been explored. This is no different in specific fields such as manufacturing, automation, oil and gas, and civil engineering, leading to fragmented approaches for field-specific applications. The civil engineering industry is further disadvantaged in this regard as it relies on external techniques by other engineering fields for its DT adoption. A rising consequence of these extensions is a concentrated application of DT to the operations and maintenance phase. On another spectrum, Building Information Modeling (BIM) are pervasively utilized in the planning/design phase, and the transient nature of the construction phase remains a challenge for its DT adoption. In this paper, we present a phase-based development of DT in the Archit
&lt;/p&gt;</description></item></channel></rss>