<rss version="2.0"><channel><title>Chat Arxiv stat.AP</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.AP</description><item><title>&#22788;&#29702;&#30340;&#22238;&#24402;&#31995;&#25968;&#36890;&#24120;&#19981;&#31561;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65292;&#19988;&#21487;&#33021;&#19981;&#26159;&#30452;&#25509;&#31185;&#23398;&#25110;&#25919;&#31574;&#24863;&#20852;&#36259;&#30340;&#25968;&#37327;&#12290;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#21508;&#31181;&#35299;&#37322;&#12289;&#36793;&#30028;&#21644;&#35786;&#26029;&#36741;&#21161;&#24037;&#20855;&#26469;&#35299;&#37322;&#36825;&#31181;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2403.03299</link><description>&lt;p&gt;
&#29702;&#35299;&#21644;&#36991;&#20813;&#8220;&#22238;&#24402;&#26435;&#37325;&#8221;&#65306;&#24322;&#36136;&#25928;&#24212;&#12289;&#35823;&#35774;&#21644;&#38271;&#20037;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Understanding and avoiding the "weights of regression": Heterogeneous effects, misspecification, and longstanding solutions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03299
&lt;/p&gt;
&lt;p&gt;
&#22788;&#29702;&#30340;&#22238;&#24402;&#31995;&#25968;&#36890;&#24120;&#19981;&#31561;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65292;&#19988;&#21487;&#33021;&#19981;&#26159;&#30452;&#25509;&#31185;&#23398;&#25110;&#25919;&#31574;&#24863;&#20852;&#36259;&#30340;&#25968;&#37327;&#12290;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#21508;&#31181;&#35299;&#37322;&#12289;&#36793;&#30028;&#21644;&#35786;&#26029;&#36741;&#21161;&#24037;&#20855;&#26469;&#35299;&#37322;&#36825;&#31181;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#21162;&#21147;&#36890;&#36807;&#22312;&#22788;&#29702;&#65288;D&#65289;&#21644;&#35266;&#23519;&#21040;&#30340;&#28151;&#26434;&#22240;&#32032;&#65288;X&#65289;&#19978;&#23545;&#32467;&#26524;&#25968;&#25454;&#65288;Y&#65289;&#36827;&#34892;&#22238;&#24402;&#26469;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#12290;&#21363;&#20351;&#19981;&#23384;&#22312;&#26410;&#35266;&#23519;&#21040;&#30340;&#28151;&#26434;&#22240;&#32032;&#65292;&#22788;&#29702;&#30340;&#22238;&#24402;&#31995;&#25968;&#20063;&#20250;&#25253;&#21578;&#20998;&#23618;&#29305;&#23450;&#22788;&#29702;&#25928;&#24212;&#30340;&#21152;&#26435;&#24179;&#22343;&#20540;&#12290;&#24403;&#26080;&#27861;&#25490;&#38500;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#26102;&#65292;&#24471;&#21040;&#30340;&#31995;&#25968;&#36890;&#24120;&#19981;&#31561;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65292;&#20063;&#19981;&#22826;&#21487;&#33021;&#26159;&#30452;&#25509;&#31185;&#23398;&#25110;&#25919;&#31574;&#24863;&#20852;&#36259;&#30340;&#25968;&#37327;&#12290;&#31995;&#25968;&#19982;ATE&#20043;&#38388;&#30340;&#24046;&#24322;&#23548;&#33268;&#30740;&#31350;&#20154;&#21592;&#25552;&#20986;&#21508;&#31181;&#35299;&#37322;&#12289;&#36793;&#30028;&#21644;&#35786;&#26029;&#36741;&#21161;&#24037;&#20855;&#12290;&#25105;&#20204;&#27880;&#24847;&#21040;&#65292;&#22312;&#22788;&#29702;&#25928;&#24212;&#22312;X&#20013;&#26159;&#24322;&#36136;&#30340;&#26102;&#65292;&#23545;Y&#20851;&#20110;D&#21644;X&#30340;&#32447;&#24615;&#22238;&#24402;&#21487;&#33021;&#23384;&#22312;&#35823;&#35774;&#12290;&#22238;&#24402;&#30340;&#8220;&#26435;&#37325;&#8221;&#65292;&#23545;&#27492;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03299v1 Announce Type: cross  Abstract: Researchers in many fields endeavor to estimate treatment effects by regressing outcome data (Y) on a treatment (D) and observed confounders (X). Even absent unobserved confounding, the regression coefficient on the treatment reports a weighted average of strata-specific treatment effects (Angrist, 1998). Where heterogeneous treatment effects cannot be ruled out, the resulting coefficient is thus not generally equal to the average treatment effect (ATE), and is unlikely to be the quantity of direct scientific or policy interest. The difference between the coefficient and the ATE has led researchers to propose various interpretational, bounding, and diagnostic aids (Humphreys, 2009; Aronow and Samii, 2016; Sloczynski, 2022; Chattopadhyay and Zubizarreta, 2023). We note that the linear regression of Y on D and X can be misspecified when the treatment effect is heterogeneous in X. The "weights of regression", for which we provide a new (m
&lt;/p&gt;</description></item></channel></rss>