<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#36890;&#36807;&#23545;37&#31687;&#20351;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#30340;&#25991;&#31456;&#36827;&#34892;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#26032;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#19979;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#65292;&#20294;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;</title><link>http://arxiv.org/abs/2309.15983</link><description>&lt;p&gt;
&#22914;&#20309;&#22312;&#24179;&#34892;&#36235;&#21183;&#19979;&#36827;&#34892;&#22240;&#26524;&#38754;&#26495;&#20998;&#26512;&#65306;&#19968;&#39033;&#22823;&#35268;&#27169;&#20877;&#20998;&#26512;&#30740;&#31350;&#30340;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
What To Do (and Not to Do) with Causal Panel Analysis under Parallel Trends: Lessons from A Large Reanalysis Study. (arXiv:2309.15983v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15983
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;37&#31687;&#20351;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#30340;&#25991;&#31456;&#36827;&#34892;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#26032;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#19979;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#65292;&#20294;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#22312;&#25919;&#27835;&#31185;&#23398;&#20013;&#30340;&#22240;&#26524;&#38754;&#26495;&#20998;&#26512;&#20013;&#26222;&#36941;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#26041;&#27861;&#35770;&#35752;&#35770;&#25361;&#25112;&#20102;&#20854;&#22312;&#23384;&#22312;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#21644;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#24773;&#20917;&#19979;&#30340;&#26377;&#25928;&#24615;&#12290;&#36825;&#19968;&#26032;&#20852;&#30340;&#25991;&#29486;&#24341;&#20837;&#20102;&#22810;&#20010;&#20272;&#35745;&#22120;&#21644;&#35786;&#26029;&#26041;&#27861;&#65292;&#23548;&#33268;&#23454;&#35777;&#30740;&#31350;&#20154;&#21592;&#22312;&#20004;&#20010;&#26041;&#38754;&#20135;&#29983;&#20102;&#22256;&#24785;&#65306;&#22522;&#20110;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#29616;&#26377;&#32467;&#26524;&#30340;&#21487;&#38752;&#24615;&#21644;&#30446;&#21069;&#30340;&#26368;&#20339;&#23454;&#36341;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#32771;&#23519;&#12289;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#20102;&#19977;&#20010;&#39046;&#20808;&#25919;&#27835;&#31185;&#23398;&#26399;&#21002;&#19978;&#20849;37&#31687;&#36816;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#21644;&#20108;&#20803;&#27835;&#30103;&#30340;&#25991;&#31456;&#12290;&#20351;&#29992;&#20845;&#31181;&#26032;&#24341;&#20837;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#65292;&#25105;&#20204;&#21457;&#29616;&#23613;&#31649;&#31934;&#30830;&#24615;&#21487;&#33021;&#21463;&#21040;&#24433;&#21709;&#65292;&#20294;&#22522;&#20110;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#20272;&#35745;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#20445;&#25345;&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Two-way fixed effects (TWFE) models are ubiquitous in causal panel analysis in political science. However, recent methodological discussions challenge their validity in the presence of heterogeneous treatment effects (HTE) and violations of the parallel trends assumption (PTA). This burgeoning literature has introduced multiple estimators and diagnostics, leading to confusion among empirical researchers on two fronts: the reliability of existing results based on TWFE models and the current best practices. To address these concerns, we examined, replicated, and reanalyzed 37 articles from three leading political science journals that employed observational panel data with binary treatments. Using six newly introduced HTE-robust estimators, we find that although precision may be affected, the core conclusions derived from TWFE estimates largely remain unchanged. PTA violations and insufficient statistical power, however, continue to be significant obstacles to credible inferences. Based 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#32508;&#36848;&#65292;&#20197;&#35299;&#20915;&#21307;&#23398;&#39046;&#22495;&#20013;&#25968;&#25454;&#20351;&#29992;&#21644;&#38544;&#31169;&#20445;&#25252;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.12380</link><description>&lt;p&gt;
&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#65306;&#19968;&#39033;&#31995;&#32479;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Methods for generating and evaluating synthetic longitudinal patient data: a systematic review. (arXiv:2309.12380v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12380
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#32508;&#36848;&#65292;&#20197;&#35299;&#20915;&#21307;&#23398;&#39046;&#22495;&#20013;&#25968;&#25454;&#20351;&#29992;&#21644;&#38544;&#31169;&#20445;&#25252;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#25968;&#25454;&#30340;&#36805;&#29467;&#22686;&#38271;&#20419;&#36827;&#20102;&#21508;&#31181;&#32479;&#35745;&#21644;&#28145;&#24230;&#23398;&#20064;&#25216;&#26415;&#30340;&#21457;&#23637;&#21644;&#24212;&#29992;&#65292;&#21152;&#24555;&#20102;&#30740;&#31350;&#21644;&#24320;&#21457;&#27963;&#21160;&#12290;&#28982;&#32780;&#65292;&#24182;&#38750;&#25152;&#26377;&#34892;&#19994;&#37117;&#33021;&#20174;&#25968;&#25454;&#30340;&#22686;&#21152;&#20013;&#21516;&#31561;&#21463;&#30410;&#65292;&#37096;&#20998;&#21407;&#22240;&#26159;&#30001;&#20110;&#25968;&#25454;&#20351;&#29992;&#21644;&#38544;&#31169;&#35268;&#23450;&#30340;&#27861;&#24459;&#38480;&#21046;&#65292;&#20363;&#22914;&#21307;&#23398;&#39046;&#22495;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21508;&#31181;&#32479;&#35745;&#25259;&#38706;&#21644;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#65292;&#21253;&#25324;&#20351;&#29992;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#12290;&#21512;&#25104;&#25968;&#25454;&#26159;&#22522;&#20110;&#19968;&#20123;&#29616;&#26377;&#25968;&#25454;&#29983;&#25104;&#30340;&#65292;&#30446;&#30340;&#26159;&#23613;&#21487;&#33021;&#22320;&#22797;&#21046;&#23427;&#20204;&#65292;&#24182;&#20805;&#24403;&#30495;&#23454;&#25935;&#24863;&#25968;&#25454;&#30340;&#20195;&#29702;&#12290;&#26412;&#25991;&#23545;&#29983;&#25104;&#21644;&#35780;&#20272;&#21512;&#25104;&#32437;&#21521;&#24739;&#32773;&#25968;&#25454;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#31995;&#32479;&#32508;&#36848;&#65292;&#36825;&#26159;&#21307;&#23398;&#39046;&#22495;&#20013;&#19968;&#31181;&#24120;&#35265;&#30340;&#25968;&#25454;&#31867;&#22411;&#12290;&#35813;&#32508;&#36848;&#36981;&#24490;PRISMA&#25351;&#21335;&#65292;&#24182;&#28085;&#30422;&#20102;&#33258;2022&#24180;&#24213;&#20197;&#26469;&#30340;&#20116;&#20010;&#25968;&#25454;&#24211;&#30340;&#25991;&#29486;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;17&#31181;&#26041;&#27861;&#65292;&#20174;&#20256;&#32479;&#26041;&#27861;&#21040;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The proliferation of data in recent years has led to the advancement and utilization of various statistical and deep learning techniques, thus expediting research and development activities. However, not all industries have benefited equally from the surge in data availability, partly due to legal restrictions on data usage and privacy regulations, such as in medicine. To address this issue, various statistical disclosure and privacy-preserving methods have been proposed, including the use of synthetic data generation. Synthetic data are generated based on some existing data, with the aim of replicating them as closely as possible and acting as a proxy for real sensitive data. This paper presents a systematic review of methods for generating and evaluating synthetic longitudinal patient data, a prevalent data type in medicine. The review adheres to the PRISMA guidelines and covers literature from five databases until the end of 2022. The paper describes 17 methods, ranging from traditi
&lt;/p&gt;</description></item></channel></rss>