<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#32500;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#30340;&#20998;&#21306;&#32463;&#39564;Bayes ECM&#31639;&#27861;&#65292;&#20855;&#26377;&#24555;&#36895;&#21487;&#25193;&#23637;&#30340;&#35745;&#31639;&#33021;&#21147;&#21644;&#26356;&#39640;&#30340;&#28789;&#27963;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.12285</link><description>&lt;p&gt;
&#31232;&#30095;&#39640;&#32500;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#30340;&#20998;&#21306;&#32463;&#39564;Bayes ECM&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Sparse high-dimensional linear mixed modeling with a partitioned empirical Bayes ECM algorithm. (arXiv:2310.12285v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12285
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#32500;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#30340;&#20998;&#21306;&#32463;&#39564;Bayes ECM&#31639;&#27861;&#65292;&#20855;&#26377;&#24555;&#36895;&#21487;&#25193;&#23637;&#30340;&#35745;&#31639;&#33021;&#21147;&#21644;&#26356;&#39640;&#30340;&#28789;&#27963;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#32500;&#32437;&#21521;&#25968;&#25454;&#22312;&#21508;&#31181;&#31185;&#23398;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;&#26085;&#30410;&#22686;&#22810;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#39640;&#32500;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;(LMMs)&#65292;&#30446;&#21069;&#21482;&#26377;&#23569;&#25968;&#32479;&#35745;&#26041;&#27861;&#21487;&#29992;&#65292;&#22240;&#20026;&#22823;&#22810;&#25968;&#36125;&#21494;&#26031;&#21464;&#37327;&#36873;&#25321;&#25110;&#32602;&#20989;&#25968;&#26041;&#27861;&#26159;&#38024;&#23545;&#29420;&#31435;&#35266;&#27979;&#35774;&#35745;&#30340;&#12290;&#27492;&#22806;&#65292;&#30446;&#21069;&#23569;&#25968;&#21487;&#29992;&#30340;&#39640;&#32500;LMMs&#36719;&#20214;&#21253;&#23384;&#22312;&#21487;&#25193;&#23637;&#24615;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#20934;&#30830;&#30340;&#39640;&#32500;LMMs&#36125;&#21494;&#26031;&#26694;&#26550;&#12290;&#25105;&#20204;&#20351;&#29992;&#32463;&#39564;Bayes&#20272;&#35745;&#22120;&#30340;&#36229;&#21442;&#25968;&#26469;&#22686;&#21152;&#28789;&#27963;&#24615;&#65292;&#24182;&#20351;&#29992;Expectation-Conditional-Minimization (ECM)&#31639;&#27861;&#26469;&#35745;&#31639;&#21442;&#25968;&#30340;&#26368;&#22823;&#21518;&#39564;&#27010;&#29575;(MAP)&#20272;&#35745;&#65292;&#20174;&#32780;&#23454;&#29616;&#39640;&#25928;&#30340;&#35745;&#31639;&#12290;&#36825;&#31181;&#26041;&#27861;&#30340;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#20854;&#20998;&#21306;&#21644;&#21442;&#25968;&#25193;&#23637;&#65292;&#20197;&#21450;&#20854;&#24555;&#36895;&#21644;&#21487;&#25193;&#23637;&#30340;&#35745;&#31639;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#20013;&#30340;&#22266;&#23450;&#25928;&#24212;&#21644;&#38543;&#26426;&#25928;&#24212;&#20272;&#35745;&#23637;&#31034;&#20102;&#32447;&#24615;&#28151;&#21512;&#27169;&#22411;&#32467;&#21512;&#20998;&#21306;&#32463;&#39564;Bayes ECM (LMM-PROBE)&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
High-dimensional longitudinal data is increasingly used in a wide range of scientific studies. However, there are few statistical methods for high-dimensional linear mixed models (LMMs), as most Bayesian variable selection or penalization methods are designed for independent observations. Additionally, the few available software packages for high-dimensional LMMs suffer from scalability issues. This work presents an efficient and accurate Bayesian framework for high-dimensional LMMs. We use empirical Bayes estimators of hyperparameters for increased flexibility and an Expectation-Conditional-Minimization (ECM) algorithm for computationally efficient maximum a posteriori probability (MAP) estimation of parameters. The novelty of the approach lies in its partitioning and parameter expansion as well as its fast and scalable computation. We illustrate Linear Mixed Modeling with PaRtitiOned empirical Bayes ECM (LMM-PROBE) in simulation studies evaluating fixed and random effects estimation 
&lt;/p&gt;</description></item></channel></rss>