<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#36890;&#36807;&#23558;&#24635;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#20998;&#35299;&#65292;&#23558;&#22797;&#26434;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.04131</link><description>&lt;p&gt;
&#20174;&#24322;&#36136;&#25928;&#24212;&#20013;&#25552;&#21462;&#26426;&#21046;&#65306;&#20013;&#20171;&#20998;&#26512;&#30340;&#35782;&#21035;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Extract Mechanisms from Heterogeneous Effects: Identification Strategy for Mediation Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04131
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#36890;&#36807;&#23558;&#24635;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#20998;&#35299;&#65292;&#23558;&#22797;&#26434;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#22240;&#26524;&#26426;&#21046;&#23545;&#20110;&#35299;&#37322;&#21644;&#27010;&#25324;&#32463;&#39564;&#29616;&#35937;&#33267;&#20851;&#37325;&#35201;&#12290;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#25552;&#20379;&#20102;&#37327;&#21270;&#20013;&#20171;&#25928;&#24212;&#30340;&#32479;&#35745;&#25216;&#26415;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#36890;&#24120;&#38656;&#35201;&#24378;&#22823;&#30340;&#35782;&#21035;&#20551;&#35774;&#25110;&#22797;&#26434;&#30340;&#30740;&#31350;&#35774;&#35745;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#31616;&#21270;&#20102;&#36825;&#20123;&#20551;&#35774;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#12290;&#35813;&#31574;&#30053;&#22522;&#20110;&#24635;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#22411;&#20998;&#35299;&#65292;&#23558;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#12290;&#26032;&#26041;&#27861;&#24314;&#31435;&#20102;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#26032;&#32852;&#31995;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20960;&#31181;&#30740;&#31350;&#35774;&#35745;&#21644;&#20272;&#35745;&#22120;&#65292;&#20197;&#22686;&#21152;&#25105;&#20204;&#30340;&#35782;&#21035;&#31574;&#30053;&#22312;&#21508;&#31181;&#23454;&#35777;&#30740;&#31350;&#20013;&#30340;&#21487;&#29992;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#23454;&#39564;&#20013;&#20272;&#35745;&#22240;&#26524;&#20013;&#20171;&#25928;&#24212;&#26469;&#28436;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04131v1 Announce Type: cross  Abstract: Understanding causal mechanisms is essential for explaining and generalizing empirical phenomena. Causal mediation analysis offers statistical techniques to quantify mediation effects. However, existing methods typically require strong identification assumptions or sophisticated research designs. We develop a new identification strategy that simplifies these assumptions, enabling the simultaneous estimation of causal and mediation effects. The strategy is based on a novel decomposition of total treatment effects, which transforms the challenging mediation problem into a simple linear regression problem. The new method establishes a new link between causal mediation and causal moderation. We discuss several research designs and estimators to increase the usability of our identification strategy for a variety of empirical studies. We demonstrate the application of our method by estimating the causal mediation effect in experiments concer
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#35843;&#26597;&#39044;&#27979;&#27169;&#22411;&#30340;&#37096;&#32626;&#23545;&#20915;&#31574;&#20135;&#29983;&#26377;&#23475;&#24433;&#21709;&#30340;&#24773;&#20917;&#65292;&#21457;&#29616;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20250;&#25104;&#20026;&#26377;&#23475;&#30340;&#33258;&#25105;&#23454;&#29616;&#39044;&#35328;&#12290;&#36825;&#20123;&#27169;&#22411;&#19981;&#20250;&#22240;&#20026;&#23545;&#26576;&#20123;&#24739;&#32773;&#36896;&#25104;&#26356;&#31967;&#31957;&#30340;&#32467;&#26524;&#32780;&#20351;&#20854;&#39044;&#27979;&#33021;&#21147;&#21464;&#26080;&#25928;&#12290;</title><link>https://arxiv.org/abs/2312.01210</link><description>&lt;p&gt;
&#24403;&#20934;&#30830;&#30340;&#39044;&#27979;&#27169;&#22411;&#23548;&#33268;&#26377;&#23475;&#30340;&#33258;&#25105;&#23454;&#29616;&#39044;&#35328;
&lt;/p&gt;
&lt;p&gt;
When accurate prediction models yield harmful self-fulfilling prophecies
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.01210
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#35843;&#26597;&#39044;&#27979;&#27169;&#22411;&#30340;&#37096;&#32626;&#23545;&#20915;&#31574;&#20135;&#29983;&#26377;&#23475;&#24433;&#21709;&#30340;&#24773;&#20917;&#65292;&#21457;&#29616;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20250;&#25104;&#20026;&#26377;&#23475;&#30340;&#33258;&#25105;&#23454;&#29616;&#39044;&#35328;&#12290;&#36825;&#20123;&#27169;&#22411;&#19981;&#20250;&#22240;&#20026;&#23545;&#26576;&#20123;&#24739;&#32773;&#36896;&#25104;&#26356;&#31967;&#31957;&#30340;&#32467;&#26524;&#32780;&#20351;&#20854;&#39044;&#27979;&#33021;&#21147;&#21464;&#26080;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#26631;&#65306;&#39044;&#27979;&#27169;&#22411;&#22312;&#21307;&#23398;&#30740;&#31350;&#21644;&#23454;&#36341;&#20013;&#38750;&#24120;&#21463;&#27426;&#36814;&#12290;&#36890;&#36807;&#20026;&#29305;&#23450;&#24739;&#32773;&#39044;&#27979;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#65292;&#36825;&#20123;&#27169;&#22411;&#21487;&#20197;&#24110;&#21161;&#20915;&#31574;&#22256;&#38590;&#30340;&#27835;&#30103;&#20915;&#31574;&#65292;&#24182;&#19988;&#36890;&#24120;&#34987;&#35465;&#20026;&#20010;&#24615;&#21270;&#30340;&#12289;&#25968;&#25454;&#39537;&#21160;&#30340;&#21307;&#30103;&#20445;&#20581;&#30340;&#26480;&#20986;&#20195;&#34920;&#12290;&#35768;&#22810;&#39044;&#27979;&#27169;&#22411;&#22312;&#39564;&#35777;&#30740;&#31350;&#20013;&#22522;&#20110;&#20854;&#39044;&#27979;&#20934;&#30830;&#24615;&#32780;&#37096;&#32626;&#29992;&#20110;&#20915;&#31574;&#25903;&#25345;&#12290;&#25105;&#20204;&#35843;&#26597;&#36825;&#26159;&#21542;&#26159;&#19968;&#31181;&#23433;&#20840;&#21644;&#26377;&#25928;&#30340;&#26041;&#27861;&#12290;&#26448;&#26009;&#21644;&#26041;&#27861;&#65306;&#25105;&#20204;&#23637;&#31034;&#20102;&#20351;&#29992;&#39044;&#27979;&#27169;&#22411;&#36827;&#34892;&#20915;&#31574;&#21487;&#20197;&#23548;&#33268;&#26377;&#23475;&#30340;&#20915;&#31574;&#65292;&#21363;&#20351;&#22312;&#37096;&#32626;&#21518;&#36825;&#20123;&#39044;&#27979;&#34920;&#29616;&#20986;&#33391;&#22909;&#30340;&#21306;&#20998;&#24230;&#12290;&#36825;&#20123;&#27169;&#22411;&#26159;&#26377;&#23475;&#30340;&#33258;&#25105;&#23454;&#29616;&#39044;&#35328;&#65306;&#23427;&#20204;&#30340;&#37096;&#32626;&#25439;&#23475;&#20102;&#19968;&#32676;&#24739;&#32773;&#65292;&#20294;&#36825;&#20123;&#24739;&#32773;&#30340;&#26356;&#31967;&#31957;&#30340;&#32467;&#26524;&#24182;&#19981;&#20351;&#27169;&#22411;&#30340;&#39044;&#27979;&#33021;&#21147;&#26080;&#25928;&#12290;&#32467;&#26524;&#65306;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#23545;&#36825;&#20123;&#39044;&#27979;&#27169;&#22411;&#38598;&#21512;&#30340;&#24418;&#24335;&#21270;&#25551;&#36848;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#37096;&#32626;&#21069;&#21518;&#37117;&#36827;&#34892;&#20102;&#33391;&#22909;&#26657;&#20934;&#30340;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Objective: Prediction models are popular in medical research and practice. By predicting an outcome of interest for specific patients, these models may help inform difficult treatment decisions, and are often hailed as the poster children for personalized, data-driven healthcare. Many prediction models are deployed for decision support based on their prediction accuracy in validation studies. We investigate whether this is a safe and valid approach.   Materials and Methods: We show that using prediction models for decision making can lead to harmful decisions, even when the predictions exhibit good discrimination after deployment. These models are harmful self-fulfilling prophecies: their deployment harms a group of patients but the worse outcome of these patients does not invalidate the predictive power of the model.   Results: Our main result is a formal characterization of a set of such prediction models. Next we show that models that are well calibrated before and after deployment 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;Rashomon Set of Optimal Trees (ROOT)&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#30340;&#23569;&#25968;&#20154;&#32676;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#25552;&#20379;&#26356;&#31934;&#30830;&#21644;&#21487;&#35299;&#37322;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.14512</link><description>&lt;p&gt;
&#25105;&#20204;&#38169;&#36807;&#20102;&#35841;&#65311;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#25581;&#31034;&#23569;&#25968;&#20154;&#32676;&#29305;&#24449;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Who Are We Missing? A Principled Approach to Characterizing the Underrepresented Population. (arXiv:2401.14512v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;Rashomon Set of Optimal Trees (ROOT)&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#25551;&#36848;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#30340;&#23569;&#25968;&#20154;&#32676;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#25552;&#20379;&#26356;&#31934;&#30830;&#21644;&#21487;&#35299;&#37322;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26356;&#39640;&#30340;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#22312;&#29702;&#35299;&#22240;&#26524;&#25928;&#24212;&#26041;&#38754;&#36215;&#21040;&#20102;&#20851;&#38190;&#20316;&#29992;&#65292;&#28982;&#32780;&#23558;&#25512;&#35770;&#25193;&#23637;&#21040;&#30446;&#26631;&#20154;&#32676;&#26102;&#38754;&#20020;&#25928;&#24212;&#24322;&#36136;&#24615;&#21644;&#20195;&#34920;&#24615;&#19981;&#36275;&#30340;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#35770;&#25991;&#35299;&#20915;&#20102;&#22312;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#35782;&#21035;&#21644;&#25551;&#36848;&#23569;&#25968;&#20154;&#32676;&#30340;&#20851;&#38190;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#25913;&#36827;&#30446;&#26631;&#20154;&#32676;&#20197;&#25552;&#21319;&#26222;&#36866;&#24615;&#30340;&#21019;&#26032;&#26694;&#26550;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#8212;&#8212;Rashomon Set of Optimal Trees (ROOT)&#65292;&#26469;&#25551;&#36848;&#23569;&#25968;&#20154;&#32676;&#12290;ROOT&#36890;&#36807;&#26368;&#23567;&#21270;&#30446;&#26631;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#26041;&#24046;&#26469;&#20248;&#21270;&#30446;&#26631;&#23376;&#32676;&#20307;&#20998;&#24067;&#65292;&#20174;&#32780;&#30830;&#20445;&#26356;&#31934;&#30830;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;ROOT&#29983;&#25104;&#21487;&#35299;&#37322;&#30340;&#23569;&#25968;&#20154;&#32676;&#29305;&#24449;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#20154;&#21592;&#26377;&#25928;&#27807;&#36890;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#31934;&#24230;&#21644;&#21487;&#35299;&#37322;&#24615;&#26041;&#38754;&#30456;&#23545;&#20110;&#20854;&#20182;&#26041;&#27861;&#23637;&#29616;&#20102;&#25913;&#36827;&#65292;&#36890;&#36807;&#21512;&#25104;&#25968;&#25454;&#23454;&#39564;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Randomized controlled trials (RCTs) serve as the cornerstone for understanding causal effects, yet extending inferences to target populations presents challenges due to effect heterogeneity and underrepresentation. Our paper addresses the critical issue of identifying and characterizing underrepresented subgroups in RCTs, proposing a novel framework for refining target populations to improve generalizability. We introduce an optimization-based approach, Rashomon Set of Optimal Trees (ROOT), to characterize underrepresented groups. ROOT optimizes the target subpopulation distribution by minimizing the variance of the target average treatment effect estimate, ensuring more precise treatment effect estimations. Notably, ROOT generates interpretable characteristics of the underrepresented population, aiding researchers in effective communication. Our approach demonstrates improved precision and interpretability compared to alternatives, as illustrated with synthetic data experiments. We ap
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25193;&#23637;&#20102;ICP&#21407;&#21017;&#65292;&#32771;&#34385;&#20102;&#22312;&#19981;&#21516;&#29615;&#22659;&#19979;&#20855;&#26377;&#23616;&#37096;&#32447;&#24615;&#27169;&#22411;&#30340;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#20219;&#21153;&#12290;&#36890;&#36807;&#25552;&#20379;&#22240;&#26524;&#29238;&#33410;&#28857;&#30340;&#21487;&#36776;&#35782;&#24615;&#26465;&#20214;&#21644;&#24341;&#20837;LoLICaP&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#35266;&#23519;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#22240;&#26524;&#29238;&#33410;&#28857;&#12290;</title><link>http://arxiv.org/abs/2401.05218</link><description>&lt;p&gt;
&#20855;&#26377;&#23616;&#37096;&#32447;&#24615;&#27169;&#22411;&#30340;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Invariant Causal Prediction with Locally Linear Models. (arXiv:2401.05218v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05218
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25193;&#23637;&#20102;ICP&#21407;&#21017;&#65292;&#32771;&#34385;&#20102;&#22312;&#19981;&#21516;&#29615;&#22659;&#19979;&#20855;&#26377;&#23616;&#37096;&#32447;&#24615;&#27169;&#22411;&#30340;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#20219;&#21153;&#12290;&#36890;&#36807;&#25552;&#20379;&#22240;&#26524;&#29238;&#33410;&#28857;&#30340;&#21487;&#36776;&#35782;&#24615;&#26465;&#20214;&#21644;&#24341;&#20837;LoLICaP&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#22312;&#35266;&#23519;&#25968;&#25454;&#20013;&#35782;&#21035;&#30446;&#26631;&#21464;&#37327;&#30340;&#22240;&#26524;&#29238;&#33410;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#36890;&#36807;&#35266;&#23519;&#25968;&#25454;&#65292;&#20174;&#19968;&#32452;&#20505;&#36873;&#21464;&#37327;&#20013;&#35782;&#21035;&#20986;&#30446;&#26631;&#21464;&#37327;&#30340;&#22240;&#26524;&#29238;&#33410;&#28857;&#30340;&#20219;&#21153;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#20551;&#35774;&#26159;&#20505;&#36873;&#21464;&#37327;&#22312;&#19981;&#21516;&#30340;&#29615;&#22659;&#20013;&#34987;&#35266;&#23519;&#21040;&#65292;&#36825;&#20123;&#29615;&#22659;&#21487;&#20197;&#23545;&#24212;&#20110;&#26426;&#22120;&#30340;&#19981;&#21516;&#35774;&#32622;&#25110;&#32773;&#21160;&#24577;&#36807;&#31243;&#20013;&#30340;&#19981;&#21516;&#26102;&#38388;&#38388;&#38548;&#31561;&#12290;&#22312;&#19968;&#23450;&#30340;&#20551;&#35774;&#26465;&#20214;&#19979;&#65292;&#19981;&#21516;&#30340;&#29615;&#22659;&#21487;&#20197;&#34987;&#35270;&#20026;&#23545;&#35266;&#23519;&#31995;&#32479;&#30340;&#24178;&#39044;&#12290;&#25105;&#20204;&#20551;&#35774;&#30446;&#26631;&#21464;&#37327;&#21644;&#21327;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#32447;&#24615;&#20851;&#31995;&#65292;&#22312;&#27599;&#20010;&#29615;&#22659;&#19979;&#21487;&#33021;&#19981;&#21516;&#65292;&#20294;&#22240;&#26524;&#32467;&#26500;&#22312;&#19981;&#21516;&#29615;&#22659;&#20013;&#26159;&#19981;&#21464;&#30340;&#12290;&#36825;&#26159;Peters&#31561;&#20154;[2016]&#25552;&#20986;&#30340;ICP&#65288;&#19981;&#21464;&#22240;&#26524;&#39044;&#27979;&#65289;&#21407;&#21017;&#30340;&#25193;&#23637;&#65292;&#21518;&#32773;&#20551;&#35774;&#25152;&#26377;&#29615;&#22659;&#19979;&#23384;&#22312;&#19968;&#20010;&#22266;&#23450;&#30340;&#32447;&#24615;&#20851;&#31995;&#12290;&#22312;&#25105;&#20204;&#25552;&#20986;&#30340;&#35774;&#32622;&#19979;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#22240;&#26524;&#29238;&#33410;&#28857;&#21487;&#36776;&#35782;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#21517;&#20026;LoLICaP&#30340;&#23454;&#29992;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the task of identifying the causal parents of a target variable among a set of candidate variables from observational data. Our main assumption is that the candidate variables are observed in different environments which may, for example, correspond to different settings of a machine or different time intervals in a dynamical process. Under certain assumptions different environments can be regarded as interventions on the observed system. We assume a linear relationship between target and covariates, which can be different in each environment with the only restriction that the causal structure is invariant across environments. This is an extension of the ICP ($\textbf{I}$nvariant $\textbf{C}$ausal $\textbf{P}$rediction) principle by Peters et al. [2016], who assumed a fixed linear relationship across all environments. Within our proposed setting we provide sufficient conditions for identifiability of the causal parents and introduce a practical method called LoLICaP ($\text
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#65292;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;</title><link>http://arxiv.org/abs/2307.15181</link><description>&lt;p&gt;
&#20851;&#20110;&#32454;&#20998;&#23454;&#39564;&#25928;&#29575;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Efficiency of Finely Stratified Experiments. (arXiv:2307.15181v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#65292;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#12290;&#22312;&#36825;&#37324;&#65292;&#25928;&#29575;&#26159;&#25351;&#23545;&#20110;&#19968;&#31867;&#24191;&#27867;&#30340;&#22788;&#29702;&#20998;&#37197;&#26041;&#26696;&#32780;&#35328;&#30340;&#65292;&#20854;&#20013;&#20219;&#20309;&#21333;&#20301;&#34987;&#20998;&#37197;&#21040;&#22788;&#29702;&#30340;&#36793;&#38469;&#27010;&#29575;&#31561;&#20110;&#39044;&#20808;&#25351;&#23450;&#30340;&#20540;&#65292;&#20363;&#22914;&#19968;&#21322;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#19981;&#35201;&#27714;&#22788;&#29702;&#29366;&#24577;&#26159;&#20197;i.i.d.&#30340;&#26041;&#24335;&#20998;&#37197;&#30340;&#65292;&#22240;&#27492;&#21487;&#20197;&#36866;&#24212;&#23454;&#36341;&#20013;&#20351;&#29992;&#30340;&#22797;&#26434;&#22788;&#29702;&#20998;&#37197;&#26041;&#26696;&#65292;&#22914;&#20998;&#23618;&#38543;&#26426;&#21270;&#21644;&#21305;&#37197;&#23545;&#12290;&#25152;&#32771;&#34385;&#30340;&#21442;&#25968;&#31867;&#21035;&#26159;&#21487;&#20197;&#34920;&#31034;&#20026;&#24050;&#30693;&#35266;&#27979;&#25968;&#25454;&#30340;&#19968;&#20010;&#24050;&#30693;&#20989;&#25968;&#30340;&#26399;&#26395;&#30340;&#32422;&#26463;&#30340;&#35299;&#30340;&#37027;&#20123;&#21442;&#25968;&#65292;&#20854;&#20013;&#21487;&#33021;&#21253;&#25324;&#22788;&#29702;&#20998;&#37197;&#36793;&#38469;&#27010;&#29575;&#30340;&#39044;&#20808;&#25351;&#23450;&#20540;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31867;&#21442;&#25968;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the efficient estimation of a large class of treatment effect parameters that arise in the analysis of experiments. Here, efficiency is understood to be with respect to a broad class of treatment assignment schemes for which the marginal probability that any unit is assigned to treatment equals a pre-specified value, e.g., one half. Importantly, we do not require that treatment status is assigned in an i.i.d. fashion, thereby accommodating complicated treatment assignment schemes that are used in practice, such as stratified block randomization and matched pairs. The class of parameters considered are those that can be expressed as the solution to a restriction on the expectation of a known function of the observed data, including possibly the pre-specified value for the marginal probability of treatment assignment. We show that this class of parameters includes, among other things, average treatment effects, quantile treatment effects, local average treatment effect
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#21033;&#29992;&#20854;&#29702;&#35770;&#22522;&#30784;&#21644;&#23454;&#26045;&#30340;&#21487;&#34892;&#24615;&#65292;&#20174;&#32780;&#20272;&#35745;&#36830;&#32493;&#26292;&#38706;/&#27835;&#30103;&#30340;&#20998;&#24067;&#23545;&#25919;&#31574;&#30456;&#20851;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#23558;&#27492;&#26041;&#27861;&#24212;&#29992;&#20110;&#21253;&#21547;6800&#19975;&#20010;&#20010;&#20307;&#21644;2700&#19975;&#20010;&#32654;&#22269;&#22659;&#20869;&#27515;&#20129;&#20107;&#20214;&#30340;&#25968;&#25454;&#20013;&#65292;&#36890;&#36807;&#35780;&#20272;&#32654;&#22269;&#22269;&#23478;&#29615;&#22659;&#20445;&#25252;&#23616;&#65288;EPA&#65289;&#23545;PM2.5&#30340;&#22269;&#23478;&#29615;&#22659;&#31354;&#27668;&#36136;&#37327;&#26631;&#20934;&#65288;NAAQS&#65289;&#36827;&#34892;&#20462;&#35746;&#21518;&#30340;&#20581;&#24247;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2302.02560</link><description>&lt;p&gt;
&#31070;&#32463;&#32593;&#32476;&#22312;&#22240;&#26524;&#20272;&#35745;&#20013;&#30340;&#24212;&#29992;: &#22312;&#32654;&#22269;&#35780;&#20272;&#26356;&#20005;&#26684;&#30340;&#31354;&#27668;&#36136;&#37327;&#26631;&#20934;&#30340;&#20581;&#24247;&#25928;&#30410;
&lt;/p&gt;
&lt;p&gt;
Causal Estimation of Exposure Shifts with Neural Networks: Evaluating the Health Benefits of Stricter Air Quality Standards in the US. (arXiv:2302.02560v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.02560
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#21033;&#29992;&#20854;&#29702;&#35770;&#22522;&#30784;&#21644;&#23454;&#26045;&#30340;&#21487;&#34892;&#24615;&#65292;&#20174;&#32780;&#20272;&#35745;&#36830;&#32493;&#26292;&#38706;/&#27835;&#30103;&#30340;&#20998;&#24067;&#23545;&#25919;&#31574;&#30456;&#20851;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#23558;&#27492;&#26041;&#27861;&#24212;&#29992;&#20110;&#21253;&#21547;6800&#19975;&#20010;&#20010;&#20307;&#21644;2700&#19975;&#20010;&#32654;&#22269;&#22659;&#20869;&#27515;&#20129;&#20107;&#20214;&#30340;&#25968;&#25454;&#20013;&#65292;&#36890;&#36807;&#35780;&#20272;&#32654;&#22269;&#22269;&#23478;&#29615;&#22659;&#20445;&#25252;&#23616;&#65288;EPA&#65289;&#23545;PM2.5&#30340;&#22269;&#23478;&#29615;&#22659;&#31354;&#27668;&#36136;&#37327;&#26631;&#20934;&#65288;NAAQS&#65289;&#36827;&#34892;&#20462;&#35746;&#21518;&#30340;&#20581;&#24247;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25919;&#31574;&#30740;&#31350;&#20013;&#65292;&#20272;&#35745;&#36830;&#32493;&#24615;&#26292;&#38706;/&#27835;&#30103;&#30340;&#20998;&#24067;&#23545;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#26159;&#26368;&#20851;&#38190;&#30340;&#20998;&#26512;&#20219;&#21153;&#20043;&#19968;&#12290;&#25105;&#20204;&#31216;&#20043;&#20026;&#20559;&#31227;-&#21709;&#24212;&#20989;&#25968;&#65288;SRF&#65289;&#20272;&#35745;&#38382;&#39064;&#12290;&#29616;&#26377;&#30340;&#28041;&#21450;&#24378;&#20581;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#22120;&#30340;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#32570;&#20047;&#29702;&#35770;&#20445;&#35777;&#21644;&#23454;&#38469;&#23454;&#29616;&#65292;&#29992;&#20110;SRF&#20272;&#35745;&#12290;&#21463;&#20844;&#20849;&#21355;&#29983;&#20013;&#30340;&#20851;&#38190;&#25919;&#31574;&#38382;&#39064;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#21450;&#20854;&#29702;&#35770;&#22522;&#30784;&#65292;&#20197;&#25552;&#20379;&#20855;&#26377;&#24378;&#20581;&#24615;&#21644;&#25928;&#29575;&#20445;&#35777;&#30340;SRF&#20272;&#35745;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#21253;&#21547;6800&#19975;&#20010;&#20010;&#20307;&#21644;2700&#19975;&#20010;&#32654;&#22269;&#22659;&#20869;&#27515;&#20129;&#20107;&#20214;&#30340;&#25968;&#25454;&#20013;&#65292;&#20197;&#20272;&#35745;&#23558;&#32654;&#22269;&#22269;&#23478;&#29615;&#22659;&#20445;&#25252;&#23616;&#65288;EPA&#65289;&#26368;&#36817;&#25552;&#35758;&#20174;12 &#956;g/m&#179;&#25913;&#20026;9 &#956;g/m&#179;&#30340;PM2.5&#30340;&#32654;&#22269;&#22269;&#23478;&#29615;&#22659;&#31354;&#27668;&#36136;&#37327;&#26631;&#20934;&#65288;NAAQS&#65289;&#30340;&#20462;&#35746;&#23545;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#39318;&#27425;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
In policy research, one of the most critical analytic tasks is to estimate the causal effect of a policy-relevant shift to the distribution of a continuous exposure/treatment on an outcome of interest. We call this problem shift-response function (SRF) estimation. Existing neural network methods involving robust causal-effect estimators lack theoretical guarantees and practical implementations for SRF estimation. Motivated by a key policy-relevant question in public health, we develop a neural network method and its theoretical underpinnings to estimate SRFs with robustness and efficiency guarantees. We then apply our method to data consisting of 68 million individuals and 27 million deaths across the U.S. to estimate the causal effect from revising the US National Ambient Air Quality Standards (NAAQS) for PM 2.5 from 12 $\mu g/m^3$ to 9 $\mu g/m^3$. This change has been recently proposed by the US Environmental Protection Agency (EPA). Our goal is to estimate, for the first time, the 
&lt;/p&gt;</description></item></channel></rss>