<rss version="2.0"><channel><title>Chat Arxiv stat.ME</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for stat.ME</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#35299;&#20915;&#22312;&#32447;&#32852;&#21512;&#32452;&#21512;&#24211;&#23384;&#20248;&#21270;&#38382;&#39064;&#65292;&#33021;&#22815;&#22312;&#24179;&#34913;&#25506;&#32034;&#19982;&#24320;&#21457;&#30340;&#25514;&#26045;&#19979;&#23454;&#29616;&#26368;&#22823;&#21270;&#39044;&#26399;&#24635;&#21033;&#28070;&#65292;&#24182;&#20026;&#35813;&#31639;&#27861;&#24314;&#31435;&#20102;&#36951;&#25022;&#19978;&#30028;&#12290;</title><link>http://arxiv.org/abs/2304.02022</link><description>&lt;p&gt;
&#22522;&#20110;MNL&#36873;&#25321;&#27169;&#22411;&#30340;&#22312;&#32447;&#32852;&#21512;&#32452;&#21512;&#24211;&#23384;&#20248;&#21270;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Online Joint Assortment-Inventory Optimization under MNL Choices. (arXiv:2304.02022v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02022
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#35299;&#20915;&#22312;&#32447;&#32852;&#21512;&#32452;&#21512;&#24211;&#23384;&#20248;&#21270;&#38382;&#39064;&#65292;&#33021;&#22815;&#22312;&#24179;&#34913;&#25506;&#32034;&#19982;&#24320;&#21457;&#30340;&#25514;&#26045;&#19979;&#23454;&#29616;&#26368;&#22823;&#21270;&#39044;&#26399;&#24635;&#21033;&#28070;&#65292;&#24182;&#20026;&#35813;&#31639;&#27861;&#24314;&#31435;&#20102;&#36951;&#25022;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#22312;&#32447;&#32852;&#21512;&#32452;&#21512;&#24211;&#23384;&#20248;&#21270;&#38382;&#39064;&#65292;&#22312;&#35813;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#20551;&#35774;&#27599;&#20010;&#39038;&#23458;&#30340;&#36873;&#25321;&#34892;&#20026;&#37117;&#36981;&#24490;Multinomial Logit&#65288;MNL&#65289;&#36873;&#25321;&#27169;&#22411;&#65292;&#21560;&#24341;&#21147;&#21442;&#25968;&#26159;&#20808;&#39564;&#26410;&#30693;&#30340;&#12290;&#38646;&#21806;&#21830;&#36827;&#34892;&#21608;&#26399;&#24615;&#32452;&#21512;&#21644;&#24211;&#23384;&#20915;&#31574;&#65292;&#20197;&#21160;&#24577;&#22320;&#20174;&#23454;&#29616;&#30340;&#38656;&#27714;&#20013;&#23398;&#20064;&#21560;&#24341;&#21147;&#21442;&#25968;&#65292;&#21516;&#26102;&#22312;&#26102;&#38388;&#19978;&#26368;&#22823;&#21270;&#39044;&#26399;&#30340;&#24635;&#21033;&#28070;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#31639;&#27861;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#24179;&#34913;&#32452;&#21512;&#21644;&#24211;&#23384;&#22312;&#32447;&#20915;&#31574;&#20013;&#30340;&#25506;&#32034;&#21644;&#24320;&#21457;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#24314;&#31435;&#22312;&#19968;&#20010;&#26032;&#30340;MNL&#21560;&#24341;&#21147;&#21442;&#25968;&#20272;&#35745;&#22120;&#65292;&#19968;&#31181;&#36890;&#36807;&#33258;&#36866;&#24212;&#35843;&#25972;&#26576;&#20123;&#24050;&#30693;&#21644;&#26410;&#30693;&#21442;&#25968;&#26469;&#28608;&#21169;&#25506;&#32034;&#30340;&#26032;&#26041;&#27861;&#65292;&#20197;&#21450;&#19968;&#20010;&#29992;&#20110;&#38745;&#24577;&#21333;&#21608;&#26399;&#32452;&#21512;&#24211;&#23384;&#35268;&#21010;&#38382;&#39064;&#30340;&#20248;&#21270;oracle&#22522;&#30784;&#20043;&#19978;&#12290;&#25105;&#20204;&#20026;&#25105;&#20204;&#30340;&#31639;&#27861;&#24314;&#31435;&#20102;&#36951;&#25022;&#19978;&#30028;&#65292;&#20197;&#21450;&#20851;&#20110;&#22312;&#32447;&#32852;&#21512;&#32452;&#21512;&#24211;&#23384;&#20248;&#21270;&#38382;&#39064;&#30340;&#19979;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study an online joint assortment-inventory optimization problem, in which we assume that the choice behavior of each customer follows the Multinomial Logit (MNL) choice model, and the attraction parameters are unknown a priori. The retailer makes periodic assortment and inventory decisions to dynamically learn from the realized demands about the attraction parameters while maximizing the expected total profit over time. In this paper, we propose a novel algorithm that can effectively balance the exploration and exploitation in the online decision-making of assortment and inventory. Our algorithm builds on a new estimator for the MNL attraction parameters, a novel approach to incentivize exploration by adaptively tuning certain known and unknown parameters, and an optimization oracle to static single-cycle assortment-inventory planning problems with given parameters. We establish a regret upper bound for our algorithm and a lower bound for the online joint assortment-inventory optimi
&lt;/p&gt;</description></item></channel></rss>